{
  "post content": "My wife and I have been married for 3 years now, all though our dating phase and our marriage we have both agreed that we wanted children just not right now.\n\nI am expected to make partner in 2 years at my firm and we’ve said that once that happened we would start our family as the hours and money would be much better. It would allow me to be a better father to our children. As my current role has me working late hours and traveling. Being partner will afford me to not travel, I understand I will still being doing long hours but I will be able to delegate a lot more.\n\nMy wife is on the pill and that suits us both. Recently we had a scare, a second scare within a 6 month period. The first scare she just said that she made a mistake but all was good and it came back negative, I was very much relieved as I thought she would be. My wife looked quite disappointed which I could understand but we agreed it was for the best and that we should stick to our plan. The second and most recent scare had a very different feel to it, an almost deliberateness to it. When I asked if she made a mistake with the pills again she told me to get off her case and accidents happen. Tests came back negative again.\n\nI sat down with my wife and had a talk when everything was calmer and told her I wasn’t blaming her and that these things can happen but 2 so close together was worrying. I suggested I could wear condoms to take the pressure off, she declined as she doesn’t like them, I don’t like them either but I’d rather wear them than risk pregnancy. I even made a joke about getting a vasectomy which we both laughed off.\n\nOut of worry I’ve started to remind her to take the pill before bed and I can see she doesn’t like this and I understand. She’s told me not to do it anymore she finds it controlling. I’ve stopped reminding her but I’ve started to worry about it constantly and it’s put me off wanting to have sex. I did some googling about vasectomies and went down the rabbit hole. What I discovered is that many people had vasectomies and froze their sperm, the more I read the more I felt good about this and thought this would be the perfect solution. My wife wouldn’t have to take the pill and we would have peace of mind. \n\nI brought this up to my wife and she lost it and said that was a terrible idea, I asked her why but she couldn’t give me an answer except that it would be a hassle. I said while yes it would be more hassle, it would give us both total control of when we had children and we wouldn’t need to worry about BC ever again. My wife said I was behaving like I don’t trust her and that I should trust her to take care of it. I just told her this makes the most sense and that this is what I wanted to do and that I would book an appointment as soon as I could. \n\nMy wife has been angry with me and refuses to come to the appointment saying that I’m being selfish and that this choice should be made together.\n\nAITA here for wanting this and potentially going through with this?",
  "id": 1,
  "comments": [
    {
      "score": 1969,
      "content": "NTA.\n\nIt's your body and your choice (and yes, that works for men as well).\n\nYou are not going back on your agreement to have children because you are willing to freeze sperm.\n\nYou are being up front and honest.\n\nI can see where your wife might feel that you don't trust her, but no birth control is 100% effective. Even the pill fails more often than people expect.\n\nMore men should be willing to have vasectomies because hormonal birth control is horrid, IUDs are painful can lead to infection, PID and infertility and tubal ligation is major surgery.\n\nHopefully, in time, both of you can have a calm discussion about it.\n\nI wouldn't push her to go to the appointment with you though...",
      "id": 2,
      "comments": [
        {
          "score": 1425,
          "content": "But here's the thing with ART (assisted reproductive technology), which includes freezing sperm and/or eggs - it's not a guarantee.   It's a chance, and an expensive, painful one at that.  Not painful for him, no - but if his defrosted swimmers require more than a Turkey baster to be used, then she is in for a painful, emotionally challenging time.  \n\nI'm not sure what the right answer is, but him getting snipped is putting a tremendous burden on her, and it doesn't sound like he's considered that.",
          "id": 3,
          "comments": [
            {
              "score": 575,
              "content": "Yes and IVF will require OP’s wife to inject herself with hormones to stimulate egg development and release, and will need invasive surgery under general anaesthetic for egg retrieval.\n\nNTA for the vasectomy in general, but OP has to be prepared to lose his wife over it.\n\nINFO ages?",
              "id": 4,
              "comments": [
                {
                  "score": 67,
                  "content": "This. And also IVF only has a 20% success rate, which many people don't realise, so if it come to that your wife could be in for years of physical and emotional stress/pain. Have you thought about discussing an implant or coil? They use the same hormones as the pill but aren't susceptible to human error.\n\nNTA if you want a vasectomy, but if you're still planning on having kids you need to think about what you're asking your wife to go through",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "IUI is much easier than IVF but yeah, it's still a huge deal for her potentially.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 15,
                      "content": "You get about two IUI goes for every load of ejaculate, so if they want this to not involve IVF, OP better have deep pockets and be prepared to store months of sperm so the wife can avoid IVF and have a reasonable shot at IUI. \n\nIUI is better suited to donors with unlimited sperm.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "Vasectomies and tubal ligation also aren't guaranteed. It's a small percentage but there would still be a risk of pregnancy.",
              "id": 8,
              "comments": [
                {
                  "score": 122,
                  "content": "My uncle got a vasectomy and thought his wife cheated on him because it didn't take and she got pregnant. \n\nIt's his kid, 100%, looks just like him, and he's shooting live rounds the doctor said. Second surgery did the trick though.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Even when it does go right there is still a small chance like 1 in 10,000. Also with either a vasectomy or a tubal ligation their is a chance that it will grow back.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "He should have gotten the clamps. It eliminates any chance of reattachment",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "I know someone who was born after their mom had tubal ligation after having twins and their dad had a vasectomy as they were swingers. Life really wanted to find a way.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My aunt got tubal ligation after their second kid... uncle got a vasectomy after their third... now they have four kids. Can’t tell if that’s lucky or unlucky!",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "*but him getting snipped is putting a tremendous burden on her, and it doesn't sound like he's considered that.* \n\nI don't think that is a fair comment at all.\n\nMen get shit on all the time for their unwillingness to participate as much in birth control as women. \n\nWomen are saying all the time more men need to get a vasectomy because it is a much better alternative then the women being on birth control.\n\nNot only that, but he has tried to be more involved by helping remind her to take her pills which she apparently found controlling. Then as well he offered another solution by offering to use condoms, yet still she found fault with that.\n\nThat is complete BS! Guys complain about not liking condoms all the time and are constantly told things like \"too bad suck it up because it's much easier/safer/less hassle then birth control. However when he suggests it to her, she can apparently say she doesn't like them and that is supposed to be acceptable? Hell no!\n\nYou want to talk about tremendous burdens? She is essentially trying to remove him from all aspects of birth control and literally trying to guilt trip him by saying he doesn't trust her. Meanwhile there has already been 2 scares in 6 months with a big suspicion that at least one was deliberate...\n\nOp is dangerously bordering on a situation where he may end up having a child before he is ready against his will. What happened to \"your body your choice\"?\n\nThese 2 scares with the pill mix-ups are somewhat comparable to poking holes in a condom when you take into account the deliberateness.\n\nIf the roles were reversed and this was a women posting about concerns that she wants to wait, but her husband wants to be the only one in control of their contraceptives and is guilt tripping her over it, meanwhile has been responsible for 2 scares in 6 months then everyone on Reddit would be saying he's the asshole.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "A vasectomy doesn’t prevent sperm from being produced. So even if it fails with what’s frozen, they can harvest more. Or reverse the vasectomy. They have options. The thing everyone seems to be missing/ignoring is it’s clear the wife no longer wants to wait for a child.",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Huh, I always thought vasectomies were reversible. I'm all for it if he can undo it, but not if it's going to force her to undergo IVF, I've heard it's horrible. I understand why she might feel like OP is making some pretty big decisions about her body by default. His body, his choice and no one should be having kids they aren't ready for, but it does sound like this decision might impact her ability to conceive naturally.",
              "id": 16,
              "comments": [
                {
                  "score": 9,
                  "content": "Usually reversible - I think the statistic is 2/3s of reversals succeed, which leaves a pretty high percentage of fertility loss.  \n\nAnd yeah, IVF is rough.  \n\nThere's definitely no easy answer here - he shouldn't be forced to have kids, and she shouldn't be put in a position to have to take drastic medical action to achieve a mutual goal when it seems to be unnecessary.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "He's not forcing her to have IVF by this decision. It is still her body and her choice if she wants to have IVF or not. She can ask him to have the vasectomy reversed, and if he chooses to try it and it succeeds, no IVF neccesary. She could choose not to have a child, then no IVF, and she could choose to have a child with someone else, again no IVF neccesary.\n\nThat being said, I'm going with ESH. It certainly sounds like he believes his wife is no longer interested in waiting to have a child, meanwhile OP has no interest in having a child at this time. Instead of discussing it with each other like rational adults in a relationship where they both trust each other, they're both taking extreme actions to make sure the other's plan doesn't work. If you don't trust each other, you need counseling, or to leave the relationship.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "But think about it, it is his body and his choice, not hers",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "Arent most vasectomys reversible anyways?",
              "id": 20,
              "comments": [
                {
                  "score": 3,
                  "content": "Theoretically.   I believe the recent statistics are around 30% of reversals fail, leaving the person with fertility loss.  So it's not as clear cut as people think.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -6,
              "content": "vasectomy reversals are a thing, if that's the reason why she is against it. However i have the feeling that its not why shes against it",
              "id": 22,
              "comments": [
                {
                  "score": 36,
                  "content": "Reversals are also not guaranteed to work and return fertility, making it a gamble for which he'd not have to pay the price.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "They are not guaranteed to work. Take a peek at any place that has a lot of people on second marriages suddenly having to do IVF because that neat little reversal didn't go as planned.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 3,
                      "content": "there is no such thing as a guarantee for any procedure, that doesn't mean you rule it out completely though",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 763,
          "content": "I actually disagree. I think that ESH, because OP and his wife clearly have communication issues. Instead of trying to address the root of the problem, OP is making a unilateral decision that will affect both of them. While it is his body, he agrees that they both want children in a few years — so his decision affects both of them. \n\nWhy is OP getting a vasectomy? Because he's so anxious about whether his wife is taking her BC. Why is he anxious? Because communication has broken down and he no longer trusts her. I'm not saying that it's anyone's fault necessarily, but something is very wrong with their relationship and getting a vasectomy is not going to solve it. If he can't trust his wife not to get \"accidentally\" pregnant then the relationship is on thin ice. \n\nOP - you're right that it's your body. But also, if you want to remain married to your wife, she's right that it ought to be a joint decision, given that it affects your joint plans for the future. And to be honest, if I was in her shoes I wouldn't exactly be excited about undergoing artificial insemination when there are so many other solutions. Clearly she's got some issues too (like rejecting condoms), but your relationship seems dysfunctional from both sides. If you want your marriage to work, couples counseling is probably needed.\n\nAlso, I have to say, I don't think it's necessarily incriminating that a) she's had several scares, and b) she seemed sad she wasn't pregnant. I'm in absolutely no position to have children but despite using multiple methods of BC I've had scares, and for some of them started seriously considering what I'd do. While I wasn't precisely sad when I turned out to not be pregnant, I also wasn't planning on getting an abortion — and if I'd been in an actual stable relationship of many years, I think I would've actually started getting pretty excited at the possibility (although having a kid is of course a daunting prospect, especially when unplanned).",
          "id": 26,
          "comments": [
            {
              "score": 161,
              "content": "Hell I don’t want to be pregnant right now but my husband and I have had one scare and one early miscarriage. The early miscarriage came when we’d only been dating for two months but when it happened I was devastated even though we barely knew each other at that point and I wasn’t ready. \n\nSome communication is definitely necessary here and maybe some counseling",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "He offered to use condoms. If that's not good enough then I think it's more like the wife is ta. What they're doing is not work and causing scares and she is refusing to use a different method. So it's either don't have sex (seems a bit unrealistic) or he gets the snip snip. What other mode ground is there at this point for them?",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "When combined with her attitude, it's enough evidence that their current BC approach isn't working. There's also at least some evidence that she is not as committed to not having kids right now as he is. He needs to communicate, but isn't TA for wanting a form of BC he can control. She needs to accept a vasectomy, condoms, or abstinence, or they need to agree on something that isn't prone to user error (intentional or otherwise) on her part.",
              "id": 29,
              "comments": [
                {
                  "score": 9,
                  "content": "I agree with all of this. It seems like his wife is not able to be trusted with bc pills, so they need to talk out other options that don't require perfectly remembering, like an IUD. OP could just stick to his guns that if they're going to have sex then he will have a condom on, that way he feels in control of the situation too. I don't think OP fully understands the implications of having a vasectomy when he plans on having children. The main issue though is that they clearly aren't on the same page and need to talk it out.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I feel like her attitude may stem from being blamed for missing a fuckin period. He conveniently left out their ages but to be a practicing lawyer he, and presumably his wife, is in his late twenties early thirties. This woman has successfully taken her birth control for the three years of her marriage and the whole time they were dating. Probably a while before that too. To make one mistake out of LEAST 756 times taking this medication can happen to anyone, and she doesn't deserve to be treated like she is too irresponsible to manage her own medication. However, she should have told him about it once she realized it if she did and used condoms to be safe. The second \"mistake\" as people here love to call it could have been any number of reasons she skipped a period. I would be pissed if a missed period made my spouse stop trusting me and start treating me like a child.\n\nI do agree with other posters that they need couple's counseling. There has been a total collapse of communication on both sides. He said their whole relationship they agreed it wasn't the right time to have kids NOW but it isn't clear how long that actually has been going on. Had he expected to make more money right out of school? What if he doesn't make partner? For most people the time will never be perfect, and a vasectomy just seems like over kill.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -10,
              "content": "> OP is making a unilateral decision that will affect both of them. \n\nMay affect them both but ultimately his choice since his body. \n\nIf you really feel that way, then you must also be against abortion because if a woman wants to keep the baby, having a baby affects both the man and woman.",
              "id": 32,
              "comments": [
                {
                  "score": 176,
                  "content": "In the post you replied to, see:\n\n>OP - you're right that it's your body. But also, if you want to remain married to your wife, she's right that it ought to be a joint decision, given that it affects your joint plans for the future. \n\nOf course everyone has bodily autonomy. It doesn't mean that exercising that right is without consequence for your relationships.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 13,
                      "content": "That is true.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -3,
                      "content": "Post also says that exercising his autonomy makes him an asshole. Also, to be That Guy for a sec, if the roles were reversed and OP were female we'd be telling her to get out of dodge, so it irks me that \"consequence to your relationships\" is the card being played as opposed to \"good! you try to keep your life on the track you agreed on and she flips out? red flag!\"",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "Sure his body his choice but doesn't mean it won't affect his  relationship with his wife. Also abortions don't have the same affect as vasectomies on the partner, the female equivalent would be tubal ligation because having an abortion doesn't mean you can't have kids in the future where as those options generally do. And his vasectomy is also affecting her body because he wants her to go for IVF because of his decision which isn't that easy on the body.",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": ">May affect them both but ultimately his choice since his body.\n\nYes. But he agree they would have a future that involved raising a family, and this goes against what he agreed to. He may have a legal right but it would also blow up the marriage agreement.\n\n>If you really feel that way, then you must also be against abortion because if a woman wants to keep the baby, having a baby affects both the man and woman.\n\nNot against abortion. But if both decided to have a baby, and THEN she would have an abortion because she changed her mind, then again. It would indeed be her decision, but one that goes against what they agreed to and thus grounds for divorce imo.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Yep. If the conditions changed that was \"agreed\" upon earlier, that's grounds for at least a serious discussion or ultimately a divorce.\n\nLike if a couple wants a baby but both agree not at the moment. Then further into the relationship, one person is now against having a baby. The other person has two choices. Be content with not having a baby or leave. In this scenario, the wife has every right to not go through IVF. It his her body. If she is not comfortable with it, she can leave. The husband made his choice.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Wait. Can you really just unfreeze sperm and shoot it up her birth canal when she is ovulating and then you have a reasonable chance at a baby? Isn't it necessary to do IVF with frozen sperm? Because IVF means that the wife would have to take hormones, have eggs harvested, have the the fertilized egg implanted (whilest again taking hormones) and have a higher chance at multiples,and thus a higher chance at a risky pregnancy.\n\nBecause in that case, OP making a decision about his body is a decision about her body, too.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yes, you're describing IUI. Success rates are fairly low in the infertility population, but that's because it is basically a more effective version of the old-fashioned way . You can use hormones to improve the success rate, but I don't think it's necessary. If the parents are otherwise fertile, have enough money, and have enough sperm frozen, it should work.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "So what if the man and woman agree on the abortion? Or the dad doesn't want anything to do with the pregnancy? I'm sorry but you're basically trying to make an argument by saying something totally unrelated.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 0,
                      "content": "> OP is making a unilateral decision that will affect both of them.\n\nAbortion or continuing a pregnancy affects both parties.\n\n> Or the dad doesn't want anything to do with the pregnancy?\n\nChild support. \n\nOne person's decision does affect both parties but it's ultimately their decision. Much like how a vasectomy can affect the wife. Like having the ability to have a baby or in his case IVF. Much like how continuing a pregnancy affects the guy, by having to take care of the kid or paying child support.\n\nYou cannot be against the guy making a decision to do with his body but be for abortion. They're intertwined.\n\nThat being said, both decisions have consequences.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Abortion doesn't physically affect the man. Ok having a vasectomy and freezing sperm to use during OUR later physically affects his wife. His wife will be the one undergoing daily shots,invasive egg removal for a maybe",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 113,
          "content": "Sorry but no. This is a decision that could very well lead to never being able to conceive, because both reconstructive surgery and using frozen sperm have significant failure rates.\n\nSo if you have upfront decided to have kids, then this is not just his decision. Maybe legally, yes. But it goes against what they agreed to when they married. Having a vasectomy now is a 'blowing up the marriage agreement' type of decision.",
          "id": 44,
          "comments": [
            {
              "score": 16,
              "content": "There's unfortunately not very many options for birth control for men. The options are pretty much limited to 1) don't have sex, 2) use condoms, 3) leave it all to the woman or 4) get a vasectomy. Since option 1 is clearly not good, OP's wife doesn't like option 2, and OP is uncomfortable with option 3, the vasectomy is the only remaining choice. And yes, every one of the options come with consequences.",
              "id": 45,
              "comments": [
                {
                  "score": 29,
                  "content": "Wife is being TA to saying no to condoms but if husband ACTUALLY wants bio kids, getting a vasectomy is not just wrong, it's also very stupid. He should insist on condoms or else no sex, instead. A vasectomy is simply not a good or smart option for **temporary** birth control because of the expense, invasiveness, and high failure rates of using frozen sperm or surgically reversing it.\n\nI suspect he doesn't actually want kids at all but that's a whole different can of worms and I'm really just guessing at that anyway.\n\nWhere I live I doubt any reputable doctor would agree to a vasectomy on a man who literally wants biological children. It's just ridiculous.",
                  "id": 46,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "And OP's consequence for doing the vasectomy without her being on board with it could very well be a divorce.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 1,
                      "content": ">And OP's consequence for doing the vasectomy without her being on board with it could very well be a divorce.\n\nSure, it could be. And that would suck for both of them. \n\nThis problem essentially boils down to a lack of communication. OP is *afraid*. He feels like he has no control over one of the most central aspects of his life. He's probably not communicating that clearly, and his wife certainly isn't understanding it. So now they're in this mess, where at least one of them will end up hurt.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "There aren't any other options because there isn't a market for them.  They developed a pill for men years ago but there wasn't enough interest or money to get it through all the clearance it needed to sell.  For some reason I've never been able to understand men seem to feel they aren't man enough if they are shooting blanks.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Regardless of the reasons, it's still the case that men have few birth control options. And it certainly sounds like OP would like to have some more options.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 104,
          "content": "I dont want to detract from your point, which I mostly agree with but I feel it needs to be said that birth control is not horrible for ALL women. For many, like myself, there are no negative side effects and its super liberating. For many others, its a necessity for their health. \n\nIm only saying this as I see reddit, and especially AITA, push this idea that birth control is terrible and any women who is on it is suffering for the sake of their SO and its just not true.",
          "id": 51,
          "comments": [
            {
              "score": 42,
              "content": "I think you see that because so many men are ignorant of the side effects which can include some serious shit like blood clots.  So many seem to be under the impression too that it’s either easily obtainable (dependent on state was only recently federally mandated for insurance to cover) or that its pain free (you need a local block for implants and pain meds pre and post procedure for an IUD).  \n\nIt’s not that every woman has horrible side effects, it’s that sex education in the US is not comprehensive for all genders.",
              "id": 52,
              "comments": [
                {
                  "score": 13,
                  "content": "Also not all pills are the same, if you don't get the right one for you it's going to suck.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I agree with you. Birth control helped control my periods and I have way less cramping/headaches/mood swings. It's been a god send. \n\nI understand that some people are negatively affected by it, in which case there should be options for them to come off it, but I don't like that people are almost becoming anti-birth control because it's \"so so horrible for the woman\"",
              "id": 54,
              "comments": [
                {
                  "score": 3,
                  "content": "I've been on birth control since I basically started my period. I had super long (14 days was my first cycle then 8-10 days after that) and heavy cycles. It was awful, I felt like shit, I had bad leg cramps that would inhibit me from moving due to pain, and just a slew of other issues.. as soon as I start d my BC my periods went to a normal length for the most part (5-7 days unfortunately but wayy better than the other option). My cramps only last a day or two and not nearly as bad, and I don't feel as gross overall... \n\nThat being said I'm not sure if my BC does give me any negative side effects due to how long I've been on it... I feel if there was negative side effects I didn't connect it when I started and now I'm just used to it... I often wonder if my depression/anxiety is linked to my BC..",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Same!! LOVED my BC pills. Was a complete lifesaver. Not only did I not experience ANY negative side effects but the pills had the massive upside of making my period only last 2.5-3 days and be super light. My heaviest day of my period was barely more than spotting. Sooo bummed I can no longer take hormonal BC.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "IUD insertion can be painful but the risks are much less awful than you're making them sound. They are a great choice for birth control if you dont also need to protect yourself against STDs.\n\nAlso ESH because of poor communication. OP, if you've changed your mind about kids, just say so and deal with it.\n\nOP, did either of you talk to a doctor about birth control and the two failures? That should have been your first steps.",
          "id": 57,
          "comments": [
            {
              "score": 27,
              "content": "I got PID from an iud and it was so painful i couldn't stand up straight and it may have made me infertile. It also gave me multiple infections. Just because not every has a bad experience doesn't mean the risks aren't awful.",
              "id": 58,
              "comments": [
                {
                  "score": 4,
                  "content": "[deleted]",
                  "id": 59,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Then why is it listed as a side effect? I was told by the hospital it was caused by the mirena when they did the emergency removal. I wasn't sexually active at the time either. I think ill listen to doctors and the manufacturer of the iud before some rando on reddit.",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "How is this at the top... using frozen sperm requires her body to go through a horrible process too so he's not saving her from the horrors of birth control, he's instead putting her through the horrors and expense of fertility treatment. By doing this he IS making decisions about her body since they both want kids. Getting a vasectomy when you want kids is a completely terrible idea. Freezing sperm as a backup because you don't want kids but want the safety net? Fine. Freezing sperm as a PLAN because you want kids but getting a vasectomy for temporary birth control? Stupid and selfish. Where I live I doubt you could even find a doctor willing to surgically sterilize someone who claims they **want** biological children in the next *two years!*",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Yeah, maybe OP can emphasize that this is more for his own peace of mind than distrust? Like, he trusts her to take the pill but the scares have made him realize how easily they could fail, even when taken perfectly, and worrying about that has taken a toll on his mental wellbeing.",
          "id": 62,
          "comments": [
            {
              "score": 10,
              "content": "Vasectomies can fail too.",
              "id": 63,
              "comments": [
                {
                  "score": 8,
                  "content": ">Vasectomies can fail too.\n\nEverything can fail. That's why redundancies are good.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Piggybacking on this to add something:\n\nNAH, I think it's great you read a lot about vasectomy and made that choice for you. However I think you should also read on ivf and how all of this is going to work with your sperm and what effects it will have on your wife and your marriage in the long run. \n\nIt's 100% your decision but I wouldn't blame your wife if she decides ivf is not something she wants to do. So I understand her position in this as well. \n\nI think before you make the decision you should rather do some marriage counseling. Clearly communication seems to be the biggest issues between you two.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "If freezing sperm doesnt work for some reason, it's difficult to reverse a vasectomy and that doesnt always work.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I would just like to add. Just like with a lot of other things. Kids are a two yes, one no sort of decision. If one partner says no to kids. There should be no kids.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 778,
      "content": "YTA. Freezing your sperm means that you are now creating the necessity for her to undergo medical treatment to conceive which is not pleasant. I think you should insist on condoms and maintain control of your supply of condoms. Forcing her to have IUI because you want permanent contraception due to your suspicion about her faithful adherence to birth control is not a good basis of trust in your marriage. Discuss alternatives to the pill (implant? Shots?) and use condoms.",
      "id": 68,
      "comments": [
        {
          "score": 215,
          "content": ">use condoms.\n\nYea, condoms have the unfortunate trait that they become useless once poked.\nI mean, the wife seriously sounds as if she had a bad case of baby fever.\n\nAnd I mean... If she had layed her point out like you, it wouldn't feel as bad as it does since she just couldn't/didn't want to tell him why she's so vehemently against a vasectomy.",
          "id": 69,
          "comments": [
            {
              "score": 233,
              "content": "Happy cake day, and please refer to my point that OP should maintain control of his supply of condoms. I had fertility treatment to conceive and no matter how much he thinks this keeps him safe, the conception process is not noninvasive like it is to put a specimen in a cup. There are ultrasounds and potentially hormones to control ovulation and lots of blood tests and the procedure isn't pain free. \n\nChoosing to terminate his fertility is requiring her to undergo invasive treatment. This needs to be something she understands, that he does not believe her adherence to birth control regimen is faithful and now he wants a less risky method or he'll pursue a permanent contraception alternative.",
              "id": 70,
              "comments": [
                {
                  "score": 80,
                  "content": "Op also states he offered to use condoms so the burden is not on her. She refused. She is limiting his ability to have any control and keeping her ability to control when they have children. He’s obviously suspicious, and if his version is true then rightfully so. They need some serious communication before either one does something that will destroy their relationship.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 43,
                      "content": "I’d say the same thing to him I’d say to any woman who’s partner is “refusing” condoms (short of a DV situation). No glove, no love. See how fast they crumple.\n\nAlso it’s easy to see if there’s a hole poked in a lubed condom. Just kind of pinch the two sides of the condom together in the wrapper. If there’s a hole, lube will want to poke through it.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Thanks :D\nAnd yea, but unless he keeps the condoms with him 24/7 it won't be safer than her taking the pill.\n\nI'm kinda having trouble to understand your last sentence (non native speaker here).",
                  "id": 73,
                  "comments": [
                    {
                      "score": 55,
                      "content": "There are non-pill options. Shots, implants, etc. Pills require his wife to take them at the same time every day to be effective while implants or shots last months or years.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Op also states he offered to use condoms so the burden is not on her. She refused. She is limiting his ability to have any control and keeping her ability to control when they have children. He’s obviously suspicious, and if his version is true then rightfully so. They need some serious communication before either one does something that will destroy their relationship.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "If anyone is forcing, it's the wife, she's forcing him to take extreme measures. \n\nI don't think this woman is being honest here, seems she wants a baby now and is willing to make that happen. \n\nGood for him for taking control of his birth control and reproductive rights.",
          "id": 76,
          "comments": [
            {
              "score": 95,
              "content": "Well if he wants to respond to her seeming to really want a baby by sterilizing himself and telling her if she ever wants kids she'll get a couple chances to stick herself with a needle some day... he should expect divorce whether he was right or wrong about it being intentional.",
              "id": 77,
              "comments": [
                {
                  "score": 17,
                  "content": "And if she's deliberately sabotaging her birth control to start a family without his permission thats basically stealthing and is divorce worthy in and of itself.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That could happen of course, however at least he won't be a father until he is ready to be one.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 60,
                      "content": "It's a relationship with real people, you're not playing the sims.\n\nAnd even if you ignore all human aspects of this, his attempts to make sure it only happens at the perfect moment could leave him with no one to bear his children for well beyond that window. If I wanted kids I'm definitely not dating the guy that says \"well I have some sperm frozen\".",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": "He needs to make sure she understands that of she does not find a better birth control, he will pursue permanent contraception and she will need to undergo fertility treatment to conceive. Doing it without having that conversation is just as deceitful as she is being. I speak as someone who did go through fertility treatment and it is not fun like natural conception. It is fraught with emotional turmoil and the responsibility to conceive rests all on her, where every cycle costs hundreds or thousands of dollars.",
              "id": 81,
              "comments": [
                {
                  "score": 4,
                  "content": ">I speak as someone who did go through fertility treatment and it is not fun like natural conception\n\nIf you read my own judgement I agree with you about that.\n\nHowever he is not being deceitful, he's been open and honest, he brought this to her. If you think she has been deceitful, it seems calling the OP TA is biased knowing that.\n\nMoney wise depending where you are it can cost from a couple of thousand to the figures you mentioned, it's unclear where the OP is.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 43,
                      "content": "IUI can cost hundreds of dollars per try just to put the sperm in, sperm storage costs more than a thousand dollars per year in the US and if more treatment and testing is required, it will run into the thousands per try.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Two scares, not two pregnancies. A scare is a period being late. A late period can be due to stress, mal nutrition, hormonal changes and so on. \n\nThe tests were negative, meaning she was never pregnant. \n\nBeing disappointed about a negative test can also mean that she is ready for kids and would have them now if it weren't for OP's career plans, but agreed to wait. This does not mean she is trying for an oops baby. It only means she would not mind having a baby now. \n\nAnd yes, OP does want his wife to undergo hormone treatment, egg removal and so on, just to be able to have sex without worrying.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "> Good for him for taking control of his birth control and reproductive rights.\n\nI agree with the idea, except OP here is being an asshole about it. \n\n> I don’t think this woman is being honest here, seems she wants a baby now and is willing to make that happen.\n\nThat was also the first thought to jump into my mind. When I thought more about it, though, protesting your boyfriend micromanaging you about your pills when you’ve taken them mostly without issue for years, if not decades; not wanting to use condoms when you’re in a long-term monogamous relationship; and noting want your boyfriend to have a vasectomy when you two planned to have children soon... all that seems like normal behaviour. \n\nThe reason OP’s narrative is compelling is because is because OP’s wife had two scares where she was disappointed she didn’t have a child. As you’ll note in other posts here, neither the two scares (missed periods are common), nor the fact that she’s disappointed she’s not actually pregnant is unusual behaviour for a woman didn’t plan to have kids now but who was gearing up have kids in the foreseeable future. There’s nothing wrong with that, nor being touchy about the situation because you know your husband feels differently. \n\nIn short, there is nothing resembling factual evidence that OP’s wife is guilty of the crime you’re accusing her of. I do think the evidence can be counted suggestive —it’s definitely possible that OP’s wife could be guilty of what you’re accusing her of doing, there’s nothing in OP’s story that makes her guilt even likely. I agree with you that OP should take extra precautions, and is rightly troubled, but tell me this is worth ruining a marriage for. In another [case](https://www.google.ca/amp/s/amp.reddit.com/r/AmItheAsshole/comments/e1359t/aita_for_accusing_my_girlfriend_of_getting/), a man thought “it honestly just made the most sense” that his SO had intentionally gotten accidentally pregnant based on little evidence, made a decision that could’ve ruined his life, and was wrong.\n\nInstead of “booking an appointment as soon as possible” for a vasectomy after one inconclusive discussion with his wife (who had plans to have children with him), OP can take control of his birth control and reproductive rights in other ways. Maybe take sex off the table until they find a second form of birth control that works for them both. They could consult a doctor about the countless other possibilities —shots, iud, etc.—that are less drastic than “vasectomy appointment asap”.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "We don't know that. We know that OP thinks that because there were a couple of scares and she seemed sad after the negative tests. Both of those are not really out of the ordinary.",
              "id": 86,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "It’s his body and his choice. That works both ways.",
          "id": 87,
          "comments": [
            {
              "score": 2,
              "content": "\"Hey reddit, AITA for getting an abortion after my husband didn't want me to?\"\n\n\"YTA, now your husband can't have the baby he wanted. Think of him!\"",
              "id": 88,
              "comments": [
                {
                  "score": 4,
                  "content": "Or the wife of OP or the husband of your scenario has another option. LEAVE.\n\nThe hypocrisy of this thread is staggering. The wife can choose to not undergo IVF. Her body or choice. The husband is not forcing it on her but has made it one of the options.",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Vasectomies are reversible.\n\nBut yes they should have the talk about alternative birth control.",
          "id": 90,
          "comments": [
            {
              "score": 2,
              "content": "Not universally reversible. It is considered permanent.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 560,
      "content": "NTA\n\nFrom what you say it looks like she’s trying to fall pregnant *accidentally*. \n\nGetting a vasectomy and freezing your stuff does make perfect sense in your case, however IVF isn’t a cake walk and carries it’s own burdens and risks for her.\n\nHowever I don’t think you’re an AH for wanting just as much control as she has deciding when you have kids. When you start a family should be joint decision, not a decision it looks like she’s trying to make on her own.",
      "id": 92,
      "comments": [
        {
          "score": 158,
          "content": "[deleted]",
          "id": 93,
          "comments": [
            {
              "score": 171,
              "content": "If I didn't want to get pregnant I wouldn't get upset with the person who was helping with that. It's not that hard to set a daily alarm, anything less indicates this is intentional or just unbelievably careless. If she's careless she wouldn't mind his vasectomy so much",
              "id": 94,
              "comments": [
                {
                  "score": 68,
                  "content": "Is there anything wrong if she (not-so-secretly to her husband) wants to be accidentally pregnant, but is taking all the right pills anyway? Or if she has different opinions than her husband about when to have kids, maybe knows they’re both kinda touchy about it, but has consented to wait, and is now acting frustrated and hurt because her husband is acting controlling and mistrustful?\n\nI’m not saying she’s likely innocent or not innocent, only that there really isn’t enough info here to jump to conclusions. I’ve presented alternative plausible reasons for her behaviour, and [here](https://www.google.ca/amp/s/amp.reddit.com/r/AmItheAsshole/comments/e1359t/aita_for_accusing_my_girlfriend_of_getting/) is an example of that scenario happening to a man who thought “it honestly just made the most sense” that his wife had intentionally gotten accidentally pregnant.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Yep, in that link she did everything right, accidents happen, they disagree on keeping the baby, NAH. OP may be leaving details out, but if she's setting an alarm and ignoring it I think he's absolutely justified in reminding her, if she hasn't set one, again it becomes intentional or careless. She is not considering his feelings in a massive event that affects his life too.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I am a childfree woman. I recently got the copper IUD because I had a few scares while on the pill. I did not like the hormonal side effects and it was something that could easily be forgettable. I've forgotten a handful of times and have *always* told my partner or abstained from sex until we were safe again. Look, the pill is not 100 percent strictly because people forget. But if I had too many intentional scares, I wouldn't put it past my partner to think something is wrong with my birth control and that different avenues need to be taken into account. Hopefully I can have a sterilization procedure in the next 5 years, but for now, this will do.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Sometimes I get angry when people remind me to do things I was already going to do or have already done because it makes me feel bad that I have such a shitty memory and that the other person is babying me.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I think what makes it sketchy is that there's an issue only recently. I was bad at taking them at first but after a year it becomes a habit. Some people use a daily phone alarm. You don't suddenly start forgetting years into the routine",
              "id": 99,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 68,
          "content": ">Getting a vasectomy and freezing your stuff does make perfect sense in your case, however IVF isn’t a cake walk and carries it’s own burdens and risks for her.\n\nI have a colleague who went the IVF road. It took 2 years. It was pure hell on her body, and the stress of the failed attempts was a heavy burden on both of them.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "After our second child me and my wife agreed I'd get a vasectomy as we didn't want more kids. But it was being put off, so I bank a bunch of sperm (did a few visits) and went ahead and got it done. \n\nMy wife was furious. Even though it was discussed and agreed on, she kept putting it off so I just did it. Then when she found out about the sperm and how only I had access to it, she was even angrier. It was purely from me taking complete control over us having any more kids. Without my OK on it, she couldn't have my kid. \n\nWe're good now, but she was livid about it and if I'm stupid enough to mention it, she gets angry at me for a day or two at least.",
          "id": 101,
          "comments": [
            {
              "score": -13,
              "content": "Wow. I'm glad you're good now, but women have basically been in control of when they get a baby thanks to birth control. Then she gets angry when she loses that control.\n\nCan't wait for men to get their version of the pill. So they can have control also.",
              "id": 102,
              "comments": [
                {
                  "score": 70,
                  "content": "women have only had control of their own pregnancies thanks to birth control since the post-WWII era. And if you’re in America, they still don’t have full control over the decision to terminate a pregnancy in many places. That’s 70-ish years of female “control” over pregnancy compared to literal millennia of male control over pregnancies. \n\nI agree with you in supporting male birth control, but I don’t think that control over their partners’ pregnancies is the reason they should have it.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I think both people should have control. Having a baby should be a mutual decision. Both should have control. If one wants a baby and the other doesn't. They need to rethink their relationship and their future.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": ">I agree with you in supporting male birth control, but I don’t think that control over their partners’ pregnancies is the reason they should have it.\n\nWhat other reason is there?\n\nControl over if, when and how many is the only reason. \n\nWhy shouldn't men have an equal say when any of that happens?",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I also very much hope a male form of birth control will be developed soon, but I interpreted the situation about control over birth control differently. \n\nIt seems like the couple had done an okay job of talking things over re: children up to a point. Despite deciding to stop at 2, they both seem to want to allow for the possibility of more children —she with her cold feet, he by secretly storing some sperm— but haven’t talked this out. \n\nIf, in the past, they were both involved in decision-making re: birth control (I’m assuming she didn’t suddenly stop taking the pill so as to have children even if they’d previously talked about having children soon without really committing to the idea), even if she was the one ultimately in control. Meanwhile, he: \n1) goes behind her back (perhaps comparable to the suddenly stopping birth control for vague children situation I illustrated earlier)\n2) to make a FINAL decision about their having children together which allows him \n3) unilteral control over all future procreation between the two of them\nI can understand why she’s furious. \n\nI am all for bodily autonomy and family planning for both genders, but making life-altering decisions of any kinds without involving your partners is tantamount to saying it doesn’t matter to you if you want your partner involved in your life in the future. Yes, the final decision should belong to you and you should do what’s best for you in such situations —but that ideal also applies to your partner.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I agree. If you are getting a vasectomy, or any life altering decision, you should tell your partner. What if she wants kids. It is ultimately his decision and when she knows that he can know no longer have kids, she has to make the decision on whether to stay with him and live with that or leave. \n\n> My wife was furious. Even though it was discussed and agreed on [the vasectomy], she kept putting it off so I just did it.\n\nLooks like the decisions were made with both of them agreeing and after she kept putting it off, he just did it. She was involved in the decision making process.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "They had it but the trials were stopped because men refused to take them when they had the same side effects that women get from the pill.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 3,
                      "content": "If by the same side effects you mean that one of the study participants committed suicide...\n\nThe study was stopped by an independent review board. The men involved overwhelmingly wanted to continue taking it.\n\nSome have argued that if female birth control was being studied today studies would be stopped for similar reasons. People have said the same thing about Tylenol. But either way, the male birth control was *far* more dangerous than female birth control.\n\nMale birth control tends to be harder than female birth control because the female reproductive system already has a mechanism to shut itself of: pregnancy. Birth control just needs to hijack this to stop reproduction. The male reproductive system has no similar feature.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Thought from an American: will health insurance cover IVF if the infertility is due to a vasectomy? My lesbian friends all have had a hell of a time getting IVF covered because \"the mom trying to get pregnant is fertile, therefore there's no medical reason for infertility.\" If OP is American, insurance coverage is another thing to research before assuming IVF is a panacea.",
          "id": 110,
          "comments": [
            {
              "score": 5,
              "content": "Good call out! I’m American and had awesome insurance through a company that covered pretty much everything related to fertility, including egg freezing for fertility preservation. Vasectomy was a hard line though, so they paid for the egg retrieval and freezing but I was on my own after that.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Speaking for Canada as well, the cost is only covered for a limited number of sessions, because it's so expensive and prone to failure. If you don't succeed in that time, you have to do it out of pocket instead.",
              "id": 112,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "As long as the wife has no fertility issues they can do IUI instead of IVF which is way cheaper and easier",
          "id": 113,
          "comments": [
            {
              "score": 10,
              "content": "It also has a low success rate. Only about 10-20% chance getting pregnant each cycle. Pregnancy rates for IUI are lower than natural conception. With 3 to 6 cycles of IUI, pregnancy rates can potentially be around 80%. \n\nEach cycle costs about $2,500 at my clinic plus meds. So about $3,200-$3,500 per cycle. It’s slightly less invasive than IVF, but not always significantly cheaper.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don't think they need IVF with frozen sperm, they'll just inject her with his sperm when she's about to ovulate. IVF is for when fertilisation can't happen in the woman's body and there's nothing to suggest that is the case here.",
          "id": 115,
          "comments": [
            {
              "score": 3,
              "content": "IUI can be expensive, requires multiple doctors visits, and with a finite amount of saved sperm, they’ll probably want to put her on hormones and do a trigger shot and intrauterine ultrasound each time they try. If they have several failed IUIs they’ll probably be encouraged to move to IVF quicker than normal to make sure they don’t run out of sperm. If they want to have more than one kid, that’s even more of an issue, especially if OP’s wife will be on the older side because it will likely take more tries for each kid than it would for a younger woman. \n\nFertility is a tough issue, especially for women as they get older. I’d be very upset if my husband wanted to take a step that could potentially make it impossible for us to have biological children against my wishes.\n\nIt’s absolutely his body and his choice, but he needs to be aware that part of that choice might be sacrificing his relationship.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 459,
      "content": "If you sterilize yourself to ensure an extra *year or two* before you have kids, don't be surprised if you just chose your job over your marriage. You might just ensure a lot more than a year or two before you have a family.\n\nEven if people are right that she actually wants a kid, just divorce her if you feel that strongly about it.\n\nYTA. This is just dumb.",
      "id": 117,
      "comments": [
        {
          "score": 86,
          "content": "I can see the flip side of “Yelling at my husband for working long hours to make partner, while I have to do child care, AITA”.\n\nThere is a difference between choosing job, and being smart and getting yourself in a place financially and professionally before you have kids.\n\nYeah just divorce her, cause if she is baby crazy, it will take a lot longer than the year or two he is asking for her to find a new partner to have kids.\n\nHe is being wise long term, if the wife doesn’t want him to use condoms, she is being a short sighted idiot.",
          "id": 118,
          "comments": [
            {
              "score": 196,
              "content": "Come on. You don't belief his story right? \n\n\nGetting a vasectomy at 20, so that you can choose when to make kids makes sense. Heck, choosing a vasectomy at 30 when you don't know when you want to have kids makes sense. \n\n\nBut he's having a vasectomy in order to wait 2 years? He's gonna massively complicate the situation for 2 years? He's risking 'no baby' because of 2 years? \n\n\nAnd I'm not gonna call him a liar, but dude does NOT want a baby and is in denial.",
              "id": 119,
              "comments": [
                {
                  "score": 116,
                  "content": "There’s not even a guarantee he’ll even get this promotion in two years. There’s no trust left in this relationship, so what even is the point of all this?",
                  "id": 120,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Well... And I'm not saying it's fair... Or proper... Or that anyone should do this... \n\n\nBut on certain subs, it can get adviced to fake a pregnancy alarm to see whether or not a partner is lying about a child desire.\n\n\nAnd if OP's wife did that, then she certainly got her answer.",
                      "id": 121,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yea, honestly what I really think is that their baby schedule is becoming more of a short term plan than a distant future and he's realized he doesn't want kids. So he says \"in two years everything will be perfect and *then* I'll want kids\" but *naive* would be the nice word to describe someone who really thinks a promotion at work is going to click a switch and make them want to be a dad.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 81,
              "content": "I will never understand anyone who thinks getting sterilized because they’re waiting for a promotion before having kids is wise.\n\nWhat happens to your entire future if a handful of syringes doesn’t do the trick?\n\nIf she literally got pregnant today, he would be in the super dad perfect phase of life before his kid can speak. He’s waiting for “the perfect moment” for no god damn reason and risking everything for it.\n\nMy husband and I haven’t used condoms in the last two years because while we’re not ready for a baby just yet, it would be fine if one happened. Not everything has to be perfectly planned. I can’t even conceive of one of us getting sterilized over scheduling concerns.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "This is all over a TWO YEAR wait? I missed that part. My goodness. Wow.",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Crazy idea if you make an agreement in a relationship follow through. She has the option to leave to do it.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "It’s not complete sterilization though, they’re reversible",
          "id": 126,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 372,
      "content": "**INFO -**\n\n**Does this mean she will need to undergo ~~IVF~~ IUI to get pregnant?**\n\nIf so, this isn't just your decision (or rather, this isn't just one decision that's yours). Getting a vasectomy is your decision as long as you don't keep it a secret...but you do not get to decide what happens afterwards. \n\nYou need to understand that your sperm may no longer be viable, or it may require your wife to undergo an invasive and painful medical process. And if so... it's her right to refuse. If so, will you two use a sperm bank instead? Or adopt? Or be comfortable never having children? You need to decide this first, *then* decide if you still want the vasectomy. And in the interest of being fully informed, you should find out if this is a dealbreaker for your wife - it could very reasonably be one.\n\nAnd since there's nothing more than a coincidence suggesting she intended the second pregnancy scare, this is likely a N-A-H situation (though either of you could easily become TA here).\n\nEdit: fixed fertility acronym. \n\nAlso, if your marriage is so fucked that you think she's lying and you're willing to get sterilized, and she likely thinks a vasectomy means you're pushing back the timeline because you never plan to have a kid...you both suck, and your problems need a marriage counsellor not a vasectomy.",
      "id": 127,
      "comments": [
        {
          "score": 36,
          "content": "Also it seems like vasectomy plus freezing sperm plus fertility treatments would be waaaaayyyy more expensive than condoms or birth control.",
          "id": 128,
          "comments": [
            {
              "score": 4,
              "content": "[deleted]",
              "id": 129,
              "comments": [
                {
                  "score": 9,
                  "content": "Oh, the cost is undoubtedly a negative too (though it pales in comparison to subjecting her to a procedure based on his wishes). But I agree, it isn't the main issue. However, the real issue is NOT a problem solved by a vasectomy.\n\nPregnancy scares happen. Even when someone is careful to take it properly, there are still times when hormonal birth control can become ineffective. And her being sad about that is pretty normal for someone who wants a kid, even if she was the one who wasn't ready. For OP to assume she was lying and trying to trick him is a BIG indication that their relationship is not a stable and healthy relationship. Yes, some people do lie...but if you're *assuming* your partner is a liar, your relationship is already a dumpster fire of a marriage.\n\nGetting a vasectomy in reaction to a presumed lie with no evidence will only make things worse. If OP wants one regardless, fine, it's his choice - but he shouldn't think it will fix anything. At best, it will subject his wife to an entirely unnecessary, unpleasant, and highly invasive medical procedure. At worst, it will be a dealbreaker and he'll be divorced and sterilized instead of just divorced. And this could easily be a dealbreaker because if OP is so ready to assume she lied, she's probably equally ready to assume OP is lying now and will never want kids. \n\nThe problem isn't the cost, AND the problem isn't that OP isn't certain why there were pregnancy scares. The problem is that their relationship is completely fucked up, and they need to examine their dynamic and if they (a) can fix it or (b) want to stay together before OP starts making decisions about surgery that will affect both their futures.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "“won’t let him wear a condom”\n\nHe can refuse to have sex without one.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "It would be IVF  unless OP banks a huge heap of sperm. Each ejaculate hets you about two goes of IUI. Given how many times the average couple needs to bang to get pregnant, OP will need to fork out the money to bank heaps and heaps of sperm, or the wife will need IVF.",
          "id": 132,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "This needs to higher.",
          "id": 133,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 170,
      "content": "NTA, but i'm close to esh.. . .\n\nMan, I'm going to have to upvote something later instead of saying it myself. I'm not sure I was sort of \"everyone\" territory. But let's see.\n\nAssuming total candor, I would be very suspicious myself. My read is that she wants a kid sooner than you. You don't mention ages. Likelihood of implantation, successful pregnancy, and child not afflicted by various diseases increases with age, particularly age of the woman. Partner track is usually, what - 5-10 years, depending (I assume lawyer) and you're almost there.\n\nA lot depends on your ages. If it's a question of having a kid at 30 rather than 32, her concern is more of a want. If it's 40 vs. 42, it's a more significant difference.\n\nYou're talking about a potentially reversible but usually permanent procedure, combined with freezing sperm, as a roundabout way to counter a suspicion - not entirely unreasonable - that she is not actually taking these pills in order to have a kid earlier than agreed.\n\nPerhaps I'll say this: ESH if you don't talk about other things first. Birth control pills have a failure rate a good deal above many other methods of birth control, like IUDs or the implantable kind of hormone-release product.\n\n[https://www.cdc.gov/reproductivehealth/contraception/index.htm#:\\~:text=Typical%20use%20failure%20rate%3A%204%25.&text=Combined%20oral%20contraceptives%E2%80%94Also%20called,is%20prescribed%20by%20a%20doctor.](https://www.cdc.gov/reproductivehealth/contraception/index.htm#:~:text=Typical%20use%20failure%20rate%3A%204%25.&text=Combined%20oral%20contraceptives%E2%80%94Also%20called,is%20prescribed%20by%20a%20doctor.)\n\nIf she absolutely refuses everything but continuing to take the pill despite two accidents, I suppose it must ultimately be NTA because it's your body. But it will have ripple effects on the marriage, at the least.\n\nIf she agrees she does not want a child right now, I do not see a great reason not to get an IUD or implant. Those are \\~0.01% failure rate. Pills vary, up to 7% failure rate (I could have sworn it was lower failure rate). The probability of two things with a 7% probability happening is quite a bit lower. (I want to say 0.49%). Either way, IUDs and the long-release implanted hormones are much better in general.\n\nI have no idea if you can tailor implanted hormones so that they last 2 years specifically, but IUDs can be removed at wish by the doc as far as I know.\n\n&#x200B;\n\n&#x200B;\n\nSimply going to a vasectomy without fighting all that out would be pretty *esh*, but then I don't know what the rates are with use of frozen sperm for things like implantation failure, any potential increase in risk of genetic defect, etc.\n\nAnd I don't know your ages.",
      "id": 134,
      "comments": [
        {
          "score": 56,
          "content": "Having had an IUD, you can begin trying for a baby approximately a month after removal if everything is normal. Some people it lasts a little longer. However, the failure of IUDs does happen. Mine did. Adorable 1.5 year old son now.",
          "id": 135,
          "comments": [
            {
              "score": 23,
              "content": "Also they can spontaneously jump ship, which can be painful and land the user in the ER. In my case I was lucky and did not suffer any long term effects. After three years it was entirely unexpected.",
              "id": 136,
              "comments": [
                {
                  "score": 4,
                  "content": "My wife had two different IUDs dislodge. \n\nWe’re on year 2 of infertility treatments (maybe related or maybe not). \n\nIts all flipping a coin but the cost is high if you don’t flip right.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 2,
                      "content": "It's not flipping a coin. Flipping a coin is 50-50. The complication rate for IUDs is *much* lower.",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": ">I do not see a great reason not to get an IUD or implant.\n\nA good reason not to have an IUD: they get put in your uturus through the cervix. (Although if she wants a baby, she really should be able to handle that pain, labor is much worse). \n\n\nA good reason to have an implant: after the depo-shot, they're the most complained about birth control in terms of hormonal side effects and consequences of that. It's not recommended to get that birth control measure at all, if you already struggle with the hormones of the pill.",
          "id": 139,
          "comments": [
            {
              "score": 14,
              "content": "At least with labour, you have the option of an epidural. I'd never get an iud because the worst part of giving birth for me was the cervix check. Everybody's different.",
              "id": 140,
              "comments": [
                {
                  "score": 8,
                  "content": "Labor with an epidural is still worse then an IUD and I'm saying that as someone whose worst most painfull experience in life was getting an IUD. I kept trying to avoid the IUD getting removed, because of the memory of such intense pain and I was having HORRIBLE side-effects. \n\n\nLabor is hours, IUD was under a minute. You have to wait before getting an epidural. You can't be too late with an epidural.  And an epidural doesn't completely take the pain away for everyone, for some people it doesn't do anything.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 11,
                      "content": "My IUD definitely was not under a minute. They spent maybe 5 minutes trying to get it in, then he used an ultrasound to make sure it was positioned correctly. Spoiler, it wasn't, so he had to go back in and correct it. Ended up not working out, so they removed it and sent me away with cervix softeners and I had to remake the appointment. Second try also took > 5 minutes to get it in and I was in agony literally the rest of the day, I've never had worse cramps in my life.\n\nNot saying it was comparable to childbirth, but it wasn't quick pain.",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "The pill failure rate goes higher when accounting for normal use (some variation in when you take it and forgetting sometimes because we're human) versus perfect use (taken precisely the same time every day).",
          "id": 143,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "Just an FYI for some women IUDs hurt a lot. For me the several month adjustment period sucked. Unbearable cramps, neasuea, weight gain, and suicidal ideation. All listed side effects I experienced. Before the IUD I never got cramps, but if IUDs make cramping worse for women that do suffer holy hell I can't imagine. It was horrible, but I stuck it out because I absolutely could not have had a baby at that point in my life and I would not have successfully taken a pill at the same time each day. In the past 3 years I have been grateful to have it, but I would never ever get one again. I don't want to have a baby right now, but if I did get pregnant my partner and I could handle it. \n\nThe wife is probably in a similar emotional state about babies as I am. The \"risk\" of having a baby just a little bit earlier than ideal is not worth the potential suffering of finding a new birth control. She should however accept the husband's desire to wear condoms.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "the arm implant is another option, it's super quick insertion and removal whenever you wish. i believe theres a 1 yr and 3yr one. it's a bit painful, but not too awful.",
          "id": 145,
          "comments": [
            {
              "score": 3,
              "content": "I looooove my implant, I was super anxious when I took bcp because I'm a scatterbrain, but the implant is considered as effective as a tubal and I don't have to even think about it.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 158,
      "content": "ESH.  If you can't trust your wife not to fall pregnant on purpose against your wishes and mutual agreement then you have bigger problems than you realize.  \n\nJust in case it's not clear, your wife is an AH for essentially lying about birth control (if what you believe is correct).\n\nYou are an AH for going against her wishes about getting a vasectomy.  If you are married and in a healthy relationship this should be by mutual agreement.  You are essentially forcing her to go through IVF to have kids with you (if I'm wrong on this someone please point it out).",
      "id": 147,
      "comments": [
        {
          "score": 17,
          "content": "If she is trying to get pregnant “on accident” it’s clear this isn’t a healthy relationship and she is the one causing issues.\n\nFFS she is the one that doesn’t want condoms",
          "id": 148,
          "comments": [
            {
              "score": 14,
              "content": "[\"by accident\"](https://writingexplained.org/on-accident-or-by-accident) - I'm literally only being a nazi about this because of your username, unless you are being ironic and I missed it, in which case I apologise.",
              "id": 149,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "That's a pretty big if though.",
              "id": 150,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "He doesnt have clean hands here- Getting a vasectomy against her wishes is not the answer.",
              "id": 151,
              "comments": [
                {
                  "score": 1,
                  "content": "He doesnt want kids and she refuses to use a condom, what options does he have left? You think she'll be fine and dandy if he just goes 100% abstinent all of a sudden?",
                  "id": 152,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I'm not disagreeing with you.  He just shouldnt stay married to her if he cant trust her not to get pregnant on purpose.  Getting a vasectomy against her wishes it just perpetuating toxic behavior in the marriage",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "IF!",
              "id": 154,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 145,
      "content": "You might best start with a meeting with a marriage counselor to make triple sure  you're both still on the two year plan. Everyone has the right to a change of heart but they owe their partner an honest conversation about it. She's not taking the pill consistently and is shutting you down when you propose alternatives. Might just be accidents or might not.\n\n\nIf you get confident that you're both really on the two year plan,  start with a joint appointment with an Ob/gyn for a consultation on other birth control options... They don't work for everyone but the patch or an IUD are a good option for people who don't like a daily pill. And an Ob/gym can give you the stats on success rates with frozen sperm so you can compare/contrast.\n\nNTA, but by a thread...",
      "id": 155,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 101,
      "content": "IVF takes a toll on a woman, and it’s a big, fat, hairy deal.  She may not be willing to undergo all that. Would you be ok with no children?",
      "id": 156,
      "comments": [
        {
          "score": 1,
          "content": "[deleted]",
          "id": 157,
          "comments": [
            {
              "score": 3,
              "content": "With IVF, she is taking lots of hormones, to trigger the release of as many eggs as possible, to improve chances of conception.  For months.\n\nShe will then undergo a procedure to collect as many eggs as possible.\n\nAnd assuming there is fertilization in the lab, she will under go another procedure to implant the fertilized eggs in her uterus.\n\nAnd for most, she will do it all over again, as it rarely works right off the bat.\n\nAside from the not-inconsiderable expense, every step in the process except the lab-attempted fertilization carries health risks for her.  Every dose of hormones, every procedure, and of course, if all goes well, pregnancy.\n\nNo one should just expect a woman to do this as a means of family planning.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It honestly depends on the BC and the women. Different BC has different hormone levels. Different women encounter different side effects. I’ve been on birth control that made me fat and suicidal and worsened period symptoms, whereas my current one has next to no side effects (this one is progesterone based instead of estrogen).\n\nOn average I would say no, BC is better. (Edit: to clarify this is because there are multiple methods to BC so you can find one that has less side effects).",
              "id": 159,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 160,
                  "comments": [
                    {
                      "score": 2,
                      "content": "No problem, but I’ve never been through IVF so I can’t say for sure. With BC you can at least try different methods/hormone levels to find one that’s right for you.",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "FUCK YES! \n\nIVF sucks immensely.\nWould not repeat, the only good part was the fentanyl high when they stabbed a needle through my vagina to access my ovaries to suction all the little eggs off. \n\nNo. IVF sucks. Full stop. 2/10, would not recommend to a friend.",
              "id": 162,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 163,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Added bonus of suck, for $27k (Canadian), we still didn't manage to have a pregnancy that resulted in a baby from IVF. So $27k for enormous hormonal changes, huge changes to my body and ....nothing to show for it. \n\nIVF isn't a guarantee, though it does have a 50-70% success rate. Some of us have to be the unsuccessful ones. \n\nAnyways, it's sadly not as easy or as guaranteed as our society tends to make it seem.",
                      "id": 164,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 88,
      "content": "There is a huge difference in getting pregnant the old fashioned way vs. IVF. “Your body your choice” is great up until your decision puts your wife through months of hormone treatments, egg harvesting, implantation, and increased risk of having twins (or more!). It would be one thing if you talked about getting the vasectomy reversed to try to have a baby, but what you’re talking about is so selfish I can’t even begin to fathom how you’re confused at her reaction. \n\nYTA. A massive, gaping, squelching A.",
      "id": 165,
      "comments": [
        {
          "score": 2,
          "content": "I'm sorry but after reading all of your comments, you're the asshole.\n\nShe's not the only one that's allowed to have say.\n\nVasectomies are reversible and a lot more effective than most birth controls and a lot less damaging to the woman's body.\n\nNow if he waited 10 years, then the chances of pregnancy will go down.\n\njust because we don't have both sides of the story, doesn't mean that she isn't trying to get pregnant when she's denying any other form of pregnancy prevention.",
          "id": 166,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -13,
          "content": "Shes being selfish, not op, shes obviously got baby fever. She is so against him getting a vasectomy and wont say why (so it isnt ivf reason related or shed say something) and her getting mad about him trying to help and remind her to take her pills is super suspicious",
          "id": 167,
          "comments": [
            {
              "score": 45,
              "content": "We only have one side of the story, and it’s written by a dude so selfish he has no qualms about putting his wife through the hell of an IVF conception rather than actually trying solve the problem with her. We don’t know she has ‘baby fever’ but we do know he harps on her about taking the pill as if she’s a child and makes unilateral decisions about her future medical procedures without talking to her about how she feels about it. \n\nIf he’s actually concerned, there are tons of less invasive, more reliable options to replace the pill that won’t affect his wife so negatively.",
              "id": 168,
              "comments": [
                {
                  "score": 32,
                  "content": "This! All these dudes that have such a limited idea on how female bodies work! So she made a mistake, or you know got stressed and skipped a period. The audacity of assuming she should just be gung oh about the invasive procedures to conceive using his frozen sperm",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "> If he’s actually concerned, there are tons of less invasive, more reliable options to replace the pill that won’t affect his wife so negatively.\n\nLike condoms, which his wife has also refused? He even seemed like he’d settle for just being allowed to remind her once a day about the pill. This post completely ignores the fact that his wife his being completely uncooperative in giving OP any control over this after there have been two scares back to back. Guys have just as much right to make sure there aren’t any unwanted pregnancies and his wife is shutting down any ability for him to do that. There’s only 3 unilateral options he has to control this himself, no sex for two years/divorce/vasectomy. None of them are great for his relationship. \n\nHonestly, it’s super fucking weak for his wife to be against condoms for extra security on birth control because she doesn’t like how they feel, if you refuse to compromise on something like this then yeah, people will do extreme and stupid shit.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Yeah dude, the fact that condoms feel horrible isn’t news to ANYBODY. There are tons of other options. A reasonable and unselfish spouse would take the time to discuss those with their wife instead of sneakily choosing the option which will put his wife through the most painful and invasive procedure available when they’re ready to have kids.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Please explain how it's obvious that she has baby fever.",
              "id": 172,
              "comments": [
                {
                  "score": 1,
                  "content": "Lol they will never be able to explain it because it’s not actually obvious. This post is written by a lawyer, so he’s really good at leading opinions through persuasive speech with zero facts to back any of it up.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yeah that was why I asked them to explain it.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}