{
  "post content": "My cousin turned 18 recently. She’s in high school. \n\nShe doesn’t have a car, and during her birthday weekend, thought her parents were going to buy her one. They didn’t get her one and she was pretty upset. I should note that I’m not very close with my cousin. Or the rest of my extended family for that matter. I only heard about this through the grapevine from my dad. Anyway\n\nMy cousin texts me on the Friday before her birthday asking if she can take my car (I just leased a new Ford escape) to the mall and then for an out of town road trip with her friends over the weekend. I tell her no. \n\nShe begs and pleads with me. I tell her no again. My car is for me to drive and for me only. If she wants her own car she can save up and buy one. She calls me a bitch and says that I ruined her birthday and that she’s embarrassed because her friends think she got a car for her birthday and she doesn’t have one. I don’t respond to her and think nothing of it. \n\nThe weekend comes and I sleep in very late on that Saturday, waking up at 1:00 pm (don’t judge lol). Even though my car is parked in my driveway and my gate is closed, I come to realize that someone egged and TP’d my car. With many, many eggs and 5-6 rolls of TP. And since the weather was warm outside, the raw egg baked into my car, along with the dried up toilet paper, destroying the paint. \n\nSince I have security cameras around my house, I decide to go back and watch. At around nine thirtyish that morning, I see my cousin and a bunch of her stupid friends vandalizing my car. I’m surprise she didn’t smash the windows and poke holes in the tires too.\n\nTo save my post from the 3000 character limit, I obviously pressed charges and my cousin is in legal trouble. Her and her parents are pissed off at me for pressing charges, her parents telling me that she’s “just a kid” and that she’s been through a lot of ‘emotional stress’ doing virtual schooling for this past year and that I should take that into consideration, and that I should be ashamed of myself for pressing legal charges against my baby cousin, that I’m almost 30 and dont I remember what I was like at that age? (I do remember, and I wasn’t stupid enough to egg anyone’s car) and can’t she work something out with me like doing chores around my house for money if I drop the charges... that she’s young, that she doesn’t need a felony on her record, etc. and that it was just a prank. Right after I press charges, my cousin was calling and texting me over and over saying that this could’ve been avoided had I let her take my car. \n\nAm I the asshole in this situation?\n\nI need to add that my cousin already has a felony on her record, a DUI. She’s not remorseful of anything.\n\nAlso, my aunt and uncle will not pay me for the damages. They just want me to drop the charges and pay for everything myself like nothing happened. They are cheap.",
  "id": 1,
  "comments": [
    {
      "score": 23249,
      "content": "NTA. Sure, you could have spoken with them first before pressing charges, but that last sentence was very telling. That she would text you and basically retroactively threaten you to let her take the car or she’d vandalize it says a lot about her character, and she’d probably have charges pressed against her at some point in the future anyway. Hopefully she learns a lesson to avoid that happening again. Also, chores around the house to make up for it? It’s called community service ordered by the judge.",
      "id": 2,
      "comments": [
        {
          "score": 6090,
          "content": "Chores around the house for money no less, not sure in what world we reward vandals with jobs for ruining other people's stuff",
          "id": 3,
          "comments": [
            {
              "score": 2505,
              "content": "I was thinking that part of the payment would go to repairs. But i wouldn't let such vandal anywhere near my house tbh.",
              "id": 4,
              "comments": [
                {
                  "score": 3173,
                  "content": "Also, I clean my own house so I have money for the things I want. If I have to pay someone to clean it so they can turn around and pay me for property they destroyed, that’s just me losing money on a housekeeper but with extra steps. It’s actually much worse, because I’ll have to supervise and nag and deal with things that never get clean like I want.\n\nThis business of paying kids for chores that you were never going to pay someone to do in the first place is for the birds.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1226,
                      "content": "If OP had her pay it off by doing chores, I'm betting all my 5 bucks she'd be maliciously misplacing stuff and hiding it, at best (since she doesn't seem repentant).",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 152,
                      "content": "Yes the good old broken window fallacy. Yet, the fact we still have to tell people why it doesn't work like that is depressing.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 124,
                      "content": "I would point out to the parents that since they are unwilling to take responsibility for poor-stressed-out-by-online-school (teacher here: cry me a river) then your ONLY course of restitution is charges. \n\nQuite frankly, I think the best thing is for a judge to pass a sentence where she has to pay it off and not her parents. Period.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "familiar fear agonizing deranged slimy unused hard-to-find berserk sloppy tease\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 44,
                      "content": "yeah because at least a professional housekeeper would possibly have experience and training, and would definitely want to do a good job because either they work with an agency or they want you to recommend them to your friends.\n\nA spoiled cousin being forced to do chores has no motivation to even show up, much less do a good job.\n\nIf the parents wanted the OP to go easy on their kid, they should have offered to pay for repairs before even talking about the charges.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Right!! Having someone clean your house to “earn” the money to pay for something they broke is something you do to small children as a lesson. It teaches them the value of things and demonstrates you had to work to buy said thing. I did this with my daughter when she broke the light fixture in her room with a bouncy ball after being told not to throw it in her room for that exact reason. She was 8. The light fixture was $25. \n\nDestroying the paint job on someone’s car as “revenge” for not getting to borrow it is next level insane. If I had to guess, it’ll probably be $1k or more *and it’s on a leased vehicle*. So if they have to deal with any of it they will charge OP up the ass because that’s how it always seems to go with leases.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Paying kids for choirs so they learn the value of money, work, and saving up for something is a good thing. Even if you otherwise wouldn't pay someone to do it. \n\nIt's a kindness. \n\nBut in this case? Absolutely not!!!\n\nIf her cousins would have come to her saying that she wants to safe up for a car, and can she do some stuff around the house every week, that would have been nice to say yes to. \n\nNot this.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I would ban her from my property.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yeah I never understood the concept of kids working for someone after they destroy their property. When I was a kid and learning to ride my bike, I accidently ran into someone's car and broke their headlight. I told the car's owner and my mom what happened right away. My mom paid for the headlight and took half of it out of my allowance. The other half was my reward for being honest and accountable for my actions (I was 7 and had really bad social anxiety even as a kid so knocking on a stranger's door and admitting wrongdoing was a big deal). That is the right way for parents to deal with that situation, make sure that the person whose property was damaged is taken care of and then you can work out how your kid pays you back.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Exactly this- AND would you trust someone in your house with your things when they have already destroyed thousands of dollars worth of stuff? Geez if I were OP I'd press charges and the next move I made would be to file a civil claim against the kid for the paint job. \n\nAs for the aunt - LOL - I'd respond to her with, \"I just got this from her (the texts saying if I'd just let her use the car it wouldn't have happened).. Maybe if you'd just given her a car for her birthday she wouldn't have felt the need to do this.\"",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 474,
                  "content": "Now think if she was dumb enough to vandalise the car, what she’d have done if she was allowed to go on an out of town trip in it. She definitely would have sped and drove recklessly. OP dodged a bullet, no, a missile, by not giving the car. NTA",
                  "id": 16,
                  "comments": [
                    {
                      "score": 158,
                      "content": "I wouldn't give my car to anyone that didn't show they will not break something(but i am little paranoid whenever i lend someone something anyway). And i think OP just dodged ICBM. This cousin haven't learn a lesson and i wonder what would she did if she run into police patrol, run away and blame OP?",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 123,
                      "content": "She’s 18 and already has a DUI? That should end the conversation right there.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 83,
                      "content": "OP’s cousin already has a felony for a DUI and is not the least bit sorry. So I dont even want to imagine the shitshow if she did give her the car for the weekend",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "Also hopping on this to ask - I don’t know where you are OP, but what about insurance for driving it? In the UK at least each driver has to be insured on the car. You can get it just for a few days, but it can be super expensive if you’re young and haven’t had a licence for long. Were mummy and daddy gonna cover it, or was she just assuming she’d take it without and you’d cover it when she almost inevitably fucked up your car?",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I genuinely thought that she'd came and took the car anyway and this is what happened.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "And she already had a dui.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "That's a lot of chores to cover a repaint on an suv, I'm talking cooking, cleaning  out the gutters, sweeping, mopping, grooming the dog, giving the cat a bath (without leather gloves of course because eh fuck her) and of course replanting the flower beds, for at least 6 months.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 91,
                      "content": "Well, better if cousin find a job to pay it. Probably he rparents have no idea about real cost or just don't want to pay do they came up with this, thinking if OP agree and see how bad cousin is doing OP would just let her go after a month or so.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Something she can just as easily do for her own parents. Her parents can either pay out of pocket for her decisions or deal with her having another charge on her record.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "She's gonna spend those 6 months spitting in food when OP's not looking too lol",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "You wish to inflict that person on a poor cat?\n\nReally??",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Way more than that. Repainting a car costs thousands. Since Op is leasing the car they have to give it back in pristine condition.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "Yeah because the next logical step after a vandal damages your car, is to let them have more access to your belongings.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 68,
                  "content": "Seriously! She reached a car. Why would anyone let her in a house? So she can pound shit into a carpet???",
                  "id": 30,
                  "comments": [
                    {
                      "score": 10,
                      "content": "They see she is a kid and think, poor baby made a mistake and needs to learn. That would work if the kid had an morals. She also has a DUI charge. I wouldn't let her anywhere near me. And I would let the courts handle it.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "pour concrete/litter/similar into a toilet?",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "So they're suggesting OP would pay her cousin to do the chores so that her cousin could pay her back for the damage?  So basically OP would be paying for it herself.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yes, this basicly it. Maybe op might earn that money back in the saved time but i doubt OP would be able to.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "And OP would still have to pay for her own repairs. Usually people who are sentenced to community service still have to pay a fine.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yeah, letting such an entitled brat to clean my house? No way. I can guarantee that she will have an attitude and sabotage the whole process. OP, avoid chores from her at any cost. She will make more damage than good.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "NTA, also press charges on the friends of hers that vandalized your car too.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 284,
              "content": "This is the worst part \"dont press charges against stupid entiteled family. Instead, let her do chores you do yourself now AND obvioulsy pay her\"",
              "id": 38,
              "comments": [
                {
                  "score": 173,
                  "content": "Having her do chores around the house is a punishment for kids. Unfortunately for op's cousin, she's an adult and has to face the consequences. Op keep fighting the good fight against her enablers too.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 84,
                      "content": "That kind of thing seems appropriate for something that's negligent and small-bore.  Like, say, if the kid had run over OP's petunias when returning the car after borrowing it with permission.  An afternoon in the garden replacing the petunias would be appropriate in this case.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Yeah but the demand for payment makes it just plain stupid and not a punishment anymore. It's like \"Oh you destroyed my house? Yes build it right back up, I'll pay you, no worries\"",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "So, OP is still pretty much paying to fix her car while risking her stuff being vandalized or stolen. Absolutely not.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 111,
              "content": "\"Come and clean every week for a year.\" - would last a month at most, before she does not feel like doing it anymore. And her parents would probably support her in that. This kind of behaviour rarely rises on its own.",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "Yes. “You should let her do something you pay her for, and then she can pay you back!” \n/sarcasm\n\nMaybe she should get a real job and have the wages garnished to pay you back. She, and her family need to grow up and enter the real world.",
              "id": 44,
              "comments": [
                {
                  "score": 25,
                  "content": "How much do you want to bet that not a dime of OPs money that she paid the cousin would make it back to OP?",
                  "id": 45,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Without it being garnished? \n\nNot taking that bet.\n\nHer parents and half the family are making excuses for her; that makes it easy for her to be the horrible person she’s being, and she’s probably gotten away with far more due to this enabling type of behavior.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 55,
              "content": "TheKuhn: Yeah I thought \"chores for money\" was weird.  Or ballsy. Who was supposed to pay the 18 yr car-egger for these chores, the OP?  If the egging/TP did any paint damage (or just the cost of having the car cleaned of the egg...I had my car egged yrs ago in front of a friend's house in the summer...it was awful to clean in terms of work and carwashes), the 18 yr egger needs to pay OP, not OP \"forgiving the money\" or even paying her.  \nOP is so NTA here.  There is good clean fun of teens, like TPing a house (a waste of good TP during an pandemic but 'clean'), but egging a car (or a house, anything) in the heat is NOT fun, it's vandalism.  Not sure whether it will rise to a felony like the family asserted, but if life is just, the egger will have a misdemeanor on her record and some kind of legal punishment.  She sounds like a spoiled kid, and her parents sound like enablers (or passive-aggressive).",
              "id": 47,
              "comments": [
                {
                  "score": 3,
                  "content": "Doing chores to pay back a debt is an appropriate punishment, imho, if (1) cousin was under 15 years old and couldn't have a job, (2) the parents were paying the chore-earned money to OP (in what world does it make sense for OP to pay for this??) and (3) the damaged item was either of minimal worth, or the damage itself was minor. The parents are idiots for even suggesting it in this case.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "That's...not how it works",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Sounds like the cousin would not be getting paid directly, but that would be her way to work off the cost of fixing the car.\n\nWhich is ridiculous, because then OP is paying for their own repairs and just getting their house cleaned (or possibly getting nothing depending on what this cousin is like) or if she puts it through insurance she would have to pay the higher rates.\n\nAt the very least I would have expected the cousin to get a job, like she should have in the first place to pay for her own car, and pay OP back for the cost of the damages. Then she would see just how much work it takes to pay off something like that, and if she ever pays it off and can work towards her own car, I think she would have a much greater appreciation for its value.\n\nPressing charges is probably what I would have done if I wasn't paid back fully immediately tbh, assuming this was someone I wasn't close with like OP says, so NTA from me. I was that age once too, and I would not have done any of those things, so I don't see how that stance helped them. If I wasn't close to an older cousin, I wouldn't have been texting them about anything. Very weird family dynamic",
              "id": 50,
              "comments": [
                {
                  "score": 8,
                  "content": "Right, most of us on here are not too far off from 18 anyways.   I’m 30, and not only do I remember 18, I still FEEL 18 in my head.  At neither 18 nor 30 would I destroy someone’s car—and even if she was unaware the egging would actually cause damage (she may not have known and only thought she was leaving a mess and no damage), I wouldn’t have even egged someone’s car anyways.   The most damage I ever did at 18 was sneak to a friends house and draw dicks in sidewalk chalk surrounding his car.    OPs cousin is actually way more vicious than most 18 yr old girls.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Also, she fucked up her car because she was pissed so she is gonna trust her to be in her  house with all the rest of her stuff?!",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I would never let someone who destroyed my brand new car into my home.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Seriously. “Hey she destroyed one thing of mine, let’s give her opportunity to mess with more!”",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1854,
          "content": "NTA also show the police those texts from her about her saying \"this would have been avoided if you loaned me your car\". This implies she knows it was wrong but still did it. Its very incriminating.",
          "id": 55,
          "comments": [
            {
              "score": 659,
              "content": "Yes! She is just making one stupid mistake after another and digging herself a shallow grave. My first thought with the text after the fact was to present it to the police. \n\nIt not only shows guilt (I mean, the security footage shows that as well, obviously) but it also shows premeditation and intent, as well as glaringly obvious lack of remorse. \n\nIf she has any remorse at all, it's only that she is having to actually pay for her mistakes. Op didn't ruin her life, she's succeeding in doing that herself. Spectacularly, I might add.",
              "id": 56,
              "comments": [
                {
                  "score": 258,
                  "content": "I think egging someone's car shows enough intent as it is. \"I had just bought a bunch of bog rolls and some eggs and on my way home, my friends and I came past the house and egged it on a whim, your honour\" is probably not going to carry the room.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 159,
                      "content": "Your honour I just threw a bunch of eggs and toilet paper in random directions, its not my fault they just all accidentally happened to expertly land on this one car that coincidentally happened to be the same car my cousin refused to give me! I'm innocent! I swear!",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 52,
                      "content": "No, it definitely won't, but they also can't even try a heat of the moment type thing, not that that would save them.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "yeah but if she goes to court and does the \"it was a spur of the moment bad decision, boo hoo hoo i learned my lesson I'm so sorry!\" thing, the text messages contradict that.\n\nkeep all evidence.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 338,
              "content": "This exactly.  Send it to the police and can guarantee damages will be covered.",
              "id": 61,
              "comments": [
                {
                  "score": 32,
                  "content": "They might be able to demand restitution as part of any plea bargain, and OP should. Because you just know without a court backing the aunt and family will never pay to fix OPs car.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "I would show her parents the text msg.",
              "id": 63,
              "comments": [
                {
                  "score": 176,
                  "content": "I would, too, but I doubt it will move them since they're the ones that raised such a brat.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Seriously.\n\nI can’t imagine *expecting* a car as a gift, not at that age and not now.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "And it's all their fault anyway, because by the logic that family goes by, this wouldn't have happened if they had just bought their daughter a car for her birthday like her entitled little existence is expecting. You could take it further and say that it's also their fault for raising a spoiled brat who has no boundaries or respect for other peoples things. I suspect this cousin has been a lite spiteful brat and the bain of the family gatherings for years, and OP is the hero who finally teaches her a life lesson.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I wouldn't. They are already trying to cover her tracks. They don't care. If I were OP I wouldn't communicate with these people at all. I would take these text to the police immediately and I would be done. But I have dealt with abusive family. For example, my dad tried to hurt me and threw my husband over a table. We called the police. My entire family said we lied about it to protect my father. They were more people, they covered it up and now it is hard to prove he is violent as he and my mom are stalking us and using the police to harass us. You don't give dishonest people a chance to fix their mistakes. They don't fix things. They cover their tracks.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "YES Please. your BABY cousin needs some sense knocked into her head. She is a legal adult so she cannot excuse her behavior by saying she is still a kid. Although i firmly believe that situations can differ but in this case, SHE KNOWS BETTER.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "And shows no remorse. Important for sentencing",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "yeah seriously. if you're going to say something that stupid and self-incriminating, then jeez, don't write it down.\n\nthere is no way this kid isn't going to end up in prison soon. not only is she an AH, she obviously has no self-control.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "*Mens rea*.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 386,
          "content": "NTA. What the cousin did with her last comment is victim blaming. It’s like saying, ‘Well you shouldn’t have worn such a short skirt’.\n\nThis young woman is a criminal.",
          "id": 72,
          "comments": [
            {
              "score": 125,
              "content": "Yep, proof that cute little baby monsters grow up to be irresponsible, malicious felons without any sense of boundaries or consequences",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "^^^^^",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This! OP, you are doing her a favor by forcing her to learn this lesson now. Based on her reactions, you’d be doing her a disservice by not pressing charges. She needs to learn consequences. NTA",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 338,
          "content": "\"this wouldn't have happened if you let me take the car\". I don't understand this kid. She's facing legal action against her and somehow she thinks OP is the one in deep shit? This kid is likely going to have a criminal record. It's going to affect her job opportunities while OP is going to be compensated for damages. I don't see how OP is the one in trouble. \n\nEither that or she is so self pitying, self absorbed and self centered that she actually believes she had a right to the car. Now that she's facing the consequences it's OPs fault for not giving her the car. Either way she needs a reality check.\n\nI have no sympathy for her. I know that by 16 you'd have more than enough consciousnesses and maturity to know never to do this kind of shit. Let alone at 18. She 100% knew the impact of her actions. She should fully bear the consequences.",
          "id": 76,
          "comments": [
            {
              "score": 47,
              "content": "Probably the second paragraph.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "She is 18. Legally an adult, not a kid. It's an either/or situation. (But I think in many countries above a certain age but under 18 they can also face repercussions, they just won't be as severe.)",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 151,
          "content": "Well all arguments presented by her parents can be taken into account in court, unless they live on some third world country. But her reaction in the end shows that she realy does not deserve not taking it to court. Like how stupid she is not to follow her parents idea and beg for forgivness. Also now OP have proof of her intentions that could destroy her defence in court.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 145,
          "content": "I just keep thinking, I was an emotional 18 year old girl once. I would NEVER do this to someone’s car. I say throw the book at the girl. It’ll teach her a lesson about respect (especially for property) because her parents have clearly failed on that front. NTA.",
          "id": 80,
          "comments": [
            {
              "score": 6,
              "content": "OPs cousin seems like the girl everyone knew in highschool who called her mom a bitch to her face. Absolutely could not understand this kind of disrespect and entitlement.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I put cream cheese on a door handle of a car once. It was the car of my bully's mother. I was twelve and still regretted doing it, even though I didn't get caught.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "Also what was she(the cousin) even going to do after the day and all her friends noticed she didnt have a car?",
          "id": 83,
          "comments": [
            {
              "score": 149,
              "content": "This is far fetched, but... \n\nMaybe she was planning on like... crashing the car? Then she can tell her friends (with proof) that she crashed her new car and now she doesn’t have anything to drive. She probably thinks OP can just get a new one from the insurance money (because she isn’t thinking about fraud or the terms of the insurance). She’s obviously very selfish and scheming so I think she’d be capable of something like this. Maybe OP can even ask her and she’d spill the beans",
              "id": 84,
              "comments": [
                {
                  "score": 60,
                  "content": "The problem is that OP doesn’t even own the car! She has leased it. It is still the property of the dealer snd no insurance would be coming to OP. In fact, under the terms of the lease, I bet no one except OP (or her immediate household) is even allowed to drive it.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 30,
                      "content": "You think the little menace knows and understands something like that when she can't even comprehend that vandalism is wrong?",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Wow I didn’t even think of that!",
                  "id": 87,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "She wanted it for the weekend.  Maybe she was going to crash and total it.  In any case I am sure it would not have ended well.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "Also, the car doesn't technically belong to OP. It is a lease, the OP pays monthly for the value of the car she is likely to have \"used\" when the lease period ends. I don't think the actual owner of the car, the dealership, will be best pleased if in 3 years time OP takes it back in that condition and explains \"hey, it's alright, my cousin who damaged the car cleaned my house for a while. We cool?\"",
          "id": 89,
          "comments": [
            {
              "score": 58,
              "content": "The car technically belongs to the leasing company. In OP's case (if they were in my state) the title to the vehicle would have OP's name with Ford Motor Credit as the first secured interest. At the end of the leasing term, OP would bring the vehicle to a Ford dealership and sign paperwork turning the vehicle back over to Ford More Credit (assuming they didn't decide to buy out their lease which is a different process).\n\nOnce the vehicle is turned in, it is inspected by a third party vendor who notes all the dents/dings/chips/damage. Normal wear and tear doesn't cost extra, but the damage done by the eggs definitely will incur a significant financial penalty if it isn't dealt with. OP is NTA for pressing charges.",
              "id": 90,
              "comments": [
                {
                  "score": 13,
                  "content": "On a positive note, if you lease you are generally contractualy required to hold comprehensive coverage.  I'm not aware of a policy that wouldn't cover vandalism, so OP would only be out her deductible and not the total cost of repairs.  Repainting costs generally run $500 per body panel from a decent body shop FWIW, so if it was out of pocket this would be a massively expensive repair.\n\nOP was smart to file a police report so her insurance knows the liable party.  It's also likely that OP's insurance company will sue her cousin's parents to recover those damages.  Since it was vandalism, their auto insurance clearly won't cover it, but it's possible that their homeowner's might.  if not, it's coming out of their pocket.\n\nAFAIK as long as any damage to the vehicle is repaired by a licensed mechanic/body shop, a lesee is generally in the clear as far as penalty charges might go on lease return.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 8,
                      "content": "The person that vandalized the car was 18. They're not going after the parents they're going after the girl.",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I dunno about that country, but in mine, we immediately have to notify the owner company about any damages that requires repairs to be done. (And also, the offending party's insurance group pays for it to be fixed or the party itself - which in this case it would still be the girl and her parents.)",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I don't know how it works in the US, but was OP even legally allowed to let the cousin drive the leased car, had he wanted to? When I rent a car, only the people who are listed in the rental contract can drive it (and extra drivers usually raise the price).",
              "id": 94,
              "comments": [
                {
                  "score": 8,
                  "content": "That would depend entirely on OP's insurance policy, but probably not. Given the age of the cousin, OP would pay A LOT higher a premium to have cousin listed as an insured driver. \n\nLeases are quite different from rental. With a lease, the individual customer is the first listed name on the title to the vehicle with the leasing company listed as the first secured interest. In plain language, OP has ownership responsibility for the vehicle, but the leasing company has a kind of co-ownership for the term of the lease, then the vehicle belongs to the leasing company again.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "So OP should also have pay for the repairs? Having the cousin work around the house is still costing OP money. No. Cousin should get an actual job to pay for the repairs.",
          "id": 96,
          "comments": [
            {
              "score": 24,
              "content": "and as others mentioned, she could've done worse stuff in the house.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 78,
          "content": "NTA - the fact that she is saying it’s your fault for not letting her use your car shows she’s learned nothing from this yet. If you drop the charges she still won’t learn anything and will continue to go through life thinking everyone owes her whatever she wants. \n\nLet’s say you drop the charges, what happens next time she wants something?",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9354,
      "content": "NTA please update us as well, I wanna hear her suffering the consequences of her actions.",
      "id": 99,
      "comments": [
        {
          "score": 6965,
          "content": "If OPs cousin ever says \"this could have been avoided if OP lent her the car\", tell the cousin's parents \"this could have been avoided if they had bought her a car,\" thus leaving the blame where it belongs - on her parents for being  cheap, and yet managing to raise an entitled brat.",
          "id": 100,
          "comments": [
            {
              "score": 3799,
              "content": "[deleted]",
              "id": 101,
              "comments": [
                {
                  "score": 506,
                  "content": "Doubling-down and upping the ante. Nice.",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 106,
                  "content": "Thanks for the laugh first thing in the morning!",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Tell them THEY could have been avoided if their parents used condoms.",
                  "id": 104,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Too cheap to buy one",
                  "id": 105,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Your father should have shot you on the floor.",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 390,
              "content": "[deleted]",
              "id": 107,
              "comments": [
                {
                  "score": 295,
                  "content": "OP's cousins parents definitely are, if they promised and set the expectations that their beloved Child is going to get a car, then cheaped out by not doing it. IMO if the kid wants a car they get a job and don't get the car till they earn enough to buy a clunker and pay for insurance / gas. This teaches accountability, responsibility and the value of the almighty dollar which only happens when a person has to earn something versus having it handed to them.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 465,
                      "content": "I doubt they did. All OP said was that cousin *thought* she was getting a car. Given her sense of entitlement, she probably demanded her parents buy her one, not that they promised her one.",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "I doubt they did. It sounds a lot like she has expectations based on her friendship group.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "More likely that a friend or two of hers got a car and she expected one too.",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Anyone want to place bets on the parents privately deciding their darling daughter wasn't responsible enough yet for her own vehicle? Next bet is they found out how much it would cost to insure a vehicle with daughter as the primary driver.",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I’m guessing it was less then setting an expectation, and more her assuming her parents were going to buy her a car.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "When I was a teen, I had a friend whose parents promised him a car for his 18th birthday ... and got him a Hot Wheels.  His parents thought it was funny, but my friend was pissed.  He didn't vandalize anybody's car over it, but there was some yelling involved.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 64,
                      "content": "That’s pretty shitty to be honest.",
                      "id": 115,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "That's a shitty joke. I could see my family doing something like that, but in one of the Hotwheels boxes would be the key to an actual car. Let the kid roast a bit thinking the jokes on him, then realize that he's actually getting a car and the Hotwheels were the joke.",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "No, but their attitude towards the whole situation is - expecting OP to drop the charges and so on.",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 175,
              "content": "This would have been avoided if they had nod raised a entitled little prick tbh.\n\nNTA - I would have considered dropping the charges if parents had offered to pay for the repairs in full and then some but like that? nah.\n\nAnd household chores? As if that young woman would set foot in my house for the forseeable future....",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "This could have been avoided if they brought up a child to not think she has a given right.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Parent's being cheap? WTF just because the kid is 18 doesn't instantly warrantee they'll get a car. That's entitlement if they are to blame is because they raised Bratty McBratButts.",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "> this could have been avoided if they had\n\nraised her right.  \nFixed",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yes! And it also could have been avoided by cousin not lying about or expecting to get a car for their bday. She’s entitled and her parents are enabling her (and her friends).",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "I hope she dose to",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "I'm just shocked, why the parents didn't offer to repair the car since its their \"kid\" or why is she angry at you and not her parents? You know for not buying the car.",
          "id": 124,
          "comments": [
            {
              "score": 142,
              "content": "She can't vandalize her parents' car because then she would lose her support group ahahah. Imagine pissing off the potential car buying people in your life. Of course you're going to direct your anger at the next \"selfish\" person that didn't bend the knee to your demands. \n\nWell little princess here just got a good taste of being 18. A stained record that will stank up her chances at getting a scholarship/ good job. Welcome to adulthood baby.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Because why pay for repairs when you can bully a family member into dropping the charges. She got her attitude and entitlement somewhere and I can tell you where lol",
              "id": 126,
              "comments": [
                {
                  "score": 27,
                  "content": "When he can save his daughter's life by paying for the repair and asking to drop the charges, he chose the other way.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I mean he can’t. She’s already got a felony on her record.",
                      "id": 128,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "Yes OP please keep us updated about what happens!",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "NTA yes please keep us updated! Also are the friends that helped also on the hook?",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Remindme! 14 days",
          "id": 131,
          "comments": [
            {
              "score": 4,
              "content": "Remindme! 14 days",
              "id": 132,
              "comments": [
                {
                  "score": 4,
                  "content": "Remindme! 14 days",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7336,
      "content": "NTA\n\nI was \"just a kid\" once and didn't egg anything. \n\nAlso, ruined paint on a vehicle isn't something one works off with chores. It's something one gets a job and pays for with money.",
      "id": 134,
      "comments": [
        {
          "score": 1302,
          "content": "Agree, ask the parents to pay for the repair and let the cousin work their chores lol",
          "id": 135,
          "comments": [
            {
              "score": 868,
              "content": "NTA\nWhat \"ask\"? Sue them all in small claims court for damages and restoration.\n\nEdited Adding NTA of course.\n\nAnd to say ok, not ALL of them. Just the dumb idiot vandal.\n\nOf course your insurance may cover everything except for deductible, in which case sue for the deductible.",
              "id": 136,
              "comments": [
                {
                  "score": 344,
                  "content": "Small Claims...\n\nRepainting a Car WILL be at least three Digits. Easily Four",
                  "id": 137,
                  "comments": [
                    {
                      "score": 314,
                      "content": "Yeah, but small claims limits can range from $5000 to $15000.\n\nEdit: I guess I just assumed that by listing  a range of limits, I did not have to explicitly specify that it varies by state. I figured most people would be smart enough to understand that.",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 60,
                      "content": "I thought small claims awards went up to $5000.",
                      "id": 139,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 158,
                  "content": "I have dealt with vandalism through the police, no need for small claims, they will pursue her, issue a warrant and she will be responsible for all damages and paying it back. There was jail time involved for the person who destroyed my partners vehicle and they are on probation that only ends when they pay the damages off, if they do not, they will be in even more trouble.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "Can't she the parents any more, cousin is an adult",
                  "id": 142,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Ask first, then sue if they say no.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Fair enough.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Cousin is 18, legally an adult. I'm not sure you can (successfully) sue the parents over something an adult did. Sounds like the cousin herself has no assets so any judgment would be unenforceable. The only person coming out goof from a lawsuit is OP's lawyer.",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": " Cousin is 18. How will the parents be liable?",
                  "id": 146,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Its easier to get restitution as part of the criminal case",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "^^sorry ^^but **↑THIS!!**",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 945,
          "content": "Plus honestly after this stunt if I were OP there is no way I'd trust this cousin into my house, she's done it once who's to say she won't do some other petty shit again when you're not looking\n\nSo no, we can't \"work something out with chores\"",
          "id": 149,
          "comments": [
            {
              "score": 11,
              "content": "That's a really good point, especially since the cousin isn't remorseful.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "She's 18.  She's not 'just a kid', she's an adult.",
          "id": 151,
          "comments": [
            {
              "score": 130,
              "content": "Right. I turn 18 in a month, if I were to egg somebodies car because I was throwing a tantrum my parents would beat my ass so fast and tell me I deserve any charges they pressed",
              "id": 152,
              "comments": [
                {
                  "score": 77,
                  "content": "That's the way it should be!  And let's be honest, we would all know this is wrong at least 10 years before we turn 18.  Her parents are clear enablers who condone this sort of thing.  She could equally complain that if her parents had bought her a car it wouldn't have happened either.  It's all equally BS and I'd be getting that footage to the police and providing them with the names of the friends who helped her too.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 4,
                      "content": ">Her parents are clear enablers who condone this sort of thing\n\nYup. They obviously didnt punish her after the DUI, so whats a little property destruction?",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 98,
          "content": "I agree, don't get me wrong, but I would consider not pressing charges on the basis that her parents figure out a payment plan. It's up to them to parent her how they want (e.g. she does chores for them to pay them back the money or she gets a job to pay herself but parents make damn sure she's paying). \n\nI think a lot of young people are over-criminalized and I'd factor that in. But it would be with a strict, clear offer and a notarized contract with her parents and no alternative besides continuing with charges.\n\nCousin is a total AH 100% and deserves the charges if she _and_ her parents won't take responsibility.",
          "id": 155,
          "comments": [
            {
              "score": 297,
              "content": "The parents aren't even entertaining the possibility of a payment plan if they're not even willing to treat the situation as seriously as it needs to be considered. \"Just a kid\" behaviour would be if the cousin was 6 and spilled a drink on the interior. This is malicious vandalism and the \"this wouldn't have happened if you had let me use the car\" message clearly amplifies the fact that the cousin knew what she was doing.",
              "id": 156,
              "comments": [
                {
                  "score": 96,
                  "content": "This is the big part. The cousin wasn't saying how sorry she was that the car was ruined, she didn't realize eggs would do that ect. She's standing by her decision and trying to blame OP somehow that if she'd be lent the car none of this would not have happened. Not that if she made better choices then she wouldn't be dealing with the legal system.\n\n\nNTA OP.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "The cousin is an abuser in the making! I feel bad for her future partners...",
                  "id": 158,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Honestly? Even with as little given about this family and the dynamics, I wouldn't be surprised.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "As much as I really hate doxxing, some of these posts make me wish I knew these peoples secret birthmarks or something. My worst fear is going on a date with the subject of one of these posts after Reddit makes them single again.\n\nNTA OP. Cut this chick from your life.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "I'd agree with you about that if this were for a younger teen, but the cousin is legally an adult.  And its not like she stole a loaf of bread because she was hungry, she damaged another person's property because she didnt get her way. Leniency should be reserved for when the person shows true remorse for their actions and learns from their mistake, not for when their comeback is to the blame the victim for not giving them their way to begin with. Also, she seems kind of like a spoiled brat, letting her off the hook could very easily show her she can get away with behaving badly and she wont have a reason to change.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "I agree with this in theory, but being as even with looming criminal charges the cousin is still blaming OP instead of taking some responsibility. If the police aren't enough to make her see she's done wrong some chores and her parents paying off her 'mistakes' aren't going to anything other than let her think she can carry on doing as she pleases.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Her parents would just pay the money and the cousin wouldn't face any consequences. All that would teach the cousin is that she can do whatever she likes and her parents will just bail her out.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Her and her parents are clearly assholes who don’t think she did anything wrong, since she’s “just a kid”. And she is clearly an entitled asshole since, “this wouldn’t have happened if you’d have leant me the car”. Screw her. OP will never get their car repaired if they don’t press charges.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "Especially since the leasing company will consider that excessive wear if not fixed before the vehicle is turned in. No matter how you cut it OP is going to end up paying for cousin's temper tantrum. \n\nNTA. 18 is old enough to know better.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Ruined paint on a *leased* vehicle, no less. OP has to return this car in a couple years, and it needs to be in good condition. NTA, OP.",
          "id": 166,
          "comments": [
            {
              "score": 7,
              "content": "Indeed, leased.  It isn't even really OP's property.  OP could claim the leaqing company \"forced\" him to press charges, or otherwise they would have.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I was just a kid and was apparently very boring, because I didn’t do that, either. In fact, I was just a kid when someone in the neighborhood stole my license plate, and then when I got new plates, stole one of those, too. I also found leaves and twigs shoved up my exhaust pipe on more than one occasion. We suspected a kid on the corner who was my age; if we ever had proof of who did it, my parents would have pressed charges, too, especially since around the same time, my dad’s car was vandalized with shaving cream. \n\nThey were shitty cars to begin with, but that didn’t mean we wanted them tampered with. This is also how I learned that shaving cream turns dashboard plastic opaque.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeh, exactly, by 18 you should be mature enough to know that egging someone's car is not something you should do no matter what",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4794,
      "content": "NTA. Your cousin is a gaping asshole for blaming you, and her parents are assholes for enabling her BS. Press charges and make her pay for the damage.",
      "id": 170,
      "comments": [
        {
          "score": 2807,
          "content": "Ya this is the craziest bit to me. An 18 year old can be a bit ridiculous but the parents effectively condoning it is bonkers... if I did that my dad would have made lick the egg off the car and then pay for the new paint job... wild",
          "id": 171,
          "comments": [
            {
              "score": 630,
              "content": "Hahahaha lick the egg off... that made me *crack up*.",
              "id": 172,
              "comments": [
                {
                  "score": 273,
                  "content": "Careful not to get too eggcited.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 167,
                      "content": "This is no yolking matter",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 138,
                      "content": "These puns are *eggcelent*!",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 76,
                      "content": "that's too eggstreme",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Eggxcuse me?",
                      "id": 177,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Or what the shell, make sure you do!",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "Very often in life you meet a raging dickhead and wonder why they’re like that, then you meet their parents and it all clicks :/ enabling is a hell of a drug.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "I often see people arguing about whether 18 is too young to be making good decisions and it's usually about them being in a relationship with someone who's like 28 or older. In that case, they are a kid and easily manipulated.\n\nIn this case? She's so obviously an adult! Like, 4 year olds know not to do this. Add to that how deliberate and spiteful it all was. Cousin is _such_ an AH and parents are showing exactly why with their continued shitty parenting.\n\nI understand not wanting her to have a police record, but in that case they should be begging OP to let them first sort it out with money and possibly other favours if relevant (I accept payment in chocolate personally, but maybe a tank of gas or a car wash would be nice a couple months after it's all fixed). And second, they deal with their daughter properly and without OP needing to be involved or blamed.\n\nPoor OP, I'd be furious.",
              "id": 180,
              "comments": [
                {
                  "score": 97,
                  "content": "That text from the cousin, saying all of this could have been avoided if she had just been lent OP's car, that's both a confession, and provides she had every intent to do it. Add in the security footage and she put her own nails in her coffin.\n\nHonestly, you'd think if you were going to do something like this, you would try to do *something* to get away with it. She really isn't smart.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Why does she need to try and get away with it, when the parents are helping her do it? If the cousin drops charges, she’s facing zero repercussions and has no need to pretend she didn’t do it. Haha.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": ">She really isn't smart.\n\nUh yeah, the DUI (under legal drinking age) proved that.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "My mom would've made me do the same too",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yep, I would have gotten tbe \"what the hell's the matter with you?\" talk from my dad and be forced to make it right. But I wouldn't do this because I wasn't a wild animal when I was 18.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 129,
          "content": "If she vandalized OP’s car for not letting her borrrow it, I wonder what she did to her parents for not buying her one. \n\nNTA",
          "id": 186,
          "comments": [
            {
              "score": 40,
              "content": "If she has a DUI already, I wonder what she would’ve done to OP’s car if she’d been allowed to borrow it.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "\"she's just a kid\" and \"she's been under stress\" is literally not an excuse for her trashy behaviour. If those parents did their job right and actually parented their demonspawn, this wouldn't have happened.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": ">her parents are assholes for enabling her BS.\n\nI want to take a moment to say I am DONE with people using \"because online learning\" as a blanket excuse for the full gamut of wrongs committed by their offspring. Kids are blowing off homework? Yeah, I can see how pandemic stress could lead to that. Irreparably vandalizing someone's car? No. That's not online learning-induced. Fuck those parents.\n\nNTA, OP.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I wonder if OP could have any monetary sources she has garnished if they refuse to pay. Like loans or college scholarships.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1967,
      "content": "NTA she's 18 and is an adult. \n\nIf she's going to act like that she can deal with the consequences.",
      "id": 191,
      "comments": [
        {
          "score": 602,
          "content": "[deleted]",
          "id": 192,
          "comments": [
            {
              "score": 128,
              "content": "So far based on my personal experience, every troublesome kids problem can be traced back to the parents. I think this “baby cousin” is spoiled",
              "id": 193,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "\"Baby\" cousin who without a car already has a DUI charge",
              "id": 194,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "If OP loaned someone their car when they have a DUI on their record, OP would be T A H to everyone else on the road. Especially since she's going out with her buds on her birthday. \n\nCousin's parents backed down from the car purchase for some undisclosed reason. And I could guess it has something to do with that.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1822,
      "content": "She lied to her friends, refused to accept no for an answer, trespassed and committed vandalism and property damage.....and YOU are the asshole??..... I'm trying desperately to understand that leap..... anyone else??",
      "id": 196,
      "comments": [
        {
          "score": 459,
          "content": "OP should tell her parents, \"It's not my fault you did such a shitty job raising your daughter that you think adult consequences won't affect her if you just whine about it. Also unsurprising she turned out the way she did considering your immaturity in this situation.\"",
          "id": 197,
          "comments": [
            {
              "score": 6,
              "content": "This exactly. Very bad parenting on their part. OP is NTA by any stretch of the imagination.",
              "id": 198,
              "comments": [
                {
                  "score": 4,
                  "content": "And come on - she's already got a DUI at that age and her parents are *still* trying to make sure her bad actions have no consequences? That is some *unbelievably* bad parenting.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": ">OP is family and family shares their personal wealth and their cars with the less fortunate and by lending the car, OP would have made others happy on a day when there was going to be disappointment to a young lady walking into the adult world but is still the baby in the family. \n\n>As OP refused to share her rich life with her brand new car, karma has done her justice and made sure she understands that by not helping the less fortunate, God has judged and sent her his wrath in the form of vandalism of her most precious and prized possession\n\n\nI do not believe in any of this horseshit and I kinda think that's how insane cousin think.",
          "id": 200,
          "comments": [
            {
              "score": 12,
              "content": "Her and the rest of the family apparently",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "Right behind you. The leap is crazier than the one Vin Diesel took in Fast and Furious to save letty.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1036,
      "content": "NTA. She's not \"just a kid\". She's old enough to understand action = consequences.",
      "id": 203,
      "comments": [
        {
          "score": 257,
          "content": "[deleted]",
          "id": 204,
          "comments": [
            {
              "score": 110,
              "content": "Nah people like her rarely learn. \nIt's everyone else's fault never theirs",
              "id": 205,
              "comments": [
                {
                  "score": 9,
                  "content": "Oh the joys of entitlement and narcissism. She really went hard on fucking herself early on in life.",
                  "id": 206,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "It’s so nuts. I’m definitely the type of person who, when I fuck up, my knee-jerk reaction is to try and blame something out of my control because I hate being in trouble. (I’m a fully grown adult woman lmao.) But the difference between me and OP’s cousin is that I would never be facing felony charges for vandalism in the first place, because it’s not even in my playbook to do something so obviously stupid.",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 50,
              "content": "Nah, the fact she messaged op to say this wouldn't have happened if she just gave her her car, shows that there's no chance. She's the victim because she didn't get her way",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 31,
          "content": "I'm pretty sure a 7 year old doing that would know it's wrong.",
          "id": 209,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "But but but but but she's family. \n\n/s",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "It doesn't even  matter though if she understands or not, she's 18 and she's now an adult. This  is why as parents we raise adults, not children.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 576,
      "content": "NTA. She decided to do something criminal because you said “no” and her parents are trying to enable her. Her excuse is... well if you didn’t say no I wouldn’t have done it? No. You are not to blame for this.",
      "id": 212,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 574,
      "content": "NTA - and the fact that she's *BLAMING YOU* because you refused to lend her the car says that her parents have been running interference for her entitled behavior for too long. \n\nShe's 18, she's a legal adult - play stupid games, win stupid prizes.",
      "id": 213,
      "comments": [
        {
          "score": 150,
          "content": "Honestly, OP is probably doing more for her development long term than her parents have done for her these 18 years, geez louise.",
          "id": 214,
          "comments": [
            {
              "score": 37,
              "content": "That's what I was going to say. Theres a kid that I grew up with, started with minor criminal stuff. Long story short kid broke into houses and cars with guns and robbed people. He was never punished the right way, never sat in jail until he decided he wanted to rob a house. Now hes in for a good long time",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Honestly what's even more baffling to me is that one of her friends probably had to drive them all over there...so why didn't that friend just take them all on a road trip instead?",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "For refusing to lend the car to an idiot with a DUI before she’s even legally old enough to drink! (Assuming this is in US or a country where legal limit is 18 but still mind blowing either way)\n\nAbsolutely NTA!",
          "id": 217,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 499,
      "content": "NTA. And with how enabling her parents are, I am genuinely surprised they didn’t get her a car.",
      "id": 218,
      "comments": [
        {
          "score": 203,
          "content": "Maybe I’m petty but I would have rubbed that in their faces. “Oh, maybe this could have been avoided if you just bought her a car!”\n\nNTA. They’re such idiots, and hold firm on pressing charges.",
          "id": 219,
          "comments": [
            {
              "score": 79,
              "content": "Save the text messages of her saying this could have been avoided if OP let her borrow the car and send them to her parents with \"this could have been avoided if you just bought her a car!\"",
              "id": 220,
              "comments": [
                {
                  "score": 17,
                  "content": "‘This could’ve been avoided if you just wore a condom!’",
                  "id": 221,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Even if OP ulitmately decides not to press charges, she should provide the police report and all evidence to her insurance company and file a claim.  They'll happily sue the pants off of the cousin and her parents to recover the repair costs.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Maybe they will now to appease her. Geez, sounds like such a spoiled brat.",
          "id": 223,
          "comments": [
            {
              "score": 28,
              "content": "Oh god you're right. That's what will happen. And to cheer her up because of how traumatizing it was to speak with the police.",
              "id": 224,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Kid in the neighborhood stole my brother's video games once.  His parents returned what he stole and bought him a newer system so he wouldn't be compelled to steal from his friends.",
              "id": 225,
              "comments": [
                {
                  "score": 3,
                  "content": "Nice, rewarding bad behavior. Kid will be an upstanding citizen I'm sure.",
                  "id": 226,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}