{
  "post content": "***Repost to comply with rules:***\n\nHi everyone,\n\nWhen I (33m) was younger, I was not the most popular kid in class. I did the musicals, and academic subjects. I wasn't much of a sportsperson, and not really very social. Toward the end of HS, I made quite a few friends and it got easier. But one of the \"popular kids\" - lets call him Jake - constantly taunted me - for my ethnicity, my body, my \"nerdiness\" and what have you. I have never forgotten it and constantly resented him for it.\n\nFast forward 15 years. Jake has done something very stupid and immature, and as a result, he has been in a coma for several years. I left my country when I graduated Uni, and now live in a major city abroad earning a pretty significant sum. I'm known in my field, and everyone I went to school with is aware of this. Quite frankly, the fat musical kid ended up the most successful graduate of his class.\n\nFor many years, the parents and friends of Jake paid his medical bills to keep him on a ventilator. I never really sympathised to be honest, and kind of thought he had it coming. Anyway, an old friend messages me the other day telling me that the gofundme is finished, and that the parents are almost bankrupt, and \"everyone\" would appreciate it if maybe i could kick 20-30k toward his medical bills. I laughed and said \"absolutely not, I work for my money and the last thing I want to do with it is give it to the person who made my last year at school a misery.\"\n\nNow I am being told I'm a selfish a\\*\\*hole for not helping because \"clearly I can afford it.\" This is despite the person asking knowing that I was mercilessly bullied by Jake. I kinda see it as Karma. I've made it in life and don't want to share the spoils with people who tried to belittle me.\n\nSo Reddit, AITA?\n\n&#x200B;\n\n**Edit: For all of you wonderful people suggesting therapy I appreciate you. But I’m not that kid anymore, I’m a successful professional, married to an amazing woman, with a beautiful daughter. I haven’t thought about “Jake” for many years - not since I saw the articles in the newspaper about his calamity. I am certain I needed therapy back then - but I’ve matured and come into my own since that time. I’m happy, healthy and satisfied. I love my life, I love my family, but most importantly, I love myself too. I don’t dwell on the past, but when somebody calls you for 20-30 grand, memories can come back to you very quickly.**  \n\n\nSecond edit: WOW! Thank you to all the amazing people who have helped me feel a little less shitty this evening. I am trying to reply to everyone and I'm sorry I have not published exactly why \"Jake\" is in a coma but I am trying to reply to DMs that ask. This community is amazing, I felt really shitty today and all of you have done so much to make me feel better about it all. THANK YOU THANK YOU THANK YOU. xxx",
  "id": 1,
  "comments": [
    {
      "score": 7314,
      "content": "Twenty to thirty thousand is a significant sum of money to just expect someone to contribute to a stranger’s medical fund, even if they can afford it. These people are ballsy for asking you to donate at all, let alone such a weighty amount. And it wouldn’t stop with one donation. They’d probably expect you to give a lot every year. \n\nNTA, OP. Go and live your good life without any guilt whatsoever.",
      "id": 2,
      "comments": [
        {
          "score": 3475,
          "content": "And hooked up to a ventilator, needing a private care nurse 24/7, 30 grand buys…what? 6 months of kicking the can down the road? In all reality, “Jake” died years ago and his body didn’t get the message.",
          "id": 3,
          "comments": [
            {
              "score": 2934,
              "content": "Body got the message, family didn’t.",
              "id": 4,
              "comments": [
                {
                  "score": 526,
                  "content": "Agreed. If OP really wanted revenge, he *would* help to continue cruelly keeping this poor guy's body running.\n\nNTA, OP. The absurdity of their request aside, there's nothing anyone can do to help them or Jake. He's gone. His family needs to let go. They're not asking for some operation to cure someone, just to keep the status quo for x amount of time that won't be eternity and will just require a constant supply of funds to maintain said cruel, horrible status quo.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 339,
                      "content": "I am an ICU RN and I wish more people would do this. It's cruel to watch what they are doing to Jake and way too many people never learned how to process grief or let go. So sad.\n\n\nEDIT: typo",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is sad, but true. The nicest and healthiest thing for all involved is to let Jake go.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "But can't they ask Elon Tusk for money, then get angry at him for not providing any? \n\nOr, in reverse, can I ask OP for 30k for my personal life? I mean it would help, and if I dont get it - I'll sure as hell be mad at OP for not giving me anything. \n\nNTA. You could shred, burn, or make tacos out of your income. The trick is - YOU decide - not them!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "Oh wow, this is so profound.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Truth. Been in a coma myself. Usually once you're on a ventilator you're done cause your body just doesn't recover and gets used to it. I came close to it but luckily didn't.  I would have gone insane at that amount of time in a coma (cause i could hear everything and even just 2 weeks was mental)",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Jake's not gonna get the money either. Family will 🤔",
                  "id": 12,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Family won't get it either really. Technically the doctors and nurses will.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "[removed]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Bad bot",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 288,
              "content": "I’d be shocked if 30 grand even paid for a month.",
              "id": 16,
              "comments": [
                {
                  "score": 96,
                  "content": "Youre right. At home nursing is around 20k a month, and that's for non comatose people.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 85,
                  "content": "US medical costs are multiples of most other countries.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Exactly - they are getting ripped off. Epipen in most of the world US$40-70. Epipen in USA US$400-700!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I believe that.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "My kid was in a coma for 2 weeks because of a seizure. Bill was 800k",
                  "id": 21,
                  "comments": [
                    {
                      "score": 56,
                      "content": "[removed]",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "My bill from when I was in the hospital for 2 weeks a 3 days was over $5ook and that was over 20 years ago in CA. I would not want to see what it would be now.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "My father had a seizure and brain bleed, 2 ops to fix it, then in a coma for 6 weeks. Woke up and went to rehab centre for 6 weeks then home and physio and surgical check ups.\n\nNo cost.\nWelcome to Australia.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "how do you even begin to pay that?!",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Yikes! My dad’s bill for the ICU was $100K for a week",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 128,
              "content": "This - so you give $20-$30K, you going to give it again next year and the year after that, etc. each time the coffers run dry?",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 92,
              "content": "[removed]",
              "id": 28,
              "comments": [
                {
                  "score": 283,
                  "content": "[removed]",
                  "id": 29,
                  "comments": [
                    {
                      "score": 80,
                      "content": "[removed]",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 47,
                      "content": "[removed]",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 48,
              "content": "More like 4 months.",
              "id": 32,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Then they will ask for more...",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Depends where I guess my husband was on a ventilator in a coma for less than a month and it cost half a million before insurance.",
              "id": 34,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Yeah, the whole ventilator thing. Also, yeah even if filthy rich I wouldn’t throw money at it. Cold? So what? \n\nSelf care, mentally to. Raise a beer or something. NTA",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I would have assumed in the USA that’s like 2 weeks",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": ">24/7, 30 grand buys…what? 6 months\n\nDepending on the country, less.      \nWhen my father was alive he had ALS and spent the last 2 years of his life in a full care facility that cost 12k/mth in Kentucky.      \nAnd that was back in 2015-2016.     \nToday it's probably 15-20k/mth.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 365,
          "content": "Agreed, but I'm petty enough that if I were in OP's shoes, I'd donate a significant amount to an anti-bullying charity in his bully's name. I'd make sure to post it on all my social media to drive the point across. NTA.",
          "id": 38,
          "comments": [
            {
              "score": 103,
              "content": "That would be a petty AH move imo. \n\nI mean I can't say I wouldn't do the same, but it would totally be a petty AH move.",
              "id": 39,
              "comments": [
                {
                  "score": 98,
                  "content": "How is donating to a good cause an AH move? It's a better use of the money than keeping his bully's dead body running.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Donating to a good cause is not spiteful. \n\nPosting on your socials, where his family will see it, that you could have kept him alive but chose not to? That's incredibly spiteful. It doesn't hurt the bully, it hurts his family.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Are you being purposely obtuse or did you miss the hit about doing it in the bully’s name?\n\nIt’s a terrible idea; it’s unnecessarily spiteful (and no, two wrongs don’t make a right) and it screams “my former bully lives rent-free in my mind”, which probably isn’t the message the OP wants to send.",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Nah it's a pretty sweet move.\n\nI would fund the guy's euthanasia.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Not offer 10 grand but only if I got to pull the plug.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Turning the machines off at the wall costs nothing.  Huge ROI.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Don't need to name the bloke. It's the thought that counts",
                  "id": 46,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It's the naming him and making it public that makes it clearly an AH move. You can choose to let him die and give the money to charity without rubbing it in the family's face that you are consciously choosing for their loved one to die.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 81,
              "content": "Or how about OP just keeps their $30,000? That sounds like a way better answer.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Oh I LOVE this!",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Plus tax write off bonus.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "YEP, this, 100000%%%%%%",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That's petty AF and I love it",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 247,
          "content": "Keeping a shell of a human alive like that is cruel to begin with. His family is choosing this… they cannot expect the free world to fund this delusion. And IF he wakes up, it will cost them MORE because he’s not gonna pop outta bed and want to have a coffee and a poop. And for people to call OP selfish for not throwing his money at his bully who - sadly - is likely getting his karma (yes it sounds cold, but remember - you get what you give) is absurd. NTA.",
          "id": 53,
          "comments": [
            {
              "score": 31,
              "content": "Yeah in a way Op denying them this money is actually helping his former old bully, helping him move on",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Yeah I worked in assisted living and one of our residents was in a coma for a little over six months after an accident. He's still physically disabled due to long-term muscle atrophy and will likely need to use a wheelchair for the rest of his life.",
              "id": 55,
              "comments": [
                {
                  "score": 2,
                  "content": "My cousins wife went into a coma shortly after having her daughter in 2000… he parents kept her alive. I don’t even know if she’s still alive now. He actually met a woman at that care facility in a similar situation after a few years and they are still together now with the blessing of his in laws.",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "I mean it would be outrageously weird to expect someone to pay even their best friend from high school's medical bills of $20,000, especially if they hadn't been in touch for years and years.  This is extremely NTA",
          "id": 57,
          "comments": [
            {
              "score": 92,
              "content": "Honestly I was expecting OP to be asked to contribute $100 or so and I STILL thought he was NTA for refusing to contribute to his bully.\n\nBut astounding that anyone could think someone should donate $20,000 to a stranger let alone someone whose limited relationship with consisted of being bullied.\n\nHe should be taken off the ventilator and allowed to die in peace. I have a POA with a trusted friend who knows that I do NOT want any kind of life extending measures taken.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "This was already a **NTA** situation for me, but when I got to the amount I was shocked.  Even if OP said no to donating $1, he would still not be ta, but $20-30k is ridiculous.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Whomever asked OP is the true AH here. Frankly even writing this reddit post is too much effort to put towards this. Block and delete whoever is asking you to donate and forget about them and the coma guy.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This! They should be asking corporations, and I doubt even they would donate that much. Asking $20-30,000 is ballsy and entitled as fuck. And like u/AllButACrazyCatLady said, that's just the first time they'll ask.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Especially when it's really just a maintenance fund. This money isn't going to magically wake this man up. It's going to keep him on a ventilator for maybe another six months, until the money runs out *again*. Either OP needs to be prepared to keep spending this money, regularly, to keep this person alive... or the inevitable is *going* to happen, and the life support is going to be turned off. Chances are, he is not going to wake up. Most people don't in his situation. So unless OP is willing to fund his life support forever, he is unfortunately going to die.\n\nHonestly, I would argue it's crueler to let the parents and loved ones live in hope for even longer, just to be met with the same painful end anyway. This situation isn't sustainable anymore, and the parents need to face that.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "It feels so amazing how generous people can be with someone else's money.....",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "How often would they expect HIM to foot the bill?\nThe nerve of these people",
          "id": 64,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1816,
      "content": "NTA. You have no obligation to donate, and that doesn't make you a \"selfish AH\". Nobody else should dictate how you spend your money, or guilt you for it. For all they know, you've already donated a large amount of money to some other worthy cause, so I think the name calling and assumptions make *them* TA.",
      "id": 65,
      "comments": [
        {
          "score": 1606,
          "content": "Lol, I actually funded the knee replacement of the person who asked me to help - no questions asked. He was an old friend on hard times. I'm like that. But f\\*\\*\\* helping the kid that would tell me that \"you'll never get laid because you're a fat ethnic that likes maths.\"",
          "id": 66,
          "comments": [
            {
              "score": 619,
              "content": "What's the 20k going to do besides pay bills?  Will he ever recover?\n\nNTA.  Why would you help someone who made you miserable?\nGlad to read your edit that life is great 👍",
              "id": 67,
              "comments": [
                {
                  "score": 905,
                  "content": "He will, sadly, never recover. There is no money in the world that can bring him back. And thank you for your kind words. 17 year old me would never believe that things could get better.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 461,
                      "content": "That sounds like the family just needs to let him go. Maintaining him on a ventilator indefinitely is miserable for everybody involved.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 169,
                      "content": ">He will, sadly, never recover.\n\nI hate the idea of people dying because they can't afford to pay medical bills, but if he's not going to recover then that's not what's going on here. Jake is already dead, the hospital is just keeping his body pumping and billing his family for it. NTA.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "Even if you have it, and have donated before...NO ONE gets to decide how you spend your money, except you.  No more needs to be said.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "so theyve just been torturing him for their selfishness... i would never fund that! you refusing to fund it is actually kindness and shows compassion for another human being.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "People tend to forget how much bullying can affect a person’s mental health. I’m glad you’re doing so well in life and haven’t let the harassment drag you down and have left it in the past. You have quite literally ZERO obligation to donate any money to your former bully. And hearing that you paid for someone else’s knee replacement just goes to show your character.\n\nEnjoy your success and accept your karma, OP. You deserve it. NTA.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Any idea as to why the family insists on keeping him alive, do they believe in a miraculous recovery somehow? Paying anything is just playing into the illusion that he might wake up. It will never stop. \n\nobviously not the AH, and keep living your best life! :)",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "So, you're being called an AH for not flushing money down the toilet keeping the empty husk of your bully in an artificially maintained half-life? Ludicrous. NTA.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "It sounds like if you donate now, they will expect you to donate again and again until he finally dies. It's not a good series of investments.\n\n&#x200B;\n\nPut it into an account for your child's future university fees. That would actually benefit more than one person. NTA.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": ">Will he ever recover?\n\nI think that's a very good question. If Jake has been on life support and in a coma all these years, what kind of quality of life does he have? Does he have any brain function? Sure, some people have awakened from comas years after it happened, but I'm sure that's a tiny, tiny percentage.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 79,
                      "content": "I'm not a doctor, but I did a quick Google search and apparently the chances of waking up from a coma largely depends on the severity and cause of brain injury, age and how long the person has been in a coma for.\n\nJake has been in a coma for years, on a ventilator and I'm guessing showing no signs of waking, so unfortunately there's very, very little to no chance he's coming out of his coma.\n\nJake died the day of his accident. The only thing that's keeping Jake \"alive\" is the ventilator that's breathing for him.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "This - I feel like even $20-$30K would be a drop in the bucket since it seems that Jake requires long term, skilled care.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "Wait, the guy calling you an AH already had your help paying for some major medical expensive and has the balls to tell you how you should spend your money? He thinks because you helped him, you should help everyone now? Wtf",
              "id": 80,
              "comments": [
                {
                  "score": 106,
                  "content": "Life hey. Any good deed....",
                  "id": 81,
                  "comments": [
                    {
                      "score": 22,
                      "content": "With friends like that guy, who needs enemies? Always sucks when friends betray you like that",
                      "id": 82,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Why are you still in contact with these shit stains who played play both sides and are clearly friends with the AH who made you miserable? Your high school friends all sound like ass holes tbh.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Right? Definitely took his generosity as a weakness. Shame you spent money on that guy too.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "Just going to put this here to tell you that your edit on your original post is a thing of beauty.  Former HS misfit, here, and I am so happy and proud of you for living your best life and achieving so much.  You're being true to yourself, which is firmly in NTA territory.  The real AHs are the people who feel entitled to reach into your life and into your wallet.",
              "id": 85,
              "comments": [
                {
                  "score": 76,
                  "content": "Thank you so much. I hope that you are also happy in your life, wherever and whatever that may be. :)",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "as a former bullied musical theater kid, I would MAYBE piss on my high school bully if he was on fire, but probably not on any of the parts that were actually burning. NTA.",
              "id": 87,
              "comments": [
                {
                  "score": 42,
                  "content": "You get it.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Don't piss on fire.. it stinks...",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "> \"you'll never get laid because you're a fat ethnic that likes maths.\"\n\nOh, that poor, bigoted baby! Now his family won't get to stare at his glorified corpse for another 6 months. NTA and he got everything he deserved out of life.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "I can forgive you for anything except liking maths.",
              "id": 91,
              "comments": [
                {
                  "score": 99,
                  "content": "Hate maths. They assumed given my nerdiness I liked it. English and humanities all the way!",
                  "id": 92,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Ugh, I totally get that. I loved science, history, government, English, and the creative arts. I did not like any math except for geometry, which I absolutely loved. Geometry was the only math I was good at and enjoyed, though. And yet still I remember people would assume I loved math and was good at it. Maybe it was because I was also the social outcast, nerdy type (and East Asian to boot, and we all know that all Asians excel at math /s). I relate so much to that.\n\nOh, and NTA. It's not your job to fund someone else's medical bills \\*unless you want to\\*. You and Jake weren't even friends; in fact, he actively bullied and tormented you. You owe him nothing. Even if he was a stranger you would owe him nothing. It'd be generous and all for you to help, but you are not obligated to do so and you are most certainly not an asshole for not doing so. I agree with other commenters: Donating to an anti-bullying organization or helping to sponsor a school's music or theater programs would be a lovely form of charity if you want to do that.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "You can tell the one that saved the money on the knee replacement you  paid for, to pay you back, and you'll donate that money.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "NTA. It looks like karma ran over his dogma. You owe him nothing.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I know that you aren't but I am picturing you going through all this to end up being secret Richard Ayoade. It's hilarious. \n\nNTA you are under zero obligation, it's a lot of money, it won't fix a coma.",
              "id": 96,
              "comments": [
                {
                  "score": 2,
                  "content": "I totally imagined that too!",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "There’s part of the story. You helped one person, so everyone now sees you as the fat cat and they think they are entitled to something from you. \n\nThey aren’t. NTA.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 886,
      "content": "NTA. You could always make a donation to an anti-bullying program in his name and do some good but you aren't obligated to give any money to anything.",
      "id": 99,
      "comments": [
        {
          "score": 589,
          "content": "This is a great idea and I am going to do it.",
          "id": 100,
          "comments": [
            {
              "score": 272,
              "content": "Don't do that, or at least don't tell anyone about it\n\nYou're certified NTA right now and I can't believe they'd ask you for money, never mind for 20-30k lol. But doing this would come off very combative and petty, don't waste your time",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 163,
              "content": "Do it under your own name.  Doing it under his just makes you a petty AH.",
              "id": 102,
              "comments": [
                {
                  "score": 333,
                  "content": "I shall do it in my Daughter's name.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 78,
                      "content": "That works too.  I hope she's not get bullied.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Thank you",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Do not do it under his name. Do it under yours.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 348,
      "content": "NTA - you don’t owe him anything. And those telling you that you should because you can afford it can eff right off. They’re welcome to sell their homes, possessions and pick up extra shifts/jobs if they so please.",
      "id": 107,
      "comments": [
        {
          "score": 62,
          "content": "Yep, gotta love when other people spend *your* money...",
          "id": 108,
          "comments": [
            {
              "score": 3,
              "content": "Some peiple can get so generous when it’s not their pockets being emptied.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 237,
      "content": "NTA \n\nHe‘s not your responsibility, no matter if you could afford it or not. \n\nAlso: If you do it once you open the pandora‘s box and everyone will come with sob stories because „you were so kind-hearted that you even helped your bully. I was never mean to you, how can you not help me?!“",
      "id": 110,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 195,
      "content": "WTF 30k medical bills! NTA, how much money do you make? Unless you have hundreds of millions of dollars and donate to charity, this is completely unreasonable.",
      "id": 111,
      "comments": [
        {
          "score": 221,
          "content": "I'm sometimes seen in the media of my home country. I get why I was asked. What I don't get, is that anybody possibly could have thought I would be down to help.",
          "id": 112,
          "comments": [
            {
              "score": 75,
              "content": "NTA, you owe him nothing at all. Maybe the people who wanted you to help thought that you should \"be the better person\" for that?",
              "id": 113,
              "comments": [
                {
                  "score": 135,
                  "content": "Ngl, most of them contributed money over the years. It's not as if they're asking me in lieu of their own contributions. But the person that asked me is supposed to be one of my last remaining contacts from back home and the fact he's pissed has upset me.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 99,
                      "content": "That chapter of your life is over. This happens when we grow up. If he wants you to pay $30K to continue the friendship, he wasn't much of a friend to start with.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "Maybe your friend wanted to play hero. \n\n\"Oh, I'm still friends with OP. Let me ask him.\" \n\nAnd you saying no means he can't play hero. \n\nOh well. Too bad.",
                      "id": 116,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "INFO: is there any chance he will wake up? \nWhy they re going bankrupt when there is no chance? \n\nI know i sound harsh but....",
              "id": 117,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "It doesn’t matter, this person is practically a stranger after so many years.  They bullied OP as kids.  30K is a lot of money to ow over for even friends.  Nta.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 142,
      "content": "NTA.  Your money you can choose what to do with it.  Just because you can afford to do something doesn't mean you have to.",
      "id": 119,
      "comments": [
        {
          "score": 136,
          "content": "Yep, a few years back, a good friend of mine \"John\" called me to ask to donate to a go-fund-me for a regular at the restaurant where he worked. She had gone skiing, didn't have a helmet on, crashed in to a tree and was comatose. She was a single mom of three kids and had NO health insurance (and this is in the US - so BIG problem).\n\nWhile I felt for her and her situation, this person was quite literally nothing to me - a friend of a friend. I told John that, I said \"I'm sorry for her situation and hope she recovers, but I don't feel the need to provide monetary support here in a string of really poor, irresponsible decisions on her part.\" His response, \"Well, YOU certainly won't miss the money, but it will help her and her family a lot.\" WHOA! No, no and NO. I had to shut John down right there. I said, \"That's fine if YOU want to support this person, that is YOUR choice. However, YOU don't get to decide how I spend MY money and what is or isn't worthy for ME to spend it on. Just stop right there.\" He knew from the tone of my voice that I was 100% serious and he did stop and never brought it up again, rightfully so.",
          "id": 120,
          "comments": [
            {
              "score": 5,
              "content": "To be fair saying she did a string “really poor irresponsible decisions” to his face makes you sound kinda pompous and callous. Could’ve just told him “sorry I can’t”",
              "id": 121,
              "comments": [
                {
                  "score": 27,
                  "content": "He pushed,  I pushed back. And, FWIW, I think it is a really poor, irresponsible decision to not only not have health insurance when you are a single mother of three (medicaid is strong and well funded in my state), but to go skiing without a helmet *when you have three children depending solely on you and your income* is also an absolutely poor, irresponsible decision.",
                  "id": 122,
                  "comments": [
                    {
                      "score": -10,
                      "content": "I’m saying that saying essentially “sorry I don’t give money to stupid idiots” when talking about a single mother that’s in a coma is kind of in poor taste. Don’t donate if you don’t want but like jeez",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 135,
      "content": "NTA, and please, let’s take a moment to consider the point of keeping a body alive for years, it’s ghoulish and horrifying. Please make sure to get a living will and make sure you have a person you can depend on to pull the plug.",
      "id": 124,
      "comments": [
        {
          "score": 30,
          "content": "I agree 100%! I truly think that everyone should set up a living will as soon as they turn 18 and can sign legal documents. Also have someone with a medical POA that you know will make the right decisions.",
          "id": 125,
          "comments": [
            {
              "score": 10,
              "content": "Exactly… if you really want to get back at a bully, keep them alive longer as a vegetable.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This was my first thought as well. Even if he was to give 30k is there any chance this guy would ever wake up and live? The money would surely be better spent somewhere else in medical research then keeping a body alive.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA\n\nEven if he wasn't your bully, you don't owe him anything. The fact that he treated you like crap just further justifies your decision. His unfortunate state isn't your responsibility.\n\nI know a lot of people believe \"if you can afford to help, why wont you??\" and yeah, sure, I get that. But also, you don't owe a stranger anything... and you especially don't owe your old bully anything either. Helping others is a kind thing to do, but you also have the right to make a decision about your own time and finances.",
      "id": 128,
      "comments": [
        {
          "score": 73,
          "content": "Thank you. I can unequivocally tell you that if he had treated me as a human being, I would have signed a blank cheque. I personally see this as them having nowhere else to go and \"lets ask the successful guy to write us a cheque.\"",
          "id": 129,
          "comments": [
            {
              "score": 13,
              "content": "I think we can all hazard a guess as to why he has very few places/nowhere he can turn. NTA bro I respect your tenacity here",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Not just that but the dude is basically dead. I don't believe in artificially prolonging life like this.",
          "id": 131,
          "comments": [
            {
              "score": 3,
              "content": "Yeah, years in a coma is a your brain has atrophied in 99.99% of cases type of thing. \n\nEven the people who wake up and give \"inspiring\" news interviews all have massive deficits which mean they're essentially unable to function without extraordinary amounts of help.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 83,
      "content": "NTA and it was super inappropriate for your friend to reach out to you and ask you specifically to cover someone else's medical expenses.",
      "id": 133,
      "comments": [],
      "relation": "No"
    }
  ]
}