{
  "post content": "Okay hi this is a new account because I have friends on here that know my other, gonna use fake names, all that jazz \n\nSo about 1.5 months ago I was diagnosed with cancer, it’s low-stage and not as major as it could be, but I’m taking chemo pills and other medications to deal with it which have a lot of side affects. Some of which include fatigue, dizziness, irritability, things of that nature \n\nMax (21F) and I have been dating for a while and living together for almost a year now, and have gone through multiple other health things as a team. She’s always been great when I’ve had issues in the past and I’ve tried to do the same for her. \n\nNow to get into the problems-for the past month or so, anytime I’ve been feeling sickly or upset or gotten irritable for no reason (other than meds and cancer being generally hard to deal with) I’ve tried to kind of distance myself from others so I don’t bother anyone (usually this just means taking a nap, or laying in bed and resting). \n\nHowever, since Max and I live (and are quarantined) together it’s hard to distance from each other and she has been trying so hard to fix things and be super helpful when I’m feeling badly. Along with this she tries to tell me what I have to do, even when I know doing something differently would be healthy and safe. I definitely appreciate it and I tell her all the time that I appreciate her being here for me, but I also tell her that I can take care of myself and make safe decisions for my body. \nAll that to say, she definitely knows it bothers me sometimes because I vocalize it. \n\nA few days ago we had a big argument because I had a low-grade fever and she wanted to drive me to a hospital, but I called my oncologist and he said I would be okay at home as long as I checked my temp every 30min and it didn’t rise. I kept telling her what my oncologist said, and telling her that if my temp started to rise I would go without arguing, but she kept trying to tell me what she thought was the best thing to do (even though my doctor was saying differently). I kept repeatedly telling her I was fine and she didn’t have to take care of me (it wasn’t a yelling match, but definitely firm and intense voices), and she got mad that I wasn’t listening to her and we haven’t really talked in 2 days because of it. \n\nHonestly, I definitely understand that she wants to help take care of me because cancer is a lot to deal with, but at the same time I feel like my opinions should matter too? I’ve talked to close friends and my dad about this and they think I overreacted and should have just let her help. \n\nAm I the a-hole for getting mad and not listening to her when she tried to take care of me?",
  "id": 1,
  "comments": [
    {
      "score": 14,
      "content": "NTA. In the middle of a pandemic, you being immune compromised, it is absolutely necessary to follow instructions from your attending physician. The risk of your fever getting worse vs. you being exposed to COVID has to be taken into account and as confident in her decisions as your GF thinks she is, the doctor with training and expertise disagrees.\n\nI know her heart is in the right place, but please get your medical advice from your doctor. Best wishes for a swift and complete recovery. Show cancer who is the boss.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH. Your GF is probably technically TA, but she's obviously just worried and being overbearing without realising it. It's totally reasonable for you to make your own decisions about your health though, especially when they're rational decisions. \n\nI know this is easier said that done, but you need to talk about this when you're both feeling a little more calm (i.e. not in the heat of the moment) and reach some agreement about how you're going to handle the small things that will inevitably pop up. \n\nI have loved ones going through the same thing at the moment, and he (the cancer patient) has a tendency to be a little *too* chill about symptoms (\"it's just a few chest pains!\") while she goes to the opposite extreme (\"we need to call the doctor about your bloodshot eyes!\"). They're learning to just meet in the middle a bit, but it's not easy.\n\nI hope the side effects go away asap and take the cancer with them. All the best, OP!",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA - But she's scared of you getting worse and losing you. Let her help, it will probably help her mental health to feel useful, or let her speak to your doctor so that he can answer her questions or recommend her a support group.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. Is she a qualified doctor? If she's getting her information on-line, she probably knows less than you about proper treatment. Is she one of those people that thinks all you need is a vegan/vegetarian diet, or huge doses of vitamins?",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay hi this is a new account because I have friends on here that know my other, gonna use fake names, all that jazz \n\nSo about 1.5 months ago I was diagnosed with cancer, it’s low-stage and not as major as it could be, but I’m taking chemo pills and other medications to deal with it which have a lot of side affects. Some of which include fatigue, dizziness, irritability, things of that nature \n\nMax (21F) and I have been dating for a while and living together for almost a year now, and have gone through multiple other health things as a team. She’s always been great when I’ve had issues in the past and I’ve tried to do the same for her. \n\nNow to get into the problems-for the past month or so, anytime I’ve been feeling sickly or upset or gotten irritable for no reason (other than meds and cancer being generally hard to deal with) I’ve tried to kind of distance myself from others so I don’t bother anyone (usually this just means taking a nap, or laying in bed and resting). \n\nHowever, since Max and I live (and are quarantined) together it’s hard to distance from each other and she has been trying so hard to fix things and be super helpful when I’m feeling badly. Along with this she tries to tell me what I have to do, even when I know doing something differently would be healthy and safe. I definitely appreciate it and I tell her all the time that I appreciate her being here for me, but I also tell her that I can take care of myself and make safe decisions for my body. \nAll that to say, she definitely knows it bothers me sometimes because I vocalize it. \n\nA few days ago we had a big argument because I had a low-grade fever and she wanted to drive me to a hospital, but I called my oncologist and he said I would be okay at home as long as I checked my temp every 30min and it didn’t rise. I kept telling her what my oncologist said, and telling her that if my temp started to rise I would go without arguing, but she kept trying to tell me what she thought was the best thing to do (even though my doctor was saying differently). I kept repeatedly telling her I was fine and she didn’t have to take care of me (it wasn’t a yelling match, but definitely firm and intense voices), and she got mad that I wasn’t listening to her and we haven’t really talked in 2 days because of it. \n\nHonestly, I definitely understand that she wants to help take care of me because cancer is a lot to deal with, but at the same time I feel like my opinions should matter too? I’ve talked to close friends and my dad about this and they think I overreacted and should have just let her help. \n\nAm I the a-hole for getting mad and not listening to her when she tried to take care of me?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA.\n\nYour girlfriend loves you and cares. But with a worldwide pandemic happening, it's best to listen to your doctor. Cancer is a pre-existing condition that covid19 has taken advantage of and people have died. Whether they're cancer survivors or actively battling cancer. It isn't worth it to expose yourself to covid19 over a low grade fever.\n\nHowever I don't think you were out of line. Your girlfriend may not agree but you wanted to do what your doctor said and she needs to respect that choice.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. Your oncologist knows what is dangerous for you far better than your gf. If you don’t need to be sitting in a hospital waiting room, then why would you choose to sit in that petri dish.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA your GF is not a doctor and she was trying to contradict what your actual doctor was telling you to do.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Nah here, i think she’s trying to help in any way she can because she’s worried about you. I do the same thing with my husband he’s in health care so we argue over medical stuff because I freak out. Good luck with everything, hopefully you guys can get on common ground with each other to avoid butting heads",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}