{
  "post content": "So my girlfriend (whom I live with) has always wanted a dog. And me, I like dogs *but* I do not want the responsibility of owning one. Well one day she told me her sisters dog had puppies (boxers - one of my least favorite breed) and I expressed to her that I don't want a dog, I want nothing to do with a dog, etc etc. Well she kinda got the whole attitude of well im doing it anyways. I told her if she gets a dog I am having 0% to do anything with it. I'm not helping with bills, training, feeding, taking it outside, ANYTHING. I don't want the responsibility. \n\nWell fast forward a few months later and here we are with a 60lb 8 month old boxer.... And I hate it. We live in a smaller 750 sqft apartment so this dog is always in my presence and that alone annoys me. When left alone, It chews anything near by, destroys blinds, tears up carpet and generally trashes the place. It's so irritating to be mid conversation or mid TV show and have to stop what your doing because the dog is up to some shit again. It's a small apartment and a rather big dog. We cant put it in the bedroom alone because shit will get ruined. I know some of this may seem trivial, but when i mean I didn't want a dog, I mean I didn't want to deal with literally anything the whole \"dog package\" has to offer. \n\nI make sure my girlfriend knows I don't like it. I call the dog a bitch (mostly to be ironic; it's a female dog) when it acts up, push it away from me whenever it's close, ignore it as much as possible, I don't feed it, I don't let it out of it's cage, and if it whines and barks I tell it to shut the fuck up. I literally do nothing for this thing. \n\nOkay so that seems pretty bad now that I typed it out and am reading it and I'm probably gonna be deemed an asshole. But I've never actually hurt the dog, and never intend to. In my defense it doesn't understand English, so it's fine. \n\nIt just sucks because I'm paying to live with this animal that I really don't want to deal with. My girlfriend and I split rent so there should be compromise, but with this dog, there was none. She brought this thing into my house and I'm already tired of it. \n\nOn the bright side (for me) my gf knows not to ever ask anything of me for this dog and has been keeping up to that standard so far",
  "id": 1,
  "comments": [
    {
      "score": 752,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 195,
          "content": "Break up or find the dog a decent home. ",
          "id": 3,
          "comments": [
            {
              "score": 225,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 49,
                  "content": "Right, like not once did he mention that he loved his GF - merely that they split rent.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That's a ridiculous observation. People aren't obliged to cite trivialities about their relationships just so you can eat drama.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -87,
                      "content": "Lol all this Reddit \"advice\" telling us to break up. I've been with her for 3 years so that's not really an option at this point (atleast over a dog) but I do love her. Just not relevant information to the post",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "Break up *and find that dog a decent home.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 86,
          "content": "Poor dog. Both of you are jerks. Dog deserves better guardians.",
          "id": 9,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 66,
          "content": "I second this. Both of you seem very committed to your stances on the matter, which is perfectly fine, but the next step after that is to assess whether your preferred lifestyles are compatible. It seems like they aren't, and if that's the case breaking up is the reasonable option.\n\nAnd just fyi, that isn't a bad thing or a mean thing or anything. It doesn't mean you didn't or don't care about each other. It sometimes just doesn't work out because you have mutually exclusive life interests, that's all. It takes maturity to navigate that well, but you don't have to hate each other if you go down that route.",
          "id": 10,
          "comments": [
            {
              "score": 51,
              "content": "Agreed, everyone but the dog who didn’t ask to be involved in the situation is an asshole.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I'm leaning more on her being an asshole. Putting a 60lbs dog that young in an apartment that small is cruel. My wife had a 13 year old Pomeranian in a 1200sqft apartment and even that was a little small. Dogs need room and attention. \n\nRelationship wise, that was a dick move on her part. The decision to have a dog is much like the decision to have a kid: it should be mutual. And if you not wanting it is a deal breaker she should have broken up with you prior to getting it as you made your decision. Communication is important in a relationship. You communicated. She didn't care. It was up to her to break up with you, not otherwise as the status quo was not having a dog.\n\nAre you sure getting the dog wasn't a powerplay by her to end the relationship without giving up the apartment?\n\nShe is the asshole. You ain't innocent, but are a victim of circumstances.",
          "id": 12,
          "comments": [
            {
              "score": 36,
              "content": "[deleted]",
              "id": 13,
              "comments": [
                {
                  "score": 15,
                  "content": "I think it depends a lot on the breed as well, and honestly a boxer is not a great apartment dog. They have a lot of energy and want to be outside playing etc. Bigger dogs like Bernese or Newfie’s would - as perverse as it sounds - actually suit an apartment better as they’re much more low energy. \n",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Yep. Also have a dog the size of a boxer. High energy, but she's slowing down at 5-6 years old. I went from a 1200 sq ft place to 750. She's incredibly happy, and she's not destructive at all. She gets attention and exercise, and all she wants when we're inside and not playing is to be as close to her people as possible. This OP is an awful human being and not mature enough to realize it. ",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "It's important.\n\nThe size of the free roam area for a dog isn't going to change in a single location.\n\nThe inclination of an owner to take them for the proper amount of exercise unfortunately does change.",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -2,
                  "content": "Keeping a dog in the city let alone an apartment is stupid and cruel. Most dogs need ten km of off leash a day to remain well adjusted.  But then I think keeping humans in cities is the cause of all the problems in the world lol",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "100% agree with you and I also agree with op My SIL has a boxer and I absolutely fucking hate it so I understand OP’s hate on the boxer breed. ",
          "id": 18,
          "comments": [
            {
              "score": 28,
              "content": "[deleted]",
              "id": 19,
              "comments": [
                {
                  "score": 14,
                  "content": "A tired dog is a good dog!\n",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I understand that seeing as I’m a former vet tech and always had high energy breeds American pitbull terrier’s Rottweilers Jack Russell terrier’s etc. I’ve just never been a fan of boxers I personally think they’re ugly and my sister-in-law never trained her dog, I have ran into my boxer owners that seem to never trained them.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I know someone that has two and they are terrible dogs, and likewise resented by their owners. It's not abusive, just a bad mismatch.\n\nMust be something about that breed that people get them not understanding what they really are (dumb and high energy, it seems).",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Lol, now I'm picturing his girlfriend getting pregnant, and he says \"look, I don't want kids, I'm comfortable with life the way it is and it's too much responsibility.\" And she says \"But I want it, I'm going to have it anyway!\" And he just resolves to do nothing to care for the baby and just kind of scooches away from it when it's around and says \"fuck that baby, eat shit baby\" when it starts to cry. \n\n",
          "id": 24,
          "comments": [
            {
              "score": 1,
              "content": "Hey, his body, his choice.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Not even close to similar. ",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "It's more like they discuss having a baby, he says no and she cheats on him to get pregnant anyway. The two should break up.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Something about your reply makes me love you. You're smart.",
          "id": 28,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This is the best answer.\n\nA boxer in a 750ft apartment?",
          "id": 29,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 316,
      "content": "You both are. It was unfair for her to get a dog for your shared apartment when you didn’t want one, but YOU ARE PUNISHING THE DOG. You are **punishing an innocent animal** rather than talking to your girlfriend like an adult. Please consider therapy together because you guys are not honouring each-other’s wishes an not communicating effectively or in an even remotely healthy manner.",
      "id": 30,
      "comments": [
        {
          "score": 144,
          "content": "This comment actually helps me alot. That part about not communicating in a healthy manner kinda makes me realize that all my anger towards the dog and how I talk to it is in fact how I am communicating to my gf that I don't like it. and you're right, that's not healthy. \n\nThis has brought me one step closer to realizing it's not the dog perse, but the fact I am communicating my feelings wrong",
          "id": 31,
          "comments": [
            {
              "score": 49,
              "content": "Thank you so much for accepting my somewhat hostile advice. Seriously, I appreciate it. I’m glad you’re self aware. It’s time for her to become self aware too, yes? I would suggest a calm talk where you explain your side and ask for hers. No yelling, phones away, full honesty. Ending with “I would like for us to learn to communicate with each other in a way that works for both of us, individually and collectively. I think we should try therapy together.” (If that feels right). It’s not up to me to decide if you guys should do therapy together, but I would highly highly recommend it. For your sake, and hers.",
              "id": 32,
              "comments": [
                {
                  "score": 4,
                  "content": "Actually, not very hostile at all. ",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Maybe if you talked to her and told her that a condition on keeping the dog is getting it trained, a lot of your stresses would go away. If the dog is trained and well cared for then it won’t whine or cry in the crate or tear shit up around the house (at least as much). Then at least you wouldn’t have a dog bothering you and ruining your shit. I know before I got my dog trained it was the same way and I was miserable... and I wanted him! I know a lot of people are telling you to break up but I hope you guys can come to a compromise where you both feel heard and cared for by the other. Good luck :)\n\nEdit: I just read she only walks the dog to pee. Biggest mistake right there. I’m sure if you showed the dog some love and she exercised it, things would be a lot better for everyone, including the poor puppers :( don’t take your frustrations on your girlfriend out on an innocent dog... it’s the collateral damage in all this. Tell your girlfriend she wanted a dog so bad that she needs to take care of it... you should be upset with her and yourself for poor communication and a “I’m going to do what I want” attitude... not the dog. The dog doesn’t understand English but it definitely picks up on your tone and demeanor towards it. It’s probably feeling neglected and anxious. ",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 200,
      "content": "Not the asshole, but be nice to the dog. The dog is an innocent player here.",
      "id": 35,
      "comments": [
        {
          "score": 9,
          "content": "Happy cake day ",
          "id": 36,
          "comments": [
            {
              "score": 18,
              "content": "Thanks! I've been on Reddit for longer than some redditors have been alive!",
              "id": 37,
              "comments": [
                {
                  "score": 11,
                  "content": "That is a horrific thought. Why would you say that lol",
                  "id": 38,
                  "comments": [
                    {
                      "score": 15,
                      "content": "because joking about how much life i've wasted on this trash site makes me a little less burnt out on life :)",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Happy Cake Day OG ",
                  "id": 40,
                  "comments": [
                    {
                      "score": 7,
                      "content": "ayyyyy thanks bb <3",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I like to pretend that no one under 15 is on this sight ",
                  "id": 42,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Lol yeahhhhh I joined when I was 14 🤷‍♀️",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 156,
      "content": "The first half of your rant I thought was justified. Then when you got to the part of calling the dog a bitch, pushing it away, ignoring it, yelling at it, and refusing to let it out of it's cage, it was clear that *yes*, you are actually an asshole. It's not the dog's fault.\n\nAnd your girlfriend is an asshole for getting the dog without your consent.\n\nYou guys should break up and the dog should go to someone who will treat it right.",
      "id": 44,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 125,
      "content": "I think she is more of an asshole for making a big dog live in a small apartment and not training it properly. However, I'd argue that you are at fault, too. It sounds like she may have interpreted what you said as not wanting any responsibilities of dog ownership. It's possible you could have been more clear and just said \"I don't want to live in the same apartment as a dog.\"\n\nIf you did say that, great, but regardless, please don't take out your frustration on the dog. It isn't the dog's fault. It's probably got a ton of pent up energy, being confined to such a small space. I know you haven't actually hurt it but it seems like a bad idea to get used to venting your anger at the dog, even if right now it's in mostly harmless ways. It also certainly isn't going to make your girlfriend sympathetic to see/hear you treating her dog that way.",
      "id": 45,
      "comments": [
        {
          "score": 128,
          "content": "Also, OPs neglect and outright hatred of the dog is probably causing it to act out more. Dogs are smart. It knows you're neglecting it and since it thinks you're family (since you're always with the human who takes care of it and you're always in its home, because like it or not that IS the dogs home as well as yours) it won't understand why you're treating it like that. Don't be surprised if the dog turns on you or possibly attacks you, OP. Constantly pushing the dog away and hating it is a recipe for disaster and for an angry dog.",
          "id": 46,
          "comments": [
            {
              "score": 16,
              "content": "A dog who knows it isn't liked is an unhappy dog. Theyre smart enough to know your mood, and not smart enough to know how to help (at least not usually). The dog is probably destroying shit out of a mix of improper training and anxiety. Poor thing.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "[deleted]",
          "id": 48,
          "comments": [
            {
              "score": 18,
              "content": "It's a boxer, so it's not a completely dumb dog. It really needs training. I've had working dogs for years, and if you don't train them in addition to exercise, they're bound to get destructive. ",
              "id": 49,
              "comments": [
                {
                  "score": 3,
                  "content": "Training and a crate. Except OP would never let it out again if the crate if GF isn’t home. ",
                  "id": 50,
                  "comments": [
                    {
                      "score": 7,
                      "content": "It sounds like he crates it and just yells at it to shut the fuck up when it cries ",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "[deleted]",
                  "id": 52,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I did, I just didn't see the comment you made below. Sorry.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": ">  I've always had big dogs and I've had them in everything from a studio to a 2,500sqft home with a big yard.\n\nIt's not about the size of the dog. I had an Australian Cattle Dog (Blue Heeler) and that's not a big dog, but three walks a day was not sufficient. I had to go run him *hard* at the dog park for at least an hour after work every day to even make a dent on his energy levels. \n\nI've also had big dogs, and none have been nearly that energetic. Working dogs are literally a different breed. ",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -34,
              "content": "We only walk it to take it outside to potty. It does expell alot of energy indoors, but also is a big dog and my girlfriend has to constantly fight it to keep it from tugging the leash. It gets exhausting for her quick. This is probably more so a training thing though",
              "id": 55,
              "comments": [
                {
                  "score": 71,
                  "content": "[deleted]",
                  "id": 56,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Totally agree. Most dogs need to go on walks for exercise, not just a quick potty. My dog weighs 13 lbs and it's a nightmare if I don't walk him to get out his energy and play fetch. And also second the gentle leader. Literally got one two days ago and my dog is like a whole new dog while he walks on it",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -17,
                      "content": "Don't take it out on OP, it's not his dog, his irresponsible gf wanted it.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "That dog needs at LEAST one long walk per day, probably two would be better. No wonder it’s tearing things up. That’s incredibly irresponsible of you both.\n\nShe should look into getting a [gentle leader](https://www.petsafe.net/gentleleader) to keep her dog from pulling. Rather than something painful like a choke collar (which doesn’t even work on some very determined doggos), the gentle leader goes around the snout so that when a dog tries to pull, their head is turned back and they physically can’t. They’re inexpensive too, less than $20. ",
                  "id": 59,
                  "comments": [
                    {
                      "score": 3,
                      "content": "On sale at Pet Supplies Plus for $14.50 right now lol",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "You take an 8mo old, high energy breed puppy outside ONLY to potty? You two may be some of the laziest dog owners out there. I get that you didn’t want the dog, but now you have the dog. Take care of it or give it to someone who will. You’re both massive assholes.",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": ">We only walk it to take it outside to potty\n\nJesus, it's a boxer, it needs to go for runs and to the dog park. She needs to take it out more. And tell her to leash train it for god's sake. ",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Gentle leader or easy walker harness for the pulling. Try clicker training. I literally do I while sitting on the floor watching TV with my dog. Boxers are smart. You aren't giving her an outlet for her energy, mentally and physically. Feed her in a puzzle you. Try something productive with the dog instead of complaining and fueling the problem",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I gotcha. I can agree to the fact that maybe I could have made it more clear. I understand I shouldn't take it out on the dog, it's like I know that but I get caught in this blind rage and just say shit. Something I will need to work on",
          "id": 65,
          "comments": [
            {
              "score": 33,
              "content": "Yeah, that 'blind rage' thing is what worries me. Sure, it's just verbal right now, but what if the dog hurts you by accident and you lash out physically in response? You might not think you're capable of it, but we all do stupid things when we're mad. I think you're going to need to actively work on changing your attitude towards the dog.\n\nBesides, the dog is basically in the same shitty situation as you. It didn't want to move in with you. It doesn't seem particularly happy in its surroundings (hence the destructive behavior). It's not being treated well by your girlfriend. Have some compassion towards the poor thing.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "[deleted]",
              "id": 67,
              "comments": [
                {
                  "score": 1,
                  "content": "Thanks for the input! I feel better knowing I'm not completely wrong. I had a feeling I am, in some sense, the asshole but yes, I think the whole dog conversation should have been taken more seriously",
                  "id": 68,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 73,
      "content": "You’re both terrible, break up. ",
      "id": 69,
      "comments": [
        {
          "score": 13,
          "content": "everyone else had a long answer and i was waiting for this one, the valid one",
          "id": 70,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 67,
      "content": "Everyone is the asshole. Your girlfriend for bringing it home without you on board, you for being immature and passive aggressive to a dog but most importantly both for not training the dog.",
      "id": 71,
      "comments": [
        {
          "score": 26,
          "content": "Dog sounds incredibly underexercised and understimulated. Bored dogs destroy, happy dogs chew toys. (With the exception of Huskies which are adorable fluffs destruction)",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 40,
      "content": "Yes you're an asshole.  You want to come on here and try to get validation that treating this dog like shit is perfectly fine.  You're obviously exceptionally immature and clearly have a mindset \"well my girlfriend didn't listen to my demands, but I don't want to deal with it responsibly so I'm going to take out all my rage and angst on this dog\".  Maybe you don't realize it, but this dog had no choice in the matter and can feel pain.  You basically treat the poor thing like garbage all the way up to but not including actually physically beating it.  Yeah dude, you are an asshole.  BOTH of you frankly sound like A) you really need to work on being better, more responsible people, B) learn how to handle conflict maturely, C) should not have pets because you're dicks about it, and D) really need to examine your relationship.",
      "id": 73,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 36,
      "content": "Everyone is an asshole. \n\nIf I were you, I’d dump the girlfriend, move out, and take the dog to a no-kill shelter on my way. Please do not ever live with an animal again, and don’t have kids until you’ve had a lot of time to grow up & learn how to express your negative feelings less destructively. \n\nJust because the dog doesn’t “understand English” doesn’t mean it’s not traumatized when you are verbally mean to it. If I got in your face and screamed “SHUT UP IDIOT” In French, you wouldn’t need to understand my vocabulary in order to feel attacked. AND SCARED if I were physically and socially superior to you, as the dog believes you to be. How can you excuse treating any living thing so badly? If you’re not ashamed of that, you should be.\n\nI now own a dog whose first home was like the one you are providing, and this poor sweet boye still cries & hides anytime anyone raises their voice. We taught him how to vocalize again because he was afraid to make even tiny woofs when he came to us 5 years ago. Now I am proud to say that he barks at birds & runs ahead of me on walks like all happy puppers should. The person who traumatized my Jackjack probably thought the same thing you do; that dogs can’t be hurt because they don’t understand humans. Well let me tell you something about dogs, bub: they’re more physiologically responsive to human emotion & intention than most adult humans you know. I’d add links, but I somehow doubt you’d take the time to read about dogs, so I’m gonna leave it at “google it if you don’t believe me and or care to learn more.”\n\nI’d say you should apologize to the dog but you seem to lack the capacity to empathize with non-human life. Instead, I hope you feel guilty forever knowing that you abused a sentient creature who will remember you only as a source of pain & terror for the rest of its life.",
      "id": 74,
      "comments": [
        {
          "score": 20,
          "content": "Don't worry, I don't want kids. Ever. IDC how you Perceive this, but im a carefree individual who wants MINIMAL responsibility in my life. I have my job, my home, and my girlfriend and that takes up most of my monthly \"responsibility quota\". \n\nBut luckily, I'm a person who respects and understands 'harsh' comments. that way seems to help me learn my situation the best. So for that, thank you. I like when honest, internet strangers say it like it is. \n\nBut getting to the point, I understand completely what your saying as you have taken in a dog that seemed to have gone through similar verbal abuse that I seem to be doing. Hearing you say he was afraid to bark when you first got him actually makes me kinda sad. And tbh, if my girlfriend's dog got like that because of me, I'd feel horrible. \n\nI read another comment which gave me a wider view on the issue and I have come to the conclusion that I was communicating my hatred for the dog situation through the dog. Looking further into it, it's more so because it's a hard subject to talk to my girlfriend about it and this is the way I chose to communicate my issues. This was in no way fair to the dog and I understand that now. \n\nI will begin to change and learn to suck it up and verbally communicate to my girlfriend vs the dog. But this is why I like Reddit. I have learned alot through the advice of many internet strangers",
          "id": 75,
          "comments": [
            {
              "score": 9,
              "content": "please do change! your resentment towards your girlfriend should not be taken out on her dog! you don't have a dog problem, you have a girlfriend problem. it was horribly irresponsible and inconsiderate of her to get a BOXER in a small apartment, against your wishes! and it sounds like she hasn't trained the poor girl at all. she must be so confused, getting yelled at all the time and neglected for just existing and doing regular dog things. please be nice to the dog and please talk to your girlfriend about how horrible, selfish and stupid she was/is. ",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "r/murderedbywords\nJust...wow. ",
          "id": 77,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 32,
      "content": "Taking your anger out on the dog because you’re mad at your girlfriend makes you an asshole in any situation. That being said, she shouldn’t have gotten the dog if she knew you’d act this way, which also makes her an asshole.",
      "id": 78,
      "comments": [],
      "relation": "Attack"
    }
  ]
}