{
  "post content": "My current living situation (Moved here at the beginning of the year), is quite basic. a full-time student living by college, renting a tiny apartment with shitty carpeting. I have 2 cats, one which is an ESA (This post isn't about him, he is perfect.)\n\nAs it stands as of the time of making this post, I currently have 24 \"childproofed\" spots in my place. In my apartment, there is mostly hardwood floor with sections of carpeting; closet and bedroom. every single area where the carpet meets floor has to be covered by something; this being due to an incident where I came home one day and saw her chew up lose fibers of the carpet, and eventually dislodging some part of it. I can now easily pull up the carpet and see what's underneath. I know for sure due to just that I am DEFINITELY not getting my security deposit back. That issue only accounts for 4/24 \"censored\" areas.\n\nWhen I leave for the day, I need to lock them up in the bedroom, out of straight fear that my cat will destroy something that I \"forgot\" to put away or hide or \"censor\". I wake up in the middle of the night dozens of times from random noises that I'm afraid is her destroying something. I can't have plants anymore; where gardening used to be a very personal therapeutic thing for me. This actually makes me feel terribly shitty, as my childhood dogs were always kept in crates by my family.\n\nAnother stress is the fact that I have an insane amount of tech that has wires, and that is her favorite thing to absolutely destroy. The total amount in replacement cables off the top of my head probably totals to about 500$+. This, with the 250$ security deposit to fix the carpet + 200$ out of pocket to fix the mattress that the apartment provides due to her shredding it, eating the insides and then vomiting into the hole, + an unknown amount of money for her jumping on top of a built-into-wall shelf in the closet and causing it to collapse...all in just 6 months... it's becoming very much for me. I live off student financial aid, and can only support their vet visits, and general care.  I am having to dig into their emergency savings to cover her damage. IVE HAD HER FOR A WHOLE YEAR!, but this behavior only started in January. She was an angel before this. \n\nThe constant fear that she will destroy more very important things to me or the actual home keeps me from leaving the house a lot of the times. I'm thinking of rehoming her, my partner is no help, he's only giving me the \"Whatever you want to do.\" thing. I just want to pull the trigger and rehome her to someone who can afford to handle this, or at the very least has no carpet. Is that an asshole move, or appropriate?",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": "NAH, your partner is right - you're not an asshole for rehoming a cat you can't afford",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA. You're not compatible. How your rehome her, though, could turn you into the asshole. If you got her from a specific cat rescue, check your paperwork, you may be expected to return her to that rescue. Otherwise start calling around rescues, explain you can't handle her destruction but you want her to go to a good home. Hopefully they will help you.\n\nI do not recommend putting her up on adoption through Craigslist. I don't see that ending well",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YTA if you rehome it. There are various ways to train your cat on behaving appropriately.\n\nAs a side note, if this behavior just started after having the cat for a year, there may be underlying problems. Did something change? Have there been any noticeable changes in urination and defecation? Have its eating habits seemed different? Cats don't normally go from being okay to all of a sudden acting like a maniac.\n\nTry to see if you can pinpoint when the behavior started and if there were any external factors that could have caused this. For example, did you move with the cat? Moving can create a lot of stress for animals. That stress can make them act up. If no external factors can be uncovered, then start watching its eating, drinking, bowel, and urine habits.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\n My current living situation (Moved here at the beginning of the year), is quite basic. a full-time student living by college, renting a tiny apartment with shitty carpeting. I have 2 cats, one which is an ESA (This post isn't about him, he is perfect.)\n\nAs it stands as of the time of making this post, I currently have 24 \"childproofed\" spots in my place. In my apartment, there is mostly hardwood floor with sections of carpeting; closet and bedroom. every single area where the carpet meets floor has to be covered by something; this being due to an incident where I came home one day and saw her chew up lose fibers of the carpet, and eventually dislodging some part of it. I can now easily pull up the carpet and see what's underneath. I know for sure due to just that I am DEFINITELY not getting my security deposit back. That issue only accounts for 4/24 \"censored\" areas. \n\nWhen I leave for the day, I need to lock them up in the bedroom, out of straight fear that my cat will destroy something that I \"forgot\" to put away or hide or \"censor\". I wake up in the middle of the night dozens of times from random noises that I'm afraid is her destroying something. I can't have plants anymore; where gardening used to be a very personal therapeutic thing for me. This actually makes me feel terribly shitty, as my childhood dogs were always kept in crates by my family. \n\nAnother stress is the fact that I have an insane amount of tech that has wires, and that is her favorite thing to absolutely destroy. The total amount in replacement cables off the top of my head probably totals to about 500$+. This, with the 250$ security deposit to fix the carpet + 200$ out of pocket to fix the mattress that the apartment provides due to her shredding it, eating the insides and then vomiting into the hole, + an unknown amount of money for her jumping on top of a built-into-wall shelf in the closet and causing it to collapse...all in just 6 months... it's becoming very much for me. I live off student financial aid, and can only support their vet visits, and general care.  I am having to dig into their emergency savings to cover her damage. I have had her for a year, but this behavior only started in January.\n\nThe constant fear that she will destroy more very important things to me or the actual home keeps me from leaving the house a lot of the times. I'm thinking of rehoming her, my partner is no help, he's only giving me the \"Whatever you want to do.\" thing. I just want to pull the trigger and rehome her to someone who can afford to handle this, or at the very least has no carpet. Is that an asshole move, or appropriate?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH. It sounds like it would be in the best interests of both you and the cat to find her a new home. Just be honest with whoever adopts her about WHY you are rehoming her, or if you take her to a shelter (make sure it’s no kill!) give them the info so they can find the best home for her.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "INFO does this cat have a scratching post or toys? Or did you just kinda take the cat and hope for the best? Have you tried training or talking to someone?",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "Multiple scratching posts, which she uses, and she does have a favorite toy she plays with. Not enough I guess? I also do give her as much attention as I can, but I am still a full-time student (hence why I got a cat and not a dog). I've taken her to the vet (nothing wrong physically) and behaviorist. Destroying things might be a de-stressor for her, but I have tried every single piece of advice those two people had given me, in hopes that it would give me peace of mind",
          "id": 9,
          "comments": [
            {
              "score": 1,
              "content": "If you’ve tried everything I don’t think you’d be an asshole. Just give her the chance to be unconditionally loved and make sure her new owners do love her. But also maybe watch My Cat from Hell...lol",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "INFO: What are you doing to alleviate her energy?   Some cats need more than posts and toys laying around. \n\nDid something happen right before her behavior changed (moving? New partner? Etc)? Have you seen a vet for her?\n\nAlso - cats or gardening, you can’t have both sadly. You can grow cat friendly plants, however :)",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "INFO Do you play a lot with your cat or can she go outside? She seems bored or stressed.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA Better than dumping the cat somewhere or to a shelter. Find a good home for it.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    }
  ]
}