{
  "post content": "Yesterday was my sister's (25F) engagement party. Me and my two brothers (one is 22, two of us are 21) have been on the other side of US for the majority of 2023 and didn't think we were going to be there for the party, but plans shifted and we ended up arriving home last Wednesday. \r  \n\r  \nNow I'm honestly not sure if I was invited so much as we simply happened to live where the event was being hosted, because it was held in my parents' house. My sister didn't outright say she didn't want us there, but we didn't see much of her in the lead up. We didn't really know any of the people at the party, so we're going around introducing ourselves to people, mingling, doing the party thing. At some point, someone mentions the family photos on the well and how they were surprised to see a ton of us on the wall when they didn't even know my sister had siblings.\r  \n\r  \nThis sent me down a whole rabbit hole of confusion. This person elaborated and said she was surprised to see this type of photo on the wall because apparently my sister has told all of her friends that my parents were extreme workaholics. We have a really nice house so they weren't surprised by that, just that it felt properly homey and lived in. Once again, I was thrown for a loop.\r  \n\r  \nGrowing up, our home was THE house. We had friends over constantly who were basically like extra siblings. My parents worked the normal amount, and they were home with us as much as possible. We got chauffeured around to sports practices, my parents took the time to get to know all of our friends well, etc. I would even go so far as to say they were more involved in our lives than average. It was my sister who really separated herself from everyone and chose to exclude herself from activities.\r  \n\r  \nAt some point during this conversation, a few other people overheard and soon enough there was a decent crowd of her friends around my brothers and I, listening to stories of us growing up that were blowing these people's minds because it's apparently common knowledge among their friend group that our parents were so hands on, and UN common knowledge that we even existed. I ended up having a really good time and felt like I made some new friends.\r  \n\r  \nAfter the event, apparently my sister was crying because I embarrassed her in front of all of her friends and that the work she had put in to separate herself from us \"golden children\" had been undone.\r  \n\r  \nAITA?\r  \n\r",
  "id": 1,
  "comments": [
    {
      "score": 17603,
      "content": "No judgement from me.  Just curious.  You mention your childhood experiences and that she was trying to separate herself from the “golden children”.  When your friends were over, we’re hers?   Did parents drive to her after school activities?  Did she even have any?  \n\nI see a woman who didn’t want her brothers around.  If childhood was so great, why?\n\nEDIT:  OP states that his experience might have been different to his in replies to other posts. I suggest checking out the comments he has made. It looks like he plans on talking to her so he can better understand her perspective.",
      "id": 2,
      "comments": [
        {
          "score": 6531,
          "content": "Yeah this could easily be a dramatic sibling or a sibling who had an entirely different upbringing, especially as she’s older. My younger sister got away with a shit ton more than I ever would have at the same age",
          "id": 3,
          "comments": [
            {
              "score": 3018,
              "content": "Opposite in my family. I'm the youngest and only girl and I was largely overshadowed by my brothers and used at the scapegoat. We had very different childhoods. My brothers are 5, 7, and 9 years older than me and in my father's eyes, they can do wrong. Me on the other hand was constantly told that I was not good enough and an embarrassment. \n\nFreaking crazy how different families can be.",
              "id": 4,
              "comments": [
                {
                  "score": 2030,
                  "content": "Agreed. I grew up in a misogynistic family where the boys were treated like little gods and the girls had to overachieve to even be noticed.\n\nI was lower down on the foodchain and readily confess that my childhood was hell. My older brothers had a wonderful childhood and talk about it all the time as amazing.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 873,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 394,
                      "content": "I have said it’s a good thing that my FIL died before any grandchildren after my son showed up. My son is the first grandchild and a first born son (which has certain importance in our culture, though basically amounts to ‘you get an extra fast day’ these days). Knowing him, no other grandchild of either sex would have ever gotten attention from him.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 136,
                      "content": "Same. Very misogynistic family.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "My mother's family was the complete opposite.  She has 7 sisters and 1 brother.  Out of about 30 cousins, only 5 of us were boys.   Pretty much all of us have gone NC with the rest of the family due to how horrible they treated us growing up.  They had \"all-girl\" camp-outs and events all year long but the boys never got to go to anything or even had birthday parties, it was crazy.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "My hubby readily admits that his mom treated him better cuz he was a boy, and he had lots more freedom than his sister.   Sound like something similar might be going on in OPs family.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "An old therapist told me a big part of her business was il treated sisters",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 596,
                  "content": "Yes, you have to wonder if the sister here was not sporty and as a result simply got ignored in favour of her brothers. Did she really isolate herself or would any child who did not want to play sports be automatically ignored?",
                  "id": 12,
                  "comments": [
                    {
                      "score": 382,
                      "content": "Or would her not participating in sports be interpreted as isolating herself, and pushing the family away? Being different might not have been accepted.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 286,
                      "content": "Speaking as the older, not sporty sister…this is exactly how I read this. Seems like OP and his sister had very different childhoods (though likely neither were at fault)",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "There’s also the age gap, with her being 4 years older than OP were their parents working a lot more hours trying to get established when she was younger. Like maybe they worked a lot of hours until she was 9/10 or would bring work home in the evening when she supposedly had time with them after the younger kids went to bed.  And then maybe the relationship wasn’t as strong from her side.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I see you have met my parents",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 301,
                  "content": "I’m the younger sister to one brother, less than two years apart, and the difference in our childhoods is INSANE. I was held to a much higher standard in all regards because I performed better academically. My brother had loads of friends and extracurriculars because he was outgoing, but I didn’t because of a (then-undiagnosed) anxiety disorder. Plus he didn’t have to deal with the jealousy and emotional abuse put upon me by our mother. \n\nIf he and I talked about our childhoods, our stories would be wildly different, too.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 8,
                      "content": "This is completely relatable.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I am the youngest of 3 girls. My sisters are 6 and 9 years older. We definitely had different up bringing. They were almost out of the house when I hit my teens so I had more opportunities to do and go places because my parents didn't have all three of us to support anymore, just me. They claim I was spoiled. I figure I just got the luck of the birth order lottery.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 171,
                  "content": "I have an older sister that could get away with anything. She was the baby they tried to have for years before finally getting pregnant. I was the whoops baby that was born 17 months later. My mom made sure to remind me often that she hadn’t wanted another baby so soon and that I was a mistake.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 26,
                      "content": "This sounds like a Ross and Monica type of situation. I've always felt bad for her because of how her parents treated her and they were just characters. I can't imagine how bad it was having to experience that in real life.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "What kind of mom says that to her child? I would have never said that to my kids. I’m so sorry you went through that.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "That's sick. Did you ever tell her that she should've kept her legs shut?",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "This is similar to my family. I’m the eldest and the only true accident (condom baby) as well as born when they were only 19. My brother wasn’t planned but he was expected (we have one so two was going to happen kind of thing) and my sister was *very* planned. My mom talked often of how she never wanted to be a mother in the first place and I was hyper aware that I was the only child they didn’t want.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I am the youngest of 5,and was also a \"mistake\". Here is the difference, my mother would tell me I was a mistake, but the best mistake she ever made.\n\nTell you what I've learned in my decades on the planet. Very few families resemble the Brady Bunch or any other perfect family depicted on television. Unfortunately for those of us that grew up before the internet we would compare our families by these examples, not realizing that in reality this depiction was a fairytale.\n\nWhat is my reality? I grew up in a family of substance abusers. I used to lie to my friends about what a great family I had. As I aged telling the truth set me free. I wasn't ostracized by my friends, on the contrary I was praised for escaping, and becoming successful. I do not have a substance abuse problem, I do however carry the weight, and the scares growing up in that environment will leave. As for my siblings, I lost my last brother in 2019. All of them gone before their time from substance abuse. Painful? You bet, every day of my life. I have tears in my eyes just writing this. \n\nMy escape was joining the military where I spent 12 years Navy Spec/Ops, and am now employed at a well known university in a career. Am I someone to be admired? No, it was only by the grace of God that I took this path or I would have one foot in the grave by now without a doubt. \n\nNow this is for you OP. \nAre you the A-hole? I do not believe that you or your siblings intentionally set out to hurt your younger sister. I do however feel you knowing your sister could have been a little more sensitive to her state of mind concerning her perception of her childhood regardless of how you feel. \n\nYou say you had a wonderful childhood? I'm happy for you, but obviously your sisters recollections do not paint such a pretty picture. \n\nSo in closing OP, instead of feeling the need to defend your parents in situations such as this, you and yours might ask yourselves why does my sister feel this way, and what can we do to support her? \nShe obviously has some deep seated emotions that cut her to the core!\nMy question to you OP is why don't you know this, and why aren't you giving her what you know she needs?\nShe is your sister, your blood. With all the flaws that led to all my siblings early deaths, I would give anything to have just one sitting beside me right now!\n\nGodspeed.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Like Ross and Monica.,",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "It is crazy! Unfortunately that’s a pretty normal occurrence as well :(",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I was the youngest and a “happy accident” so there was a big age gap in my family, which led to entirely different experiences in growing up. Birth order, etc. all matters.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Funny, I’m the oldest, and I wasn’t as trustworthy or responsible or smart etc etc as my little sister",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "There's a saying along the lines that happy families are fairly similar, but each ducked up family is ducked up in it's own unique way",
                  "id": 30,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Thr opening lines of Leo Tolstoy's novel Anna Karenina: \"All happy families are alike; each unhappy family is unhappy in its own way.\"",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I’m 7 years older than my sister. We’re both females. She’s always been the golden child that can do no wrong and I’m the scapegoat who gets blamed for literally everything. I also constantly am told what an embarrassment I am, all my moms stress is taken out on me and I get blamed for my mental health issues (depression, adhd, anxiety) and am treated like the biggest disgrace to my family because of it.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah I never got any privilege being youngest, just easier to yell at and blame. I do have a toxic family, this led me to live all the stereotypes in my early 20s. Leaving to be homeless, using as a result, being the only one in therapy/diagnosed and not anyone take accountability. Not for me using or leaving for how they treat me, which is still more traumatic than the stuff in my 20s.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 617,
              "content": "Well spotted, I hadn't noticed that the only girl is 3 years older than the next.\n\nI was 3 years older than my brother, and got scolded in his stead from time to time: \"why did you let him fall from that tree\", like, hello, he climbed it like a monkey, what did you expect me to do?\nLooking back, it's mostly my father being unable to regulate his emotions: he ventilated his worry over my brother's bumps and bruises (he didn't have any serious injuries) by screaming at me. And my mom. And then my brother too. And then all of us. \n\nStill, I can see how an elder girl might have felt burdened with a lot of responsibility.\n\nI think it's the small details of OP entertaining a whole crowd, with stories he knew directly opposed what his sister's friends believed... and of \"I felt like I made some new friends\".\nTo me, that reads so oblivious, it wouldn't surprise me OP has never picked up any nuances of his sister's experience.",
              "id": 34,
              "comments": [
                {
                  "score": 157,
                  "content": "It drove my older sister nuts. She and my younger sister would often squabble , and she was always the only one who got in trouble because 'you're older, you should know better'",
                  "id": 35,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Oof the 'you're older you should know better' just instantly raised my hackles so high I became immediately furious",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Can confirm as I am an oldest girl. \n\nThe responsibility to compromise for things or care for my brother in any situation was always on me. Vacation? Younger sibling cries because he HATES museums, so we go to tour a battleship nearby. Dinner? Younger sibling is in a “hates tomatoes” phase, so we cannot have pizza or pasta. Friends over? Younger sibling MUST be able to be included in anything we do. Parents have date night? Well you can’t go to work or do your homework, younger sibling needs a sitter.\n\nSpeaking out against any of these things, or being upset about or acknowledging the pattern, all meant that I was a bad big sister who hated my brother and was a mean and bitter person. \n\nWe didn’t realize until later that much of my brothers episodes were related to his autism, but my suggestion many many years ago we get him assessed also meant I was a bad sister who hated him and just wanted a reason to be a dick to him (no, he was struggling in school and needed help, but whatever). \n\nI was a very handy child and learned things quickly, but the second my brother was old enough, I also was excluded from typically male chores I’d once enjoyed learning, even though I loved them and my brother hated them. So I just didn’t hang out with my dad at all and learned the adult version of those skills on my own. \n\nWhen you’re the older sister, especially if your parents wanted a boy and got one later, sometimes your life experience is *very* different. My brother only recently became aware of this, and now gets why I was often called hostile and angry as a child, and feels really grossed out that most of his “happy family” memories came directly at the expense of my own wants and needs. \n\nBefore I moved back to my hometown area, many of my friends also were not super aware of my sibling either, and just knew my parents were pretty much absentee for me unless they were toeing the abuse line (or jumping across it). My parents and brother were similarly hurt to realize this misconception during my wedding events, but lots of therapy and arguments still happening later, now get why it happened. \n\nSounds like OP is about to get clued in on the same thing.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It sounds much worse than oblivious. You can’t be a human being with eyes and not notice that your sibling has been treated much worse than you. OP literally redirected the attention of an entire room of people so he could bask in the spotlight and “prove” his sister wrong. If this is oblivious, OP is the most egregiously oblivious person on the planet.",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 428,
              "content": "Hard same. My sister was only a year younger than me but she got away with *way* more than I ever would have even dreamed of trying. Like literally she threw a house party and our parents thanked her for cleaning up, then turned around and interrogated *me* about whether she'd told me and grounded me for a week for not finding out and giving them the heads up.",
              "id": 39,
              "comments": [
                {
                  "score": 377,
                  "content": "I feel you!\n\nWhen I was 19, married, and had been living away from home for two years my mother called me up and berated me because my 16 year old brother threw a house party when they left him home for a weekend.\n\nApparently I had set such a bad example when I lived at home that it was my fault that my brother and his friends trashed the house.\n\nn.b. Did I ever have a house party? No",
                  "id": 40,
                  "comments": [
                    {
                      "score": 68,
                      "content": "...yeah, I probably would have cussed them out before hanging up and blocking their numbers, honestly.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Boy can I relate.\n\nAlso if I ever *did* throw a house party metaphorically you'd be finding my femurs in orbit from how badly they would have exploded at me.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 120,
                  "content": "Stuff like this makes me wish we could react in a way besides up-voting or down-voting. I'm not going to upvote. I can't relate, and it's sure as shit not a good thing. -I'm definitely not going to downvote, you've clearly received enough negativity, and it's not like I could disagree, or even have an opinion for that matter... \n\nReally though, as an eldest sibling and now a mother myself, your parents make me sick to myself. You deserved better. I hope their retirement is as happy and relaxed as your childhood was.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 91,
                      "content": "New reddit feature: the side-vote! When you want to say “I neither agree nor disagree, and think your words should be heard”, sidevote the comment!",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "You want to show support or compassion. The upvote button works for that too. It's not a \"like\" button.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "What! That is insane. How has your sister turned out?",
                  "id": 46,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Better than you'd think, eventually. \n\nShe had to become an adult and encounter consequences of her decisions that our parents couldn't shield her from first, though. \n\nAfter a good 10 years of Holy Crap the Real World Has Consequences, she settled out.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 45,
                  "content": "I'm literally speechless, I don't know how to process this. \n\nIs there any relationship left with any of them at all?",
                  "id": 48,
                  "comments": [
                    {
                      "score": 6,
                      "content": "[removed]",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "OMG, I thought only my mom was this crazy. All of my brother's friends still refer to me as a tattle-tale (51f). I would get grounded and spanked for not knowing and telling",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I got grounded for my big brother throwing a party once too. \nHe kicked me out of the house and made me stay at a friend's house so he could throw it too. \n\nI thought I was the only one. Cheers to having similarly insane mums.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My mother hated my undercut. The rest of my hair was chin length when I had my way. Anyways, she fucking hated that haircut and we fought about all 4 years of high school. After graduation, I let I go and just grew my hair. Then, I was going to see my favorite band that November. So, I cut my hair, and my mother lost her mind. She ended up throwing me out. They took me back in a month and a half later after I had pretty much hit rock bottom. Then I moved out permanently 5 months later.\n\n\nSo, not long after I moved out, I went to visit and my younger brother had the exact same hair that got me kicked out.  When I noticed, I blurted out something about her being fine with his hair like that. The only reply was my father quickly telling me to shut my fucking mouth and looking like he could kill me.\n\n\n\nThat's how my house rolled. I walked everywhere because my dad got pissy every time I asked for a ride. My dad went out of his way to get my brother where he wanted to be. Like I never once got a ride my first two years of high school. Then my dad started driving my brother as soon as he started.\n\n\n\n\n\nIt was not a good time.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "One thing that sticks out in my childhood is the fact that I had my best friend and her boyfriend in my basement bedroom when I was eighteen and my mother yelled at me about having a boy in bedroom. Yet, my sister, who is 6 years younger than me got pregnant at 16.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 249,
              "content": "My sister is just 2 years younger and we had vastly different childhoods. In our case it didn't even have to do with how our parents treated us but came out of the fact that they moved into a new neighborhood belonging to a different school district between us starting schools.\n\nBoth my younger siblings went to school with middle class kids living pre-dominantly in houses. I went to school with lower income apartment kids with frequently unemployed parents.\n\nJust 2 years apart but very different environments. My sisters never noticed my friends couldn't afford to go to the cinema or that I never got invited to a friend's summer house. Ofc I noticed that my sisters got to do tons more fun stuff with their friends.\n\nThey still talk about how \"we grew up\" because they didn't notice the differences. They don't know my class had an extra assistent whose sole purpose was to break up fights. They don't know I never had a proper math teacher nor science teacher before high school (the one we had the longest was an unemployed actor).",
              "id": 54,
              "comments": [
                {
                  "score": 77,
                  "content": "Did you just... Never transfer schools?",
                  "id": 55,
                  "comments": [
                    {
                      "score": 117,
                      "content": "No, no one ever mentioned that possibility. The house we moved to was within walking distance of both schools so probably nobody saw the need.\n\nIt's btw not so common to transfer schools in Sweden. The parents aren't involved in picking a school or applying to one. One just gets automatically called to one and assigned to a class depending on exactly where one lives. E.g. everyone in my class lived on the same block (initially). The only transfers I heard of was of bullied kids, not kids moving within city limits.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 196,
              "content": "Hard opposite here. I was eldest sibling , female to two brothers. They were absolutely golden children,  one knocked up a prostitute and basically got hugs and 'what do you need , can we help?'. I was the one who had to break the news and got mentally and verbally abused..my fault apparently lol. \n\nThat's just one example . But yeah,  I'm getting the feeling sister took the knocks and a lot of shit for being 'grown up sister' when younger,  with all her brothers mates around.  More than meets the eye to this story.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This.\n\nNAH. This could be simply a case of nuance. She may have sensed that she wasn’t really wanted or was somehow being treated differently. \n\nMy sister would say that our childhood was great. She also has a horrible memory that seems to retain only the happy times. In reality, we had “tough love” - to the point in which my mother would make us pack all of our things and “pretend” to kick us out of the house and right as we opened the door, would tell us that it’s just to teach us a lesson among other emotionally abusive tactics. We were encouraged to do well in life and we did, but we still had to endure those awful times that my sister supposedly doesn’t recall.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1706,
          "content": "> it was really my sister who really separated herself from everyone and   chose to exclude herself from activities \n\nOuch. OP’s kidding themselves if he thinks she willingly stepped away from all the fun. It’s an engagement party for her, and he spent the night talking about how recluse she was. Seems like a classic case of not knowing they’re the golden children.",
          "id": 59,
          "comments": [
            {
              "score": 1104,
              "content": "Holding court with stories about your amazing home life, while you already found out that's not the experience your sister's shared with her friends... and then basking in that gleeful horror to the degree it\n>felt like I made some new friends\n\nTalk about oblivious",
              "id": 60,
              "comments": [
                {
                  "score": 355,
                  "content": "21 is too feckin old to show up to someone else's party and make yourself the center of attention. It's not cute. His lack of empathy and self-awareness and total ego-centricism make this a hard YTA for me. He's got some serious reflecting to do about the stories he's told himself about his sister was treated growing up and who was responsible for creating that dynamic.",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 77,
                  "content": "A lot of rich people sure are dumb. They never had to learn anything.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I think I'm missing your point, or something got lost in translation...?",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 236,
              "content": "Yeah, if everyone is not very aware of you, spending the night talking about yourself and taking up everyone's times regaling her friends with your stories is pretty damn weird.\n\nLike OP seems to unironically not understand why his sister is mad after OP detailed how he and his brothers made her engagement party all about them.\n\nI wouldn't be surprised if that's a common theme through their childhood and they are completely oblivious as to why she separates herself from them.",
              "id": 64,
              "comments": [
                {
                  "score": 5,
                  "content": "Well, not even just talking about himself but doing so to deliberately contradict and negate his sister's lived experience was a real AH move.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "[deleted]",
              "id": 66,
              "comments": [
                {
                  "score": 173,
                  "content": "Either is a possibility but I am curious if OP doesn't realize that just because they had a good childhood or believed they had a good childhood that does not mean their sister did. \n\nI know how painful it is for me to see some of my siblings look back with fondness when for me it was abusive, misery and pain. \n\nMy little sister is my best friend but she just cannot conceive of the possibility that she was indeed the golden child and I was not.  She'll say things like \"well I got to do XYZ and you didn't because you didn't ask and I did.\" But I did ask or yeah, I didn't ask because I knew the answer would be no.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 112,
                  "content": "It doesn’t seem really clear how much she lied, though. The only “lie” I really got from the text was that the sister made a point of not mentioning her siblings…and if she was no-contact with them, she might have had a legit reason for that.\n\nI’m no-contact with my whole bio-family, and I basically never mention my brother at all unless someone specifically asks. Then I only answer with the absolute bare minimum: I have one younger brother who I have had zero contact with since at least 2010. That’s all anyone really needs to know. \n\nI was the scapegoat growing up, and both my parents and my brother were physically, emotionally, financially, and on many occasions borderline sexually abusive to me. To the point where I have zero doubt in my mind that if I had not moved out when I did, my brother most certainly would’ve escalated his behavior to rape.\n\nMy family is not a part of my life, so there’s no point in any new friends knowing about them. At all.",
                  "id": 68,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "> I mean, there is always the possibility that she's lying too though. She lied to her friends about a lot of stuff that wouldn't have been necessary to do to gain their sympathy.\n\nMost people don't want to be the victim. I have brothers but I don't talk to them because the three of them bullied my and my parents loved them but not me isn't the kind of thing most people openly share.\n\nNot talking about siblings and making up an excuse why you weren't close with your parents is a much easier explanation if you don't want to detail your childhood trauma.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 91,
              "content": "I will say that growing up, I willingly “stepped away from all the fun” in my family. I had different interests than my parents and siblings and kinda isolated myself. It was nobody’s fault and my parents did nothing wrong, but I just always felt like I was born into the wrong family where I didn’t belong. I was also the oldest daughter. I was miserable a lot as a kid, but as an adult, I’m in a healthier state of mind and realize I spent a lot of time deliberately making myself more miserable. \n\nWhile I feel OP is insensitive to his sister’s different experience, the sister may very well have had an experience more like mine",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "honestly this was my sister too a couple of years ago. when I met her husband after living overseas for a while they basically thought that we both had been raised by wolves and that we grew up as destitutes. when the stories of my mum driving us around and we taking swimming lessons, horse riding lessons and having family holidays where being told it turns out my sister just…. forgot. it was a surprise to all of us. Our house was also THE house that everyone gathered at. she was super popular and had a ton of friends. I honestly don’t know what glitch happened on her brain as when i spoke with her about it she was like “i don’t know “ it honestly still baffles me that she presented herself as a person that had been abandoned , unwanted and with no other options to her husband",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 798,
          "content": "It appears to me that OP is woman, because there are multiple mentions of \" siblings\" not brothers. Story starts with \" me and my brothers\", and then \" they didn't know sister had siblings\".",
          "id": 72,
          "comments": [
            {
              "score": 1140,
              "content": "OP says in a comment that the sister was the only girl",
              "id": 73,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 545,
              "content": "You'd be wrong, OP has commented that the sister is the only girl in the family",
              "id": 74,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I call my brothers my siblings all the time.\n\n\nSibling- each of two or more children or offspring having one or both parents in common; a brother or sister.",
              "id": 75,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Literally all you've established with this is that people talk about themselves in the first person.",
              "id": 76,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I think OP was being intentionally vague about his gender to avoid the assumption that the boys in the family were treated differently than the daughter. Whole post feels kinda off and manipulative to me. OP seemed to like being the center of attention at the party, and doesn’t demo ever having had any curiosity about why his sister felt the way she did.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "“two of us [brothers] are 21”",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 792,
          "content": "As a single sister with three brothers, from the very beginning of the post I had a feeling OP’s sister was the outsider of the group just from how he talks about her (fully admit this could be projection on my part). OP and his brothers may have ostracized her for her whole life and don’t realize how much damage that causes. And yes, resentment does build up for parents that allow that to happen under their roof and are blind to one child being singled out and unwanted by the others.",
          "id": 79,
          "comments": [
            {
              "score": 160,
              "content": "I was left out of a lot of family activities with my cousins as a child growing up. I struggle connecting with my cousins and I often feel socially awkward because of that exclusion as a child. I tend to avoid social situations that aren’t required or expected attendance at this point of my life.\n\nI am so much more comfortable around my bf’s family for some reason. I’m still quiet but they actually talk to me and make an effort whereas my family pretty ignores me in social situations. \n\nMy brother recently had been on a sort of social protest but I’m pretty sure now his relationship with the rest of our family is beyond repair. Even though he knew he had a privilege being favored by dad, that relationship is beyond repair now.",
              "id": 80,
              "comments": [
                {
                  "score": 65,
                  "content": "Also excluded from a lot of family activities by my mom. She always seemed to coddle my younger brother because he was \"the boy\" but then talked about how much she resented how her own mother did the same thing and showed favoritism towards her younger brother. Then thanks to 23andMe I found there was more to the story and I was probably being excluded because I was the product of an affair that ended quite sour. If parents could just stop projecting all their many unresolved personal issues onto children that would be great.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "It is so fascinating to me how differently people react to things. I too was left out of things in my family growing up. I sometimes stumble across something where I will realize that all of them did the thing together and I was not part of it. How little I know of so much of my family.\n\nBut, and this is my point, I was also a major introvert who found lots of people overwhelming. I perceived this treatment as \"oh thank heavens, I don't have to go and can stay home with my book\" or \"oh, yay, they'll *let* me stay in the car and read\" (while they all went inside for like two hours and did whatever the event thing was). \n\nIt was ONLY as an adult looking back, telling stories, comparing childhoods that I had that 'aha' moment of \"wow, I really did not participate in a lot of things\" - and I also eventually learned that most of that was on my mom who (for reasons) was lying about a lot of things to me and to the rest of the family and did her darnedest to make sure we didn't get any chance to compare stories. \n\nSo, I knew I was excluded but was okay with it. It aligned with my own feelings. But for people who want to be part of and don't know why they aren't - gosh that can feel so bad. I have sympathy for everyone who didn't get loved as a child they way they needed to be loved.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I wanted to be included but, kids being kids, they often times wouldn’t because I was the littlest. My parents were divorced and I lived with my mom. My brother lived with my dad (who lived with his brother and my cousins for a while). \n\nSo sometimes I still feel that vibe of “No u can’t ur too little!” And it just makes me not want to be around any of my family sometimes because I feel like I’m just an annoying presence to be around. \n\nMy brother is kind of the exception. He’s done a great job of inviting me when he can to things and helping me out. I’m actually dog sitting for him right now and he’s letting me stay at their place with the dog so it’s nice that he still looks out for me in that way, kind of like when we’re kids. [DOG TAX!](https://imgur.com/a/nZRaJXx)\n\nOur house was really dysfunctional growing up and he was the golden child and I think he knew it. Once he was able to he moved out or at least wasn’t around a lot. When he was around, he went toe to toe with my dad, who was often drunk and got mouthy and he stuck up for my mom and me because he knew my dad wasn’t a good person and didn’t and doesn’t treat my mom and I well.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I was the same but with my siblings I’m the youngest never felt included at all. \n\nAll family gatherings was quiet and anxious and put a stop to them as my eldest son commented at 4 how uncomfortable he was and anxious. \n\nIm close to my Dad side of the family and never felt left out and welcomed. \n\nBut my mum side are a pack of AH and as a mother now I realise it’s so wrong to feel so anxious around family. \n\nAnd also have no issues with my husband family all welcoming and I always felt more comfortable with them then my own family.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "As the only girl in a family with 3 brothers, I totally agree. I had 2 older brothers who teased me for being a girl and always made me feel like I was shit",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 481,
          "content": "My mum favours all the boys! My adopted sister and I were live-in maids. She calls them every week, and video calls. My sister and I barely get a text lol.\nIt's not unheard of to have a very unhappy childhood whilst your siblings grew up happily, seeing things in a very different light. \nI would say NAH as whatever is wrong with his sister doesn't seem to be the fault of OP, most likely parents favouring the boys.",
          "id": 86,
          "comments": [
            {
              "score": 439,
              "content": "It could even be unintentional favoritism. Three boys, two twins and one born barely a year before. That takes up a lot of parental attention. In all likelihood the three brothers shared friends, making it easier to set up play dates, do carpooling, and getting to know people. Especially if the boys shared enough interests to be treated as a group.\n\nMeanwhile, you have the older girl. She’s not one of ‘the triplets’ so that automatically creates distance. She has a completely different friend group, different interests, different needs. So she feels ostracized. \n\nAnd, because the ‘triplets’ take so much attention, she feels like she doesn’t get any/enough. The triplets individually may even get the same attention as her, but because they can often be treated as a group, she effectively gets less. \n\nTo put it another way, parents are being fair and each child gets one play date for one weekend a month. So parents set up a play date for daughter. Daughter gets her one play date. Then parents arrange for Boy A to have a play date. But since they share friends, boys B and C also get a play date along with A. So the boys get three effective play dates a month.\n\nYou can put that to just about anything else. It’s entirely possible that sister technically got the same as her brothers individually, but the brothers got more collectively. And the brothers never noticed an issue, since they never really hit a point of being unhappy with being treated as a group.",
              "id": 87,
              "comments": [
                {
                  "score": 361,
                  "content": "I think this is the most likely scenario of what happened. I know my parents often tell stories of how much fun it was to raise us all so close in age, but that the first two years or so were particularly hard. They got into a rhythm after that, but it’s possible my sister was still left out because my brothers and I were attached at the hip and an activity for one was an activity for all, like you said. \n\nI’m going to talk to her soon and get all the details of her experience. This seems to be the closest I could imagine to reality in my mind though if I had to venture a guess.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 328,
                      "content": "And fucking apologize to her.\n\nYou got on a soap box at HER engagement party, that you just happened to be in town for, and not directly invited, and told all her friends she was full of shit because you couldn't comprehend that her childhood was different to yours. \n\n\"I know my parents often tell stories of how much fun it was to raise us all so close in age\" you do realise this did not include her right?\n\nYou've likely done some irreparable damage to her friendships and trust circle.",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 165,
                      "content": "I replied to another comment of yours a few hours ago, but I did forget to mention that it struck me as if you had begun thinking about her childhood experience a bit more, hence your original post and question, as immature as it sounded. I certainly feel bad for that poor girl whose childhood seems to have been bulldosed by three other siblings' needs. I hope that you will listen to a lot of well meaning people here and reach out to her to try and understand her better, and build that sibling relationship that she clearly missed out on.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 153,
                      "content": "> I know my parents often tell stories of how much fun it was to raise us all so close in age, but that the first two years or so were particularly hard.\n\nThose were not the first two years or so. The first two years or so happened *before you were born*. Yes, I know what you're saying - but if your parents are using this phrasing, or anything like it, dollars to donuts your sister is thinking the same thing I just said.\n\nIt's good that you're listening to people, and open to listening to your sister, *really* listening to her. And if you'll take my advice, listening means *listening*. If you're spending your time thinking of your response and how to defend yourself and your parents, or justify their actions, then you're not actually paying attention to what she's saying. Listen first, affirm her feelings (even if you're not sure about the facts - but don't say that part!), think about it later. Do not confuse listening with arguing. Those are two different things. If, upon reflection, you decide that you disagree with her on some point or another you can always tell her *later* if it seems important.\n\nQuestion (you don't have to actually answer it on this thread, but see if you can answer it in your own head for yourself): Do your parents tell as many stories of the first two years of your sister's life as they do about those two hectic years after you were born? Do they tell as many stories about *her* as they tell about the three of you? (For that matter, do they tell as many stories about each of you brothers *individually* as they do about you as a trio?)\n\n> my brothers and I were attached at the hip and an activity for one was an activity for all, like you said. \n\nIt was not an activity for all. It was an activity for the three of you.\n\nWhich also - honestly, I don't think that was the healthiest thing for you and your brothers either. I think your parents would've done better to make more of an effort to encourage you to develop your own individual interests. \n\nWhat would've happened if one of you had decided you didn't like ice hockey anymore? That you wanted to do something totally different, like dance or fencing or bouldering or drama or  photography or joining a writing club, something that your brothers weren't interested in?",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "I’m curious: how much time did you get as an individual? That is: just you, no brothers. A party for you, just your friends over, a parent-son day without your brothers.",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "Who is included in the \"us\" in these stories that were so much fun to your parents?   It doesn't seem to include your sister at all.  Your parent may have enjoyed running around with the three boys who were so close in age, do they have stories that include her or that highlight their having to balance her needs with yours?  \n\nYou accuse your sister of lying about \"our\" childhood when it is very clear that she never talks about *your* childhood at all.   And yet you get upset because to you think she didn't give enough credit for all the time your parents spent with you and your brothers.\n\nYou need to be much more mindful of how you use the first person plural terms like \"we\", \"us\", \"our\".   It's quite clear to the people here that you actually don't think of your sister when you say those things, you just think of her a family prop that decorated *your* upbringing.  That's why you had no problem commandeering her party into what you thought was the proper direction: to show what a wonderful life you and your brothers had in that house.   That wasn't the purpose of the gathering.   The purpose was supposed to be to focus on her and her fiance's future, not on you and your brothers' past.    You owe her a big apology.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "you got a lot of (apparently valid) criticizm in here (and various garbage takes and 'creative interpretations' as well, as is tradition 'round here) but I'd like to commend that you seem to start to understand how your sister likely has a quite different perspective on your childhoods and that now you at least are trying to make an effort to understand and connect. \n\nwhen you talk to her and listen to her perspective keep in mind that this isn't about judging her pov being 'right or wrong' but first about understanding how she feels and why.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I’m glad that you’re going to get her experience directly, but you owe your sister a significant and genuine apology. \n\nYou took over her engagement party just so you could call her a liar. You held court with her friends and turned the occasion into a party about you and your brothers. This was your only sister’s ENGAGEMENT party. How much have you harmed your sister’s relationship with her friends by calling her a liar in public? You can’t walk this back even if you speak to each of her friends individually to fix the damage you caused. \n\nThis is about more than how each of you grew up, and it was caused by your actions. The choice about what to do now is yours.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Definitely talk to her, and try to keep an open mind. It's difficult to reconcile different experiences of the same thing sometimes, but unfortunately it's not uncommon for one sibling to feel quite different from the other(s). Good luck!",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I think that's a good idea, though I urge you to be kind. She's already cried over her engagement party, avoid any kind of interrogation or, worse,  accusation that might raise tension between her and your parents.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I don't understand why you call her a liar.\n\nI'm one of six kids (brothers were all hockey players, btw).  We were all two years apart and we had \\_incredibly\\_ different childhoods.  Our parents were both completely focused on us BUT they treated us differently, our interests matched up with family interests or didn't in very different ways, we had different levels of assertiveness, and the family circumstances--money, tension level between my parents, how many kids were still at home to divide up attention, how \"modernized\" the family was, how emotionally close we were to our nearest siblings, whether or not the oldest boy bullied us, whether or not there were neighborhood kids who matched up to us in age and interests and were available as playmates--that was all completely different in each case.  \n\nHow could it be any different?\n\nIt's the parents' job to make sure the family works for everyone.  In a large family, very few parents do an equally good job with all their children.\n\nWhen I read your comments, it doesn't sound like there was any space at all for your sister.  Reading books and being good at school doesn't mean you need less of your parents' attention.  It might mean you need more.  Were your parents skillfully meeting your sister on her own ground?  If your kid loves sports it's easy to sign them up for one sport after another, and there's a good chance they will make friends and have a great time.   The parent contribution is easy...but incredibly time-consuming and often quite expensive.  If your kid is introverted and loves books and school, you need to find the opportunities that let them thrive, too. \n\nDid your sister get as much praise/excitement and support for her interests and achievements as you and your brothers did?  Does she have a legitimate reason to see you as the golden children?",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 84,
                  "content": "It's entirely possible her parents didn't intend to ostracise their daughter. In fact, I believe in my mums eyes she didn't play favourites. I truly believe that! \nHowever, it's impact over intent for me & still blame the parents. Doesn't mean that the parents are bad people, or that they don't love their daughter, but something happened to make her feel like the 3 boys were the 'golden children'.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Oh, 100%. It’s actually not an uncommon complaint of singleton siblings of multiples, that the multiples got more attention. Of course, many multiples complain about not being seen as individuals. It’s just a tricky balance.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 190,
              "content": "Yep my adopted uncle got kicked out at 15. It was an extremely abusive household for my uncle  but not so much for his youngers bros. In the end my uncle found out his mom got him from an older alcoholic and probably not consenual.\n\nHis lil bro asked him why he left home at 15. He said; i got kicked out\n\nHis bro was completely surprised and suddenly remembered my uncle got daily beatings, cigs&bottles thrown at him and the verbal humiliation",
              "id": 101,
              "comments": [
                {
                  "score": 70,
                  "content": "That's awful, your poor uncle :(",
                  "id": 102,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Yep. He never really recovered.. super nice guy but he has many triggers when hes drinking..",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I mean OP and his brothers still went to their sisters engagement party, uncovered that she doesn't openly talk about them and made her engagement party all about themselves. That speaks some pretty big volumes, also that after detailing exactly how they did that, OP sees zero issues sister could have with him.\n\nSo if she was lying or not, if they knew much about them or not, it's her party. It's easy to divert questions and go over to the sister and make the party about them but they apparently didn't try.",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 230,
          "content": "You should leave a comment. All his replies conform that she did see a massively different childhood than her brothers. His parentS (both emphasized) would go to all their games. She would be dragged along to games and practices too (so parents involved several times weekly for the boys) and the mom would take her to the bookstore *maybe monthly*. Of course the parents weren't involved with reading and discussing the books with her because they were into other genres... can't expect the parents to get into something simply to spend more time with their kid. Oh, but at least one parent would attend her school award ceremonies (ie, YEARLY, at most twice a year) *if they didn't conflict with the boys activities*. \n\nHe wrote all that and still thinks that her childhood was the same as his and that his parents paid just as much attention to her. OP YTA.",
          "id": 105,
          "comments": [
            {
              "score": 32,
              "content": "My heart hurts for her, how could the parents fuck up so much",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Oh, no. I already felt that this was a case where his childhood was different from OP's and his brothers, but after reading this, OP YTA 100%.",
              "id": 107,
              "comments": [
                {
                  "score": 15,
                  "content": "Yeah, it's sad that he got the validity of the NTA judgement, but it only came because he failed to give the whole story in the original post... just like he did to his sister's friends at *her* engagement party. Hopefully though, he'll read through all the other comments and actually try to better himself.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 205,
          "content": "This is my questions as well, I'm the only girl of 3 kids, my brothers got to do multiple sports throughout school and were allowed to have friends over whenever, while I was stuck pretty much locked in my room. My parents were very present...for my brothers, never their daughter. It's a big reason I'm not involved with any of my family besides one brother and my aunt, and even those interactions are few and far between.",
          "id": 109,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 172,
          "content": "Engagement party held in her childhood home and seemingly not a single friend who knew her during her younger years is also telling. Sure, not everyone keeps up with their friends from their school days but still kind of surprising.",
          "id": 110,
          "comments": [
            {
              "score": 197,
              "content": "There is no evidence that *her* friends were ever part of the cool house OP enjoyed with his brothers.   Nor that anyone in her family was involved in whatever she did at school.   At this point, she had done a lot of work to put that all behind her and her brothers show up, uninvited, to steal the spotlight again.",
              "id": 111,
              "comments": [
                {
                  "score": 10,
                  "content": "Show up uninvited and \n\n>but we didn't see much of her in the lead up\n\nI shudder to think of the amount of attention the brothers are going to need the morning of *her wedding.*",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I don't doubt that she and her siblings may have different perspectives of their upbringing... but why host a party in your parents' home where your younger siblings still live and where your parents have family portraits hanging about KNOWING full-well that you have not even told your friends/guests that you have any siblings?",
              "id": 113,
              "comments": [
                {
                  "score": 17,
                  "content": "Because, originally, none of the brothers were going to make it home in time for the party.  “Plans changed” and they all showed up early.",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 134,
          "content": "OP's comments make it pretty clear that they are oblivious to the fact that her experiences growing up were not only different but likely would have made her feel like a 4th wheel with her siblings. Based on the post and comments, she was only girl, was 3 years older, and was the only one who didn't play sports, who didn't do extracurriculars, and who \"liked to read\" while her brothers all played sports (sounds like they played together/onthe same teams together), had a large shared friend group, and were all within 2 years of age.",
          "id": 115,
          "comments": [
            {
              "score": 16,
              "content": "Hey now, fourth wheel is at least wanted.\n\nShe's like an awkward third wheel no one bothered to properly install and is thus getting dragged because it's facing sideways.\n\nIt's not her fault but all anyone involved notices is the front her existing causes.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 103,
          "content": "People can have completely different childhoods in the same exact house.",
          "id": 117,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7353,
      "content": "NTA, but, you need to really consider that your sister may have had a completely different experience of childhood than you and your brothers. She’s got enough of an age difference that it’s very possible that your parents were *not* hands on with her as she went through things, only to show you and your brothers with attention when you passed the same milestones 3 years later. That difference can be extremely painful for siblings who not only experience the lack of care but also are left to try to explain the difference in treatment. It’s very weird that she omitted your existence, but would not be surprising if she felt basically neglected even as you and your brothers felt showered with love.",
      "id": 118,
      "comments": [
        {
          "score": 1943,
          "content": "Just going to tack on here. I'm the oldest of 4, the middle is 4 years younger than me and the youngest (twins) 10 years younger. We did not have the same childhoods whatsoever and a lot of my adult years have been spent reconciling all of the disparities and unfairness that existed between our experiences. Big sis in this situation definitely went about this in the wrong way, no doubt about it. But to go that far absolutely points to deeper issues going on in the family dynamic and should be evaluated as objectively as possible by her and her siblings if they want to have a decent relationship as adults. In my situation, middle knew some stuff was up but didn't fully get the extent until we were living together for a short time as adults. Twins had absolutely no idea until they were 16 and started noticing things and asking questions. I don't blame my siblings at all for any of it, I'm honestly very happy that they had such a better time growing up than I did. I was also decently aware of the jealousy and resentments I felt at times and was very determined not to punish them for what our parents had done. I hope this big sis gets some closure and her siblings can find some empathy for the situation.",
          "id": 119,
          "comments": [
            {
              "score": 428,
              "content": "13 years between me and the next oldest on one side of my family. I’ve come to terms with the different childhoods, but my parents seem to struggle to understand some of how I operate as being a direct result of seeing the differences in not only finances and opportunities, but in parenting style.",
              "id": 120,
              "comments": [
                {
                  "score": 309,
                  "content": "I am absolutely with you there. My parents PREACHED equality in all things when we were growing up, no favoritism in how much financial help we'd all get, everyone would have the same chances and opportunities, blah blah blah. I mean, they really beat it into us. I knew I was in a deficit for most things, but generally it was experiences and more intangible stuff like just being nice to me. I'd kinda written it off until I had asked for help paying for school and they balked because i decided to go mid 20s instead of at 17 and I dropped it. Then I found out how much middle sibling was getting per semester and I just lost it. I actually made a list line for line everything my siblings got that I didn't, I even gave grace in areas that I knew were because I just missed the boat on because my parents made better money later when I was out of the house already. But maaaannnnnnn did they go white when I quoted back all of the things they told us growing up, they were both on the losing end in their families because other siblings were favorites and so many stories of how hurt they had been emotionally or behind the eight ball financially for not being treated equally. Most of the emotional and experience and parenting style stuff they still won't cop to even with proof. But for about 5 years now my siblings and I keep a basic tally to make sure we're all being treated fairly financially. I'm lucky to have siblings that care enough that we back each other. For us it's just forcing them to keep their word after preaching about it for so long. My parents have since gotten on board and we can have open and calm and even sometimes happy conversations about it now. But I'm fully aware if my younger siblings reacted differently to any of this my situation would be entirely different.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Sounds like you have great siblings",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 128,
                  "content": "There’s a 7 year difference between my oldest and my twins. They have very different childhoods due to a lot of external factors. One of them being my own experience and maturity as a mom and person.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 70,
                      "content": "The fact that you recognize that puts you so far ahead of the game as being a good parent. You might not be able to change how things were, but being aware of them and doing better for both kids going forward is what makes the difference. My parents didn't change anything with me until I gave them a huge reality check in my 20s, and even then I think they would've blown me off if my next younger sibling hadn't backed me up and told them they were wrong for treating me the way they did. Being a good parent isn't about being perfect, I think it's about always trying to be better.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It sounds like she might have been some combination of the outsider as well as the scapegoat, combined with seeing *everything* she achieved being claimed by her brothers.\n\nIn which case, her thought process here is likely “I *finally* got something in my life that is mine and mine alone and here come the golden boys stealing it *again.*”\n\nHer statements really sound like someone who was denied a real childhood or any identity of her own that didn’t somehow revolve around her brothers, and she’s genuinely and justifiably upset at what feels like her brothers once again hijacking her life.",
              "id": 125,
              "comments": [
                {
                  "score": 3,
                  "content": "Definitely, I find what's happening with big sis completely understandable. I got lucky in my situation. VERY lucky. If her siblings are still blaming her for what happened as kids then there's really no way that they're supportive, understanding, or even a little empathetic. In a similar situation I'd probably be tempted to come up with the same stories she did just for the sake of simplicity and not having to constantly delve into that trauma when connecting with friends over upbringing and family history. Honestly, reading into it deeper it doesn't even seem like she outright lied it sounds more like she just said very little. Not talking about siblings can certainly seem like she might be an only child, the reaction from her friends sounds like she never mentioned one way or another and they made an assumption. Just saying she didn't have a good relationship with her parents because they worked a lot is way easier than going into the muck of her full experience. That would make a lot more sense as the reality of how she discussed her family when this party was hosted in her parents house. If she had said outright she was an only child I imagine there would be worse feelings than just slight confusion among her friends, because to be fair that's a pretty big lie to tell. These siblings have a lot to unpack, individually and together. And seriously, I hope so many good things for big sis. It's such a hard way to go through growing up and it makes adulthood much harder than it needs to be.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I’m the third child out of 4, my oldest sibling is 4 years older then me and the youngest is 5 years younger and I can definitely say that my parents we’re not as hands on and involved, I started noticing this especially playing sports, my parents were always the ones coaching and team managers for my older siblings but when it came to me and they didn’t have that responsibility with my older siblings sports teams they didn’t seem to care, would usually just sit in the car, caught them asleep many times. Even in schooling my parents didn’t really care about emails home if I was in trouble so I kinda didn’t care anymore about school but when it was older two siblings and even the younger they were fully involved in there schooling",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 477,
          "content": "This is relatable. My brother and male cousins were popular in high school. They were all jocks and dated cheerleaders, that stereotypical “All American” thing . They both insinuate their classmates (graduating classes) all got along and everyone was hanging out together. No one bullied, no one left out. My brother always had friends over and was always on the phone, stuff like that. I’m 100% sure they weren’t hanging out with girls they found unattractive, but “no one was left out”. lol\nI rarely had friends over and no one ever called. I was a chubby girl into heavy metal in a conservative area and received some bullying. I was talking about it once at a family thing and my cousin told me I was full of crap and lying about being bullied by these boys. Told me in front of everyone it was probably my own girl friends, because girls are like that. They used to call me Thunder Thighs and Yokozuna (a US pro wrestler/sumo wrestler), and would yell “Free Willy!” at me or ask me if I was a witch and could do spells. Guess that’s not bullying. \nTheir experience was great so therefore everyone’s was, or they’re lying. They can’t comprehend other people’s experiences. Could be similar to these kids.",
          "id": 128,
          "comments": [
            {
              "score": 144,
              "content": "Yup, and their reaction shows, not just that they supposedly didn't \\*see\\* bullying, but they are quite invested in denying that it existed in the school you both went to and the community where you were both raised. \n\nDig deeper, I would not be surprised if someone in his group was accused or even disciplined for some type of bullying, perhaps he was even in a group of people doing cruel things and dismissing that as \"not really bullying\" is important to him, since he was laughing when it happened or told the Vice Principal he saw the whole thing and what that girl said happened did not, she was lying, in fact, his friend would never do that.",
              "id": 129,
              "comments": [
                {
                  "score": 20,
                  "content": "Yes, once I got in a disagreement with my white dad because he said racism in hiring interviews didn’t exist because he had never experienced it as a candidate. I asked him how he could have since he was white? He was like….oh yeah.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 9,
                      "content": "It's sad when my response was \"Well, at least he's not saying that he's the victim of reverse racism, because white men have it worst in America\".",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Lol, today was talking to my cousin and he told me how his old classmates added him to a FB group to plan a big class of 2013 party 10 years after they left HS. He posted once that they were a bunch of hypocrites and got out of the group to receive several messages of ex classmates puzzled about his post.\n\nThe thing is that he was bullied by the entire group of male classmates who thought him being adopted was something wrong. He had a lot of problems with those kids during all HS, and now, suddenly they are all a big happy bunch looking forward to a reunion? Like no.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah I get this. I'm so sorry that happened to you💖. \nMaybe she wanted to finally be in the spotlight and not have the golden boys charm her friends and make her feel like an asshole for feeling the way she felt🤷‍♀️",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "If she felt that way about the entire family, why would she have the engagement at her parents house, when she knew there would be family photos everywhere. Something seems  wrong.",
          "id": 134,
          "comments": [
            {
              "score": 212,
              "content": "I was thinking the same thing. Even if the brothers kept to themselves, there were still familly photos of them. \n\nIt says the brothers weren't officially invited, and hadn't planned on attending in the first place. That they only went because it was at their parents house. \n\nI think the sister wanted her parents to feel proud of her, or to be able to give her the attention she probably felt she missed out on growing up. \n\nThe family really needs to just sit down and talk things though/out. \n\nSomething is really off here.",
              "id": 135,
              "comments": [
                {
                  "score": 215,
                  "content": "> I think the sister wanted her parents to feel proud of her, or to be able to give her the attention she probably felt she missed out on growing up. \n\nYeah, bingo, probably.  She wanted her parents to be part of her engagement party.  She didn't want her brothers there, but couldn't explicitly uninvite them since they live there, so she scheduled the party when they were supposed to be out of state.  (Probably the only way to avoid drama, regardless of *where* the party was, anyway.)\n\nI just think it's interesting how they'd apparently all been on the other side of the country for months, but then \"plans shifted\" (note passive voice) and suddenly they could be home for the party after all.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 182,
              "content": "The boys weren't expected to be there. And it sounds like she wasn't given a heads-up that their plans changed until they showed up.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "I have two siblings, I am estranged from them, haven’t spoken to either of them in almost 20 years (Im 36 and went no contact with them when I turned 18). I don’t hide that I have siblings from people, but they’re not a part of my life and so I very rarely mention them as I’m getting to know people. Occasionally, conversations will come up where I do mention them because it’s related to whatever is being talked about and people get surprised, “I didn’t know you had siblings!!”\n\nThe sister in this case isn’t as separated (it seems at least) from her siblings as I am mine, but if her brothers don’t play an active role in her life, she likely didn’t have any reason to bring them up in conversations with people she befriended.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "because even if your parents suck ass it doesn't change the fact that part of you hopes they one day change. and sometimes your relationship changes drastically in adulthood. it's not uncommon for children of shitty parents to still have their parents in their life",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "I often have to remind my older siblings “we had the same parents. We did NOT have the same childhood.”\n\nSis may have been excluded by her parents and shunted aside once coveted sons arrived.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "This was exactly what I was going to say. \n\nMy brother and I are close in age but due to where we were at in life when our parents divorced, (he was in college, I was in high school) we have to very different life experiences. Not to mention, my brother was a child actor. In order to do what he did, I had to be carted around by our mom but was not allowed to participate. So my brother has great memories of our childhood, parents happily married, getting every opportunity to participate in his passion and I have horrible memories of our childhood, our parents fighting, not being allowed to do hobbies I was interested in because my mom had to chaperone my brother while I sat and watched him. \n\nNot saying anyone is the asshole here but maybe when it’s your sisters party, you play along with her game and let the spotlight be on her if it’s something rather insignificant like whether or not your parents were or were not workaholics. She’s allowed to have her own opinion of her childhood and share that with her friends.\n\nEdit - typo",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yes, you can’t underestimate how different childrens’ experiences can be in the same household.\n\nI’m the fifth of six kids. The oldest four are all close in age, then there’s a 7 year gap before me and my brother. My older siblings had a lot of hardships that my younger brother and I had to a much lesser extent, so they often refer to us as being the spoiled younger siblings. I let them talk like that but I also know we were far from spoiled. \n\nOne of my older brothers is completely estranged from all family and anyone he knew before he joined the military. His individual experience absolutely was the designated black sheep and he experienced abuse and neglect that nobody else experienced, and then all of us kids disliked him because our parent did and taught us to. Truth is, he never had a chance and nobody else in the family seems to be able to fully acknowledge what I can see happened.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I'd say YTA. The title \"by uncovering her lies\" makes it seem like OP figured she was intentionally lying for attention. It's a bit of an AH move to tell a bunch of strangers that you think your sister is a liar. Even if she is a liar, it's her engagement party, it's not the time or the place to out her to her friends. The brothers could have pulled her aside and spoken to her but no, they chose to tell the crowd of strangers how great *their* childhood was and that if she had a bad time, it was *her* fault.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Everything you said was correct, but this is YTA. Sister did not \"lie\" about her childhood.\n\nLying would be saying she has no brothers, or that she was a sports star when she wasn't, or that she got into Harvard when she didn't. Her interpretation of her childhood was different than OP's. OP cannot even point to a specific instance of a lie, other than he thinks they were more hands on than sister believes.\n\nOP decided, on his own, to embarass his sister and tell everyone she was exaggerating and lying about her childhood. OP knew what he was doing. OP knew his sister was excluded during HS, for whatever reason, and intentionally decided to make her look bad to her friends.\n\nWhy did OP do this? OP wanted attention AT SISTER'S ENGAGEMENT PARTY. Oh look, I can lecture to a crowd about how much of a lying weirdo my sister is, and make her friends like me more than her!\n\nI hope sister is able to cut the cord from OP and her AH family. I'm sure this isn't the first time they've done this and probably won't be the last.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6111,
      "content": "YTA\n\nSomething seems off if the oldest and only female child had a distinctly different memory of her childhood.\n\nFurther, after seeing that you were becoming a spectacle, you didn't back off and return the focus to her... you made it a party to get to know you, and for you to make friends. While it sounds like you didn't care about even talking with your sister. \n\nSounds like she was less-favoured due to your natural desire to make the spotlight about you, and you thinking your view of things is the right one.",
      "id": 145,
      "comments": [
        {
          "score": 2999,
          "content": "This story seems off. Your points were what jumped out at me, too. \n\nIt sounds like now that he knows she is upset, he's embellishing whatever will make him seem like just the friendly guy entertaining a group.\n\nAt a party isn't the time to get into why HER guests think she is an only child and it definitely sounds like there's much more happening.\n\nOP, you're the asshole because this wasn't your event and even after you noticed some discrepancies that should be addressed, you decided to keep your crowd. You could have pulled her aside and asked or, better yet for an adult at an adult event, waited until everyone else was gone.\n\nEspecially her mentioning the \"golden child\" syndrome means there's a lot we don't know.\n\nUnreliable narrator. YTA.",
          "id": 146,
          "comments": [
            {
              "score": 771,
              "content": ">Unreliable narrator\n\nExactly! I wouldn't be surprised if the boys got different parents then the oldest daughter\n\nI remember wanting to go to the Social in middle school and i was not allowed too but my brother was when he reached that age\n\n small things like that build up",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 251,
              "content": "[deleted]",
              "id": 148,
              "comments": [
                {
                  "score": 32,
                  "content": "This was the big 'ol red flag for me too",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 427,
          "content": "We don't have enough info to know, but this scenario flts best with the post. Spoilt youngest child vibes are strong in the post",
          "id": 150,
          "comments": [
            {
              "score": 4,
              "content": "Lol the OP’s comments speak volumes",
              "id": 151,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": "I agree with this 100%. Definitely YTA, especially after seeing OP’s responses.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 236,
          "content": "This, 1000x this. She is the only daughter, and several years older than OP. And even though I KNOW my parents love me and my sister and my brother equally and always TRIED to be fair, my brother got favored in many ways. It definitely sounds like OP intentionally set out to ruin her party when he got personally offended she doesn't talk about him more. So from where I'm sitting, 100% YTA. I would LOVE to hear sister's perspective.",
          "id": 153,
          "comments": [
            {
              "score": 41,
              "content": "I have two older sisters and as the single son, I can definitely say we have different version of parenting. My parents were far stricter and suffocating to my sisters while I was free to roam, provided I slept at my bed eventually. Meanwhile my sisters had strict curfews until they were 18. My parents were flabbergasted that they both left home the moment they could.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "Not even that OP didn't care not to talk to the sister, but didn't care not to make her the brunt of some joke or \"gotcha\". I would be humiliated.",
          "id": 155,
          "comments": [
            {
              "score": 14,
              "content": "That’s what gets me. I have 5 siblings, the oldest is 15 years older than me, the baby. And I would NEVER try to do what this guy did. Any story my siblings give out to strangers, I may not exactly back it up, but I’m definitely not going to make it appear they’re lying. I’d at least find out why they’re telling the story they’re telling. \n\nHe seems way too delighted to have made her look bad.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "I think I’ve been on Reddit way too long, because I’ve read quite a few stories of people outright lying about the quality of their childhood, usually suggesting there was a tragedy or abuse that never happened.\n\nOP is pushing back against “lies” that are pretty small all things considered. If his sister was trying to get sympathy, she could have stuck far closer to the likely truth of “my brothers had a fantastic childhood, they were popular and my parents attended all their sports games. I was never given the same amount of attention, and was mostly on the sidelines because I wasn’t athletic and my interests were naturally seen as less important. My parents did attend some of my awards ceremonies, but only if they didn’t clash with my brother’s sport events, and often one would attend while the other supported my brothers. My house was always full of other friends, but those friends were rarely mine. My childhood was quiet and quite lonely and I’ve never been able to explain this to my brothers, because to them childhood was perfect.”\n\nIt seems to me that she’s actually downplaying her childhood difficulties. “My parents were workaholics” raises far fewer questions than “I was the odd one out”. Not mentioning her brothers means she doesn’t have to talk about how alien she felt. To me, it’s an embellishment that hides a far sadder truth.\n\nI know some will see this as a bit of a reach, but OP’s not given any indication that his sister has a habit of lying or manipulating. What he has clearly shown is that he’ll always see his view of events as the “truth” and will apply this view to others around him without thinking twice.\n\nOP, it would have been so straightforward for you to say something like “our parents both did indeed work and I was at sports games a lot during childhood; my sister and I weren’t that close. I can’t speak for her experience, as I wasn’t around her much and often had friends over when I was home. I love my sister and am so thrilled for her engagement and to get to meet all her friends”. That’s it. That’s all you had to say. Exposing her as a “liar” before even speaking with her didn’t serve anyone other than yourself.\n\nInstead, you took this as an opportunity to “make friends” by “exposing” your sister as a liar and holding court at HER ENGAGEMENT PARTY while her friends avidly listens to tales of YOUR fantastic childhood (important: not hers).\n\nYou didn’t just “embarrass” your sister, you directly threatened the ecosystem she’s built for herself since leaving home. I’d be skeptical of a friend who felt the need to lie like you told them your sister did. I’d likely look to distance myself from that person. You have no clue about the potential damage you’ve caused, at an event that was supposed to be a celebration of your sister’s milestone. Somehow, you managed to make yourself centre of attention on a day dedicated to her, which gives me a good idea of how her childhood likely played out. \n\nYou’ve said yourself that your sister often wasn’t the one with friends over, it doesn’t sound like she’s ever made friends as easily as you do. You were in a room full of people who wanted to celebrate her engagement, and jumped at the opportunity to discredit your own sister, who has likely spent her life in the shadow of your narrative.\n\nI know you’re pushing back against all the negative comments, and I’m late to the party so you’re unlikely to read this. But, for the sake of your sister, please reflect on your behaviour here. Please ask yourself whether your sister was actually “lying” or whether she was leaning on a white lie to hide a much more painful truth. Take a second to imagine a childhood in which you had 3, close, academically gifted sisters who’s weekly commitments to debate club, after school classes etc were always celebrated and attended by your parents. They tried their best to attend your sports commitments, but only if they didn’t clash with one of your sister’s events. If the roles were reversed, I imagine you’d have told a similar story to your friends as an adult. Sometimes a lie is used as a shield, rather than as an act of malice. \n\nYTA OP, based on the information you’ve provided, it doesn’t sound like you’ve matured much since highshool. Every sibling in a family has a different childhood, and not only did you invalidate your sister’s experience, you actively worked to discredit her to her entire support network. You used her event as an opportunity to make “friends” and take centre stage. If you were my brother, I don’t think I’d ever speak to you again.",
          "id": 157,
          "comments": [
            {
              "score": 14,
              "content": "This!! I saw some comments defending the brother because the sister “lied about having siblings.” And while that could have been the case, I have a feeling it has more to do with her not wanting to talk about something that makes her uncomfortable. \n\nShe doesn’t owe it to anyone to say she has siblings or that their parents treated them differently. Perhaps not mentioning them at all meant she didn’t have to relive something that may be some sort of childhood trauma. She didn’t lie, she just didn’t see the need in bringing them up.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "I feel bad for the sister; they've gone, and stolen her friends.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Yeah it sounds to me like her spotlight was stolen when that was HER party, even if OP wasn’t trying to be rude. I also have a hunch that her childhood experience was completely different that OPs, she may have grown up neglected and overlooked while OP had plenty of attention. So I’m sure seeing OP once again with all the attention at the party last night felt really invalidating.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yeah, there's a weird vibe in OP's post, I agree with your thoughts on it. YTA OP.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2515,
      "content": "NAH I think in all likelihood neither of you had malicious intent and you are both simply telling the story of growing up from your own, extremely different, perspectives.\n\nBut you should consider that you don’t actually know your sisters side of the story. You assume it’s all a huge lie because it doesn’t match your experience, but you already acknowledged that she had a completely different experience. You blame her for it, but you do know that her experience of growing up in that house was different than yours. \n\nIn your eyes she self-isolated. Maybe from her side she felt like she couldn’t really be a part of it or wasn’t wanted. Her side could be that her mental health was declining badly and her parents were too busy with her little brothers to notice or care. \n\nThe brain will spin a narrative to justify what you are feeling based on your own experiences. That’s just naturally what it does. But be cautious to remember the story you tell yourself isn’t reality. And the same is true of the story your sister tells herself.",
      "id": 162,
      "comments": [
        {
          "score": 910,
          "content": "I wonder if she felt isolated because once the boys came along, it became all boy focused?",
          "id": 163,
          "comments": [
            {
              "score": 477,
              "content": "Yeah, might be. I was also an older sister, and once my younger brothers were old enough to do \"guy stuff\" (boy scouts, fishing,  team sports, etc), my dad pretty much stopped giving me attention. It definitely stung.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 369,
              "content": "Having lived with a similar dynamic growing up, I can almost guarantee that this was it.\n\nSister probably wasn’t allowed to have *any* achievements or identity that didn’t somehow revolve around her brothers or that they weren’t handed all the credit for.\n\nShe finally has *something,* her engagement, and her brothers show up and make it all about them *again.*",
              "id": 165,
              "comments": [
                {
                  "score": 83,
                  "content": "✨️yes✨️",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "It wouldn't be surprising if any family outing or holiday was centered around entertaining the boys, and they were activities she just wasn't into.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Also, it sounds like there was a singleton and then twins a year later. Those parents had 3 babies at once, and the daughter likely got sent off to school and somewhat ignored while they dealt with the daily craziness of the others.",
              "id": 168,
              "comments": [
                {
                  "score": 10,
                  "content": "Yes - there’s a possibility it’s also a sexism thing, but I think at the very least it was a case of the eldest being left to fend for herself while all of the attention was focussed on the younger three. She may well have wanted to do activities but was told no because it would be too hard to juggle with her brothers when they were very young.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Three babies in two years would have caused the oldest sister to be ignored. The parents would have had their hand so full with the babies and they would have expected her to deal with it.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 113,
          "content": "Yup.  \nMy brother and I are only 18mo apart, but we're practically strangers and had absolutely different childhoods. My parents were more involved with him, and he was very involved in social things like sports. My brother was the typical popular jock, but is a genuinely kind and likeable person. He had struggles inside our family, but he definitely had a more normative childhood.  \nOn the other hand, for me, my relationship with our parents was entirely different. I had mental health issues and am neurodivergent. My dad was abusive towards me and my mom didn't do enough to stop him. I was in a severely abusive friendship in my younger years, and both self isolated and was isolated from my family. Even when there were clear signs things were wrong, no one helped me. I fell into a toxic relationship with a survivor of the same abuser. My parents did not care if I didn't come home during that time. I stressed them out too much, and it was easier if I just disappeared to my partner's house for a few days. I was 16 when they made this clear.  \nMy brother doesn't have a great relationship with our parents because of the way he was hurt by them. I worked hard to get to a point of mutual understanding with them.  \nWhenever I move out of state, though, I'm not talking about my family. My friends will not know them and as far as they will be concerned, I just spawned out of the ether one day.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "I agree with your last 3 paragraphs and that's why I think OP is TA.\n\nIt is an asshole move to present your own version as truth in a way that questions the character of the sister. OP could have said \"that's not how I felt about it but we are 4 years apart and her experience was different\" in response to their parents being workaholics. He could have said \"oh well we live in the other end of the country and we don't talk that often\" in response to the friends being surprised at her having siblings.\n\nBut instead OP went out of his way to make her seem strange. \n\nMoreover, they weren't even invited (obviously for a reason) so if they had to be at the house it would have made sense for them to remain low profile, certainly not steal the show in a way that might damage their sister's reputation.That was a real asshole move.\n\nI suspect what OP did might have to do with OP wanting to defend his parents. In his eyes the parents were great and therefore he wants to make sure no one thinks differently, at the cost of his sister. \n\nStill, failing to recognize others different experiences and invalidating them the way OP did is a key sign of an asshole. I'm sure OP was boldened by them being 3 siblings sharing the same view with the sister being the odd 1 out.",
          "id": 172,
          "comments": [
            {
              "score": 11,
              "content": "I definitely don’t disagree with any of that. \n\nPersonally, I am trying to extend OP the same grace I’m extending to his sister. That’s just the way I chose to approach this one, not saying that OP is entitled to grace. \n\nBut I don’t disagree, if someone is in the wrong here, it is OP. I will also say this post was very new when I commented so OP hadn’t replied to anyone yet. Now having read their responses I’m more inclined to consider OP TA.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "3 years is just old enough to be parentified a bit. Sounds like at around 4-5 years old her parents had 3 under 2.\n\nIt's a prime age to really feel the neglect of that and to be expected to help out more and more.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2132,
      "content": "INFO: we need more info as to why your sister felt this way. Not sure we're gonna get it from you, obviously.",
      "id": 175,
      "comments": [
        {
          "score": 956,
          "content": "There's definitely more to the story here, and I think that OP is more of TA than they're letting on.",
          "id": 176,
          "comments": [
            {
              "score": 827,
              "content": "My guess is OP does not realize how much of a golden child he is and how isolated his sister felt growing up.",
              "id": 177,
              "comments": [
                {
                  "score": 1102,
                  "content": "[deleted]",
                  "id": 178,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Yeah. Wasn’t invited, but stayed anyway and had people gathering around to hear stories that made his sister feel like sh!t.\n\nOP, YTAH, and you owe your sister an apology and a lot of uninterrupted, empathetic listening.",
                      "id": 179,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "This guy's lack of self-awareness is ASTOUNDING. I mean, he was already an AH from the get-go for hijacking his sister's party and making it all about him and his brothers, but he himself describes in detail how radically different his sister's upbringing was than his and his brothers', and he STILL doesn't get it.",
                      "id": 180,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Looks like he is a twin and the oldest brother close enough to be treated like triplets. I was the only girl with 4 brothers until my twin sisters were born when I was 7. It truly changed family dynamics but there were no golden children, just more mouths to feed. \nOur mother died when I was sixteen and I basically became the family caregiver. My now 60 year old sisters have decided they’re jealous because I knew our mom longer and have more deeply rooted memories.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's really hard to say from his story.  And I have to wonder if she had a life like mine.  My brother was in band and sports  and my grandparents paid for college and bought him a brand new car.  He was even a dumbass who got probation for stealing and got all kinds of tickets.  I graduated at the top of my class but they never let me join the stuff I wanted and made a huge fuss when I did join one club for part of a year because it inconvenienced them so much.  I didn't get a dime for school, got a car older than me, got to babysit my mom so she wouldn't shoplift or get high, family stole tons of money from me, I got to break up physical altercations with my parents and fam.  But oh boy is my brother jealous of me for being the favorite and also gets mad that I won't be part of family events and keep distance between myself and everyone.  We had two very different experiences both because of our ages and the fact that as a female I was expected to emotionally support my mentally ill family.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 494,
              "content": "OP is gloating about the great time he had and how he made so many new friends when it was meant to be his sister's party and moment to shine. Based on how eager OP was to gather people round in order to gleefully call her a liar (which I'm not sure she is) in order to destroy her life, I'm guessing there's a lot he's not adding here. He seems almost amused at how upset she was after his work was done.",
              "id": 183,
              "comments": [
                {
                  "score": 166,
                  "content": "I agree. He sounds awful.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 89,
                  "content": "I agree, it was her party and he did he just took it over and doesn't even seem sorry he ruined her party.",
                  "id": 185,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 88,
                  "content": "Yeah, I’m really questioning how much of a “liar” she is, given the only lie explicitly mentioned by OP is one of omission: she didn’t mention her siblings. \n\nWhich would be very understandable, if her whole childhood identity basically revolved around them at her own expense. She would’ve grown up wanting to be considered entirely *on her own merit,* and then her brothers showed up and ruined it *again.*",
                  "id": 186,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 70,
                  "content": "Agree.  Sounds like they are trying to take over her friendship group at her engagement party.  This is awful and weird.\n\nSomething is wrong in the family and OP is either unaware of this or pretending to be unaware.",
                  "id": 187,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Seems like sister probably did tell some lies (e.g., parents being workaholics) to ... \"buffer\" the unhappiness of being neglected.  I wouldn't fault her too much for this, given she's already taken enough hits lately.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 13,
                      "content": "This. Like, if she loves her brothers and is aware that as young children they had no control over how badly their parents were ignoring her for them, a lie like that may have been to avoid….well, to avoid the OP and his brothers getting the kind of heat the OP is getting in this comment section.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 68,
              "content": "Missing missing reasons",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 201,
          "content": "Parents wanted boys. Ops sister felt like a practice child.",
          "id": 191,
          "comments": [
            {
              "score": 40,
              "content": "Exactly how I read it. 💯",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "She’s the only girl in a family full of younger boys. It’s entirely possible their parents DID treat them better and WERE more hands on and the sister never got any of this extra involved parenting he’s describing. Like he keeps saying she “separated herself” from their activities… but think about it. What 10 year old girls wants to do what three 6 year old boys are doing? Did they ever have to “separate themselves” from 10 year old girl centered activities? Or was she expected to just let things go and make way for her brothers?",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1473,
      "content": "INFO:  Does \"my brothers and I\" mean that there are 3 brothers?  Your sister is the only girl?  She may have had a very, very different experience growing up than you all did.  You say that your parents drove you around to sport events and such.  That your house was THE house and filled with friends.  All your friends?  All the guys in sports?  Was your sister left out of everything?  Was she not into sports so she was \"isolating herself\"?\n\nI think some soul searching needs to be done on YOUR part before you start pointing your fingers at your sister.",
      "id": 194,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1280,
      "content": "I don’t think we have enough info. I would reallllly like to hear your sister’s side of this story, because I suspect she’s got some bonafide reasons for calling you guys the “golden children”.",
      "id": 195,
      "comments": [
        {
          "score": 252,
          "content": "Op clarifies that she is the only girl.",
          "id": 196,
          "comments": [
            {
              "score": 172,
              "content": "In some families, that would have made her the \"princess\" with a team of brothers to support her.   That clearly wasn't the case here.",
              "id": 197,
              "comments": [
                {
                  "score": 214,
                  "content": "What I've seen with my step kids, 5 (only 3 are my partner's kids, so technically 3 step kids), 1 girl (oldest) 4 boys, she's always the babysitter and gets blamed when anyone does anything wrong because they were her \"responsibility\". I hate that hey live on the other side of the country.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 88,
                      "content": "I only had one male sibling, but that was my experience exactly. I was somehow simultaneously responsible for everything he did wrong, while having zero authority to enforce any rules, and anything I did or achieved or wanted was given to *him.*\n\nI quit so many hobbies and extracurriculars because they inevitably became all about him, and I was not allowed to achieve anything on my own merit.",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 128,
                  "content": "Often, if the oldest is a daughter, she gets forced to be an extra parent. So like, treated like the opposite of a princess.\n\nEdit: Not saying that’s what happened here, but of the “only daughter” tropes, there’s the Princess (usually younger), and there’s the parentified oldest daughter. And in my personal experience, I’ve witnessed the parentified oldest daughter one way more often. \n\nThere are also whole families where the daughters are ignored almost completely, in favor of the sons.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 52,
                      "content": "It really sounds like a case of the latter here.   He claims she \"self-isolated\", meaning he doesn't have a clue about what she was doing or wanted.   Parents were all into the boys and never made any attempt to have them reciprocate.    The fact that he's so proud of having taken center stage at her engagement party says it all to me.  u/wyal_ is 21-year old AH.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "IN general due to there being so many men and women with misogynistic, traditional gender role type views it's much more common for the girls than boys to end up the parentified sibling, or the one they don't put much effort into because they are just for marrying and having kids while the boys have all the effort put into them because they have to provide.\n\nPeople suck.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "That is relatively rare, and it’s far more common for the only girl to be treated as a “secondary mother” whose entire identity revolves around being the golden boy’s sister. \n\nSee also “parentification” and “eldest daughter syndrome.” It doesn’t matter what order the children were actually born in; if she’s the only girl, she’s automatically the “eldest *daughter*,” which more often than not means she’s expected to take on a huge portion of domestic labor while her brothers got to be normal children free of any such worries.\n\nHer mention of OP being “the golden child” and the fact that her only real “lie” was *not mentioning her siblings* really sounds like someone who grew up not having anything at all to themselves and wanted to finally be considered on their own unique merits, not in relation to being “OP’s weird sister.”\n\nAnd then OP came along and made it all about him *again.*\n\nMaybe a bit of projection, but I experienced that growing up. I’m significantly more successful than my brother now, but as far as my parents are concerned, his “achievements” are always, always more important. Doesn’t matter if he actually achieved anything, and he usually didn’t (this is the guy who faked a disability to weasel out of the Army just after basic and still gets paraded around as a “veteran”), literally anything I manage to achieve, any good I do for my family, is always credited to *him.*\n\nAny hobby I wanted was off-limits until *he* decided he wanted in.\n\nI was forbidden extracurriculars, video games, you name it…but then the rules changed when *he* wanted something.\n\nHe got anything and everything he ever asked for, but if I needed school supplies or new clothes or a ride to the library so I could do homework in piece, I was suddenly “nickel and diming” my parents or it was “too far out of their way.”\n\nI was literally cleaning up his piss from around the base of the goddamn toilet *the day I moved out,* but he insists that *he* is the one always cleaning up after *me.*\n\nI have been no-contact with him since 2010, no-contact with bio-dad since 2017 (technically his idea, but I’m not arguing), and no-contact with my mother since March 2023.\n\nI don’t tell new friends or acquaintances about them because *they don’t need to know.*\n\nIf I got engaged and my brother randomly showed up and started loudly calling me a liar and hijacking that engagement party to make it all about him, I’d be furious. Hell, I’d be calling the cops the second he showed up!",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "In other families, she’d be relegated to sister-mom and expected to clean, help with homework, free babysitter, and have that casserole hot and the table made because we’ll be back from soccer practice at 7 and your brothers will have an appetite!",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "In some families that means they have a maid and 3 children. Especially as the oldest.",
                  "id": 205,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "You're right.  I think a princess is usually younger, though,  not older",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "You know in real life only once I’ve come across an only girl being treated like a princess and spoilt. \n\nEveryone else where treated horribly.",
                  "id": 207,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "In conservative families, having a dick is the only thing that guarantees respect and love from your parents.",
              "id": 208,
              "comments": [
                {
                  "score": 13,
                  "content": "Yes and everything must cater to the dick haver.",
                  "id": 209,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 44,
          "content": "My thought exactly,  she could be one to constantly need to be a victim,  but she also could've had a very different experience than her brothers based on several factors that we don't know.  Plus,  her \"whoa is me\" story was about workaholic parents ? That's like hardly anything, yet the friends were surprised to see family bonds? I'm sure there's alot more to the story.",
          "id": 210,
          "comments": [
            {
              "score": 76,
              "content": "There's definitely a lot more. My bet is the sister remembers being passed around from aunt to uncle to babysitter while the parents worked and then grew up to see her parents doing everything for the boys, they never tried to do for her",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 766,
      "content": "I bet her side of this is waaaay different….",
      "id": 212,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 697,
      "content": "Golden Child is always Lack of self awareness.",
      "id": 213,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 649,
      "content": "INFO - Is it possible that your sister experienced growing up, and your household in general, in a radically different way than you did?",
      "id": 214,
      "comments": [],
      "relation": "No"
    }
  ]
}