{
  "post content": "I (20f) am thinking about not going to my sister's (23f) wedding.\n\nHere's the reason: She is an egoistic, self-centered narcissist and has made my life worse for as long as I can remember. She's been bad to many other people as well (including my whole family) but it has always seemed to me that she's had it out for me specifically. I don't know why she's behaving like this towards me, I can only speculate that it might be jealousy because I've been the academically successful one.  \nI've always tried co-existing with her, only interacting when necessary, but it didn't go too well.  \nI'll give you a few examples;  \n\n\n* when we still lived with our parents, I refused to let her use my printer because she yelled and insulted me an hour prior and when I did so, she lost it and threw a hot-water bottle at me.  \n\n* She called me and my whole family the c-word over a Wifi router.  \n\n* She called my mom the c-word and told her to shut the f up (which is just not normal in our family, not even saying \"shut your mouth\" is), after she refused to babysit her 2 bulldogs for over a week because 1) it stressed out our own dog and 2) she has to work and take care of my little sister and the household as well. Mind you, she had babysitted the dogs before for a day or two, but over a week because my sister wants to go on vacation with her boyfriend and the responsibility to care for  her dogs is in the way now, is too much.\n* And the most recent incident; (context: she did an apprenticeship as a mechanic) She heard something I said which could indicate that I was planning on being drunk and stuff (actually I was talking about PokémonGo lmao, I rarely drink) and instead of asking me then and there, she went to my mom a week later and asked her if I have a problem with drinking. My mom, who is VERY sensible in regards to drinking because of a traumatic experience, called me and asked me about it. I said no and asked where my sister got that from and she said she didnt know, so I texted her about it and she immediately called me disrespectful, again insulted my personality and everything about me, pulled the\"you're uninvited to my wedding\" card (they got engaged a week prior) and lastly told me I should be careful that nothing is going to happen to me in my car (implying harming me indirectly by sabotaging my car), after which she blocked me. \n\nThen, she gave my mom an invitation for me and my bf (still blocked me though). I've had enough and I want to make a clear cut and not have her in my life anymore. I feel as if it'll never stop if I don't cut her out now and it will always go back and forth with this. She never apologizes, not to me, not to my mom or anyone else, she just pretends everything is back to normal and I dont want that to happen. \n\nEveryone is telling me they understand but I should go to keep the family peace.   \nI am not sure what to do. Would I be the a-hole?\n\n  \nThank you for the advice in advance! ",
  "id": 1,
  "comments": [
    {
      "score": 4330,
      "content": "NTA. Based on your post I can't think of a single reason why you should attend. \n\nHowever I guarantee a variation of the \" but she's your sister\" card will be played. This is a manipulation used when another family member who knows the other person is in the wrong and is unable to justify their actions.",
      "id": 2,
      "comments": [
        {
          "score": 2101,
          "content": "Exactly, so far it's mostly been \"you should attend out of decency\" and \"to keep the family peace\" but why? She hasn't been the slightest bit decent to me, why should I?   \n\n\nBut the comments made me doubt myself so I decided to get some third-party feedback.  \nThank you!",
          "id": 3,
          "comments": [
            {
              "score": 885,
              "content": "If your sister wants family peace, she can talk to you and invite you",
              "id": 4,
              "comments": [
                {
                  "score": 266,
                  "content": "Exactly this! Argh I really feel for OP, I was OP! Everyone asked me to attend and tried those bs manipulation tactics, I just said \"well if he apologises to me, then I'll go\". Well guess what that never happened, I didn't go, surprise surprise! And I will forever hold my grudge, thank you very much. Just because we're family... we're not really tho!!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 196,
                      "content": "Family is not a ticket to treat people like crap without consequences\n\nNTA, OP you are 100% justified not going unless you get a direct invite, and apology, AND you are satisfied with this. You will definitely get pressure from other family members but you have to take care of you first",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "My mom tried to guilt trip me into being around my brother. I told her it’s been 20 years of his abuse how many more am I supposed to put up with when he only gets worse.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Family peace is overrated.  Surround yourself with and give your time to people who deserve it. Full stop.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It’s never peaceful when you’re being abused.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "if someone is asking you to keep the peace...the peace has already left the building.\n\nmy response to that, which admittedly was only after I snapped at one more incident with the friend group, was \"sorry, I don't have enough space for it, maybe \"Destroyer of Peace\" can make room?\"\n\nit worked, but I was close to graduating so my perceived risk was low, and my irritation with the ongoing 'one more chance' 'just how she is' was high...",
                  "id": 10,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "And apologize.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": ">If your sister wants family peace, she can talk to you and invite you\n\nHonestly if OP's sister wants family peace she should remove herself from the family because it sounds like she's the one constantly attacking everyone else.",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Honestly, this is likely her way of keeping the family off her back- she can't outright not invite OP or the family will throw a shit fit so she's extending an invitation she knows OP won't take. \n\nThe invite is for show- she doesn't actually want OP to attend and her behavior if OP does will reflect this,",
                  "id": 13,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It also has the added benifit of making OP look bad when she- sensibly- refuses.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yup. The person who breaks the peace is the only one who can mend it.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "There IS no family peace.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 244,
              "content": "I'm going to share my favorite analogy/wisdom for situations like these:\n\nPeople tend to say \"you only get one [family member].\" Yeah, well, you only get one appendix, too, and when it turns toxic, you remove it without a second thought.",
              "id": 17,
              "comments": [
                {
                  "score": 28,
                  "content": "lol I'm using this one!  Great analogy!\n\nI actually knew someone whose appendix burst; he missed most of his senior year of high school.  Still managed to graduate near the top of the class because he was a brilliant student and had his friends bring him his work in the hospital.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I like that and I am stealing it!",
                  "id": 19,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Steal away! I believe I first saw it on reddit some time ago, so by all means, keep the thievery tradition going!",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I love this!  I will use it!  I have another saying I love when I am with people who true care about me and who I truly care for: \n\n\"You have two families in this world, one you are born into and one you make for yourself.  Thank you for being part of the family I have made for myself!\"\n\nOP, it's time to make your own family - regardless of shared-blood!\n\nNTA",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This is gold.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Damn, that's beautiful!",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": ">you only get one \\[family member\\]\n\nThank goodness?",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I LOVE THIS.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "You can choose a new family. (Friends)",
                  "id": 26,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Edit:NTAH \nI wish we had Reddit 39 years ago. I would have been so much more emotionally healthy than I am now.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 192,
              "content": "Is there a need to publicize that you won’t be going beforehand?  Just let everyone assume and then don’t go.",
              "id": 28,
              "comments": [
                {
                  "score": 77,
                  "content": "This. Let her spend god knows how much per head (x2) on yours and your bf's dinner and associated costs, and then just don't show up, and enjoy your weekend doing something you'll actually enjoy with people you actually care about",
                  "id": 29,
                  "comments": [
                    {
                      "score": 3,
                      "content": "If you RSVP right away, people will give you a hard time for months. Do it at the last minute. Give her a check for the amount of money she lost on the dinners you didn’t eat. Write on it ”money for 2 wedding dinner. Edit: I didn’t see that you were uninvited. She didn’t re- invite you, as far as you know. No need to send RSVP.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "I mean, proper etiquette would be to at least RSVP \"Not attending\"\n\nIf her sister wants to broadcast that, then thats a her problem, not an OP problem.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Not RSVPing no when you aren’t going to an event always makes someone TA. In this specific case, that’s what being the bigger person would mean — politely saying you can’t be there. (Not won’t, can’t. There’s no room for arguing )",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "But sister blocked her and gave the parents the invitation. How do you rsvp no when you have no rsvp card and no way to contact the bride? Judging by the story mom might not even tell the bride to avoid another fit",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "By not going you are keeping the peace.\n\nThr alternative is you going. You grabbing the mic during thr speeches and making your own.\n\nNta.",
              "id": 35,
              "comments": [
                {
                  "score": 29,
                  "content": "OP doesn't even need to prepare a speech. She can read out her sister's text messages to her, and also reiterate out things sister has said to her.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Nah, don’t pull that shit. It’s still sister’s wedding.\n\nEdit to be clear: I think OP should just not go.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I’d be tempted to go and accidentally knock over the cake.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "My grandma used this line on me all the time growing up when my sister and I weren’t getting along. But then, she left her home country at the age of 16 in the middle of WWII and never saw her family in person ever again, so she had a bit of a different perspective. \n\n\nMy mom usually encouraged me to stand up to my sister, except for once when she tried the “but she’s your sister” line. My response was “I don’t care if she’s God, no one has the right to speak to *anyone* the way she’s spoken to me. I wouldn’t tolerate being spoken to like that by a stranger, and I’m sure as shit not going to tolerate it from family.” \n\n\nMy sister and I get along better now that we don’t have to live with each other, but you’re NTA if you don’t want to go to the wedding because you don’t think there’s any relationship that can be salvaged. But just be aware that it may cause a permanent rift between not only you and your sister, but other family members as well (like your mom). I would hope that she would understand, but she might take your sister’s side, so just be aware of that.",
              "id": 39,
              "comments": [
                {
                  "score": 26,
                  "content": "She could always tell those who side with her sister, to tolerate her \"out of decency\" . LOL.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Doesn't sound like there will be peace whether you attend or not. \n\nBut I would make it clear to her that you are not attending and why. Then, it is on her to apologize or not. NTA.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "She breaks the family peace constantly and faces 0 consequences. \nDo not attend her wedding, block her and kick her out of your life.",
              "id": 42,
              "comments": [
                {
                  "score": 3,
                  "content": "Absolutely the right answer. Evil people are to be avoided.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "People like her tend to get away with stuff because family members are too scared or tired to confront them. Instead, they make it the innocent party's responsibility to keep the peace.  It's BS.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "You arent the one who isnt keeping the peace. Your sister is",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "If she is really this horrible to you and your mom, low key threatens you and expects you all to do anything she asks of you (like dog sit for a week) and is too entitled to let you say no…. I don’t see what peace there is to keep. This person didn’t even invite you or unblock you, correct? She is too immature to mend the bridge and she is the one getting married. She is older, and she is the one at fault. \nTry to keep an even tone to your voice, be reasonable, stick to the facts and come up with a line, like “I will not be attending the wedding or participating in the wedding of someone who threatens me, doesn’t speak to me anymore, who hurts me repeatedly without apologizing and has no interest in maintaining a peaceful and respectful relationship with me.” \n\nIf they use that keeping the peace line make sure that you mention that is a two way street and the responsibility is not on you, but on the one who broke the bridge and actively sucks the peace out of the room. I see that your desire for peace and safety is exactly why you want to stay away from her.",
              "id": 46,
              "comments": [
                {
                  "score": 2,
                  "content": "When people oiut pressure on OP, instead of explaining I would draw firm boundaries and say, \"This is between me and my sister\", full stop.  Explaining yourself means they get a say, they don't. And the explanation doesn't matter because they only want you to make up so they don't have to deal with the sister. Or OP standing up to the sister is making them uncomfortable because why aren't they? So they are pressuring OP to so they don't have to deal with uncomfortable feelings. It's not about OP, it's not about the situation, and it's not healthy. So it's best to not triangulate when someone wants to get in between a relationship.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "You were uninvited. Seems to me NOT going would be a better way to \"Keep the Peace\".",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "Hijacking top comment to say:\n\n>they understand but I should go to keep the family peace.\n\nFUCK THE FAMILY PEACE. \n\nRespectfully OP but your family wouldn't know peace if it jumped up and bit everyone on the cheeks solely because of your sister and her tyrannical reign. Cut her off and move on with your life. You said it yourself, she has threatened to cause bodily harm to you via fucking with your car. People like that and anyone who says \"but fAmIlYyYyY ...\" have no place in your life. NTA.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This reminds me of that post about rocking the boat, and how the whole family not rock the boat over the one person instead of putting that person in their place. I’ll have to go find it now. \n\nOP NTA. She technically uninvited you. So I’d just go with that. Lol.\n\nETA: I found it. Here’s a link. \n\nhttps://www.reddit.com/user/ForwardPlenty/comments/b14k31/copy_of_rock_the_boat_essay/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1",
          "id": 50,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "\"If your parents have to suffer, you have to suffer too\"",
          "id": 51,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "> However I guarantee a variation of the \" but she's your sister\" card will be played. \n\n\"Yes, she is my sister, and that's what makes it extra hurtful that she'd treat me, her sister, this way.\"\n\n> well, that's just the way she is.\n\n\"Yes, and this is just the way I am.\"\n\n> Just come to keep the peace.\n\n\"No, I will not be treated poorly so that somebody else can be happy.\n\n> you should attend out of decency.\n\n\"She should treat us well out of decency.\"",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "And honestly, because I know the \"but she's your sister\" card would be played, I'd make a polite appearance for a very short time just to save the \"you didn't even go to your sister's wedding\" lamenting for the rest of my life. \n\nSometimes you gotta suck it up and do something you don't want to do. Future you will thank you.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "She should go, but not for the sister, go for her Mom.  Mom would be on the receiving end of any blowback, and would be the one fielding questions from nosey people at the event.  A short appearance quashes that and saves Mom a lot of headache.",
          "id": 54,
          "comments": [
            {
              "score": 3,
              "content": "Respectfully, that’s not OP’s problem. And if everyone witnesses her sister being a nightmare, it may open some eyes to the actual problem. As far as I’m concerned, their mom doesn’t have to go either🤷🏼‍♀️",
              "id": 55,
              "comments": [
                {
                  "score": -1,
                  "content": "You are right, she doesn't have to go, but doing so is going to put even more on her Mom.  Perhaps OP doesn't care, but we do uncomfortable things for those we love and respect.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "Nta for the wedding but YTA for saying “I can only speculate that it might be jealousy because Ive been the more academically successful one” I hate hate hate that sort of thing from people, you’re self centered too get over yourself while you blow off the wedding",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 892,
      "content": "NTA. An invitation isn't a summons.",
      "id": 58,
      "comments": [
        {
          "score": 182,
          "content": "Straight to the point. People need to understand you don't have to do 90% of the crap you think you do. In some countries it's totally normal to say no without even explaining why.",
          "id": 59,
          "comments": [
            {
              "score": 98,
              "content": "PLEASE GOD can we get back to being able to say yes or no without feeling the need to rationalize it for people?  It's exhausting listening to my daughter's ten minute rationalization before I get whatever it is she's trying to tell me.  I DO NOT CARE WHY.  \n\nJust say \"No, I'm not going to that\" or \"I won't be there\" and leave me to my Reddit.  If I'm offended I will post it anonymously and all my reddit friends will trash you (and me) until we all feel.",
              "id": 60,
              "comments": [
                {
                  "score": 8,
                  "content": "My ex wouldn't take \"no\" for an answer because I didn't give her money she needed because I was financially stressed and tired of her reaching out for money so often. Told me \"I don't want to call you if you don't care enough to do this just this once\" (it was way more than once).\n\nCut her off. I'm not losing any more friends over this.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "She could of course attend the ceremony, where there will zero interaction with the sister - and then bail on the reception.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "exactly.\n\nit is HER wedding.\n\nHer day.\n\nbut op does not have to be there for it.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 698,
      "content": "[deleted]",
      "id": 64,
      "comments": [
        {
          "score": 347,
          "content": "That's what I thought as well.   \nAnd maybe because she wants me to attend, just to feed her ego even more. Idk though. :/",
          "id": 65,
          "comments": [
            {
              "score": 120,
              "content": "NTA…\n\nIt’s a flex, don’t take the bait.\n\nIf she uninvited you, that’s on her. She has realized this and that’s why she invited you.\n\nNow that she has invited you, it’s on you.\n\nCall her bluff and attend. You don’t have to interact with her during the day.\n\nAfter that, do whatever you want.",
              "id": 66,
              "comments": [
                {
                  "score": 51,
                  "content": "Technically, Sister did not invite OP.  She passed along 2nd hand something to the C-Word parents in hopes it might trickle over to OP.  Thats not an invitation.\n\nShe uninvited OP to her face, any re-inviting mist be done face to face.\n\nOP owes the sister nothing.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I love this answer best.  Attend AND totally ignore her.  You're there for ma or drinks or w/e - anything & everything except her.  \n\nThough, I suppose it really matters how far it is.  And how far family is.  If the family is spread all along the Eastern seaboard, maybe just pretend it's a family reunion.  If you see most everyone at Ma's Taco Thursdays, & the wedding is 90+ minutes away?  Schedule something. Anything. A yoga class, or pilates, or a pedicure.  Now you've got an excuse. (\"I was hurt by Shelly's rejection, so I planned some me time\")",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Terrible answer.  OP please don’t attend all it will do it cause drama and give her another chance to humiliate you.",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "I agree with this. Absolutely cut ties with her… after the wedding. If she truly doesn’t want you there, when you don’t show up she’ll be able to use that as something against you/to talk to others about YOUR disrespect. Basically just setting you up to turn her disrespect around…\n\nIf you do show up, after she’s uninvited you, and begrudgingly re-invited you to save face— your presence (especially if it’s supportive and respectful — will be a nice little fuck you knowing she doesn’t want you there) \n\nSource: I’m a bride who lost an invite battle over inviting someone I want to cut out of our life based on disrespectful behaviours. I lost because it would create drama with a groomsman(boohoo.) Her presence is the only thing that feels like a black mark on my wedding day. I’m not actually going to let it bother me(but It sounds like your sister is petty enough to let her bother her) but If she didn’t show up, I’d feel vindicated. If that helps.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Or she wants you to show up anyway so she can embarrass you by kicking you out in front of everyone, claiming “I told you that you were uninvited.”",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "She is uninvited you. That’s the last thing you heard from her and she has not corrected. Unless your mom received a correction towards those invitations proceed as instructed by the bride.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Don’t go.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "You should go, but not for sis, you're going for your Mom.  You don't have to give a gift, you don't have to stay long.  But just making an appearance will save Mom a lot of questions about where you are and why you're not there.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "I'd RSVP yes +1 and then you and bf \"catch COVID\" and don't attend. That way, you don't have to be there, you have a great excuse, and she has to pay for 2 empty seats. Win, win, win!",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -5,
              "content": "Are you married or engaged?",
              "id": 76,
              "comments": [
                {
                  "score": 9,
                  "content": "If you don’t cut her out of your life, you will always regret the peace you could have had.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 49,
          "content": "Oh and don't forget, OP will have to bring a wedding gift too, which I'm sure is a huge motivator for reinstating the invitation",
          "id": 78,
          "comments": [
            {
              "score": 67,
              "content": "Perhaps a book on manners would be a good gift.\n\n&#x200B;\n\nAnger management for dummies is another good choice",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That's why you give her, in the nicest card you can find, a gift card to somewhere fancy for exactly one dollar.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "> which I'm sure is a huge motivator for reinstating the invitation\n\nI would assume it is pressure from parents and being concerned about other people's opinions, not wanting a rinky dinky gift.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Or she thinks she will get a gift out it.",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 437,
      "content": "NTA\n\nJust ignore her. She's blocked you so it should be easy to do. She uninvited you to the wedding, so you're just going with what she said.\n\nPerhaps book a weekend away with your BF over the same weekend so that you have actual plans, to prevent any suggestion later that you can still come.\n\n'Sister uninvited us from the wedding, so we made other plans. Have fun.'",
      "id": 83,
      "comments": [
        {
          "score": 217,
          "content": "Good idea! I'll still have Semester holidays, so it should be possible :)",
          "id": 84,
          "comments": [
            {
              "score": 29,
              "content": "Hi OP I have given you my input and included some advice to you. Give us all an update",
              "id": 85,
              "comments": [
                {
                  "score": 82,
                  "content": "Wedding is in September, so it will take a while. But if I remember I'll Update you All!! We might have a conversation before that, because my mom wants to have a talk with my sister, so we shall see",
                  "id": 86,
                  "comments": [
                    {
                      "score": 67,
                      "content": "Okay OP. A little advice here: be very careful and if you like you can bring a pocket sized MP3 player with voice recording to record whatever sister might say e.g. belittling and insulting you. That way the recording will act as proof that is her real bad behaviour you are dealing with and treat it as an insurance for you if she goes around lying about you",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I would be very weary of this meeting. I recommend you check out r/justnofamily and look through their info and reading guide and see if anything resonates with you. [Also see rocking the boat](https://www.reddit.com/r/raisedbynarcissists/comments/77w8lf/dont_rock_the_boat/) as to why this might be more about you capitulating then addressing her bad behavior",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Mom will likely be sent in as a flying monkey.  Go to any of the just no subs and ask them about flying monkey attacks.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "If you do go, make a point of looking your absolute best without looking like you're trying to take attention away from her. I smell jealousy all over this one and ten bucks says you showing up looking great and having a good time on her dime will probably ruin her day.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And don't forget to turn off your cell phone that weekend. The messages you received would only upset you.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": ">Perhaps book a weekend \n\n\"I have better things to do. Some binge watching to catch up on, books I've been meaning to read, and deep clean the fridge.\"",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 197,
      "content": "NTA! And f*ck keeping the peace! Go out in a blaze of glory. Make sure she knows *exactly* where she stands with you after that, otherwise she's gonna keep boomeranging back into your life to try her luck.\n\nSometimes it's okay to be the villain in other people's story.",
      "id": 93,
      "comments": [
        {
          "score": 79,
          "content": "Thank you! The boomerang effect is exactly what I'm worried about !",
          "id": 94,
          "comments": [
            {
              "score": 9,
              "content": "yes there is no way in hell i would go to that woman's wedding. She even threatened your safety...shes nuts.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": ">Sometimes it's okay to be the villain in other people's story.\n\nok?  just ok?  Sometimes its completely unavoidable, and an opportunity to be embraced, exploited, savored, and cherished. \n\nSister treats the entire family and OP in particular like garbage.  Take this uninvited opportunity to be the villain and run with it!  Run away from the wedding and towards some fun adventured filled enjoyable time with your BF, and any other family members and friends who may be as fed up with Sister's BS as OP is.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Have you considered going full Westboro Baptist on the wedding?\n\nPicket that thing with a megaphone.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": ">f\\*ck keeping the peace! Go out in a blaze of glory.\n\nMaybe it's just because I'm older, but it seems really rash to actively burn a bridge with a sibling when you're both barely adults. Especially over what ultimately seems like pettiness and strife brought on by immaturity. I know I was actively an idiot in my early 20s, got better in my 30s, and am a much better person now that I hit 40.\n\nYou don't have to keep family in your life forever, but unless you're willing to cut your entire web of family connections off it's going to be incredibly hard to not have to interact with your sister at least sometimes for the rest of your life.\n\nIn 10-20 years no one's going to remember the \"printer incident\", being rude on a wi-fi name, or other arguments... but skipping your sibling's wedding is the kind of conflict that can last a lifetime.",
          "id": 98,
          "comments": [
            {
              "score": 9,
              "content": "You did catch the part when sister threatened to mess with OP’s car, right",
              "id": 99,
              "comments": [
                {
                  "score": -5,
                  "content": "It sounds like the sister has a history of making inflammatory statements and insults, not a history of sabotaging vehicles and putting people's lives in danger.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Well, I'd definitely want to trust my personal safety to that.  /s\n\nI agree with almost everything you said (I'm 48, hi!), but the personal threat is what moves this into \"Okay, I'm willing to go scorched earth here.\"   The inflammatory statements are notable because the OP observes that this isn't the usual for their family at all.  A family in which everyone calls each other vulgar names has a very different dynamic than one in which *that is just not done* except by one individual.  That suggests danger to me.\n\nSo she has a history of inflamed rhetoric, yes, but it's not just that.  She also has a documented history of *throwing things at the OP when she gets mad.*\n\nSo she's been violent before, she's unusually inflammatory compared to family norms, and the last thing OP heard was \"don't come to my wedding.\"  I think the invite is a gift grab.  Also possible that Mom is footing the bill for the wedding and demanded OP be invited in return.  Either way, I would *not* go to this wedding.  And I would go full NC with this sister.  Just reading between the lines, this woman goes beyond problematic to actually dangerous.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "Glad to see someone in this thread has some maturity and common sense.  I agree with your take on the perspective one gains with age.  We were all dumb 20 year olds at one point.\n\nGo to your sisters wedding.  Life's too short to cut out a relationship with a sibling over this petty crap.\n\nAnd as for people freaking out about the car thing - give me a break, nobody is going to tamper with their sisters brakes like some kind of bad tv movie.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 162,
      "content": "NTA, but I encourage you to go to the wedding. Here’s why: \n\nEventually you’re going to go NC with her, and you already know that. Going NC after the wedding will cause less of a rift between you and your family. Your family is encouraging you to go and be the bigger person. Going shows then you *are* the bigger person. Plus a lot of the time, you either don’t even talk with the bride and groom, or you say one sentence to them. It could be fairly easy to distance yourself.\n\nSecondarily it’ll piss your sister off if you go and have a fantastic time. She’s likely inviting you because it looks bad not to, since that’s classically something a narcissist would do. It’ll leave her steaming to see you laughing and smiling and dancing and having a great time. \n\nLastly, If she’s that self centered, she’s likely to have at least one meltdown at someone during the wedding. Might just be interesting to watch, or it could be at you and give you something to make that moment the breaking point for NC - loudly in front of everyone, which would make her even angrier because she would feel like you stole her day.\n\nEdited to add: she can’t play the victim card if you go. Otherwise she will. “Ohh I tried to mend the fences but my sister just won’t! Feel bad for me!!!”",
      "id": 103,
      "comments": [
        {
          "score": 92,
          "content": "Fair point. I still have time to consider going. I'll keep it in mind, especially because I'd see my grand parents who I haven't seen in years. Thank you!",
          "id": 104,
          "comments": [
            {
              "score": 66,
              "content": "I actually think this is solid advice, OP. Except for the bit about going NC in front of everyone. Drama is not what you want. You need to look like the bigger person.\n\nGo, look gorgeous, be on your best behavior, and eat as much of their food and cake as you can. Be a paragon of supportive family member. Keep your distance from the bride. If it's a big wedding, it won't be too hard to constantly find yourself on the opposite side of the room. Get into plenty of photos as proof of your attendance and support.\n\nIf she tries to pick a fight with you on the day, take deep breaths and exit the situation at the first opportunity. Hell, you don't even have to stay the whole time. Get through dinner and cake, then make a sneaky silent exit.\n\nCome out of this looking good, then go as low- or no-contact as you want.\n\nETA: obviously NTA",
              "id": 105,
              "comments": [
                {
                  "score": 2,
                  "content": "This is fantastic advice right here. I know that you REALLY don't want to attend this event after all the nonsense that your sister is putting you through, but following the steps described above, you will absolutely emerge a star. I bet your sis would love NOTHING MORE than for you to not show up, and litter the whole event with statements like \"I CAN'T BELIEVE MY SISTER ABANDONED ME ON MY BIG DAY.\" Don't give her the opportunity to paint you as the bad guy. Attend, avoid her, interact with your family/ friends all kind and cordial. I also like the idea of the \"Irish Dip\" (IE, leave quietly without an announcement.) The only addition I can make is avoid any conversation where the conflict with your sister is mentioned. \n\nI'm really sorry you're going through this, but sometimes in order to survive self centered and obnoxious family members, you simply must be as strategic as possible. Best of luck to you my dear.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Go to see them. Get pictures with them, give them some love. Just avoid her. Smile for the pictures they ask you to be in. Tell your mom she looks nice. Tell the bridesmaids they\nLook great too… your sister will have some negative comment about you and everyone else will say, “Really??? She was so polite and nice and drama free… you guys couldn’t be more opposites 😂”\nMy Grammy and Grampy were at my wedding and I held their hands and loved them… they are both gone now and I am so glad my wedding was so small so I had the time and they the attention.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "There's nothing like a good old wedding in a dysfunctional family.  Your sister sounds like a diva, regardless of her being a bride-to-be which brings out the diva in a lot of women.  I went through it with both of my sisters unfortunately.  \n\nGiven that you're conflicted, looking back, I wished that I had had some sessions with a therapist to work my feelings out about it.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "At the very least - go, eat, leave! Having two more guests attend will add to the cost and at the very least, you’ll receive free dinner and drinks. Leaving noticeably early and will leave her FUMING. You will be no contact whether you go or not, and with the shit sandwiches she keeps serving up, I could not possibly see why not 🙃",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "I second this and want to add, lots of family members show up for weddings that you may not see again until the next one. When my family ran out of weddings there was a gap where no one saw each other. Now we only catch up at funerals. It’s sad. Enjoy the other people at the wedding, avoid the bride, then enjoy your new low drama NC lifestyle.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "On top of this OP should have a speech drafted in case they ask if anyone would like to make a comment. Caution to OP - you have to be very subtle about your digs here. To harsh and you come off looking bad. One alternative could be to just lie and say how great a big sister that she has been, and that you look forward to her husband getting to live in harmony with such a lovely woman.\n\nAlso note: your sister is entitled, and super jealous of you.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Deliciously devious and vindictive. Love it.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 81,
      "content": "Don’t go to “keep the peace “, you’re not the one disturbing it. NTA",
      "id": 113,
      "comments": [
        {
          "score": 51,
          "content": "When other people say to do something to \"keep the peace\", what they're actually saying is \"keep our peace by sacrificing your own\".\n\nYour sister sounds like the type of person I wouldn't touch with a 10ft pole. NTA",
          "id": 114,
          "comments": [
            {
              "score": 3,
              "content": ">When other people say to do something to \"keep the peace\", what they're actually saying is \"keep our peace by sacrificing your own\".\n\nA thousand times this \\^",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 60,
      "content": "nta - but if i ever called my mother like your sister did a C word i would have been peeled off the wall.",
      "id": 116,
      "comments": [
        {
          "score": 28,
          "content": "Yeah, my mom took her house keys because of that. \nShe lives with her bf and I live with mine, we were allowed to keep the house keys for my parents house to always be able to go to them. Just as context, my mom didn't take her house keys of course!",
          "id": 117,
          "comments": [
            {
              "score": 30,
              "content": "I'm baffled that your mom and others put up with her behavior to begin with. NTA of course and go low or no contact. Time to find out why others put up with her behavior? Especially your parents.",
              "id": 118,
              "comments": [
                {
                  "score": 23,
                  "content": "For my mom it's mostly the \"but she is and will always be my child\", which is reasonable I guess, but for me it's \"only\" my sister, which I feel like is less of a bond",
                  "id": 119,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yes she is her child. You're meant to do what's best for her. And at times that's not tolerating awful behavior, but setting consequences and sticking with them. Enabling bad behavior is horrible for a child. So....sad.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Oh good grief OP. I pity the man who is going to marry your sister. Can you imagine what happens if she starts bringing all her anger and behavioural issues upon that future husband of hers? I bet that man's marriage with her will be unhappily ever after sooner or later",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "As an Asian, I'm laughing on the outside at this comment while having PTSD flashbacks of my childhood...",
          "id": 122,
          "comments": [
            {
              "score": 6,
              "content": "i had strict german parents i got some trauma from that too ..",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 56,
      "content": "NTA and wow, your sister is nuts and she threatened your life! Please cut her of your life and be careful for what she might do in response",
      "id": 124,
      "comments": [
        {
          "score": 26,
          "content": "Yeah, I feel like once death threats are issued, an invitation is an automatic no.",
          "id": 125,
          "comments": [
            {
              "score": 4,
              "content": "This is why I'm not getting the \"you should just go anyway and show you're the bigger person and piss her off\" advice. Her sister comes off as dangerously unhinged and I think OP should go NC asap. NTA",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "If anyone asks why OP didn't go, OP can tell them she uninvited them personally and threatened their life by sabotaging their car.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "NTA\n\nIf she wants you there she would invited you by her own.\nYou are still not invited",
      "id": 128,
      "comments": [
        {
          "score": 19,
          "content": "Exactly sister just made it so she can tell everyone OP did get an invite so it’s her fault if she doesn’t go. Manipulative shit!",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}