{
  "post content": "Ok…I’ve been dating my BF for about 9 months. The first few months his dogs stayed home with his roommate when he would stay over. Slowly he would have them with him and it would get late so they would stay over. I got them bowls and was trying to be tolerant, as I don’t have dogs, nor do I allow my cats in the house. \n\nIt started to get more and more often and I started to not be ok with this. The dogs aren’t trained. They’re 2 BIG dogs and a little tiny one. 3 total. They have accidents over night, they eat food off the counter, they get in the trash, they are just seriously not trained in the slightest. I got to a point where I was losing my mind waking up in the morning stepping in pee or cleaning up poop and trash strung all over if we forgot to put it outside. I’ve seasoned meat and had it all ready to cook and more than once they’ve eaten the meat off the counter ( I’m talking a plate of ribeyes, like $50 worth of meat). I’m not used to having to worry about putting it up if I go outside for a few. \n\nI finally had to tell him I can’t take it anymore. I don’t want to feel anger or hatred towards animals as it’s not their fault they’re not trained. I just can’t live like this. \n\nI will add that he lives like that. That’s the reason I don’t stay at his place. His bed is a dog bed. It’s not suitable for humans. He’s fine with dirty, torn up blankets and literal holes in his dirty mattress with springs exposed and foam everywhere from them tearing it up. He sleeps like that. No fucking way. I’ve asked him to cut off his room to the rest of the house and make an acceptable place for us to sleep and I’d be happy to stay with him. Nope, he’s not willing to stop sleeping with them and giving them free reign to his room and bed. \n\nI told him they can’t come to my house overnight anymore. I had to rip out the carpet and put in hardwood flooring to repair what they’ve done at my place and make it acceptable to live in without it smelling like the pound when I walked in. He’s super offended. He can’t believe I’m making him leave his dogs at home if he’s staying at my place. This is nuts to me. \n\nHe and his parents think I’m the devil and a dog hater for this. Are they right? I think I might be the asshole for not being more accommodating to the dogs, as I knew the situation when we started dating. AITA?\n\nEDIT—since there have been many comments about being an asshole about having outdoor cats…\n\nI live in the country. I have a small farm and I have 2 barn cats. They have access to a heated area and are very well taken care of. I love my kitties. They’ve been fully vaccinated, both neutered and happy babes.",
  "id": 1,
  "comments": [
    {
      "score": 7237,
      "content": "NTA. I am a dog person. Love them. But you don't take your untrained dog to someone's house and let them damage it.",
      "id": 2,
      "comments": [
        {
          "score": 1635,
          "content": "Exactly! My grandmother has untrained dogs and always tries to say that training them will ruin their personalities meanwhile one has its whole face in a chip bag and the other is peeing on the floor. \n\nPeople who let untrained dogs do whatever they want are why people hate dogs. They can be just as loving and full of personality when you train them well and teach them right and wrong.\n\n\nSide note: who leaves nice quality meat out on a counter all night? That is a bad idea in so many ways and you would get a much better steak if you left it on a plate with a grate in the fridge overnight instead.",
          "id": 3,
          "comments": [
            {
              "score": 1429,
              "content": "\"*I’m not used to having to worry about putting it up* ***if I go outside for a few****.*\"\n\nShe's not leaving the meat out all night! She pulls the meat out and leaves it on the counter while she goes outside for a few minutes (check the grill, have a smoke, get the mail, whatever). In those few minutes, the dogs grab it.",
              "id": 4,
              "comments": [
                {
                  "score": 570,
                  "content": "Oh I totally read that wrong. My bad, lol. That does make the dogs even worse though. I feel bad for them, its not their fault their owner doesn't care enough to train them.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1212,
                      "content": "This relationship is never going to work, OP.  End it now. You have different values about animals and cleanliness. The fact you won’t even stay at his place says it all.  NTA for getting frustrated, but he will choose the dogs over you every time.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "We have  a  friend whose dog can't come round anymore.\n\nShe stole a whole loaf of bread off the table during a barbecue. \n\nI was repotting tomatoes and she stole and ate my whole bag of milk powder. \n\nShe got in the shed and ate a whole bag of blood and bone fertiliser. \n\nShe's very sweet but she's a menace. We have the same breed and ours will wait to have his paws wiped before he comes in the house. Train your goddam dog!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "To be fair my dog is pretty good but even he would grab the unattended meat on the counter. He knows he shouldn't and that he was bad by doing it though. He'll literally go hide in the basement on his bed and refuse to look at you when he knows he's done something he's not supposed to. He looks so guilty.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "When my husband and I were staying with my mother in law, I had two cans of veggies draining in the sink and took a bathroom break. My MIL's hounds pulled the strainer out of the sink and threw the veggies on the ground. Untrained dogs are the absolute worst to have in the house.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "James Herriot had a story about a couple who had 2 really nasty, yippie dogs that bit and growled and were just awful, and the owners just tee-heed at their behaviour. Then those dogs died and they got new ones and at first the dogs were delightful, but due to the absolute lack of training the new dogs, they turned out to be just as nasty as the first set. Lesson learnt was 'dogs need training and owners who don't are doing a disservice to those poor dogs.'",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I read it the same way at first, lol.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 113,
                  "content": "My son makes the best steaks I've ever tasted. He tells me, beside having a good cut of steak, is to always let them sit at room temperature for an hour. and now I'm hungry...sigh.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 59,
                      "content": "I’ve been trying to perfect my steak-cooking and that is one of the biggest trick. Salt a ribeye and leave it out of the fridge for at least an hour until it’s room temperature.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "This comment was heart warming ❤",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Thank you for this advice!  I only recently discovered pan cooking steaks and they're already pretty damned good.\n\nI'll try this out next time.  :)  \n\n\nEDIT: My son is also an amazing cook.  Thank goodness he lives in Maine or I'd be as big as a house :D",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 49,
                  "content": "That, well, I wouldn't do that around big dogs because even a well-trained dog is still a dog.  Grew up with a family that bred and trained German Shepherd Dogs.  We called the microwave the dog safe. That was where we put meat to thaw.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I had cats and large dogs as a kid, until I moved out. Always used the microwave to keep food safe. I then had cats of my own, so again, used the microwave to keep things safe. Cats have now both died and I still use the microwave even though my two dogs aren't even 18\" tall when standing on their hind legs and definitely can not get on the counter. Just habit. I like calling it the \"dog safe\" though!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Haha right. Had a super well trained Irish terrier growing up, for years she never stole any food. Then one day we made the mistake of leaving a whole salami out and in reach and yup, she ate it!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Some dogs are just more obsessive over food than others, even with in the same breed. I got lucky, my doodle is big enough to get to the food but mostly behaved enough to not do it, both my dogs grew out of the \"I'm a puppy and i scarf my food\" phase and now they free feed. But I've seen dogs that'll eat so fast their whole lives or will take the opportunity to steal food no matter how good a boy or girl they are. In a normal case if you know your dog is a foodie but they're usually good its easy to work around, in this case there's such a lack of training its not the dogs fault and sad to think about how lazy a dog owner he is",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yep, the microwave or oven were the dog safe spaces when we had a husky mix who was tall enough to reach the counters. He knew he wasn't supposed to, he just didn't GAF. To be fair, he was also a stray who I'm sure had experience extreme hunger before (super skinny when we got him) but he was just shameless.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My mom and my dad had a dog named Flain (before I was born). He was not housebroken, and he tended to be very active and was a good sized dog that would always demand attention and never listen or behave. But she put up with it. Until one night she was cooking her and my dad some steaks. She had them on the counter next to her, and put one in the pan. She turned to grab the other to put in the pan and the first was GONE. And there was Flain, sitting on the floor, finishing up the steak he had just stolen from the pan while she was standing there. \n\nHe was gone the next day (not sure if he was rehomed or taken to the pound, but one of the two). Can't really say I blame her on that one.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 151,
              "content": "Ugh. My family was all about the personality of our dogs, and *believe* we had some dogs with strong personalities. \n\nWe still trained them, because jumping all over people and snatching food and peeing in the house and yelling at inappropriate times isn't 'personality' in a dog any more than it is in a human.  \n\nWe didn't train our dogs to be robots that only moved when told, and there were certain cheeky behaviours we wouldn't train out of them because it *was* part of their personality, but we sure as hell taught them to behave in polite society, just like you do with humans.",
              "id": 22,
              "comments": [
                {
                  "score": 55,
                  "content": "Yep my dogs have loads of personality but are still housebroken and know basic commands, manners, and generally how to act.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 8,
                      "content": "mine know how to act but it takes the \"mom angry eyes\" sometimes for them to remember that 😄",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Suddenly parents catering to every whim and tantrum make sense.. they don\\`t want to \"interfere with the kids personalities\"...\n\nNot sure where that line of thinking comes from - every little baby gets taught - regardless of species. Where to find food. WHo is the leader of the pack. you know - basics..",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "> We didn't train our dogs to be robots that only moved when told, and there were certain cheeky behaviours we wouldn't train out of them because it was part of their personality, but we sure as hell taught them to behave in polite society, just like you do with humans.\n\nExactly this - my dog (now passed on, I'm still heartbroken, let's move on) had such a huge personality that people used to call him a \"human in a dog suit\" and it was BECAUSE of the training. Very basic training helps establish that you're the leader (not the alpha, that's not a real thing with dogs) and being able to trust their leader to keep them safe and guide them is what allows a dog's personality to blossom. Not only that, but if you continue to work with them regularly after basic puppy training, you build up communication between yourself and your dog and that's what gives you a truly strong bond, and beyond that, actual friendship. A friend once told me that it seemed like i and my boy had a psychic connection; it was just that we knew each other's mannerisms and body language so well that he'd just have to look at me for me to know what he wanted, and vice versa.\n\nI feel bad for those poor dogs, left to their own devices, having to figure out on their own how to exist in a world that's not built for them, with an owner who doesn't even try to help. It's sad.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": ">People who let untrained dogs do whatever they want are why people hate dogs.\n\nAs a person who doesn't like dogs, I can confirm this is true for myself.",
              "id": 27,
              "comments": [
                {
                  "score": 10,
                  "content": "This is why everyone is always so surprised they love my tiny dogs, even if they usually hate dogs! They're well mannered, and once you come inside they stop barking. My Chihuahua doesn't even bite ankles, lol!",
                  "id": 28,
                  "comments": [
                    {
                      "score": 2,
                      "content": "It was small dogs that got me to liking (rather than tolerating) dogs. Growing up most people seemed to have medium to large breeds that were okay—kinda trained but still a bit hyper and jumpy. That includes our own. Being fairly small, that’s pretty intimidating even in a friendly dog. But my husband’s family has Cavaliers and OMG they are all so sweet and friendly and just want to cuddle! So now I have a Japanese Chin sleeping under my feet, because small dogs won me over.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And this is why I have 3 fish as pets! I hate that rank odor that dogs give off, and my fish don't inconvenience anyone or dirty parks and sidewalks.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": ">People who let untrained dogs do whatever they want are why people hate dogs.\n\n100%. I generally dislike dogs, mainly because I regularly observe owners who let untrained dogs do whatever they want. For instance, yesterday I saw a golden retriever get clipped by a car because the owner let it run around off leash next to a busy road. I also saw a woman walking a dog on a crowded hiking trail while the dog went bananas, barking and lunging at people.\n\nI always admire the \\~10% of dog owners who seem to have it together: their dog is well trained, they actually keep it under control, they obey the rules.\n\nI think it takes work to be a good dog owner. Most dog owners can't or won't put in the work.",
              "id": 31,
              "comments": [
                {
                  "score": 19,
                  "content": "Most dog owners act like their dog is an aesthetic instead of a living being capable of learning, and I say that as a dog owner. You're completely right about it taking work to be a good dog person, if you can't put in the work, you probably shouldn't have a pet.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "I don't think she meant she left the meat out overnight. She said it was on the counter marinating I believe.   If she is not used to having dogs around, she didn't think they would take it if she left the kitchen. We have 2 big dogs and we are unable to leave food out as they can reach the counter and stove tops.\n\nNTA",
              "id": 33,
              "comments": [
                {
                  "score": 1,
                  "content": "I have a good dog who’s well-trained, but “countertop cruising” for food is really hard behavior to break. I wouldn’t ever leave food (that he would like) on the counter unsupervised, nor would I leave meat scraps in the kitchen trash when I go out for a few hours.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "> People who let untrained dogs do whatever they want are why people hate dogs.\n\nYou are spot on with this. I don't say I hate dogs anymore though because so many people got ruffled and offended if I dared. Now I just say I'm not fond of them, but this shit is the reason why.\n\nWhen I can't leave my room without shoes on because the floors are slick with piss and I don't want to step in shit with my socks on, and I have to sleep with earplugs because my mom's dogs (now dog singular, thank god) have barked and cried and whined for almost six years every time she's left for work in the morning, *there is a fucking problem.* I hate living in such a disgusting environment, but since I was a child she's refused to do anything about her precious babies so until I can scrape together enough for a decent house I'm stuck living in literal shit. Needless to say, I can't wait to get out eventually.\n\nSo, louder for the people in the back who think not liking dogs makes someone the devil incarnate: **People who let untrained dogs do whatever they want are why people hate dogs.**\n\n(But not liking dogs for other reasons is valid too.)",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "There was another comment on a post about a dog getting into a chip bag and suffocating themselves, please pass that along to your grandmother. That would be awful no matter if they are untrained or not. 😞",
              "id": 36,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah, that would be. I have never heard of that before, but I'll definitely let her know, that's really sad. Poor dog and yet another case of its your fault for not training your dog better.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My recent ex said the same thing about her dog who I love but would jump on me and scratch me accidentally and who had to be crated if we left the house because he would eat shit like  pillows and steel wool off the sink counter if we weren't there to supervise.  It's a big part of why she's my ex.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My dog is trained and still has a personality. He loves snuggles but knows he isn't allowed on the bed unless we invite him up. He loves snacks, but knows he can't take food off the counter.  I can't stand it when people let their dogs do whatever they want. I wonder if the boyfriend would just let kids do whatever they want? 🤔",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "> who leaves nice quality meat out on a counter all night?\n\nI don't think the meat was left out over night. I think she left it on the counter and when she came back it was eaten.",
              "id": 40,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 189,
          "content": "I hate people like OPs bf. They get dogs but don't train them because it is to much work. Than they use excuses why they didn't train them (personality...). They don't care about the proberty of their \"friends\" that their dogs destroys and if they ever get ill or sick of the dogs... nobody wants such dogs! They end up in a rescue and will be put down. Great owners! They REALLY love their dogs... they are just lazy assholes.",
          "id": 41,
          "comments": [
            {
              "score": 75,
              "content": "Honestly, it's unfair to even call them \"untrained\" in this situation - if those dogs are urinating and shitting in the house, it's because their owner is **lazy and neglectful** and not taking them out often enough.  Those poor dogs.",
              "id": 42,
              "comments": [
                {
                  "score": 25,
                  "content": "I'm always asking myself, why these people even got dogs? These poor animals could have found a better home, but now they are stuck in a home where they need to sleep in their own pee and shit and nobody really cares about them.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Agreed, it's reprehensible.  I'm not a dog person at all (raised with cats and have had them my entire life), but you can bet your sweet ass that when my grandparents died and I had to take over the care of their older dog that I was hauling my butt out of bed to let it out in the middle of the night, every night.  It's just common decency to not let a poor animal suffer when it's bladder and bowels are full.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Thank god my mother died before she got a dog. She wanted a Boxer because she'd seen one sitting in the front seat of a car and thought it was cute. The first dog we had when I was young was neglected as fuck. It was only me who walked her up until I moved out.  Poor dog never got bathed or groomed, stuck in a tiny kitchen all day until someone came home to let her out and then she was starved of affection when my mother got home.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I have never seen a dog behave like that, let alone 3. Clearly not doing it right. They need training bad. And you’re right, these are the dogs that end up in shelters when their bad habits become too much of a burden on the owner",
              "id": 46,
              "comments": [
                {
                  "score": 2,
                  "content": "It's frustrating and such a shame.  It's so much easier to train a puppy than it is to train an older dog if only because they're smaller and can be actually removed from situations where they're being naughty.  I don't fault the dogs for being dogs, but I fault the owner for not teaching them how to behave.  Then again it looks like the owner himself isn't too hot on looking after himself so.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Honestly it’s not hard to house train your dog and teach them not to destroy stuff. My dog is big and wilful and she understood not to eat the furniture or wee in the house very quickly. \n\nAnd she’s got personality. Lots of personality.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Yes! I am super attentive to my dog when I take my dog to other people’s houses! I make sure my dog is well behaved and take him out regularly.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Let alone 3 of them. Having to replace the floor is pushing things prettttty far. Honestly BF is TA for being a bad dog owner. Gotta train your puppers.",
          "id": 50,
          "comments": [
            {
              "score": 2,
              "content": "Plus if they’re renting that also could violate their lease or at least forfeit their deposit.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I agree 100%. I love dogs. Love them more than people, have 3  and I help with dog rescues, and I’m saying NTA.",
          "id": 52,
          "comments": [
            {
              "score": 0,
              "content": "Also a 3-dog family, one of ours spent many years in a very basic dog shelter and yet he learned to pee and poo outside within a day or two. We've had no \"accidents.\"\n\nDogs like rules and routines. He's not doing his any favours. NTA.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "NTA - I have 3 dogs and have never had this issue of them stealing food, tearing up a bed, or accidents over night (with the exception of puppy crate training and that's way different). I also have a lot of friends who have dogs and some live like your boyfriend does and I want to give you a heads up because these are pretty common in what I've seem:\n\n1. He lives dirty. Do not expect any help around the household unless he wants some sort of praise from you.\n2. He will not be the \"mean parent\" if kids ever came into the picture. Could be your kids, could be a friends kids that you're watching, ect.\n3. He will almost always be more important in his own world than you OR the dogs. A prime example of this is being too lazy to train the dogs/seek out help if they're difficult to train and rather let them destroy what's in their path. It's an inconvenience to him to do that but he knows it upsets you and he's choosing to ignore it.\n4. He's overall going to be inconsiderate and you can already see that.\n\nYou can really tell a lot about a person by how they treat animals and how they train their own animals.  It also sounds like he's made you out to be the bad guy, already, for asking that your house stops getting destroyed. Do you really want to deal with that?",
          "id": 54,
          "comments": [
            {
              "score": 3,
              "content": "Thank you very much for your input",
              "id": 55,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "But more to the point: what are these 2 even doing in a relationship? this is not going to work long term",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I would be MORTIFIED if my dogs did this at someone else’s house.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Op what are you expecting out of this relationship? Because you’ve seen how he lives and how he allows his dogs to behave! This is not going to change (clearly)! If you’re happy to be always in different home than fine but if at any point you want to move in with him or get more serious he is giving you a massive insight into not only how he treats his own property, but yours as well! Couldn’t be me I must say that’s a no",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "OP needs to take a long hard look at this relationship.  I suspect there are many more examples of how onesided it is.  \nNTA but please reconsider a relationship with someone who has so little respect for you.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3534,
      "content": "NTA but you need to end this relationship. Dog people can be nuts and for some of them, not being willing to totally overthrow your life to accommodate their pets makes you a “dog hater”. This man is an irresponsible pet owner and lives in squalor that he sees no problem with. You can do better, sis.",
      "id": 60,
      "comments": [
        {
          "score": 1376,
          "content": "Thank you. This is how I feel. It’s just like what the hell is going on here? Lol",
          "id": 61,
          "comments": [
            {
              "score": 841,
              "content": "Good people train their dogs.  Because trained dogs know how to behave, so they are happier. \n\nLazy people don't train their dogs. \n\nIs this bf someone you really want in your life?\n\nNTA",
              "id": 62,
              "comments": [
                {
                  "score": 277,
                  "content": "In my experience, most dogs (like most humans) need structure in their lives to be their best selves and function properly. \n\nYou don't have to train the dog's personality away or even discipline them so much that they become subservient. But you need to train them enough that they're not literally living wrecking balls. \n\nStealing food off of a counter or a table should never be permitted, and by not even scolding them for it, OP's bf is actively encouraging that behavior. The same goes for them going potty indoors or destroying furniture. \n\nWhat's more, domestic animals (especially big dogs) tend to destroy furniture when they're bored and have pent-up energy that they've got nothing to do with, so they become destructive. The furniture-ruining (and likely bathroom) issues could literally be solved by just a) providing them with toys that they can use independently to entertain themselves, and b) taking them out more for exercise and stimulation. \n\nOP's bf isn't just a shitty dog owner, he's literally an unsuitable one.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Op is of course Nta. I agree with your comment and think that these dogs should be taken away from him. Like you said he is completely unsuitable and these dogs need someone who will take better care of them. I mean, living in filth is noway a healthy living environment for them. I can't understand people who don't train their dogs and let them in this state even in the house.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "[deleted]",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": ">\tYou don't have to train the dog's personality away or even discipline them so much that they become subservient. But you need to train them enough that they're not literally living wrecking balls.\n\nExactly this! And it’s not even like you’re telling them not to do any of their natural behaviors you’re just *redirecting* those behaviors to appropriate times and places. Basically “no you can’t chew the table leg, chew this chewie I gave you instead”. But if the BF is so lazy and neglectful that he lets the dogs pee and poop all over the house then he’s never going to train them in any meaningful way.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Yes!  Dogs are like toddlers - they feel much more comfortable and secure when they know what the rules are and know what the consequences of their actions will be.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": ">they're not literally living wrecking balls.\n\nthis made me chuckle at my desk, thank you",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Not just not training his dogs but living in filth and expecting Op to not only be ok with filth at his house, but now at her’s.  That’s disgusting.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Right?! I don’t know how long I would have lasted knowing my partner doesn’t have a problem with disrespecting not just my home but ME after knowing full well I don’t spend time at the trashed house his dogs have already destroyed. \n\nIt’s such a slap in the face for him to ignore cleaning up his own living space and dogs messes only to do the same at OPs house then gaslight her into thinking she should be more accommodating. \n\nNOPE",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "This is exactly it. *Lazy* people don’t train their dogs. Or let them pee on the floor. Or let them rip up the sheets. I cannot tell you how much time I put into training my dog when I got her (granted, I also thought it was fun).\n\nI mean, OP you sound like a perfectly normal person, I cannot imagine you letting this relationship progress to him moving in with you?\n\nNTA. But YTA to yourself if you keep this relationship going.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This. I’ve never had dogs but I’ve looked after a lot, and someone on here ages ago who was a professional dog trainer was replying to a dog post and explained how much happier dogs are when they’re trained. And it made so much sense to me!\n\nImagine having to spend time in a house where you don’t understand any of the rules, but OP is (fairly) going to get cross at you if you break them. That sounds so stressful for them!",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": ">\tLazy people don’t train their dogs.\n\nYou hit the nail on the head. \n\nIt honestly sounds like the dogs are training the people to tolerate their bad behavior. \n\nAnd I absolutely draw the line at them not being housebroken. That’s disgusting and the boyfriend should have to pay for the damage.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm lazy AF...but my dog is trained, house-broken, basic manners and even a few tricks. The trick is finding the right dog for your lifestyle. My dog is also a lazy bum...but my lazy bum knows he's supposed to shit outside, in the backyard along the treeline to the woods. Also NTA.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That is Enlightened Laziness. 😇",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Exactly this. My dogs are trained because I'm too lazy to deal with the aftermath of them not being trained.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Or at the very least, they house train their dogs. It just covers the basics to not pee or poop in the house.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Yeah, his not training  his dogs is neglectful and will probably lead to them getting injured or worse one day.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I mean, my dogs are well trained specifically because I'm lazy.",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 238,
              "content": "You've been dating this man for only 9 months and he's already obligated you to remodel your house due to damage from HIS pets.\n\nDeal. Breaker. And this dude is 40 fucking years old and sleeps on a shitty ripped-up mattress with chunks torn out of it. What the hell. You deserve a partner who's a functioning adult.",
              "id": 80,
              "comments": [
                {
                  "score": 153,
                  "content": "He's also 40 years old and complains to his mom and dad about his girlfriend not letting his dogs come over.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 21,
                      "content": "THANK YOU I was looking for this comment, I refused to believe I was the only one horrified that he is literally 40 years old and complaining to mommy about his girlfriend expecting a hygienic living environment, the audacity!",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "[removed]",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "I know 😔 it’s just terrible",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "[deleted]",
              "id": 85,
              "comments": [
                {
                  "score": 34,
                  "content": "Spot on. It’s really helping hearing these outside perspectives. So, I’m not crazy in feeling like what the actual fuck",
                  "id": 86,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Clearly he expects you to get over it and just sleep in a dog destroyed pig sty with him forever, so...",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "This is the #1 comment so far, proper analysis and good listing of each problems.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 100,
              "content": "I'm a total dog person,  my boyfriend is not so much.  I have a senior little Yorkie who has recently started to have way more accidents since she doesn't have total bladder control anymore. I happily wake up every day and literally mop my entire apartment,  and clean up after her throughout the day. My boyfriend is not used to dogs and their messes and as a compromise I sectioned off a part of my apartment that she stays in so the mess is better contained. I understand that not everyone is going to have the kind of empathy for my little partner-in-crime of 14 years,  to walk around behind her and clean up every mess. The compromise we landed on has made both our lives easier. I can't imagine letting my dog destroy everything in my partner's home and just expecting them to \"deal with it\". Very disrespectful and irresponsible.",
              "id": 89,
              "comments": [
                {
                  "score": 13,
                  "content": "And IMHO there's a big, big difference between a senior dog having incontinence issues versus never housebreaking a dog in the first place.\n\nI think your compromise is a brilliant one.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I would honestly be so embarrassed if my furkids did that kind of damage to someone else's property. I would also never put up with happening in my own home.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My friend recently lost her senior Yorkie and it's been devastating for her. She did everything she could for that lil man even when he started to have accidents due to his age. You remind me of her. So many times we'd be on Skype and she'd be like fuck be right back he pooped again lol. I miss him! Enjoy your lil girl, they are beautiful babies. You're a good pupper owner too.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thank you for the kind words! Knowing she doesn't have too much time left definitely multiplies my patience. She can basically do no wrong at this point. I am determined to make her remaining time with me as pleasant as possible.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "We recently lost our 14 year old terrier mix. She was the sweetest little thing and a wonderful companion. The last year of her life was difficult with bladder and occasional bowel accidents.  We put down training pads in the bathroom and most of the time she was able to get there even if the doggie door to the garden was too far for her elderly muscle control.  I would have put the pads in every room if necessary.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I'm so sorry for your loss. These little munchkins really get in and under our skin and leave such a hole in our hearts when they go. I completely agree that I would gladly cover my entire apartment in puppy pads if it would mean keeping her around longer.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "I think you need to consider what future you do or don't see with him.\n\nDo you need this relationship to be \"going somewhere\". Would you want to live together someday?\n\nBeacuse not being willing to live with untrained dog in a health hazard of a home is a very normal deal breaker. I sure wouldn't be okay with that. And I'd never ever ever let my kids live like that. Pee and poo all over regularly is actually one of the things you can get CPS removals over. It's normal. And it's not clean or safe.\n\nSo where is this going? \n\nAlso, when you don't do what he wants he runs to his mommy and daddy to tell you off? Ooof.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Even if there were for some reason no dogs tomorrow, do you really want to be in a relationship with someone who lives like a pig? I have trouble believing he’s not dirty in other ways.",
              "id": 97,
              "comments": [
                {
                  "score": 7,
                  "content": "My initial thought was that OP is dating a hobo. Then I decided I was being unfair to hobos, who at least have an excuse for living like this.",
                  "id": 98,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "What's going on is you're dating a someone far below your standards. YTA to yourself for putting up with this so long.",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "This reminds me of the bf who was pissed that his gf wanted him to leave his cat at home after it clawed her in the face while she was sleeping. (Cat also tore up the house, howled, etc.)\n\nJeez... I hate it when people don't train their pets! It's a deal-breaker for me.",
              "id": 100,
              "comments": [
                {
                  "score": 3,
                  "content": "That lady ended up in A&E when the cat scratch on her face turned septic. \n\nI wonder if these dogs understand that they are not to bite humans.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I don't think they do. They are probably playing like they would with another dog (who has fur and thicker skin). I had to teach my cats as kittens not to play with teeth or claws. They will wrestle and nip with each other, but not me. They won't even use claws with toys as long as I hold them. And training them only took me saying a forceful \"no\", dropping the toy, and ignoring them for a few minutes.  Then positive reinforcement when they played nicely.\n\nAll most pets need is routine, consistency, positive reinforcement, and negative disengagement. Understanding their body language helps. And creating a love language they can understand is best. My love language is butterfly kisses and \"good boy\" \" good kitty\" . If I make air kisses or call them good boys, they will start purring, even without pets. \n\nSorry for the rant. I love animals.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Did he seriously run to his parents to have his back?!?! 😂",
              "id": 103,
              "comments": [
                {
                  "score": 3,
                  "content": "At 40 years old?!",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Him being a bad dog owner isn't restricted to that one area of his life, it just takes a while to see where else it bleeds over. Like being an agressive driver or treating service workers poorly. You might not see how it affects his relationship with you now, but in time you will.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "Honestly fr. I'm not anti-dog or anything, but I've seen dog people give someone a hard time for simply saying she was afraid of dogs. Like, she can't help being afraid? She just doesn't want to be around them, why is that so bad? \n\nDogs can be destructive and yes, sometimes scary. Not everyone has to want to be around them all the time.",
          "id": 106,
          "comments": [
            {
              "score": 65,
              "content": "Right?! Like I love giving pats to a nice dog at a park or whatever but I don’t want to own one because they’re a massive commitment, or at least they should be if you take care of them properly. People act like you’re Cruella de Ville cause you don’t want a smelly animal licking your face with the same tongue they use to clean their own ass. No thanks…",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Seriously. He also tattled on you to his parents. If you stay in this relationship, they'll know every thing you do that he doesn't agree with, straining things even more. NTA.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "For real. He's not going to change. This is what you have to look forward to for the rest of your life. \n\nEnd it. It won't get better.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Bad pet owners make bad partners. I will always believe that.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "> Dog people can be nuts and for some of them, not being willing to totally overthrow your life to accommodate their pets makes you a “dog hater”. \n\nI've tended to notice:\n\nI *don't* think I actually **hate dogs**.\n\nI just **hate people who love dogs**.",
          "id": 111,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "This man is not responsible at all and the pets have no choice to be apart of him life but this is your signal to leave. He is showing you who he is and you don't like it.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "The dude is a grub. Don't date grubs.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA - he lives like a slob and if your relationship goes further and he moves he will have no regard or respect for your things a d space.  He doesn’t even respect you enough to clean up his space so you can stay over there.  If you had to replace the carpet with hardwood flooring already it will only get worse. Also did he chip in for those repairs? I would leave him and his dogs .",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I could see this kind of thing being a little more excusable at 20 but a 40-year-old living in squalor with 3 untrained dogs is a major red flag.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1231,
      "content": "NTA but please tell me what redeeming qualities are keeping you with this unhygienic human? I mean, the things you're describing are so gross.",
      "id": 116,
      "comments": [
        {
          "score": 303,
          "content": "[deleted]",
          "id": 117,
          "comments": [
            {
              "score": 55,
              "content": "Imagine this guy 20 years from now when he decides to neglect his own hygiene.",
              "id": 118,
              "comments": [
                {
                  "score": 41,
                  "content": "I wouldn’t trust that he’s washing his crevices properly *currently*",
                  "id": 119,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 143,
          "content": "This. OP, you see how this guy lives. How do you think he's gonna be when you eventually move in together? He's not gonna go from being an unhygienic slob to maintaining a clean home overnight.\n\nI know ultimatums are usually advised against, but honestly at this point I think it's your only choice. Tell him to train the dogs and clean himself up, or you walk. Or just break up with him outright. This is clearly a dealbreaker for you and it's not going to improve without some drastic changes.\n\nEdit: For some reason I assumed OP and the BF were younger, but upon double checking I noticed the BF is 40 YEARS OLD?! Seriously?! This is a grown man living worse than a teenage slob! OP, I take it back, don't even bother with an ultimatum, just do yourself a favor and get out of that mess. This man has a lot of growing up to do.",
          "id": 120,
          "comments": [
            {
              "score": 55,
              "content": "And the always-telling side-note: why are a forty-year-old man's PARENTS involved in this conversation at the end of the post? Why is she hearing their views on the matter? He is a fully-grown adult and he's referring to his parents as backup in a relationship argument. Bad sign.",
              "id": 121,
              "comments": [
                {
                  "score": 21,
                  "content": "I guess we know why he can't find someone his own age.",
                  "id": 122,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I think I knew a few people that lived like this when we were all 17-21 and fresh, broke college students or first-year apprentices.  At 40 it's unacceptable.  I say this as someone who loves animals and doesn't mind a bit of a mess.  This is well beyond \"a bit\".",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "I know! What on earth does he bring to the relationship that could possibly outweigh living in squalor and untrained dogs that destroy all your stuff?",
          "id": 124,
          "comments": [
            {
              "score": 3,
              "content": "Tbh, when I see women who date men like this who are noticeably defective, it says to me that the woman needs therapy. Something has happened in her life to make her believe that she needs to just accept whatever bullshit comes along with the man who is interested in her. Just because a man “picked” a woman does not mean the woman needs to accept!! I read far too many posts from women who have no standards at all for the men they allow into their lives and inside their bodies. He would have invited me over ONE TIME and I would have dumped him. Beyond the fact that he’s 40 and living with roommates—that would have been a dealbreaker for me right there honestly—I’m just at a different stage in my life than that. \n\nOP! Honey, please listen to me. The reason that young women date older men is because these men are financially stable and have their shit together. You seem to have missed that memo. Why give this chump the gift that is your youth, beauty, and responsible nature (obviously you own your home as you changed the flooring; he’s older than you & renting with roommates) when he doesn’t deserve it? Please, take a long look at yourself and ask why this is what you think you deserve. You feel you deserve a man who lives in squalor, who allows his dogs to destroy your home, tattles to his parents regarding your relationship, lives with roommates at 40 years old, doesn’t respect you or your home—and I’m sure he expects sex. I cannot imagine how you haven’t gotten an infection yet. I’m worried for your health. Honestly. Wake up, OP! You deserve more.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I recall recently watching one of those British cleaning shows where this chick let her dog run rampant. He shat under her bed etc\nThere was e-coli everywhere. \n\nI let my dog sleep on top of my bed sometimes. All sheets get washed once a week. She's never in the sheets. I'm not super hygienic and the fur is ridiculous but OPs boyfriend is a whole other level of unacceptable. NTA",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "He's 40. Leaves with a roommate. And still manages to get independent women 10 years younger. One can only imagine the amount of charisma in this guy, he's probably a high school hunk these women can finally have...",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Ambitiously described \"human\"",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 714,
      "content": "My family loves dogs so hard. *SO hard.* My father has all but *said* he loved some of his pups more than his kids and I not only believe it, I'm ok with it.\n\nDogs had the run of our house growing up. As they got older he let them sleep in the bedroom, sometimes on the bed, definitely on the couch. \n\nWhat I'm saying is, we definitely lived in a dogs everywhere kind of house and we def don't hate dogs\n\nGuess what? We still *trained* our dogs, because everyone living in a house needs to have manners and boundaries, and that includes the four-legs, so that we can all live in a nice civilized way\n\nAnd we *washed* stuff and put down dog blankets, and protected things from them destroying it, and cleaned the couches and shampooed the carpet so that it didn't smell like a dog den. Well, it probably did a bit, I assume we were nose blind at some point, but we still kept stuff *clean*. \n\nSounds like your BF sleeps in a kennel more than a bedroom and he's insane if he expects you to let your house become one too. NTA",
      "id": 129,
      "comments": [
        {
          "score": 484,
          "content": "This is how I feel. It really hurts my feelings he won’t make the bedroom at his place comfortable for me. And then would get mad I never stay at his place and he always has to stay at mine. I grew up with dogs too. But fuck man, we didn’t live like animals.",
          "id": 130,
          "comments": [
            {
              "score": 188,
              "content": "Are you sure he’s not a dog in a human suit?\n\nI joke, but seriously, it sounds like he’s living like an animal instead of with them.",
              "id": 131,
              "comments": [
                {
                  "score": 78,
                  "content": "When she got to the part about how torn up and ripped his dog bed bed is, I was starting to wonder if he hadn't actually torn it up himself.",
                  "id": 132,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 62,
                  "content": "Dude is 40 years old? This isn't a quirk, it's a personality trait. He's not going to wake up and magically decide to be different, especially with how he's reacting to you setting boundaries.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah, he's not going to change.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "My boyfriend and I have 4 pieces of art on the wall of our dogs, we met through our dogs, we trip on bones and horns all the time, we pay for nice food, we have spent thousands on dollars on knee surgery for a dog.\n\nThey don't sleep in out bed, it's the one place safe from dog hair. We clean frequently. Our dogs have never intentionally peed or shit in our house and any accidents (excited pee) are cleaned immediately and mitigated as much as possible by doing exciting greetings outside. We have a robot vacuum. We own a variety of hair removal devices for clothing and furniture. We have couch covers that can be easily washed.\n\nWe train our dogs, we set the environment up so we can easily keep the space clean and we clean up after then to have a nice space for everyone.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Is it such a complaint, when he now gets to live a comfy OP-provided non-craptastic furnished & marinated meat catered & shit cleaning up life at yours instead?",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Why are you dating a red flag? Run and don’t look back.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Does his clothing stink of dog too?",
              "id": 138,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "His room sounds disgusting. I would have noped out of the relationship if he refused to change that. He would want you to live like that if you moved in together and fuck that!",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "For him to make the issue you not loving dogs or even hating dogs is unfair. If you grew up with dogs I'm sure you love them. \n\nThese dogs are not untrained, they ARE trained.. Trained to piss on the floor and be menaces because they haven't been told it's wrong. Training dogs isn't cruel, they enjoy it. It's stimulation and they can get a treat. I see people with untrained dogs all the time, and the dogs are unhappy/stressed because they don't understand the parameters to follow to not get in trouble. \n\nI wonder if you're partner grew up in a really strict household/school or was generally treated poorly by his parents..So he can't understand how enforcement of rules could be a good thing",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "He won't make it comfortable for you, but he'll make it super comfortable for his dogs? It looks like he looks down upon you even worse than dogs. He does not respect you at all.",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Hes wild, I have dogs and they are my world. But they are well behaved, potty trained, and I can take them somewhere without them destroying someones house. Also if you sleep with your dogs, thats fine. But you need to change your bedding a few times a week. Letting them destroy everything is unacceptable, and you shouldnt have to put up with that. Its really not hard to train a dog either, laziness is usually the reason peoples dogs cause chaos.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "> he won’t make the bedroom at his place comfortable for me.\n\nThis is not ok. He sounds like a crazy person who happens to put dog lives above human. I am a dog person and I think your boyfriend is crazy",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "SAME. Up until a couple years ago I had two large dogs that were my family for my entire adult life.  And they definitely slept in my bed.  But I washed my sheets regularly, kept my house clean, and they didn’t destroy my possessions and eat my friggin food.  Fuck that noise.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "> so that it didn't smell like a dog den. Well, it probably did a bit, I assume we were nose blind at some point, but we still kept stuff clean.\n\nSometimes i ask people when they leave our house if they aren't there often if my house smells like dog.  I like things to be clean though so the worst i've gotten is from my sister that said, \"I smelled bleach when i first walked in but maybe a little?  I mean, you DO have dogs\".  She's not one to speak kindly so that was probably the most honest answer and i felt better.  \n\nOur old neighbor came by one day to borrow something and stepped inside and was like, \"Oh, your house smells so clean!\"  YEAAAH BUDDY.  That's what i wanna hear lolol",
          "id": 145,
          "comments": [
            {
              "score": 2,
              "content": "I went to a friend's house and it always reeked of her dog as soon as you came in side. I'm so paranoid ( we have 3 cats). I will go outside and come back in multiple times to smell the house lol. Fabulousa purple is my favorite to clean with and the smell lasts. We also have a self cleaning litter box now. The smell is so much better!",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 371,
      "content": "NTA the parents are glad he’s found a girl who puts up with his dogs. And you should have kicked them out the first time you found pee on the floor. Better late than never though as they say. And they also say, good riddance to bad rubbish.",
      "id": 147,
      "comments": [
        {
          "score": 343,
          "content": "Ya it’s like dude if you love them so much why don’t you take better care of them? Training them is part of caring for them, right?!",
          "id": 148,
          "comments": [
            {
              "score": 127,
              "content": "You are absolutely correct.\nHowever, this relationship is not going to last. My husband and I have been married around 33 years and he has always had dogs and they were well trained. He’s kinda a dog whisperer. Two years ago we got a new dog, a dog I was absolutely against. We agreed on a medium size dog , one I could pick up to bathe by myself, as we are getting up there in years. The dog he insisted on getting is a freaking monster. She was getting food off of the counter top, she jumped up on the kitchen table, and she had accidents all the time. I said if she is in the house, she will be in a big dog cage with a tray in it. She had gas constantly and she would growl and bark every time I went near my husband. She broke out of her cage by biting the bars until she escaped, it took her all of 10 minutes to do that. We tried it again and my husband did his best to train her and it didn’t work. I said that’s it, she is now an outside dog. She still comes in the house to a new cage and the cage is on our big inside back porch. It has a wood stove and I don’t have to deal with the mess and smells every night. We’ve been trying to train her for over 2 years, and she will do what is asked of her to get a treat, but after 2 years she still keeps doing the same things that she knows is a big NO, if you just say her name she will stop for a minute and then turn around and do it again, over and over again. She is vicious to our son,DIL and grandkids. If the elderly lady next door, comes to talk over the fence, the dog will run as fast as she can and growls and barks at this little old lady who is as big as a 10 year old. The dog does this thing where she runs at top speed and plows into my knees and she has knocked me over so many times and it hurts so bad, then she starts spinning like a top and throws her entire body against you and I promise, you won’t be standing after that. After one of her spinning things, she threw herself into my husband and then jumped on top of him and was moving nonstop. He ended up all bloody from her nails and teeth, she wouldn’t get off of him, so I gritted my teeth and started growling at her, she jumped off and went and hid behind a bush. This is a common thing she does and I am fed up with her hurting us.  She has ruined more pieces of machinery by pulling wires off, pulling fuel lines and then she licks anything that smells like oil. She demolished our generator and it can’t be fixed and we can’t afford another one. I told my husband that it’s me or the dog, and he started crying and begged me to let him keep her. I finally gave in, but I told him that he had to get a handle on her. I made him get a shock collar and it doesn’t faze her.\nWe can’t afford a dog trainer, so I am stuck with this monster. I told my husband that if anything ever happens to him, after I get home from whatever service there is, I will make sure that the dog joins him in eternity.\nThis dog should have gone to some big young guy with lots of energy. The day my husband insisted on this dog, is the day he made sure that this dog will be gone before it’s time. I can’t handle her, she hates everyone except my husband. Having an untrained dog in your life is miserable. A well trained dog is a part of the family. It was a sorry day that this dog came into our lives. \nIf you are not happy with his dogs, forget about a long term relationship. I wish you good luck",
              "id": 149,
              "comments": [
                {
                  "score": 124,
                  "content": "OMG, this breaks my heart. I'm so damn sorry to read this. Your husband is a complete and utter AH. He's an ass to you and he's an ass to that dog. You're *telling him* that the dog has physically hurt you and is emotionally destroying your happiness. The dog is *showing* your husband that it's not happy with it's life. And yet your husband is completely ignoring the proof right in front of him and is selfishly insisting on his own way. What a self-centered turd.\n\nCall your local animal shelter. Sometimes they have free or reduced priced trainers. Next, call the vet. If you can't physically get the dog to the vet, maybe a mobile vet (urban area) or large animal vet (rural area) can come to your house. They might be able to suggest anxiety meds for your dog (honestly, this dog is so under-exercised that she gets anxiety from the constant buildup of energy without proper release) or proper training techniques. What I think they'll recommend is rehoming the dog. There are facebook groups about dog behaviors and humane training, but make sure to find the legit ones.\n\nRehoming the dog might be your hill to die on. I mean, your hubby is literally showing you that he doesn't care about your health, your happiness, your comfort, or your property. He's choosing this dog (that he's not even treating well!) over you. This dog needs to go to a rescue because you don't deserve to be in an abusive relationship with an untrained animal and his enabler.",
                  "id": 150,
                  "comments": [
                    {
                      "score": -57,
                      "content": "It is her boyfriend not her husband. The man has his own house which is filthy. He brings the dogs with him when he stays the night.. \n\nAlso taking someone's pet in many places is considered theft as well as animal cruelty.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "That's rough and I know how it goes. My dad was also a dog-whisperer, and there honestly wasn't a dog he couldn't turn into a sweetheart - abused dogs, rescues, strays, you name it, he could manage them - except one. \n\nShe was was never aggressive with us directly, but in every other way she was impossible, even though we raised her from birth. The fact was that because of breeding and just the random chance of her personality, it was the wrong situation for her. She was full of anxiety and energy that had no outlet and we couldn't give it to her. So we rehomed her to someone who could, not just because we were unhappy, but because she was too. \n\nYour husband should really consider that if your dog is acting like this *she's* not happy either. It's not wrong to rehome a dog when you cant meet their needs however hard you try, so he's not only being selfish to you, he's also faililng whatever responsibility he feels he has to the dog (which is I assume why insists on keeping her). He needs to accept that he can't whisper this one, and figure out how to send her to somehwere she can be happy.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "That dog needs put down. My family took in a Boston Terrier with similar issues - it tried to tear a gate off a wall to get into a room with smaller pets, and did this thing where it would sit and glare at you and if you moved or looked at it, it would run over and attack you. It was brain damaged and, after trying everything we could, we gave it back to the people who gave it to us and it was put down after biting all of us at least once.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 7,
                      "content": "My dogs are literally my entire world and the reason I’m alive. I adore dogs. But I totally agree, something is not right here and I suspect maybe brain damage. Of course I’m just a stranger on the internet and no expert but this is seriously not ok, dangerous, and awful for everyone involved including the pup. So sorry you’re all going through that.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I’m afraid to say it’s probably time to put it down.  If that dog attacks anybody outside of the two of you, you will be sued, especially since you knowingly harbor a dangerous dog.  It’s too bad, but it’s definitely for the best.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Ding ding ding! \n\nYou know exactly what this dog is capable of. I know hubby loves him, but ask him how he will feel if she harms someone he loves? Kills them?",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Umm you mentioned your husband is a dog whisperer but this dog isn't well trained or even trained at all?\n\nI'll tell you right now that paying for a trainer means crap all if the owner isn't willing to do anything about it (read: follow through with rules). Trainers are NOT a silver bullet to correct a bad behaving dog, actually professional dog trainers train the human moreso than the dog.\n\nI don't know how intensive yours (and husbands) attempts are to train her because I don't know your situation but 2 years with no progress doesn't sound like whatever you're doing is working, maybe it's time to reassess your training techniques instead of giving up. I'm not including a shock collar because those are known to be cruel and horrible training devices (I'm not a professional dog trainer though).\n\nI don't see you mention how often your dog is being walked, I hope she is getting physically and mentally tired *daily* because otherwise it's going to get redirected into destructive behaviour. \n\nYou sound miserable and it's taking a toll on your life. I genuinely hope there is a light at the end of the tunnel. Happy to chat more about your situation if you like, because I've made a lot of assumptions",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Uhhhhh you should be aware that this dog is an absolutely massive financial **and legal** liability. You have absolute knowledge she's aggressive and has a history of harming people. One day she's going to knock down and mangle someone that she's going to straight-up **maim**.\n\nThis is absolutely a hill to die on. I love dogs, but hell to the fuck no if she's that aggressive especially if you're saying she's that vicious to children. She could kill one.\n\neta: LEGAL liability as well. There could be criminal charges here if/when this dog hurts someone since they're aware of her aggressiveness/prior incidents. That makes it an issue you're aware of and have not rectified which puts you square on the hook.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Exactly.  Their children and grandchildren will attest to that in court when they get sued.  Thank you for pointing out the financial liability, they’ll lose everything just for one dog.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I am so sorry you’re going through this.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "As I was reading this my head was screaming, \"Malinois, Malinois, MALINOIS.\"\n\nAm I right?",
                  "id": 161,
                  "comments": [
                    {
                      "score": 22,
                      "content": "At this point a Malinois would probably be easier. This dog is a boxer pit bull mix. We’ve had pit bulls for over 20 years and they are wonderful in every way. I’m afraid it’s the boxer that makes her like this. We’ve got several acres and she runs about an acre and 3/4. I am of the belief that she has some kind of brain damage. We got her from one of those places that saves dogs that would otherwise be put down, she was 61/2 months old when we got her. Several of the dogs there were really aggressive, a dachshund bit me while we were there and some were put away because they were too aggressive. I don’t know if it’s possible for animals to have brain damage or mental disorders, but she isn’t like any other dog we’ve ever had.\nEveryone who has seen her in action, has asked me why we got a dog that was nuts and so frickin mean, and I tell them to ask my husband. Of course they won’t, because he is crazy about her and it shows, even though every single day he comes back in with another scratch, or a place where she nipped him. He’s on blood thinners and it’s always a mess.\nI think something is wrong with her.",
                      "id": 162,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "What does that even mean?",
                      "id": 163,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Stories like this are why we as a society need to be more comfortable rehoming animals. And being incredibly realistic with ourselves and our abilities. If you take in a dog that you can't handle, the humane and kind thing to do IS REHOME IT. Don't keep a dog you resent cuz you feel you're failing or whatever. There's someone out there that could be giving it the life it needs and you are actively denying the animal that by stubbornly keeping it.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "You should head over to https://www.reddit.com/r/TalesfromtheDogHouse/\nfor more of this…",
                  "id": 165,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "Training them is VITAL to caring for dogs. He doesn't respect you, he doesn't respect his dogs, and IMHO he needs to go. OP is NTA",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 183,
      "content": "NTA, and honestly if he can't find compromise and actually take the time to clean up after himself (it's the least he could do) and train his dogs, you guys should split. Like, I'd be losing my mind if it was someone I couldn't even *live* with that I'm together with, no matter how much I liked them u_u\" \n\nAlso his parents need to understand dogs need training and you've set boundaries for yourself (the need to clean up). It's important you keep those boundaries because you know what's good for you, and you shouldn't be treated like some housemaid either. Sorry to hear about this whole mess though.",
      "id": 167,
      "comments": [
        {
          "score": 150,
          "content": "Well the other thing is I have 3 kids that like to play on the floor. It’s just unacceptable. And his parents live the same way.",
          "id": 168,
          "comments": [
            {
              "score": 278,
              "content": "Then why are you with this slob? Is he really a suitable partner for a person with kids? Or any human being that thinks stepping in shit constantly is unacceptable?",
              "id": 169,
              "comments": [
                {
                  "score": 121,
                  "content": "Good question",
                  "id": 170,
                  "comments": [
                    {
                      "score": 121,
                      "content": "Tell him to be a good boy and *stay*...home, in his own apartment from now on.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 73,
                      "content": "you’re an AH to yourself and your kids by enduring this man and his parents. you deserve better.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "NTA.  This guy is disgusting.\n\nYou are allowed to have standards.  Dating is an audition where you interview someone to see if they are relationship material.  Basic hygiene is the lowest bar to pass and this guy failed.  He should have been dumped the moment you saw his living conditions.  His later actions only prove he's not boyfriend material.  No matter how much you like someone, they obviously don't like or respect you, if they demand you live in filth and show no remorse for damaging your home.\n\nYou deserve so much better.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "For stories of others with similar issues…\n\nhttps://www.reddit.com/r/TalesfromtheDogHouse/\n\nSad that a separate sub exists because the issues you’re having with BF’s dogs is not unique…",
                      "id": 174,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "How is he with the kids? Does he clean up after them or is that all what you do, and then you have four kids in the house?",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 141,
      "content": "God help me you guys are hilarious.",
      "id": 176,
      "comments": [
        {
          "score": 66,
          "content": "If you’re NTA, this place turns into a fantastic roast of the Assholes. \n\nIf YTA, this is Hell.\n\nIf ESH, this is still Hell but more of a dumpster fire.\n\nIf NAH, this is purgatory and things can easily be made better with proper communication and understanding.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "You are NTA about the dogs. However…\n\nYou don’t let your cats inside? Do you live on a farm? Are they barn cats specifically around to hunt pests? If not, you’re a huge, gaping asshole. Cats deserve love and snuggles and aren’t safe outside. Let your pets inside.",
          "id": 178,
          "comments": [
            {
              "score": 20,
              "content": "Hi. Cat rescue person here. Second what is said about the barn. Even then, I’d hope it’s temperature controlled barn, the cats are fully vaccinated and spayed/neutered. \n\nOtherwise: the amount of cats which I’ve seen hit by cars, burnt alive by people or otherwise abused, stolen, contracted deadly and highly contagious diseases from the soil (panleukopenia), eaten by other wild animals or mauled by dogs, lost and ended up starving to death, having kittens because they are unfixed (then all the kits dying either by the elements or animal control)… getting poisoned from a neighbor… Or getting poisoned by eating a mouse/rat that was poisoned. Or tetanus and ending up completely paralyzed. Do I really need to go on here? Because I can. \n\nKeep your cats inside if you care about them. If you don’t think you can do this, I’m happy to help you find another place for them. If they are barn cats and you need help vaccinating and spaying them, please let me know and I am happy to connect you to resources in your area. \n\nTo anyone else reading this, please consider fostering a cat if you are able to.",
              "id": 179,
              "comments": [
                {
                  "score": 15,
                  "content": "Yes they’re all spayed/neutered and vaccinated. It is temp regulated. And I only have 2 not 10.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Glad to hear that you are a responsible barn cat owner!!!",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "They are barn cats and have a nice warm place to sleep and are very well taken care of. I have a small farm in the country.",
              "id": 182,
              "comments": [
                {
                  "score": 3,
                  "content": "Happy to hear. =)",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 126,
      "content": "Ma'am 9 months of boyfriend is not enough time to replace flooring in your house for. This is his normal, his baseline. Please consider other human options.",
      "id": 184,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 116,
      "content": "You guys have a few areas of incompatibility… (not just about living with several dogs). You two can’t seem to mesh on compromise, communication, or even basic standards of cleanliness. You’re NTA but someone’s gotta go… neither of you are going to budge. (*And you shouldn’t! His entire life sounds gross!*)",
      "id": 185,
      "comments": [
        {
          "score": 51,
          "content": "It is",
          "id": 186,
          "comments": [
            {
              "score": 29,
              "content": "What are his redeeming qualities?",
              "id": 187,
              "comments": [
                {
                  "score": 29,
                  "content": "Honestly I don't know if it matters at this point. Training 3 dogs at this late in the game is going to be a ton of work and effort. This guy sleeps on a torn up mattress and made her pay for the remodel that *his* dogs caused in her house. Whatever his redeeming qualities, this seems like something that's going to cause resentment and frustration. They clearly have highly different standards for living.",
                  "id": 188,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "\"A few areas of incompatibility\" might be the understatement of the year.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 84,
      "content": "NTA. Please, please TRAIN YOUR DOGS!!! If you are bringing them into a home of a none dog-owner/ non pet-owner there needs to be some basic commands they respond to. Their home ain't your dogs' home nor should you think it's okay to treat borrowed spaces like they're your own. That's not how that works. \nOP, did he even help you pay for the new flooring?",
      "id": 190,
      "comments": [
        {
          "score": 63,
          "content": "Fuck no he didn’t lol",
          "id": 191,
          "comments": [
            {
              "score": 126,
              "content": "Not to be a cynic, but maybe it's time for a new bf.",
              "id": 192,
              "comments": [
                {
                  "score": 147,
                  "content": "I’m thinking after reading all of this and coming to the realization he’s not respecting me at all here that you may be correct",
                  "id": 193,
                  "comments": [
                    {
                      "score": 76,
                      "content": "I'm sorry you have to work through this level of foolery.",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Drop him and the dogs off at a shelter?",
                      "id": 195,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Our dog is fairly well trained but I’ll be damned if I could leave a plate of ribeyes out alone. I think owners and dog need training.",
          "id": 196,
          "comments": [
            {
              "score": 3,
              "content": "I grew up with labs, hunting dogs. They would never, ever do this. I know some dogs do and so the owners just get used to putting things up out of reach.",
              "id": 197,
              "comments": [
                {
                  "score": 4,
                  "content": "There are definitely dogs that can be trained to leave food but also I think there’s got to be some common sense as well.  We have a Great Dane and he has never so much as glanced at stuff on the counter before last week (2 years old).\n\nHowever, in a crime of opportunity he discovered an unattended pat of butter and decided on a life of crime.\n\nAt some point the reward is greater than the risk and for many dogs an entire plate of steaks is a pretty big prize.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}