{
  "post content": "I’m a teenager, and during COVID while I was at home I began to learn baking as a way to relieve stress. One of my favorite desserts is brownies. I started with a very basic brownie recipe, but slowly I’ve made it more and more elaborate to achieve ultimate chocolate fudge status. \n\nI do not really bake with anyone else in mind. I just like trying recipes. Most of the time it’s a treat everyone can enjoy, but sometimes one of my three family members won’t like what I made.\n\nAt some point along the way, I watched a 100-hour brownie recipe and got the idea to start adding decaf coffee (I can’t do caffeine for other reasons). I tried it, it was delicious, and my mother and brother absolutely loved it. My father didn’t know what it was and ate them too, but when I revealed my “secret ingredient” was coffee, he got really upset. \n\nEver since then, every time I make brownies he asks me to take the coffee out. I tell him no because it’s my recipe (that’s the part where I might be a total AH—I’m kind of stubborn about it). It’s not like it stops him from eating them. He ate 1/2 of a 9” pan in less than 24 hours last time (with coffee). \n\nLast night my college quarter ended, so I specifically made MYSELF a pan of brownies in celebration. Of course, everyone was welcome to share my celebration. \n\nFor some reason, that particular night my dad simply got absolutely ticked that I wanted to add coffee—a little more of it, actually, and some dark chocolate, since that’s really what I’ve wanted to do. I tried to reason out that these were brownies for me really, but he just got more and more angry (I want to say whiny, but that feels mean). \n\nI added extra coffee anyway and baked them. Pure chocolate heaven! Best brownies yet. Denser than a black hole. Delicious. \n\nThis morning he was very upset because he tasted the coffee and told me he was hurt. He then took 3 brownies from the pan and returned to his office (I’m not shoving them down his throat..?). \n\nSomeone told me to just separate the batter into 2 bowls and bake them with and without coffee, but I usually can’t afford to double the recipe and I don’t have half pans. I also don’t want to end up in my mom’s conundrum—when she cooks, she almost always has to prepare two separate dinners (one for the rest of us, one for my dad without spices/onions/‘weird sauce’ and usually more centered around cheese/Taco Bell fire sauce/tortillas. Basically everything is a burrito). My brother and I help her out with cutting and prepping dinner since we’ve both gotten into cooking (and helped her get over her fear of us holding knives—thanks Food Network!). Still, though, it’s tedious to make a Bland and Good variations of a dish every time. Also doubles the leftover containers. \n\nAITA for adding coffee to my brownies knowing that my Dad (1 of 3 other people in my house) hates coffee?\n\nEdit: recipe https://www.reddit.com/r/AmItheAsshole/comments/jxs9nx/aita_for_adding_coffee_to_brownies_despite_my_dad/gcyrne9/?context=3\n\nEdit for Update: I made cinnamon rolls for my dad instead because I didn’t want to remove coffee from my brownies. For the recipe, go to [The Recipe for Cinnamon Rolls my Dad Actually Likes](https://www.reddit.com/r/Baking/comments/k99711/cinnamon_rolls_that_my_dad_actually_likes/?utm_source=share&utm_medium=ios_app&utm_name=iossmf).",
  "id": 1,
  "comments": [
    {
      "score": 4114,
      "content": "Your dad hates coffee, but he's eating the brownies. If he didn't eat the brownies, I could understand his request for no coffee, but he eats them!\n\nI'm not a coffee fan either, but for some reason I love mocha ice cream and tiramisu. Go figure.\n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 912,
          "content": "My only thought is maybe he’s worried about caffeine? Which, if you’ll be eating three super rich heavenly brownies, sounds like the least of the health concerns there. He could also be that most disliked of picky eaters: the kind that will happily chow down on something until they learn there’s a specific non-health-problem-related ingredient and will then refuse to eat it.\n\nEdit: yes, I know OP said they use decaf. The father doesn’t seem to be the smartest bulb in the box.",
          "id": 3,
          "comments": [
            {
              "score": 806,
              "content": "He's totally *that* type of picky eater. Ffs, the mom has to make Good and Bland food every meal. He's a grownass man, and it's about time someone put a stop to his whining.\n\nOP, next time he complains, take the whole pan with you. NTA.",
              "id": 4,
              "comments": [
                {
                  "score": 218,
                  "content": "I never understood these types of picky eaters. I'm totally a picky eater and eat the blandest food available, I'm literally having dry saltines as my snack right now. But I don't force that diet on other people! If I can't eat it, I'll make my own.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Same! I'm autistic and my diet is comprised mostly of grains and dairy, and I gave up meat when I was a kid. But I never force that on other people- the only time I expect to get full say on what's for dessert is my birthday.\n\nAlso, I have to say, those brownies sound delicious, OP! Brownies are the most underrated dessert IMO and a little coffee (even though I also dislike coffee) can go a long way in them!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "I'm not a picky eater but both my nephew and I love dry saltines as snacks",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "[deleted]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Have you tried oyster crackers? They're little hexagon saltines that are perfect for munching.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I've grown fairly out of my picky eating and I sometimes have dry saltines as a snack because sometimes dry saltines just slap",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Exactly! Picky eating doesn't have to ruin other people's day! I'm a notoriously picky eater, but my brother and friends love eating with me because I constantly give them my left overs. Literally the other day I wanted to try something new on Uber Eats, but I knew it'd be a gamble so I ordered both the new thing and a classic I know I love. I knew that even if I didn't like the new thing, my roommate would be happy to finish it for me. And finish it they did, since the new thing SUCKED.\n\nTo be fair, my roommate also said it was pretty bad, but they finished it anyway.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "NTA. My mom is one of these picky eaters. I can make a list of what she will eat because its shorter than what she won't. It can make cooking or trying new foods a challenge because she either won't eat it or cut the majority of the ingredients until its not even the same dish anymore and makes the food redundant. \n\nEither he can get over himself since its obvious he likes it or you can hand him a box of Betty Crocker fudge brownies and tell him the recipe is on the box, make it yourself.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Seriously, mom has to put the brakes on that. She makes one meal, and people can eat it or they can fix something for themselves. \n\nGiven what we've learned of dad, I bet he eats all those nasty onionses.\n\nOP, NTA. Next time he whines, tell him you'd rather him not eat any, if it's such a hardship.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My dad and brother are those types of picky eaters too. It's ridiculous. My mom has made meals for her, my sister, & i before. They've came in smelt the garlic and onion & acted like it was the worst thing/smell in the world. Like what? They eat zero spices & barely any fruits or vegetables.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 219,
              "content": "Everything I do is decaf, and everyone in my family knows about it (caffeine is an issue for me, although the trace amounts in chocolate/decaf don’t affect me).",
              "id": 15,
              "comments": [
                {
                  "score": 255,
                  "content": "Coffee actually enhances the flavor of chocolate.\nSource: I'm a professional cook.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 45,
                      "content": "It does! I’ve added coffee and cocoa powder to smoothies and it tastes so much better than when I just use cocoa powder",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "I just wish that chocolate pastries that have coffee added to the would be properly labeled as Mocca. I HATE coffee, even in my chocolate, and I can taste it every time. You have no idea the dissapointment of ordering a piece of chocolate cake and only taking one bite out of it.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "As long as the amount isn’t too big, it’ll enhance it for everyone but supertasters.\n\nSadly, I am a supertaster.  If I buy chocolate baked goods, I ask if there’s any coffee in it first, because sadly I can usually taste it and I loathe the flavor enough that even a hint of it ruins foods for me.  Also, it messes with my health issues, which have gotten sensitive enough that I can only have a little chocolate.\n\nBut people like me are the exception, not the rule, and frankly I don’t expect anyone to accommodate me.  I just ask folks to be honest when I ask if there’s coffee in it, so I can avoid getting a mouthful of ick.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My go-to chocolate cake recipe has coffee in it and you cannot taste the coffee in it at all. It just helps to make a super rich chocolate cake.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "For what it's worth I don't think you should have to make separate batches for his whiny ass, but if you decide you want to, you can do it in one pan by using greased foil or parchment paper (also greased).\n\nYou take a too-large piece of foil and line the pan with it, then take a second piece and make a sort of a W with it so that the middle fold is in the middle of the pan; shaped to the pan, not literally an upside-down triangle, of course. Then you pour the batter with coffee in it on one side, the batter without on the other. Make sure the outer wings are tall enough to stick up over the edge of the pan, and fold over one corner sharply on itself like origami to keep track of which side is which.\n\nNTA, of course.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 46,
              "content": "Chocolate has caffeine as well, although not as much as coffee. And if he were worried about the caffeine, he could ask her to use decaf.",
              "id": 22,
              "comments": [
                {
                  "score": 171,
                  "content": "Here's the thing though, she already is using decaf coffee because she doesn't want the extra caffeine either.",
                  "id": 23,
                  "comments": [
                    {
                      "score": -16,
                      "content": "Yeah, I was ready to YTA over the surprise caffeine until I saw it was decaf. I know it has a little, but not so much that you'd really notice.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "It's already in the post she uses Decaf.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "They said they’re using decaf already, so the only caffeine comes from the chocolate",
                  "id": 26,
                  "comments": [
                    {
                      "score": 6,
                      "content": "There is actually caffeine in decaf coffee. It's usually only about 7mg or so compared to the like 70+mg in regular coffee, but it's enough to affect people with sensitivity to it. Source: I'm allergic to caffeine",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Decaf still has caffeine in it, just not as much as regular.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "He/she stated they use DECAF so there goes that excuse lol..",
              "id": 29,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "> caffeine?\n\nOP says its decaf!",
              "id": 30,
              "comments": [
                {
                  "score": 6,
                  "content": "also...whats the recipe?",
                  "id": 31,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Recipe is in the comments somewhere. Is there a way for me to pin it or somethin’?",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "OP always adds decaf coffee, so that cannot be it",
              "id": 33,
              "comments": [
                {
                  "score": 0,
                  "content": "There is caffeine in decaf.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Eh. There's reasons to care about caffeine but also be able to eat unhealthy foods. I don't avoid caffeine for my health at all, but I do have to be careful with it, because it interacts with medications I'm on and turns me into sonic the fucking hedgehog. Gotta go fast, indeed.\n\nNot really defending the dad here, since OP even says below that they used decaf coffee in the brownies, more just the concept of people wanting to avoid caffeine, but still eat junk food.",
              "id": 35,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "At first I thought “why would it matter if he eats the brownies or not”, but I see that it would kinda suck if every time she made brownies that her dad was unable to eat. Even though nobody’s entitled to her baking, if she regularly bakes things that she shares with the family, to exclude one family member every time would feel kinda shitty....\n\nBut he’s eating them!",
          "id": 36,
          "comments": [
            {
              "score": -22,
              "content": "If he didn't eat them, yeah, she'd be an a-hole. But he is eating them.",
              "id": 37,
              "comments": [
                {
                  "score": 60,
                  "content": "She would definitely not be an AH if he didn’t eat them. No one is entitled to the food that she makes for HERSELF and graciously shares with others if they want it. NTA he’s just trying to cause a fuss. He can make his own desserts and dinner for that matter, he has two hands.",
                  "id": 38,
                  "comments": [
                    {
                      "score": -14,
                      "content": "I think she still somewhat would be, but maybe it's because if I knew I was having people over for something, I'd feel absolutely awful if I didn't make something that everyone could eat, and I say that as someone who unfortunately has a dislike/intolerance for several common foods (for example, even a small amount of pepper in something can set off horrible cramps for me). Sure, it's not a gun-to-your-head obligation or anything, but it WOULD be a mildly AH move, which is what we're judging here.\n\nBut at the same time, that's kind of irrelevant, since this is clearly not a case of him just being totally unable to stomach the food and being more-or-less intentionally excluded as a result. They're not so awful to him that he can't eat him, he just doesn't like them as much as he otherwise would. So OP is definitely not NTA given the circumstances. If they're that bad, he doesn't have to eat them, and if there WERE that bad, there are much more polite ways to make the issue known.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "NTA, I also love to bake and I hate coffee I find the flavor to be bitter and gross.  But I also know that if I want to deepen chocolate flavor adding coffee will do that.  It also doesn't tend to leave a long lasting coffee taste as it's usually a small amount.  \nMy favorite chocolate mousse recipe calls for a fourth cup of espresso and it's amazing with no coffee taste.\nMy long winded explanation is if your dad had no idea coffee was an ingredient and only became angry after the fact then the issue is his.",
          "id": 40,
          "comments": [
            {
              "score": 18,
              "content": "This is spot on. I am also a coffee hater, never met a single sip that I enjoyed. \n\nI also put coffee in my brownies. It just deepens the chocolate flavor, to me, I can’t even taste the coffee. \n\nOP and their family need to stop catering to a full grown man who’s capable of making their own, coffee free brownies and tasteless dinners if they want to pitch a fit. NTA",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "NTA \n\nTell his ass to learn how to make them",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Like compulsively eating the brownies and drinking coffee while polishing off a half pan of them. OP this about control, not coffee.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Thats easily explainable. Theres a big difference between using something as an ingrediant and eating something by itself. People love vanilla flavor but you cant eat it on its own. Or love pizza but hate tomatoes.",
          "id": 44,
          "comments": [
            {
              "score": 2,
              "content": "Or being a kid and thinking that because chocolate is amazing, that eating a big spoonful of cocoa powder will taste great, despite mom's warning against it...",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Coffee used in chocolate cake also doesn’t make the cake taste like coffee. It just makes it taste more like chocolate. If they wanted a distinct coffee taste, they’d have to use an extract or a coffee cream/icing on top. \n\nIt’s likely that until the OP added extra coffee specifically so that they could taste it, the dad literally couldn’t taste it either. Case in point, he had no idea until he was told by OP the first time they made them.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I hate coffee and am always bummed I can't drink chocolate beers because it's always stout and is coffee based. (My one friend is like \"Try this one, it doesn't taste like coffee!\" but when you don't drink it... yes, yes it does taste like coffee.)",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Coffee enhances chocolate flavor \nSo really it’s like adding almond extract in to something with maraschino cherries for extra bump of flavor.\nDads just mad he didn’t get his way and he likes something he says he hates",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Coffee alone is yucky, coffee in sugary deserts is yummy. \n\nI like the idea of using decaf, I am very sensitive to caffeine. Going to give OP's recipe a try.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1335,
      "content": "Alright so people are asking for the recipe and not gonna lie, I’m very very very new to baking (less than a year), so I’m a bit intimidated. A little worried my taste buds might have lower standards for heaven, but here goes nothing. \n\nSo first and foremost, I’m not a culinary mastermind. I’ve pulled from a few sources, 97% from this link (https://cafedelites.com/best-fudgy-cocoa-brownies/) by someone going by the name Karina (Karina, if you’re reading this, you’re a genius and I love you). The 100-hour brownie recipe I watched/referenced is by Alvin Zhou (video here: https://m.youtube.com/channel/UCsdD3quGf01RWABJt8wLe9g), who makes absolutely excellent videos even if you’re not interested in making anything. I think there may be some little tidbits of advice I’ve pieced together here and there from others, and unfortunately I don’t have sources for those. :( \n\nRecipe: \n\nINGREDIENTS (prepping them listed in recipe below):\n—1/2 cup (1 stick) unsalted butter\n—1 tablespoon canola oil\n—1/2 cup + 1 tablespoon white granulated sugar\n—1/2 cup + 1 tablespoon brown sugar\n—2 large eggs\n—2-2.5 teaspoons (kinda dealer’s choice here) of pure vanilla extract\n—1/2 cup all purpose flour\n—1/2 cup (rounded-ish) unsweetened cocoa powder, usually I get Hershey’s (live near there)\n—1/4 teaspoon salt\n—1 cup of chocolate chips of choice (usually Tollhouse Semisweet) OR (luxury version for super deluxe special occasions) 1 bar of Ghirardelli baking chocolate (usually I do semisweet) cut into fun little chunks\n—anywhere between 2 teaspoons to 1 rounded tablespoon (lately I’ve been doing 1 tablespoon even) of Some sort of coffee grounds. I use Starbucks cafe Verona (dark roast) decaf because it was already in my cabinet, so it’s “free to me.” \n—Optional: 1 cup of mini marshmallows to toast on top (sometimes I prefer to leave these off, sometimes I really crave them. Depends)\n\nACTUALLY MAKING THE THING:\n\n—Preheat oven to 350° F. \n—Grease a 9x9 square pan with Pan for baking (has flour in it). Forgetting this honestly isn’t the end of the world, just harder to clean. I prefer stoneware, but metal obviously works fine. \n—melt the stick of butter in your large mixing bowl. For my microwave, that’s 2 rounds of 30 seconds. Might wanna put a paper towel or plate on top to make sure your microwave doesn’t get messy. It’s pivotal that this is HOT. \n—add your canola oil and sugars. Honestly I don’t always level off my sugars super well so extra doesn’t hurt, just as long as it’s not *too* much extra. \n—whisk this WELL, if you have a mixer USE IT. Do it for a full minute or until your gut says the deed is done. You want this as well-incorporated as possible, because this is what makes crispy brownie tops regardless of how fudgy the brownies are.\n—Add your two eggs (you can do both at once) and your vanilla (original recipe was 2 tsp vanilla, I usually get indulgent and add an extra 1/2 tsp). \n—SIFT in your flour, cocoa powder, and salt. Make the decision of whether or not to add coffee, and add coffee. Also add in your chocolate chips (save a bit to sprinkle on top). \n—S T O P. Listen carefully. This is what I mess up. You cannot go ham mixing this. You gotta fold it. Scoop under it with a rubber spatula like you don’t wanna wake the batter and then softly plop that on top and keep doing that until everything is *just* mixed. The more you mix after that point, the less fudgy it’s going to be. \n—pour/“plop” that chunk of batter in there, maybe take a few spoonfuls for yourself. Smooth it out a bit. \n-sprinkle on chocolate chips and marshmallows (optional). Marshmallows may make the top crust a little less crispy so keep that in mind.\n—if you’re using a metal pan, the original recipe recommends you bake for 20-25 minutes. I’ve never tried that. I use a stoneware pan, which I start at 30 minutes and then check if it jiggles in the center. No jiggles+crust? You’re done. Jiggles? Pop it in for five more minutes and check back. Honestly it doesn’t taste bad if it’s half raw anyway so just don’t burn it. \n—remove and let cool. I’m a huge fan of warm brownies, but honestly these taste better cooled and well-rested. \n\nIf y’all try this and find better ways to do it, please tell me your secrets! I’m still very very new to baking so I know what I do might not be the best solution.\n\nEdit: an award?!!!! With an animation?! Y’all are such sweethearts. Thank you, kind stranger. I hope the recipe is as good as I think. :)\nEdit 2: awwww!!! Y’all have made my day. Two awards! I wish I could bake you some brownies myself :) lemme know if any of you have questions or suggestions.\n\nExtra edit: holy smokes. Y’all know you made my day, right? I’ve been skipping around with a smile. This is way beyond the support I’d thought I would get. It’s been great talking to people who actually know how to bake well!!! Knowing so many want to try my recipe makes me feel warm fuzzies. Thank you all. Really.",
      "id": 50,
      "comments": [
        {
          "score": 211,
          "content": "I know what I'm doing this weekend. Thank you!!! Also, I seriously appreciate all the little tips sprinkled into the recipe, will make it much easier to follow!",
          "id": 51,
          "comments": [
            {
              "score": 103,
              "content": "Thank you! Lemme know if you like it!",
              "id": 52,
              "comments": [
                {
                  "score": 66,
                  "content": "Your writing style is great, I think this will be next week's unnecessary indulgence.   Thank you!",
                  "id": 53,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Awww, thank you! The fact that so many people want to try it warms my heart. Y’all have made my day. I hope you enjoy it. :)",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "This sounds totally awesome! If I can make a suggestion, you could try adding a little sea salt to the top after you take it out of the oven. I find it really helps to bring out the chocolate flavor.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I’ve got so many things to try, lol. This is 100% a baking thread now. I will add this to my “I gotta try it” list. Thank you so much!!! :)",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I love when recipe writers describe what NOT to do or why something has to be done a certain way.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "About a year ago I ate the best brownie I’ve eaten in my life.  And I love brownies and have eaten plenty.  It was a brownie that I had just baked.  [This brownie recipe from Stella Parks](https://www.seriouseats.com/recipes/2018/02/bravetart-glossy-fudge-brownies.html) is hands down the best brownies I’ve ever had.  I baked three batches that first week (most went to work with my wife) and that recipe is single handedly responsible for stopping my weight loss.  I’ve shared it with the mod team multiple times raving about them and converted a handful of them as well.\n\nIt’s a relatively simple recipe, but the results are phenomenal.  The only real secret is a few of the ingredients are pretty specific (you want a decent chocolate bar and a high fat content cocoa powder.  And the browning the butter is a little different but super simple following her directions.  The first few times I baked it I used the coca powder and chocolate I found in my local grocery store and whatever pan I had on hand, and it was amazing.  But getting the correct cocoa powder, chocolate, instant espresso, and the anodized aluminum pan took it an extra step up.\n\nStella Parks is honestly a baking goddess too.  My favorite vanilla cake is also one I made following her recipe.  Same goes with my chocolate Swiss mergangue buttercream frosting.  I bought her book recently (full of classic American desserts that really tap into nostalgia) and its similarly fantastic.  I know there’s other bakers out there, and I’ve followed plenty of other recipes, but if Stella had a recipe for something I honestly don’t bother looking anywhere else.",
          "id": 58,
          "comments": [
            {
              "score": 34,
              "content": "That sounds awesome!!! I’m gonna add this to my baking reading list (oh lord the list is getting long I’m gonna have recipes and experiments for like the next decade) thank you :)",
              "id": 59,
              "comments": [
                {
                  "score": 19,
                  "content": "You’re welcome!\n\n[And this is the classic vanilla cake](https://www.seriouseats.com/recipes/2017/05/classic-vanilla-butter-cake-recipe.html) if you’re interested.  That recipe really is the “totally simple” type thing.  It relies on being really precise about the ingredients and the temperatures, but the results are incredible.  Bringing your eggs up to room temp for that one, not over softening your butter and the like make a difference with it.  Every recipe on serious eats comes with that added explanation (on a separate page) of why it works; and that’s the one that really made me respect precision in baking in those things because I understood why it mattered.  I’ve baked that cake wrong before, thinking “eh, the batter is only a few degrees under the recommended minimum” and what she warned would happen if you did that did.\n\nIt also made me really appreciate having an instant read thermometer.  I use it all the time on meat, but I probably use it even more baking.\n\nHave fun!",
                  "id": 60,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I might need some more equipment (don’t think a temperature gun would work, would it?) but this sounds like a good time. :)",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I second Stella's work. She's phenomenal and her book explains the nuances of each recipe so well!",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Totally going to try this for the holidays! Thanks so much for sharing, you’re a hero!",
          "id": 63,
          "comments": [
            {
              "score": 18,
              "content": "Awww, thanks :)",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Thank you, OP. I'm gonna go out and buy a 9x9 pan this weekend so I can try this magnificent recipe!",
          "id": 65,
          "comments": [
            {
              "score": 12,
              "content": ":) let me know if you like it!!!",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I looooove Alvin Zhou's videos, they're so relaxing. I know he just started his channel about 3 months ago, but I really wish he had more videos. I'm very impressed by the production quality",
          "id": 67,
          "comments": [
            {
              "score": 4,
              "content": "I know, right?! I was so sad when I clicked on his channel and saw he had so few of them. I blazed through them pretty quickly. If time gets that kind of video quality, though, I’m all for it.",
              "id": 68,
              "comments": [
                {
                  "score": 3,
                  "content": "I totally agree. I've been watching a few food-based YouTube channels since the pandemic started (and I think I've gotten fairly good myself), but his channel is one of the few that I put my phone down each time so I'm not distracted at all.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Honestly, his videos have helped me with anxiety. I legitimately use them to help ground myself. If I could, I’d give him an award for best multi-purpose content.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "You might want to try a different brand of cocoa powder as well. I quite like Valrhona as it’s a deeper chocolate flavor",
          "id": 71,
          "comments": [
            {
              "score": 12,
              "content": "I might look into it! Honestly rn I’m looking at what I can buy cheap and in bulk since I’m kinda a broke college student, lol. But I like baking and I’ve bought some special ingredients (like pure vanilla extract—holy smokes it’s expensive! But so, so delicious).",
              "id": 72,
              "comments": [
                {
                  "score": 8,
                  "content": "A friend of mine who went to Johnson & Wales (good culinary school, usually in the top 5 in the US, has a great bread program) turned me on to it. Higher quality chocolate is usually worth it for brownies.  But yeah...I also get that budget is a thing",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It’s a whole other rabbit hole, but making your own vanilla extract is super easy and much cheaper than buying it. It takes a long time though - one year minimum but I highly recommend it! My oldest batch is 6 years old. I’ll be using it this weekend to make your brownies - yum!",
                  "id": 74,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Holy smokes that’s a long recipe. If I keep baking for awhile, I might have to look that up. My boyfriend absolutely LOVES all things vanilla (anyone have any great vanilla recipes?), so I might have to keep that in mind... hmmm..... thank you for the idea. I am plotting now. \n\nAlso, I am honored that something that took that long to make is going into a recipe I hodge-podged together. That’s probably gonna taste awesome and probably better than I could make it. I hope you enjoy them :)",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Dutch cocoa powder all the way! I’m in Canada, but I buy it from Costco and it’s way cheaper and soooooo worth it!",
              "id": 76,
              "comments": [
                {
                  "score": 2,
                  "content": "This is the best  cocoa powder !!!",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "For some even better brownies (in my opinion lol), try swapping out your vanilla for rum or rum extract. Functionally the same as vanilla but give this really really delicious flavor to the brownies, especially fudgey ones.",
          "id": 78,
          "comments": [
            {
              "score": 11,
              "content": "I might think about it, but I had a pretty bad experience with someone else’s rum cake once (I shiver to this day. Taste was horribly bitter. They might have just been bad at baking, idk, the cake was just soggy and weird and bitter and it made me a little sick) so I’m a little bit squeamish of the idea of rum. I also don’t know what rum is actually supposed to taste like so it may just be a matter of needing to taste it in a new context. I’ll ask my brother about it (he has a little more cooking experience in general and he also likes talking about the flavor profiles of drinks a lot, so I think he could help me figure it out). Someone else suggested whiskey, and someone else suggested Irish creme. My parents are gonna be so confused if they overhear me asking my brother about all these tastes, lol.",
              "id": 79,
              "comments": [
                {
                  "score": 4,
                  "content": "Ooooo definitely understandable, but in my experience it just leaves the brownies with a warmer flavor? Idk exactly how to describe it but to me it takes fudge brownies to the next level.\nOr another really delicious idea is making a mint frosting (there’s a million recipes out there), cover your brownies with it after they cool, then cut and freeze the chunks. It looses the effect in winter but in summer it is the most delicious frozen treat ever, plus they last longer in the freezer.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Hmmmm, gonna save this one for some warmer months. Thank you for the suggestion!!!!",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "YES whiskey, I add it to caramel which then goes in the brownies. But I also love whiskey in general so I'm probably biased.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Can’t wait to try this recipe thanks for the links and typing everything out :)\n\n\nCovid stress baking is #1 for weight gain rofl",
          "id": 83,
          "comments": [
            {
              "score": 4,
              "content": "Lol. Enjoy the recipe! :)",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "So you add the coffee grounds? Or do you make coffee and add that instead? I’ve seen both in recipes.",
          "id": 85,
          "comments": [
            {
              "score": 7,
              "content": "Just the coffee grounds. Brewed coffee might be better, but I’m not sure how that would affect it (it would be adding more liquid so it might change consistency?)",
              "id": 86,
              "comments": [
                {
                  "score": 5,
                  "content": "[deleted]",
                  "id": 87,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Coffee grounds, although from the sounds of it instant coffee will work as well (other people seem to have tried it).",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "You're the best! Thanks!",
          "id": 89,
          "comments": [
            {
              "score": 1,
              "content": ":) you’re welcome! I hope you enjoy it.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 748,
      "content": "NTA. He's not allergic. And he still eats the brownies so he can't hate them that much.\nIf he wants brownies without coffee he should bake them himself.",
      "id": 91,
      "comments": [
        {
          "score": 38,
          "content": ">And he still eats the brownies so he can't hate them that much. \n\nIndeed.\n\n> This morning he was very upset because he tasted the coffee \n\nIt was only with the extra coffee added recent batch that he even tasted the coffee, he was complaining about it without even being able to taste it previously!",
          "id": 92,
          "comments": [
            {
              "score": 14,
              "content": "And he took more after his complaints",
              "id": 93,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 515,
      "content": "NTA. Your dad isn't 8 years old, he can't just be picky about every food he eats. You and your mother shouldn't have to make separate dishes for your dad, unless he had some sort of allergy, which he clearly doesn't. He can either make his own food, or deal with what is made.",
      "id": 94,
      "comments": [
        {
          "score": 114,
          "content": "I disagree that he can't be picky. I'm grown and still picky af.  BUT, I also cook all of my own food and request that other people don't even try, since Idgaf about feels when it comes to food and I will refuse to eat. OP's dad is the AH for not cooking for himself and demanding to be accommodated, when they aren't even for him. Not for the pickiness.\n\nNta either way for op.",
          "id": 95,
          "comments": [
            {
              "score": 7,
              "content": "This. My mom, my sister and my partner are very picky with food, it's a different issue for each one of them, but they grew up understanding that they should not expect other people to always accommodate their food issues, specially because these are not food allergies, they won't die from it (allergies are a whole different thing) . They all know how to cook for themselves, even if it's very simple recipes, they don't depend on others to do it for them.\nI usually know how to cook in a way that everyone will be able to eat but there are days I just want my food, my style and they understand that they will have to cook for them those days.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I think he’s allergic to growing the fuck up. \n\nThere’s a term for that. Peter Pan Syndrome. Or, as I’ve always called it, fucking bullshit. \n\nHe’s old enough to have a wife and kids but still shoves brownies in his mouth, then complains when he finds out what’s in them. \n\nRemember making food for the toddler and not wanting to tell them what was in it? Anyone?",
          "id": 97,
          "comments": [
            {
              "score": 23,
              "content": "IMO it's even worse because he didn't find out *after* he ate them, he threw a tantrum because he *knew* they had coffee and still walked off with 3 of them. He's completely TA, and I find it so annoying that the mom makes him a separate dinner as well.",
              "id": 98,
              "comments": [
                {
                  "score": 8,
                  "content": "Yep. That’s some shit that happens when you’re fucking two years old. I’m mildly annoyed but understand that when I make food for the littles I can’t say certain words out loud like “pepper” because it will cause instant melt down in one of them in particular and she will refuse to eat it because it now become inedibly spicy, even if she was half way through eating it when the p-word was mentioned. \n\nShe’s...6? 7? My best friend’s littles. \n\nI get it. They are sensitive sometimes. \n\nYou what she’s not? \n\nA fucking grown ass man.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "my mom's been doing this since my stepdad moved in, he doesnt like that many things and is ultra picky. she doesnt seem to mind, but the things he likes are very simple and pretty quick to make (ex. hamburgers, ham sandwiches, plain boiled chicken) (actually thats about it)",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I don’t agree with this at all. People taste things differently. I kind of wonder if he’s a super taster based on the OP’s comment about him wanting bland foods. For someone who is a super taster, those bland foods aren’t bland and what OP described as good food will be overpowering. There are a lot of things I can’t eat. Everyone tells me lettuce has no taste, but for me it sure does. If it’s shredded, I can still taste where it was even if I remove it.",
          "id": 101,
          "comments": [
            {
              "score": 6,
              "content": "That may be true, but he still ate half a pan of the brownies, and only had a problem with them once he found out they were made with coffee. Even then he still ate 3 more. It could be possible he is a super taster, but his behavior doesn't match with this.",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 364,
      "content": "Nta.  Adding coffee to chocolate like that doesn't make the chocolate taste like coffee, it just makes it awesome.   He's probably had brownies and cakes made that way dozens of times.   He likes the brownies hes eating them. Hes acting like a child. Change nothing.  We dont reward tantrums",
      "id": 103,
      "comments": [
        {
          "score": 123,
          "content": "Seriously. The 'secret' ingredient in my chocolate cake recipe is brewed coffee. It's my sister's, who detests coffee, favourite cake.",
          "id": 104,
          "comments": [
            {
              "score": 54,
              "content": "I have instant esspresso in my cupboards for any number of recipes that call for it that taste nothing like coffee when complete.",
              "id": 105,
              "comments": [
                {
                  "score": 18,
                  "content": "Baking is the only reason I have instant espresso in my cupboard.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Same, we don't drink coffee, but that bag of instant sure gets a lot of use. Usually make it super strong with 2-3 tbsp of granules to a cup of water (compared to the regular 1tsp). Heavenly in baking, but would never drink the stuff.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "To be fair,  some people are super sensitive to the flavor and CAN tell even if it is just a little, but that is where you politely decline any more and be an adult.",
          "id": 108,
          "comments": [
            {
              "score": 8,
              "content": "I am that person. I can taste it, and I hate it. HOWEVER, I get over it and make my own brownies, it isn't that big of a deal.",
              "id": 109,
              "comments": [
                {
                  "score": 2,
                  "content": "Same. I can taste even the tiniest bit and can't eat that thing. So I politely decline and bake my own.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yep! I HATE coffee as well, and can't taste it when it's properly used to augment the chocolate in baked goods. \n\nOP, NTA. I wouldn't blame you for telling him he can either eat your brownies OR complain about them, but you're over him doing both.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "A bit of coffee just makes the chocolate taste more like chocolate. It deepens the flavour. It's absolutely amazing.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "I have to disagree with this. The two things I absolutely cannot stand in chocolate are coffee, and peanut butter. I will often try things and immediately taste these flavors, while others around me insist they cannot taste it. The difference, I often find, is that these people *don’t mind* the flavor of peanut butter or coffee to begin with. I’ve been that crazy person who pulls up the ingredients list, just to find that the thing was made with just trace amounts of the product, or was made in the same facility that contained the coffee/peanuts. \n\nSo if there’s coffee in your coffee cake, I will taste it. Maybe the cake is tasty enough that the coffee flavor is overpowered and I can still enjoy it... but I can still taste the trace amounts of gross. Most won’t taste it, true, but there are those of us that absolutely do.",
          "id": 113,
          "comments": [
            {
              "score": 7,
              "content": "I am the same as you. I don't like coffee. I can taste it really strongly in things that people who like coffee can't, or don't taste it as strongly. Though I've also never complained about someone baking something for themselves as a treat for themselves that I didn't like. I also haven't then gone and eaten half of said baked good.",
              "id": 114,
              "comments": [
                {
                  "score": 3,
                  "content": "He also ate 3 brownies so he either secretly loves coffee or can't actually taste it in the brownies",
                  "id": 115,
                  "comments": [
                    {
                      "score": 3,
                      "content": "So he's upset by the thought of coffee being in them? I have known people to be that picky.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "This is true. I don’t bitch and moan at people because they made peanut butter cookies, I just go “Aaaw thank you, but no thanks.” When they press, I just say I don’t do peanut butter. But I don’t sit there and loudly complain about how much I hate peanut butter. \n\nI also have friends and family who make a point to make something without coffee or peanut butter if they know we’ll be seeing each other. Because they’re awesome for remembering me <3, but I don’t ask them to. And I save decadent recipes with ingredients I don’t like and send them to them, even though I know I’ll never eat them. Just because I don’t like it, doesn’t mean they won’t.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Wait, does coffee cake have coffee in it? Coffee cake is his favorite dessert besides brownies.",
              "id": 118,
              "comments": [
                {
                  "score": 7,
                  "content": "Not necessarily. I always thought it was a cake you have *with* coffee, not a cake *containing* coffee, but Teh Google says it can be either.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Where I live, coffee cake is coffee flavoured cake. And the flavour comes from actual coffee. \n\nThough, like you, I always use decaf. Because I like strongly flavoured coffee cake, so if I use regular coffee, there is so much caffeine in it it makes me jittery, and I'm used to a lot of caffeine! People also often add walnuts to coffee cake here.\n\nI am very perplexed by your dad's reaction to your brownies having coffee in them, given that he liked them before he knew. Unless he has a medical reason he can't have coffee (which it doesn't sound like), I think definite NTA. He sounds like he is behaving very childishly. \n\nSurely he would not eat them if he could taste the coffee?! And if he does like them, then why does it matter that there is coffee in them?\n\nIs he often so immature?",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Some do and some don’t.",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Unless you specifically make coffee cake with coffee in it on purpose, it doesn't. it's just drier than normal cake (imo) that goes well with coffee.\n\nRegardless, you should be allowed to make what you want.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I have never made a coffe cake with coffee in it",
                  "id": 123,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I’ve never made a coffee cake at all so honestly I have no idea.",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 103,
      "content": "NTA but what’s the recipe?",
      "id": 125,
      "comments": [
        {
          "score": 30,
          "content": "Just gonna wait here for the recipe",
          "id": 126,
          "comments": [
            {
              "score": 24,
              "content": "It's now a waiting room",
              "id": 127,
              "comments": [
                {
                  "score": 16,
                  "content": "u/beans_mcgee we’re waiting patiently.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I posted it in a comment somewhere on here I think maybe (Reddit confuses me). I hope you enjoy it!",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I will be 4th in line please",
                  "id": 130,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Posted it in a comment, hot from the oven! I hope you enjoy it!",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I'll wait too!",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I’m not sure if I have to reply to all of these to say that the recipe is posted because I’m not terribly Reddit-literate but it is posted! I hope you like it! I’m a little worried I may have oversold them, but I really love them. Hope you enjoy it!!",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Recipe posted—enjoy (hopefully)!",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "I’m pretty sure it’s a riff off this video\nhttps://youtu.be/28NB3L9YuVI",
          "id": 135,
          "comments": [
            {
              "score": 7,
              "content": "Ok. So. Ok. That was fucking mesmerizing. Thanks for posting it.",
              "id": 136,
              "comments": [
                {
                  "score": 3,
                  "content": "You’re absolutely correct.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "If it's the one I'm thinking of, it's Alvin Zhou's 100-hour fudgy brownies. He's on youtube & has the most soothing voice.",
          "id": 138,
          "comments": [
            {
              "score": 10,
              "content": "Dead on! That dude makes the BEST videos. Love him. Most of the recipe was ripped from a different blog, but I got the coffee idea from him. I wish I had his patience but I absolutely have zero self control around brownie batter.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Hi everyone! I posted it in a comment. I hope my standards for “heaven” aren’t too low. Try it and let me know if you have any cool tricks for making it better!!",
          "id": 140,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 101,
      "content": "\"Your brownies with coffee are so bad that I had to eat half a pan of them to see if I could get any without coffee.  Then you made them again with even more coffee, which I could taste.  So disgusting, and these 3 more I am taking with me to my office will probably be equally as gross.  I am suffering so hard here.  Why don't you understand?\"\n\nNTA\n\nand LOL\n\nand WTF",
      "id": 141,
      "comments": [
        {
          "score": 35,
          "content": "I feel so guilty but that made me audibly giggle. Absolute 10/10 comment.",
          "id": 142,
          "comments": [
            {
              "score": 21,
              "content": "Don't feel guilty. He is eating them. He knows now going into it that you add coffee and he still eats it. He is just used to always getting his own way and clearly it isn't needed.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I'm going to go out on a limb and ask if this is the first time he's made you - or your mom - feel bad about food-related things. Or even non-food-related things...",
              "id": 144,
              "comments": [
                {
                  "score": 9,
                  "content": "It isn’t. theres kind of a lot of micromanaging that goes on.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Stop baking for him. Like, next time he goes for anything, just tell him they're for people who actually appreciate your baking and the time and effort you put into it.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 82,
      "content": "NTA\n\nHe's not allergic and didn't even know the coffee was in there until you said something. And it certainly doesn't stop him from gorging on the brownies. \n\nI feel like your dad is just used to getting his way and being indulged by your mom - which is her business. But your refusal to do what your mom does is his REAL problem.",
      "id": 147,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 81,
      "content": "NTA, your dad is just... annoying. if he can’t deal with the coffee, he wouldn’t be eating them. but first and foremost, you’re putting the work into these, they’re your celebration brownies, and you get to decide what you want. also: congrats!",
      "id": 148,
      "comments": [
        {
          "score": 24,
          "content": "Thanks!! This quarter was kinda hard for me but I’m so proud of myself of getting through it with good grades. Did a little dance in the kitchen while I mixed myself up my brownies.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 47,
      "content": "I’m a pastry chef. The addition of coffee is quite traditional. Add cinnamon. It makes it almost a Viennese coffee. Soo subtle. \n\nDad, I hear you do not like coffee. Besides the coffee please explain to me what about my brownies you object to?  I’m asking because you are still eating it. \n\n\nMy dad hates coffee. Cant stand it. But for my brownies, it is the greatest addition. Just so long as the brownies are crisp/crunch on the edges and ooey gooey in the middle. \n\nSmh. NTA",
      "id": 150,
      "comments": [
        {
          "score": 13,
          "content": "Thank you for the advice!! I’m totally gonna try cinnamon. Do you have any advice on how much to add? (I’m not super experienced.) \n\nI might ask my dad if he has any specific objections besides the coffee. Before he seemed to like the recipe.",
          "id": 151,
          "comments": [
            {
              "score": 15,
              "content": "Ok, I’d go with 1/2 tbsp or 2 tsp to start. I add about a tbsp to mine. If your in the states around this time of year they also sell cinnamon chips. Like in the same area has chocolate chips. I add them to everything from cookies, brownies, cakes and even pancakes. They also have espresso chips.\n\nTry adding some chips and any nuts you might like for an interesting texture. (Like 2 cups). Yes, I use cups n teaspoons etc for small recipes. \n\nAlso r/baking is a great subreddit plus r/food. Lol",
              "id": 152,
              "comments": [
                {
                  "score": 8,
                  "content": "Alright! I’m gonna write that down in my recipe book for later. Also I’m going to Wegmans to see what kind of specialty chips they have. Thank you for the advice!!! :)",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Professional chef (bad at baking things that aren't creme brulee (I make a fucking badass white chocolate basil creme brulee)) here, and I can attest, cinnamon chips are basically the truth. They're *awesome* in chocolate chip cookies (like 90% chocolate chips to 10% cinnamon).",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I don't think he has much of an objection if he whined about how hurt he was but still took three with him. Don't change the recipe, rather ask him if he wants to join you next time and he can make his own batch without coffee. Good bonding activity if you or him are into that",
              "id": 155,
              "comments": [
                {
                  "score": 3,
                  "content": "Aww, that sounds kinda fun. Maybe I can introduce him into the world of the kitchen. Might be dangerous to give him that power (there goes any hope of a diet, oops) but it would be a fun activity. Thanks for the advice!",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}