{
  "post content": "I (28F) am married to Josh(30M). We’ve been together since freshman (him junior) year of college. We have a lot of pets in the house- 3 dogs, 3cats, a bunny, a turtle, a snake and a macaw. We love all of them and spent a lot of time making sure we take care of them.\n\nI am on maternity leave currently and my due date is in three months. I decided to foster a litter of puppies along with the mama after I saw she was scheduled to be euthanised. \n\nMy SIL(30F yes they are twins with my husband) lost her job recently and asked to stay with us. She does contribute towards bills but does not pay rent or anywhere near 1/3 of the bills around the house. I don’t mind as she still makes an effort. She got sick last week so she is still recovering and not actively looking for a job.\n\nShe has been making faces left and right about the pets, claiming she has allergies, the macaw is too loud when it talks, the dogs pitter-patter around the house is annoying, the cats sleep on her clean laundry.. I think she only likes the bunny and turtle as the snake apparently grosses her out as well.\n\nJosh, my husband, told her she should stop complaining and check her allergies and maybe close her door so cats don’t go in (dogs never do). She huffed and puffed until this morning where she saw she had a rash and went to get it checked out. They told her it was an allergy and she lost it. Came back waving the papers with the diagnosis and shoved them in my face. I said she should go get tested for what kind of allergy it was and she looked at me like I was dumb.\n\n“It’s your goblins around the house. You need to get rid of them or I might get a more severe reaction.”\n\nI laughed and said no. Josh came back from work and the two had a huge argument which ended up with Josh saying we might be able to compromise on the rescued doggo mama and pups. The two came up to me and I refused. I have made a commitment to take care of her and I am not returning her to the pound. Plus, how removing her helps any, I don’t understand. 90% of the time she is in a downstairs bedroom with her pups or in the backyard. She has no contact with my SIL. Our dogs and cats are free to go anywhere.\n\nMy SIL got pissy, said I was prioritising a stray mutt to her health and said I was right, the stray wasn’t the issue. I could keep it, but I gotta board it in a pet hotel along with her puppies and our animals. That’s 16 animals on an average price of 40$ per animal, and that is even if an establishment is crazy enough to take 6-week-old puppies. So this comes up to 640$ per day. I told her she is welcome to pay it but I’ll board them only for a week and then she needs to move out.\n\nShe lost her cool, called me a unconsidered a-hole, I was trying to kill her with my pets and was kicking her to the curb over a d*mn mutt. Josh backed me up but their mother called and said I was a jerk and her son made a mistake ever marrying me. Josh is still arguing with relatives, his sister is still in the house crying and I am just about done.\n\nAITA?\n\nEdit: their mother lives far away. SIL doesn’t wanna move so far away.\n\nEdit: we went at it again. She is crying and obviously there is snot from CRYING but she is insisting it’s the animals and her allergies. Josh is saying she is broke and we need to give her a month or two before she can move out even to their mom’s (apparently she has no savings). She said I was unable to make compromises (reddit gave me some confidence thank you all). \n\nShe is calling her mom nonstop and saying she feels like she is choking and might call an ambulance but her ‘anaphylactic’ shock has been on and off for about two hours so it’s safe to say she is exaggerating. I do have an epipen in the house if she is actually serious.\n\nMy MIL wants to join in on the fun and Josh is trying to dissuade her as I am refusing to have another relative of his in the house indefinitely. My hormones are going crazy and I wanna cry as well. Please pray for me because I am very close to kicking everyone out and just becoming the crazy lady with the zoo in the house.\n\nEdit: in-laws got very quiet when Josh and I offered to ship her back to them. They claim they’ve fell on hard times and cannot support her. My MIL has been asking Josh to pay for a plane ticket so she can come settle this for us in person and my SIL is over the moon. We will not be housing any more of Josh’s relatives.\n\nAs a temporary solution, even though I feel she does not deserve it, my dad has graciously offered to have her over. He does not have pets currently. My SIL is refusing because it’s embarrassing for her that my part of the family knows she is broke but Josh is working his magic on his twin. Fingers crossed she is out of the house by tomorrow and my MIL settles down.\n\nAnd yes, we will be paying for all that jazz but I am willing to give any amount of money to have her out. She has been screaming any time she runs into one of the pets like it’s gonna attack her and I cannot deal with that.\n\nEdit (last one I promise) I have no intention of keeping my rescue mama and puppies. That is 10 dogs they are getting adopted out people. I WON’T keep them. I am not hoarding them. In a few weeks we’ll be back to having 3 dogs, 3 cats, 1 bunny, 1 turtle, 1 bird. Is it a lot? Yes. Are the vet bills crazy? Yes. Am I hoarding? No. All of them are rescues who have visual defects that are harder to adopt out with. \n\nOne of the cats has a nasty scar on her chest, another has her ears completely cut off, the bunny is missing a leg, dogs have scars from fighting or beating, the macaw is just a jerk.. so yeah, I’ve taken them because they are harder to adopt out.",
  "id": 1,
  "comments": [
    {
      "score": 5812,
      "content": "NTA. She's a \"guest\". If she's not happy with the living environment, she should make other plans.",
      "id": 2,
      "comments": [
        {
          "score": 1130,
          "content": "That’s what I wanted to say!! She has no right to demand you any changes. Just find her own house and leave you alone.",
          "id": 3,
          "comments": [
            {
              "score": 679,
              "content": "She chose to move in to a house with pets.  That is what help was offered: you can fit into our exisiting home as is.  Not, you can demand changes in our home that require a HUGE emotional change for the home owner.\n\nShe can  buy allergy meds and an air filter and stay in her room with the door closed and suck it up, or she can move.",
              "id": 4,
              "comments": [
                {
                  "score": 120,
                  "content": "As a person with allergies, the air purifiers work great.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 161,
                      "content": "I am the person with allergies. Terrible, bad pet allergies. 15 minutes before I started wheezing around certain cats, and then I start coughing up blood bad. It is up to me to check if there are pets in the home before I go in.  It is never up to the home owner to get rid of a pet. And, if I felt that I \\*had\\* to stay, I would be setting up my own clean room.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "EXACTLY!",
                  "id": 8,
                  "comments": [
                    {
                      "score": 0,
                      "content": "[removed]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I got allergy tested and in addition to everything outside, I was devastated to find out I was a 2/4 reaction to my beloved cats.  So I started the shots, got an air purifier, allergen covers for my bed, and I wash the bedding on hot water once a week and vaccum wearing a mask.  I know SIL doesn't have money, but I was also just having itchy eyes, gunk in my ENT, and a runny nose from two fluffers that I regularly snuggle with a 2/4 reaction.  If she's just now getting a rash, I'd wager that's all it is.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "[removed]",
              "id": 11,
              "comments": [
                {
                  "score": 14,
                  "content": "This is a comment-stealing bot!",
                  "id": 12,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh no! I missed Bottie's comment?",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "BAD BOT!!",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 265,
          "content": "Exactly,  she should be grateful you guys let her stay & basically for free on top of that! She should get her entitled self to a doctor & get some medicine for the allergies ( if they're even real or actually because of the animals as i honestly have my doubts) or move out! \n\nAbsolutely NTA",
          "id": 15,
          "comments": [
            {
              "score": 235,
              "content": "I was wondering something similar.   I bet the doctor just said it was an allergic reaction, and didn't specifically state it was due to the animals.   Furthermore, if it was an allergic reaction due to the pets,  there's no way to know with that limited information which pet caused it.  \n\nOP should rehome the SIL.",
              "id": 16,
              "comments": [
                {
                  "score": 92,
                  "content": "If it's a rash that's clearly not scabies/fungus/rosen etc, odds are big docs gonna say it's \"probably an allergic reaction\" (to detergent/soap/whatever is on new unwashed clothes). SIL definitely needs rehoming.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "SIL sounds like a pain.... poor doctor probably just wanted to get her out of the darn office just like OP wants her out of her house.... \n\nSure sure it's allergies now GTFO...",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Shit, I was hoping for ringworm to flip her out.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "I have never understood how someone who is using a favor to live somewhere could complain about the pets.",
          "id": 20,
          "comments": [
            {
              "score": 91,
              "content": "Some family members act that way. Not it's not about pets, it's about the accommodation, the food, the laundry detergent, the water pressure - anything.",
              "id": 21,
              "comments": [
                {
                  "score": 113,
                  "content": "When my parents were staying with us because their home was flooded by a hurricane my dad was like this. Mad we didn't have cable only streaming, and he refused to sleep on the guest bed because one of the dogs went in and jumped on the bed.  I told him he was welcome to go back to his house under water",
                  "id": 22,
                  "comments": [
                    {
                      "score": 62,
                      "content": "this kills me because my grandmother who isn't a pet fan, let my cousin and my cousin's dog stay with her after a hurricane.\n\nmy cousin kept the dog out of my grandmother's way. (well, best she could.)\n\nand my grandmother understood that my cousin was doing her best.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 74,
              "content": "Moochers always think they are entitled to more and more and more",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I could see it if the pets were neglected - uncleaned litter boxes leading cats to poop elsewhere, unwalked dogs peeing in the house, pets never entertained by the owner bugging the guest for attention 24/7.\n\nBut I’d still be complaining about the owner, not the pets.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "This whole thing is offensive to OP. OP is NTA and SIL can stfu or sleep outside in a tent and take allergy pills and stay away from the animals until she’s permanently out.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "It's what happens when emotionally immature people are in a position of dependence and need to accept charity. Their egos don't allow them to feel gratitude or humbleness, so they convince themselves that they're entitled to everything being given them and more. It's more likely to come out with close family that they feel safe with.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The \"no good deed....\" fits in perfectly here.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "[removed]",
              "id": 29,
              "comments": [
                {
                  "score": 11,
                  "content": "Bad bot!  Looks like the bots have a new, easy to spot naming convention: all caps nonsense letters. \n\nDownvote and report.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I’m not trying to be rude, but have you met actual humans?",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "The fact that she wants OP to get rid of her pets makes me suspect that SIL intends on being more \"permanent resident\" than \"guest\".",
          "id": 32,
          "comments": [
            {
              "score": 48,
              "content": "At the very least, SIL refuses to recognize that OP and her husband are doing her an enormous favor, and has convinced herself that she has a right to dictate their living situation.\n\n Clearly, SIL never got the message that beggars can’t be choosers.",
              "id": 33,
              "comments": [
                {
                  "score": 8,
                  "content": "r/choosingbeggars",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "But she hasn’t gotten rid of her own dogs",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "Exactly this. Plus, if she's whining about the pets, just how much worse is she going to whine when the BABY is born? There's no way she's only going to stay there for a month more. She's gonna drag her heels and ride that free cushy living situation as long as she can. She'll keep pressuring her brother to put her over his wife, causing unnecessary stress to the family he's trying to build. Right now its the animals, but soon after it'll be the baby crying too much and not enough attention to her and no meals cooked for her because they're busy being actual parents, etc etc etc.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Tell MIL she has to pay for SIL to move to her house or she’s on the streets. \n\nOtherwise OP will come home one day and all the pets will be at the pound or just “accidentally let out”",
          "id": 37,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 43,
          "content": "The entitlement is… wild. \n\nTell her: \n-close your door. \n-Vacuum your room daily\n-Get a small hepa filter for your bedroom. \n-You and hubby get a hepa filter for the furnace \n-Have her get an allergy test so she can get her own epi pen if needed and so a dr can explain what kind of reaction she can expect and from what. \n\nTell her these are the compromises you are willing to meet her on and until she pays a full portion of rent and 1/3 off the bills that’s all the compromise she gets to demand. Alternatively she can move out at her earliest convenience. You are doing her a favour you don’t owe her *more* than what you are already giving her. \n\nNTA.",
          "id": 38,
          "comments": [
            {
              "score": 32,
              "content": "IMO even if she pays a full third she has no right to demand they get rid of their pets. She moved into an existing household which included numerous pets. You don't get to demand that the pets be gone even if you're paying",
              "id": 39,
              "comments": [
                {
                  "score": 3,
                  "content": "Agree. If she paid she’d have more clout - though not that much - but she had absolutely none in this situation.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Seriously. NTA. During COVID my boyfriend and I had to move in with my parents for about a month to regroup (I had been abroad and had been sent back with no warning when COVID got bad and BF’s job had shut down). They have two cats and we figured out pretty quickly that BF was extremely allergic to them to the point where he was pooping Zyrtec and Benadryl like candy and could still barely breathe. Do you know what we did? Figured out how to move out faster. Those cats are family. We were temporary guests. It was our responsibility to sort out our own shit.",
          "id": 41,
          "comments": [
            {
              "score": 3,
              "content": ">to the point where he was pooping Zyrtec and Benadryl like candy\n\nI know this is a typo but think of the money you'd save!",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "Your parents were nicer than I am. I’ve told my kids they can come home but unless they have a job they will be working for their keep on the ranch and no bfs or gfs allowed.",
              "id": 43,
              "comments": [
                {
                  "score": 7,
                  "content": "We were literally there for less than a month and it was April 2020….. BF’s family lives across the country and we were somehow able to both find jobs and an apartment within three weeks despite almost everything being shut down. So yes luckily apparently my parents are nicer than you because we’re family to them and they don’t believe in the whole “once you’re 18 we’ll never help you again” bullshit.",
                  "id": 44,
                  "comments": [
                    {
                      "score": -4,
                      "content": "I’m glad you were able to resettle. But the old man and I decided years ago that no bf or gfs were ever moving in, husbands and wives okay.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -5,
                      "content": "BTW I would always help my children, but for us we drew the line at not helping someone else’s children.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Don't let the door hit you on the way out.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "NTA. Have the mom pay to relocate her to her house, since her \"poor baby\" is dying at your house. There should be nothing your MIL wouldn't do for her daughter if she's \"dying\" at your house. I would tell SIL you care about her health too much to allow her to stay any longer and that she needs to find a friend or family member to live with. I'd give her until the end of the week.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1305,
      "content": "NTA. \n\nLook it's a super full house. It definitely would not be comfortable for me either but it's not my house and neither is it your SIL nor your MIL. \n\nIf the animals are such an issue to live with why has she not moved in with her mother.  Both your In Laws are acting like they assume they have a say of what happens in your house which makes them TA here.",
      "id": 49,
      "comments": [
        {
          "score": 190,
          "content": "Dump this AH mummy's girl off at her mother's. She is done demanding how you live your lives.",
          "id": 50,
          "comments": [
            {
              "score": 45,
              "content": "One way bus ticket back to mommy",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This, plus hand her some Flonase and/or Zyrtec as a parting gift.\n\nNTA!",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Hell, I'm allergic to anything with fur or feathers. If I needed to stay at your place, would be popping ny allergy pills and making sure I get my shot on time. \n\nMeanwhile if my sil comes over to my house (2 cats) she will go poof, and just want to curl up and die from her allergies.  I'm used to my cats now, others nope",
          "id": 53,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 718,
      "content": "[deleted]",
      "id": 54,
      "comments": [
        {
          "score": 28,
          "content": "I have a strong suspicion it could be a mosquito bite and she is claiming it is an allergy to the pets.",
          "id": 55,
          "comments": [
            {
              "score": 6,
              "content": "apparently, she has documentation, maybe she has an allergy to mosquitoes.",
              "id": 56,
              "comments": [
                {
                  "score": 2,
                  "content": "It might have just been an invoice for going to the hospital and being seen. Did OP actually read them?",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "As someone with allergies and a child with allergies, you can’t get confirmed with allergies without actually being tested for a specific type of allergy. So I’m guessing she got a referral or recommendation for allergy testing. OP read her doctors paperwork carefully. She sounds like she’s exaggerating. \n\nAlso for reference. I had to rush my child to the ER for a suspected allergic reaction and they couldn’t even confirm that’s what it was without testing. They treated her an allergic reaction but she was required to get tested for confirmation.",
          "id": 58,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 592,
      "content": "NTA \n\nMaybe your self- entitled SIL should go live with their mom!",
      "id": 59,
      "comments": [
        {
          "score": 267,
          "content": "She is in another state. SIL says she doesn’t wanna move so far away.",
          "id": 60,
          "comments": [
            {
              "score": 608,
              "content": "How is that your problem though? Why does SIL get to make all of the demands and none of the compromises?",
              "id": 61,
              "comments": [
                {
                  "score": 437,
                  "content": "She has been raised this way. She is the golden child. Their parents are very traditional, so when she was out of a place to stay it was apparently Josh’s responsibility to take care of her because he is a man.\n\nLet’s just say I am grateful my in-laws live so far away and visit once a year.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 204,
                      "content": "Lol, I could see that. \n\nI think it's time for a life lesson that her parents never taught her. Josh's responsibility is to you and to the pets you have adopted and cared for together. I think it's too late for her to even back track and apologize. I would no longer trust her in the home alone with my fur babies. She needs to leave asap, if she doesn't want to live with MIL, then she can live on the street.\n\nWhat would happen if she didn't like your children? (I'm just being facetious to make a point)",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 87,
                      "content": "She has no savings, not a single friend to take her in? no job to her to her current area anymore. So why doesnt she get a flight back to her mother and go live with her and find a job there?\n\nOr why dont her parents hand her over 6 months rent....",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 59,
                      "content": "I think if this behavior continues then kick her out! Your pets came first. And what if she kills them accidentally (I have a snake myself an mine is very sensitive to abiotic changes…) and what if she hurts your future baby just cause it cries to loud… is that the enviourment that you want your child to grow up in?\n\nEdit English is not my first language sorry if there are any mistakes.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "Im starting to think 'traditional' means 'its my way, not yours'. It's 2022, and youre in the US(?) Time to catch up to this day and age.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "Good luck when you have your baby. Even more so if you have more than one. Your SIL is going to be jealous of them, and your ILs will continue the favored one with one of the children.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "NTA and be careful. You better check if your partner have a backbone otherwise you are going to be alone and miserable in this \"family\". Never forget: unless they are NC, once you marry someone, you are marrying their family.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Traditionally, children are the *parents’* responsibility, and an unmarried daughter lives with her parents. If they want to stick to an old-school family hierarchy, his sister’s problems fall under *their* jurisdiction, not his.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Tell her to take some Claritin 12hr and cool it with the drama queen act or she's out. You don't need this.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "It’s the pets home, they LIVE there, she is a guest in the pets home. As a guest, you can’t ask the host or permanent inhabitants to move out. I agree with the commentor that said she can live with mother in another state (the further away from you the better it seems) or the street if she can’t live with your animals. NTA",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "It seems as though they’re only traditional when it is convenient for them to be.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This is a great point",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Well she has no savings, no friends to live with with, no job. She can't always get what she wants....  \n\n\nAlso the unnecessary stress she has now put on you, including the additional stress from her mother. It's not acceptable for you and you and your husband should claim your house back and enjoy the time before birth.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Her problem, not yours.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": ">She is in another state. SIL says she doesn’t wanna move so far away.\n\nThis isn't supposed to be 'a move', it's supposed to be staying temporarily, surely?\n\n*That* she can reasonably be expected to do until she finds a new place in your area.\n\nIf she's looking at this as a permanent attachment then you definitely need to get rid of her.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Tough luck. It is either that or the street.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "What's keeping her here?  Her job?  Her house?  The great friends she has that won't let her live with them?  Buy her a one way ticket and be done with her.",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "If it is supposedly only \"temporary\"  then pack her stuff up and take her to \"temporarily\" move in with her mom.   You don't get to be a guest in my house then proceed to tell me how my house should be run.   That is not how that works.   You don't need that stress.   She can also rent an airbnb or hotel if she is that uncomfortable.  You should give her a definite move out time and once that time has expired, move her to the local women's shelter.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Well, isn't that too bad. This is her problem, not yours.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Too bad. She is homeless.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Oh well",
              "id": 82,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 222,
      "content": "NTA. If you are asking the favor of living with someone, you deal with what is in their home.",
      "id": 83,
      "comments": [
        {
          "score": 38,
          "content": "[removed]",
          "id": 84,
          "comments": [
            {
              "score": 8,
              "content": "The above comment was stolen from [this one](http://np.reddit.com/r/AmItheAsshole/comments/smnr57/aita_for_refusing_to_get_rid_of_my_pets_because/hvxq2wj/) elsewhere in this comment section.\n\nIt is probably not a coincidence; here is some more evidence against this user:\n\nPlagiarized | Original\n-------- | -----------\n[> Husband sounds very abu...](http://np.reddit.com/r/AmItheAsshole/comments/sm9mzo/aita_for_getting_angry_at_my_husband_for_telling/hvxsi0z/) | [Husband sounds very abusi...](http://np.reddit.com/r/AmItheAsshole/comments/sm9mzo/aita_for_getting_angry_at_my_husband_for_telling/hvx5as4/)\n[NTA. Please continue to s...](http://np.reddit.com/r/AmItheAsshole/comments/sm2yn9/aita_for_telling_my_mom_that_she_cant_come_to_my/hvxsh3x/) | [NTA. Please continue to s...](http://np.reddit.com/r/AmItheAsshole/comments/sm2yn9/aita_for_telling_my_mom_that_she_cant_come_to_my/hvwo4gu/)\n[NTA. Well done on protect...](http://np.reddit.com/r/AmItheAsshole/comments/sman3a/aita_for_having_my_niece_stay_at_my_house/hvxsffo/) | [NTA. Well done on protect...](http://np.reddit.com/r/AmItheAsshole/comments/sman3a/aita_for_having_my_niece_stay_at_my_house/hvxjts7/)\n\nbeep boop, I'm a bot -|:] It is this bot's opinion that  [/u/Legitimate_Tax_4218](https://np.reddit.com/u/Legitimate_Tax_4218/) should be banned for karma manipulation. Don't feel bad, they are probably a bot too.\n\nConfused? Read the [FAQ](https://www.reddit.com/user/reply-guy-bot/comments/n9fpva/faq/?plagiarist=Legitimate_Tax_4218) for info on how I work and why I exist.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 180,
      "content": "NTA\n\nThe pets were living there first.  SIL can, and should, move out.\n\nGive her 30 days notice to vacate.  She can move in with her Mom, even if that means moving far away.",
      "id": 86,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 106,
      "content": "NTA. This isn’t even a real question, it is YOUR house. That’s it. If she has issues with anything in your house she is free to leave at any time. Her problems are not your problems. The same way your house is not her house. I can guarantee the Macaw can’t stand the sound of her either and the turtle is definitely allergic to self entitled AHs.",
      "id": 87,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 65,
      "content": "NTA. If she has allergies, the macaw is too loud for her, the dogs annoy her, shes doesn't like the cats sleeping on laundry and the snake grosses her out then she can leave. \n\nThis is your home and your pets home, not hers.",
      "id": 88,
      "comments": [
        {
          "score": 2,
          "content": "I agree OP is NTA but the line gets blurry if I don't get snake tax.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 50,
      "content": "NTA \n\nPets are family too. She is living with you as a guest, your pets aren’t. \n\nIf she can’t handle her allergies she needs another place to stay.",
      "id": 90,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 48,
      "content": "NTA. you're doing her a favour. It's your house she doesn't get to lay down rules in your house. If she doesn't like it she can leave. I wouldn't open it up for negotiation, because she sounds like someone that when given an inch she'll take a mile. If you give in on your Foster and her pups, it will be the rest of your animals before long as she'll say she still has her rash. Flat out tell her no and it's not up for debate. I read your comment about how far away their mother is, but leave her go there. She's homeless. Beggars can't be choosers\n\nEDITED TO ADD: no boarding kennel is going to take 6 week old puppies. They won't have had their parvo shots yet . Contact with other dogs could cause them to contract parvo and in all likelihood given their age, they wouldn't survive it.",
      "id": 91,
      "comments": [],
      "relation": "Support"
    }
  ]
}