{
  "post content": "To give some background, my sister cannot have kids. She has wanted a kid for a few years but doesn’t want one that doesn’t share the same DNA as her (her words). She asked me if i’d be willing to have a baby and give it to her and i said no. \n\nSo, my sister and her husband moved into my parents house as their house needs workin on. Shes said it would take 4-6 months before they could move back. My mom wanted to have a family dinner yesterday and had all of my siblings and i over.\n\nBefore dinner my sister asked if they could instead move in with us because it’s closer to BIL’s job than my parents home is and she didn’t want to live with my parents. I asked my bf if it was okay and we agreed to let them stay with us instead. That was until she started making “jokes” during dinner that i seen as red flags. \n\nThey were along the lines of “you better hope i don’t hide your birth control and you end up getting preggo” I kind of awkward laughed then she said “maybe i’ll poke a hole or two in your condoms” by then i stopped laughing and started to feel off vibes. I tried to steer the conversation onto something else but she kept making the jokes. \n\nI didn’t even last til the end of dinner and told her i changed my mind about them living with us because i didn’t like her “jokes”. They all said i’m overreacting and my bf backed me up and said it wasn’t funny. We left and since then my siblings and parents have been calling me a drama queen and said i blew it all out of proportion and i’m making it seem like my sister is a bad person. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 7763,
      "content": "NTA. They weren't \"jokes\" they were threats. She threatened to sabotage your birth control in order to force you into a unwanted/unplanned pregnancy which would leave you with two choices that you shouldn't be forced to make because it would be a pregnancy that you had no hand in making true. She wants to force you into a pregnancy so she could somehow get the baby from you. (I can see her calling CPS on you for the smallest things in order to force them to take the child away and place it with her.)\n\nShe showed you her true colors, believe her. Do  NOT let her NEAR your house, and keep an extremely close eye on your condoms, birth control pills/patch/shot (whatever you use that isn't a IUD basically) and never leave her alone if she has access. They were NOT jokes, no one makes Jokes like that unless they have a mental disability in which they truly do NOT understand the impact this can have (meaning they hear people say it or its on TV etc, like they truly cannot understand the issue with htis), OR they have a hidden agenda. She has a hidden agenda. She WILL do this if you let her near your house. Please don't let her move in.",
      "id": 2,
      "comments": [
        {
          "score": 1742,
          "content": "This post made me increasingly grateful I had an IUD put in, NTA",
          "id": 3,
          "comments": [
            {
              "score": 531,
              "content": "Just a couple questions as someone who is looking at birth control if you are okay with answering. Don't feel you have to respond.\n\n1: how painful is it to get an IUD put in\n2: how long does it last\n3: does it stop periods\n\nEdit: Wow this absolutely blew up, Thank you everyone who responded to this, it's really nice to hear other people's experiences.",
              "id": 4,
              "comments": [
                {
                  "score": 646,
                  "content": "1. They're supposed to give you motrin before insertion to reduce the pain, if you have a low pain tolerance you may be able to ask for something stronger. Physically it was a 4 on a scale to 10 for me. I was more freaked out then anything because I didn't know what to expect. After the fact I was cramping bad for about 2 days then I was fine\n2. 5 years \n3. Mines didn't stop but they're very light and sporadic, some people said theirs stopped completely though",
                  "id": 5,
                  "comments": [
                    {
                      "score": 280,
                      "content": "Thank you for responding. That was really helpful.\n\nI'm mainly looking at birth control to completely stop my period, so it sounds like it might be good to try something slightly more reliable on that front.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "They should offer local anesthesia.    For some reason many doctors are still living in the dark ages.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Mine stopped totally and my five-year one was kept in for seven years with no issue. I'm a big fan of IUDs. It was PAINFUL going in but I would gladly trade that for seven years of freedom.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "1. For a lot of people, ibuprofen and tylenol are adequate. But for some people it's rough. I just learned that you can request to be put to sleep for IUD insertion, similar to sleep dentistry. IUDs are fantastic birth control. Extremely effective, long-lasting, one of the cheap bc methods when prorated over their multiple years lifetime (and in the US usually fully covered by insurance), and reversible between immediately (copper IUD) and a couple day (hormonal IUD) after removal. Both insertion and removal are quick outpatient procedures.\n2. Depends on which IUD model one gets. In the US market, options range from 3 to 12 years. Elsewhere, there are many more models available.\n3. Depends on the individual, as well as type of IUD. Copper IUDs are unlikely to stop periods, and for some people periods get more intense with these--at least at first. People with hormonal IUDs usually report getting milder periods or cessation. (Either of which is temporary. The hormone dose is quite low compared to The Pill, so cycle/fertility bounce back within days after IUD removal.)\n\nhttps://www.bedsider.org/methods/iud",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Which one are you on? This sounds a lot like my experience with the Kyleena! @u/lazuliarts, there are a few different options. The insertion technique and pain relief options are always going to be the same and you will definitely cramp the next few days, but your IUD is going to be either a 3 year, 5 year, 7 year, or a 10 year IUD for hormonal IUDs. Non hormonal can last 12-15 years. Periods will vary per your normal flow. With my kyleena (insertion in July 2018) I have gone from flows that had me changing my super overnight pads and super plus tampons every two hours at the most and adult diapers at night for a week straight to 10-14 days of a very light flow with cramp pains being the same level as before my insertion for two years. This past year though, my cramps have gotten less and almost non existent for some periods and my flow has decreased as well. I definitely have enjoyed being able to use normal and new period containment methods like regular size pads and menstrual discs and will probably keep an iud in until I go through menopause or decide I might actually want to try to give birth",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I had IUD (nexplanon) for about 4 years, about 3 of those 4 years my periods would last for 1-2 months, 1 week stop, 1-2 months on again. :( Mine were long before nexplanon, but not *that* long.\n\nWish mine stopped completely...\n\nHad to remove nexplanon in Japan, and because of recent PCOS diagnosis and endometriosis I was put on a specific set of pills to help tackle that lol (Lunabell). So far, so good!",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Yo what? I have a friend who has the highest pain tolerance I know, and they said getting an IUD was one of the most painful experiences in their lives, and they've been in and out of hospitals their whole life.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "1. I have endometriosis and it was like med/high level period cramps for me, but I've heard other people say it's very painful (early stage contractions). The placement hurts the worst, it kind of dulls down after, the first three days hurt pretty bad but it's fine after that. \n\n\n2. Depends on the IUD. Mirena is hormonal and lasts up to 5 years. Paraguard is copper and lasts up to 12 years. \n\n\n3. 20% of women who use mirena stop their period during/after the first year(and it stays stopped). It reduced the severity of mine, which is why I got it in the first place. \n\n\nHormonal birth control is funny because it can both trigger and help control issues with reproductive health. Copper IUDs can worsen periods, but may have no effect. All of these things are why it's important to talk to your doctor about your options for long-term BC. Everybody is different and every body is different.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I had Mirena with endometriosis. It was horrific, I had uterine contractions non stop for 7 months until I got it out again (doctor said ‘don’t worry, it’s just like labour pain’). Can’t recommend personally, but I know others who have had a better experience.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Check out bedsider (dot) org. That’s the website my doc suggested to learn about bc methods. It’s great and easy to understand. \n\n1. Pain depends on your tolerance. I’d say getting it in was 3/10 to me (same as a Pap smear). But the rest of the day I had painful cramps (I usually don’t have period cramps so this was a lot for me, but I just took Tylenol). Taking it out was just a few moments of discomfort. \n\n2. It depends on the kind of iud you get. I got the low hormone one that only lasts for 3 years. I think the copper lasts for 10. \n\n3. Copper iud does not stop periods (in fact, the ppl I know who had them had worse periods). My periods went from my normal 3-4 days using regular tampons, to 1-2 days of light spotting and just using liners. My sisters went completely away with mirena. \n\nI loved the iud bc it was easy, didn’t have to think about it. Unfortunately, I had to get it removed bc it caused me to smell gross and I kept getting infections. If it hadn’t been for that, I’d still have it.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 2,
                      "content": "It amazes me how different people are. I’d say the insertion was more like 7/10 pain but it was over in less than a minute. However, the doctor numbed my cervix with lidocaine beforehand (using what my husband, who could actually see it, says was a really disconcertingly large needle).",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "i think i have a different iud than the person you responded to (copper one) so i’ll answer your question for mine too, just so you see some options- \n\n1. i have a high pain tolerance and i found it to be very painful, but i also have a tiny cervix and it’s tilted back. she had to pressure it open (there was scar tissue) and it was barely big enough for the instrument to go in. so that’s probably why. i felt horrible for maybe two hours and afterwards i was very much fine. \n\n2. mine lasts for 12 years or whenever i decide i want it out. \n\n3. mine does not stop my period. the copper one takes a while for your body to adjust to, so my first period after getting it inserted was absurdly heavy. i’ve had about three or four periods since then, and each one got better/ more regular. \n\nsince i see you’re looking to stop your period, i would recommend a pill- i used to take one called jolessa. it was a three month pill, i took it daily, and i just got my period every three months when i would stop taking the active pills. sometimes i would go longer and just not have a period. it was pretty good for that. i would recommend it. i only switched bc as i became more sexually active w my partner, i wanted to have a more regular period that i could keep better track of. and i didn’t want any more hormones, i always felt weird on my BC pill. and just make sure you’re mentioning any other concerns you have- i tried to switch BC pills after 7+ years on jolessa, and my new doctor was shocked they prescribed me a combined contraceptive pill and not a progestin only pill because of my migraines.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "You should also look at birth control implants.  I have the implanon.  They last three years. It's been brilliant for me.  No period for 10 years now. It takes about a week to become fertile again once it's removed.  Everybody reacts differently to it though,  so get some advice.  I like then better than the shot because if you have a bad reaction, you don't have to wait 3 months for the effect to wear off.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I'm on my second Mirena - lasts 5v years. I'll be honest with the first one I yelled something about why would you have kids because they're way bigger than that. My second time was an out/in replacement and was given something to dilate my cervix and it was no big deal. I didn't have full periods with my first one but did randomly bleed more often than the second go round. I do get some cramps to go with it that are worse than what I got on bc but can't remember how bad they were on nothing. Definitely worth it though, as you can see I got a second one even having pain on the first one.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "For copper iud \n1. It was uncomfortable, painful for about 30 seconds. I was able to drive home. Recovery was like a bad period \n2.  10 years\n3. No, it’s non hormonal. It can make them worse but they haven’t for me. Benefit of copper iud is you don’t get other hormonal side effects",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I’m on my second IUD, about 12 years and it was the one of the best decisions I’ve ever made. Not comfortable getting it in (or out), but not too painful either. (Have not had kids before.) At this point I almost never get my period, and even then only a few days & it’s glorious!",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Not all places give you meds for the pain, that is completely dependent on where you live and your doctor. The different ones all last different lengths and stopping periods also depends on the type and your own hormones levels.\n\nThey last either 3, 5 or 10 years. 10 being the non hormonal option. The first 2 are known to lessen/stop periods though spotting/ bleeding may occur and the last you will have a period, many report same or heavier.",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Ymmv. Mine migrated into my uterus, gave me crippling cramps and pain for three months, then tore my uterus when they removed it. I hemmoraged for two days, but it suddenly stopped on our way to the ER.\n\nOne thing that made it really difficult, was that this happened several years ago, and at the time, all I could find was good experiences. My doctor kept telling me the pain was mild/temporary /would improve, and all the online talk I could find was always positive and glowing. It made me doubt how I was feeling and delayed me getting help. So, while I still think it works great for a lot of people, I share my experience when I can. If it works, FANTASTIC! 🎉👏, if it doesn't or hurts badly and continuously, don't force yourself to push through it.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "This post makes me increasingly grateful I was finally approved to get my tubes tied and had it done.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "If I were OP I'd be binning any condoms she might have had access to before these 'jokes' and buying fresh ones. Just to be on the safe side.",
          "id": 25,
          "comments": [
            {
              "score": 37,
              "content": "I completely agree! because who knows how long she may have been fucking around with the birth control objects. Pills are much harder to replace (insurance issues, Its one of the reasons i hate the pills. its much harder to maintain a no period cycle with them because of insurance. ) so brand new unopened condoms are the safest bet.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Just fold the packet in half before opening it. If it's still got an air bubble the packet is still sealed aka no holes poked in it",
              "id": 27,
              "comments": [
                {
                  "score": 3,
                  "content": "The true LPT is always in the comments!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "> She has a hidden agenda.\n\nDoesn't sound very hidden to me. She just has an agenda.\n\nThat being said, I might have let one of these jokes slide. But her repeating these \"jokes\" against all efforts to change the topic shows something very clearly: She's constantly thinking about sabotaging OP's birth control. And from there and living in OP's house, it's only a small step to actually follow through on this \"joke\". Especially if she thinks that her \"reward\" will be her heart's desire - a child of her own, with her own DNA.\n\nI have to agree, though: These aren't \"jokes\", these are threats. Take them seriously.",
          "id": 29,
          "comments": [
            {
              "score": 54,
              "content": "I’d feel less threatened if my sibling said they would cut me, or kick my ass or something. Being pregnant is one of my top fears, this would not be funny at all for me, couldn’t even fake a laugh because I’d be horrified. But I’d also shut it down quick with an abortion/adoption come back so it’s clear even if mrs baby crazy follows through on her threats, she would never be rewarded.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "the reason I worded it like that is because I was trying to show the difference between someone who truly doesn't understand the impact (due to mental illness or even age etc) vs someone who has intent behind their words. Like in this case as you said she has an agenda and her intent is clear. \n\nAnd thats why me and another user have suggested she get brand new condoms and throw out ANY that may be in the house incase the sister already got to them, because yea I wouldn't put it past her to make the jokes AFTER completing the acts of sabotage.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Absolutely! If op did let them move in, and it happened — sister would be all, “I told you I might do it, and you were totally fine. It’s your own fault.”",
          "id": 32,
          "comments": [
            {
              "score": 31,
              "content": "She wouldn't even be that coy about it! She'd flat out day she did it and demand OP to keep the baby and just hand it over to her since she's the one who made the pregnancy happen because she fucked with the birth control.\n\nThough in some states this CAN get her a criminal charge. Granted it's typically used against a person in the relationship and not a sister or mother but their is a old law regarding the sabotage of birth control by someone besides the person taking it in order to force pregnancy. (Though I'm sure the female could be in trouble for it as well but it's mostly targeted towards the males of the relationship since they are the ones who do the most in creating a pregnancy because yea they got the stuff needed) I cannot remember the law entirely it's just on the surface of my brain and in this case ALWAYS research or ask a lawyer. We ain't legal help or legal anything helpful. It was just something I remembered and was bugging at me to say something.\n\nI am truly concerned that OPs sister may do this to someone because they REALLY need help. I want kids too but I'd never go to that extreme. Like just no that's creepy. Messing with someone's birth control is down right creepy.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Yes, behavior has consequences.  Ignore all the people trying to make you feel bad for her bad behavior.  “Have you been berating sis for the “jokes” she kept making even though I tried to change the subject and be a good sport?  No?  Then that is where you need to be sending these messages.  She was rude and threatening and that behavior is unacceptable and you want me to be the bad guy here?  No.  She wanted a favor and then said those things to us and that’s ok with you?  It wasn’t “joking” because she kept on and on about it even when it was clear we didn’t like her “jokes”.  So, no, I will not apologize for my behavior since I did nothing wrong and  you aren’t demanding she apologize for hers.  It’s time we took a break from you all so you can reflect on your behavior.”\n\nThen ignore them all for a few months and see if they can treat you two with respect.  That means block them on SM, email, phones, the works.  If they show up at your house then you text them to leave.  It sounds like they have excused her bad behavior her whole life so she now thinks it’s acceptable to act that way as an adult.  Time to teach all of them that she no longer gets a pass.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "That's if op even recognizes in under 6 weeks that they're preggers. And stopping and medicine like that is not okay. And op needs security cameras yesterday.  With the state of abortion rights in America this is especially heinous",
          "id": 35,
          "comments": [
            {
              "score": 5,
              "content": "I completely agree",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Literally put you BC in a lockbox/safe. I am *not* kidding OP.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And if her parents have keys to her place, the locks should be changed immediately.",
          "id": 38,
          "comments": [
            {
              "score": 9,
              "content": "I'd change the locks anyways because it's NOT that hard to snag the key and make a copy",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "NTA OP\n\nBehind every joke is a sliver of truth",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "You can call child protection all you want but there has to be evidence of abuse or neglect and a court order to remove a child. \nThat removal is temporary. \nYou can't make up a story and immediately gain permanent custody of an infant.",
          "id": 41,
          "comments": [
            {
              "score": 22,
              "content": "I know but seeing how off the rocker her sister is, I'd be fearful that she would go to the extremes to get the kid taken away. I'm not saying she'd get instant/permanent custody either its just I'm fearful she'd go to extremes to make their lives HELL (on top of the unwanted pregnancy etc) and sadly I've seen CPS drop the ball WAY to many times to believe they'd follow due process.",
              "id": 42,
              "comments": [
                {
                  "score": 2,
                  "content": "I was a delegated child welfare worker but not in the United States",
                  "id": 43,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I'm in the US and sadly CPS has dropped the BALL A LOT, granted not always their fault since they are underfunded, undertrained, and have shitty caseworkers and police often don't exactly help esp when its a teen vs parent thing (the parent typically can convince both the caseworker and officer that the teen is just \"Acting out\" and that theirs nothing wrong etc)\n\nSo sadly CPS can be a great resource in some places but in others.....completely useless. I was lucky and we had a smart caseworker that told the \"reporter\" to fuck off and never to call again on my mother. (they claimed I was being neglected, that my mother was NOT homeschooling me and the house was a mess. We had 4 dogs, mum was disabled and I had a stack of educational computer discs that hit my hip. i was 4'5 or close to 5' so pretty high stack, plus all my home school books AND my massive stack of \"return to library\" books. the caseworker was PISSED for the false report, because no babies were in the house and I was a really messy kid thus my room was a pigsty. She closed the case) so ultimately it depends on where the CPS is located and funding and how much they actually want to help etc.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1562,
      "content": "NTA . ''She asked me if i’d be willing to have a baby and give it to her and i said no.\" \n\nAfter the above i would say that your sister is of questionable mental stability and you can not disregard her ''jokes''. It would best to stay away from her.\n\nP.S  Are you twins? if you were that would really spice up the story.",
      "id": 45,
      "comments": [
        {
          "score": 669,
          "content": "No, we’re 5 years apart. I’m 21, shes 26",
          "id": 46,
          "comments": [
            {
              "score": 581,
              "content": "So you're young and probably don't want kids yet - great timing to push you to let them adopt a 'surprise' baby.",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 176,
              "content": "Is this the first time she's exhibited psychotic behavior?",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 97,
              "content": "Has she always been the favorite to be babied and given everything she wants?  Sounds like it.",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 84,
              "content": "OP, I am 22, my sister is 26. She might not be able to have bio kids due to reasons, and her boyfriend really wants children, I told her if she couldn’t have kids I would be willing to look into surrogacy for her. She said *no*. She said that she would adopt instead. *That* is what a good big sister does, especially because you didn’t *offer*. If she wants a baby that’s biologically hers so badly she can look into gestational surrogacy.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Op this is some weird sneaky way to do reproductive coercion imo. Keep her away from your no baby supplies.  Nta she is scary.",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "No no no. It is especially messed up that you are younger than her. What’s more: From what I am reading, you are not even supposed to be a surrogate mother unless you have already given birth before. It was wrong of her to even ask you that in the first place. You are absolutely right to tell her no, and not to let her live with you. This is not a risk you want to take.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "What she joked about doing is a felony.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1316,
      "content": "im a bitch and would say'thats what abortions are for'..",
      "id": 54,
      "comments": [
        {
          "score": 195,
          "content": "Heeeeyoooooo!  Take my upvote",
          "id": 55,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 132,
          "content": "I don't consider myself a bitch, but I'd say the same.",
          "id": 56,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 78,
          "content": "Samesies!! NTA OP",
          "id": 57,
          "comments": [
            {
              "score": 63,
              "content": "[When people are already making “samesies” happen from a previous post. 🤣](https://www.reddit.com/r/AmItheAsshole/comments/pu737p/aita_for_telling_my_brother_he_downgraded/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
              "id": 58,
              "comments": [
                {
                  "score": 15,
                  "content": "Holy crap I didn’t even see the other post! 🤣🤣🤣",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "My mind immediately went to that post 😂😂",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I came here to say this !! Haha",
          "id": 61,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 899,
      "content": "NTA. Tampering with birth control is not a joking manner.",
      "id": 62,
      "comments": [
        {
          "score": 351,
          "content": "If your partner tampers with birth control, it is aggravated sexual assault in a lot of places - it's RAPE. If you sibling does it, to force an unwanted pregnancy? Legally it's probably assault (don't quote me on that), but morally? Ethically? It's unforgivable. 'Joking' about it? That's a joke in the same way telling someone you're going to beat them black and blue and detailing every bone you're going to break is a 'joke' - it's a THREAT.",
          "id": 63,
          "comments": [
            {
              "score": -145,
              "content": ">If your partner tampers with birth control, it is aggravated sexual assault in a lot of places - it's RAPE.\n\nOnly if the male partner does it lol.",
              "id": 64,
              "comments": [
                {
                  "score": 94,
                  "content": "Actually, as the law is written in most places, ANY partner who tampers with birth control has committed assault - a woman who pokes holes in a condom has violated consent as surely as a man who does so. \n\nGetting someone to PROSECUTE it is an entirely different issue... But that also holds true for perpetrators of both genders. The biggest issue, it seams, is proving that there was tampering - and given condoms' fail rate if not used exactly correctly, it's hard to prove. Tampering with pills is easier, but again, very hard to prove.",
                  "id": 65,
                  "comments": [
                    {
                      "score": -81,
                      "content": "That's probably true, but it's largely written about as something that men do to women and not the other way around.   My comment was supposed to be in jest.   I really don't know what the consequences of third party interference with birth control would be as it doesn't seem to be contemplated by people who write about it.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": ">Says something offensive multiple times\n\nDude quit being a fucking asshole\n\n>Woah chill out man, I'm just joking. What are you? Some sort of snowflake? Why do you have such thin skin?",
          "id": 67,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 501,
      "content": "NTA.\n\nAnyone who objects to your refusal to host them in *your* home is more than welcome to roll out the welcome mat at *their* home.",
      "id": 68,
      "comments": [
        {
          "score": 54,
          "content": "If there are no means of birth control in the home for them to mess with they'll probably turn down the offer",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Anyone who objects to your refusal to host them in your uterus... same",
          "id": 70,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 435,
      "content": "NTA those are seriously weird and oddly specific “jokes” to make. I wouldn’t take that lightly.",
      "id": 71,
      "comments": [
        {
          "score": 328,
          "content": "There was an article I read years back that discussed how a certain type of \"joke\" isn't ever actually intended to be a joke. It's about testing the waters, either to see if there's like-minded listeners or to gauge how strongly someone might react if it were presented seriously.\n\nSister was 100% testing to see how easily she could get away with doing *exactly* what she's threatening and who would support her afterwards. OP needs to be VERY careful around her sister because that wasn't joking, that is sister laying out her intended roadmap to getting herself a baby and seeing who, if anybody, would call her out for it, while she can still claim \"it's just a joke\" as plausible deniability.",
          "id": 72,
          "comments": [
            {
              "score": 105,
              "content": "The fact that their parents didn't call them out is a huge red flag on the parents and really messed up. Maybe manipulation runs in the family...",
              "id": 73,
              "comments": [
                {
                  "score": 26,
                  "content": "They probably want grandchildren! Why would they object to the sisters devious plans to make one?",
                  "id": 74,
                  "comments": [
                    {
                      "score": 6,
                      "content": "It's scary that this does actually make sense",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Why does the sister just assume OP would give a baby to her? That's a bold assumption.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Like how if someone in A couple might like to have a threesome they'll make \"can you imagine if we did that, haha so weird amiright?\" Jokes.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Jokes are funny and have punch lines\n\nThese are just mocking threats. Its different",
          "id": 78,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 328,
      "content": "NTA not only are her 'jokes' not funny but highly inappropriate. I'm also trying to understand, so because you said no to carrying a baby for her she was hoping you would get pregnant and just what? Give it to her?",
      "id": 79,
      "comments": [
        {
          "score": 477,
          "content": "Ok we’ve had this discussion before when i was 18 or 19 she asked if i ever accidentally gotten pregnant instead of an abortion or putting the baby up for adoption, i should give it to her. At that time i didn’t even know how to reply and my bf (same one as now) told her we’d step up and be parents if it came to that not give our baby away. She didn’t like that response.",
          "id": 80,
          "comments": [
            {
              "score": 279,
              "content": "So she did just think you would just give her your baby? That makes her comments even worse. 100% NTA",
              "id": 81,
              "comments": [
                {
                  "score": 213,
                  "content": "Also it shows she has put substantial and prolonged thought into this, that would make me take her ‘jokes’ even more seriously!",
                  "id": 82,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Agreed",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "YEARS of thought",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "If you get pregnant and have a child, she'll probably call CPS for small things to get the baby taken away from you!!! NTA and please cut contact. And if you have a kid, talk to a lawyer.",
              "id": 85,
              "comments": [
                {
                  "score": 43,
                  "content": "Thats seriously scary and she spunds insane enough to do it. I would be scare of her ngl",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "This. I have no doubt that's the plan.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I’m definitely not going to tell my family if i get pregnant. I don’t trust them not to tell her. I don’t plan on having kids anytime soon but i’ll keep that in mind thank you",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 92,
              "content": "> she asked if i ever accidentally gotten pregnant instead of an abortion or putting the baby up for adoption, i should give it to her. \n\nYour sister is way too fixated on this \"accidental pregnancy\" story. To the point of daydreaming about sabotaging your birth control methods (hence her weird 'jokes').\n\nI would be very careful to keep your birth control safe in a place that she cannot access. Her 'jokes' are disturbing (the scenario she is joking about is so strange, it does not come to mind naturally), and indicate that this is a line of thought she has entertained in her head .\n\nNTA",
              "id": 89,
              "comments": [
                {
                  "score": 13,
                  "content": "She has no access to my house at all and we have cameras so there’s no way she can get in without us seeing.",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "oh geez your sister sounds exactly like my older sister, who by the way, I think might have some major unaddressed mental issues. Zero empathy, probably doesn't see at all how this would be a weird request. My sister REALLY would not, things most people would KNOW are boundaries she just doesn't get and she gets really upset when you point it out. In her mind it would be a totally reasonable thing to do and you just don't love her at all or you would do it for her. Look I know its easy to say \"oh she knows that's wrong\" but after 40yrs I am convinced in her mind...nope, doesn't register. If this was my situation and my sister, getting you pregnant by accident is totally what she would try to do because to her she deserves to have a kid and you are just being selfish by keeping it from her. We don't talk now. I am totally happy with that.",
              "id": 91,
              "comments": [
                {
                  "score": 10,
                  "content": "And the only thing that makes her think it’s okay is my family enabling it. If i talk about it making me uncomfortable they’re like “ohh it’s just dark humor, lighten up”",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Looks like we have the same sister O\\_O\n\nIf I learned anything from this sub is how common things I thought were crazy and completely off the mark are, especially within families. Sigh",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Hi OP, your sister doesn’t sound stable at all when it comes to her desire to become a parent. She sounds pretty desperate, but she’s not desperate enough to adopt a child that does need a home. This can actually make her into a big risk for any children you decide to have, since she already has her gaze fixated on you, your eggs and any pregnancy you may have, and she’s just assuming that if you do ever accidentally become pregnant, then the baby automatically becomes hers. \n\nOP, your sister made herself into a threat to you, she was not joking, she was being serious and she was forming a plan out loud (lucky for you she was saying it out loud.) Your sister sounds like she needs to be in therapy to cope with her infertility, cause it also sounds like she’s never allowed herself to process it and it also sounds like she’s never allowed herself to even think about her other options logically and realistically, which can be dangerous and it can make her mental health even worse. She needs to come to terms with her infertility, and she needs to maybe go over her options again before she ruins her relationship with you for good. \n\nSadly, it sounds like your parents are enabling her, which makes your sister all the more risky since she has them covering for her and they’re in her corner. They need to wake up and realize that your sister/their daughter is suffering big, and your sister is heading down a bad road full of suffering if she doesn’t get the help she needs. Instead of calling you a drama Queen, they should be shaking their heads wondering “what the heck is my daughter(sister)saying?!*” \n\nWhat are your parents going to do if one day you do decide to have a baby? Ask you to give your child away to your sister because she deserves it because she’s wanted to be a mommy so long? And what’s their plan for your sister once she realizes she really cannot have any children you bring into the world? They’re not thinking far ahead when they should be, do they know ALL the details about her baby rabies? And how far her jokes are getting?",
              "id": 94,
              "comments": [
                {
                  "score": 10,
                  "content": "Unfortunately my family believes she likes to make “dark jokes” and they don’t see a problem with them. Honestly i do believe she has some issues and hasn’t properly addressed them because she believes i’ll have a baby for her still so my best solution to that is cutting contact if/when i do have kids and as someone else said, getting a lawyer.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "GIRL. This is some SWF level shit, but your sister. Take this seriously\n\nETA: SWF, from the movie, Single White Female, because I just realized that I'm old and some of y'all probably really don't even get this reference",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "This makes it even more concerning that she’s talking about sabotaging your birth control—it sounds like she’s seriously been fantasizing about you getting pregnant and is mentally unstable enough to think she can convince you to give a surprise baby to her.\n\nIf it’s an option for you I would seriously look into getting an IUD.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You might want to add that in an edit. It makes it even worse.",
              "id": 98,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Regardless of what her *Intent* was, that means she obviously KNOWS that the subject makes you uncomfortable. She asked, you said no & she persists. Thats not acceptable \n\nTo me that's a perfectly valid reason for not wanting someone in my home 🤷‍♀️🤷‍♀️ \n\nI dont care *WHAT* the subject matter or \"jokes\" are, if someone knows it bothers you,  ignores that & selfishly keeps going with it, not at all respecting your very reasonable boundaries then why would you want her living in your home?? \n\nIf someone kept coming in & taking a piss on my kitchen floor, guess what? \n\"Its just how I am not to put up with that garbage.\" \n\nI dont care if it's her opinion on what the best TV show to watch on a Thursday night ffs! My home is my safe place, drama free & for anyone thats determined to try forcing their opinion on something IN MY HOME, Doesn't need to be invited to live there. Just that simple for me \n\nBut I also absolutely agree with everyone else that this situation specifically is scary as fuck because your sister somehow thinks she has rights or dibs on your reproductive decisions. Good Lord, just NO 🤦‍♀️🤦‍♀️\n\nThis has been an ongoing, YEARS worth disrespect & borderline obsession of hers that your parents seem to be enabling? Maybe because they want grandchildren idk? \n\nWhatever their reasons are is is NOT okay. \nWhen they come back with the \"Its just how she is\"? \n\nStart giving responses like-\n \"I dont like being seen as an incubator, just how I am\" or \"I like knowing my autonomy won't be sabotaged in my own home, just how I am\". \n\nTurn that shit around on her/them! \n\n\"Just how she is\" is just an excuse for bad behavior & ppl that dont want to rock the boat. Well, Im a boat rocker 🤷‍♀️🤷‍♀️\n\nShes going out of her way to make you uncomfortable & cross your boundaries, flip it on her & push back with how NOT acceptable that is until she learns to back off \n\nNTA\nu/vavaavaav\nPlease take steps to protect yourself. After already telling her no & this additional info makes me legit wonder if she hasnt ALREADY somehow sabotaged your BC & her \"joking\" about it is exactly a way to open the door to see what others response is. Me personally? I would change my locks & have VERY limited contact with someone like this no matter how related we are. Your sister needs serious therapy. None of that is a \"joke\".\n\nShes shown you who she is & what she feels entitled to. Please believe her & listen to your gut. Best wishes, stay safe 💜💜",
              "id": 99,
              "comments": [
                {
                  "score": 10,
                  "content": "She’s never been in my house alone and she’s never been in my room at all to tamper with any of my BC, it’s ok!! I have cameras too so i’ll know if shes been around while my bf and i were out or anything of that sort! No one else has a key to our house but us and she’s never had my keys to make a copy of it. After reading comments, i’ll for sure prepare myself  if/when i have a baby but that won’t be anytime soon so i’m good right now!",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "So she's been thinking about this for at least THREE YEARS? Aw HELL no.",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 162,
      "content": "NTA. \n\n&#x200B;\n\nDon't for one second kid yourself that she's joking - she isn't. She's deliberately putting herself in a position to make her twisted little fantasy become a reality. And even at longest stretch she was actually joking, it would have been dropped after you requested her to. Reddest of red flags are out in full view.",
      "id": 102,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 129,
      "content": "NTA. it sounds like she DOES want kids that have her DNA, she just doesn't want to be the one to carry a child. sketch af vibes i would not keep her around and i would even let her know \"you seem to be really fixed on the idea of sabotaging my birth control, which makes me feel uncomfortable and unsafe around you.\"",
      "id": 103,
      "comments": [
        {
          "score": 102,
          "content": "She cannot have kids, she’s infertile. They’ve been trying for years.",
          "id": 104,
          "comments": [
            {
              "score": 57,
              "content": "oh i totally misread and thought she \"doesn't want kids that shares DNA\" that was totally my b. okay in that case her intentions are CREEPY obvious and i would stay away from her as much as possible. so sorry.",
              "id": 105,
              "comments": [
                {
                  "score": 21,
                  "content": "That's what's even more fucked up. She won't consider adoption. She ONLY wants a baby that shares her DNA. What a self-serving AH.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "INFO: Do you even want to have kids? Like on your own?",
              "id": 107,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "She has to get it through her head that you are not an extension of her.. she is not entitled to you, your body or your future child/children. What will she do if you start trying for a baby one day? She needs to back the fuck off of this psycho fantasy and start respecting you as a sister and a human. If you ever have a baby- that will make her an AUNTY, not a mother.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -25,
              "content": "Part of me says you should have gotten flirty with her hubby and \"joked\" about letting him impregnate you the old fashioned way, but that would probably give her ideas.",
              "id": 109,
              "comments": [
                {
                  "score": 33,
                  "content": "> Part of me says you should have gotten flirty with her hubby and \"joked\" about letting him impregnate you the old fashioned way, but that would probably give her ideas.\n\nWhat a weird, inappropriate suggestion. Sounds just as creepy as OP's sister.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 11,
                      "content": "It's super creepy, but I'm not sure if it's any less creepy than what her sister was joking about\n\nWouldn't be my suggestion for vengeance, though",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 86,
      "content": "NTA. None of that seemed like a joke. And if it was she would have backed off when you stopped laughing.",
      "id": 112,
      "comments": [],
      "relation": "Support"
    }
  ]
}