{
  "post content": "EDIT: Thanks for the responses.\n\nThe friend apparantly already had my number for some months, my roommate once asked me if she can give it to her because she wanted to contact me for a project. She never contacted me though, so I didn't have hers.\n\nEDIT 2: About the \"drugged\" part: she claims that she was invited to try a pill by a friend, but the friend didn't tell her what it was, how strong it was and how long it would last, then she was abandoned by this friend.\n\n&#x200B;\n\nThis happened two nights ago. My (mid 20ies, nonbinary) roommate is away visiting her family and I'm alone in the apartment.\n\nWe have an agreement that we don't have guests while we're not there ourselves. I inisted on this agreement because in the beginning, my roommate would give her keys to friends. Her friends would bring other friends, and apart from leaving the apartment dirty, it became a saftey concern.\n\nSo the other night at 02:30am the doorbell rang. I wasn't expecting anyone, so I ignored the first time. The second time, I went to check it out. We don't have a camera, we only have a microphone. \"Who's there?\" I asked. \"Can you open the door, pleeeease?\" asked a voice I couldn't identify. I couldn't even tell if it's a man or a woman. \"Who are you?\" I asked again. \"Please open?\" repeated the voice and rang again. \"Can you hear me?\" I asked. \"Yes I can hear you, open the door!\" I then heard the person walking away so I decided that they were probably mistaken. Around 03:00am the doorbell rang again. \"I won't open unless you tell me who you are.\" I said through the microphone. \"Huh, gosh!\" said the voice angrily and continued to ring. I was very uncomfortable and made sure the door was well locked. I informed my partner on what was happening. While I was on the phone I received a message by an unknown number. It said \"\\[my name\\] OPEN THE DOOR\". I saved the number and opened a messenger service to check out if I can find anything out about the person. There was no name displayed, but a blurry photo. I could recognize the person on the photo as a friend of my roommate I saw once. I couldn't remember her name, so I texted back \"are you \\[roommate\\]'s friend, the one with the bicycle tattoo?\" But there was no response anymore. I gave a quick call to the police about the incident, they said they would check out the street. I browsed a bit on my phone and at 04:15 i went back to sleep.\n\nToday my roommate called me. She said it was an a-hole move to leave her friend outside, since it was obvious that she was alone and drugged. And that she could not respond to my questions because of the drugs. My roommate thinks I should have at least gone down to the main door to take a look at the stranger.\n\nI for my part don't think I have to open the door to someone who doesn't tell me their name, especially when they seem drugged and I'm home alone.\n\nThe girl apparently the sat at a nearby bench for a while before she managed to call a uber that brought her to her own home. But she mostly has a blackout from that night.",
  "id": 1,
  "comments": [
    {
      "score": 12395,
      "content": "NTA.  You're NOT supposed to open the door UNLESS you know who it is AND you want them to enter your premises.  Anyone who is unable or unwilling to answer the very simple question of \"who are you?\" is not someone who should be permitted in.",
      "id": 2,
      "comments": [
        {
          "score": 3680,
          "content": "This is a a safety concern!!!! You don’t go check into the unknown, you don’t leave the safety of closed doors. Your roommate needs to take some safety courses because that is how you get robbed. She can be careless for her own life but she has no right to dictate how you will respond. Get a new roommate when the lease expires.",
          "id": 3,
          "comments": [
            {
              "score": 2485,
              "content": "This roommate and her careless ways could've gotten OP into seriously dangerous situatuons. \n\nSure, it's her friend. But for OP, it's a drunken stranger banging on their door in the middle of the night. **A stranger that shows up, demands entry to someone else's home and, when being asked, refused to answer basic identification questions.**\n\nTheir refusal caused some inconvenience, but no real damage was done. Imagine what would have happened if it wasn't the friend, but a robber outside the door. They could've been robbed and OP murdered.\n\nOf course OP didn't let her in.",
              "id": 4,
              "comments": [
                {
                  "score": 2226,
                  "content": ">Their refusal caused some inconvenience, but no real damage was done. Imagine what would have happened if it wasn't the friend, but a robber outside the door. They could've been robbed and OP murdered.\n\nThe unwillingness (NOT inability) of the friend to say her name makes me wonder if there *was* some malicious intent.\n\nI just don't understand how the friend could function enough to a) find her friend's apartment; b) use her phone to text and c) remember OPs name to text her and yet not give OP her name.\n\nThere's something wrong and bad about this situation.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 795,
                      "content": "Agreed, the friend was able to text and remember her friend’s roommate’s name but couldn’t identify themselves.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 454,
                      "content": "Exactly. I have had seizures and blackouts from drugs. I have been completely out of it with no memory of the situation. And even then, when my name was asked (by paramedics etc) I GAVE THEM MY DAMN NAME. \nI have no recollection of giving them my name. But I did give them my name. \n\nI haven’t had any issues like that or overdoses for over a year and I now take a prescription instead of street drugs, but I do still remember those times (or being told about them after the fact when I woke up in the hospital) and I could always give my name when asked. Something was very wrong here. \nNTA OP. And I wouldn’t trust this “friend” of your roommate. She did not have good intentions. Maybe she wasn’t alone. Maybe she wanted to steal something. There are endless possibilities but there is no such thing as too high to give your name. Trust me.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 141,
                      "content": "And she had the wherewithal to remember that the roommate was away and to text OP.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 77,
                      "content": "Your completely right. Even in my worst drugged out states I could answer what my name (mainly nickname) was and I could tell people where I was and where I lived. If the police drove up and down the street why didn’t she stop them and tell them she needed help? Not sure where OP is but if she was in that bad of shape why didn’t she call them? I mean I’ve called the cops on myself to report a “drunk who can’t get home” and they came and took me back to my apartment and dumped me on floor.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "That's why I think they weren't drugged, just drunk and being deliberately obtuse. This exactly the sort of thing an idiot with low empathy would think it's funny to do when drunk.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Speaking as someone who likes to party a little harder than the average person, if you can operate a phone you can remember your own name. \n\nAnd putting aside all the real and logical safety concerns, come to my door at 3AM I may invite you in just to yell at you and tell you how rude and annoying you are before I throw you back out.\n\nNTA",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "OP needs to move out. I would lose my mind if I had a roommate like that. It’s way too chaotic to be remotely safe. Zero stability with foot traffic means no stability.\n\nOP, you’re NTA and I really think you need to live somewhere else.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Agreed she could remember your name to find it in her phone but not hers. She could text but couldn't use the uber app?  That's sketchy.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah, and functional enough to call an Uber, and give them an address. Yeah, chick is lying and friend is seriously dumb.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Or if said friend was a bad person themselves. It doesn't seem like the roommate is one to choose the most trustworthy friends",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 333,
              "content": "Not even just robbed, that's how you get killed",
              "id": 16,
              "comments": [
                {
                  "score": 50,
                  "content": "Agreed feeling shades of Kitty Genovese \n\n\nAlso happened in an apartment building….",
                  "id": 17,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Kitty Genovese was followed home. She wasn’t lured out of her apartment.  And her situation was so shocking bc so many people witnessed what happened (and inadvertently stopped the attack a few times) and didn’t call for help until after she was dead. Not a whole lot of parallels here.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "And, it could've been way worse than a robbery. OP could've been sexually assaulted and/or murdered. \n\nNTA. \n\nI get the roommate's probably concerned for her friend's safety, too, but at the end of the day the friend didn't identify themselves and OP made the right call.",
              "id": 19,
              "comments": [
                {
                  "score": 77,
                  "content": "NTA. \n\nAlso the call to 911 can work as protection for OP and in this situation as protection for the roommates friend if she was too high. IF YOU DO NOT KNOW WHO YOU ARE LETTING INTO YOUR HOME DO NOT OPEN THE DOOR\n\nEdit. Typo",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": ">the friend didn't identify themselves \n\nAnd even if they did, why would OP trust a rommates friend enough to let them in in the middle of the night?\n\nEasy NTA",
                  "id": 21,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yep, they could've still robbed, assaulted, or otherwise did harm to OP, though it does sound like OP may have opened the door if the friend just identified themselves.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Or accused themself of sexual assault and the drugging.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Letting someone you don't know who is, according to the roommate, \"drugged\" is a huge safety concern in itself. \n\nNTA",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "NTA\n\nRight? If this was the script to a slasher movie, you’d be screaming “no!” at the screen. It’s so obvious.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Call the police and say “someone at my door needs help but I’m afraid to let them in”\n\nDO NOT open the door. This is how many robberies and worse occur",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 736,
          "content": "If she’s not too drugged to find a friends place, and call for an Uber she knows her name. There is more to the story.",
          "id": 27,
          "comments": [
            {
              "score": 530,
              "content": "And able to find OP's number (how?) and text them? Nah, this is really suspicious. You're right, there must have been a reason they withheld their name.",
              "id": 28,
              "comments": [
                {
                  "score": 408,
                  "content": "And  she knew OP's name (a person she's barely met) but supposedly couldn't remember her own name? Come on. Both roommate and their up to no good friend are lying their asses off about this situation.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Roommate could very easily be told \"I was slipped something and managed to stumble to your house and [OP] refused to help\". No need for roommate to be in on something shady.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 328,
              "content": "I agree.\n\nIt wasn't an *inability* to say her name, it was an *unwillingness*.  And an unwillingness that continued when told point blank she wasn't getting in until she gave her name.\n\nIf she knew how to find the right place, remember OP's name to text her, then she was 'with it' enough to giver her name.\n\nThis whole thing is sketchy and reeks of bad intentions.",
              "id": 31,
              "comments": [
                {
                  "score": 61,
                  "content": "My suspicious mind can imagine a boyfriend or other person coercing her through this behavior, so they can rob the OP. Saying, \"tell them you are in trouble and need to get in, but whatever you do, don't say your name!\"\n\nIt's a common scam for some \"distressed\" woman to knock on someone's door to be let in (because it's an emergency!) and then they get robbed at gunpoint. This could be a similar thing.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Eh, I have friends who've done shit like that while blackout. Not going to a stranger's house ofc, but like successfully navigating across the city while unable to hold a conversation. I doubt it was like an attempt to rob anyone with what ops friend was saying the next day, but I still don't fault op for not opening to an unknown person who sounds very intoxicated, that's super scary when you live alone.",
              "id": 33,
              "comments": [
                {
                  "score": 92,
                  "content": "If you can text someone, you can also text your bloody name. No excuse.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 0,
                      "content": ">No excuse\n\nWho's excusing anything? They were just saying that drugs can make people act completely irrational. I don't know why you guys seem to be so upset over that claim. Nobody is saying OP should have let her in, just offering a logical reason for the friends odd behavior.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 50,
                  "content": "They forgot their own names but were still coherent enough to text an acquaintance?",
                  "id": 36,
                  "comments": [
                    {
                      "score": -4,
                      "content": "Have you ever had a bad time on drugs or blacked out on alcohol? You can do weird irrational shit.\n\nI don't understand why this seems to be a sticking point. Nobody was claiming OP was wrong just rationalizing the friend's behavior",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I once spent an hour trying to open my front door...before realising it wasn't my house.\n\nOP still did the right thing though. Safety first.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Good point, this whole thing sounds really sketchy.  OP you are NTA, your roommate is clearly disregarding your safety.  You did nothing wrong.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 173,
          "content": "Sober enough to find the apartment and buzz the right door\n\nAND to find the number of someone she’d never texted before\n\nBUT she couldn’t answer with her name??",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "Am I the only one who finds it a bit suspicious that they can text OP to let them in but is unable to answer a basic question about who they are.",
          "id": 41,
          "comments": [
            {
              "score": 2,
              "content": "Than stop when op realizes who it is",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "My question is why didn’t the roommate just call and let OP know her friend got drugged and if she could let her in until she sobers up? Having some random person demand to be let in is fuckin weird.",
          "id": 43,
          "comments": [
            {
              "score": 17,
              "content": "Where are you getting that the out-of-town roommate knew anything about the friend showing up as it was happening?   AND OP and the roommate had already agreed to not allow the other's friends into the apartment when they weren't there to host their own friends.",
              "id": 44,
              "comments": [
                {
                  "score": 12,
                  "content": "That's another strange thing, isn't it? Why didn't the person at the door call their friend and say \"Ask your roommate to let me in\"?\n\nCombined with the fact that the friend was capable of finding OP's name and sending a text to her but repeatedly refused to say her own name, and left after OP figured out which friend she was, I don't think this was an innocent encounter.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Also, she was too drugged to say her name, but could text a cohesive message to OP?",
          "id": 46,
          "comments": [
            {
              "score": 10,
              "content": "How did she know OP's number if she was too drugged to remember her own name?",
              "id": 47,
              "comments": [
                {
                  "score": 2,
                  "content": "It is really hard to drug yourself into that state in general according to other comments",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "[removed]",
          "id": 49,
          "comments": [
            {
              "score": 29,
              "content": "[deleted]",
              "id": 50,
              "comments": [
                {
                  "score": 2,
                  "content": "Good not a bot ;)",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "She can't answer that simple question but can call a Uber, give them two addresses, pay for herself and go home. Crack of my ass. NTA",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "[deleted]",
          "id": 53,
          "comments": [
            {
              "score": 62,
              "content": "My read of this:\n\n> My (mid 20ies, nonbinary) roommate\n\nis that OP is the nonbinary one.  Not the roommate.  Otherwise the designator would come after \"roommate\" instead of \"my\".",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 41,
              "content": "Nonbinary doesn't necessarily mean they/them. It's possible op is being shitty, of course, but we shouldn't assume that a nonbinary person can't use she/her, he/him, or any combination of pronouns.",
              "id": 55,
              "comments": [
                {
                  "score": 18,
                  "content": "Yes, I have a good friend who is  non-binary and goes by he/they. Some people use “they”, some use “him”, some switch back and forth - he’s happy and comfortable with either set. He just doesn’t use “she/her”.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 25,
                      "content": "This is why people need to stop patrolling pronoun usage for other people. It's gender identity, not mutism. They don't need speakers or translators. \n\nIt's nothing but holier-than-thou bullshit 99% of the time. It's just a video game to these faux heroic people.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My sister is nonbinary and still uses she/her. I have told her to let me know if she ever changes her mind on that.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "I read it as OP is non-binary...",
              "id": 59,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -1,
          "content": "[removed]",
          "id": 60,
          "comments": [
            {
              "score": 18,
              "content": "Bad bot!  Reported.",
              "id": 61,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3723,
      "content": "NTA\n\nNo one should have opened that door. Who the fuck opens a door to a person who refuses to identity themselves.",
      "id": 62,
      "comments": [
        {
          "score": 1217,
          "content": "And on drugs? Seriously!  They could have been a violent drug user. And I'm sorry to sound fuddy ruddy but who the heck lets an uninvited stranger who refuses to identify themself and is rude in?!?!\n\nSorry op, you need a new roommate.  Heaven knows how many copies of your key have been given out. \n\nNTA",
          "id": 63,
          "comments": [
            {
              "score": 335,
              "content": "I don’t even pass the phone if someone calls on and refuses to identify themselves. If I won’t do it over the phone, why would I do it if the unsub is banging on my door.",
              "id": 64,
              "comments": [
                {
                  "score": 114,
                  "content": "You watch criminal minds don't ya? :)",
                  "id": 65,
                  "comments": [
                    {
                      "score": 87,
                      "content": "Lol. I thought long and hard about using that term and I was like…it felt appropriate:)",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Lmao I was reading this post thinking, “Don’t open the door! The first thing Rossi would tell you is don’t open the door!”",
                  "id": 67,
                  "comments": [
                    {
                      "score": 30,
                      "content": "I mean just because you’re home doesn’t mean you have to answer the door or phone if a friend rings. If you scheduled something then yeah but if you made no promises and can’t deal with anything, it’s ok to be “indisposed” or “unavailable”.\n\nBut yeah…stranger? I don’t recognise all the people who ring our gate bell…if I’m home alone…yeah right I’m responding to them.",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": ">And on drugs? Seriously!  They could have been a violent drug user.\n\nI read it as the friend had been drugged, aka roofied or something, not was intentionally on drugs. While I can certainly empathize with a person being drugged, scared, and showing up to a familiar place (that was potentially close by), OP is still not the AH because her/their personal safety comes before taking care of an unidentified practical stranger. It also appears the friend was in no real danger (aka was not be pursued by her drugger).",
              "id": 69,
              "comments": [
                {
                  "score": 13,
                  "content": "Good point, the friend could have been roofied. I didn't read it that way as there is no mention of attack, hospital when roommate called. That's a weapon that would have been lobbied at op. Or op could also have omitted it. It felt the former to me, sorry.\n\nI will admit, your comment made me re-read it. How did the friend get hold of op contact number? 🤔 Did the roommate give op number out? Was the roommate aware of the situation? It's very timely message, don't you think? I'm wondering whether the friend was really that impaired. Just wanted the easy option of laying head down somewhere. They texted the roommate for op number. I'm assuming too that roommate didn't contact op directly because, a, they were not concerned about friends welfare and b,  didn't want to argue about previous agreement ref randoms  in the home.I\n\nIf they were worried about their friend being roofied, surely they would have called op directly and asked them to help?\n\nAm I over thinking this? 🤔 Very probably, sorry!!!😂",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "That's not remotely 'fuddy ruddy'. I agree totally. And at 3 in the morning, as well!",
              "id": 71,
              "comments": [
                {
                  "score": 11,
                  "content": "Thank you. The roommate didn't even sound apologetic to op for their disrupted night.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly. Even if I knew who it was, I wouldn't have opened the door.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "Well apparently OP's roommate thinks that everyone should do that. The roommate is unreasonable, unreliable and untrustworthy. And has proven this for some time (previously having given all manner of strangers free access to the apartment). Time for a new roommate....",
          "id": 74,
          "comments": [
            {
              "score": -4,
              "content": "Time to get some of your friends that the roommate hasn't met yet, to \"prank\" roommate by doing the same thing to them. Big friends, with beards and tattoos. If she opens the door for them, then she is proving that she would invite serial killers in, and OP needs to not live with her any more. If she doesn't, OP gets to ask why in the same way.",
              "id": 75,
              "comments": [
                {
                  "score": 13,
                  "content": "This is a terrible idea. It’s a great way to get your friends caught up with police if and when the roommate panics and dials 911, or hurt in an altercation if the roommate has a friend with them.",
                  "id": 76,
                  "comments": [
                    {
                      "score": -1,
                      "content": "That's why you do it when you are home, just schedule them to ring for entry while you are \"in the shower\" (actually watching them with facetime or something). They can't get in legal trouble if you invited them. The point is to just see if she will follow her own rules, or if she will stop and go \"oh hey, letting strangers in might NOT be a good idea!\"",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "OP is under no obligation to get a peephole for the door, but it can't hurt in the future...",
          "id": 78,
          "comments": [
            {
              "score": 172,
              "content": "We have peepholes in the apartment's doors, but not in the main door of the building.",
              "id": 79,
              "comments": [
                {
                  "score": 26,
                  "content": "I wouldn’t want to live with someone who thinks letting someone in, in this scenario is a good idea. If moving is an option I would consider it.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 85,
              "content": "A peephole isn't really useful if you don't know who someone is and they won't tell you who they are.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "The friend was at the main door and wanted to be buzzed into the building, I think. OP couldn’t see them because they weren’t in front of her apartment door. \n\nI also wouldn’t have gone out into the hall to check through the main door, even if it *did* have a peephole or was made of glass like my building’s main door is, because it gets harder to keep saying “no” at that point. You also wouldn’t know if they’re working with someone else who was already let into the building by another apartment buzzer, who would overpower you and break in after you’d been lured out by the person at the main door buzzer. \n\nI watch a lot of *Criminal Minds* lol.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Yeah, roommate is an AH for allowing their friends to waltz into the apartment anytime they want, even when they themselves are not there. It's completely disrespectful for the roommate to behave that way... \n\nEven aside from that, someone that OP doesn't even know well enough to remember their name, who refused to identify themselves after being asked multiple times and even offered an identity (are you roommates friend with the bicycle tattoo) thinking they're entitled to enter an apartment without offering any explanation... Even drugged, she should've been able to answer the question \"who are you\" especially if she's able to ring the bell, ask the person to let them in multiple times, find their number and text them, and eventually call an Uber. Those are all things that I've been too drunk to accomplish before, but I was still salient enough to be able to tell someone my name when asked. \n\nNo, you don't open doors for people who refuse to identify themselves, \"just because they're drugged\" as if that makes it any better???",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Also who the eff opens the door to ANY uninvited guest ringing the doorbell in the middle of the night? I would never, ever answer that door. Good on OP for not letting this person in. Beyond all the nefarious intentions being attributed here to the roommate's friend, it is also just weird, rude, and entitled as hell to go ring someone's doorbell like this and demand to come in. Huge nope. NTA.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1680,
      "content": "NTA. Why on earth would your roommate think it's ok for you to deal with a \"drugged\" stranger alone? And honestly even if they had been sober there is still no reason to let them in.",
      "id": 85,
      "comments": [
        {
          "score": 797,
          "content": "The person was able to find the apartment more than once and was able to send a text but was too \"drugged\" to say their name when asked repeatedly?! I'm calling bullshit.",
          "id": 86,
          "comments": [
            {
              "score": 482,
              "content": "And being able to respond to “Can you hear me” with “Yes I can hear you” but unable to respond with her name when asked for it? Perhaps she was high, but it was certainly not “obvious” that she was drugged (implying someone drugged her as opposed to “being on drugs”), and it sounds like she deliberately didn’t say who she was. \n\nMaybe roommate has complained about the rules and in her inebriated state her logic was “If OP doesn't know I’m roommate’s friend the rules won’t apply to me!”",
              "id": 87,
              "comments": [
                {
                  "score": 223,
                  "content": "On a more sinister side of things: that’s an easy lick. Have one person pretend to be injured/drugged with another waiting nearby.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 75,
                      "content": "And this person had a phone on them, since they texted OP, yet did not call: actual friend nearby/family member/911 after relising they were slipped sth? But were sober enough to somehow get OPs number???\n\nYou're right it reeks of bad intentions.",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": " \"That's Bait\"  -Fury Road",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 56,
                  "content": "This is exactly what happened. \"OP doesn't allow use of the apartment to roommate's friends when roommate isn't there, therefore OP can't know that I'm roommate's friend. Instead I should vaguely imply that OP knows me and should let me in, in SPITE of being one of roommate's friends, who has yet to identify themselves at all. This is a good plan.\"",
                  "id": 91,
                  "comments": [
                    {
                      "score": 33,
                      "content": "This is honestly the best case scenario as well as the most likely one.\n\nSlightly less likely is that she was there to rob the place and in her drugged state felt that the police would be unable to find her so long as she didn't give her name.\n\nEither way, we are not obligated to risk ourselves to help strangers.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Or dial 911 themselves?",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "And they somehow knew OP’s number. I’ve noticed a lot of comments leaving that out.",
              "id": 94,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I didn't even want to deal with my drugged sister with help! A drugged stranger alone would be so much worse!",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 968,
      "content": "NTA - You have zero obligation to open your door to a drunk stranger. If they had asked for help, then calling the cops/medics without letting them in would be civil, but they hadn't, they just demanded entry.",
      "id": 96,
      "comments": [
        {
          "score": 101,
          "content": "This is why I have a video doorbell...in every place I've lived, some \"friends\" or \"family\" of previous residents would come around from time to time. When they discovered their amigo(s) no longer lived there, they'd often ask for money for various things (food, the bus - even though it was often 2 AM and the buses had long stopped running - etc.). Now I can just see who it is and ignore them, and if they are persistent, answer with a polite \"do you need some kind of emergency assistance? I can call for help for you.\" That usually causes them to go. Once a woman rang the bell like 4 times, and when I made that offer said she had been robbed and would I call the police. No problem! I'll even check the motion sensor history on the camera and let them know if I caught anything that will help!",
          "id": 97,
          "comments": [
            {
              "score": 13,
              "content": "Short story short...I told her to sit on my bench in my front yard, I was calling and the police would be here shortly. She did so and the police arrived within about 2-3 minutes. I went out once the police arrived and she did seem to be distraught, if a bit incoherent (women are allowed to get drunk and being the victim of a robbery would suck). The camera didn't pick up anything but the times she was ringing, but I still sent the videos over to the police since they said they'd check for cars that matched the description she gave them. The police took her (I assume home) once they got everything they needed at my home, and I, of course, didn't get updates since I wasn't really \"involved,\" even as a witness (I didn't see a crime, just heard about it).",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 708,
      "content": "NTA \nI would have called the police the second time she rang!",
      "id": 99,
      "comments": [
        {
          "score": 66,
          "content": "Yup. Bonus - if she’s really not in a good way and “drugged” (which I have trouble believing since she was coherent enough to text OP and answer other questions, but let’s say she was) then she’ll be safer with the police. Less of a danger to herself and others, and if she needs medical attention there’s a higher chance she’ll get it.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Same.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 538,
      "content": "NTA. You aren't the asshole at all for not being willing to put yourself at risk. Your roommate knows the boundary and didn't enforce it herself with her friends, which makes her TA,and the friend was sober enough to get to the home plus somehow get your number and text you, so they were probably sober enough to get an uber.\n\nYou may need to have a talk with your roommate again when she comes home, but this is unacceptable and she should have called to apologize for the disturbance and stress her friend might have caused, not called to complain to you for protecting clear and agreed upon boundaries.",
      "id": 102,
      "comments": [
        {
          "score": 135,
          "content": "Also, since they were sober enough to get there and text, they should've been able to say their name at least. OP still wouldnt be obligated to let them in, but could've called roommate to talk to it through at the time.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 534,
      "content": "NTA. All the information that you had at the time was that somebody was demanding to get into your house and refusing to tell you who they were. What happened to her is terrible, assuming based on your word choice thatsomeone drugged her against her will/without her knowledge.  But you can't just assume that someone demanding to come into your home in the middle of the night and refusing to give their name is a friend in trouble and let them in no questions asked. It's perfectly fine to put your own safety first.",
      "id": 104,
      "comments": [
        {
          "score": 124,
          "content": "*It’s perfectly fine to put your own safety first.* \n\nTHANK YOU for that line!",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 316,
      "content": "NTA and holy heck your roommate is way out of line. \n\nWE DONT OPEN THE DOOR TO STRANGERS is a basic childhood lesson.",
      "id": 106,
      "comments": [
        {
          "score": 47,
          "content": "THIS. THESE RULES STILL APPLY IN ADULTHOOD!!!",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Her roommate might just be misplacing her fear for her friend onto OP.",
          "id": 108,
          "comments": [
            {
              "score": 3,
              "content": "Her roommate could very well have called OP to coordinate the situation and didn’t.\n\nIf roommate’s friend was that bad off and roommate and OP have a history with roommate’s friends and acquaintances coming by, roommate cannot expect OP to assess anything with the situation outside a stranger is ringing the bell at oh dark thirty for whatever reason.",
              "id": 109,
              "comments": [
                {
                  "score": 2,
                  "content": "If roommate didn’t know until later she’s probably panicking. OP is still NTA but best case scenario is roommate is looking for someone to blame to feel better.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 220,
      "content": "NTA - if they could somehow find out what your phone number was to text you “(your name) OPEN THE DOOR”, then they could have easily identified who they where when you asked them. Makes me doubt the “drugged” story they gave you, they were probably drunk and just wanted to be let inside without having to deal with you. If they where too “drugged” out to even tell you their name then they couldn’t have sent you that text.",
      "id": 111,
      "comments": [
        {
          "score": 29,
          "content": "I was going to say the same thing. NTA",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "and in all caps! i've emergency-blackout-drunk-texted before and looking at those texts the next day, they were *not* coherent, and that was with autocorrect.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 100,
      "content": "NTA\n\nNope, not opening the door for anyone I don't know and won't tell me their name. I don't believe the drugged bit either, they're just trying to make you feel guilty.",
      "id": 114,
      "comments": [],
      "relation": "Support"
    }
  ]
}