{
  "post content": "Throwaway so no one I know finds this (sorry for the format I’m on mobile) \n\nSo this one girl who I’ll refer to as D (22F) who I’m acquainted with posted something on her Snapchat story, it was something along the line of “I honestly want one of my besties to have a baby because I want to be auntie and have a niece/nephew and don’t come after me because I know you’d want the same thing” and honestly it rubbed me (20F) the wrong way because I’m childfree and have no plans to ever have kids so when people pressure others or say things like this, it upsets me, annoys me and honestly it’s not their business \nSo a few hours after I made my own post on my Snapchat story in response and although it wasn’t towards D’s post specifically, it was the last straw the made me do it\n\nMy response in summary was \n“It's frustrating when people pressure others to have kids. Pregnancy can be risky, and raising children can be expensive and mentally challenging. It's important to respect that some people choose not to have kids at all. I recently saw  posts that  pressure people to have kids, and it's disheartening how common this behavior has become. Ultimately, people's choices about their lives are none of our business.”\n\nI had a bunch of replies supporting and validating this claim but although I didn’t call out anyone specifically D figured out I was talking about her and replied to my story by saying it was a joke and if I don’t like her posts then to un add her, but I didn’t want to do this yet \n\nSo the day after I made another Snapchat story to hopefully clear things up and maybe even have D see where I’m coming from, in short I mentioned\n I was childfree and when people pressure others to have kids it upsets me  and how saying it’s a joke is not always an excuse I also said it’s like making joking about pregnancy on April fools which can hurt people who are struggling with infertility or had a miscarriage in the past, (which D has said in the past that this joke is disgusting and offensive) I lastly said It would be the last story I made on the topic because I didn’t want to cause any more drama\n\nBut of course this didn’t work and made things work because D respond to the story and said that I started the  drama and that she didn’t ask for my opinion and how it’s petty to keep posting about it on my story\n\nI responded that I understand it was a joke but it just made me uncomfortable and that I’m sorry if my Snapchat stories seem petty and that this was my last story on the topic and I want to move own\nWe bickered a little bit\n\nUntil D said she doesn’t care anymore and that it’s not her fault I can’t take a joke and how I could of just kept it to myself\nWhich I find kind of hypocritical because as I mentioned she’s ranted  about jokes she finds offensive in the past and yet she gets mad when I do the same?\nAs far as I know at least one of my closest friend and some of my other friends on my Snapchat are on my side\nBut D claims everyone on her snap knew it was a joke\n\nI honestly want other opinions and I know she thinks I am but AITA for starting all of this to begin with?\n\nEdit: Okay I get it, I’m the AH here. I won’t do something like this again unless it’s a really offensive joke like a racist joke or something and if I really need to rant about a joke or any post like this then I’ll probably just rant about to a friend or something.\n\nBut I would appreciate it if ya’ll didn’t make assumptions about me. This is the only time I’ve done something like this (and now probably the last lol) I’m usually pretty silent about my feelings or anything on social medias or almost anywhere for that matter.\n\nBut why did this of all things made me so upset and felt a need to rant about it and make a Snapchat story about it? Honestly I can’t really answer that since I’m not entirely sure myself, something inside me snapped I guess, I can’t really explain it.\n\nAs for D, I just decided to un add her and block her on all socials we had each other on. Mostly because she said to un add her if I don’t like what she posts\nWe weren’t really that close anymore as much as we use to be, and she probably wants nothing to do with me after this anyway so it’s not that big of a deal.\n\nEdit 2: I have no clue why it says No A-holes here when there were clearly more YTA votes",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "Oh my god, lighten up.  She said she wants to be an aunty, not that she wants you to have children against your will.\n\nYou're not an asshole for not wanting children, but man, you sound tiring to be around if you're going to take every small social media comment this seriously and personally.   So much drama for something so miniscule.  Just because people are infertile does not mean nobody can mention children or parenthood publicly anymore, just because my dad got cancer doesn't mean nobody can talk about cancer in my presence, just because I failed out of algebra doesn't mean others can't talk about how excited they are about their math degree.   If you don't like her posts, don't read them.  The infertile of this world do not need your crusade.\n\nNAH, this is the danger of social media - If you express your opinion, in either a light hearted or serious way, you're bound to piss someone off out there.  You and she just need to accept that not everyone agrees with you and move on.",
      "id": 2,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "I'm going with YTA. Simply because it almost seems like you jumped at the opportunity to get upset over this topic, and it really wasn't even aimed at you. She just said jokingly she wanted one of her friends to have a baby, which I'm assuming could have been anyone. And even at that, just laugh it off and say fat chance. I'm childfree myself and I gotta say the childfree community on here is just over the top gross and I find a lot of childfree people get so worked up about it any chance they get. \n\nI simply just started telling people \"I'll never have kids, I don't like them and don't want them in my life, and I got a vasectomy to make sure that happens\" end of story. If they poke and prod, let them or bluntly say \"kids suck ass and I never want one\" lol it usually ends the torment.",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "YTA who cares what someone says, we all learned about peer pressure in middle school, laugh at people for having ridiculous views and move on",
      "id": 4,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "YTA - In no way was she pressuring anyone, and most especially did not aim her post at you. More importantly. you should have directly spoken with her instead of making posts about it if it upset you so badly. Maybe just don't take silly posts on other people's feeds so damn seriously, there are far more important things in life to worry about.",
      "id": 5,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "YTA. Not everything is about you. No one tried to pressure you personally or anyone else to have children. Your friend is allowed to hope to be an auntie one day. That’s not somehow an attack on you or any other child free person. Sit down!\n\nAnd paragraphs are your friend. These long winded formats are hard on the eyes.",
      "id": 6,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "As someone who is also happily childfree, you overreacted and YTA. It doesn't seem as though this was directed at you or concerned you in any way, and there was really no need for such a hostile response.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "YTA. Thank you for choosing to not procreate. If you get this triggered over a cute post that wasn't even directed at you, you aren't even mature enough to adopt a fish. Or a plant.",
      "id": 8,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "*sighs in tired millennial* What makes you think she was even talking about you?",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel I’m the asshole because I feel started unnecessary drama because of a joke I didn’t like and I wonder if I should of just kept my opinion to myself instead\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway so no one I know finds this\n\nSo this one girl who I’ll refer to as D (22F) who I’m acquainted with posted something on her Snapchat story, it was something along the line of “I honestly want one of my besties to have a baby because I want to be auntie and have a niece/nephew and don’t come after me because I know you’d want the same thing” and honestly it rubbed me (20F) the wrong way because I’m childfree and have no plans to ever have kids so when people pressure others or say things like this, it upsets me, annoys me and honestly it’s not their business \nSo a few hours after I made my own post on my Snapchat story in response and although it wasn’t towards D’s post specifically, iit was the last straw the made me do it\nMy response in summary was \nIt's frustrating when people pressure others to have kids. Pregnancy can be risky, and raising children can be expensive and mentally challenging. It's important to respect that some people choose not to have kids at all. I recently saw  posts that  pressure people to have kids, and it's disheartening how common this behavior has become. Ultimately, people's choices about their lives are none of our business.\nI had a bunch of replies supporting and validating this claim but although I call out anyone specifically D figured out I was talking about her and replied to my story by saying it was a joke and if I don’t like her posts then to un add her, but I didn’t want to do this yet \nSo the day after I made another Snapchat story to hopefully clear things up and maybe even have D see where I’m coming from, in short I mentioned\n I was childfree and when people pressure others to have kids it upsets me  and how saying it’s a joke is not always an excuse I also said it’s like making joking about pregnancy which can hurt people struggling with infertility or had a miscarriage in the past, (which D has said in the past that this joke is disgusting and offensive) I lastly said It would be the last story I made on the topic because I didn’t want to cause any more drama\nBut of course this didn’t work and made things work because D respond to the story and said that I started the  drama and that she didn’t ask for my opinion and how it’s petty to keep posting about it on my story\nI responded that I understand it was a joke but it just made me uncomfortable and that I’m sorry if my Snapchat stories seem petty and that this was my last story on the topic and I want to move own\nWe bickered a little bit\nUntil D said she doesn’t care anymore and that it’s not her fault I can’t take a joke and how I could of just kept it to myself\nWhich I find kind of hypocritical because as I mentioned she’s ranted  about jokes she finds offensive in the past and yet she gets mad when I do the same?\nAs far as I know at least one of my closest friend and other friends on my Snapchat are on my side\nBut D claims everyone on her snap knew it was a joke\nI honestly want other opinions and I know she thinks I am but AITA for starting all of this to begin with?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 11,
      "comments": [],
      "relation": "No"
    }
  ]
}