{
  "post content": "My husband (37M) and I (37F) have 4 kids (16F, 15M, 13F, and 13M). Our twins are in the 8th grade. Our son, Bayard and our daughter, Addilyn.\r  \n\r  \n\r  \nOn Monday, my husband and I both got texts from Bayard that he needed to talk to us when we got home. We found this odd and were talking to each other before the kids got home. Once they were home, we spoke to Bayard in his room. He told us that he had heard that Addilyn was being rude to her History teacher, this teacher also has Bayard in a different period. The teacher is also Bayard’s baseball coach. Bayard and his friends look up to her, she knows so much about the sport and will talk to them about all the games going on, and she also gives them advice on things. My husband and I have never seen Bayard that mad, he was red in the face. He said he didn’t know much of the specific details, but he heard from some kids that Addilyn asked the teacher if she was on her period.\r  \n\r  \nWe emailed the teacher and got a reply on Tuesday, she admitted everything Bayard said was true and gave us some of the details. What she said was absolutely horrifying, she said it started when Addilyn was talking to some friends while she was trying to instruct the class, when she told her to stop, Addilyn refused. The kids were learning about Thomas Jefferson and one of the kids asked if he was autistic, as the kid had read it somewhere. Addilyn and her friends then made some joke about autistic people, who basically called them stupid.\r  \n\r  \nOne of the kids on the baseball team and Bayard’s friend, is autistic, and Addilyn is very aware of that. He is a really bright and sweet kid. The teacher told her that wasn’t very nice and tried to educate them a bit on what autism was, this is when Addilyn said that the teacher was “overreacting” and asked her if she was on her period.\r  \n\r  \nThe teacher admitted she didn’t call because she has had bad experiences with these types of phone calls in the past and was afraid of how’d we react, we told her she didn’t need to worry. \r  \n\r  \nAfter this, my husband and I talked and agreed that Addilyn would lose her phone for at least a few weeks and she needed to write an apology letter both to her teacher and to the boy she made fun of, even though he wasn’t in that period of her class.\r  \n\r  \nAddilyn wrote an apology letter to both but they seemed insincere and potentially AI generated, and when asked about it, she admitted she used AI to write it. We told her it needs to be genuine but she’s refusing to write a letter. She’s saying “forcing” her to write an apology is going against her right to express her true thoughts, and is calling us named, including a-holes. AITA?\r  \n",
  "id": 1,
  "comments": [
    {
      "score": 5429,
      "content": "JC, get control of your 13 year old. There's a difference of sharing thoughts & being blatantly rude. Don't let up on the apology. What an ungrateful, horrible child.\n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 1191,
          "content": "This attitude creatures a child who ends up being a monster when backs are turned.",
          "id": 3,
          "comments": [
            {
              "score": 952,
              "content": "She's a bully at 13, thankfully OP seems to have one decent twin. Addilyn needs to lose more than her phone.",
              "id": 4,
              "comments": [
                {
                  "score": -4,
                  "content": "Did the parents try talking to Addilyn? Maybe something else is going on in her life?",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -56,
                  "content": "That's not going to make her stop being a bully.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 67,
                      "content": "She needs to learn this kind of behaviour has consequences she won't like.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Unfortunately a lot of parents don't do anything to teach the kids that bullying is not OK. OP and his wife take it seriously. The daughter needs to learn that she won't get away with rude behaviour and bullying.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 824,
          "content": "Agree hard NTA/.  She had her fee expression and used it to be an asshole so you’re not curtailing shit.   Free speech doesn’t mean consequences free/. If she doesn’t want to apologise then sounds like she needs more consequences! \n\nYour job is to parent, that means punishing and teaching to be better, NTA",
          "id": 9,
          "comments": [
            {
              "score": 381,
              "content": "This. Hand written letter, no phone, sitting at the kitchen table supervised until its done. \n\nDoesn't seem sincere enough? Write it again. Failure to do so will result in item being taken away or things being canceled.",
              "id": 10,
              "comments": [
                {
                  "score": 244,
                  "content": "My rule was if they wanted to bully people and be rude to teachers, I'd go to class and sit beside them to make sure they were acting right. Your teacher can't control you? Well, I can.\n\n\nAlso, grounding and writing a couple page essay on autism would be a good start.\n\n\nAnd apology letter and taking a phone away is too easy.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 173,
                      "content": "Throw in an essay about how misogynistic her asking about the teacher being on her period was, about how in the past women were not allowed to enter churches or schools because they were unclean during their cycles. \n\nNTA for the punishment, but man, how did your kid get here?",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 83,
                      "content": "My mom used to say that if she ever heard of us acting like this, she would do exactly that. She'd go to class with us with her hair in curlers, maybe even throw on her bathrobe for good measure, and raise her hand to volunteer us to answer every question.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "That is effective as Hell. Had a student tormenting basically all of his teachers. They tried a lot of stuff that didn't work and his Mom started coming to school with him and sitting in his classes. Never saw somebody do an about face so fast. His Mom was a sweety too. :)",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I remember when the bully’s would have their parents come in and sit right at their desk with them! I totally agree. My favorite is when the teacher asks a question and the sit in parent says “oh my baby knows the answer they can answer that!” 😂",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I like you.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I agree with this solution! She sounds like a horrible kid who needs to be taught a lesson or two!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Also, have her volunteer at Austim Center.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "She was showing off in front of her friends. She wouldn't be allowed around those friends until she understands that her behavior will not be tolerated for one second. No social media either.",
              "id": 19,
              "comments": [
                {
                  "score": 20,
                  "content": "This, some students can be lovely one on one but become absolute nightmares trying to show off.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 226,
          "content": "This! They might not be assholes yet but if they let her get away with that they're going to be doormat for her. Sure she can express herself, so can you by literally giving her nothing that she doesn't need until she smartens up. No phone, no cash, no tv... She wants to see an asshole? She might just have to.",
          "id": 21,
          "comments": [
            {
              "score": 158,
              "content": "This is also such significant behavior, it’s hard to believe something didn’t happen or isn’t happening that’s motivating it. \n\nDiscipline is needed- but they also need to get to the “why”",
              "id": 22,
              "comments": [
                {
                  "score": 30,
                  "content": "Sadly this could be a lot of peer pressure(mean girls syndrome).",
                  "id": 23,
                  "comments": [
                    {
                      "score": 7,
                      "content": "That’s NO excuse- she is showing off - trying to fit in with a group any parent REALLY wants their kids NOT to be part of. \nShe not only thinks she can be abusive to the teacher but her parents.. \nit’s past time for the parents to curb this NOW- if they don’t- they will lose control over her permanently.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "As a teacher, this is the most likely reason.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yep, there is always a why!",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I remember at 13, my parents would have turned me over their knee and whipped my ass, how things have changed. :)",
              "id": 27,
              "comments": [
                {
                  "score": 14,
                  "content": "I'm 37 now and if I behave like OP's daughter it wouldn't surprise me if my dad came for me to still turn my ass into minced meat for a while.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "If I called either of my parents a holes I’d have to be ready to find a new place to live cause my brother would have whooped my ass, followed by my grandma and my mom",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I’m not sure violence is the answer to sociopathic behavior.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "Same!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "I would make the return of her phone conditioned on writing a genuine letter - so she won’t get the phone back until three weeks after that letter is written. The longer she waits, the longer the punishment lasts. She can pick her poison. That may help her creative process speed up…",
          "id": 32,
          "comments": [
            {
              "score": 120,
              "content": "I’m also thinking that writing an essay for you on autism with sources (and no AI) assistance is warranted. More work for you and her, but time well spent. I‘d also be looking at the “why” situation, including friends who might be bad influences.",
              "id": 33,
              "comments": [
                {
                  "score": 83,
                  "content": "Old school, hand written using the library and citing sources.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 63,
                      "content": "In cursive.  At the kitchen table.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Or an essay on being an asshole cause that theme seems important for this kid to reflect\nUpon",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": ">with sources\n\nGood old library will help here.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "One on autism and one on gender discrimination or menstruation. Make her learn how women throughout history and even in the modern world are treated because of their period. \n\nWithholding the phone until an apology is written will only make her sorry she’s being punished. Not sorry for being an AH. And forcing an apology in general only teaches kids to lie. She needs to be educated before she can actually be sorry.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "She should lose the phone indefinitely- and for each half assed ‘apology’- she should lose something else. \nEvery disrespectful comment or action should cost her another thing/privilege she values. \nShe can slowly earn them back by community service- actions instead of words. \nHer peer group needs serious changes.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "Instead of forcing an insincere apology, I wonder if they have anyone who does restorative justice (properly). Even if the school doesn't, some things that could be requirements for honestly and thoroughly answering before getting privileges back.\n\nThere are 5 main restorative questions \"What happened\" (let the person write or say it without judgment even if you really want to judge, you can sometimes get good insights). \n\"What were you thinking at the time\"\n\n\"What have you thought about since\"\n\n\"Who was affected? In what way?\" (This is the part where she really can't be let to just say I dunno. And if she really doesn't know, someone needs to help her understand)\n\n \"What do you think needs to happen to make things right\"\n\nHonestly, insincerely apologizing isn't going to really make it right for either the teacher or the student or anyone else affected.\n\nRestorative justice might not seem like it's working the first time you try it, and there are some cases that it might never work with. But if the kid has any empathy, it might help.",
          "id": 40,
          "comments": [
            {
              "score": 56,
              "content": "I like this better than making her write an apology that she does not mean.\n\nAlso, I'm not sure that she should apologize to the boy with autism who was not present. It might make him feel more singled-out.\n\nBut she ABSOLUTELY needs to have serious consequences and learn that this behavior is unacceptable. Making her write a reflective essay to understand why she was wrong seems like a good idea.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "This sounds better, TBH, than the apology(esp. for the kid who wasn't in the room--he may have not heard about it--or if he did it may just embarrass him more)",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This is a better way. Also the boy who wasn’t in the class doesn’t need to know about this nonsense, he wasn’t there and doesn’t need a fake apology letter. Addilyn is clearly not sorry nor ready to apologise so it’s meaningless. Restorative justice would be far more healthy and likely to work.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Interesting",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Restorative justice simply does not work with teenagers like this. The person has to believe they did something wrong first.",
              "id": 45,
              "comments": [
                {
                  "score": 2,
                  "content": "It's possible that it won't work. I definitely know that the school's hardest struggle is with the 6-8th graders but I have also seen some serious emotional growth in ones that I had lost hope in seeing any change. \n\nIf someone coaches her through this, WITHOUT judgment they might find that she is a redeemable human instead of a bully. But going at it with demands and anger, no matter how justified it feels, just puts her back up and makes her dig in her heels. \n\nMaybe it isn't enough this time. But neither is a forced, insincere apology.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Bigots don’t need to be coached. It needs to be made very clear to people that when they express bigoted views that they will experience severe censure and banishment from decent society. From the age at which they feel comfortable to express them.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "[deleted]",
          "id": 48,
          "comments": [
            {
              "score": 163,
              "content": "She’s free to express her true thoughts. Others are free to hold her accountable for them. She wants the first without the second.",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 106,
              "content": "They might remind her that “rights” still carry consequences.  Also - this kid is totally using AI to cheat in school as well.",
              "id": 50,
              "comments": [
                {
                  "score": 73,
                  "content": "She's hyped up on teenage \"righteous anger\".  This is a real life wake up call.  You cannot do this to people with authority over you.  The period question was out of line and sexist. Obviously the autistic jokes were terrible.  \n\nIn my house the phone wouldn't be back and wed probably be doing lessons together on autism, sexism, and whatever else fits the bill until the behavior changes.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Absolute bully in the making. Yikes.",
          "id": 52,
          "comments": [
            {
              "score": 107,
              "content": "If she’s bold enough to say it in front of a teacher she’s not in the making.",
              "id": 53,
              "comments": [
                {
                  "score": 15,
                  "content": "FAIR",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "And what else has she done that they know nothing about? This is not the first!",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "Bully \"in the making\"? Too late. It's a bully \"already made\". Her parents now have to un-make that aspect of her.",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -3,
              "content": "I’ve heard that military school, for a few years, does wonders for people with attitude and authority issues.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Kid needs to learn some empathy, maybe in therapy. Asap.",
          "id": 58,
          "comments": [
            {
              "score": 60,
              "content": "Honestly, speaking as a mental health counsellor -- counselling doesn't change people's values. We can try, and we can make space to explore what's going on emotionally to underlie this, but we don't have special tools to get around the defensive response someone has when they're told they're in the wrong. I'm concerned this girl would just learn to use therapy speak to justify her behaviour.  What she needs is education and exposure to diverse experiences, and possibly removal from the spaces where she's learning that this is cool or popular.",
              "id": 59,
              "comments": [
                {
                  "score": 15,
                  "content": "Lol. When you said exposure to diverse experiences. I’m reminded of my high school days. I’m African and grew up in Africa. I went to a boarding school in Africa for secondary school (middle and high school) and every semester you’d come back to school and find a new student with a different accent. \n\nBasically. Kids with African parents living abroad. If the kids started acting out or developed disciplinary issues, their parents would move them ‘back home’ to experience a diverse culture. \n\nThey usually went back home after a year or two. Some would finish high school there. But, yea, they usually went home with different attitudes.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I would've gotten a spoon over my head if I was rude to teacher or god forbid called my mom names. This is insane behaviour.",
          "id": 61,
          "comments": [
            {
              "score": 17,
              "content": "My father & uncles were WWII Army. If I had been rude to a teacher or called any adult names, I would have felt a belt on my bare bottom, been grounded for a long time & lost my allowance for the amount of time I was grounded. An apology would have been made in person with an adult family member in the room. While I'm not suggesting that Addilyn's parents use corporal punishment, she should lose all of her electronics and be grounded for a while. If she has a laptop, school work can be done at the kitchen table with one or both parents ensuring that she's not using AI. She should also have to apologize to her teacher and the boy in person, not with insincere letters.",
              "id": 62,
              "comments": [
                {
                  "score": 5,
                  "content": "If I were the kid I would not want her apologise . Don't try to put him into the whole mess . The essay about autism and answering few questions what get to the bottom of her behaviour is much more effective than getting an innocent kid involved",
                  "id": 63,
                  "comments": [
                    {
                      "score": 2,
                      "content": "That makes sense. She should still have to apologize to her teacher. I think that part of her problem is that she's 13. I used to be a substitute teacher and learned that many 13 year old children don't use their brains and can be totally rude and obnoxious and don't seem to care who they hurt. I think that the school should split up the friends group and put them in separate classes. She could be acting that way to impress her friends.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That is some twisted shit right there. A lot of boomers seemed to have had a weird obsession with 1)beating  and 2)bare child butts. Gross",
                  "id": 65,
                  "comments": [
                    {
                      "score": 1,
                      "content": "You obviously didn't read my entire post. I said that's the way I would have been treated. I didn't say that's the way OP and her husband should treat their daughter.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is all to common behavior unfortunately.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Give her a pen and paper and tell her to write the letter in proper apology format. Then, take the phone, laptop, iPad, gaming systems, whatever, and be prepared to hold out until she gives in and then some. You have an ableist and somehow misogynistic daughter on your hands at the tender age of 13. She’s going to be an absolute monster if you don’t buckle down with her and instill some sense of empathy. Finally, explain that she can say whatever comes to mind, it’s a free country! However, she is not now nor will she ever be free from the consequences of those actions. I don’t know how it got to this point, but get the train back on the rails before it takes out the whole darn town. Nta",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1493,
      "content": "NTA…she will continue being entitled if you allow that behavior. You are the parent and set the rules. Her words did harm to others including her brother and she doesn’t have a right to express her thoughts if they are meant to hurt others. I would also have her research and write a paper about what disrespectful behavior is and provide examples of different types. Hold firm you’ve got this.",
      "id": 69,
      "comments": [
        {
          "score": 411,
          "content": "And a paper on autism. \n\nThis is a really great idea. Good call. \n\nI hope she actually reads and understands what she's writing and not generating another fake paper.",
          "id": 70,
          "comments": [
            {
              "score": 156,
              "content": "Or read several books and discuss them. Which is harder to fake using AI. \n\nOn people like Temple grandin, whose family was told to basically throw her away.  She went on to become very well respected in the animal welfare field. Helping to create  areas that are leas stressful for them.   \n\nNTA ,  dig your heals in on this OP.",
              "id": 71,
              "comments": [
                {
                  "score": 25,
                  "content": "FYI, many people who have autism do not feel that Temple Grandin represents them our their experience.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Agreed. I'd make her hand write the apology letters in the kitchen or some room without a computer as well.",
              "id": 73,
              "comments": [
                {
                  "score": 2,
                  "content": "This is a good idea",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Handwritten, in the presence of parents, so they can see she is only using her computer for research",
              "id": 75,
              "comments": [
                {
                  "score": 16,
                  "content": "Haha. I’d actually say. Ditch the computer completely. She can use hard copy resources and print out articles she might need. She can kick it old school.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "That's actually a brilliant idea!! Treat it as they have to do a research paper for extra work",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Generally, using writing as a punishment, just makes the kid hate writing. I doubt her History teacher would like that. Maybe have the girl engage in some community service, or something like that instead.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Maybe volunteering at a clinic for kids with autism?",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Cool Cool cool. \n\nSo she wants to express her \"true thoughts\". Time to learn about the consequences for discrimination. \n\nIn Australia we have a thing called the Disability Discrimination Act which sets out what is and isn't discrimination and what happens to offenders who do discriminate. \n\nDepending on your jurisdiction, find out the equivalent & get her to research and write a handwritten short paper on \"disability discrimination in my country and the consequences.\" \nI would also get her to include stories & quotes from interviews/articles of people living with disability who have experienced discrimination and how it has affected them. \nThis will require some grunt work from you to make sure her resources are good. Make sure you blacklist any AI site and have her complete it in front of you. Maybe even print the resources out so she has to use her brain (shocker). \n\nIt may not change her heart/mind, but she will at least have all the facts. She will hate you for it but parenting teens is all about the pushback... \n\nSolidarity (from the parent of 12 and 14 year old girls).",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "I agree with this rather than the letter. She's already half-assed the first ones, so the apology overall would be lack luster and wouldn't solve anything. But writing a paper about Autism and if possible make her volunteer in a teacher’s class, for some perspective. I had a friend whose parents did that, and she came back with a different appreciation for our instructors.",
          "id": 81,
          "comments": [
            {
              "score": 62,
              "content": "Honestly, don't force her to volunteer. She likely would say these things to those kids' faces. They don't deserve her abuse. Unless you mean just helping the teacher, but what teacher would want to spend time with her extra. They have enough to deal with and shouldn't have to be part of correcting the behavior more than they are. The teachers shouldn't have to be responsible for this lesson unless they want to. Was your friend being this confrontational? I am glad it helped them at least, it's just she's treating the teachers badly already. She'll just keep saying her \"honest opinions\".",
              "id": 82,
              "comments": [
                {
                  "score": 19,
                  "content": "Agreed. Don't subject us to bullies as a teaching lesson for them. We usually have enough of that going on already. :/.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Might be best. An apology to the teacher is absolutely necessary. But the boy she called names wasn't in her class. Can you imagine not knowing what someone said about you, and then getting a letter \" I said this about you and my parents made me apologize but I don't want to\"?. Unless the boy heard, don't hurt him by giving that letter",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "[removed]",
          "id": 85,
          "comments": [
            {
              "score": 50,
              "content": "She's already a bully.",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "She already is one",
              "id": 87,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Completely agree and also take a look at the friends she’s been hanging out with, who may be bad influences. Acting out in order to earn points with popular kids is as old as time.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Hand write the paper, not type it.\n\nNTA. She's allowed freedom of speech, not freedom of consequences.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 795,
      "content": "NTA. Add on another few weeks. She’s a mean girl or at the very least, well on her way to becoming one. And. She refused to write her own letter? You are the parent. What you say goes. I wouldn’t even tell her she doesn’t get her phone back until she asks for it. Then you say she’s not getting it back and that next time when you tell her to do something, you expect it to be done. You need to become more sure of yourself. She’s not listening because she knows you are second guessing yourself and is playing on that.",
      "id": 90,
      "comments": [
        {
          "score": 154,
          "content": "My mom would always do something we'd never forget. She'd have us volunteering all our free time at a soup kitchen or something. Then she's ask us to extol on how we were better for it.  It can work better sometimes than words to show a child an object lesson about how all human beings are worthy of respect and dignity?\n\nSome kids need fewer object lessons than others, though?",
          "id": 91,
          "comments": [
            {
              "score": 42,
              "content": "I spent a lot of time volunteering as a kid. Not because I was a bad kid but because it’s what you do. Love your mom!",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "I bristle at people using volunteering at a soup kitchen or homeless shelter to punish their kids. As if the people there didn’t already have enough to deal with, subjecting them to a petulant teenager who needs an attitude adjustment just seems cruel.",
              "id": 93,
              "comments": [
                {
                  "score": 0,
                  "content": "It's not necessarily about punishment. It's about exposing them to the other side of life and helping them gain some appreciation for the situation that they are in. Most teenagers live in a bubble. They don't work. Everything has been provided for them their whole life and they know nothing different.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I was in a shelter as a kid. There were rich(er) kids dragged in by their parents to volunteer. What a slap in the face to think interacting with me was a *punishment*.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "I know right - that's exactly right; the punishment needs to be something where she remembers the lesson for life and carries it with her. Not something that she quickly does just to get her phone back.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "My question is how was it an AI generated letter if she was grounded? Do other people’s parents ground them from just their phone and not anything else?",
          "id": 97,
          "comments": [
            {
              "score": 80,
              "content": "it's likely that she needs a computer for school, so they can't take it away without impeding her education.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Being grounded just means the child can't go out (e.g. to friend's places, parties, dates, etc.). It says nothing about whether the child has access to their phone, computers, TV, etc.",
              "id": 99,
              "comments": [
                {
                  "score": 5,
                  "content": "Really? Being grounded used to imply that you weren't allowed anything for entertainment. No tv, no computer unless it's explicitly for school, and used in a public area, etc.",
                  "id": 100,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Right? It takes how long to type out a short apology letter, they didn't want to supervise their kid that long? That's what school is for now, I guess. Babysitting and morals, but only when they're the right morals, otherwise we burn the books. /s",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "In my book, grounding is no phone, no computer, no friends over, not going anywhere but school. She needs the computer for school work? Fine, in a common space with supervision. Then the computer is put away until needed for school work.",
              "id": 102,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "She has arrived as a mean girl.",
          "id": 103,
          "comments": [
            {
              "score": 6,
              "content": "It likely means that there are some mean girl friends involved and those friendships need to be severed, stat. These things don’t just typically show up on their own.",
              "id": 104,
              "comments": [
                {
                  "score": 3,
                  "content": "This, 100%",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "She’s living in a family where her perfect brother can do no wrong and is crying out for attention.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 627,
      "content": "You're NTA, but you're also handling this wrong. Forced apologies are meaningless, and you should know that. Make her write and send apologies if they'll make the other parties feel better, but don't pretend that has actually fixed anything. All you're doing for your child is teaching her to avoid getting caught, which is a *good* lesson, but not the *right* lesson. \n\nThere's an underlying issue, here, that needs to be addressed. Something has changed if she went from \"generally polite\" to \"disparaging the disabled and openly mocking teachers.\" Teenagers are inconsiderate and disrespectful of authority figures, but that crossed a line. Ten years ago, she would have been suspended, and probably faced other consequences. \n\nSend the other kids out for an evening, order a pizza, and talk to her. Be kind, considerate, and **listen to what you are told**. Don't attack her, or offer to lighten her punishment. She did something wrong, and she almost certainly knows it was wrong. That's not the point. Your goal is to get her to explain why she acted that way, because it was completely irrational. The answer could be as simple as \"I'm stressed out, whacked my elbow on the door, and it all boiled over.\" Or, it could be something more severe. Illness. Trauma. A feeling of abandonment and lack of care from her parents. You don't know, which is the problem. Don't just assume everything is fine.",
      "id": 107,
      "comments": [
        {
          "score": 118,
          "content": "This, right here. \n\nBehavior doesn't just change overnight for no reason.",
          "id": 108,
          "comments": [
            {
              "score": 113,
              "content": "Many times, at this age girls will start acting out in an attempt to get the attention of the cool kids. If this is the reason she is acting this way, shut it down. Integrity is way more important than popularity. I was a hard ass when my kids were that age, no electronics except for homework, and if being popular is more important than being nice then you can do it with one pair of jeans and two t shirts. I only had to pack up my daughter's room for her to understand how serious I was about her changing her attitude. She is one of my best friends now and graduating from uni in deaf studies.",
              "id": 109,
              "comments": [
                {
                  "score": 7,
                  "content": "That is amazing!",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "All it takes is one wrong friend.",
              "id": 111,
              "comments": [
                {
                  "score": 3,
                  "content": "Even one wrong friend has to exert pressure for a while. Takes more than a few hours for a personality change like that.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yes. Hold her accountable but also find out what's going on.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Prejudiced statements don't just \"boil over\". If someone makes a comment like that, they think that on some level all the time. That piece needs to be addressed; your advice is a good general approach if someone does something unpleasant but non-prejudiced, but doesn't go far enough in this instance.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "As a parent, I thank you for this.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This should be the top comment. If the AHs who run Reddit hadn't taken away the ability to give awards, I'd definitely give this the all seeing up-vote award.",
          "id": 116,
          "comments": [
            {
              "score": 2,
              "content": "The irony of calling someone an asshole, in a thread about correcting a child for calling someone an asshole 🙄😅\n\nI agree with you though.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This is the answer. \nBullies don’t just happen.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Seriously this! The number of people who just want to hand out punishments without actually getting to the route of the problem is scary. All that does is cause the problem to escalate because whatever is going on with the kid is being ignored.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "Oh god, this is ridiculous. Kids are mean. That’s the most likely explanation.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 174,
      "content": "NTA. Terrible behavior by Addilyn.\n\n&#x200B;\n\nAlso, apologies, but r/tragedeigh",
      "id": 121,
      "comments": [
        {
          "score": 64,
          "content": "She’s the AH for naming her children those names. Otherwise, NTA.",
          "id": 122,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 56,
          "content": "I’m hoping these are pseudonyms",
          "id": 123,
          "comments": [
            {
              "score": 38,
              "content": "Bayard is either named after a horse or a gun. Those aren't good options.",
              "id": 124,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "If not, poor children. That’s how you get beat up and have your lunch money stolen.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 36,
          "content": "Bayard. I really hope this name is fake.",
          "id": 126,
          "comments": [
            {
              "score": 6,
              "content": "It's a French surname. That it's being used as a first name is a bit odd, but it's not made up. \n\nIt's also a [legendary horse!](https://en.wikipedia.org/wiki/Bayard_%28legend%29)",
              "id": 127,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "For a sec I thought I was in the wrong sub. God I hope those are fake names",
          "id": 128,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": " Her other sibling is named Xannexander, Xanny for short.",
          "id": 129,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Yeah. At least Bayard is intelligible and phonetically sound. I might have a bit of a mean girl flare, too, if my parents had named me Addilyn.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 155,
      "content": "NTA. Her behavior is not acceptable. Honestly she sounds like a bully.",
      "id": 131,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": "NTA.  Your daughter is a teenage girl, and unfortunately sometimes that means she'll act very mature for her age, and other times she'll act like a brat.  This is one of the latter.  \n\n&#x200B;\n\nWith that said, you can't force her to be sorry, but you can let her know why she's being a brat and provide appropriate consequences.",
      "id": 132,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 46,
      "content": "NTA\nWell done, parents, for addressing this head on.\nI don't know where she got this outlook from, but keep an close eye on who she's associating with. If she's that adamant and unapologetic,  there's likely someone encouraging her.\nAnd tell her, the more she resists, the punishment goes up\nAmd give her an education on the true nature of freedom of speech. Being hateful is not without consequences.\nAnd I never thought I'll see the day when a woman tells another woman if she's on her period.\nAll the best.\nI have to say,  you raised a good son if he got that enraged over a beloved teacher being disrespected",
      "id": 133,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "NTA. She was being a brat, & taking her phone for a while seems fair. Buuut a forced apology will always sound insincere because it is. I really don’t know what you were expecting.",
      "id": 134,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 37,
      "content": "YTA for naming your kids adillyn and bayard",
      "id": 135,
      "comments": [
        {
          "score": 5,
          "content": "r/tragedeigh",
          "id": 136,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}