{
  "post content": "I (34F) have 3 kids, 2 are adopted from China. 3 years ago we got matched we decided to announce it to the family at our Christmas party. When we said \"We're adopting\" the first words out of my sister's(now 32F) mouth were \"Me too\" I was very confused as she had never seemed interested in adoption so I asked her what she meant a few minutes later and she started telling me all about the new corgi she was getting.\n\nI was kinda annoyed because I feel like it's weird to compare the adoption of pets to human children but I let it go at the time, fast forward about 7 months when we were home with the girls. They were 4 and 7 and the grieving process was very hard and it was just a difficult adjustment in general. When I tried to call my sister she kept comparing it to her dog(Which she had gotten a few months earlier). Like I would tell her some things that are triggering to my daughters and she would say \"Oh yeah, Howie had trouble with that on the first few days but we just kept exposing him to it and he got used to it\" (Howie is her dog)\n\nFirst of all that is TERRIBLE advice and second she would say it like she was some experienced parent give advice to a new mother, she has a stepson but he was 11 when she met him and 13 when she became his stepmom(She has not adopted him and her and her husband choose for her not to be a parental figure for him) so I don't really think it's her place to be giving out parenting advice.\n\nWell the last straw was that I go to a zoom adoptive parents support group and yesterday we had an event type thing where you could bring in a friend or someone who may be considering adoption and give them a little insight from the parents point of view. My sister asked me to invite her as she said she may adopt one day. I did and when they started talking about how sometimes in orphanages childrens hygiene aren't taken care of(AKA they don't have their teeth taken care of and often wear the same clothes for multiple says in a row) my sister started talking about how it was similar to how her dog was treated in the shelter and how annoying it was to have to take him to the vet for his teeth because they weren't properly cared for in the shelter.\n\nEveryone in the meeting looked very uncomfortable, especially the women in charge who is an adoptee. After the meeting we were talking on the phone and I tried to tell her nicely that was an inappropriate thing to say when talking about inhumane conditions of actual children but she accused me of not caring about inhumane conditions of dog shelters. I said \"I do care about that but it's not the same as children. And adopting a dog from a shelter is not the same as adopting a child and doesn't make you an adoptive parent\" She hung up on me and blocked me on facebook. Did I say something wrong, am I the a-hole here?\n\nEdit: I didn't \"Invite her\" specifically, I reposted the event to my facebook page and my sister messaged and asked me to invite her. And this was not a conversation type thing, it was a presentation put on by the group leader/agency rep so I didn't think she would have much time to talk and also I thought this would help her learn more about actual adoption and how different it is to animal adoption.\n\nEdit 2: I do understand what it's like to have a dog and how their like a baby in some way(I have 4) but I still would never compare the adoption of my dogs vs the adoption of my daughters.",
  "id": 1,
  "comments": [
    {
      "score": 8314,
      "content": "NTA: you're right. And i speak as someone who adopted animals instead of kids and cant biologically have children. I call my pets my babies, and i have a hard core bleeding heart for animals that are abused or neglected or in shelters that dont provide what they need, but its apples and oranges to human adoption. The state of orphanages that neglect their kids can be awful and heartbreaking (i have two adopted sisters from Ukraine who came from an orphanage where they were not fed enough and had very little human contact) and its is a completely separate issue. Both are terrible circumstances, and both can manifest really difficult issues once the adoptee finds their new home, but they are not the same issue and cant be compared that way.",
      "id": 2,
      "comments": [
        {
          "score": 1346,
          "content": "I agree, the two things just aren’t comparable. It’s like the saying, “comparing apples to oranges”. OP, you need to either set boundaries with your sister, or get it drilled into her head that it’s not the same thing.\n\nTo be honest, she sounds kind of jealous of you adopting, and all of the support and attention she thinks you’re getting. She either won’t/ can’t adopt and do is trying to earn that attention or make up for it with what she thinks is the next best thing.\n\nSo either set up some boundaries, like shutting her down, establishing what she did in the meeting was not to happen again and was unacceptable, etc. That or just get it bolted to her forehead that an adopted child and adopted dog are not the same. NTA",
          "id": 3,
          "comments": [
            {
              "score": 288,
              "content": "I’ve been at events for adopted dogs, and if we were having a presentation about abusive/neglectful situations in animal shelters and that was what the entire thing was for and someone started changing the subject to orphanages, that would still be annoying. That’s not even including that whole level of comparing human children to animals. It was just rude, topics set aside. I don’t understand how she can’t see that?",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "I cant just scroll by and say nothing. Your user is on another level omg",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That or if sister continues go no contact",
              "id": 6,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I did wonder if sister is on the spectrum (lack of social skills, obsessive focus on one topic), but it’s not relevant to sister’s need to learn to read the room",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 475,
          "content": "I have 4 cats, 2 dogs, an inability to have babies, and a mindset that’s never wanted them. I, too, treat my animals like children (primarily because that’s the life they deserve) but like… lol they aren’t my children. Having 6 animals isn’t even like having 1 kid!\n\nBut idk I have both adopted siblings and niblings and picking up my cat from the shelter was 1000000000000 times easier than what my mom, aunt, and sisters had to do to get custody of all the kids in my family. And that’s the bare minimum that was involved in raising them, obviously.",
          "id": 8,
          "comments": [
            {
              "score": 234,
              "content": "Thank you. PETS ARE NOT PEOPLE. We have both children and pets, and we love and care for both, but raising a human being is a whole other level. I jokingly call myself a cat mom, but being a pet owner is in no way, shape, or form even CLOSE to being the same as the parent of a human being. OP, your sister is acting wack. Let her block you, you're not missing the drama. I wish the best to your girls.",
              "id": 9,
              "comments": [
                {
                  "score": 91,
                  "content": "Agreed.  I have two children, a dog and a cat.  I love my pets but my children are entirely different.  \n\nI bite my tongue every Mother’s Day when my SIL makes her annual post about how some mothers only have fur babies and should still be wished a happy Mother’s Day.  (I roll my eyes and scroll on by)",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Illustration for OP's sister: when I leave my 2 \"fur kid\" fluffbuns alone for a long weekend with food, hay, water, and a litterbox... they're fine. A week once during extended hospital stay, just had a friend drop by once. We make sure to give them extra treats & scritches afterwards since they do get lonely over time, but... they get over it after a few snacks. \n\nHuman kids... Child Protective Services might rightly be called in the same sitch; it would NOT be ok.  Because humans are fucking different 👍   \n(NTA)",
                  "id": 11,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I once joked that the advantage to adopting a dog over a kid was that if you put the dog in a crate in the basement for an hour or two because you needed a break, it was fine.  If you did that to a kid, however, there were going to be several Very Serious Discussions.\n\n(Also, I want to clarify that I was talking about my cousin’s dog and the basement in question was my aunt’s finished basement where one of her nieces had lived for a while, not a creepy one.)",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Yeah, I'm a cat mom, too...but we all know what we mean when we say that!  It's not the same.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 28,
                      "content": "The only time I don’t laugh react at those is when I know someone struggles with fertility issues. I try to be really understanding — I see how a person could fill that hole with a pet. And I can’t blame them.\n\nBut I stG if I find you being happily childfree and then mad about not getting a mother’s day? I cannot address you with a straight face.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It's refreshing to hear from pet parents who acknowledge the difference! (I have a dog and two kids. The puppy is tough and there are lots of similarities but the kids are a whole other level of difficulty and vulnerability.)",
                  "id": 15,
                  "comments": [
                    {
                      "score": 3,
                      "content": "There’s a huge difference, but whenever I hear about someone getting rid of their dog (especially a calm, adult dog) because it’s too much responsibility with a baby, I’m always like “Okay, so you’re only having one child then?  Because if you can‘t juggle a dog and a newborn, is it even safe to put you in charge of a toddler and a newborn?”",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And thank god for that! I have two (adopted) dogs who came from bad situations. I chose animals over children for a reason! Also, hard agree on the sister. What a dick.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "My ex friend has 3 dogs that she calls her kids, her husband is worthless and doesn't want kids (thats not why he's worthless) but she wants them really bad. She refers to her dogs as her children, like calls them child and everything. One got out and husband didn't care what happened to him and she was yelling at him saying thats my child and im over here like when did she give birth to her dogs. I hate how people do that because its fine to love your pet but do not compare that animal to a child.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "I have 3 cats, 2 are almost 3 yrs and the other is 1 yr...when I leave them alone for hours no one bats an eye. If I did the same with 3 same aged toddlers I'd be in jail for neglect! I don't have children and I love my kitties to death even though they can be difficult at times. I even bottle fed the older 2 and nursed them back to health because they were abandoned by their mom and were half dead.\nBut, I'm not dense enough to believe it's the same as rasing human children especially adopted children!",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 192,
          "content": "So, I noticed this in my friendship group, as my friends got older they got their first pets and many experienced being genuinely solely responsible for something for the first time, and that was a big deal to them.\n They’d never had to be totally relied on for the life of something and for them they made huge lifestyle changes, lost sleep, couldn’t randomly stay out all night, had to run home at lunch to walk dogs, vet bills etc. it was a shock to them...but hey, here’s the deal, an actual human child is that turned up to a 1000 and the mental load of looking after your child & being a good parent is exhausting in and of itself, there are parallels but it is not of the same magnitude.\n\nIf you leave your dog alone whilst you go grocery shopping and he pees on the couch no biggie, so that to your baby, you deserve to go to jail.",
          "id": 20,
          "comments": [
            {
              "score": 114,
              "content": "The thing is, with a child you're responsible for their whole upbringing, and how well adjusted they will be as an adult. With a dog, it's like having a permanent four year old. This dog isn't going to be independent one day, you care for this dog their whole life, but with children (and especially adopted children as they may have faced lasting trauma) you're responsible for how this human will one day independently care for themselves. I don't want children of my own for this sole reason, it's too much stress and responsibility and not enough payout for me personally. I love animals, I love caring for them and I'm currently pursuing an education in animal care, yet I can distinguish caring for a child opposed to caring for a dog. It's so so so different.",
              "id": 21,
              "comments": [
                {
                  "score": 24,
                  "content": "I refer to my cats as perpetual toddlers. Cause they kinda are - for the reasons you state. But the other (besides what you have stated) nice thing about pets is you can get away with leaving them home alone for hours at a time where as you can't do that with an actual toddler.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I tend to describe my cat as a cross between a toddler and a teenager because he's dramatic and throws tantrums, but is easily distracted with a snack 😂",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "There’s days I describe my husband the same way. \n\n0.o",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "As someone currently dealing with a 10 week old puppy as a 27F, you couldn’t have nailed this better. \n\nThe other day I put him in his pen, left, and got a cherry Rebel at Dutch Bros to ward off the impending sleep deprivation migraine. However - if he was a human child, I would never be able to *put it in a pen*, leave it 100% unsupervised, and then drink copious amounts of caffeine if I were breastfeeding. This is just one example that I called my mom and laughed about. Being a dog mom is a huge adjustment and definitely serves a lot of my growing internal need to take care of something that needs me, but it isn’t even remotely the same as adopting/birthing/taking custody of and then raising an actual human child.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "I wonder if sister has always been like this about animals or if this is some kind of weird externalization of issues she may have regarding motherhood (she's a stepmom but has no parenting role)/her role in her relationship.",
          "id": 26,
          "comments": [
            {
              "score": -1,
              "content": "I wonder why that is. Maybe because she's a nutjob?",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -20,
              "content": "[deleted]",
              "id": 28,
              "comments": [
                {
                  "score": 17,
                  "content": "I don't see anything in OP's post to suggest that's true. It's the sister who has an issue. If you are listening to someone talk about how their newly adopted children, who come from a very different country and culture, are struggling to adjust and think, \"this is just like my dog!\" you've definitely got issues. Attending a meeting for adoptive parents and talking about your dog and how it's *just like* being a parent isn't normal behavior. Sister is clueless, at best.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "Hijacking top comment to add that everyone should just say \"you can't equate\" not \"you can't compare\". You obviously can compare things that are different, if you couldn't, you wouldn't even know for sure that they were different. But you can't equate things that aren't equal, period.\n\n\nEdit: To make matters worse, you can compare two things and end up concluding that they aren't comparable.",
          "id": 30,
          "comments": [
            {
              "score": 5,
              "content": "Wow, nicely done. I'll remember this.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Good point!",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Thank you so much for this. I hate it when people go \"are you seriously comparing X to Y\" like... um, well yes, of course? Comparing and drawing a few parallels to make a point is not saying they're exactly the same, why would anyone even think that??",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 77,
          "content": "NTA. She absolutely sounds jealous. I know it's normal to have a little, here's my story about my kid, here's my story about my pet, when people don't have kids, it ISN'T normal to think it's the same thing.\n\nNext time she talks about her pet, say, \"oh, I know all about adopting a dog. Sometimes I pet sit for my neighbor. It's exhausting.\" Do it EVERY time. \"Oh, Howie has such bad issues from the shelter.\" \"Oh, I know, my neighbor's dog Houston has those same issues.\" And on and on. When she eventually cracks and says that pet sitting occasionally for a neighbor isn't the same thing as having a pet, say, \"but adopting children and a dog are...\"",
          "id": 34,
          "comments": [
            {
              "score": 29,
              "content": "OP does say that she has four dogs of her own in her second edit (not sure the timing on that).  \n\nOP should just set a boundary:  \"Oh I know all about adopting a dog. It's completely different than adopting a child.  I'm happy to hear about Howie, but NEVER compare my children to your dog in my presence again.\"\n\nNTA, OP",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Nice",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I always say my pets (cats) are a bit like perpetual toddlers. Eventhough there may be some loose similarities in behavior and some amusing comparisons can be made. They are not, in fact, toddlers. And comparing adopting a human to a pet is just gross. For so many reasons. It's like saying an orphaned human is nothing more than an animal that doesn't deserve their own agency. And you obviously can't train/punish a human the same way you do a dog. I mean seriously..... The way OPs sister is comparing the two is really troublesome.",
          "id": 37,
          "comments": [
            {
              "score": 17,
              "content": "I refer to my little troublemaker cat as “if Spider-Man was a toddler.” 😂",
              "id": 38,
              "comments": [
                {
                  "score": 11,
                  "content": "😂 that's hilarious and reminds me of my cousin when he was toddler. \n\nOne of my uncle's got married and had children late in life - so I have a couple cousins that are like 25 or so years younger than me. His oldest son was a *climber* when he was like 3-4. I will never forget going over there for a visit and seeing bungee cords all over the place holding things in place and in an attempt to keep that kid from doing major damage to himself and their stuff. Normal childproofing products weren't enough. I mean they even had the TV tied down to the tv stand!  I really wish I would taken pictures or something. And my uncle's face when I asked what was up with all of it, just this totally haggard I am too old for this response of \"the kid climbs..... Alot\" 😂🤣. Basically your description of your cat would have been perfect for this kid at that age.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "And look, even if you personally feel like the experience is similar.... be self aware enough to know you are in the minority and stfu.\n\nI talk about my cat like she's my baby. As a bengal with significant trauma, we've worked through a lot of issues with her that using the same tools I have used as a social worker with kids. We make a lot of jokes about how we've clearly passed the parenting test. But I would never say that to someone outside my small group who understand exactly what context I mean it in, and know I'm not saying \"your child is like a cat\"",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Not to mention the racism involved in comparing overseas adoptees to a corgi...",
          "id": 41,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2242,
      "content": "NTA- Dogs and cats aren't human children. I'm a bleeding heart tree hugger and wish more people cared about their pets, but it's not the same thing and it's incredibly insensitive of your sister to not see that line at all.",
      "id": 42,
      "comments": [
        {
          "score": 385,
          "content": "Yeah, it's like a layman saying they are a [insert credentialed/licensed profession here], instead of a hobbyist, enthusiast, someone knowledgeable, etc.\n\nI consider it akin to a homeopath improperly claiming to be a MD or someone telling an educator with a MA in education they're also a \"schoolteacher\"....",
          "id": 43,
          "comments": [
            {
              "score": 125,
              "content": "[deleted]",
              "id": 44,
              "comments": [
                {
                  "score": 63,
                  "content": "I sewed a new button on a shirt so I’m Chanel!",
                  "id": 45,
                  "comments": [
                    {
                      "score": 33,
                      "content": "I got got dressed all by myself today. I'm a fashion designer.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "I used TurboTax to do my taxes I am a CPA!",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 98,
              "content": "I’m a nurse and I see those “being a mommy is like being a nurse, a pharmacist, a cook....” posts and I want to vomit lol.",
              "id": 48,
              "comments": [
                {
                  "score": 19,
                  "content": "Fellow nurse here, and I wholeheartedly agree with that!",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I agree, but I would like to say that I have insinuated this *slightly* when it comes to folks invalidating SAHM's work to \"doing nothing\".\n\nYou're right, they're not professionals and aren't comparable in that field, that said, when people claim SAHMs don't do multiple jobs like looking after the kids health, teaching them, cooking, cleaning, etc-- grinds my gears, I swear.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Parenting is hard. Don’t get me wrong. But that’s called PARENTING and raising a child. Slapping a bandage on a scrape, teaching your kid colors, or making lunch doesn’t make you a nurse, a teacher, or a chef. In fact, saying that INVALIDATES being a SAHP because you don’t emphasize what it takes to be one. Bandwagoning onto a licensed profession just makes being a SAHP look less than. Boast about that, not pretending to be what you aren’t. Say you’re raising an awesome kid, that you’re sacrificing your career, and that the role of SAHP is hard.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Bill Burr had a predictably assholish take on that in one of his specials, but I had to agree (paraphrasing a bit): \"What would you rather be doing? Drilling to the center of the Earth, shaking hands with the Devil, wondering if every time that thing shakes if it's going to cave in so they can write that folk song about ya, or wearing your PJs into the afternoon and playing hide and seek with a toddler? *Oh yeah*, being a mom is the *hardest job on Earth*. Oprah's not even a mother, *how would she know?*\"",
                  "id": 52,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You agree with such a stupid take even though you know it's seriously asshole-ish? \n\nMost people's jobs are not like that, but even so, knowing how hard parenting is, I'd rather take the drill job. At least comedians don't make jokes about that being easy when it's not, unlike parenting. If that guy has kids, I bet his wife or ex does 90% while he plays \"fun dad\".\n\n(However, when I say \"parenting\", I do mean just that- not people who do the least amount of effort possible and don't turn out kids who will grow up to be mentally healthy and balanced, happy adults, or people that neglect thier own kids as soon as they find a partner with stepkids, as we see so often on AITA.)",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "OMG I know it makes me want to vomit too.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "Exactly. I get so tired of pet owners saying their animals are literally the same has having human children. \n\nThen in the next breath, say they don't want children so that they can life a particular lifestyle (which is totally fine). So, then, you do admit that having pets isn't the same as having kids? \n\nNTA. Dog nutters are annoying af",
          "id": 55,
          "comments": [
            {
              "score": 63,
              "content": "I’m also like 99% sure you don’t typically set up college/wedding/future funds for your adopted pets...",
              "id": 56,
              "comments": [
                {
                  "score": 19,
                  "content": "Oh God don't give them any ideas j can see dog nutters doing this.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 13,
                      "content": "There's an episode of Broad City where they attend a dog wedding and the vet was the one that \"married\" them lol.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "There are already pet weddings. Hell, there are fucking \"bark mitzvahs\". \nhttps://en.wikipedia.org/wiki/Bark_Mitzvah\n\nWhich is cute and all, but even as a strictly secular Jew, I sideeye it pretty damned hard. Your dog is 13 months old (or 13 years); it's not reading the fucking Torah.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I guess if you're getting a working dog often you're putting aside a \"college fund\" of sorts for the costs of higher level training 😂\n\nBut nah really, not the same thing at all",
                  "id": 60,
                  "comments": [
                    {
                      "score": 10,
                      "content": "If only it were tax deductible...",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "In some cases, some sort of future fund would be a good idea (elderly human with a young pet, anybody with a parrot or tortoise) but a college fund would be silly.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Literally birds are my one exception...wills/inheritances need to include them. That’s the only one that makes sense. Especially because African greys can end up being 60...and some tortoises can live that long or longer.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "I agree. I too love animals.\n\nThey both have feelings and personalities yes. But the way I see it, an animal will perpetually be the mental age of a 5 year old human. Humans will grow up to have much more complex thoughts and feelings.\n\nSo if a dog is nervous around something, lure-reward method with gentle exposure is ideal to help them (like for introducing horses to your new farm dog or not being scared around fireworks). However if a human is nervous about something, exposure may work for somethings but others will require much more thought out plans and therapeutic processes.\n\nThe sister is the AH and she's delusional.",
          "id": 64,
          "comments": [
            {
              "score": 24,
              "content": "Pretty much. \nIt's really apples and oranges. My cat may be roughly the intelligence of a 5 year old, I can teach her tricks and words, but it doesn't come with the same kind of structure. She wont have the same mental distress being left alone that a child will. She's not as mentally helpless as a child is, cats obviously mature into self reliance faster than humans. \n\nShelters dont adopt out infant critters, ones needing to be weened and other social things they need, because it requires more care. The stuff sister is bragging about with her shelter dog doesn't really even hold up with younger animals of the same species...",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "This x100\n\nI'm addition to that treating dogs and cats like human children is a common cause of abused pets (improper diets, behavioral issues, stress, etc). They are completely different both mentally and physically and it's not even a value statement to say you can't compare them.\n\nWhat Op's sister did is like turning up to a fish care meeting and when tank maintenance came up, talking about how they toilet trained their puppy. It's not that one is unimportant, it's just that the latter is completely and utterly irrelevant and disrespectful of everybody's time.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "Can you explain how? Wouldnt you agree that a human life is equal to a dogs?  Or do you mean something else?",
          "id": 67,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1471,
      "content": "NTA and your sister is delusional.\n\nDon’t get me wrong, I love my cat and she’s “my baby”, but I don’t go around saying I’m a single parent. WTF. \n\nSeriously, your sister is bat-s-crazy.",
      "id": 68,
      "comments": [
        {
          "score": 336,
          "content": "I am childfree and I find it very weird, as well. Like if someone wants to call themselves \"dog parent\" or something in a lighthearted way it's whatever, but what this sister is doing seem off-kilter.",
          "id": 69,
          "comments": [
            {
              "score": 154,
              "content": "Right, we joke that my cat is my mom's grand kitty since I don't have kids. I wouldn't seriously try to put him on the same level as my nieces and nephews.",
              "id": 70,
              "comments": [
                {
                  "score": 62,
                  "content": "Yeah we joke that my dog and my brothers dog are cousins lol. It's not the same as having children at all.",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Same, I’m autistic and not having children so I treat my two cats as children to fill the hole. My mum calls them her grandkitties. But I would never say it was the same experience as actually having babies cause I know it doesn’t compare.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "My 12 year old has informed me that he isn't having kids, so I've asked for a grand-kitten or grand-puppy.  But, you know, we actually know the difference! (Also, I think he's lying, but that's another matter.)",
                  "id": 73,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Lol. We know how those life decisions made at that age tend to change as they grow. \n\nOn my case medically the risks are too high to justify attempting a pregnancy. I will do the whole new mom routine with pictures and stories about my cat when I run into those people who think I'm supposed to be a baby factory.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yeah, I refer to my sister’s wonderful spoiled rotten dogs as my niece and nephew, but no one involved seriously believes that her dogs are the same as kids. OP’s sister is totally deluded here and I suspect it’s attention seeking behaviour of some sort.",
              "id": 75,
              "comments": [
                {
                  "score": 2,
                  "content": "It reminds me of the people with those “real dolls” who treat them as actual babies or whatever. It makes me sad that they need a coping mechanism but good heavens...work that out without involving everyone else for so long",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "The sad thing is that this kind of crazy might (hopefully!) prevent her from actually adopting a human baby.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I have adopted both children and dogs and it is fucking bonkers to compare the two.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 797,
      "content": "NTA. Your sister sounds like she needs to be the center of attention, no matter the situation. Bringing up her getting a dog with family is one thing (irritating as it may be) but highjacking a group therapy session for adoptive parents to compare it to her getting a dog from the shelter...she crossed a line and needed to be told off.",
      "id": 79,
      "comments": [
        {
          "score": 184,
          "content": "Yeah, it started to look to me like she’s making fun of child adoption. She’s being so dreadful about inserting herself and her dog repeatedly; it’s not just something spur-of-the-moment where she’s trying to relate to the topic and does so badly. Asking for an invitation to a session for adoptive parents and then still insisting on talking about her dog, that was quite deliberate. OP, any chance she’s mocking you?",
          "id": 80,
          "comments": [
            {
              "score": 122,
              "content": "I don't think so, and I believe her wanting to join was to actually learn more about China adoption. Like I don't think it was her intention from joining. I think she just wanted to relate even though she didn't have much to relate with.",
              "id": 81,
              "comments": [
                {
                  "score": 51,
                  "content": "That’s much better than I feared! She’s going to alienate people with her approach, though.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Has she actually seen videos of the conditions in the orphanages do you think?",
                  "id": 83,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Not that I know of but the women giving the presentation was being pretty descriptive.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "I think she does want to be the center of attention. Like when she highjacked your adoption announcement. Is she competitive with you, like now that you're a parent and getting attention, she had to become a \"parent\" too. \n\nAnd, when you talk about your children, why does she makes everything you say  be about her? Like even if she had children, why doesn't she just listen and offer support? You're sister might be a narcissist - she even had to make the adoption group be about her. She was there as s listener, to learn. Read about narcissism, see if it fits and get info on how to protect yourself.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I think you just nailed it!",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 391,
      "content": "NTA. Your sister is being wildly inappropriate.",
      "id": 87,
      "comments": [
        {
          "score": 120,
          "content": "Agreed.\n\nOP, When I was a young mom I had a friend who told me she knew exactly what my life was like as a single parent to two babies because she had dogs. It was “exactly the same” several years later she and I both fell pregnant at the same time, she married, I didn’t re-marry but coupled up with my third child’s father, and by then my older children were able to help quite a bit with the new baby. Her oldest and my youngest were born about a month apart from each other and she and I went back to our job at the same time, I asked her often if she still found it to be “just like dogs” and she apologized and was so horribly embarrassed. \n\nShe then went on to have 2 more children in the next 4 years, by the time our same age children started kindergarten she had just birthed her last baby, and my oldest was old enough to babysit. “Just like looking after dogs” she texted me with a picture of her newborn baby and the laugh crying emoji, “I’m so sorry, I have no idea how you ever did this as a single mom, even with a husband and my mom living with us I’m so overwhelmed.” \n\nI suspect the sister just has NO IDEA and is trying to relate, but has no clue how out of line she is. OP is definitely NTA.",
          "id": 88,
          "comments": [
            {
              "score": 9,
              "content": "I love the happy ending here, lol. Glad it turned into something you can both laugh about.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 289,
      "content": "NTA.\n\nYour sister is acting weird as shit and something odd is going on.",
      "id": 90,
      "comments": [
        {
          "score": 71,
          "content": "I wonder if the sister is jealous in some way.",
          "id": 91,
          "comments": [
            {
              "score": 45,
              "content": "That was my thought. Not that it makes it okay but I can’t help but wonder if her husband doesn’t want more kids and she’s struggling seeing her sister build a family.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Or needing to work out some issues she has regarding her relationships with her SO and stepkid?",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Yup. OP’s sister’s husband chose for her not to be a parental figure to his 13yo daughter. The sister’s husband married a woman/child and probably likes it that way.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 201,
      "content": "Oh so NTA\n\nI do dog rescue and pull dogs from shelters, get them into foster homes, and then work with the adoptive parents with transition. This is absolutely NOTHING like dealing with a human child. Dogs are dogs, children are children.\n\nYou were so much nicer than even I would have been, and I facilitate dog adoptions! Your sister is being ridiculous and isn't validating the struggle you and your children are experiencing. \n\nThere is no way to explain this to her. She is just going to continue to think she is right so don't stress over it too much. It's not worth your time. But just know, your sister is ridiculous and you handled this as best as you could.",
      "id": 95,
      "comments": [
        {
          "score": 150,
          "content": "Reasons dogs and children aren’t the same:\n\n* children can’t be crated to keep them out of trouble\n\n* potty training a child does not involve a crate or confinement to a small space \n\n* you can’t occupy a child’s mental needs by feeding them frozen food in a kong toy\n\n* you don’t withhold a meal so you can train them to perform tricks before meal time\n\n* children need to eat more than two meals a day. You shouldn’t feed them the same food served out of a bag for every meal. \n\n* you don’t feed children cookies for obeying \n\n* you can’t ask strangers to pet and feed your child to\nhelp develop trusting relationships \n\n* you can’t leave your children alone for 6-8 hours while you’re at work\n\n* you can’t have your child run alongside your bike for 30 minutes to wear them out\n\n* playing fetch is known to as playing catch or baseball, don’t screw that up or mommy groups will be angry. \n\n* children shouldn’t lick themselves clean. children need baths and hair brushed multiple times a week, if not daily. \n\n* high powered blow dryers don’t work on human hair\n\n* a grooming noose isn’t an acceptable way to hold your child in place while you clean ears or do their nails \n\n* you never express a human’s anal glands. Leave the butt alone. \n\n* if your child yells or cries a lot, you can’t use a bark collar to prevent the neighbors from being disturbed. Pediatricians frown on debarking. \n\n* clothes for dogs are optional, but mandatory for children\n\n* if you leave your kids outside in the rain to potty, the cops are going to get involved",
          "id": 96,
          "comments": [
            {
              "score": 81,
              "content": "I can guarantee someone will argue with some of these, you should see the people in the bottom of the comments.",
              "id": 97,
              "comments": [
                {
                  "score": 113,
                  "content": "Maybe I'm an asshole, but when my babies were small and someone said that to me (their dog is their baby) I said \"oh, ok.  Well, how did you deal with breastfeeding and you caffeine intake?\". And \"how did you deal with your worry about SIDS?\" \"How old was your baby when you started saving for college?\" Really, works.for.any age child...\"how did you help your dog overcome dyslexia?' Shuts 'em up real quick.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 21,
                      "content": "yes, this rules. i got dogs precisely because i have absolutely zero interest in the commitment level that a human life requires. that sister is a nutcase.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Ooooh I like it",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Indeed, I save it for proper occasions.  When the person is just joking I say \"what are you trying to tell me about your wife?\"",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Yeah, I have no intention of having kids and this sets people off like you wouldn't believe.\n\nI just say; a dog is enough responsibility for me!",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -2,
                      "content": "Idk that seems like a bit much to me if they we just saying it casually and not trying to tell you how parentsplain you. Granted if they were trying to tell you how to raise your child based upon their owning of a dog, yeah saying that makes a lot of sense. \n\nOn a more lighthearted, joking note: My sister jokes that raising my nephew was/is easier than raising her dog that has a lot of health issues, she'll say all that at least her son slept through the night and doctors visits were cheaper, though now that he's a teenager eating all the food the day she brings it home, their costs may have evened out! Obviously the two are drastically different, but just the way she talks about them makes me laugh.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": ">you don’t feed children cookies for obeying\n\nI know what you mean but hey, let's be honest, who wouldn't resort to a bit of bribery at the end of a long day to get the kids to pick up their toys 😛",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Um.\n\n\nI give my kid frozen bananas so she'll stay occupied and leave me alone. (While the dogs enjoy their frozen kongs.)\n\nAnd I absolutely give my kid a cookie at the end of the day if she's been good. \n\nAnd apparently you've never used a crib or playpen. Because my baby sleeps in her crib for 12+ hours a night. And we're not giving that up until I absolutely have to. \n\nBut otherwise... Most of these are in fact true",
              "id": 105,
              "comments": [
                {
                  "score": 19,
                  "content": "This is an acceptable level of pedantry",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "A mute the kid without actually causing them a mental or physical health problem collar might me a lucrative invention",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This list is both true and hysterical.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Almost every pet I’ve owned has been adopted or rehomed to me from an abusive or otherwise bad living situation. Yeah it has it’s challenges but it’s nowhere near the same as an actual human child. \nActually in fact one of my friends that’s a mother of 3 and I were joking recently about how I have it easy with a dog because it’s unacceptable to lock your kid in a crate or the backyard while you’re out of the house running errands.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 142,
      "content": "ugh, this exactly why i dont like dog people. Not people who have dogs, dog people. Its a personality type. Nta.",
      "id": 110,
      "comments": [
        {
          "score": 85,
          "content": "Lol, not mentioned in the post but I have 2 newfies, a great pyranees and a pitbull. I still have never partaken in the dog vs cat war.",
          "id": 111,
          "comments": [
            {
              "score": 73,
              "content": "its not the dog vs cat thing, i love dogs! Im talking about people who think dogs are people too. Those are dog people, thats the personality type im talking about lol like fur babies?? gag!",
              "id": 112,
              "comments": [
                {
                  "score": 53,
                  "content": "Yup! We go to the dog park weekly and definitely met some of those types. They're also usually the kind of people to give unsolicited (And most of the time unhelpful) training advice.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Yes exactly, and throw around the word abuse when you say that you let your husky play in the snow for an hour or some shit, like first of all different breeds are different and second of all different breeds require different training, and i dont appreciate the side eye coming from you just because my dog doesnt have its own personal temper pedic bed and all the steaks he could want. f’in dumb lol",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Omg those dogs, that many dogs, AND children? You’re amazing and your sister is emotionally insensitive/stunted.\n\nI treat my pup like a human, but I would NEVER compare it to raising a child.\n\nNTA",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA imo, especially if you said it like that. I think it's fine to tell her to stop comparing her dog to your daughters, it's pretty insensitive and definitely tone deaf at a support group for adoptive parents and--at the very least--annoying. Maybe she just wants some common ground between you two but this doesn't feel like the way to do it lol",
      "id": 116,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 63,
      "content": "You're NTA.  Your sister needs to find her own niche group for \"adopted pets\".  You have been really patient (far more patient than I would have been, I believe) but I am not sure what you can do to change your sister's views.  I suggest you don't invite her to further support group sessions for adoptive parents and perhaps reach out to your fellow members for guidance and support regarding your children rather than your sister.",
      "id": 117,
      "comments": [],
      "relation": "Support"
    }
  ]
}