{
  "post content": "\nVague title but, that’s as summed up as i could make the situation. \n\nThe situation in more detail is that i borrowed two books for one of my friends from my university library because she needed it for an essay. I had finished the semester and went out to my library for the explicit purpose of getting her these books, and despite the fact that she is part of “UoL” (universities of london) and can therefore freely come and go to my uni library anyway, i still went in person and got the books for her as a favour. About a week later she tells me she’s done and asks me to return it for her, and gives it to me when we meet one day. \n\nNow at the time i was a bit annoyed that i’d have to inconvenience myself by going all the way to my uni library when she could literally return it herself (she worked like a 10 minute walk from the library), but i agreed anyway and took the books. That was my mistake, i should’ve asked her to do it herself, but whatever. \n\nI couldn’t find the time to return the books since i had to go on a month holiday literally four days after, so i told myself to remember to renew the books online once a week until i came back and could return it, and that’s what i kept trying to do for the next month and for weeks after that, but i naturally forgot several times. Because of that, i managed to rack up around £10  in late fees, which is annoying but it was worse because that brought my total late fees up to the max of £30, meaning i had to pay it all immediately as opposed to at the end of my three years at uni. \n\nThat sucked tbh, especially because in the back of my mind i kept thinking this wouldn’t be happening if she returned the book herself, because again, she literally worked ten minutes from my library while i haven’t gone back to that area of the city in the last three months because it’s so out of the way.\n\nBut, like i said this was all just in the back of my mind. I came back from my holiday and still kept putting off going and returning the book because let’s be honest, i was lazy, and i subsequently kept forgetting to renew it. it’s *my* fault i realise, but one day me and this friend were talking and i jokingly complained about how much i’m being inconvenienced by these damn books and her tone kind of annoyed me, because she was completely refusing to see how it was any of her business. I told her she could’ve returned it herself in the first place, but she was like “i don’t know how your library works so that’s wouldn’t be possible”, which is just dumb because who doesn’t know how libraries work? I just think if i was in her position i’d feel a little bit bad uno? MAYBE even offer to pay it, but she didn’t, so now i’m kind of mad at her. \n\nIs this anger justified? am i the asshole for feeling like she should take *a little bit* of responsibility for this?\n\nEDIT: you guys have spoken and i pretty much knew the way this would turn out as soon as i hit send. I’m just not justified feeling like this, and i knew that lol. She didn’t do anything wrong in asking me, i just wanted to know if i’m allowed to feel slighted by her not caring that i’m in this situation because of her books, but i agreed to return them and that’s ultimately all it comes down to. Thanks for those who replied.",
  "id": 1,
  "comments": [
    {
      "score": 25,
      "content": "ESH\n\n&#x200B;\n\nShe should of gone to the library and checked out the books herself or returned them  herself. \n\nYou should not blame your friend for the late fees the books racked up when they were in your care. You could of returned them at some point.",
      "id": 2,
      "comments": [
        {
          "score": 13,
          "content": "I disagree. There's nothing wrong with asking a friend for a favor. OP is the asshole for agreeing, failing to uphold their end of the agreement, incurring fees, and getting mad at a situation fully in their control.",
          "id": 3,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 0,
          "content": "i’m not trying to blame her honestly, i just wish she took a little bit of responsibility or felt bad? idk i just think i would if the situation was reversed",
          "id": 4,
          "comments": [
            {
              "score": 11,
              "content": "She's... Not responsible.",
              "id": 5,
              "comments": [
                {
                  "score": 2,
                  "content": "i literally just contradicted myself there huh, my bad",
                  "id": 6,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "My advice would be to try and learn from this situation instead of focusing on whether she should feel remorse or not. It sounds like you are actually mad at yourself for allowing her to leave the books with you. Maybe you feel a little taken advantage of? Maybe this is part of a pattern you get into with people where you say yes too frequently and that is where the frustration is coming from. The best thing to do is know better in the future how to establish boundaries with people. Maybe think a little more carefully before saying yes to people. Remember, you teach others how to treat you.  \n\n\nBottom line. She made a request and you said yes. She made a second request and you said yes. Then you screwed up and it cost you money. You are allowed to feel upset privately but you should not be blaming or expecting anything from her. YTA",
              "id": 7,
              "comments": [
                {
                  "score": 5,
                  "content": "you’re probably right about how i’m feeling tbh, thanks for taking the time to write all of that",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 16,
      "content": "YTA - you should’ve told her from the get-go to return them herself, or just had her get them. You admit yourself that it was due to laziness that you racked up the fees. Her not doing this all herself when she could’ve is pretty annoying and not showing remorse. But again - it can come back on you. You should’ve relayed that message when you offered to get her the books AND return the books. Technically, it isn’t her fault, unfortunately.\n\nDid she know she could get them/return them herself?",
      "id": 9,
      "comments": [
        {
          "score": -1,
          "content": "she knew she had access to my library, but her reason for not doing it that she told me later on was she didn’t know how my library worked if she went to return it herself. \n\nAnyway, i appreciate your call",
          "id": 10,
          "comments": [
            {
              "score": 2,
              "content": "Yeah, again, VERY annoying and pretty entitled, and it makes me want to say “everyone sucks here,” but it really should’ve been communicated initially. If that was the reason if you asked her to return them in the first place, I would’ve definitely gone with she being the asshole.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14,
      "content": "YTA - You said you were going to take care of it and didn't. Maybe you shouldn't have volunteered at all, but you did",
      "id": 12,
      "comments": [
        {
          "score": 5,
          "content": "THIS. You can’t take full responsibility for returning them and then blame your friend. You can’t stay silent about wanting her to return them and get mad when she doesn’t. You can’t blame her for late fees YOU created. \n\nYTA, OP.",
          "id": 13,
          "comments": [
            {
              "score": 2,
              "content": "i didn’t get mad that she didn’t return it, my annoyance *was* with how she acted after i explained how i had to pay the fees on books i originally took out for her. \n\nBut i see all your comments and i honestly realise i don’t have the right to be mad at anyone but myself.",
              "id": 14,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "YTA. The minute you agreed to take the books back the responsibility fell on you. The late fees you incurred were a direct result of your actions, not hers.",
      "id": 15,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "ESH. You should have asked her to return the books, and, you shouldn’t play around with how you’re feeling disrespected by her. Her for taking advantage of your favor. \n\nThis is a situation that could’ve been better handled by *direct* communication.",
      "id": 16,
      "comments": [
        {
          "score": 2,
          "content": "that’s very true",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "YTA\nJust return the damn books",
      "id": 18,
      "comments": [
        {
          "score": 0,
          "content": "it’s far and travel costs money man :/ ill do it eventually",
          "id": 19,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "YTA you agreed to return the books for her. \n\nIf there was a problem, as you said, you should have returned it to her before the trip and asked her to return it instead.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH. She sucks for not returning them herself. However, you did this to yourself and you know that. You could have returned them like you said, but you got lazy. Your fault for the fees.",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "YTA. You agreed to get the books. You agreed to return the books. Neither of which you HAD to do, but you did. Its not her fault that you kept forgetting to return them.",
      "id": 22,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "YTA. This is one hundy your fault. You agreed to take the books back off her, once you'd done that she had zero way of returning them herself. You know the books are there but because you are too lazy to return or renew them your fines are racking up and that's your problem.",
      "id": 23,
      "comments": [],
      "relation": "Attack"
    }
  ]
}