{
  "post content": "Earlier tonight I ordered a Hawaiian pizza with my boyfriend. We’ve only been dating a month so it’s the first time I ate pizza with him. We only finished about half, and then we went to watch TV. I was still hungry, so I ate all the toppings off the pizza. \n\nWhen he saw, he absolutely flipped out. He said that he was saving it for lunch tomorrow, that he had never met anyone who would do anything like this, and was just generally really upset. I thought he was joking and laughed it off, but it’s been a couple hours and he is still upset. He’s talking about how he was looking forwards to having the leftover pizza for lunch, and now I’ve ruined his lunch.\n\nI offered to buy him another pizza, but he kept saying that it wasn’t about that, and I just ruined his day. \n\nIs he overreacting or AITA?",
  "id": 1,
  "comments": [
    {
      "score": 38360,
      "content": "YTA\n\nThis is truly unhinged behavior.",
      "id": 2,
      "comments": [
        {
          "score": 10669,
          "content": "Just the weirdest thing to do",
          "id": 3,
          "comments": [
            {
              "score": 13488,
              "content": "It’s like when Cartman ate all the fried chicken skin/breading off the bucket of Kentucky Fried Chicken and left the rest for everyone else.",
              "id": 4,
              "comments": [
                {
                  "score": 1838,
                  "content": "My thoughts exactly.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1939,
                      "content": "The petty part of me wants him to find a chocolate bar she likes (like kit Kats) and for him to give it to her, but having licked off all the chocolate to just give her the wafer and make a point.\n\nSo, so obnoxious",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 468,
                  "content": "It’s about power and control.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1377,
                      "content": "There are two explanations I can think of:\n\n1.) As you said, it's about power and control\n\n2.) OP is from a background where the concept of leftovers is just foreign and therefore it didn't even occur to them that bf would eat the pizza after they'd finished dinner for the night (which still makes OP TA because food waste is a huge problem and OP apparently has the luxury to just casually ruin however many slices of pizza without thinking about food scarcity).",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "He neither has control on his feelings which overcome on their relationship nor power to stop her from eating when she ate that",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I think you're looking a bit too deep into this, lol I did vote YTA though.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": " Power & control implies OP is actually thinking about the bf. This behavior sounds more like a spoiled, self absorbed person who is used to being selfish and getting away with it",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 150,
                  "content": "This is exactly like that!  I mean damn take a slice and eat those toppings..  but do rip this man whole lunch away .",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "That scene lives rent free in my mind 😂",
                  "id": 13,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Same. The way they realise what happened and just start crying honestly broke my heart the first time I saw it at 12. It also made me think of my own tyrant cousin who literally did this and would steal from all of us. Girl once stole my friend's toothbrush just to steal, and she was all of 9.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "Came here for this",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "I came here searching for a South Park reference. Thanks my man.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 107,
                      "content": "My kid used to eat the pepperoni off her pizza before eating the rest of her pizza.  But at least she ate all the pizza.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "South park reference, am i missing something from hw / American tv shows ? Kinda guilt of not well aware.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Remember when Joey on friends did the same thing with the chicken skin lol",
                  "id": 19,
                  "comments": [
                    {
                      "score": 146,
                      "content": "Difference is that he ordered it for himself and just said that if anyone is interested in the skinless chicken they can have it. It wasn't ordered as the group's dinner",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "My daughter literally did this the other day with a Walmart whole chicken. I expected her to take some—it’s our favorite part! I looked at it, then looked at her. She said, “I offered you a piece?”\n\nThe damn chicken was NAKED! \n\nAnd, yes, I raised her better! (And it was just her and I eating—thank goodness!) 🤦🏻‍♀️🤣",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Lmao legit came to say this",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Totally reminded me of this too",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Kenny breaking into tears because his family is poor AF and it was the one time he could enjoy KFC 😭😭😭",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1390,
              "content": "[removed]",
              "id": 25,
              "comments": [
                {
                  "score": 697,
                  "content": "Yeah this is what got me.  I was still hungry so instead of just *eating another piece* I scavenged the toppings????",
                  "id": 26,
                  "comments": [
                    {
                      "score": 398,
                      "content": "I’m imagining her boyfriend in the living room watching TV while she excused herself to stand in the darkened kitchen, the only illumination from the open refrigerator door as she hunches over, picking pineapple, pepperoni, and cheese out of the half opened box and stuffing it in her face before he notices.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 204,
                      "content": "Instead of eating the pizza I made sure other people wouldn't want to eat it either",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 137,
                      "content": "Right!?!?  I was reading it and thinking I know where this is going. Boyfriend is an asshole and shamed her for having another slice. Or she was inconsiderate and ate all the rest of the pizza.  But then from the top rope here comes I ate all the toppings off the remaining pizza. Totally unexpected and shocking behavior.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "I regret to say I would totally do this - but not to someone else’s pizza",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Yes. I wanted to ask how old OP is, because they act like a 5 year old.  YTA",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "I swear there was an AITA thread about someone doing something like that to a cake\n\nYTA OP. I had a cat that did that once to my pineapple pizza but she was ya know a cat.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 4,
                      "content": "My mom’s cat hated my dad. My mom bought him a birthday cake that said happy birthday lee on it and the damn cat got the lid open and only licked his name off the cake.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Had a girl in class who, after we all had our first cookie and the rest where on a desk up for grabs for a second go, ran to it and took all 20 of them and proceeded to lick em all. Never wanted to sucker punch someone in the face so hard.",
              "id": 34,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I have a friend who does this exact thing. Not just with pizza, with any food. She'll just pick out the 'best' parts and leave the rest. Worst thing was when they had a pizza party, ordered a bunch of domino's and when a couple of people went back for more she was eating the toppings, her husband called her out on it and she just shrugged and I said \"I don't care because I paid for it.\" He was dumbfounded and was like yes but you also invited these guests for a pizza party and have now stuck your dirty fingers in every slice, and she just responded, My hands are clean and walked away. It honestly blew my mind.",
              "id": 35,
              "comments": [
                {
                  "score": 5,
                  "content": "Her fingers are \"clean,\" because she licked them as she was eating. Vomit!!!!",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Not so weird. I know a lot of people who do this. Of course they're all under 5 years of age.",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "This is the girl who giggles like a toddler and thinks every sociopathic thing she does is just adorbs tee hee!",
              "id": 38,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1409,
          "content": "Lmao honestly, I am absolutely shocked. She ate the toppings on all the pizza slices?? That is so odd",
          "id": 39,
          "comments": [
            {
              "score": 1242,
              "content": "Why would she not just eat another slice if she was still hungry?",
              "id": 40,
              "comments": [
                {
                  "score": 604,
                  "content": "Probably it’s the same “logic” as why people will eat their partner’s fries instead of ordering their own. Some women especially are really weird about eating “bad” food, and I can see somebody like that convincing herself that picking off the toppings was somehow better than just taking a slice.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 399,
                      "content": "This is exactly what it is, this way she can pretend in her head she didn't actually have another slice.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 137,
                      "content": "OMG!!!!!  This is one of my biggest pet peeves.  I used to date a girl who would tell me she's not hungry, then eat all my fries.  Ended that real quick.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "“I’m not hungry, but I touched every part of your food and picked it apart. Bon appetit!”",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Yeah. No bread. No cheese. Very little sauce. So the toppings were \"healthy\". The pineapple was fruit. The pepperoni was small bites so not a full serving.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1203,
          "content": "I went on a work trip recently  and decided I would just order a pizza for myself for the two days I'd be there as I had a free one from Dominos.\n\nDay two I ended up not being as hungry as I thought and I wasn't bringing half a pizza across the state with me so I just ate the toppings off. Even knowing I was the only one eating it and it would go to waste otherwise, I felt like some horrible little raccoon. \n\nI can't imagine just stealing **all** the toppings off a shared pizza. Unhinged is a good word for it.",
          "id": 46,
          "comments": [
            {
              "score": 327,
              "content": "I can't stop laughing at \"some horrible little raccoon\"!!",
              "id": 47,
              "comments": [
                {
                  "score": 19,
                  "content": "Omg same! Just full on cackled.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Gonna get n trouble at work laughing at the horrible little 🦝.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "#YES LOOOOOL TOOK ME OUT! 😂😂",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "It is one am here and I am trying not to wake my husband up because I’m laughing so much at this!",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Exsqieeze me! Do not hate on the racoons, please! They are adorable and the opposite of wastefull.\n\nAs for the toppings, I do that sometimes of my pizzas, but then I just eat the rest for the next meal... Amd I certainly would ask for permission to do that to someone elses food!",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Like... my daughter eats all the toppings off her pizza first, but it's HER pizza. We usually order her a small pizza of her own. If we all share a pizza, she does it to her own slices.",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1150,
          "content": "This. It's like saying \"hey, I'm not going to eat all of the pizza, but I'll also make sure that you can't enjoy the rest.\"\n\nI bet OP sucks all of the chocolate off of chocolate almonds and wonders why no one wants any.\n\nYTA",
          "id": 54,
          "comments": [
            {
              "score": 249,
              "content": "Oh but isn’t she cute with her little quirks?!  /s",
              "id": 55,
              "comments": [
                {
                  "score": 24,
                  "content": "I srsly wonder if that was the intent. Def fail.",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 124,
              "content": "That’s exactly right. How did she expect him to react, I wonder?",
              "id": 57,
              "comments": [
                {
                  "score": 22,
                  "content": "Right? Even if I was okay with having just cheese on my pizza, she has dug her dirty fingers into every single slice and mutilated them. Now some people might be okay with “sharing a few germs” but that pizza is dead to me after doing that.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "OP is showing some serious selfish behavior and if I were the bf I'd be pissed as hell too. I think for me, I'd question what else they'd do. She even laughed it off like she didn't even get how f-ed up it was. The world doesn't revolve around you OP.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 435,
          "content": "My wife had some horrendous roomates in grad school.\n\nWe went apple picking one weekend, and she baked 2 nice loaves of apple bread, one to share with her roomates, and one for us. Her roomates ate the designated loaf, but one of the roomates \\*fucking picked and ate the entire top crust with her fingers\\* of the loaf we saved for us. Only the top. Did not take a slice, but picked and ate the entire top of the otherwise untouched bread. \n\nAll the other roomates acted like it \n\n1) Wasn't rude as fuck.\n\n2) wasn't also weird as fuck. \n\nI said it was both, that the picker was incredibly rude for not only eating something that was not hers, but effectively runing the entire loaf by doing so. I was asked to not spend the night there anymore, because i was 'problematic' and made the picker 'feel unsafe'.",
          "id": 60,
          "comments": [
            {
              "score": 127,
              "content": "Why did this exact situation also happen to me omg?? I baked this really nice apple bread, and one was for a friend who didn't live with me. I left it out to cool and then I went to class (back in college days) and I came back and it was so picked through you couldn't tell what it was. I was so sad...tell your wife I TOTALLY get it lol",
              "id": 61,
              "comments": [
                {
                  "score": 15,
                  "content": "What kind of fucking savage eats something in that way and thinks it's acceptable? Madness, pure unhinged madness.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "> but one of the roomates \\*fucking picked and ate the entire top crust with her fingers\\* of the loaf we saved for us.\n\nWas her roommate a three year old?",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "How do these people find each other???? Like how did your wife wind up rooming with the only 3 or whatever people in the world who would find that acceptable behavior?\n\nJust wild.",
              "id": 64,
              "comments": [
                {
                  "score": 20,
                  "content": "maybe there were 3 crust snatchers but only one admitted it.",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "🤣🤣🤣 \"unsafe\" I am guessing they knew it was rude, but doubled down because she was otherwise popular with the others. Sounds like mean girls to me",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I wish I’d pointed out almost this exact thing when it happened to me by one of my housemates. Only the picking happened to toppings off my birthday cake",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 429,
          "content": "YTA. \n\nINFO: OP if it was your pizza would you eat the toppings off of your leftovers??\n\nI can’t even understand what your logic here is, OP. Why wouldn’t you just have another piece? Or half of a piece? If you’re not hungry enough for that then you’re not hungry you’re just making some strange power move that’s not what you think it is.\n\nYou’ve been dating a month?? Yeah..you’ll be lucky if he sees you again. I definitely would nope right out of that crazy.",
          "id": 68,
          "comments": [
            {
              "score": 139,
              "content": "I can see the logic, but I don't agree at all. My mom was a snob so I grew up with a similar attitude around. They didn't see the rest of the pizza as leftovers. OP thought it would be thrown out instead of enjoyed later. It's privilege",
              "id": 69,
              "comments": [
                {
                  "score": 127,
                  "content": "People do that???",
                  "id": 70,
                  "comments": [
                    {
                      "score": 83,
                      "content": "I have in-laws that absolutely refuse to eat any leftovers. Not pizza, not day-after-Thanksgiving turkey sandwiches, not even lunch meat that was opened yesterday. They eat it fresh out of the package/oven, or not at all. Then throw the rest away. \n\nAs someone who grew up in a podunk rural town as a solo child with a single mother working afternoons in a factory, this seems like Such a waste. In my world, if it smells edible, isn't slimey, moldy, or hard as cement, it could be dinner, or at least an ingredient.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "It started out as a thing where servants who didn’t live with their employers had “toting privileges.” They could take leftovers, out-of-fashion clothes, candle ends, etc. home with them. \n\nThat created a class of people who thought it was socially unacceptable to eat leftovers, some who came from that background and others who wanted to imitate it. \n\nThe sick thing was keeping that mentality even when there was no one to take the leftover food. Leftovers are something SERVANTS eat! We may not be able to afford “help” anymore but we certainly haven’t sunk that far! Gross.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Growing up it was considered tacky not to make fresh food for dinner (or any other meal) unless it was something especially good you can't just get fresh. Even when we had no money. It's insane what it can do to people once they have it in their heads that they're better than others. I'm not saying OP does, but it seems they've at least been around that attitude a lot",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 418,
          "content": "Like why the fudge would OP do that? It's like eating 'half the watermelon' by eating the center and leaving the less sweet half for your partner.\n\nWtf. I'd breakup with my partner over this.",
          "id": 74,
          "comments": [
            {
              "score": 384,
              "content": "He definitely should break up with her. It's only been a month, and this kind of action says a lot about who she is and how she'll treat him going forward. She's inconsiderate, dismissive, and wasteful.",
              "id": 75,
              "comments": [
                {
                  "score": 153,
                  "content": "Ok, so I don't disagree with you about the behavior being selfish and wasteful, but don't you think this is one of those things that OP thought was normal in her life/family and now can be shocked out of that idea and move on to be a better person? One example in my life is that my friends were sincerely upset that I didn't make my bed after sleeping over. In my mind I would never do that, because they are just going to strip the bed to wash the sheets. I'd be more inclined to strip the whole bed and put it in the wash, so we've agreed on that moving forward, but they were actually offended, and I was totally blindsided. Just how we were raised.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 197,
                      "content": "The fact that she didn't apologize and doubled down and came to aita asking if she's the AH? It's nice of you to give her the benefit of a doubt but this isn't it.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "As an aside, if you are allergic to dust mites, DO NOT MAKE YOUR BED.\n\nMaking your bed traps moisture and heat in your mattress and bedclothes for longer than if you leave the bed unmade. And dust mites thrive in those conditions, so you want to \"air out\" the bed as much as possible. Leave that mattress exposed, not neatly covered by your duvet!",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "She says \"I thought he was joking and laughed it off,\" but never said why she thought he was joking. It sounds like she doesn't know what leftovers are, never heard of anyone taking leftovers to work for lunch, AND never heard of a midnight snack, but how is that possible? Is it her first day on Earth? I hope she's socked out of it.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'm the rare person who prefers the less sweet part closer to the rind. I would still be pretty grossed out if the wedges of watermelon were half-eaten. It's not even about whether you like what's left, it's just knowing someone else has been picking and pawing at the food.",
              "id": 80,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 242,
          "content": "I can bet it’s because she didn’t want the extra carbs. I know other women who do this. Like just eating the frosting from a cake/cookie. Very conscious of caloric and macro intake. \n\nAnd that’s fine for your own piece. Waste what you want of your own food. You don’t fucking abscond with the rest of a shared pizza and ruin it because you’re hungry but don’t want THOSE calories.",
          "id": 81,
          "comments": [
            {
              "score": 152,
              "content": "THIS - she was trying to eat all dainty like cos they’ve only been together a month, instead of eating until she was actually full. Then lizard brain hunger combined with shame and guilt for over-eating which justified “just the toppings” logic … and she is now in denial cos it’s embarrassing.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "My sister does this because she’s very conscious of her weight. She lost a significant amount of weight over a decade ago and has managed to keep it off all these years but it’s super annoying eating with her sometimes because she’ll eat all the pepperoni off the leftover pizza or she’ll take a bite of my food instead of a helping for herself because she’s worried she won’t be able to stop herself if she takes her own serving. She only does this to me or our mom so only people she’s really close to but I yell at her every time—she doesn’t care and still does it. She’s my sister and we’re close and I understand her issues around food so I let it go. \n\nI feel like OP might have misjudged where her relationship with her bf was at. It’s only been a month. This is an act that’s inherently odd and selfish, or to put it more simply—assholish. Some people you love will tolerate your asshole behavior as a trade off for your non-asshole behavior, but it doesn’t seem like OP and her bf are anywhere near that territory yet and she fucked up because she made that assumption without knowing her bf well enough to know this is something that wouldn’t fly with him.",
              "id": 83,
              "comments": [
                {
                  "score": 19,
                  "content": "Yeah those are disordered eating habits.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This was the first thing I thought too. It screams disordered eating to me.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yeah my mom is obsessed with her weight and she does this. It's annoying.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Except she ate whole slices at first and finally picked all the toppings off when he wasn’t looking (“When he saw he flipped out”). Nope, I say she’s either the most thoughtless and selfish person in the world, or she thought it would come off as a cute quirk.\n\nWho even does this?! For real.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "That doesn't make any sense, the frosting mostly sugar and very carb heavy.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 136,
          "content": "Right like why not just EAT ANOTHER SLICE if she’s still hungry?!",
          "id": 89,
          "comments": [
            {
              "score": 7,
              "content": "Because tooooo many carbs of course!",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "Not only OP ordered pineapple on pizza she only ate the toppings not whole pieces!  \n\n\nOP's bf should run because he's dating a psycho!",
          "id": 91,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19558,
      "content": "YTA. If you're still hungry, you eat another piece, you don't ruin all the remaining pieces. SMH",
      "id": 92,
      "comments": [
        {
          "score": 6312,
          "content": "Let me break it down. \n\n\n1. OP, you are a guest in another person place.  You both are learning about each other.  The relationship is only a month old.  \n\n2  You totally missed his anger.  You made as AH of yourself with your reaction.  If you ate one slice with topping, that ok, but you didn't.\n\n3.  You have given the impression of being selfish and idiot one at that.  You ate only the topping!  WTF.  To him, you just spat in his food.\n\n4. Then you have the audacity to laugh in his face about it.  What on Earth were you thinking?  If someone did that to be under my roof, I'd tell them to GFTO now.\n\n5. He was saving the other half for lunch tomorrow.  Did you ASK to eat the pizza?  Because from your post, you didn't. This is very rude.\n\nYTA.\n\nEdit - give BF time to cool off, then ask him our for a date.  Then grovel and accept your an AH.",
          "id": 93,
          "comments": [
            {
              "score": 2066,
              "content": "This! OP thinks this is about pizza. It isn’t about pizza, at all. Because if it was all about pizza, then perhaps the bf would be the jerk here for overreacting over something trivial. \nWhat the bf is upset about is the pure selfishness and thoughtlessness of the behavior. That’s the part that is hard to get past. Then the fact that she didn’t immediately realize that, and mocked him for being upset just adds to it.",
              "id": 94,
              "comments": [
                {
                  "score": 429,
                  "content": "Yep!  It's the total lack of consideration in addition to putting her fingers all over the left over slices which is so gross.   Her laughter and then her solution of throwing money at the problem TOTALLY misses the point as to why the guy was angry and then giving her additional side eye.  She just doesn't get it.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 102,
                      "content": "OP reminds me of someone who would just stick their hand into a tray of brownies, grab a hunk while waiting for their \"real snack\" to finish in the microwave, and then walk off leaving the disgusting, germy, partly eaten brownie sitting in the tray for someone else.\n\nI caught this person and put their brownie on a plate for them and said \"your welcome\" in a pretty haughty tone. It was petty of me, but I stand by it.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "It isn't about the Iranian yogurt....",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "It also shows that she sucks at communicating because she could have just asked if he was going to save the leftover pizza.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 822,
              "content": "A one month old relationship? I wouldn’t take someone back after this. It’s going to be the first of many inconsiderate and weird actions. This person doesn’t think of others and has been raised without boundaries.",
              "id": 99,
              "comments": [
                {
                  "score": 265,
                  "content": "Exactly. This is not a misstep. This is a red flag and a taste of what's coming.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 135,
                      "content": "Agreed. Laughing it off instead of trying to understand and apologizing. Also wildly selfish and inconsiderate to do this in the first place. Very hard to change those that don't think about others, and usually not worth the effort of investing your time and energy into doing so",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "a taste of what's coming... which unfortunately is not ham and pineaple",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Tastes like bread and sauce, and none of the good bits.",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Right?? If I was dating somebody and they went back and ate the rest of the pizza without telling me I'd be disappointed but oh well, they were hungry and I didn't specify I was going to eat it later. BUT OP went back and ONLY ate the toppings making the entire rest of the pizza trash because it has literally been picked apart. You're either a complete mindless idiot or you're so inconsiderate it isn't even funny. Neither of which I could stand in a relationship.  YTA OP",
                  "id": 104,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Lmao same - in the early days of a relationship. If you get some major red flags, just cut your losses and go. Imagine a life of this pizza thievery😱",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Agreed, I’d literally break up over this",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I might argue this is just a learning experience for Op.  Maybe they were raised by wolves or something but they can still learn to live among the people",
                  "id": 107,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I HOPE this is a learning experience for OP. Doesn’t mean her ass shouldn’t get dumped, though.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "#3 needs to be in bold. That’s the main issue here. She only thought about herself and didn’t care that the rest of the pizza wouldn’t have toppings for anyone else to enjoy. OP, YTA",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": ">give BF time to cool off, then ask him our for a date. Then grovel and accept your an AH.\n\nNo, I think it's more like \n\n>accept your an AH.\n\nand don't be such a selfish B to the next boyfriend.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Being only a month into the relationship, I genuinely think OP is lucky she didn’t get kicked out and broken up with on the spot.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yeah YTA. \nIt’s like the scene in South Park where cartman eats all the skin from the chicken at KFC before everyone else sits down at the table.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8732,
      "content": "YTA you couldn't have taken another slice? Who just eats the toppings and leaves the pizza? I'd have been upset too if I was in his place.",
      "id": 113,
      "comments": [
        {
          "score": 1287,
          "content": "My 5 yo does, but I'm a sap when it comes to her so I allow it.",
          "id": 114,
          "comments": [
            {
              "score": 1211,
              "content": "I didn’t get the impression that OP was around that age. Could be wrong though. It is 5 year old behavior",
              "id": 115,
              "comments": [
                {
                  "score": 52,
                  "content": "I'd hesitate to allow it though as general behavior. The longer it's accepted the more difficult to end, maybe OP got that allowed, too.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 34,
                      "content": "My 3 year old wants to eat all the sausage off the pizza. I’ve solved this by giving him his slice, then having cooked sausage in the freezer ready to go if he wants it. I don’t let him take the sausage from other people.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 708,
              "content": "Don’t, because you’ll raise an adult like this 😱",
              "id": 118,
              "comments": [
                {
                  "score": 465,
                  "content": "My dad let me so this and I did not grow into an adult like this.\n\nBecause normal adults can recognize the difference between \"things your parents let you get away with because you're cute and they love you\" vs \"acceptable behavior with other people\".",
                  "id": 119,
                  "comments": [
                    {
                      "score": 174,
                      "content": "This! My parents let me get away with a lot of bad food habits at home. But I would never have the audacity to drink milk straight out of the carton in someone else’s house, Or eat just the frosting off someone else’s cupcakes just because my parents let me.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "There are still swathes of people who never have that realisation though. Who would think to themselves; well, I have always done this and I'm the most important person I know, so I'll keep doing it, so there.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Some people  never have graduate from “I’m cute and get whatever I want”",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Exactly!  Saying NO! doesn't get easier!!!  It's the opposite!",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 233,
              "content": "My 6 y/o will pull the cheese and toppings off of pizza and leave the crust, but she only does that to her slice/slices. Even she knows not to do that to other people's pizza",
              "id": 124,
              "comments": [
                {
                  "score": 106,
                  "content": "Mine does this then also eats the crust. It’s so weird, like it must be deconstructed and eaten in its original parts.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 31,
                      "content": "But don't you dare MAKE them a deconstructed pizza, or pull it apart for them. All hell will then break loose. \n\nSource: have a toddler",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "At least the food doesn't go to waste.\n\nWhen I was a kid I was watching a horror movie with my friend. We had pizza and when there was a gory scene she just said I'm not hungry anymore and didn't finish the pizza! I remember it decades later and it still irks me. If I lose my appetite watching a movie I just save the food for later.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "You’d pay a lot of money for that in a fancy restaurant!",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 74,
              "content": "Please don't, do you want to create another OP?!",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "I used to do this when I was small but I only did it to my own slices. Like it would have been weird if OP only ate the toppings on the slices of pizza she took but it’s AH behavior to ruin all the leftovers by doing this without talking to the person you ordered with.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "My mother used to love telling the story about the time time when I little kid three and she ordered a pepperoni pizza and walked away for a few minutes coming back to only a cheese pizza.  I don't remember it but to this day I ha e the urge to pick off the pepperoni first and then eat the rest of my slice.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "You’re not doing her any favors by letting her behave badly. A parent’s role is to teach children how to behave. If your daughter grows up spoiled and entitled, other people aren’t going to think it’s “cute”, and that will cause problems for her later on.\n\nThe OP’s girlfriend probably had parents who thought her misbehaving was “cute”, too.",
              "id": 132,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Plot twist. OP is your daughter and this all took place at a kids birthday party",
              "id": 133,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 489,
          "content": "I’d honestly be less upset if someone ate the whole last half of the pizza than if they just ate all the toppings and left the crust they’d had their hands all over for me to throwaway. \n\nThe former would make me think, “wow they were pretty hungry, wish they’d left me some thought”. The later would make me think, “what a selfish AH, how to do I get this person out of my life?”.",
          "id": 134,
          "comments": [
            {
              "score": 118,
              "content": "This. If they ate the whole pizza then the fault is on me for not specifying \"I was going to eat that for lunch tomorrow\". But why would I ever have to tell another adult \"don't just eat the toppings off the rest of the pizza unless you're going to actually also eat the rest of it\"??",
              "id": 135,
              "comments": [
                {
                  "score": 17,
                  "content": "And also, if they were that hungry that they ate it all and there was no leftovers, so be it. Sucks cause leftover pizza is great, but I'd never be mad at someone for eating the food we had organised for dinner. Sometimes I'll plan a meal thinking there'll be leftovers but my boyfriend is extra hungry, I'd rather him eat it and not be hungry. \n\nBut to pick the toppings off? It's making me too angry, I need to get off this thread.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Exactly!",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 267,
          "content": "I was dog sitting my mom’s Boston terrier mix over the last month. We ordered extra pizzas (teenagers in the house). My son and I went to grab a slice hours later…. And my mom’s damned dog got into the boxes and ate the toppings off the two pizzas that didn’t have a stack of plates on the box!!! \n\nSo to answer your question, my mom’s dog. Lol",
          "id": 138,
          "comments": [
            {
              "score": 84,
              "content": "My cat tries to eat the toppings as well",
              "id": 139,
              "comments": [
                {
                  "score": 20,
                  "content": "Now we know who eats just pizza toppings: dogs, cats, ...and OP.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My cat wants the whole damn pizza! He’s a weirdo who loves bread and tomato sauce though. An Italian cat perhaps 🤌",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 58,
              "content": ">So to answer your question, my mom’s dog. Lol\n\nSo what you're saying is... OP is your mom's dog!",
              "id": 142,
              "comments": [
                {
                  "score": 23,
                  "content": "Not sure if just stating the facts or dishing out sick yo momma joke 🤔 perhaps both!",
                  "id": 143,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Made me laugh!!! 😂",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 51,
              "content": "That’s crazy. My friend was dog sitting for her brother and got a pizza. The pugs had the decency to eat the entire pizza at least.",
              "id": 145,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "I'll admit that I've eaten just the toppings from my slices due to having digestive issues that prevent me from eating the crust at times. However, when this occurs, I put the crust in the fridge & eat it later with some pasta like it's a tomato garlic bread. But that's with my food due to my crummy health. I'd never dream of doing it with a shared pizza. I'm embarrassed when I do it with my own pizza & it's only mine!",
          "id": 146,
          "comments": [
            {
              "score": 11,
              "content": "That's honestly fine. It's your pizza, you can do whatever you want with it. (Just don't blend it with soda like a lunatic.)",
              "id": 147,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Even if you did throw away the crust after, you only did it to your OWN pizza slices. I would bet everyone in this sub has done this at least once. I mean, sometimes I'm full up on pizza but I don't want those last delicious toppings to go to waste. So don't be embarrassed, you're certainly not an ass for disassembling your own personal pizzas.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "…I eat the toppings and then the pizza, but I mean, that’s on my personal slices only and I’m still eating the pizza!",
          "id": 149,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4831,
      "content": "YTA - You basically ruined future meals by pecking at it until it was incomplete and unpalatable. You should apologize, sincerely, and pay for a new pizza. Acting so flippant over a meal you selfishly ruined makes you childish.",
      "id": 150,
      "comments": [
        {
          "score": 767,
          "content": "Not basically. She literally ruined future meals.",
          "id": 151,
          "comments": [
            {
              "score": 31,
              "content": "Literally speaking, she ruined a future meal",
              "id": 152,
              "comments": [
                {
                  "score": 14,
                  "content": "No, I think u/FlyAwayJai meant future mealS. They've been dating one month. I doubt they'll be dating much longer.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yep. I was only thinking about the lost potential future meals* from that ruined pizza.\n\n*meals/meal depending on how much pizza he shovels down in one sitting.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 708,
          "content": "Honestly, in super new relationships, I take note of the small things. After a month, someone is still on their \"best behaviour\", and wanting to show themselves in the best light possible. So, it's those little AH, selfish actions that give you a look into their true character. I tend to watch and observe instead of just taking the honeymoon phase show and dance at face value -  and it has never really led me wrong.\n\nThis one action would make my spidey senses tingle and think that OP is selfish, self absorbed, and only cares about their wants + needs.",
          "id": 155,
          "comments": [
            {
              "score": 262,
              "content": "Agreed. One month in? I'd end it over something like this.",
              "id": 156,
              "comments": [
                {
                  "score": 70,
                  "content": "Mayyyybe if they were obviously shocked by my reaction (like, legitimately had not realized this could be offensive, because they were raised by, I don’t know, wolves) **and** they immediately apologized, I’d give it another shot.\n\nBut I’d definitely end it if THIS were his/her response to me being upset! “I can’t be TA, can I? I know I’ll go ask Reddit”",
                  "id": 157,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "I mean, it’s clear you’re dating an alien from outer space, so that seems reasonable. Who picks off pizza toppings???",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Me too. Unless they realized how much they goofed and apologized sincerely and immediately, the relationship would be over quicker that the time it takes to deliver another pizza.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 314,
          "content": "“Am I the asshole for picking all the tastiest and best morsels off of someone else’s food for myself, thereby ruining it for them?” \n\nYes, of course you’re the AH. This was selfish and gross.",
          "id": 160,
          "comments": [
            {
              "score": 94,
              "content": "“Am I the asshole for eating just the chicken skin in a kfc fried chicken bucket my bf and I ordered?” “Am I the asshole for eating just the meat from my bf’s burger?”",
              "id": 161,
              "comments": [
                {
                  "score": 35,
                  "content": "“Am I the asshole for sucking the cheese off of all the mac and cheese and leaving him the spitty noodles?”",
                  "id": 162,
                  "comments": [
                    {
                      "score": 19,
                      "content": "“Am I the asshole for drinking all the milk from our cereal?”",
                      "id": 163,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "There's an episode of South Park where Cartman actually does eat all the skin off of an entire KFC bucket. OP is Cartman.",
                  "id": 164,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": ">and pay for a new pizza. \n\nTo be fair to OP, she already offered to do that. BF didn't want to take her up on the offer.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3362,
      "content": "YTA. By eating only the toppings, you pretty much wasted the rest of the pizza. A large portion of the pizza is just garbage now. If you're hungry, eat another slice instead of wasting half-a-pizza that you knew, or should have known, someone would still eat.",
      "id": 166,
      "comments": [
        {
          "score": 606,
          "content": "OP clearly YTA. Personally I wouldn’t care if OP went back and finished off the rest of the pizza. But going back and just eating the toppings and leaving the rest, that is so infuriating!!! 1. I hate waste of any kind. 2. That is like a spit in the face.",
          "id": 167,
          "comments": [
            {
              "score": 61,
              "content": "Exactly. You cook a pizza. Sometimes you have leftovers, and have it for lunch, sometimes you’re hungry and finish it.\n\nUnless someone was exceptionally greedy and ate food you’d cooked specifically for the next day (which I call meal prep, not leftovers), it’s fine.\n\nOP obviously in the wrong here, ruining the leftovers in a selfish way.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": ">Personally I wouldn’t care if OP went back and finished off the rest of the pizza\n\nRight? It's the fact that she ate HALF of the pizza remaining, but decided that only she gets half of the pizza and the other half gets thrown away.\n Feels almost like the selfish \" if I can't have it, nobody can\" mentality because she was probably too full to eat all 4 slices, but still wanted to get the benefit of all 4 slices, so she committed the worst pizza crime in the history of all pizza crimes (and that's saying a lot considering the wild toppings some people have put on pizza in the past)",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah the toppings are PART of the pizza, it's not like an optional side.\n\nIf they had a cheese pizza, then a side thing of toppings, that would be forgiveable cuz the original pizza wouldn't be ruined. But yuck. i wonder if she'd like to eat a pizza with the toppings pulled off?",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2984,
      "content": "INFO: Why do you think that was acceptable? Why didn’t you just eat another slice?",
      "id": 171,
      "comments": [
        {
          "score": 558,
          "content": "Or eat the toppings off one slice or two? not the whole thing",
          "id": 172,
          "comments": [
            {
              "score": 386,
              "content": "Or at least thrown away the crust she’d had her greasy hands all over, instead of leaving it for him to deal with and pretending it was still food other people could eat.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 254,
              "content": "Nope. It’s either hungry or not hungry - there’s not ever the need to only pick the toppings off.",
              "id": 174,
              "comments": [
                {
                  "score": 108,
                  "content": "I wondered if maybe she was wanted the pleasure of tasting it while not having to metabolise the carbs.\n\nDoesn’t change how much of an AH move it is. Shows such a lack of consideration and self control.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 95,
                      "content": "Yeah, my 3 y.o. does that. Pretends to be hungry, then proceeds to only eat the topping and not the slice of bread. Adults really should be long past that.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 83,
                      "content": "This is it. I'm betting she was actually full, so she couldn't stomach any more slices; but still had appetite for the nice taste of the toppings.\n\nSome people say \"hunger\" when they mean \"appetite\". Only people who live in abundance and have never gone without eating long enough to know what hunger actually feels like, I imagine. Fullness for them is an inconvenience, because it means they must wait a while to please their taste buds again.\n\nOP has probably never lacked money to buy whatever pleasure food she feels like at any time, has possibly never reflected on the fuel aspect of food, so it didn't occur to her that leftovers could have value.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "That crossed my mind.\n\nI had to quit gluten so when I missed pizza and pasta I would make baked tomatos with cheese and tuna. U get the feeling of the toppings or pasta sauce. It's just missing the bread.\n\nFor next time ur feeling peckish OP. U could just make some toppings, get creative.",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 56,
          "content": "She states that she hadn't eaten pizza with him before, so she didn't know that his pizza eating habits were to not be a complete psycho. How could she have know that he ate pizza like the rest of the planet?",
          "id": 179,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "INFO: Are you actually 5 years old OP? \n\nCause that's the ONLY situation in which this would be acceptable. You don't mess with someone else's food. Ever.",
          "id": 180,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Taking a knife and slicing a slice into a smaller slice for yourself would have also been acceptable if you are too full for a whole slice.",
          "id": 181,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1544,
      "content": "What kind of monster just eats the toppings off the left over pizza? Just eat another slice of pizza? But no, you choose to ruin the rest? Do you eat toppingless pizza normally?",
      "id": 182,
      "comments": [
        {
          "score": 614,
          "content": "> Do you eat toppingless pizza normally?\n\nThat’s the part that annoys me the most about this. \n\nShe’s pretending pizza crust with no toppings is still a meal. \n\nLike, even if she hadn’t put her dirty hands all over it while ripping the toppings off and shoving them into her maw, plain pizza crust is not a meal. \n\nIt’s like she scooped all the peanut butter and jelly out of a sandwich (with her hands) then pretended he could just have the two pieces of bread she left as lunch.",
          "id": 183,
          "comments": [
            {
              "score": 194,
              "content": "I'm assuming she left the cheese on it still... Which would be fine, if it weren't for the fact that toppings usually get stuck in the melted cheese, and pulling the toppings off would mess the cheese up. So even if the bf wanted to eat the now-plain pizza (which, I wouldn't after my partner put their hands all over it), it's probably a mess and would be a pain to eat. I've picked toppings off my pizza before and then tried to eat it, and the cheese falls everywhere after you've done that.\n\nJust truly strange behaviour here.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">It’s like she scooped all the peanut butter and jelly out of a sandwich (with her hands) then pretended he could just have the two pieces of bread she left as lunch.\n\nBest way to put it. Sometimes people don't get it until you put it in different terms.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "I know someone like this and they just kinda suck in general. I'm gonna guess op doesn't give af",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1170,
      "content": "ESH,\n\nHe’s overacting but you’re actually an insane person, you literally Cartman’d the pizza.",
      "id": 187,
      "comments": [
        {
          "score": 352,
          "content": "*Kenny crying noises*",
          "id": 188,
          "comments": [
            {
              "score": 51,
              "content": "Wishing I had a million upvotes to give",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Just watched this episode last night lmao 🤣",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 317,
          "content": "He's overacting? \n\nThat was his lunch for the next day. She ate all of the toppings off the pizza and expected him to just munch on plain bread?",
          "id": 191,
          "comments": [
            {
              "score": 161,
              "content": "He goes over that line when he refuses her offer to buy him a new pizza. Yes she crosses a boundary (and she is, imo, an ahole for not asking first) and he has a right to be upset. But then she makes a plan to actually fix it by replacing the food which means he has lunch. And he doesn't accept but also keeps moping about it - if he were actively seeking out a conversation with her on what happened it would be different to me.",
              "id": 192,
              "comments": [
                {
                  "score": 144,
                  "content": "But he’s unhappy about OP’s motivation, not about what OP actually did. The pizza is just a red flag for their character. Buying a new one doesn’t fix that.",
                  "id": 193,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 110,
                  "content": "Right, because he's correct that the literal pizza is no longer the point. I'm with him here. Replacing the pizza after laughing about it just to appease him is absolutely not a solution to the actual problem. Her thinking this was acceptable behavior and then still thinking it was acceptable enough to laugh at him is awful. Begrudgingly buying a new pizza doesn't undo that at all.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yeah, you're right, I just think that *he's* not addressing the actual problem, either. What he wants, I suppose, is to talk with her about his boundaries around food, and that he wants her to ask him before touching his food/leftovers. Or maybe specifically that he doesn't like her picking the toppings, for example, and please don't do that again. To return to the situation with a message like that would be a good reason for me to not move on. Because you're right, that is what it's about. \n\nAnd, as someone else pointed out, this could simply be a filter for him - a point in the dating process where he realizes that he doesn't want to be with her. That's fine, too. Staying with her, but shutting her out *and* not addressing the actual problem at the same time though, I don't think is nice or helpful.",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "If it was about the pizza, very true. But by her own account, he tried to explain to her that it isn't. She's trying to fix the wrong problem. I read this as he *did* try to talk to her about it, but she just didn't get it, and he gave up.\n\nThey're still getting to know each other, discovering each other's traits. Her buying a new pizza because he called her out on her inconsiderateness, isn't going to fix the fact that she has shown herself as an inconsiderate person.\n\nOne he might want to continue dating still, if she shows an ability for self reflection, and willingness to see how and why what she did was wrong. But if she doesn't, that might be a dealbreaker for him.\n\nThat's the issue. She just doesn't get what the issue is - and that's the real issue. She cannot circumvent that conversation by trying to throw money at the problem. If the atmosphere is still tense, that's probably because he's emotionally checked out and preparing to end things. That's completely fair imo, they've only been together a month.",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "It's not about the pizza. It's about her completely selfish behaviour and her weird psycho attitude about it. Replacing the pizza is missing the point. I would be pissed until she was out of my face. Then I would cut her off",
                  "id": 197,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "He refused the offer of new pizza because the pizza isn't the issue. You're like OP and completely ignoring everything BF says",
                  "id": 198,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah absolutely. This is something you go “wtf, what’s the matter with you?” and you’re mad for 5 minutes.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 104,
          "content": "I was also thinking of when Cartman ate all the skin off the entire bucket of KFC before anyone else had any. And OP should realize he is now her EX boyfriend. One month in. Good going, girl.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "This is like eating all the noodle toppings and drinking all the soup and leaving you with your plain ass noodles. I don't think this is an overreaction.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1095,
      "content": "YTA - if you’re sharing food with someone, it’s common courtesy to talk to the other person before doing anything with it. Him blowing up about it was a bit over the top, but since according to you you were laughing at him being upset and never even apologized, it’s understandable.",
      "id": 202,
      "comments": [
        {
          "score": 129,
          "content": "This! He got upset (rightfully) and OP laughed it off! That alone is insanity in my opinion and more than enough reason to break up with someone who you haven't been dating long. YTA op.",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 758,
      "content": "Yeah, YTA.  Who eats all the toppings off of leftover pizza and thinks everyone else should be happy to eat what you've left behind?  If he wanted a plain pizza, he'd have ordered it that way.  And laughing about it when he objected to your behavior is probably what set him off.  Have you actually known other people who DIDN'T have an issue with you doing this?!?",
      "id": 204,
      "comments": [
        {
          "score": 205,
          "content": ">Have you actually known other people who DIDN'T have an issue with you doing this?!?\n\nThis is what I want to know",
          "id": 205,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 88,
          "content": "You mean apart from mommy and daddy?",
          "id": 206,
          "comments": [
            {
              "score": 14,
              "content": "Seriously, only child behavior.",
              "id": 207,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}