{
  "post content": "I(23F) and Ray(24M) have been living together for 4 years. We bought a house when we were still in college I am a software developer and my work is productivity based and I usually work late afternoons till 3-4a.m. This is even mentioned because Ray’s 3 best buddies LOVE coming to our house. They all say it’s great for everyone. Their girlfriends are not upset they are loud at their place or out drunk at a bar and I really don’t mind the ruckus as I blast Metallica and often scream while I code. I really don’t mind that they have guys weekends at our house as long as Ray cleans up the mess afterwards which he does.\n\nThe four of them got really drunk a month ago and decided it was really the best idea to put on my make up. 500-600$ of skincare, eyeshadows, lipsticks.. just half used and with hair pieces in them. Insert me vomiting a little. After I tell them all off, everyone save for Kole(24M) agrees to split the cost and pay up for the damage. I take the cash and I look at Kole expectantly, the last one of the bunch. He says no way is he giving me 150$, I can screw myself for all he cares. Ray got in an argument with him and Kole stormed out like a little kid. Good riddance! Ray apologised profusely and said Kole will come around. I brushed it off and said I don’t really need him to ‘come around’. He gotta apologise and pay for what he owes- until then I don’t want him in my house. \n\nTwo weeks pass and Kole comes by which is a little strange because Ray is out. I let him in and he walks in the living room and tosses a pile of crumpled small bills on the couch. ‘There, enjoy. I’m sorry. I guess I am the only one that will question your pricing’. I asked if he is accusing me of lying about the worth of my make up and he goes-‘ Accusing? I am telling you, no way is that crap worth all that much. It doesn’t matter, I gave you the money and the apology- I don’t wanna deal with this anymore’\nI kicked him out, texted Ray Kole will enter our house over my dead body and went to do work.\n\nUltimately I ruined something beautiful. They tried once to stay at someone else’s place and got the cops called for being loud (it’s a apartment building). Now, somehow I am at fault. Kole has let Ray know he will apologise for real if I ‘lift my ban’ but oh my God, can you apologise because you were wrong and a a-hole. Kole’s GF texted me as well, she started off nice but got sour at the end ‘You promised you will let him off the hook if he pays up, he did, and you went back on your word. Arguably you are worse off than him. Can you not ruin a schedule that works well for everyone. Come on OP, stop trying to make a point, they’ve all been friends for nearly twenty years’. I am starting to wonder if I am too harsh. As I’ve seen the phrase around here- is this the right hill to die on? AITA?\n\nThings to keep in mind:\n\n-they are loud because they play video games and drink beer, they are not drunk every single weekend. I wanted to clarify because people seem to think they get very drunk every week\n\n-my make up is in a bathroom that everyone uses, I have used old lipstick and shadows to do their Halloween make up and we have used some cheap drug store make up for different games on get togethers. With that said, still unacceptable to go through my stuff without clearing it with me\n\n-I am willing to forgive it because the majority of them were apologetic and offered to immediately pay for the damage\n\n-Ray is upset with Kole and backed me up, however they are not gonna stop being friends because of this particular event. Each to their own here, I am not upset with Ray about that",
  "id": 1,
  "comments": [
    {
      "score": 10929,
      "content": "NTA. He didn’t apologise, he called you a liar. Die on this hill, that man can’t come in to your house again.",
      "id": 2,
      "comments": [
        {
          "score": 7033,
          "content": "OP needs to text everyone in the group exactly how it went down, because I guarantee that Kole lied about just giving the money and apologizing.\n\nOP, you didn't go back on your word either. You let him into the house after the apology. You now aren't letting him in the house because he is a massive asshole that called you a liar to your face.",
          "id": 3,
          "comments": [
            {
              "score": 2684,
              "content": "Also, OP should send them photos of the receipts of her makeup - those morons have no idea what the good stuff costs.",
              "id": 4,
              "comments": [
                {
                  "score": 1856,
                  "content": "$500 seems a little light is estimation to me, unless she keeps a small palette or only estimated the loss of used product. \n\nIn all seriousness, they violated OP's personal use stuff. That's really underhanded, shows an underlying lack of respect.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 687,
                      "content": "And they can't be trusted not to get drunk and do it again. Especially if you unban the one friend, would you really trust him around your stuff while you're not home?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 288,
                      "content": "Just my lipsticks/lip liners alone are worth around $150 and they're all drug store brands. $5-8 a piece and I probably have around 20 or 25. I think people really underestimate how much makeup costs.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 110,
                      "content": "Yes, using someone else's makeup in disgusting and intrusive. Anyone who participated in this is an AH, I don't care how drunk they were",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "I agree that seems light. I needed to restock everything after two years of no makeup, and I spent more than that on just the basics (one small eyeshadow pallet, only one blush, travel mascara instead of regular size, etc.) and I don’t even do a full face. I think this guy got off easy for $150\n\n\nEdit: added a word",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "She said 5-600 didn’t she?",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "A lot of mid-high range eyeshadow palettes START at $50. So if they ruined two palettes, that's easily $100. A lot of foundation is pricey, too.\n\nI mean, I have mostly drugstore and low end stuff except for eyeshadow and if they ruined enough of it the total would be $300 easily of damage. Because all of it adds up.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "And I guarantee you there was at least one product you can’t even get anymore.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Right?! I don't wear a ton of makeup. But when I go get my makeup eyeliner, mascara cost me approximately $100 just for that.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yeah especially adding in lipsticks and skin care products. In a Sephora it’s like $15-40 for a lipstick, up to $60 or a bit more for an eye shadow UD palette, $18 for single UD shadows, skincare is anywhere from like $25 to $70 or more for decent products, hell the Watermelon Glow travel size toner I have was like $20-something I think, can’t remember off the top of my head.\n\nMakeup and skincare products that are worth buying are expensive, especially if there are specific reasons for buying higher end stuff. My skin is really sensitive and it’s worth it for me to buy more expensive skin care products and make up. It’s the difference between my skin feeling and looking awful and being able to feel more secure about my skin along with not having it cause rashes and stuff.\n\nThis dude didn’t apologize, at least not in a genuine way. He doubled down and is now demanding that he has to be let off the hook if OP wants an apology again, which let’s be real, would be just as rude as the first “apology” he gave OP. Only way he could have made the first one worse is instead of small bills he used coins. My bet is he did it when he knew Ray wouldn’t be home so that he could attempt to manipulate the situation in his favor in the eyes of others. If he can’t recognize where he went wrong then it sounds like the trash is just taking itself out.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Seriously. I use Lancome and try to wait for the 30% or BOGO sales and it still adds up quickly. 4 drunk guys playing in a makeup drawer or bag - powders, mascaras, lipsticks, blushes at $30-$75 an item, $500 is easy to get too. Maybe most guys just think the CVS/Walmart items are what makeup costs. Hell, an OPI bottle is $15.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 122,
                  "content": "I would've sat Kole down at my laptop and shown him how much my stuff cost on the Ulta website. Or better yet, invite them all over for a party and ambush them with a powerpoint on how much my makeup retails for, including compelling arguments for spending that much on quality cosmetics, and explaining that when used correctly, my stuff lasts a long time, it's only when a bunch of drunk morons get into it that I need to go out and replace everything.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Hell, bring them to the store and have a list of the exact products that they used, then tell them to go find them and see the prices themselves.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "It’s not up to OP to educate them. Kole knows how to Google",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Why, they were insulting and petulant, the OP did exactly what they should have done, kicked Kole out and said they can't enter their house again.  Perfect response.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "As a guy. I had absolutely no idea how expensive makeup was. I figured it would be pretty cheap, but then I went with a girlfriend of mine to Ulta, she got like 3 small containers and spent like 100 bucks. I was like Damn, I had no idea makeup cost that much.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My mom does not wear drug store makeup, so when I buy her makeup for Christmas or her birthday or something it eats through the whole budget real quick. She likes the Anastasia Beverly Hills Brow Wiz pencils and they are literally like $25 each.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "I would disagree with providing the receipts or estimates if it is to show him she is not a liar. BF knows she isn't, everyone does but the actual A H. I just dont think she needs to \"prove\" anything to him, and he might even take that as a win (he seems like the type).",
                  "id": 22,
                  "comments": [
                    {
                      "score": 2,
                      "content": "it's just another example of how women especially have to justify everything they are, do, and have just to be considered human. \n\nNo one is even pointing out that this guy showed up at her house, when she was alone, and was more than a little threatening. \n\nYou can't convince me he didn't time things to Be there and use his size as a \"manly man\" to try and scare her into backing down",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Just tell them the brand and product names and tell them to google it.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 58,
                      "content": "I think the best way to deal with his AH behavior would be to challenge him. Say hey, you distrust my math on what this costs. How about we agree that the exact actual cost will be looked up of every piece of makeup that was used. If it costs more than that, you owe me extra money and can’t enter my house until you pay that as well and apologize for your accusation. And if it’s less, I’ll pay you back and apologize. I guarantee that he will owe you hundreds more and it will be satisfying to tell him he owes $500 more or he can f*** off and never enter your house again.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "That’s exactly what I would have done.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yes? like actually yes op should have done this.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "I don't think OP went back on her word, and not just because of what you said.\nOP said Kole has to apologise before she considers letting him in.\nThat does not mean that if he apologises she will let him back in.\nThis is one of these logic concepts the human brain has a bit of issues with. For example:\nYou have to fill out a college application in order to get accepted. Without filling out the application you have 0 change of getting accepted.\nHowever, not everyone who fills the application gets accepted. It is not garantied, only a mandatory condition.",
              "id": 28,
              "comments": [
                {
                  "score": 28,
                  "content": "While I agree, if OP uses this logic they will be accused of being pedantic. It won't matter that the apology was shitty, so many people get stuck on just the act of apologizing should be enough that they forget apologies don't have to be accepted.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Exactly, OP should not engage this in good faith, because no one is sincerely mad at her for being dishonest or inconsistent. They’re just using whatever rhetorical cudgel they can to get her to resume hosting these gatherings — purely because **no one, including his own partner, wants to deal with Kole.** Promise, real apology, fake apology, who gives a shit — Kole’s an asshole, so he can’t come over, and that’s the only relevant piece of information.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Reread the post. OP didn't say ANYTHING about \"before she considers letting him in\". OP said if he pays back and apologizes, he can come back. \n\nMaking up extra reasons for saying OP didn't break their word is nonsense, especially when OP didn't break their word anyway since I highly doubt anyone would count how kole handled it as \"an apology\" so he still hasn't even done what she said he has to in order to be allowed back.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 23,
                      "content": ">OP didn't say ANYTHING about \"before she considers letting him in\". OP said if he pays back and apologizes, he can come back\n\nI disagree. OP said:\n>He gotta apologise and pay for what he owes- until then I don’t want him in my house\n \nSorry, english is my secong language, but for me this means that be needs to apologise for her to let him in the house.\n\nAlso I was not \n>Making up extra reasons for saying OP didn't break their word\n\nTo me she did not promise to let him in if he apologised. She didn't say anything about what will happen if he apologise, just what would happen if he does not.\nEven if his apology was real, she is under no obligation to let him back jnto her house.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "I feel like OP should add this tidbit at the end after showing how the apology went down\n\n“Kole did the following XYZ. An apology is where you feel remorse for your actions. He doesn’t feel remorse rather he accused me for XYZ. I expect you all being 20-something year olds to know better as to what constitutes as an apology.  Clearly he hasn’t fulfilled his end of the deal.”",
              "id": 33,
              "comments": [
                {
                  "score": 17,
                  "content": "And he hasn’t shown that he can be trusted around her stuff again. It’s not just about punishment, it’s about protection. OP needs to feel  that she and her possessions are secure in her home, and this guy doesn’t show that.",
                  "id": 34,
                  "comments": [
                    {
                      "score": -2,
                      "content": "Disagree. All of them drunkenly used her makeup. There was no malicious intentions in their actions. It was just drunken humor also know as being a moron.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Exactly what I was going to say. She's not going back on her word, this is the consequence of a completely different action by Kole.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Oh he definitely lied. Pretty sure that's why he came over while OP's partner was out",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly. Also he’s not apologising because he’s sorry, only because he can no longer enter OPs house to be loud. He’s not sorry at AT all and he doesn’t believe her",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This. I bet he's telling a different story. And then add on, \"When someone throws money at you, calls you a liar, and then demands they be allowed back in your house, that's not an olive branch. That's lighting the olive branch I extended on fire.\"",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Actually OP let him into the house before the apology (thinking he was about to make one and it would be sincere). This new ban is more for the whole calling OP a liar about how much the makeup cost etc",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 318,
          "content": "NTA - also the \"Can you not ruin a schedule that works well for everyone\" is complete BS. If they are destroying her property and disrespecting her in her own home then it is not working for her - and given that it is HER home (at least 50%), the fact that it works for them doesn't matter.\n\nWhat started as a single problem seems to have exposed a massive amount of entitlement and disrespect. I wouldn't want these entitled AHs in my home either",
          "id": 41,
          "comments": [
            {
              "score": 133,
              "content": "Everyone has taken for granted that OP is willing to put up with the guys' debauchery, and now that she's reconsidered, it's posing an inconvenience to everyone else so they're trying to guilt her into letting it continue for their benefit, and they don't really care about OP's peace of mind or boundaries at all.\n\nHonestly though, if only one person is letting you drink at their house, and everyone else is telling you \"no, you're too loud and obnoxious,\" at some point you need to take that as a wake-up call and learn to drink and socialize more like a civilized adult, and less like a frat guy.",
              "id": 42,
              "comments": [
                {
                  "score": 54,
                  "content": "All of the other people are glossing over the fact that there a half dozen OTHER homes this group could go it, but those people also said no first so they have no right to demand that OP open hers to this group of assholes.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 130,
              "content": "They’re such a problem with Kole included that they get the cops called on them. Kole’s girlfriend wanting him out of her house seems legitimate, but it’s not OP’s problem to solve. Also, it’s never 50% your home. It’s your home, or it’s not, end of story.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Well at least not Kole and his gf. Thankfully the other guys owned up to it immediately.  Kole still hasn't, except for throwing crumpled bills at her and then being an AH and calling her a liar",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "she's just mad causes now she has to put up with her bf",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "Or, better yet, OP should code it like: `apologizeProperly($forRealThisTime) or die(“I’m not leaving this hill!”);` NTA, OP!",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "I disagree he did apologize and she accepted. However he then committed another offense. He is being banned not for the makeup but because he essentially called OP a liar and a scam artist. That to me is a friendship ending offense. So OP held up their end of the bargain not their fault he is such a jerk he couldn’t help but ruin it in less than a minute.",
          "id": 48,
          "comments": [
            {
              "score": 81,
              "content": "No, throwing crumpled bills on the floor and telling OP he thinks she’s scamming him and he knows the makeup he ruined won’t cost that much to replace is not an apology.\n\nAn apology is telling her he’s remorseful for crossing a line, taking her things, ruining her things - all while being dumb drunk fuckwit.  And ending it with - it will never happen again and if you could find it in your heart to forgive me and trust me enough to let me back into your home, I promise I will never cross that line again.",
              "id": 49,
              "comments": [
                {
                  "score": 5,
                  "content": "I am not here to split hairs because I think he gave a shitty apology and you don’t count it as one as all because you are a sincere human being. My point is that OP is absolved of any guilt because she didn’t go back on what she said. He “apologized” and paid what he owed and then immediately afterwards committed an even worse offense than the initial one. Main point is buddy was extremely disrespectful and his nasty accusations have earned him a permaban.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "OP's ruling was \"pay me back for ruining my stuff\" and then they could return. Kole paid the money, so that issue was settled.\n\nBut then Kole came in to OP's house, and disrespected her like it's not her house. He accused her of lying for the makeup, and he treated her like SHE is the issue here, and not him. He could have literally just given her the money, and said \"See you later\", but instead he decided to CONTINUE to be the \"more correct\" person in the argument by giving the money but not apologize completely.",
          "id": 51,
          "comments": [
            {
              "score": 27,
              "content": "Precisely, he's no longer banned for the makeup fuckery, he's banned for this new offense of completely disrespecting OP in her own home. \n\nBeing respected by the people you trust to enter your home is an excellent hill to die on.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "SO MUCH THIS",
              "id": 53,
              "comments": [
                {
                  "score": 6,
                  "content": "This guy is just...uggh. All he had to do was drop the money off and say \"my bad\", and everyone would have moved on.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "NTA\n\nI would remind everyone this happened because it’s your house and you were disrespected. It’s kind of funny everyone around you thinks using similar tactics would make you change your mind.\n\nHis gf sounds like a peach",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "In addition, simply incanting the words \"I'm sorry,\" does not an apology make.  An apology must be a sincere expression of regret and understanding of the wrong done.  Kole did not apologize to OP.",
          "id": 56,
          "comments": [
            {
              "score": 13,
              "content": "“Incanting the words” was the elusive concept I couldn’t elucidate. This, so much this. Well done.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "NTA - they only want a party house and other gf are mad they have to deal with the guys now.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Not saying that OP isn’t in the right here, because I completely understand where she’s coming from. I can also understand why Kole thinks she’s lying about the cost of her makeup. Guys, hell even some women, probably really don’t have any idea how expensive makeup can be. Depending on the brand, and how much they destroyed, yeah $600 isn’t out of the realm of possibility. No wonder Kole thinks she’s lying about the cost.\n\nSure, she doesn’t owe any of them anything. However, for the sake of my boyfriend, and his longterm friendships, I would snag some screen shots from these brand websites (if some of her items are no longer available, use something that’s a close dupe) and SHOW them how much this stuff is. Honestly, I’d bet if they knew, they never would have done it. They probably just assumed she could run up to the local drugstore and replace it all for under $50. Granted, let this be a lesson to them about messing with other people’s things.",
          "id": 59,
          "comments": [
            {
              "score": 46,
              "content": "I’m not sure how to interpret this. On the one hand, yes, cosmetic costs are wildly out of hand, and unfair in the basic ways that we interpret gender and the cost of it. On the other hand, why does OP have to provide receipts? Is her word insufficient? Do we let this man simply walk because he doesn’t understand the cost of what he destroyed? Is it only when the cost structure comes in to play that we let this woman grieve for the wildly invasive destruction of her life that we make it okay? I’m actually perplexed about what point you’re trying to make here.",
              "id": 60,
              "comments": [
                {
                  "score": 17,
                  "content": "No, she doesn’t owe Kole the receipt. She doesn’t owe any of them anything. The point I was making is that if it were me, I would show Kole exactly how much the cosmetics cost. He probably really has no idea how expensive those items can be. By making them all split the cost of her replacing the cosmetics they ruined, I’m pretty sure they’ll never do something like that again. Kole has an issue with it because he doesn’t believe they are really that expensive. So, show him! That’s all I’m saying.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah I actually like this. As much as I don’t think she owes him an itemized list of the costs, I do think it would help cement how wrong he was, and hopefully make him back down. Maybe after he’s been shown just how wrong he was, he will reflect and feel bad about it. \n\nHowever she doesn’t owe him this, and is well within her rights to just bar him forever for being a disrespectful jerk",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I see it less as her word being insufficient and more as she is educating the ignorant. He is obviously completely oblivious to how expensive this stuff is. Make-up companies gouge their clients quite well.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Lest we forget, it’s not about the cost. It is this woman who has her personal space invaded, did respectfully and with malice. She’s not TA for denying the man who disrespected her, her belongings, and her space.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "She dosen't have the responsability to educate no one. Is her house she alredy has spoken and shouldn't be giving explanations. If he can't belive her, he can search for himself the products he damaged to discover their price.",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "I don't think asking or providing a receipt or a screen grab from a website on what the item costs is a big deal. Anytime you want reimbursed for something, whether it's a purchase or filing an insurance claim, you need to have a receipt. Koles childish behavior after the fact is why he should be banned from the house.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 4,
                      "content": "This is not even close to the same scenario...if he doesn't believe her, he can look up makeup prices and he'll see it's not all cheap. She shouldn't need to provide specific receipts for HER stuff that HE messed with, just because he's an ignorant douche who decided she must be lying.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "Or Kole can google how much makeup costs before he accuses someone of trying to cheat him? Kole is a thief and like all thieves, he thinks he is entitled to other peoples property, regardless of the cost.",
              "id": 68,
              "comments": [
                {
                  "score": 18,
                  "content": "This. He can take ownership and responsibility for his own behaviour and the reparation.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yes, exactly what I was going to reply to the above.  You know, before I called someone a LIAR to their face, I would double-check the thing I'm accusing them of lying about.  Especially if it was something I could pretty easily check by google.  You know, before I made a wild accusation against someone I'd already wronged (by destroying their stuff), and looked like even MORE of an asshole.\n\n(The only problem with the \"Kole can google it\" thing is: he absolutely did not pay attention to the brands of the stuff they were destroying, while they were drunk and destroying it.  And now he's in kind of a bind, because he's not allowed back into the house to look at her make-up supply to see the brands.  So he'd either need the self-awareness to ask Ray to look and tell him what the brands are, so Kole could look it up.  Or, probably more likely, he'd just look at what the cheapest stuff costs on Amazon or Walgreens or something and use that as his basis for how much her make-up \"should\" have cost.)",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "I agree, most men have no idea how much stuff costs in general.  I buy cheap CoverGirl mascara and picked some up once when I was with my husband when we were at Walgreen's for something else. I will never again hear the silence that fell upon the pharmacy when my husband yelled \"TWELVE DOLLARS????\" at the register. If my mascara was a fishing lure he wouldn't have batted an eye at $12 bucks.",
              "id": 71,
              "comments": [
                {
                  "score": 17,
                  "content": "See? That was my point. $12 for mascara is not bad, and it’s DRUGSTORE mascara! Can you imagine his response if he knew how much Lancome, Benefit or Charlotte Tilbury mascara cost? No wonder Kole is having a hard time with the amount he has to repay.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 8,
                      "content": "To be honest -- and I'm not saying OP \\*needed\\* to do this, or \\*should\\* have done this -- but if it was me, I'd be petty enough to make an itemized list of every item that had been destroyed, and its replacement cost.  Just so that they COULD see.  Because I would have realized that they'd have no idea, and because I would have wanted to hammer it home how much they destroyed, monetarily.  And there's nothing quite like a (possibly long) itemized list to show how many things they destroyed and what those things cost.\n\n(I mean... Kole could also have asked his girlfriend? Surely?)",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah I make sure when my Lancome face cream shows up, hubby is not home. Even if I said that it lasts me almost a year, he would pass out from the cost.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Uh I have many many high end tubes of mascara, and that fat orange tube of cover girl lash blast remains my ride or die. It’s the only mascara I can put 4 coats of on and not have it clump. Love",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "$12 isn't even that much for mascara, lol.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "If someone calls me a liar in my own home I don't need to prove to anyone that I am not, they can just leave and not come back.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I disagree - both that they thought about the cost at all before ruining the gear, and that OP should prove anything to them. OP is not responsible for whether they (Kole) think she is lying - they can price check easily enough. \n\nMore in line with you, OP could treat this like an insurance claim: pull together the cost of everything and present it to the insurer (the gents who'll be paying the bill.) However, the analogy breaks down when you consider that insurers want to prevent situations from happening again, not just to pay for them each time. Kole has learned nothing.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Or OP’s boyfriend, who wants to be able to have this AH friend of his over again, could step up and do the research. This isn’t OP’s friendship to salvage, and the person who makes them associate needs to not pass on doing the work here.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Does it matter though, does Kole's stupidity excuse the insults they hurled at the OP in the OP's own home?   \n    \nIf Kole didn't believe the cost, they had plenty of time to educate themselves, talk to their girlfriend, etc, they refused to do that for themselves, so why would it be the OP's responsibility.  Hell, if it was such a big deal, Ray could have educated Kole.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Kole has access to Google, I'm assuming. I would send him nothing - he's not my friend and he is the one trying to get access to MY house. He can do his own googling.",
              "id": 81,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "The thing is she did lift the ban, not her fault he went and upgraded immediately to the lifetime package",
          "id": 82,
          "comments": [
            {
              "score": 8,
              "content": "It wasn’t even a ban, it was the “respect me in my own home package”",
              "id": 83,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2410,
      "content": "NTA. He's not banned for failing to pay anymore. You didn't go back on your word. He's now banned for being an AH to you - fake apologizing and accusing you of exploiting him. He's now willing to apologize for real, nitty because he was wrong, but as payment for a product he wants (your house). Yes, it would be easier to let this go. But then you send the signal that the way he treated you was acceptable. Unless it was, you're right to hold out. \n\nI think you should be clearer about the ban. It's not because of the makeup thing. It's because he non-apologized like an asshole and accused you of robbing him. A real apology would be going makeup shopping with you with his eyes and wallet open and mouth shut. What you're demanding is the least he can do. NTA",
      "id": 84,
      "comments": [
        {
          "score": 355,
          "content": "[removed]",
          "id": 85,
          "comments": [
            {
              "score": 198,
              "content": "I think there's a reason Kole did the non apology when bf wasn't home.",
              "id": 86,
              "comments": [
                {
                  "score": 31,
                  "content": "Yeah, I think Kole knew Op's bf would've laid into him if he did that while he was there. Mainly because the dude has his gf's back immediately and didn't question why he's not allowed in the house anymore. He knows his friend is a piece of work.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It really fries my bacon that they are/were trying to blame her for their get togethers being shut down. Sorry boys, it was your inability to respect other people's property that got your fun night revoked!",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "She never mentions anyone being her BF",
              "id": 89,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 90,
          "content": "This is the point. I would recommend being very clear about the reason why you are treating Kole differently. Also, share info about the cost of what they destroyed to refute Kole’s accusations. \n\nNTA",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Yeah, plus, OP isn't running a hotel or bar. This is her home. She's not making business contracts with Kole and then reneging on them, she's simply stating which people she is comfortable having in what should be her personal safe space. \n\nIf Kole wants to be one of those people, then he needs to stop being such a douche.\n\nEspecially since, by the sound of it, OP is normally incredibly lax about that sort of thing. Like, her standards are literally just \"don't steal from me and don't openly accuse me of scamming you when asked to pay me back\"— that's a level of good manners in somebody else's home that small *children* are expected to have already mastered.\n\nNTA. Stick to your guns, OP.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1135,
      "content": "Sure, you let him off the hook for using your make-up once he paid for it. But he hasn't \"paid\" or apologized for his rudeness in calling you a liar, insulting your makeup, and the manner in which he paid the money you asked. That debt is still due. Dude needs to have some respect. NTA",
      "id": 92,
      "comments": [
        {
          "score": 755,
          "content": "Notice how this man also waited until ops husband wasn't home to act like this to her",
          "id": 93,
          "comments": [
            {
              "score": 228,
              "content": "Yup. They knew they'd catch a case with the husband. With Husband out of the house they could spin any lie that they want.",
              "id": 94,
              "comments": [
                {
                  "score": 57,
                  "content": "Wow you're right, he totally did.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "they’re not married",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "There is no husband. I'm confused",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "Great catch.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Yeah he 100% waited for them to be alone. \n\nAlso, you wanna bet it was actually Kole's idea to play with make-up like 5 years old tried their mom's make-up but way worse. Because everyone seems to be responsible and only him that the make-up thing is stupid, therefore he feel justified to ruin it.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "they’re not married",
              "id": 100,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 670,
      "content": "NTA\n\nYou didn't go back on your word. You were willing to allow him back to the house once he paid for the items he damaged \n\nThen he called you a liar to your face. In your own home. So now he's banned for being a raging asshole. If someone treated me like that I'd ban him from my home too.",
      "id": 101,
      "comments": [
        {
          "score": 55,
          "content": "And my life.",
          "id": 102,
          "comments": [
            {
              "score": 0,
              "content": "And my ax.",
              "id": 103,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "And my ax.",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "And my ax.",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 33,
          "content": "Exactly, she didn't go back on her word, he just got himself banned for the next offense.\n\nI guess the boyfriend is feeling pressured by his friend to get OP to allow Kole back in, or he doesn't think Kole's shitty attitude is that back because he is used to it, but his \"arguably you are worse\" statement is something that shows why he's friends with someone like Kole",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I think it’s worth pointing out that Kole came over when she was by herself, without her boyfriend around, so that he could be a turd blossom without anyone else there to call him out on it. He knew it would make her bf mad, so not only is he disrespectful, he’s also a coward too because he doubled down when no one else was there to back her up.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 541,
      "content": "NTA\n\n>Two weeks pass and Kole comes by which is a little strange because Ray is out. I let him in and he walks in the living room and tosses a pile of crumpled small bills on the couch. \n\nAlso the fact that he paid you back by tossing money on the couch is rude, he's a total AH. That sort of jerk is better off out of your house and your BF's life.",
      "id": 108,
      "comments": [
        {
          "score": 105,
          "content": "True. I wonder if OP told her SO about this incident. Why would Ray keep hanging around that jerky?",
          "id": 109,
          "comments": [
            {
              "score": 95,
              "content": "Cause he's not jerky to HIM.",
              "id": 110,
              "comments": [
                {
                  "score": 40,
                  "content": "I consider an insult to my SO is an insult to me. How would peoplw hope to share their life with someone who doesn't share their pain/burden?",
                  "id": 111,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Real or perceived lack of alternatives?",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "They've been friends 20 years.\n\nWhen you've known someone that long you're willing to accept they're an ass to a point, especially if it means they're gonna be there any time you see your friends.\n\nI don't know how hard of a stance he took, but it says he has her back indefinitely.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Guaranteed he practiced how he would do that on the way over. \n\nBecause he was making a statement, and OP was *supposed* to fall at his feet and beg forgiveness. But she ruined it by having a spine. \n\nGod, it was supposed to be epic!",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 374,
      "content": "NTA. Kole is the one ruining the situation, not you. These guys should have been grateful and respectful that they had a spot where they could be loud and stupid. All Kole has to do is sincerely apologize but he won’t because he doesn’t think he’s wrong. He think he’s entitled to trash your personal items. That would be more than enough for me to stop their hangouts. \n\n>\tArguably you are worse off than him. \n\nThis is a load of crap. The girlfriend’s just mad because now she has to deal with her drunk boyfriend at her own home.",
      "id": 115,
      "comments": [
        {
          "score": 104,
          "content": "Yes, let’s take a moment to feel sorry for the girlfriends who are no longer getting regular breaks from their loutish boyfriends",
          "id": 116,
          "comments": [
            {
              "score": 52,
              "content": "That gf is also AH",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Yeah that text was hilarious. \"I hate dealing with my own obnoxious boyfriend so can you sack up and deal with him please?\"\n\nI'm fascinated by the hints that this gang are so fucking annoying that nobody else wants them around and they're a disturbance to the point of police being called. Perhaps as a group they could try being normal for an evening.",
          "id": 118,
          "comments": [
            {
              "score": 36,
              "content": "It kills me how much OP is being taken for granted, because she's clearly a fucking saint. \n\nEven accounting for her not being sensitive to noise and the bf being willing to handle all the cleaning up, she's still putting up with three rowdy and frequently drunken guys (who it doesn't sound like she's personally close friends with) staying in her home every weekend. I can't believe that that's never annoying or inconvenient.\n\nAnd the *only* place she draws the line is \"if you deliberately raid my belongings and they end up getting destroyed, then you have to pay me back without being a complete asshole about it\". The bar is so fucking low and Kole is slithering under it like Flat Stanley.",
              "id": 119,
              "comments": [
                {
                  "score": 3,
                  "content": "u/Cheeseanonioncrisps,\n\nWELL SAID! Flat Stanley FTW!",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "\"Come on OP, stop trying to make a point, they’ve all been friends for nearly twenty years’\"\n\n20 years of chaos jfc.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 188,
      "content": "NTA. There are several issues here. Ray and his friends thought is was ok to go into your private things and use them without permission. That’s a huge violation of privacy and that alone would have been grounds to end their get togethers at the house. Instead, you gave them the chance to pay for the damages and apologize for their behavior. \n\nThen, Kole decided to go back on HIS word and refuse to pay. I’m guessing the only reason he decided to pay you back was because his friends and girlfriend pressured him. He proceeded to pay you back in the most disrespectful way possible AND accused you of lying instead of apologizing for his actions. \n\nBottom line, Kole is a shitty, childish person who does not deserve entry to your house and if that causes Ray to lose him as a friend, then that may be for the best anyway. I’m willing to bet this isn’t the first time his behavior has screwed things up for them and it’s time they realize he’s a toxic jerk.",
      "id": 122,
      "comments": [
        {
          "score": 106,
          "content": "\\^This\n\nHe is not apologising, he is trying to pay the entry fee to his favourite club and made the mistake of insulting the bouncer....\n\nAlso is GF is sour, because now she has do deal with his whining and BS more",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 178,
      "content": "NTA\n\nYou haven't gone back on your word as Kole as not fulfilled his part of the deal. \n\nYou requested that Kole apologises and pays for what he destroyed.\n\nAn apology is not just saying the words sorry. Its meaning them, which he clearly did not as he continued being a d\\*ck after and was being rude.",
      "id": 124,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 120,
      "content": "It's your house your not required to look after your bfs kids just because it's easier on Thier gfs. You did hold up your end let him in and he paid then he decided to be a child and try to argue with you and dug himself into another hole one that doesn't have a magic pay me and all it well stipulations. NTA actions have consequences this so just the first time he doesn't like that he can't fix the shit mess he made",
      "id": 125,
      "comments": [
        {
          "score": 5,
          "content": "Kids? Freudian slip there?",
          "id": 126,
          "comments": [
            {
              "score": 30,
              "content": "I'm betting it was intentional",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -2,
              "content": "They act like kids sorry that's hard for  you to understand",
              "id": 128,
              "comments": [
                {
                  "score": 4,
                  "content": "I took it as the person who replied to you thinking it was funny because they definitely act like children.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "It wasn’t hard for me to understand. I assumed you wrote kids as a typo, and joked about it being a Freudian slip *because they act like kids*.",
                  "id": 130,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "im confused when exactly did you say all will be forgiven if everybody pays for what they damaged?? Like that shouldnt have even been in question to begin with - you break it you buy it. Thats just basic adult responsibility. \n\nThis man is being straight up disrespectful and hostile to you - in your own damn house!! - and all everybody seems to be worried about is the disruption the their schedules. Theres no amount of money in the world that would get me in the same room as him ever again after that bs. \n\nWhy is your husband not pissed at his friend?? Thats what im really concerned about. \n\nNTA",
      "id": 131,
      "comments": [],
      "relation": "Support"
    }
  ]
}