{
  "post content": "I’m a 19 year old F with six older siblings. My parents spent most of my childhood spending money they didn’t have on my siblings, so by the time I hit my teenage years, I realized I was probably going to have to fend for myself financially when I turn 18. I started babysitting and doing odd jobs around my neighborhood when I was 14, and eventually got part-time jobs during the school year. \n\n\nBy the time I was 16, I was working three jobs in the summer and two in addition to school. When my parents told me they couldn’t pay for college, I’d already earned enough (along with scholarships) to be able to put myself through college and have plenty left over. I’ve continued to work during the school year, and have been able to make money during quarantine by tutoring online. \n\n\nThe issue began a few months ago, when my eldest sister (29F) got married. My parents spent 30 grand on her wedding, taking out a second mortgage to do so. To make matters worse, my dad was furloughed 6 days after the wedding. They’d effectively dug themselves into a hole they couldn’t get out of. \n\n\nTwo weeks ago, my mom texted me for the first time since the wedding. She didn’t say hi, ask how I was, or make any small talk. She just said “Your dad and I need a favor. When can we call you?” \n\n\nI’d expected this. None of my elder siblings are doing well financially, and they’ve exhausted all other loan options, both from family and the bank. I figured they would text me, ask me to loan them a few thousand, and promise to pay it back when they could figure things out. I was absolutely willing to pitch in a few thousand, and had even considered giving them some of my tutoring jobs so they could make some extra cash. \n\n\nI was not, however, expecting them to demand I GIVE them all the money (close to $40,000) I’d made from the ages of 14-18. \n\n\nThe exact statement my mom had made was “You made that money under our roof. We were the ones who allowed you to work, so you only have it because of us anyway...We bought you food and clothes for 18 years. That money is only a fraction of what you owe us...” and so on.\n\n\nI said that food, clothes, and shelter were the very minimum, it’s what they signed up for when they chose to become parents, I didn’t ask for any of it, etc. They responded by telling me that if it wasn’t for them, I wouldn’t have the life I have today. I said they were being ridiculous, and hung up. \n\n\nSince that day, both (along with two of my siblings) have continuously hounded me about giving them what is “rightfully theirs.” My siblings, who have never been asked to give them money, are still professing that it’s my job as their kid to take care of them. I told them they wouldn’t see a cent of my hard-earned money, and have no right to make such a request.\n\n\nI’m torn. I feel awful for refusing to help them out, but on the other hand, this was their fault. I feel I shouldn’t be responsible for fixing their mess. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 24490,
      "content": "NTA. Their poor financial choices are not your fault or problem, speaking purely based on you being a separate person. \n\nThe fact that they EXPECT this from their own CHILD is downright disgusting. I’m so sorry that you’re being put through this",
      "id": 2,
      "comments": [
        {
          "score": 9123,
          "content": "\"Their poor financial choices are not your fault or problem\"\n\nWho the hell takes out a second mortgage just to finance a wedding?! They dig themselves into to debt for one child and expect the only one that seems to have made something of themselves to dig them out? NTA Just cut the out completely.",
          "id": 3,
          "comments": [
            {
              "score": 3669,
              "content": "And cut out any family agreeing with them too. You were fiscally responsible, OP. If you give them money, they'll waste it. NTA",
              "id": 4,
              "comments": [
                {
                  "score": 1532,
                  "content": "Exactly this, NTA.\n\nThey have proven that they are not smart when it comes to money, and the fact that you have fended for yourself most of your life they didn’t help you money wise, so why help them. DEMANDING the money I think is the most irritating, and some of your siblings pressuring you to give them money. If they want their parents to have money so bad, why don’t they give them money themselves instead of asking you.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 845,
                      "content": "Right!   If anyone owes them, it’s the sibling who just got married.  \nMaybe OP can help her parents out, but it can’t be all on her.  The unfair entitlement here is mind boggling!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 731,
                  "content": "The reasons the other siblings are trying to get her to pay their parents money is so the door is open for them to also ask her for money.  Absolutely NTA",
                  "id": 7,
                  "comments": [
                    {
                      "score": 458,
                      "content": "And also so that they (the siblings) won’t be asked to help with that 40k\n\nFor the siblings that don’t think this is a problem, they need to pony up the money themselves, otherwise they need to sit down and shut up.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 166,
                      "content": ">The reasons the other siblings are trying to get her to pay their parents money is so the door is open for them to also ask her for money.  \n\nThis, right here!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This 💯!!!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "NTA and I think this is EXACTLY what they’re doing. If OP gives their parents a single penny, the siblings will undoubtedly begin to make their own demands, because OP is already more financially responsible than they are, so as OP earns more money, siblings bad with money will turn up and make similar demands due to not being as good with money as op.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Make sure that before you completely cut them off that you have all your ducks in a row for them not to do something stupid. You hear far too often of crappy parents who happen to still have their kids Social Security Card going out and taking out a 50k+ loan in their kids name. Make sure any legal docs that they could potentially steal your identity are stripped of them as well because if they are really this entitled, they may just take matters into their own hands",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "They've ALREADY wasted it. And now they're about to lose their double-mortgaged house.  But your main point is legit - they probably would just fritter it away some other way and be in the same mess all over again in six months. Assuming OP was going to give in. Which you are not, right, OP?",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1103,
              "content": "OP hasn't even really 'made it' yet, she's a 19 year old college student. If anything it would be up to the older siblings to support the parents.\n\nIt's not like she has a 100k/year job or something.",
              "id": 14,
              "comments": [
                {
                  "score": 430,
                  "content": "These people are asking for 40 thousand to support bad financial choices. Even a 100k per year job isn't justification to finance family member's poor decision making.\n\nFor a family to have an internal agreement for children to support the parents as they grow old is one thing, but for parents to hit up their children (or anyone else for that matter) when their own bad choices put them in dire straits is a completely different thing altogether.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 368,
                      "content": "I agree, but it's extra ridiculous to demand it from a 19 year old who's still going to school and needs every dollar herself.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah but culturally agreements to help parents in old age come with significant financial support. Often kids are gifted hundreds of thousands of dollars to buy a bigger nicer house to house and take care of the parents into old age. \n\nSo agreements to help parents in old age come with some give and take not just take. So even if an agreement was made it doesn't make sense in this scenario.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 264,
                  "content": "Forgot that part. All the more reason for her to not give up that money.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 86,
                  "content": "And that money is for college. It has a designated purpose, it’s not just extra money she was going to use for a fancy car or vacation or something.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "Yes. OP, you should be proud of yourself for being so financially independent!\n\nYou do not owe your parents money for being successful and clever. Do not pay your parents this money, and ignore your siblings who are asking their youngest sibling to pay for their 30K wedding (That's what it is when it comes down to it). \n\nIf you still feel bad about not helping your parents, you can offer them the previous idea you had about loaning them a couple thousand (with the expectation they most likely won't pay you back) and tell them they are lucky that you're willing to offer them that. If they don't like it, they can get nothing. That way, the onus falls on them. You are offering to help, and it's their decision to let go of their pride and ludicrous ideas. \n\nKeep truckin', OP.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 33,
                      "content": "This. But consider paying the $ directly to mortgage lender or otherwise paying the bill directly instead of just giving them $",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "She really shouldn't give them any money at this point. All they will learn from her handing over money is to keep demanding more. They would take the couple of thousand, not say thank you but would complain that it was only a couple of thousand and demand the rest of her money. They won't be grateful and they will be rude. This is a situation where the best answer is no money ever from her to the parents and siblings. They are all adults who are allowed to work three jobs and go to school just like the OP. They don't do that or if they do they still spend far more than they earn. They will never be interested in living on what they earn. She needs to say no to them.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "And the parents have just burned their bridges there. When OP IS making $100K a year (or less, but in a job she loves and is successful at), her parents are going to come at her again. This never stops. The Bank of OP is closed, period.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I wish I would have done this at 19. Said no, I am 50 now and have a mother let's say that I entitled. When I was 12 I would work by cleaning horse stalls, I wanted to ride and a make a little bit of money, I got paid 30 bucks a week, it was really child labor but I digress, I saved up around 600.  Guess who took it and I've been paying ever since. OP make sure they cannot get access to that money. Change banks or whatever you need to do. NTA.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yes. I advise OP to tell parents that money she considers already spent on college.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I KNOW. I mean, even if she were ten years older and had that money just lying around because she's so awesome and hardworking, there is still no OBLIGATION to give any of that money away!",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "Right! Im planning for a wedding next June and taking out a mortgage for a wedding is the single stupidest thing I’ve ever heard of",
              "id": 27,
              "comments": [
                {
                  "score": 188,
                  "content": "And why aren't they asking the couple that got married to pay them back.  That at least would make some sense.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 66,
                      "content": "That was my first thought, why isn’t that sibling paying back for the wedding?",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "It really is.  If you can't afford a big wedding then don't have one, why is that so hard for people to understand.  I'd have been happy going to the courthouse and getting it all over with without any family there",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 205,
              "content": "[deleted]",
              "id": 31,
              "comments": [
                {
                  "score": 8,
                  "content": "People who are more interested in putting on a show that makes them look better off than they really are while they sneakily scuttle back to try to pry their child's money away to cover their asses. Phonies.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "Sounds like they should ask the one who got married to support them.",
              "id": 33,
              "comments": [
                {
                  "score": 79,
                  "content": "Right? Parents pay 30k for wedding and ask OP for 40k. Essentially OP is paying for their siblings wedding, and then some.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I would be hugely embarrassed to have my younger siblings paying anything more than a pizza for me.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "this.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 129,
              "content": "I know of a couple who took out a second mortgage to fund their son’s country club wedding. They lost their house to foreclosure several years later.\n\nNTA, OP, and please don’t give them any money or they’ll keep coming back for more, even if you give them everything you have saved to date.\n\nEdited for a spelling error",
              "id": 37,
              "comments": [
                {
                  "score": 98,
                  "content": "The whole wedding industry is just a money draining scourge upon society that empties wealth from young couples that could be better spend in so many other ways just to satisfy a fantasy passed down to young girls.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Is not just young girls, there is often huge family pressure, and sense of familual duty for everyone. Specially amongst some ethnic groups. And in my experience grooms are just as likely to want to throw a wedding to please their family or to bring everyone together. Ops parents are absolutely stupid though.",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "And they won't thank OP for it.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "I knew someone in law school who took out an extra $20k in private student loans to pay for her wedding. I thought that was batsh*t stupid.",
              "id": 41,
              "comments": [
                {
                  "score": 81,
                  "content": "I know it's super mean but when I hear about people doing dumb stuff like that, I wait to hear about the divorce.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "Do they even comprehend the interest rate on law school loans?",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Wow. I used some private-loan money in law school for not strictly school-related stuff, but just general life expenses during that time--not a wedding!",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "As someone who is currently living on student loans to finish up grad school right now, that blows my mind. I'm already anxious just taking what I need to house myself, I can't imagine adding something that dumb.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "About 10 yrs ago a girl i worked beside took out a £20k loan for a dream wedding and at that time a lot of UK loans had a 6 month period before you started repaments. She was split up and trying for a divorce before the first payment was made",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 121,
              "content": "And let it be known that the only reason this child, the youngest child, has made something of themselves is because they have been treated as nothing and forgotten about. All the others have been doted on their entire lives, had thousands upon thousands of dollars thrown at them for everything by their parents, and the OP has just been ignored and treated like they were nothing, so they had no choice but to do this in order to have *ANY* sort of future at all. \n\nOP, DO NOT give them any kind of money at all. They didn't appreciate you in any way, and don't appreciate any of the hard work you have done to create a good future for yourself. They are trying to destroy your future now due to their poor financial planning, and that is not your fault or your responsibility. They made the ridiculous and highly irresponsible choice to finance a $30k wedding by taking out a second mortgage when they had absolutely no money at all, and that is their fault and only their fault.\n\nDo not let your family ruin your future.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 115,
              "content": "My parents took out a second mortgage for my sisters quarter-of-a-million-dollar wedding. When it got time for me to be married they only spent about $3,000.",
              "id": 48,
              "comments": [
                {
                  "score": 79,
                  "content": "...there are houses in my state that are worth less than that wedding.... Wtf????!??!?",
                  "id": 49,
                  "comments": [
                    {
                      "score": 60,
                      "content": "Yeah, I’m currently living in a house that was bought for only $15,000. My parents are just stupid.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 76,
                  "content": "No offense but your sister and parents aren't the brightest crayons in the box are they?  250k for a wedding?  Why? What's the point in wasting so much money for one day?",
                  "id": 51,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Yeah they definitely aren’t. My parents have always sucked with finances and they had 11 kids. They are both about 60 years old and still don’t understand that you don’t have to pay interest on a credit card if you pay it off monthly. My sister is just the favorite girl and always gets what she wants.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": ".... do you have some pics of that wedding? Ooof.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 63,
              "content": "To answer your question, I used to work at a bank and I can tell you that at least part of the problem is how it's offerred up as a completely fine and viable option by banks. Our tvs would constantly run ads and one of them was a $20k wedding loan ad with all of these nice pictures of a perfect day.\n\nSo you fool some starstruck couples into taking out the loan, maybe their parents help out. Now their friends ask them how much they spent on the wedding, or how it was financed (I know, for some people this would never be asked. When you work at a bank you talk about money more openly I suppose, more people really should). And they tell them. And through that, it becomes normalized.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2033,
          "content": "Piggybacking on the top comment to say- make sure all accounts holding money do not have a parents name on them. Lots of 20 year olds still have their parents on their accounts from when they were younger and it was legally required, who just never changed things over. With the level of entitlement shown, (30k for a wedding, but asking you for 40k for living as a child?!) I wouldnt put it past them to just attempt to take it directly. And congratulations on seeing your parents mistakes and working for financial freedom.",
          "id": 55,
          "comments": [
            {
              "score": 896,
              "content": "Also freeze your credit and make sure you have all your important documents so they cannot forge your signature on a loan.",
              "id": 56,
              "comments": [
                {
                  "score": 470,
                  "content": "Do THIS yesterday if possible. They already feel like you wronged them, a little bank fraud will be no biggie.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 103,
                      "content": "I can't agree more. \nOP's parents sound like the type.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "Exactly!! Are we all collectively feelings anxious for OP’s financial security now??",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Pinging u/gymnerd813 just to make sure you see the above. Your parents probably know your SSN, date of birth, previous addresses, model of first car, name of best friend from 2nd grade, etc. everything they’d need to open lines of credit or loans in your name. If they feel that you owe them money, they may try to just take it by getting a loan in your name.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Definitely do this! A friend of mine got his identity stolen for a loan recently.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "Also OP should set up any monitoring systems their bank has so if the parents try to use your identity you will get alerted. There are also come credit monitoring services that are reasonable so if someone tries to use a credit check in your name you will be alerted.",
              "id": 62,
              "comments": [
                {
                  "score": 45,
                  "content": "That’s a very good idea. Considering her parents feel entitled to her money and know her social security number, OP would be very smart to monitor her credit. As a precaution, she could even explore freezing her credit.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "This is super important, I hope the OP sees this. Please make sure your irresponsible and unfair parents cannot get to your money!",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "Change banks entirely, too. \n\nOP NTA,",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "u/gymnerd813 please read this",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "My oldest is 18. I told her it’s up to her if she wants me to stay on her bank account. Though it would make it easier to transfer money to her if she needs any while in college. I would never ever take any of hers though",
              "id": 67,
              "comments": [
                {
                  "score": 27,
                  "content": "What I did with my parents was have two bank accounts that were linked. I gave my parents the card for one of them and we used that account purely for transfers. This is also an option for those who want to protect their money but still make it easy to transfer money.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Honestly, if you are in the US, there are so many modern ways to transfer money that the joint account solution is really unnecessary for that.  There are risks to the account too.  It ties you together at the institution, and all parties are liable for any fees/overdraft/etc.\n\nVirtually all major banks (and most small ones / credit unions) support Zelle to send anywhere between a few dollars to a few thousand dollars between any two persons, regardless of institution.\n\nEvery bank supports Fedwire wire transfers, for any conceivable amount, although most change fees.  If you are at the same institution, many allow transfers between accounts that are faster than Fedwire (because they don't have the clearance cutoff) or cheaper.  Even then, it's unlikely you'll be sending large amounts, instantly, often.  If you plan for it, you can just send a check which is still easy and free.\n\nThese are just the methods supported by the banks directly.  There's always third party services and apps as well.  PayPal, Google wallet, etc.\n\nThis is less about u/flwvoh specifically and more for anyone who happens to be seeing the comment about using a joint account for this purpose.",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "With the advent of Cashapp, Venmo, PayPal and Zelle, this isn't even necessary anymore.  What are we, *cavemen*? :)\n\nSource: parent of older kids, don't know their bank account numbers, don't *want* to know their bank account numbers.",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "If it wasn’t already mentioned, I would pretend like you’re thinking about it (do not piss them off) while you collect EVERYTHING you can (social security info, birth certificate, any financial documents of yours, any other important records) and remove their names from\neverything..... because when you do finally (and rightfully) say fuck off, they may hold those things hostage or use them to be vindictive. You were smart enough to see their mistakes at 14, don’t let them make you second guess yourself after 5 years of amazing work!",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Piggybacking this to say, OP might want to check the subreddit r/raisedbynarcissists since this is sounding shockingly familiar.",
              "id": 72,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 929,
          "content": "I can't understand how they think that their oldest daughter deserves 30k for a party, but their youngest owes them 40k for growing up.",
          "id": 73,
          "comments": [
            {
              "score": 226,
              "content": "Right? Who the hell thought THAT was a great idea? They are all taking this golden-child/scapegoat-child routine to extremes right here. Trying to force OP to hand over earned college fund because they are fiscally inept? HARD pass!",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "Came on here to say exactly that! 30k is not necessary for a wedding, especially if you can’t afford it. \n\nIt’s not only unfair that OP’s siblings got for free what she has had to work for for 5 years to get, but now they expect her to just hand it over? Something that she worked that hard for and probably missed out on a chunk of social life when she was younger for? Screw. Them.\n\nOP - not only are you NTA but you’ve demonstrated maturity beyond your years. I’m sure you’ve got a bright and exciting future to look forward to!",
              "id": 75,
              "comments": [
                {
                  "score": 5,
                  "content": "My wedding was very nice and only cost about 10k. Maybe it's because we grew up middle class but I can't imagine paying more for one day than I did for a year of college.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Mine was fairly expensive tbh. I had some stuff I didn’t technically need, but I wanted it so I saved for it! I’ve been to some beautiful weddings that were done on extremely tight budgets. Plus if the company is good, the material stuff doesn’t really matter anyway!",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "Crabs in a pot they are doing the best let’s drag them down to our level",
              "id": 78,
              "comments": [
                {
                  "score": 37,
                  "content": "At least the crabs want to get out of the pot. OP's parents are digging a hole through the bottom of it.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 35,
                      "content": "No, dig up!\n\nI'd bet 40,000 that even if, purely hypothetically of course, that if OP gave them the money theyd prpbably blow it on something stupid instead of paying the debt or anything.",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "OP should announce a wedding. Then go to OP's parents and say they want the same $30k.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It's the Golden Child/Scapegoat mentality OP's parents have.  The elder children are Golden Children who can do no wrong and are held on a pedestal.  OP is the Scapegoat who gets blamed for everything, ignored, and abused.\n\nOP, do not ever give your family a penny. If you do, they will always have their hand out.  I paid dearly for financially bailing out my parents at your age.  Don't make my mistake.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Charitably, it's a \"have vs have not\" mentality. The oldest daughter didn't have the money for her wedding, so they helped her. Their youngest *does* have money, so she owes it to the rest of the family to help out.\n\nThis mentality pops up especially in impoverished areas. Ostensibly it's about helping everyone out and can be very helpful, but when it's being used on luxuries instead of necessities and packaged with the entitlement it's a bad thing. I.E. if they had spent $30k on legal fees for older sister, then asked OP for help after dad got furloughed, it'd be one thing, but spending that much on a wedding then *demanding* money is something else entirely.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "As an only child favoritism like this is unfathomable to me. Why have multiple if you won’t treat them all the same? I hate parents like this.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I wish I had an award to give you for this comment.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "“They responded by telling me that if it wasn’t for them, I wouldn’t have the life I have today”\n\nOP, you have the life you have *despite* them. Through all their poor planning, you figured out what you needed to do at a young age to get what you want out of life, and you put the work in. Everything you have, you have because of YOU. It may not mean much coming from a stranger on the internet, but I’m proud of you.\n\nNTA, the entitlement your parents have is ridiculous. Nothing of yours is “rightfully theirs”. Maybe they should have done some thinking before taking out a second mortgage for wedding. They dug this hole themselves.\n\nedit: spelling",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "Exactly. Children owe their parents nothing. Parents who have that expectation are using it as a tool of control.",
          "id": 87,
          "comments": [
            {
              "score": 3,
              "content": "I was raised that me and my brother owe one thing to our parents, and that's not being dependent on them. In return, they will do the same with us after we have finished our education (whatever we wanted) and found jobs.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "They want ALL the money, too. Hell no. Tell them to pound sand, OP. NTA.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "I'm gonna agree with the parents on one thing, is because of them OP has any money now. Because as a clever person, she saw what was around and worked hard for her future, she saw what she didn't want from life. But it doesn't mean they are entitled to any money.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Agreed \n\nNTA- not only telling their child she owes them, there telling their youngest child, not her siblings but the baby of the family who made her own way through life working since the age of 14. \nOP your parents decided to payout $30k for your sisters wedding in no way shape or forum should that be your responsibility. None\n\nNTA",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Yes, NTA giving OP clothes, shelter and food and so on is their responsibility as parents, not a service they provided them that OP has to pay for now. OP's siblings are disgusting as well and hypocrites, because following that logic they have to help just as much as OP does. OP shouldn't give them ANY money. \n\nAnd OP, please make sure they can't access it in some way through identity theft or sth similar. \n\nAlso make sure they don't take out a loan in your name! They might do this figuring that you could pay it back with the money they think they have a right to.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "They don't expect this from any of the other 6 kids. They only expect it from OP. And the fact that they say they're owed the money means they won't be grateful if OP gives it to them nor ever pay OP back.",
          "id": 93,
          "comments": [
            {
              "score": 18,
              "content": "Nope. They will insult, accuse of greed and lack of family feeling, demand more and more. These are all lies, of course.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6274,
      "content": "Okay first of even if they HAD gone above and beyond for you in your childhood and also paid your way through college you wouldn’t be TA for refusing to give them money. \n\nParents caring for their kids financially is what parents do... it’s not something that needs to be made up for once you’ve grown. If that were the case then it seems to me your sibling have a lot of paying back to do. \n\nYou’re NTA and don’t let them hound you until you give in because they’ll end up milking you dry and putting you in the same situation and them and your siblings.",
      "id": 95,
      "comments": [
        {
          "score": 1450,
          "content": "NTA, I’m trying to figure out why they put themselves in a hole because of a wedding. And then how was it your responsibility to bail them out.",
          "id": 96,
          "comments": [
            {
              "score": 964,
              "content": "Imagine the kind of shitty parents you need to be to take out a second mortgage on your house for one kid, but demand the other pay you back for being born/raised.",
              "id": 97,
              "comments": [
                {
                  "score": 308,
                  "content": "They probably noticed how OP works a lot and thought they could take a second mortgage and pay it off by getting money from OP because they are 'entitled' to it. After they've spent money recklessly on all of their children but OP. I'm so sorry your parents treat you that way and that you have to deal with this, OP, but you should definitely cut them off. I'm sorry but based on what you've said the way they treat you is unacceptable and disgusting. NTA.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 75,
                      "content": "[deleted]",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "OP said that her dad got furloughed. I'm guessing they probably had a high earning job and figured they could pay off the second mortgage easily enough, so they went with it. Then COVID-19 hit and that manageable debt became an anchor dragging them under.\n\nFor the record, this is why debt is very risky. During the good times it seems safe and like a good way to get ahead, but when times turn bad it goes from minor issue to massive liability *very* quickly. Never let your debts outweigh your assets if you can help it.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "For real! wtf? #ByeFelicia",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This is such an important point! The other kids aren’t expected to pay them back so why are you?",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Especially since op is 19 and her parents told her she wouldn't be getting any assistance with college. And seeing as wedding are usually planned like a year in advanced it's likely they chose to fund the wedding around the same time thy decided not to help op with college.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "They’re essentially asking her to pay for her sister’s wedding and then some.  That would be a big old nope burger smothered in nope sauce from me.",
              "id": 104,
              "comments": [
                {
                  "score": 75,
                  "content": "Right?! If I were OP this would be the *first* thing out of my mouth when they asked for money. \"So you are asking me to pay the bill for older sister's wedding? How about you ask her to pay you back for raising her? That should cover your bills.\"",
                  "id": 105,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Isn’t it funny how the successful monetary or more put together siblings are supposed to support family because we are family?!\n\nIt rewards those who are moochers or no money sense.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "A nope burger with fuckthat sauce on a bitchplease bun.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Yeah, everything else kinda doesn't matter. \n\nEssentially your parents and siblings want you to pay for the siblings wedding.  No.  Just no, no, no.\n\nNTA.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Exactly.  I think if you can't afford to help your kids with college, you shouldn't remortgage your house for a one day celebration.  Such a dumb decision.  They value a one day celebration over the education of their children.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 439,
          "content": "My parents paid for my college, and did expect me to pay them back ( for college, not for existing!), BUT they waited until I'd had a stable job for 6 months after graduating and asked if I felt financially stable enough to start paying them back a small amount every month. And I put that payment on hold for a few months in the middle to pay for a vacation with no judgement.\n\nEven when repayment is expected, what op's parents are doing isn't how family treats family. \n\nThey forced you to build your own boat with no help, shot holes in their boat and are now trying to make you give them yours, op. Don't give in. NTA",
          "id": 110,
          "comments": [
            {
              "score": 112,
              "content": "See, I like this. This is fair. I mean, I wouldn't blame people not paying their parents back and I'm not saying people should when it comes to college, but this is entirely reasonable. It just shows there is a relationship here built on responsibility, respect and caring. Well done hun!",
              "id": 111,
              "comments": [
                {
                  "score": 61,
                  "content": "I can understand parents wanting repayment for uni/college, it's a lot of money. I also think that knowing that I would long term be paying for it made me take my education more seriously than some of my classmates whose schooling was fully paid by parents with no expectations of repayment, while also not having any of the stress of people who needed to work minimum wage jobs through the school year and pay for everything themselves. With 40 hours of class and labs a week, plus homework and readings, I'm glad I was 100% a student during the school year.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 9,
                      "content": "[deleted]",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I had the same experience. I didn’t take out any loans but paid cash for whatever classes I could afford each semester (between 2 and 4 depending on the kind of year I had at work). But there were so many times I heard kids in my classes “oh I don’t give a shit about this class, I just need to get a D or my parents won’t pay for my apartment anymore.” As much as I could’ve used help from my parents, it made me realize that I want more than that attitude from my kids when their time comes.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Did your parents tell you that you had to pay them back before they paid for college?",
              "id": 115,
              "comments": [
                {
                  "score": 85,
                  "content": "Yes, and they also made it clear it wouldn't be immediate from the beginning - steady job, ability to save money and also repay, etc. Also bear in mind I'm in Canada ( university is pricy but a whole different level than the States). There was no surprise, and they told me the amount they wanted repaid upfront, with no limit on duration of repayment.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Yeah this is perfect. Better than owing the government, and it was agreed upon when you started.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "My parents did a similar thing for my sister. He took out what she needed to as long as it didnt incur interest til 6 months after she graduated. She was expected to pay back what she could in that time. When it came due, my parents payed off the lone and she now owes them that amount without gaining intrest.\n\nFor me, I didnt need lone help but I bought a house that needed to be fixed up. It was a great price and I still have a mortgage which is less than renting a 2 bedroom apt. Dad and I are handy (he is a general contractor), they have payed for material and we did the labor to fix things. I am paying them back for material and I am always available to help with any labor he needs.\n\nAs adults, we trade services and help each other. Is it always a fair trade? No, but we are in different points and the help is always given and not demanded. If any of us start to demand things, shit would go down hill fast.",
              "id": 118,
              "comments": [
                {
                  "score": 4,
                  "content": ">As adults, we trade services and help each other\n\nYes! That's exactly it. I'm in a completely different position from my sisters, in terms of education and career, my parents have offered different help to each of us. Equitable, not equal. And never demanded.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "NTA,\nAlso OP, in addition to not giving them money, I’d make sure you have all your important documents with you, and that they don’t have any access to your bank accounts/credit cards. \n\nMost importantly, you should set up free credit monitoring, maybe even freeze it temporarily, because they know your SS#, and could try to take a loan or credit card out in your name. I’ve read horror stories on here of people being ruined financially from family doing things like that. I believe credit karma is free",
          "id": 120,
          "comments": [
            {
              "score": 30,
              "content": "So much this. So much. I know someone whose parent used their grandchild's SS# and completely destroyed the poor kid's credit.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "And OP should make sure their bank accounts are at a completely separate bank from their parents, so their parents can’t talk their way into OP’s accounts.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Also if she gives her parents the money, it likely means she'll at the very least need to take out some student loans or at worst quit school, which would put her on a worse financial track.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I think there's some nuance in your example that certainly doesn't exist in OPs case.  If the parents had gone beyond in childhood and paid for tuition for all 7 kids to go to college, and then due to Covid their business was shutdown (let's say they owned a travel agency), they asked for some money from all 7 kids to float them for a few months, what kind of AH kids wouldn't chip in?\n\nObviously OP is NTA here, but my parents were great parents and did everything they could for me.  If they called me and said they needed money (absent some Nigerian scam due to their age), it would be wired to them before end of business today.  Part of that, I am sure, is because my Dad would rather give up a kidney than ask his kids for money, but I don't believe that kids have no moral obligation to their parents, even though many of us would rather be destitute than ask our kids for anything.",
          "id": 124,
          "comments": [
            {
              "score": 16,
              "content": "But also in your example if the parents had outright demanded money from one particular child they still wouldn’t be TA",
              "id": 125,
              "comments": [
                {
                  "score": 13,
                  "content": "Certainly demanding is wrong, especially asking the youngest to pay for the oldest.  I could see a situation where the parents ask for help from the oldest/most successful.  For example, I make almost 10x what my siblings make due to a combination of luck, circumstance, and hard work.  It would feel ridiculous to me for my parents to ask us all to chip in the same amount, instead of just asking only me for the money.  \n\nWith that said, OPs parents are literally asking the youngest who is not well off to pay for the wedding of the oldest, which is a complete clown move.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Chris Rock has a great bit about being a parent. It goes something like:\n\nParent: \"I take care of my kids\"\n\nChris: \"You're supposed to take care of your kids you dumb motherf\\*\\*\\*er! What are you talking about!?\"\n\n [https://www.youtube.com/watch?v=B0B\\_ekSrsEk](https://www.youtube.com/watch?v=B0B_ekSrsEk)",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3733,
      "content": "Gosh I hate parents who see their kids as a piggy bank\n\nNope NTA and I would block anyone coming at you with any nonsense of \"owing them\". You don't need that kind of energy in your life\n\nYou're right, they chose to have you. Which includes providing for you for at least 18 years, which they clearly didn't even do if you had to start working at 14. \n\n**Their irresponsibility is not your responsibility!**\n\nOh another; don't light yourself on fire to keep others warm. Just because they did it, doesn't mean you should.\n\nI'm sorry you have a r/justnofamily\n\nThe beauty of adulthood is finding people that enrichen your life, and cutting out those who don't. You get to choose your tribe. No one is entitled to being in your life just because you share some dna.",
      "id": 128,
      "comments": [
        {
          "score": 173,
          "content": "Wish I could up vote more than once on this one.",
          "id": 129,
          "comments": [
            {
              "score": 54,
              "content": "Just use all those throwaway accounts you no longer use /s",
              "id": 130,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "I’d throw in r/raisedbynarcissists as well. The sheer entitlement for doing the legal minimum to not go to jail for child neglect reminds me so much of my stepmother\n\nEdit: forgot to vote. Hard NTA",
          "id": 131,
          "comments": [
            {
              "score": 3,
              "content": "Definitely part of that sub, complete BS, NTA",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "\"Their irresponsibility is not your responsibility\" I love this and will probably steal it 😉",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "OP reminds me of Fiona Gallagher tbh",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yep and r/insaneparents",
          "id": 135,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1716,
      "content": "Don’t in any circumstances give them any money.\nYou are not the asshole. You seem like the smartest in the family.\nImagine the audacity to demand money as ‘repayment’ for raising you the last 18 years like that’s not what parents are SUPPOSED TO DO WHEN THEY HAVE A CHILD.\nIf I was in your position I would cut all ties from all family members. \nI think the fact that the first contact they have with you after not seeing them for a while is a request for money which then turned into a demand. That should tell you everything you need to know about these people.",
      "id": 136,
      "comments": [
        {
          "score": 440,
          "content": "I agree with your first sentence completely. OP, even if you can afford to give them 1k, it will NOT stop at 1k. If you think they're hounding you for money now, that's not shit compared to what they'll do after you give them a taste. I received 40k when I turned 18, and had the same problem as you (just not with my immediate family), but i made the wrong choice. Needless to say, when I turned 19 I didn't have any of that 40k. In my mind \"its only a couple hundred\" didnt sound too bad. But once you do it once, they will NOT stop. \n\nAlso, a rule my dad once told me was \"never loan somebody money if you're expecting to get it back\"",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "Not even just what they are supposed to do.  It is what they were legally obligated to do. If you have kids, you have to feed, cloth, house, and provide education for them. It's the law.  You are not loaning the kid the money to exist.  You made them, you have to pay for them as well.",
          "id": 138,
          "comments": [
            {
              "score": 85,
              "content": "Yeah. I'll never understand people who think feeding and clothing their kids is a generous favor. In reality, food, clothing, and shelter are legally *owed* to one's children. It's why your kids get taken from you and you might even be arrested if you don't fulfill that obligation. Nobody gets in legal trouble for refusing to give out generous favors. \n\nPeople can debate all day what parents should owe or do not owe their adult children, but they legally owe their minor children all the necessities of survival (and morally owe their minor children emotional caretaking).",
              "id": 139,
              "comments": [
                {
                  "score": 5,
                  "content": "My oldest occasionally wants to do into her allowance to buy a shirt, or some candy treat.\n\nI always buy it for her instead.\n\nI never want her to sirens money on the things I should be providing. Candies, Treats, food, clothes, that's on me. Use that money for her guitar, or a video game, something superfluous, or better yet save it. But never on the things I should be providing.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I think the parents mentality is that the bare minimum is still less than their kids got. Like if you buy me super nice shoes every year and we go out to eat and eat really fancy foods that's above the minimum, the minimum would be one pair of pretty bad shoes for 5 years and pb and j most nights with occasional meat to sustain. Technically getting food and clothes and meeting the requirements, the fact that they provided the luxury of going out and getting expensive shoes all the time is why they feel like they can demand.\n\nIT'S WRONG THESE PARENTS ARE WRONG",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Not to mention, where are the other kids getting their 40k they owe mom and dad? oh they don't? strange.",
          "id": 142,
          "comments": [
            {
              "score": 30,
              "content": "This part really blows my mind. They are all ganging up on the youngest. I'm the youngest in a big family and they all go out of their way to protect me even though we're all adults. They would never ask for my money.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This is what I was looking for! OP do NOT give them a PENNY - you will never ever see it again. It sounds like they did what parents should do for you and even if they want above and beyond you still dont owe them anything they're your PARENTS for crying out loud",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1386,
      "content": "NTA. EVER. WTF. Do not give them a DIME. \n\nYou worked your ASS off because they couldn't/wouldn't manage their finances and children properly. They were legally obligated to feed and clothe you for eighteen years because you were a MINOR. You earned money in preparation for being neglected and forgotten once they were no longer obligated to look after you. They wasted money on your sister for no damn reason (yes, I know, wedding... a mortgage for a wedding is no damn reason. Saying this as a female who would love to be married one day. I would never put my parents or even myself into financial hardship for a fancy wedding) and they dug themselves into that hole. Please tell me you're living somewhere on your own and not in any way shape or form ever going to be required to live with them again.",
      "id": 145,
      "comments": [
        {
          "score": 1668,
          "content": "I live alone in my own apartment a few cities away from them. They also don’t have access to any of my finances or bank accounts. Thanks for the support!",
          "id": 146,
          "comments": [
            {
              "score": 428,
              "content": "Do they know what bank you have your accounts with? You need to be extra careful if they know where your accounts are. Contact the bank and make them aware your parents might try to access your accounts. My mom is a branch manager, she has horror stories about your type of situation.",
              "id": 147,
              "comments": [
                {
                  "score": 505,
                  "content": "Thanks for the advice. They do not know which bank I use, but I will take those steps just in case.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 345,
                      "content": "/r/legaladvice is full of all sorts of horror stories like this.\n\nYou should seriously consider freezing your credit too. They have your SSN and all of the other information necessary to steal your identity and take out giant student loans in your name. Freeze it and check your credit report to be sure they haven’t done it already.\n\nThey’ve already told you that they feel entitled to your money. Believe them. They’re going to try to take it from you however they can.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 115,
                      "content": "Also place a freeze on your credit. They might take out credit card under your social security. Or better yet,  let them do it and charge them for identity theft.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 90,
                      "content": "Better safe than sorry! They should be able make a note on your account about your parents potentially trying to gain access/move money. My mom has had to do this for people usually for elderly members who's adult children are trying to steal money but it can work the other way around too.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Make sure you've seen the advice about freezing your credit as well! They have everything they need for identity theft, make certain you're covered",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "You may wish to get a freeze on your credit, too.Your parents will know your SS number...they can take out credit cards or loans with that, and tank your credit rating. Not to mention the company will come after YOU when they (inevitably) default. Freezing is free and pretty easy to do, from what I gather...do it.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Can confirm. Didnt realize she could do it but my mom took 12 grand out of my bank account once and held it hostage until I put a down payment on a house to get it back. You bet your ass that account got closed.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 300,
              "content": "Stay strong and firm. Remind them that they chose to have you, whether there was any other option in their mind or not, and that decision meant sheltering and supporting you for those years while you watched your older siblings get everything else that you didn't. If you have examples, remind them. Tell them you are also supporting yourself, completely, and that's your payment to them for raising you: that you don't have to come to them for anything. They raised you that way, whether they meant to or not.",
              "id": 155,
              "comments": [
                {
                  "score": 140,
                  "content": "I’d not even be in contact with them. They are complete imbeciles.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Yeah but if OP can't get them to shut up or back off, gotta stand firm. Can't ghost people if they know how to find you.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 273,
              "content": "Since I haven’t seen anyone else say it, I will. You would be wise to get a copy of your credit report, and then lock your credit at all three credit reporting agencies. If your credit is locked, you won’t be able to take out loans or open new credit cards without calling to unlock it first, but no one else will be able to take out loans in your name either. Hopefully this wouldn’t ever happen to you, but you’re parents know enough of your info to get loans in your name and r/personalfinance is full of stories of people who’s parents did just that. I’d rather you be a little inconvenienced now than have you come back in 6 months asking “my parents stole my identity and left me with $20k in debt, what do I do?”",
              "id": 158,
              "comments": [
                {
                  "score": 5,
                  "content": "Oh my goodness- yes!! This!!",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 147,
              "content": "If they don’t have access to any of your accounts, how do they know you have $40k? \n\nI say this as I think you need to take additional precautionary steps. \n1- Change the passwords to all of your accounts. Choose something random that they cannot guess. Change your school and email passwords also.\n2- Call each banking or financial (read: credit card) company you use, as well as your school and landlord. Inform them you are having family issues and are concerned someone may call trying to impersonate you. Ask them to apply a verbal password in order to access any information. (I included landlord and your school so they can’t try to cal and unenroll you or cancel your leases so that you are stuck having to move in/rely on them.) \n3- assuming you are in the US, call each of the 3 credit bureaus and LOCK DOWN your SSN. \n4- obtain a FREE copy of your credit report and review to make sure your parents have not already opened any cards fraudulently in your name. They have you SSN, so would say this is a definite possibility. If they have then file a police report, contact the lender, and contact each credit bureau to report the fraud. \n\nGood luck. I am sorry you are going through this. You have had to deal with a lot at a young age, but it sounds like it has made you a strong person. Use this experience and cut the negative out of your life. Most Universities offer free therapy for students. I highly suggest you take advantage of this as it will help you sort things out. I truly wish you a great life, and it would be easy to never trust anyone after what your family has put you through. Take advantage of the resources from your university, so that doesn’t happen. You deserve happiness with the family you will eventually create, wether that be with friend you choose or eventually a partner and children of your own.",
              "id": 160,
              "comments": [
                {
                  "score": 15,
                  "content": "This is excellent advice!",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yes! This is IT ! I hope OP follows each of these steps/actions! This is impressively complete. Sadly, this is the level of self protection that is needed to protect OP from \"The Parents\".  The Parents are seemingly desperate having exhausted all other avenues to solve their financial problem. Many posters have already stated the \"do not give them money\" mantra. \"Give no Money\" is interestingly a version of the \"Tough Love\" lessons that parents sometimes give their children. In this case, the parents are acting like irresponsible children and need a heavy dose of \"tough love\"....  from their child.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Please remember to lock your credit as well in case they try anything funny. Def NTA!",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "You're clearly their black sheep, and neglected your necessities and personal interests, now they're butthurt because you actually never needed them. You're hella strong damn, working since 14. Definitely NTA. Not all blood is family.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Don’t let them guilt you into anything, money doesn’t change people, it just puts a spotlight on what they value and believe... your parents are acting like entitled, jealous, spoiled brats. They have no right to demand any financial reimbursement from you, at all! Don’t share any financial information with them whatsoever anymore, they have no right to know your income or savings totals and that knowledge will only cause further problems. You are 100% NTA",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Good. They can't use shelter as coercion.",
              "id": 166,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "> They also don’t have access to any of my finances or bank accounts.\n\nDifferent bank entirely?\n\nSome tellers can be bullied/tricked into giving access to the child's account even if the parent isn't on the account. It's not legal, but it happens.",
              "id": 167,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "They have your social security number and can forge your signature. They can open an account under your name and accumulate debt. \n\nMy dad did it very easily from across the country from where I lived at the time. \n\nIt’s identity theft. It’s better to catch as early as possible. Set up frequent annual checks to be sure they don’t make an account under your name in the future.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Omg right? What adult says \"oh, let me mortgage the house my five children still live in to the hilt during a worldwide crisis for a wedding?\"",
          "id": 169,
          "comments": [
            {
              "score": 19,
              "content": "Oh I know! I mean if the sis is that entitled, I feel even worse for OP. Tiny ceremony, go for the big one on your anniversary or something. Save up some money. Be responsible.",
              "id": 170,
              "comments": [
                {
                  "score": 17,
                  "content": "I mean, at a certain point you just can't afford it. If you're having to take out second mortgages or get crazy high interest credit cards, it is not within your means. Just because you can doesn't mean you should.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Something a lot of people especially Americans don’t get. My parents were self-employed my whole childhood. We weren’t poor but we never got to take the fun vacations. If dad didn’t work, no money. There were no vacations or sick days. Do I wish I’d been to Disney? Yeah. But mostly now I wish he hadn’t worked so hard. So yeah I’d never ask him to pay for a wedding. Especially not with a mortgage.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Exactly. Also don’t let them guilt you into co-signing for anything. They’ve shown they clearly have no fiscal responsibility. Do not hurt your future to waste money on their mistakes.",
          "id": 173,
          "comments": [
            {
              "score": 7,
              "content": "This. So much. Best friend had to file bankruptcy to get clear of stuff her brother ended up talking their mom into doing before the mom died of cancer and all the debt ended up thrown on the friend as the only one left handling the estate because he'd ditched out as soon as their mom got sick.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1149,
      "content": "Hold up. \n\nYou’re 19? And they couldn’t assist you in any way with the cost of **your education**. But they remortgaged their home to pay for your 28 year old sister’s ***wedding**?\n\n*****NTA*****\n\nDon’t give them a dime.",
      "id": 175,
      "comments": [
        {
          "score": 181,
          "content": "Well said. The parents sound like *assholes.*",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Sounds like the parents like to show off and pretend they have cash.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Well said.\n\n\nHow're things with Crazy Iron Lady?",
          "id": 178,
          "comments": [
            {
              "score": 7,
              "content": "Thank you. \n\nCIL is quarantining far far away from us. It’s lovely.\n\nBut FIL is making noises about coming to visit (he comes for about 3 months per year, mostly for him to get away from her). And she always wants to come, is never invited and pouts. Which is whatever, as long as she’s doing it far away from me  🤷🏻‍♀️",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 629,
      "content": "You are NTA. that is FUCKING OUTLANDISH that they would even say that to you. INFO, why do you have a relationship with these people?",
      "id": 180,
      "comments": [
        {
          "score": 560,
          "content": "I honestly don’t know at this point. Some of my siblings have kids that I’ve tried to spend time with, and my parents are usually there. We have family dinners every few weeks and I don’t want to miss out on time with my nieces, and my siblings who actually treat me well.",
          "id": 181,
          "comments": [
            {
              "score": 609,
              "content": "Don’t let them gate-keep the siblings you do get along with. Reach out to them privately with a message along the lines of “ hey bro/sis, I know you’re probably aware by now that our parents and I are having some issues. They’ve asked me to completely drain my savings (or whatever) and give them $40,000 as repayment for my upbringing and being allowed to work while living at home. While I don’t want to see our parents struggle I can’t financially ruin myself to fix that this time. *I’m open to ideas of how we as a family can help them, but it can’t just be me bailing them out.* It seems unlikely that they’re going to forgive me for this anytime soon and if that’s how they feel that’s okay. What’s not okay is is losing our relationship because of them. I’d love to figure out a way to still be involved in your family’s life, regardless of the rest of our family being around. Is that something we could do?”\n\nThe italicized sentence is only if you truly feel that way. Just thought I’d throw it in as an option\n\nEDITED TO ADD: Thank you stranger for the award \n\nTo the people commenting below I have a few things I’d like clarify \n1) This is a guideline of what they could write. They should obviously adjust it to them and their relationship with their sibling(s)\n2) This would only be sent to the sibling(s) that OP mentioned wanting to stay in touch with and were worried they’d lose contact with due to the drama with their parents \n3) The italicized part would depend on what they wanted to do. I *personally* don’t know the background or how many siblings would be willing to chip in. Based solely on the background I don’t think I would include it, but I’m a stranger and they aren’t my parents. If it was actually my parents I might. \n4) Yet again template to work from",
              "id": 182,
              "comments": [
                {
                  "score": 69,
                  "content": "This is great advice OP.  Sounds like you have some normal siblings that enrich your life and who can provide support and comfort, and a few losers who you need to block.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "I would not include the fact that you have 40K in savings. That could make it a heck of a lot worse",
                  "id": 184,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Yes and no. I think it’s important to include that they’re asking for $40,000 and not just “money.” I feel like it’s safe to assume their parents are likely spinning a sob story that the OP doesn’t love them and won’t help them by giving them the money that they desperately need... conveniently leaving out that it’s $40,000 not $400 or even $4,000 that they’re asking for. Saying no to $40,000 is a whole lot different than a significantly smaller amount. They could leave out that it’s coming from their savings but I do think including the amount is crucial.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 70,
              "content": "If you loan them some money I don't see them every paying you back. NTA",
              "id": 186,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "Were your nieces parents among the siblings who have agreed with your parents?   You probably want to cool it with visits there.  For the others, do a rotation of lunches/weekend activities with the separate families.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "NTA. Cut them out of your life.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 356,
      "content": "NTA - Do. Not. Give. Them. Your. Life. Savings. \n\nYou are flush now which is great for someone just starting their life. Get the college education you saved for. Keep a little nest egg to put money down on a house. Maintain your savings to bail yourself out one day, if you find yourself out of work. \n\nA small loan in my family never turned out to be a loan, and never turned out to be a one-time thing. If you can from this point forward, avoid telling your family what you make and what is in your savings.",
      "id": 189,
      "comments": [
        {
          "score": 17,
          "content": "One great bit of advice I got once was: “unless you’re literally a banker, never loan money with the expectation of getting it back.”\n\nI have friends and family I’d help out of a tight spot if I could without overextending myself, but any repayment would be a bonus.\n\nI certainly would never give my entire lifesavings to anyone, especially in circumstances like OPs.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "\\^\\^\\^\\^\\^this",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "One step further, do not discuss with any family members how much money you have or make because it might make it back to them. I don't even know how they'd know what money you have in the bank other than the fact that you're supporting yourself. Then you just say no sorry can't afford it if they ask for anything. Because if you don't cut them off, they likely will ask again at some point.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 317,
      "content": "NTA, that’s ridiculous really, I mean come on you lived here as a minor so give us 40 to cover the 30k we dropped on your sister??!!!! They have serious issues and need to learn how to manage their money",
      "id": 193,
      "comments": [
        {
          "score": 94,
          "content": "[deleted]",
          "id": 194,
          "comments": [
            {
              "score": 21,
              "content": "Depending on what country they are in, the bank will stop the mortgage repayments under financial hardship provisions so they will not lose the house.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 232,
      "content": "[deleted]",
      "id": 196,
      "comments": [
        {
          "score": 57,
          "content": "Thankfully, OP said parents don’t have access to their accounts or anything in another comment. That was exactly what I was most worried about. \n\nI had my parent on my bank account (opened as a teen) and completely forgot about it until a while after he passed away when I was 22. It was fine as they only ever put money into the account and would never take anything out... still I think it is easy enough to forget about something that was set up when you’re a kid.",
          "id": 197,
          "comments": [
            {
              "score": 31,
              "content": "> Thankfully, OP said parents don’t have access to their accounts or anything in another comment\n\nIt's just worth repeating to OP that the parents might \"force\" their way into her account.  They have a LOT of personal information that might help authenticate (online or over the phone).\n\nOf course it's fraud but if they feel entitled to her money, that might not stop them.",
              "id": 198,
              "comments": [
                {
                  "score": 13,
                  "content": "Yeah OP definitely needs to make sure she changes her info to something they can't guess. For important passwords I just keyboard smash on a sticky note and add some numbers and symbols.",
                  "id": 199,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Even better would be a nonsensical sentence. \n“Chocolate milk comes from brown cows!” Is an easy password to remember but nobody’s gonna guess that.",
                      "id": 200,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Piggybacking the security questions here's.  Op make sure that you don't use personal identifiers as answers to your security question, instead make them random.\n\nEx.  Whats the name of the street you were born on?  Answer something like \" a cartoon\".",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This this this this this this this this this \n\nAlso NTA",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yup. Mom drained my savings at 16 to give to my drug addict brother she always babied. He's homeless somewhere in Seattle, and I'm making great money, and she'll never see a penny.",
          "id": 203,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}