{
  "post content": "Just over two years ago,  I(f29) unexpectedly got pregnant and now have a beautiful 18 month old daughter, Ciara. \n\nOver that time my friends circle got considerably smaller but my best friend remained, Mia (f31). Mia doesn’t have kids nor wants kids but she’s been brilliant with Ciara.\n\nI’m a SAHM and obviously don’t have as much time to hang out as I did previously. Mia and I live on the same street (we’re in Manchester, England) and it’s a walking distance between our houses. I’ve told Mia numerous times that she can just pop in whenever she wants to (she works from home) but she rarely does. \n\nShe did at the beginning but it’s been happening less and less. Instead, she keeps suggesting we go out for coffee or pizza or even a drink but I don’t have the time and always just tell her to come over and we’ll have coffee at my place.\n\nShe asked if I wanted to go out with her and her other friends for a drink last weekend but I said that no but she’s welcome to come over and we’ll have a few drinks at mine. She said she already had plans and it felt weird to drink when she knows there’s a child around. \n\nHonestly, I feel neglected. I feel like she put me on a back burner and doesn’t want to be friends anymore. I’m always available but she rarely comes over and I don’t think that’s fair.\n\nToday, I saw her photos from Saturday night out and I was fuming. She ditched me just so she could go and drink like she’s 20 again. I felt rejected and horrible, I thought we were best friends but she clearly doesn’t value me when she won’t even have a few drinks with me at my house.\n\nWhen she finished work, she called and asked if I fancied going for coffee to town but I asked her to come over again. She said yes but before she disconnected, I heard her mumble “like always.” This really annoyed me.\n\nWhen she came over, I decided to be open about everything. And while not my proudest or most mature moment, I shouted at her that she’s an awful friend m, that she barely comes over and if she doesn’t want to spend time with me to just say it and stop playing around.\n\nShe said she’s always been accommodating but it’s been 2 years and she doesn’t want to spend time with me when there’s always a kid, especially now when she has to watch her language (Mia likes to swear).\n\nI said that she knew I had a child and responsibilities. And she said that Tom (my partner) could take care of Ciara once in a while so I could have a time off.\n\nThis felt really intrusive and I told her to mind her own business and not meddle on my marriage. \n\nI was really angry with her and kicked her out. She called me a selfish asshole on her way out.\n\nNormally, I would expect her to call by now with apologies but she hasn’t done so and I’m starting to wonder was I the asshole or was she? Perhaps I was too harsh and should’ve been more careful with discussing it.",
  "id": 1,
  "comments": [
    {
      "score": 74362,
      "content": "YTA. She didn't ditch you. She asked you to go out with her friends as she'd made plans. She's not drinking like she's 20, she's drinking like someone who doesn't have a child.\n\n\n\nPS, she's right. Your partner can look after your daughter once in a while. And should do, to try and bond with her.\n\n\nEdit: over 60k karma. Y'all are crazy!",
      "id": 2,
      "comments": [
        {
          "score": 25526,
          "content": "I have a child, but I completely second this. Nobody wants to have a little kid around every single time they see their friend. You can’t talk with each other freely, the parent is literally always distracted, and maybe you don’t always want to hang out at home with someone’s toddler either? It’s on OP to get a baby sitter or have her partner watch the child from time to time. Childless people are not interested in always having kids around. Neither are people who actually have kids themselves. 🤷🏻‍♀️",
          "id": 3,
          "comments": [
            {
              "score": 17097,
              "content": "I'm not even sure if parents realize how much of the conversation when there's a kid around revolves around the kid. Oh, look at what Kayleigh is doing. Hi, Kayleigh! Is Kayleigh a big girl? Does Kayleigh need a kiss from mama? Peekaboo! Peekaboo! Who's a big girl? Come give \\[friend who is grimacing\\] a hug. Can you say hello to Aunt \\[friend who wishes they'd gone down the pub after all\\]? Do you need a snack? Where's Bear-Bear? Did you lose Bear-Bear? Do you need Aunt \\[friend whose brain is turning to jelly\\] to help you find Bear-Bear?  Awwww, Kayleigh, it's okay, Mama will give you a kiss.\n\nIt's unbearable.",
              "id": 4,
              "comments": [
                {
                  "score": 7843,
                  "content": "I’m a parent and yeah if you are out with a toddler there is zero adult conversation happening because you need to either keep them entertained, or stop them from injuring themself.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 9020,
                      "content": "[removed]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3607,
                      "content": ">or stop them from injuring themself.\n\nSwear to god, toddlers have a death wish. \n\nNo, baby, no, don't stick your fingers in there. No, please, don't eat that. No, please, get off there. \n\nHonestly, it's like Jackass on steroids.\n\nEdit - thank you for the award, kind Reddit stranger. \n\nAlso I love how the replies on this are just all of you recounting the various ways your toddlers nearly met their end. A lot of coffee table stories 😆",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 541,
                      "content": "Tbh not just toddlers. As a childless person, even hanging with friends and their older kids, it’s ALWAYS about the kid. Impossible not to feel like an afterthought when a child is around, and who wants to spend their free time that way?",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "My friends and I used to joke that our phone calls sound like a bizarre form of Tourette’s. “So how has…Timmy, put that down!…work been?  Did you finish that project you…Bud, I said not right now!…told me about?”",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Not to mention how much you end up forgetting and then repeating whatever it was your were trying to say 😅",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 979,
                  "content": "This! I absolutely don’t mind when my friends have very little ones going to their place because it’s hard for them to get out, but the whole event is based around the child/children. At some point even if it’s hard you have to make an effort to get out without the kids. If you’re a single parent or your spouse works off hours it’s totally understandable, but if that’s not the case you should be able to go out for a couple hours alone. Don’t throw your friendships away, because one day your kids will be running out the door to friends houses for overnights and hanging out and then what will you do.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 330,
                      "content": "And an entire group of adults watching a kid try to shove a square block in a round hole and applauding madly when he gets it right. I like kids, but yeah....very little actual interaction between adults when they're around.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "I've done this too, gone to my friends' house when they've just had kids, but it's also great to go out. Also, now I have a 5 month old and I keep asking my friends to go out and have a coffee, but they all wanna come to my place and see the baby. I'm like, dude, let me get my husband to mind my kiddo for 4 hours and let's GO OUT.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 866,
                  "content": "Oh and add to that, many parents want to talk only about their kid, esp. when they're under 2.  So the whole conversation bounces between your example and, the parent rambling on about their kid, and how proud they are of them, and what they're up to with their kid, and all the things their kid loves, and does, and wants, and cries about. \n\nIf you try to have a non kid related conversation it just gets redirected back to talking about the kid.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 604,
                      "content": "This is so true. I’m the childless friend and it can be exhausting to stay friends with parents that are like this. Sometimes I just want to have a conversation about things that are going on with me/something I can relate to, and not have the entire day filled with nothing but kid talk. I can’t relate to that. If people want to maintain friendships after they become a parent, they need be a good friend and realize that not everything revolves around their life and parenthood.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Good golly, this. I’m the childless friend (and not by choice, thanks body) and I have one friend that literally showed me all the clothes their toddler had like it was some sort of pint size fashion buying trip instead of dinner at their house. \n\nI started planning for meals out for us after that as often as I could, but they STILL talked about the kid 75% of the time. So exhausting. And kinda upsetting, considering how they would randomly mention how I was going to be a great mom some day (see above).",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 534,
                  "content": "YES. The baby talk is insufferable. Plus you can only hear about breastfeeding woes and bowel movements (“Solomon’s potty habits!”) so many times before hanging with that friend becomes a huge, gross bummer.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 30,
                      "content": "I had to stop using Facebook for this reason alone. Just imagine finding your mom's posts about you shitting yourself once you get older- I can't imagine how embarrassing that has to be for the new generation.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 358,
                  "content": "This sounds like it was experienced on a personal level. Are you free from that nightmare?",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 156,
                  "content": "Just reading that exhausted me....",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "You’re all SO right. I do have a friend who had kids over the last years. As much as I like her, maintaining a friendship is hard. She only stays at her house with the kids and rarely leaves. When I want to meet her, I always have to come to her house in a specific timeframe before her husband comes home from work. And we never get to talk uninterrupted more than 5 mins, as either one of the kids comes to her or she suddenly starts baby-talking to them. When her husband comes home from work, I get pushed to leave. The little bit of attention left for me is completely gone as soon as he enters the door. She even declined my wedding invitation 2 days before the wedding because it obviously was too exhausting to leave the house with them. (The kids were of course invited and we had other kids at the wedding too)\n\nIn the last few years, I only met her outside once, for a coffee in a cafe in town. But it ended up being a coffee to go and a walk in the nearby park with kid in a stroller/walking with us. Turns out she only came out because she needed to get a few groceries in a specific supermarket - which was near that park and cafe. After a round in the park she waved goodbye and was off to that supermarket. Ouch.\n\nI invited her so many times or made suggestions for activities- with and without kids. Asking her how she is on a regular basis. But often no answer or just a very short one. It became exhausting to be her friend. \n\nReading the OPs post really reminded me about this.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 43,
                      "content": "[deleted]",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "I have never read a better description of how it feels when I hang out with my friends who have kids.\n\nIt's exhausting and SO BORING. OP, don't be an a\\*\\*hat to your friend, like she said, it's been two years, it's time for you to accommodate for her.\n\nYTA",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "And as a parent you would think OP would love to go out without the kid, with friends.  \n\nAnd she got so defensive about her husband not doing his part.\n\nOP is absolutely YTA and is going to snap without some.time to be an adult.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "So true.  I told my wife when we have kids we’re not going to do that.  We had our first kid and it’s still\nhard not to talk about mostly them so I tell people if I’m talking about the baby too much just tell me and we can switch topics",
                  "id": 25,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I've done this too, told my best friend \"I don't wanna tell you all about how my kiddo has been pooping great this last 2 weeks, but a part of me does wanna tell you that. So, changing topics! What's up with you???\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1148,
              "content": "That's what happened with a good friend of mine. Every time I visited it was all baby, all the time. She couldn't even let me finish a sentence without babbling at the kid or pointing out that she made a face. It was incredibly tedious and I felt like I had lost her. We ended up growing apart because EVERYTHING was about her child and she would never make time for me without her despite me seeing on social media that she was going to concerts and out with other people just fine.",
              "id": 27,
              "comments": [
                {
                  "score": 681,
                  "content": "I just saw a friend for the first time in 18 months without her kid. And we only went to the pub two blocks from her house. \n\nIt's tiring. I want to stay her friend but it's so limiting. I miss our friendship and the times we spent together. I just don't think our lives are compatible anymore.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 653,
                      "content": "This is so relatable. I recently caught up with a friend (finally)... and all she did was talk about her kid. Kept steering the conversation back to her kid, and stopping the conversation every 15 minutes to continually text her babysitter. She just wasn't there with me mentally at all. \n\nAnd when I did mention any of the fun stuff in my life and happy news, you'd think I'd done it all to spite her - she was borderline rude. I genuinely don't think we're compatible anymore...",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 438,
                  "content": "I fell out with a friend for the same reason. The funny thing is we BOTH had kids six weeks apart from each other and I couldn't stand hanging out with her and her kid because she couldn't talk about anything other than him. I started to initiate get togethers where the kids stay home but she hated that idea so we just stopped hanging out at all. \n\n\nI went to a Christmas party a few nights ago where I was the only one bringing my kids (everyone who helps me out when needed was going too). I stopped at the dollar store and got crafts and colouring supplies and things that would keep them busy and they had a great time and I got to socialize with other adults like an adult. It was GLORIOUS. They are also a little older so it's easier (5&3) and are pretty chill in general",
                  "id": 30,
                  "comments": [
                    {
                      "score": 198,
                      "content": "I think the difference here is that you're willing to put in the effort to accommodate your child free friends while also raising well mannered children. OP sounds like she resents her friend for not worshiping her child.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "^THIS! \n\nMy friend had a kid two years ago and we are very accommodating to her. But one time a group of us went to go get tea -- her and baby included. I asked if she brought baby (roughly 8 months at the time) something to play with. You know, stimulation as we adults talk.\n\nShe looked at me like I grew a third head. I ended up giving the kid my keys and the tea place gave her an empty cup as well. But man did that irk me for no reason. Kids need entertainment as well.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "That's basically my family. I have three siblings with 2-3 kids each. Even now when the oldest is 18 it's all they (and my parents) talk about. I can go a whole day of a family gathering saying maybe 30 words because I have nothing to add and, without kids of my own, nothing they want to talk about.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 495,
              "content": "I have 2 kids and third this. She’s not abandoning you, you’re being inflexible. DH can watch baby once in a while so you can have some adult time.",
              "id": 34,
              "comments": [
                {
                  "score": 40,
                  "content": "I have 2 and I jump at the chance to go out without my children, I love them dearly but I do need space away from them - it’s nice to be able to chat about adult life and relax",
                  "id": 35,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Mom of 2 here and same!!! I had to scroll back up to the beginning to check- maybe op’s baby is a newborn, 4-5 months tops? I know I wasn’t going out when my littlest was that young. Ope, no the kid is 18 months. Whyyyyy why why not take up your friend on her offer to go out for drinks?! The husband can surely watch the baby for a night.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This.  After I finished nursing my child I went on vaca with a dear friend I hadn’t seen in years. No talk of our kids, just two women having a great time away from our families. \nYou need time away from ur kids.  Maybe not a week like I did, but at least a couple of hrs to get adult time.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Ya I don’t like how this is being posed as a parent vs. childless thing. Parents go out for nights out with friends too! Also not sure why a lot of commenters seem to be assuming that everyone Mia was out with is childless. Even if OP refuses to go anywhere without her kid, doesn’t mean others won’t.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Plus OP's friend works from home. She spends the whole work day in a house. She doesn't want to spend her free time in another house. No wonder she keeps suggesting cafes and pubs. She needs a break. But OP doesn't see that coz in OP's world, it's all about OP and what OP wants. No consideration whatsoever for where the friend is coming from. OP has spent so much time with her baby that she's now acting like one.\n\nYTA OP",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I agree with everything you guys said but let me say this, maybe it’s not even 100% about being around the child, some people just enjoy being able to go out a bit into the city. Come on, hanging out for 2 years at your friends house is tiring, it’s more than ok to want to change airs a little. If my friend’s condition to see were me going to their house every single time I’d put them in the back burner for sure, I would rather go to the park and take the kid with than always go to my friends house. That’s a really selfish demand. Why won’t OP offer to go to the friends house for a change, for example? Offer to go for a walk around the block? There are so many options.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "This is SO real. I (child free) came from a few horrible weeks in terms of work/stress and really needed to have a coffee with a friend and disconnect (this happened like a month ago). I called my neighbor, who has the most beautiful kid in the world (16 months old) and usually we are the three of us going for a walk and I take care of him (they call me auntie ♥️), but that day I just needed a coffee, some chatting, and relax, so I texted her to see if she wanted to have a tea in a place next to home. Weeeeell… she showed up with kiddo: it was a Sunday and dad was home. But she just wanted to walk him around -and out of the buggy-. Literally, the coffee time was myself sitting alone and her running behind the baby back and forth. She comes back to the table, asks me something about how I’m doing, and less than five seconds afterwards she’s disappearing again… oh god. I swear I couldn’t finish a full sentence in the whole time. And when we are walking back home she has the audacity to ask me if everything is okay with me, that I look upset 😂 Moms of the world, really, take some breaks from time to time or just understand that you are going to be isolated.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3490,
          "content": "OP: she never wants to spend time with me!!\n\nalso OP: lists all the many times friend has called her, asking to spend time with her, but OP SAID NO.\n\nme, reading this post: ... am I on crack?!",
          "id": 42,
          "comments": [
            {
              "score": 1296,
              "content": "Seriously. Has OP made ANY effort to go out? Hire a babysitter? Have partner/family watch the kid? \n\nIf she hasn’t, she’s the AH. She only wants to see her friend on her terms, so clearly she values the kid over time with her friend. Exactly what she’s claiming the friend is doing.\n\nAnd she’s a SAHM!! Not like she’s a working mom who only has time to see her baby after working 8 hours. Figure it out!",
              "id": 43,
              "comments": [
                {
                  "score": 390,
                  "content": "Exactly this. Her friend wants friend time, not SAHM time. OP has ditched her friend by making 0 effort to go out sans kid.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Or she’s a helicopter parent who has to be the one in complete control.",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "Completely agree with you and the points others have made.\n\nAlso\n\n>Normally, I would expect her to call by now with apologies but she hasn’t done so\n\nWhy \"normally\"? Does OP always wait for her friend to apologize? Because she's always right? Ughh..",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Recently I had something similar to OP.\n\nLong story short, my friend and her husband share a 1 year old and their divorced was finalized during the summer.  We both had life happen in different ways, yet were still talking often.  However, she got involved with someone and began using every opportunity to see him (read also: Lie that she was with me so she could have her parents watch her daughter.  I had no knowledge how often she was using me as \"the excuse\".)  In the meantime, my grandmother had been hospitalized for two months.\n\nMy friend needed her gallbladder removed and her surgery was scheduled for the end of September.  I asked her to text me when she was well enough so I could bring her flowers and do a few things around the house for her.  Instead, my texts were sparsely answered until a week later.  She calls me and tells me that she was driving to buy an outfit for her date with her guy.  I asked her how she was feeling, but I was rushed off the phone because she was going into a dressing room.  \n\nAdmittedly I felt pretty annoyed.  She could prioritize time with a guy, but not one of her best friends.  I took it for what it was worth and had to prepare for my grandmother's funeral the next week.  Calling or texting her felt like a lather, rinse, and repeat of, \"Well, I can't talk because _____\", so I just didn't contact her.\n\nAnd that's where we are now.  Things blew up with the guy and she was lashing out at me that, \"You changed, we used to be so close, I don't have any money because of [daughter's name]\".  In short, I pointed out to her how many times I reached out to her to make time *for* her, only to be met with excuses.  So when she decides that she has time, call me.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "This ! I was so livid when she had the audacity to tell her “mind your business “ like she just ask you if your husband can take care of her that’s it 🤦🏻‍♀️",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 492,
              "content": "Exactly! \n\nThe kicker at the end is that she normally would have had a call to apologise by now. How many times have they butted heads about this before now?\n\nYTA OP \n\nGive DH the kid and make time to go into town with your friends befire you lose them.",
              "id": 49,
              "comments": [
                {
                  "score": 62,
                  "content": "The fact that feels is intrusive for her friend to even mention the idea of DH to stay with the kid sounds like he won't agree to watch his own child to give her the night off",
                  "id": 50,
                  "comments": [
                    {
                      "score": 36,
                      "content": "It crossed my mind too.\n\n\n Hey, OP are you trapped? If yes, please seek help.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "This !! Like you know you are wrong but still waiting for her to apologize like always.. nahh that’s how you loose a good friend..",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 326,
              "content": "Also \"you can just stop by whenever\" is not really an invitation. OP should try \"would you like to come over Monday at X time for coffee at my place?\"  Sometimes people make open offers but don't really mean them, some people are uncomfortable with the ambiguity, and sometimes if plans are just \"whenever\" they don't get made.",
              "id": 53,
              "comments": [
                {
                  "score": 172,
                  "content": "Especially when that \"whenever\" apparently also includes times when Mia is working, given OP felt the need to mention that Mia works from home - which I guess in OP's world means Mia is free to come hang out during the day? Even though that's not how work from home actually works.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Also \"you can just stop by whenever\" puts the onus 100% on the friend to be the one to \"stop by\".",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Plus perhaps the friend had turned up. And OP like shhh it’s her sleep time. I don’t want to wake her. Friend tells a story “shhhhh, your being to loud.”",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Oh no, you don't understand. Mia isn't 100% available to spend time with OP in exactly the way that OP wants her to, so that's exactly the same as never being around at all! /s\n\nSarcasm aside, there really are people who think this way. To them, if they don't get every single thing they want, you might as well spit in their face.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "It's not that OP wants to spend time with her 'friend', what she wants is for her friend to have changed her lifestyle to suit OP's new lifestyle the moment OP got pregnant. She doesn't want her to go out drinking \"like she's 20 again\", which actually translates to \"I don't get to go out and have fun, so you shouldn't be allowed to do that either\".",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1706,
          "content": "Why don't you have your partner look after the child, OP? \n\nIdk, by the way OP sounds, I wouldn't want to go over anymore either. \nYta, you're acting immature.",
          "id": 59,
          "comments": [
            {
              "score": 1419,
              "content": "\\*GASP\\* HOW DARE YOU MEDDLE IN HER MARRIAGE LIKE THAT?!?",
              "id": 60,
              "comments": [
                {
                  "score": 818,
                  "content": "Why do I have a feeling she’s with someone that feels parenting equates to ‘babysitting’.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 517,
                      "content": "Yeah…weird how there’s no mention of partner/coparent until commenting about her friend “meddling in her marriage”…it sounds like her relationship probably has an impact on her strained friendship, too. Maybe that’s why her friend doesn’t want to go to her house.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "That, or she doesn’t trust her partner/spouse to keep Ciara alive whilst she’s gone because she’s never once left Ciara with someone else.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Sounds more like letting the father interact with his kid is intruding on mommy time.\n\nLived that. Hated it. Any time I tried to be a dad I was doing it wrong and she had to rush in and take over. This one sounds that controlling.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "You know shit is bad when say \"the dad could spend a day with kiddo\" somehow turns into a personal jab at her romantic relationship with said dad.... no OP, she was only stating the obvious, you only assume she was criticizing your marriage because the shoe fitted.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "OP definitely sounds super defensive there. Suggesting her partner watch the baby is so far from intruding on her marriage that she’s definitely lashing out due to some other marital issues.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1543,
          "content": "And seriously, just because she works from home doesn’t mean she can “pop over” for a coffee and a chat in the middle of the day.",
          "id": 67,
          "comments": [
            {
              "score": 982,
              "content": "I wish more people would understand this! I work from home. Key word: WORK\n\nNo sorry I can’t just pop out while I’m working because I’m getting paid to do a task it just happens to be at home.",
              "id": 68,
              "comments": [
                {
                  "score": 314,
                  "content": "Right! I end up glued to my desk when I WFH because I’m scared to death they will take away the privilege!",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "And a lot of WFH arrangements require being available at specific times, not just get this done whenever - maybe for interaction with others like calling clients, maybe as a way to maintain focus",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Yes! The terror that is Microsoft teams, slack, and Skype statuses that say when you’re away for even 5 minutes",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Many ppl have this distorced view that WFH = yay free time. Nope that person is working, they can not go play some videogames out of nowhere. WFH is still serious work.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 390,
              "content": "Also since Mia works from home, she’s probably even more interested in going out than if she worked out of the home. OP is offering her the variety of visiting OP’s home down the street, in addition to working in her own home. Mia instead wants to go *out* to someplace that isn’t a home.",
              "id": 73,
              "comments": [
                {
                  "score": 36,
                  "content": "Yeah, if I want to sit around a house with a coffee, I want it to be the one wear I can take my bra off and wear my Jammie’s!",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "I was literally coming to say this. \n\nYes. She works from home. That’s right - *WORKS* from home. She’s working. She can’t just stop by whenever 🙄",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 942,
          "content": "Being around a child so much has her acting like one.",
          "id": 76,
          "comments": [
            {
              "score": 45,
              "content": "OP has gotten very used to having someone around who can't really say no to her it seems",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This. I knew I'd been spending too much time with my small child when a coworker bumped their shin at work and I asked, \"Did you get an owie?\"",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 891,
          "content": "OP seems to have forgotten that friendship is supposed to be two ways, and that doesn’t change just because you have kids. Mia deserves a friend who reciprocates her efforts once in a while, not judge her for living her life.",
          "id": 79,
          "comments": [
            {
              "score": 42,
              "content": "I was thinking the same thing. Where's the compromise here?\n\nOP, YTA. There has to be compromise in any kind of relationship, including friendship. It sounds like you expect her to come to you 100% of the time so you don't have to make any effort to maintain the friendship. You need to compromise some here, not just her. Stop saying no all the time or don't be surprised when you don't have a friend anymore.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Her friend is definitely reevaluating things now - it's ok to make people come to you for the first few months after your child is born, totally on board with that, but eventually you have to start being an active friend again, and OP is definitely not doing that. The quote \"She said she’s always been accommodating but it’s been 2 years\" is really true - if OP can't ever leave her house or have her partner look after the kid even after 2 years, will this friendship always be her friend coming to OP's house to talk about OP and OP's kid?",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 752,
          "content": "But suggesting the partner watch his own child is intrusive. However, OP checking out friend’s social media and criticizing her lifestyle isn’t. \n\nYTA OP. Your friend is in her 20s and childless. She is allowed to do what she wants that doesn’t include you. Sometimes people grow apart. She is not required to change her life because you had a child.",
          "id": 82,
          "comments": [
            {
              "score": 152,
              "content": "Why would it be intrusive to expect a father to, idk, FATHER his child??",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "I find OP's choice of words extraordinarily telling. \n\n\"Today, I saw her photos from Saturday night out and I was fuming. She ditched me just so she could go and drink like she’s 20 again.\"\n\nThose darn idiot 20 year olds and their endless parties. How dare your friend decide to spend her spare time as she pleases? Especially after trying and failing so many times to get you to go places.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Woah, woah, woah. Friend is in her 30s and therefore shouldn't go out to drink like she's in her 20s according to OP. I guess the legal drinking age stops at 30.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 588,
          "content": "Not only did Mia not ditch her, I would say that it sounds like OP ditched Mia. \"I'm always available!\" But only if people want to come over and hang out with her and her toddler. That's not \"always available.\" If you were \"always available,\" you'd go out to coffee with your friend and have an adult conversation. \n\nAlso...? Mia *is* in her 20s. So saying she's \"out drinking like she's 20?\" yeah... Because she can. \n\nLastly, I honestly assumed that OP was a single mom until she mentioned her partner. I have no idea if Tom is the kids dad or not, I suppose it's possible that he's just a boyfriend and not baby daddy, in which case I wouldn't put that on him. But if he is the dad? Why the hell *doesn't* he take care of his own kid?",
          "id": 86,
          "comments": [
            {
              "score": 32,
              "content": "I thought she was “single at home mom” instead of “stay at home mom” ..I now realize I better google my acronyms.",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Yup. I’m always available to do things on my terms, at my convenience.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 486,
          "content": "Plus, taking your baby out into public once in a while is okay, as long as you don't over expose them.\nGo have coffe with your friends, get a \"to go\" cup. If the baby is having a negative reaction, comfort them and go home.",
          "id": 89,
          "comments": [
            {
              "score": 477,
              "content": "Coffee with someone who has their kid around is not fun and I say that as someone with 2 kids.  You can't give someone your whole attention when you have a kid with you, especially one OPs age because they are into everything.",
              "id": 90,
              "comments": [
                {
                  "score": 15,
                  "content": "i have a friend with a 3 year old and whenever they come over the whole time is just spent a) finding something to entertain the toddler b) chatting for 10 min c) finding something new for her to do when she gets bored so we can keep chatting\n\nso far the winning activity with a whopping 15 min of entertainment is giving her a big bowl of dry rice, a bunch of empty cups, and a spoon to dig with and move the rice from cup to cup lol",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I agree. My kid is almost seven and it’s only been in the last year and a half I can have a coffee date at a park or something and my kid not need my constant attention. Coffee at a coffee place with a toddler is a punishment not a fun hour or two.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 463,
          "content": "Is it just me, or did the way she brought up the friend working from home make it sound like she assumed the friend can just stop working whenever and go over to her place?\n\nLike I wfh, but I have times when I have to be at home with my work computer. It sounds like OP just expects everyone to always come to her rather than her go to them, which is unfair. \n\nEspecially since it sounds like the friend has come over before, but she shouldn't have to always be the one accommodating OP just to spend time together. There should be some compromise, and it sounds like OP just expects everyone else to be the ones compromising.",
          "id": 93,
          "comments": [
            {
              "score": 17,
              "content": "I was bothered by this too. I also WFH full time and while it has its perks, it’s also suffocating at times. And if her friend is like me, when we have an opportunity to dress up, leave the house and interact in the “real world” again, we take it - which is not the same as going over to your neighbor/friend’s house to hang out with their child",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 33606,
      "content": "YTA.\n\nYou’re always expecting her to accommodate you because you have a child. She’s been coming over to your house for over a year because she understands your life has changed.\n\nYou’re putting in very little effort and assuming that it’s on her to maintain the friendship and compromise - why? Because you’re a mom?\n\nShe didn’t ditch you - you’ve been a shitty friend for a while and she’s probably done with you.",
      "id": 95,
      "comments": [
        {
          "score": 6197,
          "content": "Coming to say this as the mom of a 2-year-old.",
          "id": 96,
          "comments": [
            {
              "score": 4236,
              "content": "Mom of an 18 month old checking in. The fact that she even came over as often is she did was a huge win, OP is taking her friend for granted",
              "id": 97,
              "comments": [
                {
                  "score": 43,
                  "content": "especially the last paragraph „I expected her to call and apologize by now“ apologize for what exactly? Making a suggestion that‘d make your life easier? Being fed up with compromising? OP sounds entitled as hell",
                  "id": 98,
                  "comments": [
                    {
                      "score": 21,
                      "content": "She is used to this friend rolling over when she screams. I have a feeling friend will be happier now.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "Came to say the same thing as a mom of a 4 year old",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4078,
          "content": "“I’m always available” \n\n*Goes on to say they are rarely available and ONLY if they meet at their house in their living room with just them two* lmao",
          "id": 101,
          "comments": [
            {
              "score": 2503,
              "content": "Also her friend is WORKING during the day. Working from home is working! She's not free to stop by all day.",
              "id": 102,
              "comments": [
                {
                  "score": 1240,
                  "content": "And when she's done working inside her house, she's expected to just move to another house and never see the outside world unless it's the street between her and OPs house.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 469,
                      "content": "This is honestly the part that annoyed me the most. The friend spends enough time in their own house, what makes OP thinks the friend wants to spend more time stuck in another house, especially one that isn't their own for a solid two years and never go anywhere else, including having a kid around each and every time? The friend has a level of patience I couldn't have.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 514,
                  "content": "THANKYOU! This bothered me greatly. You'd think that the idea that \"work from home is still work\" would have shifted during covid when so many people started working from home, but I still see people constantly referring to WFH workers as having \"tons of free time.\"\n\nNo, they're AT WORK. \n\nOP.. YTA, and a shitty friend.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 14,
                      "content": "This drives me crazy too bc I work from home 3x a week and get more done than I get done in the office. People always think you're doing nothing when you WFH.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1827,
          "content": "Honestly, I’m not seeing anything that Mia is getting out of this friendship, other than a load of audacity from OP",
          "id": 107,
          "comments": [
            {
              "score": 407,
              "content": "also the phrase \"usually she would've called and apologized by now\" speaks volumes about how OP treats Mia. throws a tantrum and guilts her into an apology",
              "id": 108,
              "comments": [
                {
                  "score": 27,
                  "content": "Yep, so much of this!",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "1000x this, I couldn’t roll my eyes hard enough at that part! Just expecting Maria to apologize for (gasp!) wanting to live life!",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "Yup. Unfortunately I agree with this. And I think OP will be waiting forever if she's expecting an apology. Becasue friend has absolutely nothing to apologize for. YTA",
              "id": 111,
              "comments": [
                {
                  "score": 12,
                  "content": "Yeah, she better not hold her breath",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Right?!  Because she can’t even have a *real* talk with her friend, about grown-up things, without there being a small child around to hear it.  I’m a mom and have found it SO frustrating when I want/need to talk to other mom friends about BFD stuff (or just have some time to feel like an actual person again) and they only want to make plans with our kids in tow.  Leave the kids with dad/mama/grandparents/auntie/babysitter/neighbor/the dog and let’s go out!",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 400,
          "content": "Wanted to give my free silver but for some reason it went to the post, (I’m so salty about that)\n\nso here’s my imaginary silver 🪙\n\nEdited for wording",
          "id": 114,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "One of my bffs has 2 kids so we end up at hers often but that’s because we are broke and cheap and hate being around people. If I’m doing something outside the house though, she wants to be invited even if she can’t go",
          "id": 115,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Totally agree.  \n\nOP, YTA.  It sounds like your friend has spent a lot of time in your home, and you admit that she is \"brilliant\" with your daughter. Now that your daughter is older, it is not a lot for your friend to expect you to meet her outside of the house once in a while, especially because you have a partner. You are expecting a friendship only on your own terms, and are not considering your friend at all.\n\nThis is coming from someone who is the friend without kids that my friends with kids love. I enjoy children, and don't mind altering plans to hang with my friends and their children.  When nights out are replaced with meals at home, it's all good.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Amen! My friends just had unexpected twins this year, they already have 2 older girls as well.  They've been by our house 3 times since the twins were born in April, we've gone over to their house for a Friendsgiving, and we've gone to a fair together. The kids were with each time and it wasn't a problem. Sure we don't see them as often as we used to, but they still make an effort and so do we.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "After OP had her entitled tantrum and yelled at her friend, I'm pretty sure said friend is 100% done with OP. From this post you can tell OP is exhausting to deal with",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19990,
      "content": "INFO: why *can’t* Tom take care of Ciara once in a while so you can have time off?",
      "id": 119,
      "comments": [
        {
          "score": 15056,
          "content": "Heyy, don't be meddling in OP's marriage /s",
          "id": 120,
          "comments": [
            {
              "score": 6956,
              "content": "But we have a happy marriage and he babysits my kid while i cook him dinner…/s",
              "id": 121,
              "comments": [
                {
                  "score": 4758,
                  "content": "Was anyone else surprised by that?  I thought from the first most of the post she was a single mother.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 2770,
                      "content": "Honestly she sounds like a single mom… and instead of dealing with the source of frustration (partner), she expects everyone else to accommodate to her",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 811,
                      "content": "I did too and I still thought YTA! I’m a single mom of a 2 year old and I absolutely find time to do things with friends. Because I do that, my friends are also willing to come to mine and hang sometimes. It’s a fucking balance and a choice.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 276,
                      "content": "That’s what I was thinking too! I was really starting to sympathize with her because being a single mom is hard as hell but I’m sure losing your friends and support circle is even harder and I understood why she’d feel angry and betrayed even though she was being a tad bit unreasonable. \n\nThen she says she has a husband. There’s absolutely no reason why she can’t go out in the weekends every now and then.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "100% assumed she was a single mom until she mentioned “Tom”. But don’t meddle in her marriage!",
                      "id": 126,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "I was shocked when she mentioned a partner right at the end of the post. I was not shocked when she immediately snapped at the mention of him watching the kid so she could have a life. She reminds me of an ex friend of mine. She had 2 kids and an absent partner and was constantly complaining about how hard it was to be a parent. But when anyone pointed out her partner should be more involved, she got defensive and actually said I was \"unreasonable,\" for stating I expected my partner to be involved in childcare when I have kids. OP, please note EX friend.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Nope, you’re not the only one. The “I’m a SAHM” made me assume initially that she must be married and her husband works, but by the time I got down to the part about her partner, I was thinking “oh, no, she must just be a single mother and lives off welfare/disability/at-home odd jobs?” I was definitely thrown to see the part about her “partner”.\n\nI’d be interested to know how often Tom is able to go out with his friends.",
                      "id": 128,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 54,
              "content": "The AITA poster who [ditched his wife for a four day ski trip with his friends](https://www.reddit.com/r/AmItheAsshole/comments/zizduk/comment/izsxxgp/) would love a wife like this OP. Smh . THAT was a plot twist\n\nETA: added AutoMod Copy of Post since post was removed and comments were locked",
              "id": 129,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "As soon as I read about that reply, a red flag went up. It sounds as though Tom isn't being a good partner or a good parent, and OP desperately doesn't want to address that fact. She certainly seems to overreact to the suggestion that he watch the kid for a few hours so OP can get out of the house for some adult interaction.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2638,
          "content": "The whole time I was reading I was assuming she must be a single mum since it’s too hard for her to even go out for a coffee. But no, turns out there is a whole other parent living in the household. \n\nAlso her whole thing of Mia works from home just down the road but doesn’t pop in during the day. Some people really don’t understand the whole “working” part of that statement do they?",
          "id": 131,
          "comments": [
            {
              "score": 842,
              "content": "As someone who’s worked from home for about a decade, no, a lot of people don’t understand that working from home is still work. 😆",
              "id": 132,
              "comments": [
                {
                  "score": 282,
                  "content": "I imagine it's very similar to the lack of comprehension people have for night shift workers. No one could ever seem to comprehend that my mom slept during the day and didn't want random visitors or phone calls unless it was an emergency",
                  "id": 133,
                  "comments": [
                    {
                      "score": 114,
                      "content": "Every time someone new tries to call me at 3pm while I'm asleep, I just call them at 3am and wake their asses up for a chat on one of my breaks. Works a charm every time.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I got this attitude, but covid made wfh more common. So I get more understanding now.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 930,
          "content": "Sounds like the kind of guy to consider taking care of the kids \"babysitting\" aka an absent father",
          "id": 136,
          "comments": [
            {
              "score": 692,
              "content": "Or she's one of those mums that turn parenthood into their personality.  I've seen it with some of my own friends, they martyr themselves for their children and \"couldn't possibly ask hubby to do something for the kids - it's MY job!\"",
              "id": 137,
              "comments": [
                {
                  "score": 188,
                  "content": "YES. From the title, my first thought was, \"do you make time to do anything without the kid?\" And shock, she doesnt!\n\nI am a parent, and i still cant stand when someone only has their kids to discuss. Same with a job. It is boring fast.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Oh my God, those people who make their kid(s) their whole identity, and can't talk about anything but their kid(s) anymore and sometimes maybe about chores, are so exhausting (and let's be honest boring). And then they complain people don't want to spend time with them anymore when they should be appreciated a lot more for being a [martyr] parent. I want to shout at them: *Of course they don't want to spend time with you when you don't exist anymore, your own personality, intrests disappeared and all is left is a childcare robot/slave.*\n\nSame with those who don't go anywhere without their kids: *your friends want to spend time with you and not with your kid. They are your friends, not your kid's friends.* Having the kid around every now and then is one thing. But all the time? No, thanks.\n\nIn my experience a lot of parents when you ask them how they are, they start to talk about how their kid is and don't say anything about themselves... *If your friends ask about you, they want to hear about you.*",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Or a possible third option: I got big flashback vibes to a kid I was friends with whose mom used the kids as a sort of cover for her agoraphobia. Had a complete meltdown when the kids started moving out, but simultaneously blamed them their whole life for why she (or the kids) couldn’t go anywhere and everyone always had to go to their house. \n\nMy mom kinda tried to be friends with her but when my dad died she wouldn’t let either of us come over to their house anymore - “I just can’t stand even looking at you because it’s so sad” was roughly what she said. So needless to say lady had some issues. It was so absurd that my mom actually burst out laughing and she was the one with a dead husband!",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Came here to say this!!! If OP is so inundated with housework and child care that she hasn’t been able to make time to go out for a year and a half, that is absolutely a problem a single mother might struggle with. Considering OP isn’t a single mother, as I assumed until the 11th hour when Marital Issues showed up with a steel chair, it is a glaring problem- I’m not trying to assume anything, but given the facts provided, one of two things is happening- either OP is so cut off from support that she doesn’t realize it’s a problem, or OP has pushed away anyone who might support her because she can’t trust anyone else watching her kid… including her husband. But, that’s just me meddling!",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Yeah seriously sounds like OP hasn't gotten a break in 2 years? Not even to grab a coffee? I get that she's growing resentful, she is taking it out on the wrong person and she gets the YTA vote for that, but if she hasn't gotten a break in that time I can also understand that she's not being rational right now. I would have gone insane",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13996,
      "content": "YTA she didn't ditch you on Saturday. She invited you to come with her and her other friends, meaning she had already committed to going out with other people. If she had come to yours for drinks, she would've been ditching her other friends.",
      "id": 143,
      "comments": [
        {
          "score": 8854,
          "content": "I like how OP reframes this as Mia ditching her, when they hadn’t even made plans — Mia was actively attempting to INCLUDE her in plans she’d made with other people.\n\nNewsflash, OP. Mia just wants to have a normal social life that occasionally happens outside of your house. It’s not her fault you aren’t willing or able to ever leave it. Sounds like she’s been coming to you for years, while you’ve put zero effort into meeting her halfway.\n\nWhen Mia invites you out, you claim you “don’t have the time,” but a couple paragraphs later you also claim you’re “always available.” Which is it, OP? Kinda seems like you’re only available to do what YOU feel comfortable doing, but can’t ever be bothered to make yourself available to hang out on Mia’s terms.\n\nHave you considered that *you* might be the shitty friend? That what you’re asking of Mia is selfish and unfair? Popping a kid out doesn’t make you the center of the universe. Hire a damn sitter or get your partner to step up and care for the kid every once in awhile so you can leave the house and maintain healthy social relationships that don’t entirely revolve around your kid.\n\nMake no mistake. It’s YOU that’s failing to make time for Mia. Not the other way around. YTA.",
          "id": 144,
          "comments": [
            {
              "score": 1483,
              "content": "This. A childless person typically doesn’t want to give up that lifestyle just because their friends have kids. Expecting otherwise is naive and self-centered.",
              "id": 145,
              "comments": [
                {
                  "score": 254,
                  "content": "Oh, I think OP has “self centered” down to a science. I honestly don’t think it occurred to her that her friend is allowed to have a life of her own. She fully expects her friend to accommodate her and only her.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I just ended a seven-year friendship due to someone not wanting to hear her decision to have a child doesn’t obligate the rest of us to accommodate her exclusively for the remainder of our lives. She’d always been very self-absorbed, but pretty much once she was pregnant, everybody else’s respective needs and wants became totally forfeit because of “the baby.” \n\nIn example, early into her pregnancy, my husband and I invited her and her husband to join us for dinner out. She objected to the Mexican restaurant I chose (a place she likes) which is renowned for good drinks because she didn’t want to deal with an entree that has beans and actually said to me, “Can’t you just pick somewhere that doesn’t have good drinks? Because the baby doesn’t like beans.”\n\nKeep in mind that not only were we picking up the check (because we always did) but more importantly, the whole point of this dinner was celebrating that I had landed my dream job. My husband reminded her that the dinner was about me, not her, and she could just ask for beans to be held. She was a moody asshole for the rest of the night because she wanted to got on the expensive sushi restaurant instead and we refused to budge.\n\nIn hindsight, that proved to be quite a preview of things to come with her entitlement and expectations.\nThe last two years have involved lots of “talks” about what a lousy friend I am because of how my career and health have interfered with my commitment to her and the baby.\n\nIt’s been two months since I iced her out and I don’t miss her at all. I’m a mother myself and think parents like this are fucking ridiculous.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "Was going to say something similar. OP is making Mia’s childless life very much the exact opposite.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Yep. And I think the 'goes out drinking like she's still 20' part shows exactly how much she expects everyone else's life to change just because OPs has",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Cannot agree more! The people with kid couldn’t imagine the people without kid. They just wanna a normal adult social life! That’s it. And sounds like Mia is more careful than OP in front of kid. I don’t feel comfortable to drink front the little kid either. Definitely, as a best friend, OP never try to understand her friend. It is pathetic. It has been two years, OP needs grow up!",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I agree, me and my now wife had our 1st kid at 20 (in the uk) while all of our friends were still going out drinking every weekend and we took it in turns so each of us could go out once a month with our friends while the other looked after the kids. I loved my boys nights with the 1st and then the 2nd born 2 years later while she went out and had fun, and all our friends understood we wouldn't be out as much as them but that didn't matter",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Pretty sure OP is insanely jealous that she feels she can’t go out and is projecting on to Mia.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "This. Honestly the whole post is a bit creepy, like OP thinks Mia must be her property.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Mia also just called and asked her out for coffee when this happened.  Seems like Mia is always reaching out to make plans, just not always in the setting OP would prefer.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Also, it’s pretty understandable to me that Mia doesn’t want to have a few drinks around OP’s kid…",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1878,
          "content": "_\"Normally, I would expect her to call by now with apologies.\"_\n\nI found this line very telling. OP picked this argument, but just expects her friend to apologize. OP wants this friendship to be on her terms and she wants to hang out on her terms. The baby isn't the issue - OP is.\n\nOP isn't tethered to her house and she has a spouse. Not once did she say she made an effort to see her friend. Not once did she make an effort to make plans. Not once did she make an effort to do something that both of them found enjoyable. OP just wants her friend to come to her....",
          "id": 156,
          "comments": [
            {
              "score": 313,
              "content": "This was the big thing for me too. Do you always expect others to call and apologize when you get into an argument? Does Mia always cave and apologize for everything? Sounds like she’s been catering to OP for a year by hanging out with a baby for a year just to keep the friendship going. \n\nOP has to leave the house sometimes to hang out with friends or go to date night. It’s healthy for her, her friendships, and is good to model for her kid.",
              "id": 157,
              "comments": [
                {
                  "score": 21,
                  "content": "This! As I was reading I was actually shocked by the amount of effort friend was still putting in at this point. I’d have expected her to stop calling/trying awhile ago. She’s been so thoughtful and kind and just got stomped all over, I’d be fed up too.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1102,
          "content": "Personally I'd be grateful for a night out when I can talk without \"mummy I need my bear!!\" To be myself, find my identity, not just Mr 4's mummy. It sounds like OP might be struggling with that?",
          "id": 159,
          "comments": [
            {
              "score": 481,
              "content": "For some women, that *is* their identity. Hashtag boy mom!",
              "id": 160,
              "comments": [
                {
                  "score": 41,
                  "content": "Omg this. It's repulsive and terrifying. How does someone just yeet their own personality and self out the door.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Some people's personalities never fully realize. They're captain of the swim team, they're a tri-delt, they're a party girl at all the best clubs, they're planning the most romantic wedding, they're a blissed-out newlywed, and then they reach the \\#BoyMom multi-year waystation. Or \\#MotherhoodUnplugged or whatever the mom flavor of the week is. Then they either develop a deeper sense of self as the kids age, or hang onto it until they can roll it into a grandma identity. There's nothing wrong with any of this, per se, it just means that their best companions are gonna be other people who are also eyeballs-deep in that one-note personality. However it can go wrong, as we see with OP. Unfortunately OP expects her mom identity to supersede all other factors, and won't meet her friend halfway.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 247,
          "content": "WTF *was* Tom doing Saturday night?!?",
          "id": 163,
          "comments": [
            {
              "score": 35,
              "content": "They're in Manchester, FIFA world cup is on and as of last weekend England were still involved, so there's a decent chance he may have bumped into Mia on her night out...",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8637,
      "content": "YTA,\nAlso the \"Not to meddle in your marriage\" what are you on? He's a parent who can, ya know parent. It is not healthy to never socialise without your child, it's good for both of you.\n\n*edit typo",
      "id": 165,
      "comments": [
        {
          "score": 2114,
          "content": "[deleted]",
          "id": 166,
          "comments": [
            {
              "score": 224,
              "content": "This was the part that stuck to me the most. It seems like OP is angry at her friend for living the life she would be living too if she was childless.",
              "id": 167,
              "comments": [
                {
                  "score": 46,
                  "content": "She said it herself, Ciara was an accident. OP would 100% be doing everything Mia is doing if she had just used protection. (I'm not trying to be mean to the baby. I'm just making an easy joke.)",
                  "id": 168,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Like just look at her username!",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "It reeks of envy and resentment doesn't it?",
              "id": 170,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1251,
          "content": "And who *can* say this kind of stuff if not your closest friend? “Why can’t your husband parent your child?” is a totally in-bounds question for a friendship in my book.",
          "id": 171,
          "comments": [
            {
              "score": 637,
              "content": "I was thinking this too. She's probably deflecting because Mia hit a nerve.",
              "id": 172,
              "comments": [
                {
                  "score": 130,
                  "content": "Ding ding ding, we have a winner.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 182,
              "content": "Exactly. Your Best Friend definitely has a pass to “meddle”. She has to call you on your sh*t because who else will?",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "Worst part is that nothing says that he CAN'T. OP never even said that she brought it up to him. She just deflected it right away.",
              "id": 175,
              "comments": [
                {
                  "score": 29,
                  "content": "I assumed she was a single mom. Knowing dad is in the picture??? Ohhhhh boy.",
                  "id": 176,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Yeah OP if youre reading this YTA. I bet the Tom gets plenty of alone time and time out with his friends. You should be able to leave him with the baby so you can as well.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4845,
      "content": "YTA. When you have a child, they are the most important person to you. BUT, that doesn’t mean that they are the most important person to everyone else. Your a SAHM, that’s your choice, and it sounds like Mia has tried really hard to be accommodating, but for Christ sakes, it’s been two years of her doing things your way. She didn’t ghost you or be rude, she suggested having your husband, the FATHER, watch your child so you can hang out and you yell at her an accuse her of meddling in your marriage? Girl, there’s a lot of issues in your marriage in that statement alone that your not posting on here. Don’t blame her for finally having enough and calling you an asshole cause you are acting like one. Don’t expect her to apologize cause you don’t deserve one. You want to keep this friendship, you talk to a therapist cause you’ve got some issues, and when you are mature enough to have an adult conversation, call Mia and apologize.",
      "id": 178,
      "comments": [
        {
          "score": 577,
          "content": "Makes me wonder if it’s not entirely the presence of the kid, but that she’s also uncomfortable around the partner.",
          "id": 179,
          "comments": [
            {
              "score": 705,
              "content": "All they do is go to OP’s house. That’s it. It’s always at OP’s house. Sounds like Mia just wants to do something else.",
              "id": 180,
              "comments": [
                {
                  "score": 209,
                  "content": "Right.. like, I have a friend with a pretty sweet kid-free house, and even still I don’t want to only go to theirs for the rest of our friendship. By the 4th time I’d have to be like “nah, I’m actually feeling like going out and doing something fun today”. \n\nAnd my friend would probably say “oh true” instead of yelling at me about it.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 21,
                      "content": "My ex would always have a reason or sometimes an excuse to never hang out at my shared apartment, even when the flatmates weren't there, and it would usually take a lot of convincing just to get him to stay an hour after classes (my apt was literally 2 min away from the university, whereas he was almost an hour away), let alone spend the night sometimes.\n\n\n\nEvery time, he'd do just like OP and find one excuse or the other, and always say \"but you can come here [a.k.a. his parents' house] if you want to, you know you're always welcome!\" well thanks, but it shouldn't always be me to make an effort — especially when that meant I would spend an extra hour getting to university and another to come back, whereas if he stayed at my place he'd SAVE these hours of transport. But no, it always has to be me because he didn't really want to leave the comforts of his family home (tv, videogames, mom's cooking)... guess why I broke up with him?",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I haven't hung out with someone that used to be my best friend in so long because I hate her wife so much. My friend is always attached to one of their kids. She's never come to my house, she's never able to go somewhere, because her wife can't be bothered to watch their kids for a few hours. Between the kids and the wife, it's an absolutely miserable time.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "I have a friend whose kid is 3 years old now and still only wants to hang out if I come over to her place, or if we do go anywhere (rare), it has to be kid-friendly. The kid is 3, almost 4, and she still doesn’t leave him with his dad. It’s frustrating for sure.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "I already thought OP was a selfish AH when the post sounded like she was a single parent. But WTF, you have a second parent and STILL demand your friend only come to your house to hang out with you and child? Wow YTA!",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": ">YTA. When you have a child, they are the most important person to you. BUT, that doesn’t mean that they are the most important person to everyone else. \n\nThis, in a nutshell 👌",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4105,
      "content": "YTA. You refuse to do ANYTHING outside the home. She asks you constantly. You're evidently working on being a helicopter mom. At some point you need to leave the home and do something without your child. It's better for both of you.\n\nAnd you ditched her. Not the other way around.",
      "id": 187,
      "comments": [
        {
          "score": 1116,
          "content": "And Mia has kept inviting OP to stuff for 18 months. She's been a good friend! Kept her in mind, invited her to a range of activities, not given up over that time. And then gets yelled at for it.",
          "id": 188,
          "comments": [
            {
              "score": 606,
              "content": "Frankly, I think this is the death knell of their relationship, even if OP pulls her head out of her ass and apologizes. I would not want to stay friends with anyone who felt justified in yelling at me because they declined my invitation and I had the *audacity* to still go out and have a good time.",
              "id": 189,
              "comments": [
                {
                  "score": 123,
                  "content": "And she wonders whether she was being ‘a bit too harsh’ in her delivery. Lol. OP just gave Mia a reason to throw the whole friendship away.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "THIS!! It's like it's the worst crime in the world for someone to not have their entire life revolve around their kid. I'm sorry, but even if my friends that have kids can't go do something because something is going on, THEY extend an alternate date of when they're able to get a sitter for another activity. \n\nNow, a lot of the time, myself and others, absolutely do not mind spending time with people who have kids, but that's because they never demand us to constantly only hang out at their place. Cuz, ya know, that's how friendships should work.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I think it's possible to salvage with a bit of self awareness.\nBut the comment at the end about how she was expecting her friend to apologise by now makes me think she won't turn this around.\n\nCrazy how she was so enraged about her friend going out too. I thought she was going to say something more reasonable like she felt a lil jealous or something.",
                  "id": 192,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 164,
              "content": "This is what I keep going back to! Mia invited her out constantly to a variety of different things! Don’t want to drink? Let’s go for coffee! With other friends, just the two of us, literally anything outside your home.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": ">Mia has kept inviting OP to stuff for 18 months.\n\nMia did an amazing job continuing to include OP in her life, inviting her out and not taking a \"no\" as a \"never\" but understanding that just being invited can be a lovely thing. However, OP acted like Mia living her own life was some kind of insult. \n\nI was also laughing at OP's parenthetical \"(Mia likes to swear)\" Like, yeah, Mia is an adult and uses adult words!",
              "id": 194,
              "comments": [
                {
                  "score": 13,
                  "content": "Right?? When I was super busy in school and my friends would ask me to hang out, after a couple of months of me always declining, they kinda stopped asking me and I totally get it. Mia kept inviting OP over and over again, she's a rockstar!",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Yeah this is unheard of for someone to keep trying for this long. When I get busy or tired and can't go out when people ask I always try to either say yes to the next thing or invite them to go do something to make up for it.   \n\n\nYou say no too many times and it sounds like you're making excuses to blow them off.  In other words, OP is the one blowing Mia off and she's still continued to try and be understanding about it for over a year.   \n\n\nMia's an amazing friend and it makes me sad that OP doesn't appreciate her.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2813,
      "content": "YTA. She’s trying to stay engaged in your life, but you only want it 100% on your terms. She’s not wrong for wanting to go out and have adult evenings out. Hire a sitter or ask your husband to take over for the night and join her. You were rude and out of line with her.",
      "id": 197,
      "comments": [
        {
          "score": 638,
          "content": "So many threads about “my group is freezing me out!” Could listen to this. Plenty of people enjoy meeting their friends out, once it becomes “my house or bust” then it gets way harder for to keep that relationship going because it really feels like one sided effort.",
          "id": 198,
          "comments": [
            {
              "score": 65,
              "content": "Agree. There’s this girl I know and she doesn’t have kids or anything but she always wants to hang out at the house and not her place but someone else’s place. She’ll hardly ever go out when she’s invited or she’ll be complaining the whole time. Needless to say, that’s why she never became a friend. It’s impossible to maintain a relationship with these kinda people.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I had a friend who never planned any “meet up” so I just made it easy and picked a different nearby restaurant everytime for easy chats and drinks. My friend made a passive aggressive comment about not liking being at the restaurant every time we hung out. \n\nSo we are no longer friends since I was giving all the effort and she didn’t appreciate or plan it herself.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Friendships, just like marriages, require effort from both parts. If someone calls you once, twice or even a 3rd time and you always say \"sorry, i am not going\", one time they will stop calling you, you stop contacting them and the friendship begins to fall apart. If that person is making the effort of calling you to have a drink, go to their birthday party, go to a new cafe that just opened but you never once say yes and go, one day they will give up and get tired of your \"No\"s.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 214,
          "content": "Yeah, like...most people understand that the nature of friendships may change when one or both parties have kids, and it sounds like Mia has tried to be accommodating of her needs, but I'm sure OP pushes her to interact with her child while she's there, and if *every* get-together is just \"sit on my friend's couch while we play with the baby,\" I'd get frustrated pretty fast. And Mia is trying to include her in her plans! She wants OP in her life! And OP keeps meeting her with stubborn selfishness. So frustrating.",
          "id": 202,
          "comments": [
            {
              "score": 152,
              "content": "Yeah. I'm at the age where most of my friends have kids. There all SAHM and I'm the odd single one out. You want to be understanding and flexible but the home hangouts kinda suck after awhile. It really does end up with you two on the couch playing with the baby as she vents about her life. Or you're helping her clean while she vents about her life.",
              "id": 203,
              "comments": [
                {
                  "score": 68,
                  "content": "And when you're like \"maybe you should talk to them about this\" or \"you do nothing but complain about your partner, maybe it's time to consider other options?\" they get mad at you for trying to offer advice, right?",
                  "id": 204,
                  "comments": [
                    {
                      "score": 80,
                      "content": "YES. I just want to shake them by the shoulders and say HE WAS SHITTY BEFORE YOU HAD THE BABY WHAT MADE YOU THINK HE WOULD CHANGE AFTER YOU BECAME A SAHM AND GAVE HIM FINANCIAL CONTROL!?!?!?",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "!!! Went to a friend with a toddler’s house to spend time with them, she ended up distracted the whole time, naturally, because of the baby and house stuff. Which is fine, but the whole time we were trying to have a conversation and kept getting interrupted by the toddler, her husband was sitting in the next room on the couch, scrolling his phone. She made a complaint under her breath about it, but I’ve known this girl for 9 years and I know if I so much and suggested her husband come get their sniveling kid out the kitchen, she would have been furious. He’s “the best daddy/husband in the world” that I hear complaints about every god damn day. \n\nI wish she would take it as the “you deserve better than this” that it is, and not as a “let’s shit on your marriage” thing.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I don’t have kids but several of my close friends do. I fully understand that logistically it’s easier for me to go over to their houses to hang out and I’m happy to do that a lot of the time. But they ALSO take turns watching the kids so one of them can go out, they bring their kids with them sometimes, they get babysitters sometimes and we all go out. They’ve really made an effort to maintain their friendships through parenthood and I completely appreciate it and I’m happy to do what I can to make their lives easier. But if the *only* time I ever got to see them was if I went to their houses, I’m sure I would be just as upset as Mia is.",
              "id": 207,
              "comments": [
                {
                  "score": 14,
                  "content": "Yes, same! I've ended friendships because they suddenly couldn't do anything without towing their new partner along, so I wouldn't hesitate to end one if after almost *2 years* they've never made an effort to meet me outside of their home or without their kid. All adult relationships are reciprocal.",
                  "id": 208,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "There's a VERY different vibe between \"let's go out and have drinks\" and \"pop round to mine and drink\" especially if the other parties involved aren't good friends with OP. I think her expectations are super unreasoanble here and she's at fault for her own isolation/being left out.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1672,
      "content": "You've made your entire friendship with Mia be about your kid and completely failed to acknowledge her POV or emotional needs. This is on you for neglecting the friendship, which REQUIRES time without a toddler around.\n\nYTA",
      "id": 210,
      "comments": [
        {
          "score": 52,
          "content": "YUP.  OP needs to realize that its healthy to go out and have a bit of quality time and fun with BFF's without her child.  Instead demanding every interaction with friends has her daughter included. SMH.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1157,
      "content": "Yes YTA!\n\nYour friend is not obligated to be around kids just because you had a child. It's not like she ignored you. She invited you out multiple times. Your entitlement that she should always hang out at your house around your kid is wrong.\n\nAlso, yes, she can go out and drink like she's in her 20s again. Maybe you should try that sometime too, instead of insisting to drink around a small child which majority of the people are not comfortable with.\n\nEdit: Thank you everyone for so many upvotes! :')",
      "id": 212,
      "comments": [
        {
          "score": 44,
          "content": "Id like to add to this that since OP said dont meddle in my marriage if OP is dealing with financial troubles and thats the reason the father isnt home to take care of the baby or for her to go out with Mia then if they are besties she should mention such troubles so Mia can understand why she doesn’t want to go out… thats the only reason i think OP would be nta but i think once every few months for a coffee wouldnt hurt. Otherwise OP is definitely TAH",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": ">Your friend is not obligated to be around kids just because you had a child. It's not like she ignored you. She invited you out multiple times. \n\nNot only has she invited OP out, but she also comes over to OP's house. She just doesn't want to always have to do that and sometimes wants a change of pace and not be completely sucked in to accommodating OP's life. I could see OP being miffed if it was the other way around and her friend refused to ever be around her child, but it sounds like exactly the opposite.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}