{
  "post content": "EDIT: He also puts his tuna sandwiches in the toaster oven, which smells up the office. But he isn't bothered by that and no one bats an eyelash.\n\nOkay, so here's the deal. I recently cut out red meat from my diet for health reasons and have only been eating seafood. Many days, I would often bring vegetarian dishes to work but being that I also eat fish, maybe once or twice a month, I'd bring a piece of fish to have with a salad and bread. \n\nMy coworker and boss bring and warm up foods that I don't eat or don't like the smell of (Indian food, food smelling strongly of garlic etc.) but I'm not childish and I know that I won't have to eat their food and the smell will eventually go away, plus we have air freshener. \n\nToday, I brought a piece of salmon and a salad for lunch and my coworker (who also brings tuna to work) freaked out about how bad he hates the smell of fish. He literally left the office for like an hour even though I ate everything within 10 minutes and aired out the office and sprayed air freshener. \n\nHe then comes back and emphasizes again that he hates the smell of fish and how it made him feel like he was going to throw up and he got a migraine from it and had to take medicine. Then he had my boss use disinfectant spray to clean out the microwave. \n\nLet me reiterate, I VERY RARELY bring seafood to work. It's not at all an everyday thing, but I do need more substenance than a salad or grilled cheese some days. \n\nPlease (respectfully) let me know if I'm the ass hole.",
  "id": 1,
  "comments": [
    {
      "score": 13,
      "content": "NAH also you broke the unspoken rule of no fish",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "NTA. Your coworker is an hypocrite. If he whines about it again, tell him about all the times you put up with his food smelling.",
      "id": 3,
      "comments": [
        {
          "score": 2,
          "content": "Thank you 😂🙌🏾",
          "id": 4,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "[deleted]",
      "id": 5,
      "comments": [
        {
          "score": 4,
          "content": "For real. Like I get it, some stinky foods are very delicious, but you have other opportunities to eat them.",
          "id": 6,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "YTA for microwaving fish, seriously, this is common office etiquette",
      "id": 7,
      "comments": [
        {
          "score": 4,
          "content": "But he puts his tuna sandwiches in the toaster oven, which also smells up the office and he somehow doesn't get bothered by that. And even if I bring fish that isn't heated, he complains.",
          "id": 8,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "Bringing salmon in for lunch: fine.\nMicrowaving salmon in a shared office: YTA.",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "Microwaving salmon at all ;)",
          "id": 10,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH\n\nall of you, stop bringing stanky ass food to work. it's called common courtesy.",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "😂😂😂",
          "id": 12,
          "comments": [
            {
              "score": 2,
              "content": "no one wants to smell your fish lunch, karen",
              "id": 13,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA.  Sounds like you work with an asshole though.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA - You sure the coworker isn't 9? Tell him to grow TF up. Also the hypocrite eats tuna so what is he trying to get at?",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "My point exactly! I could understand if he didn't eat it himself but if he eats and enjoys tuna at work, why is it that my fish has to be prohibited..?",
          "id": 16,
          "comments": [
            {
              "score": 4,
              "content": "Because you microwaved yours and presumably he didn't microwave his tuna. Major difference. Here, you night want to post this in your kitchen. Also tell him you are sorry, you didn't realize how offensive the smell would be. https://www.glassdoor.com/blog/7-foods-to-never-eat-at-work/\n\nThis is just one of several links I could have chosen, by the way. I think there's pretty universal agreement on this.",
              "id": 17,
              "comments": [
                {
                  "score": 2,
                  "content": "Well he puts his tuna sandwich in the toaster oven and it does smell up the office. But nobody throws a fit about that",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It's called a grudge. I've been on Reddit long enough to see where this is going. Has he ever shown any signs, obvious or not, about a dispreference to you in specific? Maybe ask a friend to bring a similar fish to work that he will encounter and see the reaction (maybe tuna or the same as yours, depends on what your looking for)\n\nPersonally of you are friends with one of his friends try to get them to bring in the same type of fish as you. Call him out on if he's calm around it",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\nOkay, so here's the deal. I recently cut out red meat from my diet for health reasons and have only been eating seafood. Many days, I would often bring vegetarian dishes to work but being that I also eat fish, maybe once or twice a month, I'd bring a piece of fish to have with a salad and bread. \n\nMy coworker and boss bring and warm up foods that I don't eat or don't like the smell of (Indian food, food smelling strongly of garlic etc.) but I'm not childish and I know that I won't have to eat their food and the smell will eventually go away, plus we have air freshener. \n\nToday, I brought a piece of salmon and a salad for lunch and my coworker (who also brings tuna to work) freaked out about how bad he hates the smell of fish. He literally left the office for like an hour even though I ate everything within 10 minutes and aired out the office and sprayed air freshener. \n\nHe then comes back and emphasizes again that he hates the smell of fish and how it made him feel like he was going to throw up and he got a migraine from it and had to take medicine. Then he had my boss use disinfectant spray to clean out the microwave. \n\nLet me reiterate, I VERY RARELY bring seafood to work. It's not at all an everyday thing, but I do need more substenance than a salad or grilled cheese some days. \n\nPlease (respectfully) let me know if I'm the ass hole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "YTA. This is a very, very commonly-understood office faux pas. Same with popcorn.",
      "id": 21,
      "comments": [
        {
          "score": 2,
          "content": "Really? We eat popcorn in here all the time and it's never bothered any of us. My issue is just that he also eats and heats his tuna sandwich in the office and it doesn't bother him but he complains about mine.",
          "id": 22,
          "comments": [
            {
              "score": 3,
              "content": "You've written that comment out many times and are still not getting the point, so you're either trolling or being obtuse. Your co-worker is also an asshole. Also. You're the bigger asshole, because for some reason you're still not getting the fact that some smells \"cut\" through everything worse than others, and go beyond your personal distaste for them, because no one in their right mind could ever like them. Microwaved fish is one of those smells.\n\nCertain types of microwaved popcorn, yes. It's this stale artificial butter smell that starts off alright and then turns into something awful as it seeps through the entire office. Once again at this point I'm not sure I'm really talking to you, but to anyone who reads this and doesn't get what the problem could be, which is after all the purpose of this sub.",
              "id": 23,
              "comments": [
                {
                  "score": 0,
                  "content": "I kept writing that comment because I didn't include that in the post. I had stopped commenting that and just made it an edit on the post. Thank you for your comment and your point of view",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Yeah, wait until someone burns their popcorn.  That smell takes forever to go away, longer than reheating fish or Indian food.",
              "id": 25,
              "comments": [
                {
                  "score": 1,
                  "content": "I don't think anything could be worse than Indian food for us honestly 😭😭 my coworker literally won't come in the office for hours. But I understand.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}