{
  "post content": "I (23F)  got invited to my cousin's engagement more than 5 month back.I am not close to any of my extended family I see them maybe once in two three years.\n\nFive months back my mum ANNOUNCED I will be a bridesmaid at my cousin's wedding.I immediately said no . I was not close to my cousin.\nA) I haven't seen her more than once or twice in my entire life.  \nB) It was a huge financial commitment and I didn't have the money or inclination to spend anything \nC) I genuinely wasn't interested\n\nHowever,  my mother was really upset and soon my aunt got involved as well. I agreed when my grandpa called me and told me to do this for him and I wouldn't have to do anything besides show up. \n\nMonths passed and I soon forgot all about it until THE dress arrived . More specifically , my bridesmaid dress.It is hideous to put it lightly. It is shocking pink , has lace and multi coloured sequins BOTH. It is also one size too small so I look like a flat chested racoon . I am not a clotheshorse , I hate spending money on clothes and as long as it's comfortable I am okay with anything . But this was too much\n\nI would have sucked it up and done it as my dad put it but I'm the only bridesmaid ( the other two backed out ) and there are three groomsmen\n\nI suggested an alternate dress but was immediately shot down . The dress is big and poofy and the bride is wearing a really simple gorgeous strapless dress . Id look like Godzilla standing next to her\n AITA if I back out ?\n\nP.S. - My aunt paid for the dress and got really upset when I suggested wearing what I had .",
  "id": 1,
  "comments": [
    {
      "score": 265,
      "content": "ESH, but a VERY light YTA. You need to learn to stand your ground, make boundaries, and communicate about potential problems (like the size of the dress.) You're an adult. But your family shouldn't have guilt tripped you and bought something that doesn't fit, regardless of how ugly the dress is.\n\nDon't agree to stuff you're not willing to follow through with. Ugly brides maid dresses aren't exactly an unknown phenomenon and learn to shut family down when you're not interested.",
      "id": 2,
      "comments": [
        {
          "score": 34,
          "content": "I agree with this. You have agreed to this and need to go through with it. I also agree with what someone else stated in asking for a larger size or no go on that dress. I mean imagine if it were to rip from being too small? (😉)\n\nIn future, just say no and stay with no unless you want to be there, family guilt be damned.",
          "id": 3,
          "comments": [
            {
              "score": -3,
              "content": "\"You have agreed to this and need to go through with it. \" - She has ONLY agreed to show up.\n\n&#x200B;\n\nNot to anything else. And certainly not to wear the dress.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 106,
      "content": "Yta if you refuse, but simply say the dress is an 8 and I wear a 10, I will exchange it, or I will no-show.\n\nAll bridesmaids dresses suck.",
      "id": 5,
      "comments": [
        {
          "score": 77,
          "content": "I've never been to a wedding with ugly bridesmaid dresses. Only tacky brides choose dresses that's ugly on the bridesmaid.",
          "id": 6,
          "comments": [
            {
              "score": 7,
              "content": "OP says pink with lace and sequins....shocking pink.",
              "id": 7,
              "comments": [
                {
                  "score": 33,
                  "content": "Yes, and that means OPs cousin is a tacky bride. OP does not have to wear that dress or even go to the wedding.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 8,
                      "content": "OP says her cousin is wearing a \"really simple gorgeous strapless dress\", and also mentions that the other two women who were supposed to be bridesmaids have backed out. It sounds more like the bride deliberately picked a terrible dress so she wouldn't be upstaged by any of the bridesmaids, especially considering that she seems to have selected bridesmaids that were not close to her. (OP mentioned she is not close to her cousin, and I'm guessing that if the two other bridesmaids have dropped out of the wedding, they probably weren't the bride's BFFs... or at least aren't anymore.)",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Or she could get one in her size and go and put up with it for a few hours.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "No to all bridesmaids dress suck. I have been bridesmaids a few time and all my dresses were pretty. I can and have worn some to formal events after.",
          "id": 11,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "This, this, this. And if she goes she will find the courage to tell her cousin that she will cut her and her mother out of her life.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 40,
      "content": "YTA based on updates Info: where is your cousin in all this? Has she made any of the decisions so far?",
      "id": 13,
      "comments": [
        {
          "score": 22,
          "content": "This is all HER , her decisions - my aunt just executes",
          "id": 14,
          "comments": [
            {
              "score": 20,
              "content": "Then wear the dress as long as it fits, or choose not to be a bridesmaid. You have autonomy in taking part, but just because *you* don’t like a dress you didn’t have to pay for doesn’t mean you get to change it. That’s what she wanted.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 32,
      "content": "NTA. You were pressured into it to begin with and then they didn't bother to ask for your input on the dress you were going to have to wear. I bet the other bridesmaids backed out for the same reasons.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 30,
      "content": "Let this be a lesson to you. Always say no to anything wedding related (and hold ground). Make it a blanket rule in your life and you will thank me later.  \n\n\nAs for this one you already agreed. It'll be one crappy day and no denying it. But you're doing it for Grandpa right?  \n\n\nIf you wanted you could lean into it and make your hair and makeup as monstrous as the dress sounds.   \n\n\nYWBTA (a little)",
      "id": 17,
      "comments": [
        {
          "score": 6,
          "content": "I agree this sucks and it has happened to me way too often to count but once you commit you have to suck it up and pull through. Two of the most vital lessons I've learnt as an adult, never underestimate the power of standing your ground and knowing when to take the L.",
          "id": 18,
          "comments": [
            {
              "score": 0,
              "content": "She has not comitted to anything but showing up on the day.\n\n&#x200B;\n\nShe can do that in any dress she likes.\n\n&#x200B;\n\nAnd it is fine to drop out, too.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "But she has not agreed to anything but to showing up.\n\n&#x200B;\n\nSo she is fine to show up in a beautiful dress, looking stunning. Which she should do. Or drop out.",
          "id": 20,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "If it does not fit, you must not wear it.  End of story.  \n\nStart there.  Don't volunteer to lose weight.  Don't agree to lose weight.  Make your Aunt buy you another dress, do not volunteer or agree to pay for it yourself, and PRAY that it does not fit either.\n\nDo not comment on how the dress looks.  Focus on hit fits, or not.  You will not win on the looks discussion, but you might win on the fit discussion.\n\nWhat I am suggesting is petty.  VERY petty. But in this situation, I think petty is called for.",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 20,
      "content": "Wow. Can kind of see why the bride needed the family to secure her a bridesmaid. Skip the middlemen(people) and tell her that you'll stand up with her for her wedding only if you can wear a simpler dress. (flat-chested raccoon, lol) NTA",
      "id": 22,
      "comments": [
        {
          "score": 4,
          "content": "All of this! OP agreed to be a bridesmaid, not to look ridiculous. Clearly there’s a reason the other bridesmaids dropped out. OP should agree to stay in the wedding if she doesn’t have to wear this hideous ill-fitting dress. The family trying to force her to wear it are TAs.",
          "id": 23,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "What does the BRIDE want? I only seem to see other people's opinions in here",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "Exactly. It's her day. OP needs to put aside her opinions with this and ask the Bride.",
          "id": 25,
          "comments": [
            {
              "score": 4,
              "content": "No No No. Ugly bridesmaid dresses are something no one should be forced to wear. Too bad more bridesmaids don't say \"no.\"",
              "id": 26,
              "comments": [
                {
                  "score": 0,
                  "content": "I'd just say no to being a bridesmaid then. I mean how ugly can these dresses be?",
                  "id": 27,
                  "comments": [
                    {
                      "score": 2,
                      "content": "google wedding photos and you'll see!",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "NTA. Honestly, it sounds like you're being purposely humiliated (there's a reason the other maids dropped out, eh?)  You're 23, a grown woman, why are you letting these people force you into doing something like this? \n\nCall your grandfather and explain the dress is ugly and the wrong size. If he wants you in the wedding he needs to step in and fix it (or buy you a dress, since he's the only reason you're doing it.)",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA. You're allowed to say no to being a bridesmaid. Your cousin deliberately chose a hideous dress to make you look ridiculous, it's not like that's just her taste. Your family shouldn't have pressured you to accept in the first place. I think it's bs that people think you should wear a hideous 80s prom dress that doesn't even fit because \"you already said yes\". Tell the aunt that if she wants you in the wedding party you need a dress that fits, then take a nice dress to change into after the ceremony.",
      "id": 30,
      "comments": [],
      "relation": "Support"
    }
  ]
}