{
  "post content": "\nMy partner has just come out of hospital after a 2 week stay in intensive care. We were visiting his family abroad (staying at his mums) when he became unwell. We have been here almost a month now when we only planned on two weeks.\n\nI have an almost 4 month old son who is exclusively breastfed so very much dependant on me. We were also unwell during this visit, which was frightening, exhausting and expensive as we needed some medical care. He is also having some sort of sleep regression so I'm only getting 1.5hr stretches of sleep at a time.\n\nEvery day I went to the ICU for two hours (between feeds) to do some of my partners personal care as he didn't let the nurses do it. This involved feeding my son in the hospital, rushing to ICU, donning protective clothing, tending to and reassuring my partner, then rushing back out when my baby began crying with his grandma. It was exhausting mentally and physically as I was still recovering myself, eating poorly through worry, breastfeeding and extremely hot on the ICU. \n\nMy partner is home now here and I think I might now be an arsehole as I've made the decision to fly home with my son on the 26th December. My partner cannot fly yet, drs orders. I'm sure my partner would like me to stay but I'm mentally and physically exhausted by these last few weeks full of worry, illness, sleep deprivation, back and forthing to the ICU and caring for my son single handed in a foreign country...in my partners mums home. \n\nMy partner will be here for an extra 3 weeks possibly longer undergoing rehab. I know he has missed me and his son while in hospital and it's been a scary experience all round. My son needs some medicine (not available here) and his second set of jabs in our home country which is part of the reason why I want to go home. But in all honestly I'm want home because I've been exhausted, scared and homesick...and now wondering if I'm a total A-hole for booking this flight.\n\n...........EDIT/INFO\n\nInfo: it's not a foreign country to my partner. It's his country of birth where the majority of his friends and family are. It's also where his long term Dr is.",
  "id": 1,
  "comments": [
    {
      "score": 127,
      "content": "Your son's health outweighs all other considerations. The fact that you really want to leave too is just making you feel guilty and like it's just an excuse to go home. But you need to take him home. \n\nTell your partner honestly how you're going to miss him and don't really want to \"abandon\" him, but now that you know he'll be okay you both need to prioritize your son. NAH",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 78,
      "content": "NTA. You're suffering from caregiver burnout. Your husband has been asking you to do the work of a nurse, a wife, and a mother. You're being worn down, and at this point you need to put your health first. If you collapse, who will take care of your child? Go home, take a breather, and get your son his medicine.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 40,
      "content": "NTA. Your son needs medical care that is not available there. The part about you having to provide care to your husband because he wouldn't let the nurses do it is confusing me. Why wouldn't he let the paid professionals take care of him? Especially knowing that you were caring for your new baby at the time?",
      "id": 4,
      "comments": [
        {
          "score": 21,
          "content": "Dignity. In his words he found it humiliating not being able to do any personal care for himself. He preferred me doing it rather than a stranger, even if they are professionals. To the point where prior to ICU he had already been in hospital 4 days and hadn't had any personal care done as he was too weak to do it himself.",
          "id": 5,
          "comments": [
            {
              "score": 60,
              "content": "That’s not dignity. That’s removing your dignity and making you subservient. You have a baby to care for and he made you do all that just for his enjoyment. God he’s an AH",
              "id": 6,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "That isn’t dignity, that is controlling. Perhaps toxic masculinity.  Totally AH territory, anyway.",
              "id": 7,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 20,
      "content": "NTA. \n\nHe’s being a child. He has another support system where he is. There is help, family, friends. Does it suck? Yep! For you and for him. But it’s a reality. He’s stuck there and realistically how long can you stay internationally with your child? You’re already weeks over.\n\nYou have an infant. You need access to their doctor. \n\nHe is likely projecting his misery over the situation on you because you’re an easy soft target for him.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "NAH\n\nDo what you need to to be able to be a good partner on his return, and a good mum.\n\nSafe travels!",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA, please take care of yourself & your son. I’m a new mom myself and it is the hardest & most exhausting time of my life right now. I can’t imagine having to also support a partner in the ICU.\n\nI can’t believe others are saying you are the asshole or that you should give up breastfeeding. Even if you stopped breastfeeding you would need to pump to wean and make formula bottles. It doesn’t somehow magically reduce the amount of work.\n\nI understand your husband is sick but he is now stable and recovering. His mother can help him. \nYou need to focus on you first so you can care for your newborn. You’re only 4 months postpartum and are still healing yourself and dealing with lack of sleep in someone else’s home. Go home and recharge so when your husband can come home you are not worn out.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Info:  have you even told him yet?",
      "id": 11,
      "comments": [
        {
          "score": 8,
          "content": "Yes, ofcourse. I waited till he was home to book it (after speaking to him) but I also floated the idea while he was still in hospital (out of the ICU and feeling considerably better).",
          "id": 12,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA needs of the child wins. Also, you have caregiver burnout. You also need to take care of yourself. Your partner has a support system beyond yourself. It is time for you to take care of you.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. He's at home with his mother and has people around he knows well, as it's his home country. He can recover there with their help. He needs to prioritize you and the baby *too*. \n\nYes its been a trying time for both of you but you've put aside your own and your baby's needs for as long as you absolutely had to until he was out of the woods, now he is and you need to take care of yourself and baby now. Husband should *definitely* think so too. Especially if baby needs care too including shots, you need to go. \n\nAlso husband is a jerk for making you work harder while there's people available at the hospital who's job it is to take care of him. If he wants to talk about dignity, talk about how having a baby/pregnancy affects dignity. He's a jerk. He should've taken you and your well-being into consideration BEFORE his stupid dignity. I'm sorry.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA, but have this conversation with your partner, not a bunch of strangers.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    }
  ]
}