{
  "post content": "I’m 27m. My parents were 18 when they had me and up until recently I had zero contact with my mom for the reasons bellow:\n\n1. She was a party girl when I was growing up so I was always watched by my grandma instead of her. Was obvious she wasn’t that interested in being a mom \n\n2. Cheated on my dad constantly behind his back since he was working so much\n\n3. This is the Major One. I was diagnosed with leukemia when I was 9. What did she do? Took off because it became too much and she couldn’t handle it. My dad was there for me every step of the way.\n\nI survived but that deeply messed me up for a long time. My dad was the best ever and he had me in therapy for a long time after to get over the hurt she caused. She didn’t come back, I finally got to a place where I didn’t care anymore and considered her dead in my mind.\n\nThe most surprising thing I learned recently is now *she’s* the one with cancer. My aunt told me it’s terminal and doesn’t have that long left. They’ve said less than a year but idk how long she’s had this diagnosis.\nEveryone in my family knows what she did.\n\nThe only person who stayed in contact with her was my aunt (her sister) and she tells me my mom has changed a lot. All she wants is to talk to me before she dies so we can have closure. I told my aunt exactly what I said in the title. \n\nI can’t see my mom and listen to whatever excuses she has when in my mind I’ve already let her go. There’s no point in bringing up old shit when I’ve moved on and if she just wants this so she could leave this earth with a clean conscience then I wanna see her even less.\n\nMy aunt didn’t like any of what I said. We did argue back an forth trying to defend my mom because she is full of regret and it’s important to find it on my heart to do this.\n\nShe’s telling everyone now and a lot of them are torn. Some of them get she did the same to me so I don’t owe her but others are being vocal about how I should be “the bigger person” and I shouldn’t be talking like that about her.\n\nThe sad part it’s family who I care about saying these things so it’s making me feel conflicted if I’m being an a-hole. Not that I plan to see her but Still these are people who saw what she did to me and are telling me I’m somehow in the wrong.",
  "id": 1,
  "comments": [
    {
      "score": 3777,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 1437,
          "content": "Yeah no, exactly, she abandons OP when he needs her the most, now that the shoe is on the other food she expects him to drop everything and be there for her?  To tell her it was FINE that she just up and left?  Fuck that, NTA. \n\nOP one of my favorite sayings in regards to people who have hurt me in my family is, \"It took me a long time to love myself enough to hate them.\"\n\nYou don't owe her your forgiveness.",
          "id": 3,
          "comments": [
            {
              "score": 456,
              "content": "Yeah, she wants closure before she dies, but OP is the one left alive to deal with whatever feelings she ends up bringing back. He's already mourned her loss once. OP has no obligation here and should do what's best for his own mental health. I mean, if a miracle happens and she survives somehow, will she put effort into having a relationship suddenly? She's had years to do it and only wants to now because she's dying. Actions have repercussions.\n\nEdited to add NTA",
              "id": 4,
              "comments": [
                {
                  "score": 86,
                  "content": "Well said.  He already mourned her loss once.  Repeat to everyone.  NTA OP.",
                  "id": 5,
                  "comments": [
                    {
                      "score": -5,
                      "content": "NTA\n\nBut....\n\nYou might regret it (not meeting her) at some point later in life, and then its too late. \n\nIm not saying meet and forgive, but consider if you might benefit from hearing her out, and maybe telling her how you hurt.\n\nJust..... dont be set in stone, just take some time and consider \"What do I need?\"",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "> She abandons OP when he needs her the most, now that the shoe is on the other food she expects him to drop everything and be there for her? To tell her it was FINE that she just up and left? Fuck that, NTA. \n\nShe was 27 more or less when OP got diagnosed with cancer and she left him...now OP is 26 and they expect him to be the bigger person to go meet her? \n\nLook op, you do you. Who knows maybe this really will help you!...or this will give you more issues than ever. I cant tell you for certain what will or wont happen. \n\nBut at an older age than what you are right now she left her *child* because it was \"too much\" and it seems like every one is now ok with that fact where as you're not being allowed the same courtesy.",
              "id": 7,
              "comments": [
                {
                  "score": 19,
                  "content": "OP is totally NTA, just wanted to say that this should be completely up to whatever OP feels. If it will help them feel better that they were the better person, so be it.\n\nThe mom clearly doesn't deseve it (or anything regarding her child), however consider that forgiviness is not about who deserves it, it is about who does it, and if that will help them let go of something negative.\n\nHowever if OP is strongarmed into it, or simply is not prepared or not interested, then they should simply not do it. Again to reiterate, forgiveness is usually quite a good thing psycologically, but the point is not \"validating\" or \"excusing\" the other person, it is to let go of the resentment yourself. It should be done when you are ready, not on someone elses timetable.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 13,
                      "content": "They can forgive her without having to see or speak to her. If considering her already dead is what allowed OP to let go of the resentment, then that’s enough. Hearing BS excuses after 18 years of nothing is only going to reopen the wounds and stir up fresh resentment.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "I really like that saying now that I know it exists. I might write something based on it.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "The only reason she even wants to “make amends” is that she is dying. If she wasn’t sick, she wouldn’t have made contact",
              "id": 11,
              "comments": [
                {
                  "score": 36,
                  "content": "She had 18 years to make amends.  She wasted her life and her time, and has to live with that fact for however long she has left. If she had “changed” at all, she wouldn’t still be so selfish.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 5,
                      "content": "This. If she'd really changed, she'd have sent her deepest regrets and abject apologies but said she expected nothing in return from them, not even forgiveness, because what she'd done is unforgivable.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "OP only even has the aunt's word that the mom even wants to make amends. She ain't so sick that she can't work a phone, if that's what she really wanted.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "\n>OP one of my favorite sayings in regards to people who have hurt me in my family is, \"It took me a long time to love myself enough to hate them.\"\n\nI didn't know just how much I needed to hear this today. Thank you.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "And Theyre saying \"don't do the same thing\" its not the same. Abandoning your child with cancer when they are only 9 is way different than not going to get closure from a stranger. (Which is what she is to op at this point)",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "\n >OP one of my favorite sayings in regards to people who have hurt me in my family is, \"It took me a long time to love myself enough to hate them.\"\n\nOMG, this!",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This quote is really great, it made me feel better about my own family situation. Thank you for giving me a new mantra to uphold!",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It’s not even turn about because she’s OP’s mom; she has the responsibility to take care of her kids. Walking out on a child is completely different than walking out on a parent to begin with",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "OP one of my favorite sayings in regards to people who have hurt me in my family is, \"It took me a long time to love myself enough to hate them.\"\n\nWhilst i entirely understand the sentiment behind this quote i just want to say that i believe Love and Hate to be two sides of the same coin. The coin being \"i feel feelings for this person\". I find a much truer and self empowering opposite of that coin to be \"i Have No Feelings for this person. So the true opposite of Love is Indifference. Just sayin and in no way meant to anyone as any kind of criticism.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 304,
          "content": "Also, why does OP have to be the bigger person? OP doesn't know that lady.",
          "id": 21,
          "comments": [
            {
              "score": 239,
              "content": "God, I really hate that expression. To me, being the bigger person is taking a small, or maybe not so small, step back to allow someone else less fortunate than yourself an opportunity that they otherwise couldn't achieve on their own. Not to let someone who shit all over you a chance to feel better about themselves at an emotional expense to yourself.",
              "id": 22,
              "comments": [
                {
                  "score": 129,
                  "content": "[deleted]",
                  "id": 23,
                  "comments": [
                    {
                      "score": 108,
                      "content": "I'm a 5'2\" (157 cm) woman, and when I get told to be the bigger person, I just squint up at them and ask for a step-ladder.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 53,
                      "content": "a yes. the infamous “bigger person” people keep telling me to be. we meet at last",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "It seems like you are always going to be the bigger person lol",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "If you get any bigger, you’ll hit your head on the ceiling.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "My older bro is 6'7\". He was a klutz growing up because he was 6'5\" by 6th grade (10-11 yrs I think). He said one time he was walking to school with his sisters (9th grade, so he was his full height by then. Also we share a mom, they share a dad), turned to walk backwards to talk to them. Said whatever he needed to say, turned around and ran smack in to a street sign. It's been so long since I've heard the story, I cant remember what kind but basically it was tall and he was just tall enough to go forehead first into it.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Love this! I’m totally going to steal it and use it for this book I’m writing",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "In these cases being the bigger person means very little more than being a floormat that gets walked over by everyone complaining..",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "OP's already the bigger person. He's got a ton of shrinking to do to make this competitive.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 227,
          "content": "u/conflictsnstuff, this is really the heart of the issue. She wants to talk to you because SHE is dying, SHE feels bad, SHE wants closure. She's still the same selfish person she's always been - none of that is about you. \n\nTell your aunt that if she genuinely cared about you and was truly remorseful for how she treated you, she would accept what is best for you instead of trying to push herself on you. She would understand that she's not entitled to your forgiveness. Instead she's now got your entire support network in an uproar pushing you to give her what she wants so SHE can feel better.\n\nSay no and stand your ground, if that's what you want to do. Nobody is entitled to your time and attention, especially not in a situation where it may unravel some of the extremely hard work you had to do to deal with her in the first place.",
          "id": 32,
          "comments": [
            {
              "score": 34,
              "content": "Exactly. We all know if she wasn't dying, she would still be no contact with OP. She wants to try to \"make amends\" with OP so she can die with a clear conscious.",
              "id": 33,
              "comments": [
                {
                  "score": -15,
                  "content": "Sometimes you start a journey of change and think you'll have time to make amends. Sometimes things happen and time is more limited than you planned.\n\nOP is NTA, but have some compassion. You say you don't need closure but the wounds don't sound closed yet.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 9,
                      "content": "OP was in therapy do help him through what his egg donor did. She abandoned her son at the scariest time in his life. He's let her go. He doesn't owe her anything, nor does he want to hear what she has to say.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": ">You say you don't need closure but the wounds don't sound closed yet.\n\nTrauma is very difficult to just \"get over\", and we should normalize people still having wounds. Some things will hurt for a long, long time. That does NOT mean that OP is obligated to see their mother, or that what type of \"closure\" the Mom wants would even be helpful to OP. It might just harm them further. *Compassion* is allowing victims the space to heal in whatever way *they* need to heal, not kowtowing to the abuser.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yup. The aunt is insisting that the mother has changed, but how she's acting makes it pretty clear she's still the same selfish person as before.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I agree.  This isn't about him at all.  She had 18 years to reach out.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Also tell all the flying monkeys that they are welcome to go there and kiss her a... backside.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "If a stranger with cancer wanted to speak with me, I’d expect a letter or email from that person.\n\nOP, next time this comes up, ask your aunt to have her sister put her thoughts down in a letter and you promise you’ll *consider* reading it once you have it in hand.\n\nYou don’t have to read it and she can have her closure. If you do read it and it moves you, you can take whatever next step you choose. If the letter is weak tea, well it won’t be better in person and you have all you need to know.\n\nYou can always trash or burn the letter, too, without reading it. Anyone asks? Tell them the letter was personal between a mother and her son.",
          "id": 40,
          "comments": [
            {
              "score": 50,
              "content": "I love what you've said here!\n\nSoooo she allegedly wants closure, but won't make any attempt to contact OP herself? She could write (or dictate) a letter and give it to the sister to give to OP, she could record a video or audio message or something along those lines. Instead, the selfish (sounds like a straight-up narcissist) egg donor sees fit to send extended family to act as her \"flying monkeys\" to attack OP for not giving her absolution. As someone else pointed out, it seems like the aunt is also looking for absolution.\n\nOP, consider this person's suggestion and tell your aunt to tell your egg donor to put it in a letter and you'll decide whether it's worthy of your time and emotional effort.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "☝️This. It forces her to give, not take from you and places you back in control",
              "id": 42,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly!",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I wouldn't give her that. She deserves nothing from OP. She's nothing more than an egg donor.",
              "id": 44,
              "comments": [
                {
                  "score": 16,
                  "content": "OP isn’t giving her anything. She writes the letter. He doesn’t ever have to read it, puts to bed the criticism from his relatives and can go on with his life. He doesn’t even acknowledge he’s her son - read my last sentence carefully.\n\nThis allows him space to maintain his emotional distance without butting heads and that will bring relief to OP. Other person’s emotional journeys remain their own.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I mean as in give her the satisfaction that she wrote a letter to OP to give herself a clear conscious.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "personally, like you, i wouldn't want that.  my main concern is OP's well being.  Last thing that anyone likes is unnecessary trauma shoved at them from the past, which has already been resolved.  I wouldn't give them an inch.  they know better than I that life is short.  Spend it with those who had quality to the remaining, not with those that will mindfuck it for their own personal gains.\n\n&#x200B;\n\nThen again, I'm no professional.  Call me strange, but I just don't like manipulative relatives under any circumstances, MLM schemes, and religious cults.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "excellent way for everyone to meet half-way. \n\nmy BFF's mother did that, and my BFF wrote to me in a weird state of indecision before finally burning the unopened letter away in a way worthy of a Brontë novel. She's now moved and not given any of her family her new address. Clean break. No regrets.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "it's actually a very good idea !",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Totally agree. Aunt can't decide who needs closure and who doesn't, who has it and who doesn't, that's for OP. However, I'd like to bet the Aunt feels guilty and deep down is hoping OP forgiving her mother will give her absolution too.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "People are happy to open others wounds for the sake of healing their own.",
          "id": 51,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "If it’s so important to her, why hadn’t she reached out instead of her sister?",
          "id": 52,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "It amazes me how people can be that self-centered. Mum probably thinks she’s being reasonable.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yup, NTA",
          "id": 54,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Exactly, it's closure for her that could potentially leave OP with a brand new psychological mess to deal with. But she's not worried about that because she'll feel better and then she won't have to worry about it anyway.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1176,
      "content": "I hate when people say we have to be the bigger person after a person was so crappy. It’s good she has regrets but I think it’s more about her than you. Your mom made choices and so did you. Instead they should be the bigger person and respect your choice",
      "id": 56,
      "comments": [
        {
          "score": 458,
          "content": "[deleted]",
          "id": 57,
          "comments": [
            {
              "score": 157,
              "content": "I said exactly the same thing in a post a month ago, it’s just about you pretending the other person admitted they were wrong while you still do what they ask. Your are NTA OP to paraphrase Yondu “She may have been your mother, OP, but she wasn't your mummy.”",
              "id": 58,
              "comments": [
                {
                  "score": 21,
                  "content": "I am a simple man, I see youdu I upvote.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "OP is already a bigger person, and will continue to be until they abandon a 9 year old to cancer.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Sometimes being the bigger person means turning the other cheek so both of them can be slapped.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "also “being the bigger person” refers to when 2 people are in conflict and one of them has to apologise first, but OP has nothing to apologise for so it doesn’t even apply",
              "id": 62,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "It's just enabling with some pretty words mixed in",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "This. NTA.  If you could do it, that would be great, but only you can decide.  Everyone making you the bad guy for her decisions is just crappy.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "NTA. Absolutely this. I *especially* hate it when a parent can act terribly and it’s up to the child to be the bigger person.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I also hate the bigger person arguments! I would turn it back on the aunt and say where was she telling the mom to be the bigger person when she abandoned her child with cancer",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Also, it's the parent's job to be the bigger person. Even with aging, there's still a power disparity between a parent and a child. If she really cared about righting a wrong or apologizing, she'd drop it. She can leave you a letter that you can choose to read or not if she wants to apologize. Otherwise it sounds like she wants forgiveness more than to right what she's done. Which is so selfish and hurtful.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 651,
      "content": "A couple years back my estranged uncle reached out to his siblings - my father is the eldest - wanting to reconnect before his cancer ran its course. Dad’s response was a resounding, firm no. It baffled me, honestly, despite the rift being so bad that I never met my uncle in my entire 30+years. I only knew some of the stories, and I didn’t pry for more, but the idea of denying someone a chance to apologize - even if my dad had no intention of giving forgiveness - was just strange to me. \n\nI can honestly say Dad doesn’t regret that decision. He didn’t think twice, he never backed down even when his sister pushed, and he’s been totally at peace with it. \n\nDo what’s best for you, even if those close to you don’t understand. In this situation, only you know what’s best. \n\nNTA.",
      "id": 68,
      "comments": [
        {
          "score": 328,
          "content": "Thanks I appreciate it. Guess it’s true they won’t ever truly understand it cause only I know how I feel",
          "id": 69,
          "comments": [
            {
              "score": 150,
              "content": "[deleted]",
              "id": 70,
              "comments": [
                {
                  "score": 90,
                  "content": "I cannot recommend \"unsendable\" letters enough. Doing this has helped me so much, and it's a great way to put feelings you can't quite describe into words. The key (for me, anyway) is to just free write. Put everything down as it comes to mind, and don't think about it, just write.  Then, once the ugly is out of you and down on paper, it's so much easier to take a step back and decide what you want to do with those thoughts and feelings.\n\nAnd if you don't send it, I find that burning it is very cathartic. It's a symbolic act of letting those things go.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "One of the wonderful things about this modern world is that we can find people worthy of treating as family online and form communities of choice.  Got someone who is older and wiser you know who might be okay with being...if not precisely a parental figure, then a loving mentor?",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "You are NTA.  That being said, this is it, you can't change this decision.  You'll live without ever knowing what she would have said to you.  I'd think about it, don't just stick with no because that's what you always planned on doing.  Keep an open mind, sleep on it for a few nights, think about it, and then decide.  If it's still no, then you know you won't regret it.  Good luck OP",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Because they can't imagine not going to see their own mother.  But the woman that want you to see isn't your mother anymore.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "I think it's worth pointing out that OP's mom hasn't actually reached out. For all we know, this is all her sister's idea. The entire situation could be contrived by a third party based on their own idea of deathbed reconciliation. There's no real evidence at all that the mom feels regret or wants closure, which could turn out to be extremely painful and awkward for OP.",
          "id": 75,
          "comments": [
            {
              "score": 7,
              "content": "That's a very good point.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 240,
      "content": "NTA \n\nYour mom was never there for you when you were ill and from what I can read never there for you period. In my opinion you have no obligation to forgive her for any of it and no obligation to make her feel better about it.\n\nI only hope you have thought your decision through so that you won’t regret not talking to her later in life. If so, do what you feel is right for you and not what your family (or some of them) thinks you should do.\n\nAlso, what does your dad think about all this? Have you talked to him? Will he be going to see her?",
      "id": 77,
      "comments": [
        {
          "score": 198,
          "content": "Yeah he knows. Doesn’t really care. Only that whatever I decide he’ll fully support. He already knows my feelings on my choice and is fine with it",
          "id": 78,
          "comments": [
            {
              "score": 79,
              "content": "Well then if you have the support of the most important person in your family then just do what you feel comfortable doing. If the rest of your family get angry about it that’s on them, not you. Just because she is dying now doesn’t mean she is absolved of her past wrongdoings.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Your dad sounds like a gem, OP. You are so NTA, and try not to worry about all of the people saying you should just go along eith this. Only you know how you feel, and only you know what is best for you. And right now, what is best for you is more important than what is best for a stranger who deserted their own child because they were diagnosed with leukaemia. All the best to you in the future.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "You are not doing the same to her. You’re not. She left an ill child without a mother, you’re ignoring a grown independent adult that feels bad. NOT THE SAME.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 151,
      "content": "NTA \nFUCK closure! She left a sick 9 year old and now karma got her she wants to feel good on her deathbed.",
      "id": 82,
      "comments": [
        {
          "score": 30,
          "content": "I'm non-religious to the point I don't believe in Karma, but if I did, this would be a good example of it.\n\nNTA",
          "id": 83,
          "comments": [
            {
              "score": 9,
              "content": "Well I can tell you that thats not what karma means.",
              "id": 84,
              "comments": [
                {
                  "score": 2,
                  "content": "Karma has its origins in Hinduism and Buddhism, so it most definitely is a religious term, even if it's not commonly seen as one.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I know its a religious term, I come from a Hindu background.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 129,
      "content": "Even if they know the story of her ditching you when you had cancer, they may be grouping it into a whole “she made terrible choices when she was young” attitude. Not an excuse for their behavior/thought process, but only you know the damage she caused first hand as an awful mother. If you’re at peace with the closure you have, what her family thinks is all background noise. \n\nMaybe next time you’re asked about it, remind them how traumatic being abandoned by your mother was *while having cancer* and your coping mechanism was years of therapy that let you settle on her being dead to you. Dead people don’t come alive without causing major disruptions, and she won’t be around for the fallout. You will be left reconciling your emotions *once again* without her just so the person who hurt you can feel better about herself in her final days. \n\nIf your mother really wants what’s best for you now - because she sure as hell didn’t back then - she can accept that her final wish to reconcile is denied. Otherwise, she’s being selfish again. NTA, and I’m so sorry you went and are still going through this.",
      "id": 87,
      "comments": [
        {
          "score": 36,
          "content": "And the “she made terrible choices when she was young” thing wouldn't even work - she was probably the same age OP is right now, or a bit older - *more* than adult enough to face up to her responsibilities.\n\nOP is NTA. He and his forgiveness meant nothing to her back then, why should he and his forgiveness matter to her now?\n\nAnd indeed, why should she matter to him?",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This is so beautifully worded.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 82,
      "content": "Nta\n\n\"find it in your heart\" \n\n\"be the bigger person\"\n\nThose are phrases used to manipulate people to become a doormat and have them do stuff, most times, in benefit of a jerk\n\nIf you can't forgive her, that's it\n\nYou can't control your feelings, nor can you force yourself to feel a different emotion\n\nYou have to do what is best for you.",
      "id": 90,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": "NTA. Dying doesn't change past mistakes. What you have to decide is what you can live with: will dragging up old memories and old pain cause you more hurt than the knowledge that you didn't reach out while you could. This will be an irrevocable decision, so you need to think about it carefully, but I can't see how anyone can blame you for not choosing to open up old wounds.",
      "id": 91,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 42,
      "content": "“All she wants is to talk to me before she dies so *we* can have closure.”\n\nFrom what you’ve written, your mom has been prioritizing herself over you since the day you were born. This isn’t both of you having closure, this is her - once again - prioritizing herself over you so *she* can have closure. Your aunt is wrong. Your mom hasn’t changed. If she truly regretted how she treated you, she’d put *your* peace of mind first and respect your wishes.\n\nNTA",
      "id": 92,
      "comments": [
        {
          "score": 8,
          "content": "I wouldn’t be surprised if it’s not as much your mom’s idea that she wants to see you as her family’s. Your aunt could be triangulating and telling you each that you need to see each other. My personal experience with my brother is that his impending death didn’t change anything, he had no moments of introspection. Don’t do it , your health will suffer for nothing.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 29,
      "content": "NTA\n\n\nYour mom was a complete A while you were growing up. However I do not think think she is an A for making the request. Which you are well within your rights to decline. \n\nYour aunt however is an A for not accepting your answer and bringing in the whole family into this. \n\nIf you have closure then that's fine. Tell your aunt to have your mom write a letter or make a recording of what she needs to say to you for her to have closure.  You don't have to open or even keep it. Hopefully it. Will get them off your back and if you ever change your mind you will have that.",
      "id": 94,
      "comments": [],
      "relation": "Support"
    }
  ]
}