{
  "post content": "\n\nMy 26, female, sister moved in with me 29, female, and my husband 32, male, days ago after her divorce was finalized then lost her job and was no longer being able to pay rent for her apartment.\n\n\nWe're mostly in agreement about everything except, I've been kind of having an issue with what she wears especially at nighttime when she unwind and tend to relax a bit as she says. I think that what she wears is inappropriate. She usually wear silky nightwear (nightgowns mostly). She says that's just \"her style\" and is what she's been wearing for years. Not just that, but she'd come out of her room dressing like that to grab water or use the bathroom. While yes, it was just me who saw her dressed like that I honestly could not risk having an argument with my husband over it. I suggested she buys some pjs but she said that she doesn't \"feel comfortable\" in them.\n\n\nLast night, I saw her in the kitchen grabbing something from the fridge and was dressed in a purple, strapped, knee length nightgown. I tried to speak to her about it but it didn't go well. We started arguing and I ended up telling her to stop leaving her room when she's wearing stuff like that and she argued that there was nothing wrong with what she was wearing, that it wasn't like she was walking around naked or anything of the sort. I told her it's my home and she's a guest and should just respect my request but she responded saying that just because she lives in my house does not mean that I have the right to control what she wears then stormed off to her room.\n\n\nWe haven't talked since then and she is refusing to talk about it.\n\n\nEdit: I wanna post a pic of the nightgown but don't know how. I'll see what I can do.\n\n\nEdit: here's the dress. It's not identical but close to what she was wearing, very close.\n\n\n\nhttps://ae01.alicdn.com/kf/HTB1qKAoff2H8KJjy0Fcq6yDlFXav/3-Colors-Adult-Women-Claret-Black-Night-Gown-Ladies-Spring-Autumn-Lace-Silk-Sleep-Dress-Knee.jpg_Q90.jpg_.webp\n\n\n\nLook at it and give judgement. Let me know if the link is not working.",
  "id": 1,
  "comments": [
    {
      "score": 33536,
      "content": "YTA. She’s wearing a **knee-length** night gown. What next? She can’t show her shoulders? A little bit of cleavage? Her ankles?",
      "id": 2,
      "comments": [
        {
          "score": 1871,
          "content": "I had the opposite take. OP thinks the nightgown is old-fashioned, so her sister should find some more revealing bedtime clothes to get with the times. Sans-clothing would be most appropriate. Right?",
          "id": 3,
          "comments": [
            {
              "score": 248,
              "content": "sleep in the birthday suit",
              "id": 4,
              "comments": [
                {
                  "score": 14,
                  "content": "It would at least avoid any argument from the husband.",
                  "id": 5,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Yeah, maybe. Personally I always wear a nightgown. I hate pjs, I find them uncomfortable. I’d suspect there’s more yo this story than we’re being told. Why can’t she mention it to her husband? For instance. It’d be a weird thing to fall out over. Restricting her sister to her room sounds quite draconian to me.",
              "id": 6,
              "comments": [
                {
                  "score": 10,
                  "content": "Agreed. I always just wear boxers (I’m a dude) but normally wear pajama bottoms and a tshirt if I’m in someone else’s house. If it’s a long-term situation though I don’t know if I’d want to be uncomfortable every single night either",
                  "id": 7,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I (m29) just stayed at my sister house for Thanksgiving. I always wear boxers to bed. When I stayed at her place I wore shorts and tee when getting up at night. \n\nSisters nightgown isn’t bra and undies, it’s the equivalent to wearing shorts and a tee. OPs sister did nothing wrong.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "> Why can’t she mention it to her husband?\n\nYeah the \"I can't have an argument with my husband over it\"...but like...why would it be an argument?",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I was wondering why she didn't just buy her a robe or matching PJs and have a girls night? I mean that's her sister and she just got a divorce so it would probably mean a lot to her and be a nicer way of going about getting what she wants from her sis.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1354,
          "content": "I concur that OP is being overly controlling and has deep insecurities. OP has issues that she needs to address.\n\nBut it's also a dick move to move in, presumably not pay rent or pay a minor amount (no job, couldn't afford own place), presumably eat someone's food and then button press your sibling who is paying for all of the above. If sister knows OP has insecurity issues, that's double AH move.\n\nI'm sure sister will be shocked when/if she is told she's going to have to find another place. Which would have been the more mature thing. \"Oy, can you please wear less revealing clothing because it's a bit awkward in a shared home. - No. - Okey doke, I respect your decision, you are an adult that can wear whatever you want, you do you. Please move out in 30 days. Our lifestyles as roommates aren't compatible.\"",
          "id": 11,
          "comments": [
            {
              "score": 346,
              "content": "It's knee length... strappy means equivalent to a tank top/camisole which are often worn on their own on the top half of the body anyway. It's not revealing and OP needs to sort out her own issues instead of whining because her sister wants to be comfortable after having 3 of the scientifically most stressful life events happen in quick succession. Yes OP is doing her sister a favour by letting her live there but its not like the woman is walking around in lingerie sets with everything on show.",
              "id": 12,
              "comments": [
                {
                  "score": 670,
                  "content": "Depends how heavy the satin is. I have some strappy cami style night gowns I would Never wear around someone not my spouse and some I could wear outside. The big thing to me is as a guest you behave appropriate for your hosts comfort. She is not",
                  "id": 13,
                  "comments": [
                    {
                      "score": 296,
                      "content": "Me too. It's in black and goes all the way down to my shins but the way that it fits on my body is actually super revealing. Walking around my house I'm even sometimes worried about passing the window to close the blinds so it definitely  depends on the cut and fabric whether it's OP overreacting or not",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Depends on the cut too. If it’s bias cut it’s going to be a LOT more clingy/revealing.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 556,
                  "content": "I concur.\n\nAnd if the sister was paying equal share or the one carrying OP, you'd be absolutely right.\n\nOP is instead the one carrying the sister, and the sister is knowingly pushing her buttons, right or wrong, is an AH move. I've only had to crash at friends or family places a couple times for more than a night, and I'd never dream of stepping over their boundaries even if they're a bit out there. If I did or they were not something I wanted to comply with, it's my job to find another place and not tell someone else how to live in their own home.\n\nBoundaries are a thing. Yes, they can be ridiculous. If it's not compatible, the guest needs to find another place to stay.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I wonder if is a self-esteem issue? She lost her job, her husband asked for divorce, she was forced to seek a roof with her married sister and can't even pay rent. Maybe she sees her sister with the \"put together\" life getting angry at her for her looks... and gives a tiny ego boost that she so desperately needs. Like in \"everything is going to shit, but at least I still got it\" type of mentality - not saying this justifies but I can see it happening cause her life went downhill pretty fast.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 223,
                  "content": "I feel like this doesn’t even have to be such a big debate, tho. Presumably, both sisters *at least* like and respect one another. Can she not just wear a robe for coming and going, and do whatever she wants when she’s in her room ?",
                  "id": 18,
                  "comments": [
                    {
                      "score": 34,
                      "content": "This is obvious solution.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 143,
                  "content": "Just because someone has a different sense of decency than you do doesn't mean they have issues. I personally would never go around someone's home in my nightgown only. Not for nothing but there has been many nights in my own home where I didn't realize that a whole boob was completely exposed. Why risk that in someone else's home? I would don a robe if I went outside of my bedroom. Very simple, safe & blatantly respectful.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 99,
                      "content": "Yes this!!! It doesn’t matter what the silk negligee looks like or if other people find it offensive. My FIL and stepMIL would be absolutely chill with randoms or fam walking around naked. They’re nudists. I’m pretty body + but I’m not that comfortable in my own skin. I wear clothes in their house and they wear clothes in mine. My house has clothing rules. Their house is clothing optional. They think a slim nightgown is conservative. I would NEVER wear that gown that OP linked around anyone but my husband because it would leave absolutely nothing to the imagination. I have hug boobs and pointy nipples. \n\nOP told her free-loading (I’m assuming) sis that it made her uncomfortable. This is such. An easy fix but sister is being incredibly entitled regarding a space that doesn’t belong to her. It’s not public. It’s a private living space. Op is NTA",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Exactly! I like to be cold at night so I usually sleep in a nightie similar to the one in OP’s picture, maybe a bit shorter, but when I’m visiting my sisters, I wear actual pajamas out of respect for them. I don’t even know if they care, or if I would, should the situation be reversed, but it’s just a manners thing for me I guess, even though we are an easygoing family. Plus, ewww… I don’t want my brother in laws seeing the outline of my nips through my nightie!",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Still... if one is so dependent on OP's goodwills, can't she just throw on a bathrobe/dressing gown if she goes out?",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Idk - I have some full-length lace nightgowns that are strappy up top and go all the way to my ankles but leave very little to the imagination.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 7,
                      "content": "OP said they're going to post a picture of one so I hope they do because it'd change some opinions if it's on the lines of those more risqué ones",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Tank tops are usually worn with a bra though and night gowns aren't. The gown OP linked looks quite revealing.\n\nOP does sound insecure but the sister is an AH. She should have said sorry and thrown on a bathrobe or cardigan next time she went to the common household areas. It's really not a big ask.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "I think we’re forgetting that she is likely naked underneath so even though it’s knee length, I’m pretty sure nipples are flashing and there isn’t much left too the imagination with that thin material. I have nothing against the nightgown but if I was staying with family, that’s the last thing I would be walking around the house in. At least put a robe over when in the common area. At home where I’m with my hubby, nipples be poking out because I’m in my comfort area. She is a guest in a home, she needs to be respectful or move out so she be do as she wishes",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Without saying so, the op clearly finds the nightgown too sexy and has some kind of insecurity with her hubby seeing her sis in a somewhat sexy nightgown.  Sis doesn’t need new Jammies, but could use a robe when walking around the house in it.  Given she is living in someone else’s home, donning a robe, when wandering the halls, seems like a small compromise to keep the peace and the low-cost living arrangement.  NAH.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 269,
              "content": "I agree. IMO this is a pretty straightforward ESH judgement. OP is being overly controlling, and her \"risk having an argument with my husband\" comment is throwing up red flags. However, at the end of the day it is her house. If sister thinks the request is unreasonable she's free to find someplace else to live.",
              "id": 29,
              "comments": [
                {
                  "score": 20,
                  "content": "She could just being saying that she cant risk an argument because he’s already not happy the sister is staying with them and doesn’t want him to see how the sis is dressed and get more uncomfortable and say she has to leave. Her not wanting to risk an argument could be a very simple thing.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Well put! \nMakes sister uncomfortable… just suck it up and throw on a lightweight cardigan over your nightgown when in common areas. A little respect goes a long way and sister is being so gracious to let her stay there.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Agreed. I think this is an ESH. OP’s issue with the nightgown attire is really weird and unreasonable in my opinion. But it’s also rude as a guest to refuse to respect your host’s wishes, when they’re presumably housing you for free.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "So are you suggesting the sister should buy a new wardrobe because she's staying there? I don't get it.",
              "id": 33,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 497,
          "content": "Also - she lost her job and having a hard time - why does she need to spend money on pjs?",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I'm gonna guess her sibling has big boobs. Most women with big boobs get called a slut fro showing ANY amount of cleavage.",
          "id": 35,
          "comments": [
            {
              "score": 13,
              "content": "Yeah, or she’s plus sized. To some people pretty much anything but a muumuu is “inappropriate” when you’re larger",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "It's knee length, but how sheer is it? It may be quite see-through and if the sister isn't wearing anything underneath? And really, how hard is it to slip on a dressing gown over the top when you leave the bedroom.",
          "id": 37,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Would YOU wear that around someone else's husband? Especially when asked not to? I wouldn't.",
          "id": 38,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "From the picture OP posted it looks like one bend too low and a nip’s popping right out if there’s no bra (and who wears a bra to bed?) \n\nI wouldn’t be comfortable with my sister wearing something like that around my SO either. I’m not at all afraid my SO “can’t control himself” or anything, but I know he’d be uncomfortable, too. It’s not outright lingerie but it’s also not “modest”, even though the *length* is. \n\nSister presumably doesn’t pay rent, OP and her husband pay for their house. They have the right to be comfortable, too, and how hard is it to just throw a robe on over it?",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "She’s living in their fucking house! 28.4K people think it’s totally cool to crash at someone else’s house instead of ya know, be homeless and then just disrespect their simple requests? Y’all selfish af",
          "id": 40,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "That’s a lot more than a little bit of cleavage. Plus OP said it’s not identical, and we don’t know if the upper area is cut deeper or not.",
          "id": 41,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I can bet this kind of dress is what OP would consider lingerie, so can you imagine how uncomfortable it would be for OP and her husband seeing her wearing that around the house especially when she just.. could stop? And wear something else that doesn’t make the people who took her in feel like they’re being disrespected.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11938,
      "content": "YTA. Don't take whatever issues you're having with your husband out on your sister.",
      "id": 43,
      "comments": [
        {
          "score": 5641,
          "content": "THIS. It's not her sister's fault she can't trust her husband. Purple and knee length isn't sexy lingerie. It's literally just normal evening wear.",
          "id": 44,
          "comments": [
            {
              "score": 4151,
              "content": "Idk, I once saw a woman's ankle and my face turned into a cartoon wolf's with giant love hearts for eyes and was hitting my head with a giant hammer",
              "id": 45,
              "comments": [
                {
                  "score": 1092,
                  "content": "[deleted]",
                  "id": 46,
                  "comments": [
                    {
                      "score": 197,
                      "content": "Oh thank god, I thought I was the only one. I saw a lady in a silk cocktail dress and my jaw literally detached, fell to the floor and said p“AAAAOOOOOOGAAAH!!!” Now I don’t feel so alone!",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 30,
                      "content": "That's rough buddy",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "Ah what you need to do is unscrew your eyes like they were bulbs and put some smaller more efficient LEDs in",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "Yeah but did you yell, \"aaoooooooooga!\"",
                  "id": 50,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Oh yeah\n\nAnd wolf-whistles, makes a cat noise, imitates a bed squeaking, purrs, pants, barks, howls, twiddled my lips",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "You met Cameron Diaz too huh?",
                  "id": 52,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Just her ankle",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Someone reminded me that breasts exist and I just couldn't physically take it",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Wish I had an award to give you 👀",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "oh fuck I almost lost a keyboard over that comment. If I had awards I'd give them to you, take my upvote.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Sister changes in to a more appropriate bathroom towel.",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Make it in a different fabric and it‘s a sun dress frequently seen outside during the summer.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I clicked the link at was like... I'm fairly certain I've seen this same style in the pajama section of Wal-Mart",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Our great grandfather’s gave our granny’s 12 kids in those cotton long sleeve nightgowns. The gown is way not the issue.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It's also like...Look, she has to move in with her sister. That suggests she doesn't have a lot of spare cash to put towards more jammies right now. And why waste it when she already has a bunch of comfy nightgowns?",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Change the material and it would be a sun dress",
              "id": 62,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2439,
          "content": "Yeah... My biggest problem here is the very specific \"I couldn't risk have an argument with my husband about this\".\n\nTrust issues or self image issues are at hand.",
          "id": 63,
          "comments": [
            {
              "score": 393,
              "content": "I took this to mean that he would be unhappy about what the sister was wearing and OP didn’t want to get caught in the middle. I don’t see anything indicating that the husband is untrustworthy - just that the sister needs to move into her own place where she can do what she wants.",
              "id": 64,
              "comments": [
                {
                  "score": 273,
                  "content": "3 words. \n\nClassic Conservative Values",
                  "id": 65,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Religious nutbag vibes",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Yep. Now here are\n\nTwo words: slut shaming\n\nAnd \n\nOne word: misogyny",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 283,
              "content": "Maybe because he would be made uncomfortable and not want the sister to stay. She may be having a hard time getting her husband to allow her sister to stay as is. Also, these comments make me feel like no one has seen a silk or satin nightie. Those things cling and highlight.",
              "id": 68,
              "comments": [
                {
                  "score": 12,
                  "content": "Really depends. I’ve owned ones that I felt comfortable wearing out as an actual dress and others that are so sheer or thin they pretty much advertise my nipples. But usually the longer/more full coverage the nighty was, the thicker the satin/silk - I don’t know if that’s standard, but kind of makes sense that fuller coverage clothing would also not be super thin.",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "So do bathing suits but I bet OP wears those...in public! ::gasp::",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "People are being so weird on this point - like I agree OP is probably having marital issues, but it's all the more reason to be respectful in someone else's home. \n\nMy sister had a baby this year and she confided in me about how hard it was to have our gorgeous other sister come and stay with her for a few weeks, because she (the younger one) is discovering her body and dressing really sexily right now (a totally normal phase to go through). Things like pregnancy, childbirth, and nursing really change how you relate to and view your own body, and I think it's fucked up to just dismiss someone's insecurities. Her husband is amazing and would NEVER cheat, and she knows that, but it still made her feel *TERRIBLE*. \n\nOP is doing a really kind thing by taking her sister in, she doesn't *have* to do that, and all she's asking is that her sister be more respectful in the way that she dresses at night because it makes her uncomfortable. I can think of many valid reasons she might feel that way.",
              "id": 71,
              "comments": [
                {
                  "score": 10,
                  "content": "That is a very valid point. I don't think OP is necessarily TA, because it is hard to argue that in her own house. But that really doesn't sit right with me.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "while i completely agree with you, it’s also something where i feel like the actual “issue” has been a bit blown out of proportion by the OP and so many of these comments. personally i think the nightgown in the photo is fine & at the same time i don’t understand why her response was to argue the point (and edit her post so much to argue “this arguably modest nightgown is bad!!!”) instead of just plainly saying guests should wear a robe and she would lend her one. i was expecting a negligée.\nbut it’s her house…but also, context matters? the sister was coming out of her room late at night presuming not to run into OP or her husband—it’s not like she’s coming down to breakfast in it. she wasn’t intending to be disrespectful and didn’t realize it could be perceived as such. it’s all so weird!",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This is perfectly said",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "It might not be. Sex issue. Could just be the hubby is a bit offended by it also. You can be a bit more conservative without being a cheater or a gross ogler",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Really shitty for the sister to be given a place to stay, and not respect the emotions or requests of those who are housing her.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 439,
          "content": "Yes. YTA clearly there is something else going on that has nothing to do with nightgowns.",
          "id": 77,
          "comments": [
            {
              "score": 152,
              "content": "It’s not about the Iranian Yogurt!",
              "id": 78,
              "comments": [
                {
                  "score": 18,
                  "content": "But is it about the chocolate pineapple cake?",
                  "id": 79,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I do not know of this chocolate pineapple cake… tell me more!",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "To be fair she doesn’t mention husband issues.  It’s just kind of apparent there is a lack of trust seeing as she is getting sooo concerned over her sister’s garb but only because he is there.",
          "id": 81,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11373,
      "content": "Info: what do you mean you couldn’t risk having an argument with your husband over it?",
      "id": 82,
      "comments": [
        {
          "score": 6990,
          "content": "She’s afraid husband will look and she’ll get mad.",
          "id": 83,
          "comments": [
            {
              "score": 3307,
              "content": "Yep. Screams insecurity at so many points. Insecure in her relationship with her husband and can't control him, so why not blame the sister and control what she wears instead.",
              "id": 84,
              "comments": [
                {
                  "score": 142,
                  "content": "It weirds me out so much... Like when you marry someone you basically become brother/sister with their siblings. Who the fuck would think about their own siblings stealing their spouse? That is incredibly weird to even think about to me.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 132,
                      "content": "Ah, you mustn't have been on reddit for long enough, then. Lol.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "That’s a bit naive. People objectify brothers/sister-in-laws all the time. I wouldnt say cheating with a partner’s sibling is common but it’s not unheard of.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yep, classical insecurity turns to misogyny.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 452,
              "content": "Or he won't like it or feel it's inappropriate or it makes him uncomfortable.",
              "id": 89,
              "comments": [
                {
                  "score": 643,
                  "content": "Uncomfortable seeing her ankles and feet? Fuck that guy",
                  "id": 90,
                  "comments": [
                    {
                      "score": 467,
                      "content": "Omg or her delicious knees! Exposed knees just drive men wild these days /s",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 580,
                  "content": "It’s to her KNEES.  Covers the major bits.  No worse than a tank top and shorts.  It’s late at night when she’s grabbing something or going to bathroom.  It’s not like she’s parading around in skimpy clothes to provoke them.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 311,
                      "content": "Pretty much all my shorts cover less than that",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "Yes, this. If she was changing into her nightie after dinner and wearing it while sitting around watching TV for hours with the sister and her husband, I might feel differently, but she’s just going to the bathroom. She’s not naked, get over it.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 216,
          "content": "Probably her husband would tell her she’s being ridiculous.",
          "id": 95,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 197,
          "content": "This was the line that caught my attention more than anything else. Why would this cause an argument of any kind between the two of them? Any potential legitimate conflict is between the sister and someone who sees her who happens to be uncomfortable themselves. \n\nWhat a tiresome life if the accidental witnessing of another person is something that causes an argument between the witnesser and spouse (and over what?).",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "This is indeed strange.\n\nEven if he doesn't like it why would it become the source of a major argument? That's the part that's not being said and seems to be about their own marital issues rather than this is the average way most would respond.\n\nThe funny thing too is I'm a woman who dates women, and my partner, a woman, would be attracted  to women, yet I can't fathom my sister wearing such a nightgown becoming the cause of a marital stir. Which goes back to another comment I made, that these kinds of requests always have an undertone of men being unable to control themselves even with family members. As lesbians are attracted to women too, yet it is simply uncommon to hear a lesbian spouse saying their sister needs to cover up because if their wife sees they don't want to get into a big argument.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I took it as in her husband would have been uncomfortable seeing his sil nipples and would have been afraid to say anything to his wife. \n\nMy husband was in an abusive relationship before we met. The man had to speak to his mother on speakerphone because his ex believed he had some hooker saved as Mom in his phone. He was so scared to SEEM like he was doing something bad, the poor guy would panic if another woman looked at him. It took years for him to understand that not only did I trust him completely, it’s actually totally normal for him to notice and look at attractive people. \n\nThat doesn’t mean that’s what is going on here. That’s just the lens I’m viewing this through. \n\nThis is such a non issue. Sister dresses to what her hosts consider appropriate in the common areas. It’s not hard to put on a robe over your nightgown when you leave your bedroom in exchange for free room and board.",
          "id": 98,
          "comments": [
            {
              "score": 7,
              "content": "I’m so glad for your husband that you have been able to show him what a trusting loving relationship is like.\n\nNot sarcasm.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Right, just simply don’t have or start an argument.",
          "id": 100,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Hate for her husband to go to a beach!",
          "id": 101,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "This is exactly what I'm wondering. \n\nWhy would there automatically be an argument over this?",
          "id": 102,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6485,
      "content": "Purple, strapped, and knee length? What is wrong with that?! Are you a nun? \n\nIs it sheer/see through? Can you see her tits and her ass? No?\n\n YTA.",
      "id": 103,
      "comments": [
        {
          "score": 1923,
          "content": "Perhaps she means strappy as in strappy top? And silk since she mentions is elsewhere. \n\nStrappy silky nightie is probably not what I would wear in front of third party but I think the OP is taking her mistrust of her husband out on the sister. Get her a silky robe for an early Christmas gift?",
          "id": 104,
          "comments": [
            {
              "score": 722,
              "content": "If it is knee length it is likely not see through and covers everything important.\n\nEdit: OP posted a picture example. I can definitely see where your coming from. I personally wouldnt have issue with it but i can definitely see how someone would. NTA",
              "id": 105,
              "comments": [
                {
                  "score": 488,
                  "content": "Not super relevant but I have a knee length pink strapped night dress that's rather see through...",
                  "id": 106,
                  "comments": [
                    {
                      "score": 188,
                      "content": "Yeah. Me too. Black in my case lol.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "and a lot of that kind of nightware doesn’t near to be see through. it’s super accentuating and like highlights all the dips, curves, nips, etc",
                      "id": 108,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I have a light blue one that is one of my husbands favorites and it’s like the least revealing nighty that I have. Still wouldn’t wear in front of anyone else though. Something about the silk lays on my chest and and is loose elsewhere always gets his attention and I know it.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 283,
              "content": "I don't even think it's mistrust. I am reading \"i believe my sister is prettier than me and she could steal my husband\" insecurity vibes.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 258,
              "content": "She said \"strapped\", not \"strappy\". Strapped means it has straps over the shoulders. Strapped mean NOT strappless. Strapped means basically like any regular/ordinary tank top.",
              "id": 111,
              "comments": [
                {
                  "score": 19,
                  "content": "Hahaha I thought it was a typo for “striped” to be honest",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "I’d call that strappy, not strapped. Depends where you’re from I guess.",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 177,
              "content": "I think a silk robe would be a nice gesture, and they feel nice.",
              "id": 114,
              "comments": [
                {
                  "score": 16,
                  "content": "Took too long to find this perfect answer.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "I was scrolling comments before I posted because I came to say exactly this. \n\nBuy her a nice robe and be done with it.",
              "id": 116,
              "comments": [
                {
                  "score": 13,
                  "content": "Yeah this is probably the best option.  One sister can still wear her silky stuff, other sister should feel a bit more secure.   I honestly wouldn’t feel comfortable with a guest walking around my house in a silky nightgown.   I know I have a black on that isn’t silk that still seems a bit revealing.   \n\nAnd when I am at other peoples houses I don’t leave my room without a robe: getting dressed.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yep!  Everybody’s making such a big deal out of this! Why?",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My first thought was that it was like bra straps, which one sees on the sorts of nightgowns that are really just lingerie? But then I thought she’d probably call it lingerie if that were the case. Hard to tell — I have nightgowns I’d never wear in front of people I wasn’t sleeping with, and nightgowns I’d wear in front of a judge.",
              "id": 119,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Depending on body type, that type of silky lingerie can reveal a lot. I would never wear that around a man I'm not banging.",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Have you ever seen a silky/satin nightgown? That shit clings to *everything*. Nipples abound. I would never dream of wearing a strappy silky gown -of any length- around anyone other than my spouse. It shows a serious lack of taste/class to wear it freely around OP and her husband. Get a robe or dressing gown to wear outside the bedroom. It’s not difficult, nor expensive. OP’s sister is being completely ungrateful. NTA at ALL.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5339,
      "content": "INFO:  \nWhat do you mean by: \n\n>I honestly could not risk having an argument with my husband over it.\n\nWhy does anyone need to argue about this at all?",
      "id": 122,
      "comments": [
        {
          "score": 1530,
          "content": "This! Is your husband untrustworthy with your *sister* or does he have a problem with women’s nightwear? It’s knee length ffs my grandparents wouldn’t even have a problem with that",
          "id": 123,
          "comments": [
            {
              "score": 117,
              "content": "Mine would have. But they were also SUPER religious weirdos.",
              "id": 124,
              "comments": [
                {
                  "score": 16,
                  "content": "Thanks, this brought back a core memory of my *grandmother* buying me my first pairs of “sexy” underwear when I was like 12. They were black satin with rainbow stars, and purple satin with silver dots. I opened them in front of my entire extended family, including an “uncle” (my mom’s step brother whom she wasn’t raised with) and his wife and small children. Hella awkward.",
                  "id": 125,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Was a different time.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 9,
                      "content": "What, the early 90s?",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 59,
              "content": "My gran wouldn't bat an eye, dearly departed nan would've scoffed and said  \"show some damn skin, get you a man\"",
              "id": 128,
              "comments": [
                {
                  "score": 39,
                  "content": "My aunt once thought my neckline was too low and my grandma said “if you’ve got it, flaunt it.” She was a legend!",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Maybe OP is worried that her husband will want to wear the same nightgown to sleep in?",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 350,
          "content": "I know this is all conjecture since we don’t have any more information, but her husband is probably conservative with clothes. \n\nHer not trying to have it blow up into an argument, which could possibly lead to her sister being kicked out, could be the issue? Since she never mentioned she wants her sister out of the house due to her clothing.",
          "id": 131,
          "comments": [
            {
              "score": 210,
              "content": "That’s kind of what I was thinking. Like the husband would be more offended than he would be enticed.",
              "id": 132,
              "comments": [
                {
                  "score": 254,
                  "content": "I am pretty sure my husband would e uncomfortable with a guest running around in a nightie.  I don’t consider him a prude but I think it depends on how you were raised.  I don’t get the conjecture on the husband being untrustworthy, the sister being prettier. To me it was a simple request by the owner of the house.  Way to be happy to have a roof over your head.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 23,
                      "content": "My husband would be so uncomfortable. He’s 100% against family living with us so it wouldn’t come up unless it was during a visit.",
                      "id": 134,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Uncomfortable, sure, but for it to result in an argument? That op \"can't risk\"? There's something more going on here.   \n\nI can imagine my partner being made uncomfortable would just be like - \"Sooo... how's your sister's job hunt going again? She was wearing some revealing silk nightgown thing when she ran to the kitchen earlier. It was really awkward, and I didn't know where to look when I talked to her. \"   \n\nI think there's some bigger issues going on if op is afraid the husband will see her sister once (because he hasn't seen her in it yet) and then... what?   Become so enraged that he argues with her or the sister?\n\nWhile I agree that there's a lot of conjecture going on, I think it's because something is off, some red flags are present imo, and people are trying to figure out the missing piece to the puzzle.",
                      "id": 135,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Or maybe husband never wanted Sis to move in in the first place, and OP promised there wouldn't be any issues.",
          "id": 136,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4638,
      "content": "**NTA**, while it can certainly be argued that you are being overly sensitive, that is subjective and hard to measure. What is easy to measure and clear is that you’re doing her a favor by giving her somewhere to stay when she needs it, and I do not think it is unreasonable that you ask her to respect this simple request for how to behave in your home. Whether one thinks the request is a bit silly or not doesn’t change that it is a simple request, and you are doing her a good favor in turn.",
      "id": 137,
      "comments": [
        {
          "score": 2009,
          "content": "Agree. A simple robe over the nightgown is not too much to ask.",
          "id": 138,
          "comments": [
            {
              "score": 704,
              "content": "This is so obviously the answer. Better to request clothes be added, then outlawing specific clothes.\n\nIt's op's house. She can dictate what guests are allowed to do in the communal space.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 161,
              "content": "[deleted]",
              "id": 140,
              "comments": [
                {
                  "score": 12,
                  "content": "I've never, ever, in my family or that of any friends or significant others, ever seen someone wearing a robe. Like not even joking. I've never seen it. I thought they were a movie thing, like nightgowns and hats with the little pompom?",
                  "id": 141,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Hah! Lots of people in my family own nightgowns although I find them too uncomfortable.  And I don't know of anybody who doesn't own at least one robe. I don't have a summer weight one but I have two big fuzzy monsters that wrap around me nearly twice for winters - sorta like [this one](https://i.ebayimg.com/images/g/lT4AAOSwOBpfGcJj/s-l1600.jpg).  Super awesome to cuddle up in before bed or after a shower, especially if you pop it in the dryer for a few minutes first.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1230,
          "content": "yeah i’m not getting all these ‘y t a’ and jumping to the idea that her husbands got wandering eyes and she’s insecure. ppl have different standards of modesty and considering she’s letting her sister live under her roof and eat her food for free i think op’s well within her right to tell the sister to wear something less revealing",
          "id": 143,
          "comments": [
            {
              "score": 537,
              "content": "Because reddit is fueled by teenagers.   Agree on the NTA.",
              "id": 144,
              "comments": [
                {
                  "score": 39,
                  "content": "[removed]",
                  "id": 145,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Yes, and this sub in particular! I'm surprised the 'NTA' verdicts aren't downvoted into oblivion!",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 235,
              "content": "And even if she IS insecure - it’s her fucking house.\n\nSister is staying there for free. \n\nPut on a hoodie or t shirt and call it a day.\n\nI have a nightgown like the one OP linked and sure it’s long but my nips show and my cleavage. If she doesn’t want her sister walking around like that in her own home, it’s her call. It’s not a huge ask.",
              "id": 147,
              "comments": [
                {
                  "score": 9,
                  "content": "EXACTLY!! I have a few gowns like that, they are sexy as hell! I wouldn't wear that in front of any other man except my own SO. I agree with the NTA!",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes! I can't believe how many people are calling OP the asshole. She is not! The sister is acting entitled and disrespectful as a guest in someone's home who is uncomfortable with that dress around her husband. I think if the husband is untrustworthy or OP is insecure, that's a them problem, but it's their house! If the sister doesn't like it, she can leave.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Just the \"women are allowed to wear anything\" is getting out of hand. Not that i dissagree with the statement ofc but like.. it's op's house..",
              "id": 150,
              "comments": [
                {
                  "score": 40,
                  "content": "That’s what really irritates me about the takes on this post. The whole consideration for most on here begins and ends with “I can do what I want!!!!! Don’t ever tell me what to wear!!!!! How DARE you try to censor a woman!!!!!” to the extent that they’re willing to make all these critical assumptions about OP and her husband without acknowledging that it’s their fucking home and who gives a shit what their reasons are. OP’s sister is perfect and innocent and only has the best, most woke of intentions by virtue of the fact that she’s a woman “being told what to do”. Basic consideration for other people doesn’t factor into it at all. It’s the most American shit I’ve seen in the last 20 minutes.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Lots of m'ladys outing themselves",
              "id": 152,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "It’s her house. As far as living requests it’s a simple one. This person is 26, not exactly helpless,  and picking the stupidest hill to die on.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "There’s literally someone upthread arguing that nobody should be uncomfortable if sister’s nipples were fully visible. \n\nWhile I agree that it would be nice if our society treated female and male nipples equally, that’s just not reality and it’s rude to make people uncomfortable in their own home when they’re letting you live there.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "And for me it's like - SO WHAT if she's insecure? And what if he has cheated in the past, or said something about how hot the sister is?? Why are people gatekeeping when a woman is allowed to feel uncomfortable in her own damn home",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "If the houseguest was a dude walking around in a household with a teenage girl wearing short clothes, you'd have an unequivocal *N T A* verdict.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I bet its the “cant risk an argument with my husband” line that has people up in arms.",
              "id": 157,
              "comments": [
                {
                  "score": 13,
                  "content": "one mention of a husband and aita commenters will immediately jump to “ur just insecure haha”",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Yes, in my country this would be considered very revealing and especially not something you'd wear in front of anyone except your husband.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 349,
          "content": "Finally! Agree she's NTA. Her home her rules.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Agreed.  This could be solved with a simple: Put on a robe or go find a new place to live.  I *own and live in* my house, but if my MIL is here I don't walk around in nothing but a pair of shorts or a towel.  I do those things sometimes when I'm home alone with my wife, and I sleep in nothing but a pair of gym shorts, but if anyone else is in the house I cover up.  If my wife had a sister who moved in and thought it was appropriate to wear this in my house I'd ask her (much like I asked my BIL when he was living with us) to cover up in shared spaces or find a different place to live.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "And her sister sounds a little belligerent. Her response to her sister's request was, \"it's my style\"? It's sleepwear not club wear.\n\nAnd I know breasts shouldn't be sexualized, but they are. I'm guessing the issue isn't the length but that it's silk and the girls are swinging around and clearly visible.\n\nIn the linked ad, the model has modesty coverage. That gown would look very different irl. \n\nOP isn't being crazy, it's not a huge ask.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "*Best Mandolorian impression* This is the way. \n\nWe can debate all day what's prudish or sensitive, but people are losing the fact that the sister is a guest in the home, and that is a great kindness from the hosts. Being asked to not wear a silky nightgown in common areas isn't too much (I'm assuming a robe overtop would be considered appropriate here). \n\nIs older sis insecure? Likely. Is it too much to ask that she throw on a robe if not in her room when in someone else's home? I don't think so. Maybe I'm a prude, but if I was being housed in a rough time like that, I would be doing my best to not overly inconvenience my hosts. So long as OP doesn't walk around her house that way while saying sis can't, and OP doesn't nitpick every outfit, I don't see an issue. Want to do this the most gracious way? Get her a comfy robe as a welcoming gift.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "A coment with comon sense",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "TOOK SO LONG TO FIND SOMEONE WHO AGREED IN THE COMMENTS",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3332,
      "content": "I’m actually shocked by all the Y t As here. Is this what you people do when you’re a guest in someone else’s house who is helping you? You just tell them to shut up and deal? Gtf outta my house, all of you! It doesn’t matter why she’s asking.",
      "id": 166,
      "comments": [
        {
          "score": 1210,
          "content": "Exactly this.  Children on this post are shouting \"my body, my rights!!!\".  What a load of BS.  She is a FREELOADER living in OP's home and should respect her and her husband.",
          "id": 167,
          "comments": [
            {
              "score": 311,
              "content": "Fr. My house my rules",
              "id": 168,
              "comments": [
                {
                  "score": 23,
                  "content": "No really, someone else's house, their rules... And clean the kitchen while you're at it as a thanks.",
                  "id": 169,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I actually understand the NTA posts on here and the concept of being respectful in someone else's home, but I think it's going a little far to call her sister a \"freeloader\" when there's no information to suggest this. Just because she couldn't afford to live alone (which very few people can nowadays) doesn't mean she isn't paying any of her own expenses. Even if she lost her job, that doesn't mean she's broke or isn't looking for work. And for the record, I'm an adult who is married and neither of us would be uncomfortable with this. Not that others don't have a right to be, but I think it's a little far to degrade the sister as if she's a bum when we don't know that.",
              "id": 170,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Welcome to gen z. I identify as a lingerie wearing queenzilla. Worship me! Bow before me! My rights are my might!",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 614,
          "content": "literally like 😭 u disrespect me like this under my own roof i’m putting u back onto the streets. u wanna risk losing a roof over ur head for a silky nightgown? go ahead!",
          "id": 172,
          "comments": [
            {
              "score": 40,
              "content": "tbh i find it a little sus that the sister was willing to die on the silk nightgown hill. like…why???? 🤔",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 379,
          "content": "I’m with you. I was surprised at YTA.\nAnd the nasty observations about her, her marriage and husband all made up. I literally don’t get it.",
          "id": 174,
          "comments": [
            {
              "score": 43,
              "content": "This is a true good AITA post, plenty of divisiveness in the comments. This reminds me of the time my roommate would walk out in his boxer briefs were it would tightly hug his junk when I had a date over. I definitely told him not to wear that out of his room, and he understood.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "This sub loves to diagnose mental illnesses and tell OP to get a divorce. I’d never feel comfortable wearing the outfit OP attached around my brother in law. I also wouldn’t feel comfortable with my sister wearing it around my partner. I ALSO wouldn’t feel comfortable wearing it in front of my mom! The little sis needs to get some sleep shorts and a t shirt like the rest of us, not wear a silk dress to sleep that obviously makes her host uncomfortable- no explanation required",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "[removed]",
              "id": 177,
              "comments": [
                {
                  "score": 16,
                  "content": "I usually hate \"if the gender were swapped\" argument but honestly, if it was a guy walking around in shorts that made his sister-in-law uncomfortable, the reaction would have been completely different.",
                  "id": 178,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 198,
          "content": "Same. In my mind it doesn't matter why op is uncomfortable, that's ops business. It's ops house. I mean be respectful. Op didn't say hey don't wear this, she said don't wear it where my husband can see. She is disrespecting op and ops kindness by saying your house rules don't matter. Whatever the reasoning op has for requesting she doesn't wear it in common areas, it's irrelevant. I'd be having her find somewhere else to stay if she basically said fuck you, your feelings, and your rules.",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Seems most of people haven’t been around a large pair of unbridled breasts in a silky nightie. Or they have flat chests…… Or they are wishing this would be normalized so their SIL would do it….. \n\nSilky nightgowns tend to drape the body in a particular way, this isn’t grandmas cotton Mumu we are talking about. I wear mine for very particular reasons, and it isn’t to get some milk at my siblings house, especially while I am there freeloading.",
          "id": 180,
          "comments": [
            {
              "score": 23,
              "content": "Right? Other parts of this comment section people are pretending silk is exactly as revealing as normal tshirt cotton. Like this comment section is an alternate reality or something.  \n\nI had a small chested female professor once wear a silk shirt without a bra. Shirt was extremely modest and she had small breasts but by the end of the class none of us could look at her because her nipples were straining so hard against her shirt that it looked painful. I am guessing she literally never did that again. There’s *a reason lingerie is made out of silk and lace and its not that theyre modest materials*\n\nETA: someone just told me in another part of this post that they wear satin shirts with no bra to the office. Lol. I can’t. The small chested, small nipple life must be interesting.",
              "id": 181,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "God. This. I am FAR from a prude. But thats a really thin silk nightie. Making sure the people who are kind enough to let me into their home know the exact shape and size of every bump and divot on my areolas isn’t the hill I would die on and I’m kind of disturbed everyone in this post is acting like thats cool.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Exactly! If the person who is letting you live with them rent free as an issue with you walking around in lingerie, they have a right to have an issue with you walking around wearing lingerie, you are living in their house rent free!",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "It feels like this whole thread forgot that ESH exists. \n\nIs OP ridiculous for freaking out at a reasonably modest nightgown because she \"doesn't want to fight with her husband\" about it? Yes, absolutely. You can make your own rules in your own house but if your rules are ridiculous, you're an asshole.\n\nIs OP's sister ridiculous for responding with \"this is my lifestyle\" instead of throwing on a bathrobe when she leaves her room at night? Yes, 100%. When you're a guest in someone else's home, if they request you do some small thing to make their life easier and you don't just because you think that thing is silly and slightly inconvenient, you're an asshole.",
          "id": 184,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "Right! Like when someone has a dress code for a wedding you have to follow it. Why is this any different.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Agreed. NTA. Letting someone stay in your home, even if they were paying rent, is an unbelievably huge favour.. And in OP's case this sounds like a situation where she even has to pay out her own pocket to support her sister like for groceries, considering the sister doesn't have a job.\n\nDon't let this comment section gaslight you or be a doormat, OP. You are valid to have boundaries.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1858,
      "content": "Tell me you’re incredibly self conscious and distrusting in your marriage with out telling me you’re incredibly self conscious and distrusting in your marriage. YTA.",
      "id": 187,
      "comments": [
        {
          "score": 155,
          "content": "Exactly. OP posted the dress as if that was the smoking gun...\n\nIf OP's husband is the hormonal creature  that OP seems to think that he is, then her sister could wear a full body onesie and he would still shoot his shot.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": ">incredibly self conscious and distrusting in your marriage\n\nEven if true, I fail to see the reasoning here that makes her TA. It's clearly an insecurity she has that she asks he sister to no exacerbate while she graciously gives her a roof over her head.\n\nMaybe it's an anxiety problem she has maybe it's not. Whatever it is, she's just asking her to cover up. Wearing PJs over a night gown in exchange for living under someone's roof for free really isn't unreasonable. And she's really not TA that everyone is making her out to be just because she's trying to sort out her \"insecurities.\"\n\nPeople seem to draw the line at lingerie anyways, a pretty arbitrary line if you ask me. Why not just let her go full nude? Or are we also arbitrarily defining acceptable insecurity lines for everyone else? Her line is at a night gown that is knee high... fair enough.\n\nNTA",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Dude seriously fuck this attitude. The judgment of OP and the brazen entitlement in these comments is grossing me out. \n\nSilk nightgowns are sold in the lingerie section. They are super popular for honeymoons. They aren’t sexy bc of how much skin they show, but bc the very thin and slinky way silk hangs leaves very little to the imagination. \n\nBut even if it’s not sexy: If I am letting my adult sister stay in my home because her life is falling apart, for free, because I am willing to be mildly to greatly inconvenienced in my own home for the foreseeable future to help her, and she can’t even have the respect and decency to make sure that me and my husband don’t feel imposed upon let alone uncomfortable in our own home, that would make my sister a fucking asshole. And I would not be “insecure” for that pissing me off.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1599,
      "content": "INFO: It seems like a piece of this is missing. Do you mean \"wears silky nightwear with clearly nothing else underneath?\" Or does your husband have some sort of weakness for silk? And why haven't you just asked her to put on a robe rather than change her lifelong style of dress?",
      "id": 191,
      "comments": [
        {
          "score": 1062,
          "content": "This is what I'm wondering, too. I'm a little bothered by all the y t a comments without a bit more context. There's a LOT of selection in \"silk nightwear\" that can range anywhere from what is basically a muumuu to what most people would consider lingerie, especially if not wearing underwear underneath, which I would guess is the case since who wants to wear a bra to bed??? I sure don't. But I also definitely wouldn't wear a slip type nightgown without a bra anywhere my BIL might possibly see, especially if my own sister was uncomfortable. \n\nI'm leaning towards e s h just because the OP definitely seems to have approached this really aggressively with the sister and does come off as very controlling and insecure, but on the other hand, different people have different standards of modesty and there should be at least some effort on the sister's part to not make her hosts uncomfortable in their own home. Why hasn't a robe been suggested by either of them? That seems like a great compromise for everyone.",
          "id": 192,
          "comments": [
            {
              "score": 260,
              "content": "I agree I’m wondering if it’s a body hugging lingerie type of night clothes she’s wearing. But at the same time she approached it wrong, suggest she wears a robe when she leaves her room. And I agree I wouldn’t go somewhere my bil could possibly see me with a silky nightgown with no bra.",
              "id": 193,
              "comments": [
                {
                  "score": 131,
                  "content": "tbh i’m not sure how else she should’ve approached it? she asked her to wear something more appropriate and the sister just said that’s ridiculous. there wasn’t really room to negotiate or anything. it’s weird to me that the sister didn’t care how OP felt at all. like…if something i was doing made my sister uncomfortable i would at least consider an alternative…even if *i* personally wouldn’t be uncomfortable if it was reversed & especially if she was housing me up",
                  "id": 194,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I think we’d need to have witnessed the actual conversation to really know about the approach. She could have said “I’m sorry but I feel uncomfortable with you wearing a nightgown around the house, I know it sounds like a little much but do you mind wearing other pajamas?” or “are you serious walking with that trashy outfit in my house? Put on some pajamas or get out” and I mean that would *really* affect the ruling on this post lol",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": ">suggest she wears a robe when she leaves her room. \n\nThat would be my suggestion.  It doesn't have to be a heavy robe, a duster would do.   \n\nI prefer nightgowns and have a collection of robes/dusters in different weights.  And I really think her to push pajamas is weird.  I haven't owned a pair of PJs since before I finished high school because I find them uncomfortable.",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "Yeah I’m picturing a silky nightie type of thing. Like a whisper of silk over your bits thing. That would be a bit too revealing around a brother in law. \n\nBut she’s not terribly specific. Which would def help the rest of us to judge the situation",
              "id": 197,
              "comments": [
                {
                  "score": 26,
                  "content": "Hell I have strappy cotton nightgowns that could be considered too revealing. The material doesn’t even have to be silky, so I could definitely see her having an issue with silky material if she’s not wearing anything underneath",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "If she’s in her nightgown and wants to feel comfortable, then she’s probably not wearing a bra or much of anything  underneath. I always wear nightgowns similar to what OP described and I wouldn’t really want to wear them around anyone I’m not intimate with because of how revealing they can be",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Right? I feel like the easiest solve if the gowns are a bit too sexy is to just ask her to wear a robe in the common areas. She shouldn’t need a whole new set of sleepwear that OP must approve. And it shouldn’t be this weird and dramatic?",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1498,
      "content": "NTA\nSilky to me implies thin and clingy. Noone needs to see all that. Get a robe.",
      "id": 201,
      "comments": [
        {
          "score": 515,
          "content": "This is my take. I can't believe all the people saying NTA and that it's perfectly fine. I took it as lingerie style nightwear which I don't think is okay in this situation.\n\nEither way it IS her house so it should be HER rules. Period. It's also not an unreasonable ask considering she's is living with them for a period of time.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 208,
          "content": "I am by no means a prude and I wouldn't walk around anyone in my extended family in a nightgown like that. I'm stunned by all these comments saying YTA. Throw a robe over your nightgown, it takes two seconds and makes everyone comfortable in the house.",
          "id": 203,
          "comments": [
            {
              "score": 34,
              "content": "Right? I have had friends and extended family live with me and there is an unspoken rule to generally not wear clothes where your genitals (for both) or nipples (for the women) are extremely visible. Thin silk nightie does not pass that test. \n\nIf this was a dude walking around in silk boxers with the outline of his junk clearly visible would we all be accusing the spouse of being a cheater for asking the guy to wear thicker shorts?",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yeah I mean, as a guest I wouldn’t feel comfortable wandering around someone’s house with my nipples and every curve visible through the thin fabric. Also ‘knee length’ isn’t very long depending on how you’re built, on me I’d be very self conscious of it riding up and flashing my arse when I bent over. Get a dressing gown and embrace the snuggliness.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}