{
  "post content": "Hey y'all. Long time lurker and I know that there've been a ton of posts that usually make the euthanizer the asshole. I am fully prepared to be called an a-hole here, but I do not regret what I did. Also I'm pretty intoxicated and just saw a post that reminded me of this so here it goes.. Cheers to autocorrect.\n\nIn May, I (27m) moved back home just for the time being to save some money in order to buy a house within the next year! My sister lives at home while she finishes college. She had a golden retriever for 10 years. She loved him and took him with her almost everywhere that he was allowed to go. \n\nJonny (the dog) was very very sick. He went from 70 lbs to barely 50 lbs in two months. You could see his rib cage, he was shedding like crazy, and he peed AND pooped blood. She took him to the vet in July and the vet strongly advised, almost begged, her to euthanize him because Jonny could barely walk and hardly acknowledged outside stimuli. He had severe liver failure and there is no cure. She refused because she is categorically against euthanasia, and the vet could not legally do it without her permission. He gave Jonny painkillers which was good. I'm no fan of euthanasia, but looking at that dog was devastating. He laid on his side all day and was starving to death. Additionally, I did research and the vet could report her to the police for animal cruelty. That would give her a record and potentially bar her from ever owning an animal again. I know she loved Jonny, and she's probably going through severe emotional distress, but I don't think that excuses cruelty. \n\nA week later, I spoke with my mom and she said that she wouldn't be the one to take him to the vet, but if I did it she would be thankful. My mom is very squeamish and yes, I'm annoyed that she left this up to me. Jonny is under my mom's name because my sister was 11 when she got him. With her written permission, I took him to another vet for a second opinion. I told my sister what I was doing and she screamed, cried, and tried to stop me. I really wanted to give her the chance to say bye to Jonny and come with me. My mom backed me up and held her off while I left. The vet agreed that he was terminally ill and in unmeasurable pain. I even asked if there was a possibility to admit him to a doggy hospital to put him on an IV and have him die naturally, but more humanely. That was not an option and she euthanized Jonny. This happened in July and my sister still won't talk to me. I moved in with a friend a week later because I didn't want to cause my sister unnecessary distress and honestly, I'm still annoyed at my mother and sort of traumatized from all of this. I recently had a flashback of it and it sucked. I knew that this would ruin my relationship with my sister, but I did it anyway, so that makes me feel like an asshole. However, the way I see it is, I would never leave a family member to die on the living room floor, even if a relative that was closer to that family member demanded it. \n\n\\*\\*Edit\\*\\* grammar and gotta say my sis has been vegan since she was 12 so the anti-euthanasia is suuper deep-seeded. I appreciate y'all telling me that she might get over it someday, but I'm not banking on it. ",
  "id": 1,
  "comments": [
    {
      "score": 4157,
      "content": "NTA. That is such a terrible position to be in and you’re right, you would never leave a family member to die a slow painful death on the living room floor. Your sister’s dog was truly suffering according to 2 veterinary professionals and you just did the best and most compassionate thing for the dog. Even if your sister has a hard time understanding and accepting what had to be done, that does not make you the AH.",
      "id": 2,
      "comments": [
        {
          "score": 794,
          "content": "Thx bro",
          "id": 3,
          "comments": [
            {
              "score": 923,
              "content": "Not choosing is a choice in and of itself. With her inaction she made you put her dog out of his misery",
              "id": 4,
              "comments": [
                {
                  "score": 548,
                  "content": "This so much. One of my 2 cats is in what will be his last illness. He's not where Jonny was, but I'm watching very carefully to try to make my best judgement call. I don't want to make this choice, but I adopted him, and that includes giving him the best death I can, so that he doesn't suffer.  And it sucks. \n\nI so much sympathize with your sister not wanting to let the dog go, but I cannot sympathize with her choice to let him suffer a painful death. NTA, but I'd say your sister is, and your mother is a little for making you go alone.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 132,
                      "content": "I feel you, my cat has enlarged kidneys and once he got so sick that he stopped eating and was peeing blood on the daily basis. We took him to the vet got every diagnostic under the sun, from X-Rays to Sonography. But luckily Sonography gave the diagnosis and we were able to get him medication. But for a moment there I thought that he won't live and if he did live it would be with pain, I told my parents that euthanasia is an option that's heartbreaking but needs to be done if he isn't showing progress within the week. \n\nIt's heartbreaking but these animals can't speak and since you need to take a decision for them, even though it's heartbreaking to you or goes against your principles because they don't deserve to be in pain and suffer because you are against something.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 92,
                      "content": "Totally agree. I am right there with you. I’m sorry you are going through this too. My poor 17 year old cat has an aggressive tumor on his shoulder. The surgery to fix it would remove his whole front leg (and they still don’t think his life would be extended by much). My whole family is just giving him extra love and watching him closely. We don’t want to end his life prematurely, but we also don’t want him to be suffering all the time. It’s really tough, but it’s my responsibility to do what’s best for him. \n\nOP, you are NTA. You did what was best for that poor dog.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "I had to make this call a few weeks ago. My cat was the light of my life. Everything I did was for him. Making the decision was so hard.. but he was very old and very sick. The vet said it was the right call, and I know it was. I'm still heartbroken, but I'm relieved that he's at peace.\n\nOne of my favorite quotes is:\n\"The reason I love animals so much is because the only time they break my heart is when theirs stops beating.\"",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Sending thoughts you way. Got the call about aggressive feline lymphoma this week so I’m in the same boat, watching so I can keep her as long as she’s not in pain.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I'm in a similar position. Our cat's old, wobbly, lost a lot of weight but he's still eager to eat and seems happy to wander around and do his thing. It's hard to make the call when they seem mostly fine but definitely old and we keep thinking it'll be his last day and then he perks up and wolfs down three full pouches of food, lol. When he stops being happy we'll have to make a call but we'd never leave him to suffer if we knew it was happening and he was pooping blood.\n\n(Enlarged kidneys, enlarged gallbladder, enlarged liver/tumour on his liver and there's not much they can do really because he's 15)",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "We are in the same position with one of our senior cats. It hurts, and it's going to be a tough call, but it's so wrong to let a loved one suffer just because you're going to miss one. Wishing you the best. <3",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I had one cat that had a mass in his intestines - couldn't pee/poop and he was in massive pain. There was nothing that could be done. It was very sad, but he would have been in agony.\n\nBut my dad had a dog that developed a cancerous  mass on her face. She ended up not eating/drinking much, but wasn't in pain. She seemed happy and got to live out her life (short, fortunately) and died peacefully at my dad's. \n\nSometimes it's okay to let a creature die naturally when it's ill, but sometimes it's unnecessarily cruel.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "We had to put our cat to sleep last year, and it was so hard. But in the end we only questioned ourselves about maybe having let it go too long and making him suffer. \n\nWhen I'm dying, I hope someone puts me down before I suffer too much. \n\nDon't take on an animal if you aren't willing to end their suffering. Of course it's hard, but it's when life is difficult that they most need us to do the right thing. \n\nNTA, OP. Your sister and to a lesser extent your mother, shouldn't have animals if they can't put their own feelings aside for those they say they love. And thank you for doing the right thing.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I've had to make that call a few times now. It's agonizing. Bless the vets who tell us it's time, and who help our friends move on. \nWishing peace and comfort for you and your kitty.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "My cat started going downhill pretty slowly last year; the biggest issue was that when she jumped off of something high her legs would buckle and it would take her just a minute or two to get up and the only other one was that she started using the litter box only sporadically. Nothing that impacted her quality of life which is why when she started going outside of the litter box we kind of just decided that it was something we could deal with until her quality of life *was* impacted. She was like 12 when it started which was when the same issues started cropping up in my other cat, but then in March of this year all of a sudden her back legs stopped working and she couldn’t control her bladder anymore in the span of literally 12 hours from the morning to the evening and that’s when we decided it was time. She actually died in my arms on the way to the vet, so we knew it would have been the right decision.\n\nFor my older cat I could not let go when it was time because I got her in 1st grade and because of that she ended up restricted to one room unless one of us had her in our bedroom because she started peeing on the hardwood. She stopped grooming herself and wasted away and I was brushing her daily and spending a lot of time with her but then her back legs stopped working. It still took me a couple weeks to put her to sleep after that because I loved her so much, and I will probably regret and feel guilty about that for the rest of my life. It was so hard seeing her suffer but I justified it because I was still doing everything I could to keep her happy and she was still purring perpetually when I was spending time with her. It was wrong and selfish and I can’t imagine ever doing it again, especially under the guise of caring about an animal’s right to be alive. Which is why I made the difficult choice pretty much immediately with the cat we lost in March.\n\nGod I’m crying just typing out what I did to the one and thinking about the more recent loss.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Totally agree. I had two cats.  One of them got sick, we brought him to the vet, got him on meds and he seemed to be on  the mend. Still some issues, but I desperately thought (hoped) he was getting better. Came home one day to find he had passed away,  alone. \nWith my next cat (they were similar ages) he started showing the same signs a couple years later.  I kept a close eye on him and made the call to let him go before he was in too much pain. \nCould I have pushed it a month or two? Maybe. But it would have been a selfish act for me and not for him.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 233,
              "content": "Vegans are opposed to the suffering of animals. Your sister doesn't fully understand the platform.",
              "id": 17,
              "comments": [
                {
                  "score": 30,
                  "content": "I'm also very interested in what the vegans in her circle would say about this. I get their point on a lot of issues but I'm pretty sure they would shred her for acting like this.\n\nNTA. I might be extreme but if sis ever gets another dog and allows this to happen again I'd steal it and have it put out of its misery someway.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 20,
                      "content": "That's when you let the vet report her to police so she can't get another pet.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I was thinking the same thing.\n\nI am a vegan, and I think her action to not euthanize the dog is actually quite cruel. The whole point of being vegan is to make sure no animal suffers. That's what many of us want ultimately. And painful as it sounds, that can include euthanizing a dog that is very clearly suffering from a condition that has no cure.\n\nI understand from the sister's point of view it must really hurt to part ways with a companion you've had since the age of 11. 10 years is a long time, no doubt.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Came here to say this ^",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yeah if I or my dogs were like that I would ask to have them put down",
              "id": 22,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Jesus. NTA of course. I’m on break rn and this shit made me tear up. Reminds me of my best friend. She got lung cancer and I had to take her. As much as I miss her, I couldn’t let her go through more pain.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "not sure if this helps but might be something you could tell your sister from another vegan (myself).\n\nthe main point of veganism is harm reduction. i adore animals. i’ve had lots of pets and they’re one of the only things in life that give me joy. however; prolonging your pets suffering is doing harm. it’s never easy to lose a pet. they’re members of the fam ! but there’s only so much prolonging you can ethically do. i’m not sure where her euthanasia beliefs come from, because most other vegans i know are in favour if it reduces harm and suffering. i don’t know if she’ll listen or will accept it, but it might be worth mentioning. you absolutely did the right thing. i’m sorry the need was put on you, and i know how upsetting and difficult it is, but i guarantee the dog is better for it, and i hope you can feel even a little bit positive that you prevented him from further suffering.\n\nedit: i’m 22 and a half, have been vegan since i was 15, veggie since i was 11. hopefully that would prove to your sister that i’m also very serious about this.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "[deleted]",
          "id": 25,
          "comments": [
            {
              "score": 30,
              "content": "NTA. You helped ease that poor dog’s misery. He was clearly suffering. It breaks my heart every time I’ve had to say goodbye to a pet but part of responsible pet ownership is being able to say goodbye and prevent that animal from suffering. \n\nAs far as being a vegan, that still has nothing to do with humanely putting a suffering animal down. I cannot fathom how much that dog was hurting especially if he was pooping and peeing blood. In humans that is a horrible sign and to ignore it for 2 months is just plain horrible. To be honest it’s actually neglect if not full on abuse.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 64,
          "content": "To be fair, lots of people watch their family members die slowly in the living room. They are given pain killers so it’s not too painful (just like this dog was) and, in most states and countries, it’s super duper illegal to give them the kindness OP gave his sister’s poor dog. Something to think about there.",
          "id": 27,
          "comments": [
            {
              "score": 75,
              "content": "Yep, for sure. Not even going to beat around the bush on this: I am pro-euthanasia for the terminally ill, animal and human both. I think there would likely need to be a higher bar for entry for humans (verified by X physicians, completed Y counseling sessions for both patient and family, etc.) but I absolutely believe it should be an option.",
              "id": 28,
              "comments": [
                {
                  "score": 22,
                  "content": "Assisted death is an option in several countries and in some US states. The bar is pretty high for qualification, though  You have to be terminal, you have to ask officially several times, and you have to be of sound mind (I believe a psych eval is required). But it is possible for some people.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yes, I am aware it is an option in some places, but I was speaking more generally/believe it should be an option *everywhere,* as a basic human right. I’ve admittedly not looked into it recently at all, but the last time I was reading up on it, it seemed it was difficult for non-residents to qualify for physician-assisted death, the difficulties of traveling while dying aside. I wonder if that has changed at all.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I'm Belgian, thank God or Science, that our laws are pretty 'mild'.  We sometimes even grant them for people who are suffering mentally but that is, understandably, a long and trying process.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Same.\n\nI watched my Pamps suffer for 4 years, and his last year was especially brutal. He at one point BEGGED my Nan to put poison in his tea. He had dementia and was constantly having mini strokes every day. Towards the last year of his life, he had another actual stroke (wasn't his first), paralyzing half of his body and his esophagus. He couldn't eat solid foods anymore and he couldn't speak anymore. \n\nI literally watched him slowly turn into a shell of his former self. I have photos from when he passed and if I were to show someone, you'd think he was just sleeping with how much better he looked dead (no touch-ups were done as he was cremated).",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "There is a group that humanely assists people in committing gentle suicide when their terminal illness has reached a point where life is not worth living (due to pain and inability to function, NOT due to depression). They provide the tools and explain the procedure and all the person has to do is be able to lift their hand(s) above their head and have the strength for a simple task I won’t outline here. They provide this service across the nation and the people who are part of this organization are saints in my book.\n\nI know about them because I had to contact them on behalf of a good friend who’s father was dying in a very painful and miserable way from advanced system cancer. He’d had several conversations with my friend, begging her to “bring him his shotgun” before he was too weak to use it. The woman I spoke to at the organization was profoundly kind and gentle as she walked me through options and even gave me advice to pass on to my friend for questions to ask her father’s medical team. I won’t name them here but if anyone is interested in learning about the group or would like to contact them about their assisted-suicide services for a loved one, please DM me.\n\nETA: my friend’s father ended up passing before we could move forward with using the service, but they still provided great comfort in a terrible time of need. The thought that someone would not use a similar, widely available resource for their animal to end their pain simply breaks my heart.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That’s true. There’s a huge taboo around assisted death for people even if they’re terminally ill and suffering.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is why we should help our animal friends, because we can. My grandfather would have wanted to have had this help rather than the horrific cancer death he suffered because things like this for humans are illegal :(",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Hijacking this to say that mom will want her medical affairs seen to you by you or some one else. If something terrible happens to her, your sister will keep her on life support forever. She will not do what is best for your mom. I am so sorry for what happened but you did right by the dog. Rest easy in that knowledge. You did what was right and humane.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I had a dog from the ages of 4-16, almost 17. I loved him to bits, he was my best friend in the entire world. He was a gorgeous champagne German Shepard and I spent almost everyday with him. One day we woke up and he was lying on the floor outside (he was an inside dog, so unless we were going on a walk or he wanted to be in the garden he was kept in the house), his stomach was so bloated he looked pregnant and he could barely move his head. We took him to the vet ASAP, and he had to be put down. What happened was his stomach filled with gas and flipped and ruptured- this is really common in large dogs of any age so if anyone here has a large dog I really recommend you read about it and prevent it as much as possible. He was pretty old for a gsd, though he was always in great shape no matter what we would’ve done he would die anyway. It was terrible, it was sudden and one of the worst times in my life but I’m glad he didn’t have to suffer for long. I get that it must of been so difficult for your sister, but what she did was selfish and cruel. I don’t think she should have any more pets.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2384,
      "content": "Isn't part of the point of veganism the reduction of animal suffering that we humans cause? How is \"I am going to let this creature who is under my care die a slow, agonizing death\" anything but a rejection of one of the basic tenets of veganism? She did exactly what vegans accuse factory farms of doing - causing animal suffering for human benefit. Maybe she gets over it when she realizes what a flaming hypocrite she is being.\n\nNTA.",
      "id": 38,
      "comments": [
        {
          "score": 769,
          "content": "As a vegan I can say that what his sister did had nothing to do with veganism. How can anyone claim to be vegan and be okay with watching a dog slowly die a painful death?\nThat's not even legal in my country to send that dog home. The vet would most likely get reported for animal cruelty.\n\nIt had all to do with her selfish emotions. SHE couldn't stand losing her dog. So the dog had to suffer because of her hurting",
          "id": 39,
          "comments": [
            {
              "score": 128,
              "content": "As a vegan, second this",
              "id": 40,
              "comments": [
                {
                  "score": 84,
                  "content": "As a vegetarian who would be vegan if it were medically possible, I third this.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 55,
                      "content": "[deleted]",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Compete side bar out of curiosity. \nWhat makes it medically impossible for you to be vegan?",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 41,
                  "content": "me threeth",
                  "id": 44,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Me foureth",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I was gonna say, in the UK a vet would never send a dog who was that sick home.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "I always thought hardcore vegans (is that an acceptable way of describing the more purist ones?) were against pet ownership in the first place?",
              "id": 47,
              "comments": [
                {
                  "score": 26,
                  "content": "[deleted]",
                  "id": 48,
                  "comments": [
                    {
                      "score": 9,
                      "content": "but buying pets encourages those people to keep breeding them. Better to adopt!",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Thank you! I must confess I've only read this from articles and people claiming to be vegans online, not from the very few vegans I actually know, so I'll adjust my viewpoint. I did some research when I went plant-based but obviously not enough!",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I've heard talk along these lines out of PETA. I've never heard it from any vegans I've encountered that are not directly associated with PETA.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I wouldn't be surprised to hear it come from other extremist ARA groups, like ALF.\n\nThere's also a number of incidents of people with service dogs being harassed.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Nailed it.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Extremely well put.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Unfortunately a lot of vegans really don’t view it objectively when it’s their own pets. Every life of an animal needs saving and they can sit there and make animals suffer like this long after they should have said goodbye and done the right thing. But in their heads they’re in the right.",
          "id": 55,
          "comments": [
            {
              "score": 46,
              "content": "Unfortunately, a lot of DOG OWNERS*, FTFY.\n Ive seen this more with people who own pets than Vegans who own pets. Generally, it's people who don't understand animals and the pain that they go through that don't see euthanasia as an option.",
              "id": 56,
              "comments": [
                {
                  "score": 4,
                  "content": "People in general hate euthanasia. Hell, just look at the talk about \"post birth abortions\" when the discussion that people are really trying to have is about letting terminally ill newborns who have an extremely short life expectancy pass peacefully instead of their entire existence being pain.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "To be 100% fair, ANY PET OWNER can't be objective when it's their pet. \n\nI am not a vegan, but I am a pet owner, and while I would never make my pet suffer THIS much, I would not be able to be completely objective about their end of life care. And I know plenty of non vegans who have made just as terrible, cruel decisions about their beloved pets because they couldn't come to terms with their death. \n\nNothing to do with dietary ideologies and everything to do with emotional maturity. It's far more likely the sister has just never lost her own pet before, never had to face their death, and was struggling.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Source for this bs claim? His sister is ONE person who felt that way .",
              "id": 59,
              "comments": [
                {
                  "score": -1,
                  "content": "There are plenty of sources in regards to vegans neglecting their pets health, but I've only seen reports regarding their diets.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 11,
                      "content": "A small handful of vegans, sure. Almost all vegans feed their pets appropriate diets or only keep herbivores as pets. Literally every vegan resource I've ever seen explains that obligate carnivores can't be vegan and its cruel to fees them plant based food. Some don't keep pets at all. \n\nNon-vegans can also feed their pets shitty cheap kibble (thats largely plant-based mixed with slaughterhouse scraps), and abuse their pets, or give them lackluster care and fail to meet their needs. \n\nActing like vegans are uniquely delusional or bad at caring for animals is just, well, wrong and unhelpful.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I have been a vegan for several years (and vegetarian since I was 10, over a decade ago) and this April I held my 15-year-old dog in my arms as she was put to sleep. So how about we don't generalize this as vegan issue, since I'm certain your \"source\" for this claim is just as anecdotal as my story.",
              "id": 62,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Not true. What's your source for this?",
              "id": 63,
              "comments": [
                {
                  "score": 18,
                  "content": "I know plenty of people who have acted this way with their pets at the end, so personal experience. I’m not talking for ALL vegans obviously. I’m just saying being vegan doesn’t automatically make people make the right choices in regard to animal welfare when personal feelings get involved.",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Nothing to do with vegans, this girl just pushes her diet choice as her reason for animal neglect. I'm not sure why some pet owners do it. I know an older couple (not vegan) that has had not one, but 2 cats die slowly from kidney failure as they aged. They just watched their cats wither away to just skin and bones until they found them dead in the house.",
              "id": 65,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I understand not feeling like you could face putting down the pet you've had since you were 11 but the sucky part of pet ownership is that at some point you need to make a decision that is for them, not you.\nTotally get why this was devastating to her but OP did what was kindest for the dog even if it felt very unkind to his sister.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "The hypocrisy gives me PETA vibes",
          "id": 67,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "It is. As a vegan, I feel genuinely angry that people like this claim to be one as well. I also don’t know how she could watch her pet suffer like that - I cried when I accidentally kicked my cat after she suddenly walked out in front of me, or when they’ve shown any signs of distress.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "If this was an animal in the wild, it would probably have died a lot earlier on in its illness due to lack of medical care, starvation or predation.",
          "id": 69,
          "comments": [
            {
              "score": 3,
              "content": "And much more horribly. Predators don't generally care if their prey is dead before they start chowing down.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Exactly!",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I'm gonna say NAH. Not because the sister wasn't wrong, or her actions weren't directly contradictory to veganism as you're right to point out, but because she was in a completely irrational state. She wasn't acting out of greed or selfishness. This dog has been her best friend since she was a kid, and we as human beings have a (under normal circumstances) healthy instinct not to harm our loved ones. In her grief, she couldn't see that her unwillingness to act was torturing her pet. Killing her own dog was simply a psychological barrier she couldn't cross. \n\n\n\nShe needed someone to step in, and OP did the right thing. While she should have had the strength and rationality to make that choice herself, the fact that she didn't doesn't make her an *asshole* imo. In a year or two...or three... she'll probably look back on it and thank him.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 581,
      "content": "Nta you did the right thing. The dog was suffering and your sister should have been mature enough to recognise that and end his pain gently. She is an A.\n\nYour mum is also the A for not doing this herself.",
      "id": 73,
      "comments": [
        {
          "score": 124,
          "content": "Thx bro",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 525,
      "content": "NTA.\n\nYour furry friend was in pain and, while I know your sister loved him, it was time someone put his needs first.\n\nBut why did your mom leave you to do the “dirty work”? \n\nThat’s a major AH move and she should have stood up for the needs of the animal that she was legally responsible for long before you approached her.",
      "id": 75,
      "comments": [
        {
          "score": 263,
          "content": "She hates conflict to an unhealthy extreme and is extremely passive. This isn't the first bad situation that she has ignored just to avoid confrontation.",
          "id": 76,
          "comments": [
            {
              "score": 48,
              "content": "She could have taken him to the vet while your sister was elsewhere, and told her he died on his own. What a terrible burden to put on you, but I think you did the best thing for the dog.",
              "id": 77,
              "comments": [
                {
                  "score": 14,
                  "content": "I've been trying to convince my mom to put down our 20 year old dog. He's blind and deaf and has no teeth and has seizures, although from what the vet says, he's not in pain. But it's like... what kind of life is that to waste away? There's many different kinds of suffering. \n\nAt the same time, my mom watched her *mother* waste away from dementia until she starved to death, essentially, and that only made her less inclined to euthanize. So the affect of death on people can sometimes have weird and backwards effects.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 1,
                      "content": "If your dog isn’t in pain, it’s amazing what animals will push through and be happy. As I type this, my deaf/blind, cerebellar hypoplasia cat is purring with her nose as far into my ear as she can get it. \n\nTry to clear your mind of preconceptions, forget how you’d feel with his limitations and look at him. Does he still get exited when he smells you coming into the room? Does he still scarf his food like someone’s gonna steal it? Does his leg still thump when you scratch him just right?\n\nAnimals are amazing and often so much stronger than we give them credit for. If your dog no longer seems to find joy in the things he used to love then yes, it may be time to say goodbye, but he might not be that far gone just yet.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 281,
      "content": "NTA - your sister is cruel. if you love an animal, you don’t let it suffer. \n\nsource: i have 21 cats & do rescue.",
      "id": 80,
      "comments": [
        {
          "score": 38,
          "content": "I agree with this, and I do the same too! I fostered cats for a short time at the cat rescue I used to volunteer at :) \n\nNTA OP. If I was like losing a kidney or organ or going through some sort of extreme and awful suffering, and I knew there was no saving me, I’d want someone to put me out of my misery as politely as that would sound.",
          "id": 81,
          "comments": [
            {
              "score": 15,
              "content": "It’s interesting how assisted death for terminally ill people is only legal in a handful of places compared with animals.",
              "id": 82,
              "comments": [
                {
                  "score": 15,
                  "content": "Tbh, in many places society hasn’t truly progressed to a point where we could be sure it would be ethically practiced. The US, for example, is *not* to a place where I’d personally trust it wouldn’t be used disproportionately on low income, people of color, immigrants, and other vulnerable, historically discriminated against groups. Theoretically I believe people should have that right, but practically, we have such a long way to go before I believe it would be implemented ethically.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Can you expound in this? I’m genuinely curious. \nThe way it’s set up in Oregon, the person has to request it, and then a doctor prescribes the meds. How can they be used against anyone? \nIf you’re talking about incapacitated people, we basically already have it, any family can pull the plug on the ventilator.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I want 21 cats. I just have one and he is a rescue. Can you please give cat tax, with as many in the photo as possible??",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Jesus Christ how does someone have 21 cats",
          "id": 86,
          "comments": [
            {
              "score": 9,
              "content": "I live in an area where people don’t know how to spay and neuter their fucking animals & people like to dump them on me. Also, I assisted my coroner in a rescue of a dead man’s 42 cats and brought home 8. In reality I have 21 but am financially responsible for another 4 that i co parent with a neighbor who is not as financially capable as i am.",
              "id": 87,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I agree. I've only had 2 dogs. My first one (a Bassett hound) had to be put down very suddenly.  I was devastated and cried for weeks. Even years later I still cry.  But he was suffering,  it wasn't fair to me to let that happen.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "How do you deal with 21 cats?! I’m a dog guy so I may not understand the dynamic. But what the fuck",
          "id": 89,
          "comments": [
            {
              "score": 3,
              "content": "honestly, i don’t know some days. it definitely gets overwhelming and exhausting. there’s just not really a choice, most of them are unadoptable. shelters & rescues are full (all of my local places have close to 200 cats.) no one knows how the fuck to fix their cats around here.  i mean, last night an acquaintance of mine went and picked up 7 cats because someone dumped their cats in a local park in a fucking cardboard box, taped shut, and wrote “free kittens” on it. they all still had collars. this is 100% not the life i had planned but someone has to do it.",
              "id": 90,
              "comments": [
                {
                  "score": 2,
                  "content": "Well. You’re a saint.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 134,
      "content": "NTA.\n\nHe deserved a painless way to go. As his owner that burden should have been your sister's first and foremost, and then your moms.\n\nYou did the right thing despite cost to yourself.",
      "id": 92,
      "comments": [
        {
          "score": 21,
          "content": "This is something most pet owners will need to reckon with in their lifetimes. It’s one of the hardest things to think about for me even with cats aged 4 and 2. It’s the reality of owning a pet and no matter how much the human suffers afterwards in mourning, it’s cruel leaving a terminally ill animal alive out of selfishness. Agree NTA and you did the right thing. I hope your sister comes to see that soon and especially before getting another pet",
          "id": 93,
          "comments": [
            {
              "score": 11,
              "content": "My cats are 14 and 13 and although they are healthy and have a lot of energy and life in them, they're still technically senior cats and I know my time with them might be limited. I might get lucky and have 6-7 more years with them, but I still cry sometimes knowing the end is gonna arrive eventually. I love these cats more than I love myself.",
              "id": 94,
              "comments": [
                {
                  "score": 3,
                  "content": "This January we said goodbye to our 10yo cat after a sudden kidney failure. The vet said there was no stopping it or fixing it, maybe a few more months of nausea, special diet and overall fatigue. We did what we could for him, which means we let him go.\n\nNow our other cat, 12yo, was diagnosed with injection site sarcoma, so another goodbye is coming.. maybe this fall, maybe next spring. When it becomes too much, she'll go without pain.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And it can’t help the mourning process to watch your  beloved friend suffer and to have those be the last memories.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": ">This is something most pet owners will need to reckon with in their lifetimes.\n\nI'm incredibly grateful I got to deal with that shit while I was still a child. I was only 3 when we had to put my mom's cat down, but I remember saying our goodbyes while she sat in a box in the front seat of the car. Shortly after we got our dog, and when I was 17 I held her as she passed.\n\nSome parents think they need to protect their kids from the hard shit in life. My husband had parents like that, who put their pets down while he was at school. Not because of some horrific accident, but because they *planned* it that way. He wasn't told until he came home to no dog, never got to say goodbye, and still gets upset when he thinks about it. \n\nIt sucks all around, but being able to hold your pet and say goodbye and thank them for their love is a blessing. Being able to look back and know you did right by your friend is worth far more than any extra time you may have squeezed out at their expense.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Further comment regarding the vegan part:\n\nIt has nothing to do with killing for food or sport, it's ending a life that has become torturous. If she fancies herself too \"pure\" to end that life, then she shouldn't have taken responsibility over it in the first place. \n\nIn the wild sick animals don't tend to suffer long, they become prey as their strength wanes, but the animals living under our wing are safe from that even when it would be a blessing for the pain to end. Anyone who's seen a terminally ill person, who is utterly beyond the end of their strength but whose body still refuses to die, knows that death is not always an evil thing, even if the parting pains us.",
          "id": 98,
          "comments": [
            {
              "score": 1,
              "content": "Well, yes, but top level predators often have a fairly slow death by starvation if they can no longer hunt. And in areas without sufficient predators, it can be a slow decline in prey species as well, especially large herbivores like deer. For instance, starvation is a common threat to feral horse populations like mustangs because they do not have any predators, which is why human intervention in the form of birth control and roundups to adopt them into human care is so important to their welfare.\n\nUnfortunately we have broken the natural systems that should exist. One time out in public land I found the disembodied leg of a foal stuck in a wire fence. No sign of the rest of it, but there's no way that it survived long because horses need all four feet to be functional (which is why I loathe rescues that try and do amputations on large animals - it's cruel and painful and quantity of life is not more important than quality).",
              "id": 99,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah, but under human care a sick animal can suffer for months or years far beyond it's ability to support itself in any mean or form.\n\nEven with Mustangs, which are not a native species but rather a foreign species introduced after Europeans showed up.. point being that most animals that size have a few predators that pick off the weakened individuals, but introduced species might take ages before a predator that's powerful enough to cull the population is introduced into the ecosystem.. so, again, a human introduced problem",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 73,
      "content": "NTA - that is so terribly sad. I had to put my dog down last year as he was in too much pain. \n\nIts kinder to put them out if their misery then let them suffer just because we would miss them if they were gone. That's just pure selfishness.",
      "id": 101,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 60,
      "content": "NTA It is an immeasurable kindness to see suffering in an animal and to do your best to cure or fix it. To leave an animal in this state would be cruel. When your furry friend has been a loyal companion to the end you should have the courage to be by his side and set him free of his suffering. I am so sorry your sister is being this way, it could have been so different but really, if she can’t take responsibility and care for an animal from beginning to end then she probably should not have any more furry friends:(",
      "id": 102,
      "comments": [
        {
          "score": 45,
          "content": "Yea I've been thinking about that a lot lately. If the cards turn out that she can't have another pet then I wouldn't be upset. I'm not going to be the person to bring that up though. I saw how much Jonny helped her through middle school, high school and college and that can't be discounted. She loved him and doted on him for most of his life.",
          "id": 103,
          "comments": [
            {
              "score": 10,
              "content": "Taking care of an animal during good times is one thing. But to be a pet owner you hav to be able to do what’s best for your pet in the hard times. Your sister and mom should absolutely never be allowed to own a pet again",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 40,
      "content": "I don't understand what the connection is with euthanasia and veganism.\n\nYour sister was willing to watch her beloved companion suffer a slow death because she is vegan? That doesn't make a lick of sense.\n\nShe's been vegan since she was a child so surely she must know there's no connection with euthanasia and veganism? Unless it's something like disagreeing with the likes of PETA killing animals unnecessarily? \n\n\nDid she tell you this herself or are you just assuming it? Genuinely curious.\n\n\nAnyway, back to the point. Assuming this story is true then you're NTA.",
      "id": 105,
      "comments": [
        {
          "score": 30,
          "content": "She is very against any human intervention in animal death.",
          "id": 106,
          "comments": [
            {
              "score": 62,
              "content": "Also her point is that in our state, physician assisted suicide aka DEATH WITH DIGNITY is illegal. Therefore, if Jonny was a person then what the vet did would be illegal. She also sees it as a consent issue because Jonny could not consent and we were making decisions for him. He never had any say in which dog food he ate or when he went for walks either. We followed the experts and walked and fed him as recommended! Honestly, I see her point but I more think that that's an argument to push for physician assisted suicide for humans, more than banning it for dogs.",
              "id": 107,
              "comments": [
                {
                  "score": 59,
                  "content": "Her point is stupid. Animals can never consent. As their caretakers it is our job to do things to keep them happy and healthy even if it’s something they wouldn’t necessarily consent to because they don’t have the intelligence to make the right decision. I mean, a dog would consent to drinking anti-freeze if given the choice because it tastes good to them. It’s the same with kids. Yes, as they grow they can start consenting to things, but overall as parents we have to make decisions for them that keep them healthy and happy. A toddler would consent to eating poison if we asked because they were curious about it. Consent doesn’t always equal good or right decisions.",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "The dog already made his choice by stop eating ( weight loss )\nThat is how animals \"do it\".\n\nThe hairball made his choice a while back already .",
                  "id": 109,
                  "comments": [
                    {
                      "score": 10,
                      "content": "tbh, whenever one of our elderly or otherwise sick dogs stops eating, that's when we know they've had enough, and we take them in so they can pass as peacefully as possible",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Animals stop eating because they have no appetite or they have severe nausea. It is not a conscious choice to die, and suggesting it is anthropomorphism.",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "That's awful. I honestly believe we humans should have the right to get \"the blue juice\" like our four legged friends when we're suffering with no possibility of recovering.\n\nBut that's neither here nor there. Her reasoning about the legality /human thing is something I can't agree with. I've always had a dog and have had to make that final decision several times over the years. It's not easy but it is absolutely the best thing so do for the pets you love.\n\nI hope you know that did the right thing regardless of your sister's odd beliefs. I also hope she can forgive you and understand why you had to do it.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "If I never did the things that my dog wouldn’t consent to if she could talk she would probably be dead or maimed by now. Flea preventative? Nope she doesn’t like it. Vaccinations? She can’t say yes so I should just let her take her chances. Not letting her run out in the street? Downright oppressive. Putting a cone on her to stop her from giving herself hotspots and/or making them worse? I must barely be human. I also have to stop her from eating things that could literally poison her all the time, but since she deserves autonomy to make decisions about her diet on her own, I must be a goddamn monster. Did she pet the dog? Because he couldn’t consent to that either.\n\nIf my math is right, our sister is what, 21 or 22? She is old enough to know logically that the concept of wanting consent from a dog when it comes to basic care and quality of life is ridiculous. Choosing to euthanize your pet when their quality of life is no longer there is what you are supposed to do as a pet owner and refusing to do so is cruel. I would stop avoiding her and just stick to one question every time she brings this up: Did you want him to suffer?\n\nAnd only accept a yes or no answer from her because that’s what this boils down to. Not euthanizing him was causing him to suffer. That is an objective fact. An animal cannot consent to any of the things we do to care for them. That is another objective fact. Part of caring for an animal is knowing when it’s time to let them go and that time should always be when there is no longer any kind of quality of life.\n\nI’m sorry for the long response this just makes me really angry.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 38,
      "content": "NTA. You did the humane thing. I hope your sister realizes that one day soon. Don't alienate yourself from her, though. Support her, love her, and help her through this grieving period if you can.",
      "id": 114,
      "comments": [],
      "relation": "Support"
    }
  ]
}