{
  "post content": "I'm a 13 year old girl and have played violin for around 7 years and am in my middle schools more experienced orchestra, I guess. I really don't want to sound overly confident or brag here, I'm just using the information so that maybe I'm not as much of an asshole as if I were to stay for a smaller level performance, know what I mean?\n\nOur family had planned a trip this October to visit my grandparents, for unfortunately what may be the last time. This trip just so happens to be planned the same day as the concert (they were unaware of this). I feel more disappointed than should be. I can't even understand myself on why I would want to postpone my trip in order to play for a middle school orchestra concert. I also found out this was the same day we take a group photo. I know, another terrible reason for me to stay. And no, I'm not saying \"I have to stay, or else my gorgeous talented self won't be in the group photo!\" It just makes me seriously happy to be there and play. Nobody has to notice me, I don't have to be first chair, I just enjoy it. I also acknowledge that it should make me much happier to be with my grandparents, and it does. It's extremely difficult to explain what I'm thinking at the moment. I myself am not completely sure why I seem to be obsessed with being at the concert.\n\nMy grandparents will be disappointed and my parents are too. I didn't think about that before being annoying, which is selfish.\n\nAfter being a selfish idiot for a few days, my mom scheduled my ticket for two days after the performance and my other relative who lives near us can take me to the airport. I'm not proud of this. I just need reassurance that I am in fact an a-hole.\n\nAm I being silly... AITA?!",
  "id": 1,
  "comments": [
    {
      "score": 7,
      "content": "NAH But I suggest you think hard about your choice, what if this **is** the last visit or they pass before you get there?\n\nI *truly* understand where you are coming from. I played first flute in the town concert wind band from 15 - 17. It was a huge deal to me. However, it’s one concert, there will be others, you only get two sets of grandparents, once they’re gone you’ll miss them like crazy.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA\n\nIt is actually sad your parents scheduled the trip without taking your important milestones into consideration.",
      "id": 3,
      "comments": [
        {
          "score": 5,
          "content": "Agh, sorry about that. I forgot to mention that they were completely unaware of the performance and no information was released on it before they planned the trip. Just edited my post. Thank you for your comment though.",
          "id": 4,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NAH, you got double booked.\n\nYou worked hard on orchestra and it would stink to not have the big night. A sign of a good compromise is that noone is particularly happy with the result, but noone is distraught.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA\n\nWhether you go for five days versus seven makes no difference.  You’ll be bored half the time anyway.  What’s important is that you go.  (Maybe take your violin?)\n\nI think it’s important to keep doing the things that are an important part of your life.  To me, the photograph sounds like it’s more important than the actual performance.  But this is a part of what you’ve been working hard for, and I think your parents are just dismissive of it.\n\nIf they really give you a hard time about it, you have a great comeback:  “if it’s so important, then why are we only going for X days instead of X+2 or X+7?  Why only X?”\n\nThe answer, which they will never admit, is that they recognize that life goes on, and X is an arbitrary number that is convenient for them, not everybody else.  There is zero reason to insist you go for the same length of time.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA\n\nCan you have someone record you? I’m sure your grandparents would love to see it and see it as worth it. Good grandparents don’t want their grandkids giving up what they work hard for. They want to dream of your future. Not for you to wallow as their long journey comes to an end.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "I would give my left arm if I could spend one last vacation with my grandmother. She was more of a mom than my mom. But it is up to you if years from now you look back and wish for a bit more time with them than being there for your performance.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA your being hard on yourself. There is nothing wrong with you going to that concert and if I read OP correctly I think its fine since your seeing your grandparents after the concert your going to play in.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA\n\nthese moments if school concerts and photos are important and it is perfectly OK to move things around to accommodate them.\n\nAs a parent, it is their job to manage those things. They should have been aware of the dates and made sure you got to go so I am really glad your mum changed your ticket.\n\nNow you can relax and enjoy your concert and also see your grandparents.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "In ten years will never remember this specific middle school concert. YTA.",
      "id": 11,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I postponed my family trip to see my grandparents for possibly the last time so that I could attend my orchestra performance, and my grandparents and parents are very disappointed.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    }
  ]
}