{
  "post content": "No A-holes here: So I was breaking down a box at the recycling center of my condo community the other day when a neighbor comes out of her house and asks me if I would rent out my condo for a week in October to a friend of hers. She said I could stay at my parent’s house (I’m 36 years old). She told me she couldn’t do it this year. I said, “Yes, I’d be glad to” because I was caught off guard. I thought about it and emailed her back the next day saying thank you for thinking of me but I work from home and need a secure phone connection (true) and am using one of the two bedrooms for an office. So am I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 11,
      "content": "NAH, but remember for the future that it's okay to say, \"Let me think about it and get back to you!\"",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Yeah I’m definitely going to do that from now on. ",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA your house you say who stays in it ",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA.  You immediately got back to them when you realized it couldn’t happen.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA, similar things happen to me all the time, I don’t think backing out of something like this because you didn’t think it through properly makes you an asshole.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH- that's normal. Being put on the spot doesn't always make people think through situations",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA and also what a very odd request. I don’t know what kind of community you live in where someone would ask you out of the blue to leave your home for a week to do a favor for their friend. ",
      "id": 8,
      "comments": [
        {
          "score": 3,
          "content": "There’s kind of a big event that happens near here in October so a lot of people rent their houses out, but I thought it was kind of rude for her to say you can just stay somewhere else during that time...like kick me out of my own house. ",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA\nThat she was brazen enough to ask you like that for a huge favor - without warning ? F that, no. You aren’t a hotel or an air bnb ",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA this one time. If you end up in situations like this often, YTA. ",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA That was a weird request",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nSo I was breaking down a box at the recycling center of my condo community the other day when a neighbor comes out of her house and asks me if I would rent out my condo for a week in October to a friend of hers. She said I could stay at my parent’s house (I’m 36 years old). She told me she couldn’t do it this year. I said, “Yes, I’d be glad to” because I was caught off guard. I thought about it and emailed her back the next day saying thank you for thinking of me but I work from home and need a secure phone connection (true) and am using one of the two bedrooms for an office. So am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    }
  ]
}