{
  "post content": "TLDR:basically my friends are mad at me, for being worried they are mad at me\n\nHi, so I am in high school still so I know this isn’t really that much of a big deal to me but please just remember that this is my entire social life right now. So with that said, my best friend (let’s call her A) has something wrong with her and I am trying to help her, she is struggling with conveying any positive emotions even though she still feels them, I started noticing some similarities in some of the things she was struggling with and some of the things my cousin (who is on the spectrum) does, so I brought up the topic to her and she started crying saying that she knows it might not be but she just was worried at the thought that this might not go away, she was crying and my other friends came over and noticed and asked her what was wrong she asked me to tell them for her and I did, they seemed okay but then this afternoon in the middle of a conversation one of my other friends (let’s call him B) tried telling me that “A doesn’t have autism you know” I tried explaining that we whernt saying she does just that she might have something wrong and that’s a possibility, B said okay and that it’s good we whernt self diagnosing, I asked if he was mad at me, and he left me in read, I could tell most of my friends where mad at me and maybe even A too So I messaged them all to ask them if they where mad, 2 left me in read and 2 said no, one of my friends who said no (let’s call her C) told me that The two friends that are mad at me get mad at me a lot because I (in Cs exact words) “ Oh they (the two who are mad) only feel like that cause u keep asking them (if I have done something wrong) and when u think someone is mad at you you act differently and they don't like it I guess” I asked her if she does to and she said that yeah sometimes she gets a little mad at me for it to, so like, am I the ass hole here?",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": "No judgement, because I honestly can’t say I see a particularly strong conflict here. You’re a kid in high school. Your entire exsistance is currently ”drama”, and in a few years you’ll realize non of it really mattered\n\nThat being said: Stop constantly asking if people are mad at you every time anything happens. If they are mad, you asking is not going to help. If they aren’t mad, every time you ask you’ll push them closer to being mad. Just. Stop. Asking.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "Agreed!\n\nIf they're mad, it's on them to tell you. I get that you're feeling insecure and would like to feel validated and know where you stand, but you're not helping. \n\nYou can try telling yourself \"as long as they're not telling me that they're angry, they're probably not\" and keep an open mind without assuming how they're feeling",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NAH - high school is rife with insecurity. It’s normal to wonder how you are perceived by the outside world and work to improve it. When you get older you care less. I think this is why many people say they would never go back to being a teenager. It’s a stressful time. If I could go back to these years I would tell myself to be confident as possible as this is the most attractive trait you can have.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "YTA\n\nBecause I think I can explain what your friends are thinking even if they can’t or won’t verbalize it. I’m not trying to be mean, you guys are young. None of the details will matter at some point.\n\nWhen A was having troubles, you basically did suggest maybe she has autism and that is self diagnosing. Which comes across poorly (words that come to mind include needy, attention seeking, but nothing quite fits). It just fits into a negative stereotype even though you meant well.\n\nSo you’ve done something that has now annoyed your friends a bit. Instead of quietly letting the whole thing blow over (because this isn’t the kind of thing you can apologize to a group for without making it worse you know?) and not doing it again, you’ve started to annoy them by trying to make them engage you. Again bringing the attention to yourself.\n\nYou don’t mean to do this, you don’t mean to come across as attention seeking, you probably mean well by all of this. Just trying to be a good friend and help someone.\n\nBut next time, it would be far more appropriate to say something like “maybe you should talk to the guidance councillor” (or school nurse/therapist/whatever that person is at your school most have them). Those adults are there to help you guys.\n\nThey can then handle it with the adults, they can connect her to other people if she does need help managing her mental health for any reason.\n\nEdit: P.S. this is all totally normal. Reddit is full of people who have been exactly in your shoes including me. I’ve been that little asshole kid before too. I was(am) a very sad and lonely little girl. I’m just old enough now to understand myself and my feelings better that’s all. Don’t be hard on yourself, loving yourself helps everything.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH. I'd say this is all pretty normal and everyone is expressing their feelings appropriately. I think this could be an eye opener for you to realize how your actions affect your friends and in what ways. Learn from this and move forward appropriately. Perhaps the lesson here is not to keep asking if people are mad at you and just leave it be. They are your friends, trust them to be ok with you at the end of the day.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTLDR:basically my friends are mad at me, for being worried they are mad at me\n\nHi, so I am in high school still so I know this isn’t really that much of a big deal to me but please just remember that this is my entire social life right now. So with that said, my best friend (let’s call her A) has something wrong with her and I am trying to help her, she is struggling with conveying any positive emotions even though she still feels them, I started noticing some similarities in some of the things she was struggling with and some of the things my cousin (who is on the spectrum) does, so I brought up the topic to her and she started crying saying that she knows it might not be but she just was worried at the thought that this might not go away, she was crying and my other friends came over and noticed and asked her what was wrong she asked me to tell them for her and I did, they seemed okay but then this afternoon in the middle of a conversation one of my other friends (let’s call him B) tried telling me that “A doesn’t have autism you know” I tried explaining that we whernt saying she does just that she might have something wrong and that’s a possibility, B said okay and that it’s good we whernt self diagnosing, I asked if he was mad at me, and he left me in read, I could tell most of my friends where mad at me and maybe even A too So I messaged them all to ask them if they where mad, 2 left me in read and 2 said no, one of my friends who said no (let’s call her C) told me that The two friends that are mad at me get mad at me a lot because I (in Cs exact words) “ Oh they (the two who are mad) only feel like that cause u keep asking them (if I have done something wrong) and when u think someone is mad at you you act differently and they don't like it I guess” I asked her if she does to and she said that yeah sometimes she gets a little mad at me for it to, so like, am I the ass hole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NTA. \n\nAs long as your not embarrassing anyone or going against your friends wishes and have their best interests at heart.\n\nAlso I know it’s splitting hairs but in my experience it seems for some reason people don’t like the phrasing “are you mad at me” and respond better to “ Is something wrong” or a variation of that. I never really understood why but looking back on it I even preferred that phrasing when I was on the reciprocating end.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 0,
      "content": "NTA, but you do need to try and tame that fear in your mind over other people’s opinions. \n\nI was in your shoes before, I panicked anytime someone even glanced at me wrong and tried to understand what it is they were feeling about me. \n\nBasically that can become a self-fulfilling prophecy, if you are constantly scared of them disliking you, they will know. There’s subtle differences in the way I hold myself when I’m worried or self-conscious, my friends can pick up on it in a heartbeat. \n\nInstead of asking ‘are you angry at me?’ Try to remind yourself that people make mistakes, we often try to deny things to cope with the flood of emotions and people can get mad for short times but it won’t kill your friendships. Accepting that sometimes people just leave you on read while trying to get their (possibly irrational) emotions under control before talking again is important. \n\nI hope A can get a doctors opinion on the situation to at least find out if it’s real or not. It’s clear you care about them.\n\nBe kind to them, but as always be kind to yourself.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    }
  ]
}