{
  "post content": "My wife and my mom have some issues.  Nothing too severe I'd say, but I do stand by my wife and as a result  I'm not close to my family anymore. We got married a few weeks ago and  my wife was a beautiful bride.\n\nMy  wife overheard from someone, that my stepfather \"Jake's\" mom (who was  not at our wedding) asked him if she was a beautiful bride, and without  skipping a beat he said no. My wife was obviously hurt and when I  confronted him he admitted he said that and told us to stop whining, he  doesn't have to lie and he isn't obligated to think everyone is  beautiful.\n\nI didn't totally know  what to do, because I do think the person who told my wife was just  stirring the shit. At the same time I'm not ok with anyone hurting or  disrespecting my wife. My wife wanted to ban him from our home, because  she didn't think she should have to have someone who felt that way (and  verbalized it) in her safe space.\n\nI  agreed and let Jake know he is banned. My mom is furious and says we  are being dramatic, and don't expect her to come without Jake. I said  while that sucks, I will back my wife. My mom isn't really talking to me  and thinks we are too sensitive",
  "id": 1,
  "comments": [
    {
      "score": 595,
      "content": "\" . . . I do think the person who told my wife was just stirring the shit. At the same time I'm not ok with anyone hurting or disrespecting my wife.\"\n\nWell, yeah, there was no reason for that person to repeat any of this to your wife. You didn't need to confront your stepfather and blow the whole thing up, either. Whole bunch of needless and avoidable drama. ESH.",
      "id": 2,
      "comments": [
        {
          "score": 101,
          "content": "This. I agree that whoever told your wife that was stirring up drama. This did not need to get to such a dramatic point. While I think your wife is understandably upset, I personally would not take it to the point of banning family from the house. Stepfather sounds like a tool but it could also be how he was approached. I am the first to admit I have seen a bride and thought the dress was a no. I would never vocalize that, but I have thought it. You were right to side with your wife, especially when she is so upset. But she is being overly sensitive and knowing that banning your Stepfather means that your mom will not come over is way extreme.",
          "id": 3,
          "comments": [
            {
              "score": 50,
              "content": ">tepfather sounds like a tool but it could also be how he was approached. I am the first to admit I have seen a bride and thought the dress was a no.\n\nPeople are allowed to have private thoughts. Just like OP's sticking up for his wife, stepfather may dislike OP and his wife because he thinks they're being rude to stepfather's wife. He doesn't like OP's wife and didn't think she looked pretty on the day. He didn't say it to her face. He mentioned it in a private conversation with someone else. That's not a crime. If stepfather said this deliberately in front of a known shit-stirrer, I'd call him an AH because he would have known that the shit-stirrer would have run to the bride with his opinion.",
              "id": 4,
              "comments": [
                {
                  "score": 2,
                  "content": " ̶M̶y̶ ̶u̶n̶d̶e̶r̶s̶t̶a̶n̶d̶i̶n̶g̶ ̶t̶h̶a̶t̶ ̶w̶a̶s̶ ̶t̶h̶a̶t̶ ̶h̶e̶ ̶s̶a̶i̶d̶ ̶i̶t̶ ̶A̶t̶ ̶T̶h̶e̶ ̶W̶e̶d̶d̶i̶n̶g̶.̶ ̶I̶f̶ ̶t̶h̶a̶t̶'̶s̶ ̶t̶h̶e̶ ̶c̶a̶s̶e̶,̶ ̶I̶ ̶t̶h̶i̶n̶k̶ ̶t̶h̶a̶t̶ ̶s̶t̶i̶l̶l̶ ̶m̶a̶k̶e̶s̶ ̶h̶i̶m̶ ̶a̶ ̶m̶a̶s̶s̶i̶v̶e̶ ̶A̶H̶.̶\n̶\n\nEdit: I just reread the post to catch that he was asked the question after the fact. my bad.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "But isn't it the parents responsibility to be mature enough to realize her adult child doesnt have to want a relationship with her partner, especially if he is rude? The fact that she will never go visit him if her partner doesnt go shows that she values her partner more than her child. That makes his mom the ultimate AH in my eyes. I would never forsake my child just because they banned my partner. Plus step father absolutely should not be adding turmoil if the relationship between mother and son is knowingly complicated, or does he not have to take any accountability for how his actions affect them?",
              "id": 6,
              "comments": [
                {
                  "score": 26,
                  "content": "I hear where you are coming from but these are not children or kids. They are also adults. At some point they need to act like adults and realize that not everyone in the world will agree with them or whisper sweet nothings. They need to learn to get past these types of disagreements.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I also see where you are coming from. I think having a thick skin in life is important. But to me it seems like as an adult they are making the decision to not subject themselves to someone they see as toxic (aka step father) and their mother is basically pulling a childish ultimatum of \" if he cant come then neither will I\". \n\nIt just seems wrong to me for a parent to never visit their child, yes even grown, because their husband doesn't understand how to be polite around others. I personally do not understand why its so hard for some people to just be polite. As someone who comes from a horribly toxic family with parents who always put themselves first i admit i am completely biased. Just wanted to offer another perspective. Not trying to start an argument.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Why shouldn't he confront his stepfather? His wife overheard, he probably assumed it was a misunderstanding and wanted to clarify, and Jake didn't even have the decency to lie to avoid the drama. He openly disrespected his wife again. I wouldn't want him around either. OP did the right thing supporting his wife and providing a safe space. That being said, his wife should also face her insecurities. It should matter what Jake thinks, and also not everyone will find you attractive.",
          "id": 9,
          "comments": [
            {
              "score": 26,
              "content": "She \"overheard from someone\" that the stepfather said this to his own mother who wasn't even at the wedding. It would be one thing if he'd been openly insulting her at her own wedding for all to hear, but that wasn't the case. This is some he said/she said bullshit. ESH.",
              "id": 10,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Wife didn't overhear. Shit stirrer deliberately went and told her.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "I also feel like as a woman, I would be uncomfortable if I heard through the grapevine that a guy thought I was a beautiful bride.",
          "id": 12,
          "comments": [
            {
              "score": 3,
              "content": "Even if the grapevine is stirring up crap?",
              "id": 13,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "We don't really have context on the person who told OPs wife or the situation stepfather was saying it in from this post. Usually I'd agree they're shit stirrers but for all we know step dad was saying it to a large group of people or even at the wedding. Hard to judge either party",
          "id": 14,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "I cannot seem to recall the origin of this quote (whether it is religious or not, but I first heard it in Sunday school). \n\nA man said to another \"I heard so and so say such and such about you behind your back\"\n\nThe other replied \"He shot an arrow and it missed me, so why have you picked it up and stabbed me with it\"  \n\\_Source unkonwn, please do provide so I can update if you know!",
          "id": 15,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Yea. He should have just told his ugly wife to suck it up. Are you kidding me???",
          "id": 16,
          "comments": [
            {
              "score": 26,
              "content": "No, I'm not kidding. The wife was never meant to be privy to that conversation, and the stepfather is entitled to his opinion. He should've been smart enough to know that he had nothing nice to say so would've been better off not saying anything at all, which is why he sucks. But so does everyone else in this story. \"He said I wasn't a beautiful bride\" is hardly a good enough reason to go no contact with family.",
              "id": 17,
              "comments": [
                {
                  "score": 12,
                  "content": "I think it’s more a matter of dismissing them with “quit whining” when he was confronted about it (also like yea I get it. Weird hill. But…) It’s rude. And I didn’t see it as no contact, I saw it as don’t-come-to-my-house-if-you-can’t-keep-your-mean-opinions-about-me-to-yourself. Mean old relatives aren’t entitled to invitations if they don’t know when to keep their mouth shut or when to empathize when their words hurt.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 9,
                      "content": "He is allowed to not find OPs wife beautiful. It is possible.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "He is allowed to not find OPs wife beautiful. It is possible.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -2,
          "content": "This",
          "id": 22,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 171,
      "content": "ESH.\n\n'My wife overheard from someone, that my stepfather \"Jake's\" mom (who was not at our wedding) asked him if she was a beautiful bride, and without skipping a beat he said no.'\n\nSo someone's shit stirring and you're all playing into it. Why does your wife care that he said this? No, not everyone will think she is a beauty or be willing to lie. I don't understand why you confronted your stepfather over this. You know the friend was shit stirring and played the game anyway.",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 121,
      "content": "INFO: why did you confront him? does it matter if he thinks she was beautiful or not? I'm curious why you both decided to pursue this.",
      "id": 24,
      "comments": [
        {
          "score": -141,
          "content": "because it is ok not to think she is beautiful, but I think saying it out loud was disrespectful, and I'm not going to tolerate that",
          "id": 25,
          "comments": [
            {
              "score": 97,
              "content": "Esh.  He was asked a question and answered it honestly to a 3rd party.  Who you should ban is the pot stirring ah.",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 58,
              "content": "But from what I am understanding it wasn't directly said to her and that someone else asked them of their opinion. Is that correct? You're saying it's ok to not think she is beautiful but at the same time it wasn't said directly to her face and someone else was responding to their question",
              "id": 27,
              "comments": [
                {
                  "score": -86,
                  "content": "He should have either said yes, or told his mom it was an inappropriate question and there is no need to discuss someone's looks",
                  "id": 28,
                  "comments": [
                    {
                      "score": 65,
                      "content": "That’s not how the real world works. People are allowed to have opinions about how someone looks and people are allowed to discuss it. Unless it was said directly to you or your wife, you have no reason to be this upset about it. The pot-stirrer is the problem. Unless you can honestly say you’ve never voiced your opinion about how someone looks (even in private), calm down.\n\nEdit: typo",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "Yeah grow the hell up and btw you’re babying your wife no wonder nobody in your family is close to you anymore",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "So he should have lied? Y’all must like the drama to not just let this die.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "That's not how it works. He is allowed to answer the question with his honest opinion. He's not required to lie for others comfort.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "So you are mad that a grown man didn't lie to make someone feel better or not get their feelings hurt? We teach kids that a lie will always hurt more than the truth but then as an adult you expect another adult to lie so someone's feelings aren't hurt.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "It is not disrespectful to have an opinion, and to share that opinion when asked. He didn’t do it in front of your wife. His opinion is also just that—an opinion. He didn’t think she was a beautiful bride. It doesn’t take away anything from how she looked, or what you think about her beauty. You are both behaving like children, and should reconsider your stance.",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "so you're not going to tolerate honesty? at least he didn't lie and pretend he didn't say it.",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "\"Will Smith has entered the chat\"",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "What? You're not going to tolerate someone voicing their own opinions? Who exactly are you that you think you have the right to tell people what they can and can't say in their private conversations? Look at the egos on you and your wife.",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "It was absolutely disrespectful, if he doesn’t have to control his adult mouth, you don’t have to have him in your home. He should “quit whining” since being a pillar of truth is so important.  You certainly don’t have to have someone like this in your place of peace. NTA",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "I think that speaking that way about the bride on her wedding day is a display of extreme callousness. As others mention, this is his opinion and he is allowed to have it, but to be unable to keep this to himself and to just flat-out drag her instead of politely offering \"I think she looks great\" shows a lack of respect or empathy for your wife. Again, on her wedding day.\n\nIf this is the best he can do on a day when he should be putting forward the effort, then you know now exactly whether you need him in your life. And you don't! He can not do better than this benchmark and you should remove all expectations.\n\nTo others points as well you absolutely need also to deal with this pot-stirring jackass too. He is not guiltless.",
              "id": 39,
              "comments": [
                {
                  "score": 10,
                  "content": "it wasn't on her wedding day. the stepfather\"s mom asked him after the fact (she wasn't at the wedding) if she was a beautiful bride. he said no. in a private conversation with his mom. why should he lie to his mom?",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 92,
      "content": "So, your wife only lets people in your house who think she's beautiful? Or who will say she's beautiful even if they don't think so?  Good luck with that.  Better be careful the next time she's getting ready to go out & asks you how she looks.  ESH.",
      "id": 41,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 65,
      "content": "YTA,  you are over reacting over gossip. Your wife is immature baby if someone saying she wasn't beautiful is enough to hold lifetime grudge.",
      "id": 42,
      "comments": [
        {
          "score": -17,
          "content": "Gossip which was confirmed by the OP’s asshole stepdad. And he said she didn’t look beautiful on the day she was supposed to look and feel her absolute best. Who in the hell actually says that out loud?! An asshole, that’s who. OP’s wife shouldn’t force OP to go NC or LC but I don’t blame her for not wanting to host this jerk in her own home.",
          "id": 43,
          "comments": [
            {
              "score": 31,
              "content": ">And he said she didn’t look beautiful on the day she was supposed to look and feel her absolute best.\n\nI got news for you, you can spend a year salary on stylists and designer clothes, and there will STILL be people in this world who don't think you're beautiful.",
              "id": 44,
              "comments": [
                {
                  "score": 5,
                  "content": "Especially if they don't like your personality. And, can you blame him if stepdad doesn't like her personality, she banned him from her house for not telling everyone how beautiful she is.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 56,
      "content": "ESH.  Stepdad is allowed to have his opinions, but they don't always need to be expressed out loud.\n\nThe uninvolved third party that reported back to your wife is a jerk for stirring the shit pot.\n\nYou and your wife suck for licking the spoon.\n\nThis is such a minor thing. Is it really worth blowing up your family for, or do you and stepdad have other past history?",
      "id": 46,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 48,
      "content": "this is so stupid bro.",
      "id": 47,
      "comments": [
        {
          "score": 28,
          "content": "But but but....did you not get the gravity of the situation??? The wife's step grandmother in law now thinks she wasn't a beautiful bride!!",
          "id": 48,
          "comments": [
            {
              "score": 6,
              "content": "i don't even get the whole story",
              "id": 49,
              "comments": [
                {
                  "score": 3,
                  "content": "Sorry I didn't write \"/s\" because I thought it's too obvious",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 38,
      "content": "No judgement from me, since I can’t figure out why this is a thing.\nAside from the fact that he likely doesn’t like your wife.\n\nI cannot imagine caring whether someone thought I wasn’t beautiful at my wedding.  Especially when they didn’t say it to Me.  \n\nI mean, it’s really nice if your partner thinks you’re beautiful.  But why would you care if your stepfather-in-law or anyone else does?  (Unless your job relies on physical appeal).  It’s not like you’re shopping for a new partner in stepfather-in-law and using attractiveness to bait the hook for a date.",
      "id": 51,
      "comments": [
        {
          "score": 7,
          "content": "Yeah I'm also having trouble figuring out why this is such an issue.",
          "id": 52,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 27,
      "content": "YTA\n\nYes your wife is too sensitive, not everyone is going to find her beautiful. Beauty is in the eye of the beholder. \n\nIt was just your stepfather’s opinion to his own mother, would be different if he said it directly to her. \nAre you only allowing people who find your wife beautiful into your house then?\n\nYou’ve already said your not close to your family anymore are you going to let this comment be the final nail in the coffin?!",
      "id": 53,
      "comments": [
        {
          "score": 34,
          "content": "\"Listen step-dad, if you wouldn't bang my wife, you're not welcome here\"",
          "id": 54,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 26,
      "content": "Wait wait wait.  Someone told your wife (or she overheard it somehow) that your step father in law was asked by his mother... Step grandma in law, about if the bride (your wife) was pretty and that he said no.  She (step grandma in law) was not invited so this was not at the wedding. \n\nIf that's true, then info: who is the snitch and why?  Why are they not the focal part of the story?  \n\nIm not understanding how she could overhear something from a conversation that didnt take place at the wedding.",
      "id": 55,
      "comments": [],
      "relation": "No"
    }
  ]
}