{
  "post content": "About 6 months ago a woman drove off a very busy road, up into the parking lot at my work, and hit my truck. She must have been going at least 40mph and hit directly on the wheel of my truck because it turned my truck 90 degrees with very little visible body damage. To top it off, she had no insurance.\n\nAfter all was said and done, she caused about $18,000 in damage for which I had to pay out of pocket about $3,800 (deductible, rental car, repair costs my a-hole insurance company refused to pay). Additionally, since she didn't have insurance, I can't recover the diminished value of my truck which I think is at least $5,000 that I will never get back. Obviously this amount will go down as my truck ages but I'm pretty much stuck with this vehicle for a while now or I have to eat that cost.\n\nI had just gotten this new truck about 4 months prior then had to deal with this nearly every day for the 7 weeks it took to get repaired. It was a nightmare and very stressful dealing with this.\n\nI ended up suing her in small claims court and won by default because she did not show up. I feel like she wasn't planning on repaying me until she was trying to get her license reinstated and fortunately the state is requiring her to have a repayment plan with me before she can get her license back. She has agreed to repay me $100 every other week until paid in full. So far, I have received 1 such payment with the next due today.\n\nNow the part where I sort of feel like an asshole is that my wife and I make about $225,000 per year combined and after this lady sent me her statement of assets through the court, she has about $200 to her name and makes $400 per week as a waitress. I paid the $3,800 and sort of moved on financially. It is a lot of money, but we can afford it.\n\nShe very obviously owes me the money, but the $100 every other week very clearly would mean a lot more to her financially than me. What say you?",
  "id": 1,
  "comments": [
    {
      "score": 7161,
      "content": "NTA.  Driving without insurance is unacceptable for anyone.  What would have happened if you had been in the truck and were left permanently disabled.  Who would have paid for your care?",
      "id": 2,
      "comments": [
        {
          "score": 2407,
          "content": "Its also very illegal.",
          "id": 3,
          "comments": [
            {
              "score": 933,
              "content": "Not as illegal as you think. Insurance is a state law, not a federal one, and there are states, New Hampshire for example, that don't require insurance. Having insurance is still smart, just not having it isn't automatically illegal.",
              "id": 4,
              "comments": [
                {
                  "score": 298,
                  "content": "In most places it is illegal though, but most people just get the cheapest state min. they can then get the vehicles tagged and never pay another dime and let the insurance cancel. (Speaking as an insurance agent that sells auto and home insurance.)",
                  "id": 5,
                  "comments": [
                    {
                      "score": 75,
                      "content": "\\> but most people just get the cheapest state min. they can then get the vehicles tagged and never pay another dime and let the insurance cancel. \n\n&#x200B;\n\nIn my state, you need to prove your insurance is current annually to get a safety check completed. Without a safety check, you can't get your car registration. Getting stopped without insurance, registration, and safety is 1k+ in fines. If you don't pay the fines, you then can't renew your license when it expires.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I’m a broker as well. Came across an interesting claim recently. Our client was involved in an accident (at fault) with another vehicle. It ended up costing a fraction of what I estimated due to a CA (where it happened) law I hadn’t been aware of. The other driver was not insured, so the state law limits their ability to collect damages. They get the cost to repair/replace the vehicle and actual injury sustained. That’s it. No pain and suffering. No lost wages. No reimbursement for a temp vehicle. Nothing.\n\nI understand poverty. I have lived dirt poor most of my life and I totally feel for people in the situation of needing to drive, but it’s expensive. Thing is, a car is as dangerous as a gun and you are risking more than just yourself. The OP is lucky to be in a position where they were able to absorb this without too much negative impact to their life. That could have just as easily been someone else. Poverty is not a crime, and the system is broke as fuck, but we need to make our choices with the NOW in mind as we keep working on making it better. It’s one of the many reasons I don’t have kids. It would cripple us financially and I would feel so irresponsible deliberately having kids I could not afford to care for as they deserve. It’s a shitty situation and not much of a “choice,” but that’s my reality.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "In most states that do not require you to have insurance also have it stated that the only way you do not have to have insurance is if you have enough money to be able to pay off a settlement if you were to get into an at fault accident.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Even in that state you mentioned, having no insurance + zero money to self insure, is still illegal. You need to prove you have money for these instances. \n\nBut as ive mentioned in a bunch of replies, im not american so I had no clue you could drive uninsured so again, my apologies. \n\nEither way, irresponsible unless you are a multi millionaire with money to burn on lawsuits for when something unfortunate happens if it ever does.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes, but in those place it's only not illegal if you are rich enough to not need it. \n\nFrom a thing on [nh.gov](https://www.nh.gov/insurance/consumers/documents/nh_auto_guide.pdf):\n>New Hampshire Motor Vehicle Laws do not require you to carry Auto\nInsurance, but you must be able to demonstrate that you are able to provide\nsufficient funds to meet New Hampshire Motor Vehicle Financial Responsibility\nRequirements in the event of an “at-fault” accident.",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I live in nh and drove a beater for 11 years. I never had an accident so I wasnt required to have insurance, which is good cuz I was broke as fuck.\n\nBought a new car last year and the extra mpg pays for my insurance pretty much.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Yeah, with few (sometimes extremely specific, like Arizona where you can forgo insurance if you have ~$40k stashed away specifically for this purpose) exceptions in a few states.\n\nGeneral rule is to get auto insurance ya turds.",
              "id": 12,
              "comments": [
                {
                  "score": 3,
                  "content": "Yeah, average insurance where I live is coverage for 3 million + dollars.. some accidents where people are severely hurt can cost much more, i cant think of anyone personally with enough money just laying around to just not go with an insurance plan.. that seems to be more for the top .01%",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "She makes $400 a week.  That's likely why she doesn't have insurance tbh.",
              "id": 14,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1830,
          "content": "If she barely has $200 to her name, then how is she supposed to afford insurance? If she barely has $200 to her name, then she probably has to drive to work in order to eat. Not everyone lives in a town with public transportation.\n\nEDIT: i’m not saying she should get off Scott free for what happened. I’m saying some people here don’t seem to understand what poverty is.\n\n500 up votes! Humbled.",
          "id": 15,
          "comments": [
            {
              "score": 473,
              "content": "If she has only $200 to her name how does she plan to pay people if she gets in a accident like this. Having no insurance is just as bad if not worse than paying for it when you are poor. Its a catch 22 situation.",
              "id": 16,
              "comments": [
                {
                  "score": 1162,
                  "content": "‘How does she plan to pay people’ She doesn’t plan that or anything, she can’t afford to. Do you think there’s money sitting somewhere that she’s ignoring? She also can’t plan to take care of herself if she gets hurt. It’s P O V E R T Y.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 455,
                      "content": "But why doesn't she just pull herself up by her bootstraps!",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 286,
                      "content": "But she can choose to not drive irresponsibly, especially when she knows she is illegally driving without insurance and knows she can't afford an accident",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "P O V E R T Y doesn't absolve people of responsibility, especially when they're going around getting into accidents and then refusing to show up in court.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 71,
                      "content": "she should probably drive more carefully then, and not crash into parked cars going 40 mph.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "Yeah everyone i know that drives without insurance does it as little as possible, and only because they can't afford it. You'd have to be nuts to risk so much otherwise.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "If you can’t afford to get insurance, take the bus or train. Or at the very least don’t drive recklessly. Not having car insurance and driving is illegal. She wasn’t forced to drive",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Ugh this is what people don’t get. Some choices HAVE to be made by poor people to survive. Poverty isn’t just a case of bad choices, it’s a case of bad circumstances that a lot of times you’re stuck with. And in situations like this, the waitress will now lose 100 that might make her miss a bill, which might make another big rich entity take her to court. \n\nShe didn’t have insurance because she couldn’t afford it yet (YES HELLO THIS HAPPENS TO A LOT OF PEOPLE) and she still had to work, and if the waitress hadn’t been working people would have said “I’d do anything just to get a keep a job, it’s her fault that she’s homeless/starving”.\n\nOP, this will probably be unpopular in the land of pull me up by the bootstraps, but you’re the asshole. YTA. That 3800 annoyed you, meanwhile 3800 might just kill her.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "This is just a problem with our society lol. \n\nCause you're right; when you're in poverty you're are just fucked. No matter what way you spin it you are fucked. And yet we don't do much to address it; because at least it ain't me lol. smh.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 149,
                  "content": "It's more likely she has no choice and is more concerned about not starving in the cold",
                  "id": 27,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Everyone has a choice not to drive recklessly",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "It really is and I think I would based my judgment largely on how good the public transportation is in their area.  I'd be pissed as well if someone someone drove without insurance but they're not going to get any closer to affording insurance if public transportation isn't a viable option and they can't get to work without some reasonable form of travel",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Source: have friends that are or have been very, very poor...\n\nIt's cheaper to not have insurance and pay the fines if you get caught than it is to have insurance in the first place.  Some people don't just 'have money,' for some people, there is no backup plan, there's no wiggle room.  She makes $2000/month, how much is rent?  Bills like electricity and water?  Cell phone bill?  Food costs?  Gas to get to work?  For many Americans, that's it, that's what they can afford.  Something like [70% of Americans have less than $1000 in savings.](https://s.yimg.com/uu/api/res/1.2/UFxOb6JlKXa_PBJMUdo5RA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/gobankingrates_644/5835d0ef87f539d5cbc82448997dcb35)",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "> If she has only $200 to her name how does she plan to pay people if she gets in a accident like this.\n\n“Uninsured motorist insurance” is a thing that people with assets purchase in order to mitigate the potential for an issue like this. It isn’t about bad versus good, it’s about **having insurance when you’re poor versus being able to buy food**. Melon.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Ah yes, just pay for insurance why didn't impoverished people think of that?  Just have money forehead.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Poverty charges interest",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 321,
              "content": "She was doing 40 in a parking lot and hit a parked car.  She knew she didn't have insurance and decided to drive erratically.  Also being a server she only has 200 declared since a lot of her income is unlikely to be reported.  This person just made a lot of bad decisions in a short span of time.  Hopefully she learns to drive more carefully and be insured.",
              "id": 34,
              "comments": [
                {
                  "score": 172,
                  "content": "Exactly!!! People are missing that she was going 40 MPH IN A PARKING LOT. Like, whattt!?",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "We don't know how fast she was going. The OP said \"she must have been going at least 40\" because he assumes that is what caused the damage. She also wasn't driving in the parking lot. She veered off the road and hit his car, presumably parked on the side of the lot by the road she was on.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 53,
                      "content": "If this was a full size truck it's the better part of 3 tons. Even a midsize truck will weigh more than 2. You would have to hit ANY vehicle very hard to spin it (roughly) 90 degrees while it was stationary.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "OP literally said she drove up into his work parking lot.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 44,
                  "content": "Also, why didn't she show up to court?  Personally, I would have thrown myself on the mercy of the court.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Because she needed to work, probably.",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 193,
              "content": "Get a bike and don't do illegal shit that can kill people.",
              "id": 41,
              "comments": [
                {
                  "score": 62,
                  "content": "I don't advocate driving without insurance either, but driving can kill people anyway. It's not the illegality of the situation that causes that.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Yes, but if she disables someone then they are fucked because of her actions. She doesn't have the money to pay for care for people she injures.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 133,
              "content": "You know how people who are really poor usually end up paying more for stuff because they can’t afford to buy things in bulk/ahead of time? This is the same problem. Insurance is a cost that can pay for itself, but you have to be able to pay for it.\n\nUnfortunately, like many other things, the lack of upfront payment will now cost her much more than any insurance would. It’s sadly a self-perpetuating cycle, and I feel very bad for her.",
              "id": 44,
              "comments": [
                {
                  "score": 8,
                  "content": "You feel bad for someone causing thousands of dollars of damage by driving 40 mph in a parking lot and hitting a parked car?  Some things are out of our control; this isn't one of them",
                  "id": 45,
                  "comments": [
                    {
                      "score": 78,
                      "content": "You can feel bad for someone's situation while not agreeing when they do something stupid. The world is not black and white. She made a stupid and reckless mistake and she *should* face the consequences for her actions, but that doesn't mean you can't also empathize with someone dealing with poverty",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Sure. Were her actions dumb? Absolutely. But if she's only making $400/month, and working full-time, then she's only getting $2.5/hour. Or she can't find full-time work and is trying to raise a family on part-time work. People who aren't poor can afford to do dumb stuff. People who are can't.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "op doesn't know how fast she was driving and she veered from the main road.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "Mix of walking and public transport, like most other people who can't afford a car/insurance/gas? I can't keep up with gas prices, but my city is running a great promotion to increase public transport, and it works out very well for me. Sure, it doesn't go everywhere, and I end up walking somewhere between 25-30 miles each week, but it's a lot better than breaking the law and driving without insurance.",
              "id": 49,
              "comments": [
                {
                  "score": 139,
                  "content": "If you have no public transport, and the only places that'll hire you are miles away, what do you do then? Not everyone has the privilege to have ANY access to public transit.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 132,
                      "content": "What’s the phrase? Only break one law at a time? If you absolutely don’t have any other options than to drive without insurance you better be the safest driver out there.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 84,
                      "content": "And what if she wrecked someone's car who was also poor but paid their insurance? Just because the op can afford it, doesn't mean he should have to take the hit. I bet his insurance has also gone up since his claim.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Get a ride from a friend, use the rideshare function on Waze (way cheaper than Uber,) temporarily move in with a family member closer to jobs/public transport, do online telemarketing/customer service. There are always options that aren't breaking laws that are in place to protect yourself and others",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "You find a way. Work from home, start freelance jobs, stay with relatives, WALK or BIKE to work, I frequently walk several miles to work, it ain't that bad.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Fucking bike like I did when I was poor?",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I live nearly 10 miles from the nearest bus stop, and I live in the most populated state in the US. I can't imagine places where it's even more rural.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "You get a bicycle.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "You can get pretty far on a bike pal",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 81,
              "content": "I understand what poverty is, but that doesn't absolve her of responsibility.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 76,
              "content": "So fucking what? She doesn't get to drive illegally and then get off on her debts because she's poor. If she's so poor that she has to do illegal stuff to survive then she should move.",
              "id": 60,
              "comments": [
                {
                  "score": 124,
                  "content": "With what money?",
                  "id": 61,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Stop being obstinate.\n\nYou’re saying maybe (that’s maybe, we don’t know) this woman had no other way to get to work but to illegally drive without insurance.\n\nAnd then also saying that you know that’s bad and not an excuse.\n\nSo what do you even want out of this argument?\n\nFrankly the woman is lucky she only pranged a vehicle and didn’t cripple or kill someone.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 33,
                      "content": "Ffs when my husband was too poor to afford car insurance he drove like a grandma. If you can't afford to pay for insurance then you sure as hell can't afford to drive like you do.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 50,
                  "content": "move with what money????",
                  "id": 64,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Who cares, not OPs problem. Poverty isn't an excuse to do illegal things that jeopardize the lives and livelihoods of other members of society.",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "Move where to do what?",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "They don't care. Poverty isn't their problem because they've never experienced it. Not worth trying to argue with them. This dude can financially eat the cost and not care. She might not be able to eat tonight, likely ruined her only car, and now can't drive due to legal issues. But fuck her right? They don't know if her insurance lapsed for 4 days ebcause she didn't have enough money. Hilarious how 90% of reddit is democrats that think poverty is a problem that needs fixed, but when it comes to personally sacrificing 4k so that someone can eat, fuck her she broke the law.",
              "id": 67,
              "comments": [
                {
                  "score": 76,
                  "content": "> But fuck her right?\n\nShe drove 40mph in a parking lot while not insured. She could have killed a pedestrian. Yes indeed, fuck her. She’s a big girl, and big girls should know actions have consequences.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Op said she \"had to be going 40\" also if you read what he said he said she drove off the road. So we dont know how fast she was going or what caused her to drive off the road.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 49,
                  "content": ">They don't care. Poverty isn't their problem because they've never experienced it. Not worth trying to argue with them. This dude can financially eat the cost and not care. She might not be able to eat tonight, likely ruined her only car, and now can't drive due to legal issues. But fuck her right? They don't know if her insurance lapsed for 4 days ebcause she didn't have enough money. Hilarious how 90% of reddit is democrats that think poverty is a problem that needs fixed, but when it comes to personally sacrificing 4k so that someone can eat, fuck her she broke the law.\n\nI don't recall democrats saying we should let people get away with destroying other peoples cars...?",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 33,
                  "content": "You ever drive into a parking lot and then smack a 3 ton truck at a 90 degree angle? I grew up poor as fuck and drove without a license until I was 21 and I'll tell you what I never smacked another car full speed in a parking lot.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Why should I feel bad for her bad decisions, and have to pay the consequences of those?  \n*She* chose to drive recklessly.  \n*She* chose not to walk, or use a bike or public transportation,  \n*She* chose these things. *She* needs to pay for her actions.   \n\n\nI'm not arguing that the system isn't broken, but actions have consequences. Maybe she should have thought before recklessly speeding through a parking lot. \n\nShe's damn lucky it was a car and not a person. But, I guess serving a manslaughter charge in jail would take care of her not being able to eat..",
                  "id": 72,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "What's the logic here? She's broke and she needs a job so she's allowed to break the law and not have to deal with debt? That's like saying she should be allowed to walk into a grocery store and pick up whatever she needs because she is broke and hungry. \n\nEveryone has problems, that's the sad reality of life.",
                  "id": 73,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "It's one thing to get sick while being in poverty and being fucked financially. Or if your job has layoffs and you just happen to get screwed. It's another thing to drive so dangerously. What if someone was in the car? They're likely paralyzed or dead. It's a lot harder to feel bad for someone when they put themselves in a bad situation (not the poverty situation, but the car crash situation). If you're in poverty and you can't eat because of medical bills, that's a failure of the nation. If you're in poverty and can't eat because you totaled a car and a half...that sucks but consequences have actions.",
                  "id": 74,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Username checks out.",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "She's a waitress who only makes 400 a week? Either she doesn't work very much of she's full of shit. I'll take the latter. Literally every thread filled with wait staff goes on about how they don't declare tips.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "She’s a waitress. It’s very likely she doesn’t claim cash tips, only the credit ones, because there’s a record of those.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "[deleted]",
              "id": 78,
              "comments": [
                {
                  "score": 21,
                  "content": "I mean, it's kind of OPs problem now, too.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Not once she pays him back",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Driving DANGEROUSLY without insurance!",
          "id": 81,
          "comments": [
            {
              "score": 2,
              "content": "I'm also wondering if she was driving without a license? Or did she lose her license because of the accident?",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It’s also a very sad reality to a lot of low income people who do it because it’s the only way to work or manage their lives. I’ve had clients who have to work one job, go to the methadone clinic and pick up their drink before it closes, sign into the police station once a week, make daily supervised visits, work their next job and still not make enough to pay rent. I don’t condone not people like this driving without insurance but I also understand and am sympathetic towards why they do it. When you’re broke you just can’t get a fucking break.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2041,
      "content": "NTA - she caused an accident through her bad driving, AND was driving with no insurance.  She’s is the person responsible for damaging your truck,  and is the one responsible for the sum your insurance didn’t cover.\n\nHard up though she will no doubt be - she broke the law and she should pay for the damage she caused..... it will also teach her that she should improve her driving and sure her car.",
      "id": 84,
      "comments": [
        {
          "score": 1244,
          "content": "It seems apparent there is no money to insure her car with.  OP seems like a decent person to be concerned.  I think in his place I'd write it off and collect the good karma.",
          "id": 85,
          "comments": [
            {
              "score": 361,
              "content": "So? She was clearly driving like an asshole with no insurance and caused $18k of damage to a new truck. Because of her lack of insurance, OP had to claim on his, which means his premium will go up next year through no fault of his own. He’s $3800 out of pocket and more expensive insurance coming his way.\n\nShe should be let off? Why?",
              "id": 86,
              "comments": [
                {
                  "score": 1148,
                  "content": "I said I WOULD because sometimes people get in awful situations and made mistakes and I think I'd feel good knowing an amount negligible to me might make a huge difference to her. It's called mercy, charity, unearned kindness. I didn't say he owed it to her,  but he is obviously worried about it which makes him a decent human being.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 492,
                      "content": "[deleted]",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 206,
                      "content": "This\n\nLike he's not an asshole for not just writing it off, but he'd be doing a very kind thing to either forgive the debt, or work out a more relaxed payment plan. \n\nAnd the fact that he's thought about it honestly helps keep my faith in humanity at a decent level",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "Well said. Sometimes this sub loses sight of basic compassion. Would he be the asshole if he didn't let her off? No. Would he be extraordinarily generous if he did? Absolutely.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "She was doing 40mph in a parking lot. She's lucky she didn't kill someone. If you're going to drive like that you sure as shit better have insurance to pay for the damage you'll inevitably do to people and property.",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Finally. Someone with some sense",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "When I was in graduate school I was absolutely destitute. There were days I literally starved. Towards the end of my tenure at school I came down with a terrible case of tonsillitis, and the infection had spread to my lymph nodes. When I was driving to be seen by a NP, I totally side swiped a car. I was so sick and out of it that I had not realized how close I was to the car. \n\nThe car I hit was dented with some paint damage. I left a note and later talked to the car owner on the phone and she told me she would assess what she wanted to do and get back to me. I had car insurance, but my deductible was so high that there was no way I could afford it. \n\nA month later the woman called and told me she wasn’t going to pursue any compensation from me. She saved my life and I will be forever grateful.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "It's not that she should be let off, at all.\n\nIt's just OP himself was feeling kind of bad and has some empathy for this woman and seems to be considering letting her off it. And that commenter was just saying basically, \"if you want to, go for it.\" Which is pretty reasonable.\n\nOP is NTA *no matter what here* but that doesn't mean OP can't do a generous deed if he were so inclined.\n\nOP should do what he feels is best and would be fine either way, there's nothing wrong with having her pay the money (though if she can't pay rent then lol she's going to lose her job and won't be able to pay him anyway, so...) and nothing wrong if OP is feeling kind and is worried about a fellow human being.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "The dictates of law don’t always align with the dictates of conscience.",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 79,
              "content": "If you're going to break the law, it's better to break only one at a time. She was driving without insurance. That's bad, but technically she wasn't hurting anyone -until she *also* caused an accident. Now, I would have more sympathy if this was a freak accident, but she caused it by driving recklessly. So she wasn't just driving without insurance, she was driving *recklessly* without insurance. Which makes her an asshole. She couldn't afford insurance, so she damn well couldn't afford an accident, but she drove recklessly anyway. If you seriously have no other options but to drive without insurance because you can't afford it, well I can't say it makes me happy but I understand the hard choice there. But if you're going to do that, you'd better be driving as carefully as you possibly can, because you're already breaking one law, breaking a second is stupid.",
              "id": 96,
              "comments": [
                {
                  "score": 2,
                  "content": "Good point.  I drove without insurance for a few months once and I drove like a little old lady.  I knew if I got caught I would be charged with a misdemeanor and lose my license.   I was always terrified and aware of the consequences.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "It’s illegal to drive without insurance for good reason. If OP had been sitting in his car in the parking lot when she slammed into it, he could have been hurt and she would have been legally liable. We all need to trust each other to honor the social code of driving with insurance. I am empathetic to her, but someone I know recently was severely injured by a careless driver without insurance and it has been hell on his family to find recompense.",
              "id": 98,
              "comments": [
                {
                  "score": 4,
                  "content": "I'm responding to This situation.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I am too. We all need to have insurance if we’re going to get behind the wheel of a vehicle/giant steel weapon.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yes, but her car was totaled, so the accident must have been bad. If she'd hit someone walking to their car or a car that had someone in it, it's likely they would've been hurt or worse. She got off lucky just causing financial/property damage.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Good karma is nice and all, but my concern would be that if he just let it go, she wouldn't learn anything. It would be like enabling her bad behavior. And who can say she won't continue driving without insurance (and without a license) and possibly cause more damage or even injure someone? Her financial situation is awful, I can't imagine what that's like, but she should be held accountable.",
              "id": 102,
              "comments": [
                {
                  "score": 2,
                  "content": "I'd say do something to scare her then. Like shit, rake some leaves or do self imposed community service. Money clearly wouldn't solve the problem as it'd create other massive ones.\n\nTrying to pull the little money she could possibly fork over would potentially end up with an eviction due to nonpayment or even homelessness. I don't see OP getting anything out of that and being out in the streets/your car wouldn't be the best place to improve yourself.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "If she didn’t have insurance money, there are methods of public transportation she could have used. She had no excuse to be driving uninsured, especially so recklessly. She deserves to pay for the damages caused by her recklessness.",
              "id": 104,
              "comments": [
                {
                  "score": 150,
                  "content": "Public transportation is not available everywhere.  Big chunks of rural USA have none.  I'm not suggesting giving her an award but OP is obviously concerned about it,  so why not alleviate everyone's anxiety? Mercy is being given what we don't deserve. It's a good thing.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 73,
                      "content": "I live in a city with 400k people and WE don't even have public transportation. You don't even have to be rural to be fucked.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Our small town bus only runs certain hours on certain days, and only once an hour during those times. Sunday, no bus. Saturday, stops running at 4:30 PM. Busses dont start running until 7:30 AM. For those of us that start work at 8 AM or earlier, or get off work late, this is not even an option. \n \nBeing Canada, snow is a given, which means the bus doesn't even run fairly often. For me, winter can mean walking to work for an hour or more depending on the weather, in  -20 to -40 C temps, through deeply snow covered sidewalks.\n \nNo, there is no Uber here. A taxi ride can be 20+ dollars from where I live to work, so basically 40 bucks a day. It's not always so cut and dry everywhere. Man, I wish our bus was better.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I was going to say exactly this. OP, if you choose to collect the money, it’s 100% your right. It seems like she’s paying what she can too, so NAH. But, you seem to have some empathy and I think this is a great situation to say something like: take this money you owe me and put it towards car insurance. That way, she still has to be responsible/take responsibility for herself and you’d be paying it forward to anyone else who may be in an accident with her but may not be in as fortunate a financial place as you.\n\nEdit: typo!",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "If you can't afford insurance, you shouldn't drive. Plenty if people take the bus, bike and so on. Just because you're poor doesn't mean you can put other's lives and property at risk with no repercussions.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Agreed. OP is clearly NTA. But I feel like in OP's place, I'd just write it off as well. Or only have her pay half or something.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "It's probably not going to teach her much of anything beyond what she already knows, that being poor sucks.",
          "id": 111,
          "comments": [
            {
              "score": 9,
              "content": "Maybe it will teach not to recklessly drive 40mph in a parking lot. She hit a parked car. It's not like it swerved into her lane.",
              "id": 112,
              "comments": [
                {
                  "score": 59,
                  "content": "She lost control of her car and ran off the road into a parking lot.  We don't know anything about why she lost control of her car.",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 69,
          "content": "She most  likely won't be able to pay for it and will lose her job and home so in the end op won't get his money and she will end up on the street",
          "id": 114,
          "comments": [
            {
              "score": 11,
              "content": "Court ordered garnishments follow you around.",
              "id": 115,
              "comments": [
                {
                  "score": 65,
                  "content": "Yea....hence the whole making her homeless thing",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1894,
      "content": "NTA but it might make sense in the long run to forgive the debt. You absolutely aren’t the asshole if you keep accepting the money, but you could make a real difference in her life if you let it go. Sounds like her life is probably challenging. Really, it’s up to you.",
      "id": 117,
      "comments": [
        {
          "score": 479,
          "content": "especially the part where she can’t get her license again until it’s repaid .. so paying only 50 a week would actually make it worse on her. She can’t get a license, so she can’t get insurance, but still has to get to work so she’s probably driving illegally...",
          "id": 118,
          "comments": [
            {
              "score": 512,
              "content": "She can actually get her license reinstated if we provide a notarized repayment plan to the state. I'm 90% sure I could contact the State and have sanctions reimposed if she stopped paying after getting her license.",
              "id": 119,
              "comments": [
                {
                  "score": 397,
                  "content": "Yeah I agree with this thread. Like you aren't the asshole (she is), this money means a lot to her, you can go whichever way you want. The other people are very black / white justice-y. Who knows if she'll actually learn something from paying you money more than she already has learned, given that she probably f'd up her car too. You're also not an asshole for continuing to receive the payments. It'd kind of be an act of charity to forgive it. Is she deserving? Probably not. Would it help her more than you? Probably",
                  "id": 120,
                  "comments": [
                    {
                      "score": 249,
                      "content": "People know they are not supposed to drive without insurance. But do you think a waitress with 100$ to her name can afford it?\n\nThis is some real boot straps stuff\n\nPoor people are not poor because of some moral or logical failing. Sometimes your just poor",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "What if instead of having her pay you every 2 weeks, you request that she put her payments into getting auto insurance?",
                  "id": 122,
                  "comments": [
                    {
                      "score": 48,
                      "content": "[deleted]",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That's what I was thinking. She could just provide the bill receipt instead of paying him every two weeks. That way she'd still be able to get to her job and OP could both feel better about making this woman drive legally and helping her financially.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I think you’re a very kind person.  Agree with the poster above that if you CHOOSE to waive it that would probably help her immensely but just wanted to point that out that the fact that her well being is a concern for you shows exactly what kind of person you are!",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Is there anything of value she can provide you with that isn’t actual money? Or at least supplements some of the monthly payment?\n \nIt doesn’t sound like you’re ever going to get all that money back (certainly not for years), and this is likely making her situation all the more challenging (both personally, but also in actually paying you back). It could be a win-win if you can figure out something else that isn't necessarily financial.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Everything else aside, you are free to choose to be as nice or not to the lady. If you wanna do right by her and help out in whatever way makes you feel better about it, then go ahead. Life ain't so easy sometimes and you can't just go by some arbitrary metric of how you should act. She fucked up and wanting to be reimbursed for damages does not make you an asshole, but if receiving the money *feels* shitty to you and you don't actually care then say fuck it and move on. Bank some life karma or whatever else - there's never anything wrong with being good, even if you have every right not to.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "As I understood it, she was required to have a payment plan to get back her license. Since she agreed to pay OP   \n$100 every other week, that plan is now in place and she should be able to get her license back.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "This, thank you!\n\nOP is definitely NTA, and he could potentially become a bit of a hero. I'm sure the woman didn't hit his truck on purpose, and seeing her financial situation, forgiving the debt (after a few payments perhaps, there should be *some* consequences after all) would probably mean the world to her. \n\nHonestly, that you're considering her situation at all is wholesome, thank you, OP!",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This is what I was going to say.\n\nNTA, but if it was me and I could afford to, I'd call it done. Maybe out of kindness.  Maybe also based on considering how much of a hassle it still could be for ME, and how much more of a time-suck.   Assuming she actually makes every payment on time, it will be another year and half before this is over.  And if she doesn't make every payment on time, OP has to spend time following up on that.  (OP is the only one who can say whether or not it's worth it.)\n\nSomething it seems like we often forget in our culture- just because you're in the right doesn't always mean you HAVE TO \"win\".  ;-)",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "So much this.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I totally agree with this!",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I came here to say this exactly.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA and the above post’s comment is spot on.  \n\nA slight variation on their comment: if you forgive the debt, it could possibly result in you receiving real life karma (as opposed to reddit karma).",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This. You are well within your rights to accept payment that she is responsible for. Definitely NTA. It would, however, be very kind of you to forgive the debt. Especially if it's not going to harm you in anyway to do so.\n\nYou didn't put her in this situation. But you have the opportunity to make life a little easier for another human that's having a rough go of things. I don't think you should feel guilty if you decide to keep accepting payments though.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 850,
      "content": "NTA. but if you're concerned (and you are... You sound like a decent person) maybe work out something with her that wouldn't be as crippling to her.",
      "id": 136,
      "comments": [
        {
          "score": 355,
          "content": "I agree. I feel like if OP really doesn't mind the money, an option could be to forgive the rest of the debt after 3 or 6 months of payments, or lower it more, or something - enough to show she's taking responsibility and isn't blowing them off, whatever OP feels is fair.",
          "id": 137,
          "comments": [
            {
              "score": 273,
              "content": "That's actually a really good idea. This is the first post on this sub in a long time where I actually felt a moral struggle trying to decide what would be right. In theory she SHOULD pay off the entire amount, because she should never have been driving without insurance. On the other hand, OP puts more into his 401k each month than total assets this lady has to her name. She is in a shitty life spot, and a little kindness from OP might help her out.",
              "id": 138,
              "comments": [
                {
                  "score": 126,
                  "content": "Right? I feel so sorry for this lady. People are going on how about she's TA, and I agree that she shouldn't be driving without insurance, but sometimes you have to make do, and there aren't any other options. I live in the type of town where we don't have any public transport, and walking takes up to an hour just to get from one place to another, so I feel for her.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 93,
                      "content": "It’s stories like this that don’t REALLY have a satisfying answer.  Like of course she sucks for driving without insurance, and it’s his legal right to get repaid and he’s not an asshole for expecting he should—regardless of his income.\n\nBut it would be a HUGE benefit to her, and a relatively little bit to him, if he forgave the debt.  Accidents happen.  So he’s NTA for sure, but we need something like BYBAP (“But You’d Be an Amazing Person”).",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Yeah exactly... life is really hard for a lot of people and sometimes I think it's difficult for others to understand why someone would make a choice to drive without insurance for example. Like I'd personally never do it, but I'm fortunate enough to not have to make that choice. Plus I live in a city with public transit, which is exactly how I got around when I didn't own a car.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "Exactly.  It's situations like this that make it so difficult for people to break out of poverty.\n\nHave to choose between rent and car insurance?  The decision is obviously rent.  But then she gets in a car accident and loses so much money she may not be able to pay even rent.  Then she gets evicted, has trouble keeping a job because she can't shower regularly, and has to spend more money on food because packaged food costs more than cooking at home, and she can't eat leftovers from work because she's no longer a waitress.\n\nYes, she owes the money. But the consequences to her life are outsized compared to her \"crime\".",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "i think it'd be a really good idea for op to reach out and try to discuss this with her in person, tbh",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "yeah that's a good point.  like she did something wrong for sure the issue is more than the punishment for her is a punishment that could fuck over her entire life...the punishment shouldn't be THAT severe. so if he could work with her and still feel like she took some responsibility and he wasn't completely fucked but in a way that doesn't cripple her...probably best.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I was going to suggest something like this.  OP could \"save\" the payments and give them back to her in a lump sum at the end.  That would fulfill her legal obligation to repay him but also give her the money back, and having a large sum at once may be especially beneficial for her if she's living paycheck to paycheck.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Yeah OP is not TA but... personally I can’t take $100 off someone who’s pay check is $400 if im already making good money.\n\nMaybe every month or something?",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Yeah she made one payment somehow and hopefully does the second which at least shows she’s intent on follow through. What probably sucks is she’s probably going to use a payday loan which is going to be crippling.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 322,
      "content": "Legally and morally she has to pay for what she broke, but you as the victim can be as lenient or as hardass as you want. If you're concerned about her situation maybe reach out and renegotiate to lower payments, but it sounds like she agreed so maybe she makes better tips as a waitress than she wanted to tell the court. \n\nNTA because you're being reasonable.",
      "id": 148,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 270,
      "content": "Clearly this woman is TA for hitting your car...\n\nI don’t want you to feel like TA for asking what’s fair... she doesn’t deserve to get off scott free...\n\nBut is chasing her down to make a $100 payment for a year and a half worth the headache?\n\nYou can advocate for principle or you can advocate for the value of your own time. It sounds like a lose/lose so it’s your call... no real wrong answers here.",
      "id": 149,
      "comments": [
        {
          "score": 176,
          "content": "From OP’s comments, she totaled her own car and had to be taken in an ambulance to the hospital. I’m guessing she doesn’t have health insurance either, so she’s probably up to her neck in medical bills, and without a car. I wouldn’t call that “ scott free”.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 252,
      "content": "NAH. \n\nBut, I would applaud and respect you as a person for doing good for someone else, and forgiving the debt out of kindness and awareness of her situation. Not that you’re obligated to in any way! Seeing that you’ve already moved on financially though, it would clearly mean a whole lot more to her than it does to you. Emotional arbitrage...the best of investments. \n\nGodspeed.",
      "id": 151,
      "comments": [
        {
          "score": 5,
          "content": "You don’t think the woman driving recklessly in a parking lot without insurance isn’t an asshole?",
          "id": 152,
          "comments": [
            {
              "score": 115,
              "content": "She’s struggling financially. Maybe her coverage lapsed. Maybe she was so exhausted from working trying to make ends meet that she fell asleep for a second at the wheel. Maybe she was just being wreckless for no good reason. Idk. I’m not prepared to judge her without hearing more of her side.\n\nHowever, the good deed is not conditional on the behavior of the recipient. Would still be a nice thing to do, regardless if she was even grateful or not, and I would still respect OP for it. I also wouldn’t judge OP at all if he instead decided to continue to collect, as he would be well within his rights, morally and legally.",
              "id": 153,
              "comments": [
                {
                  "score": 44,
                  "content": "Yes! I am here for this Mr. Rogers-level of kindness.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I do appreciate you humanizing her, the reality is most mistakes are just that. OP does say that it seems she didn't intend to pay him back at all though and if true, thatd make her TA 7 days a week. She obviously is struggling and that can make people do shady things.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Nobot has mentioned this yet, but as far as I have read, nobody knows 'why' the accident happened! Everyone is assuming she was just being reckless or not paying attention. But what if her accelerator stuck wide open, brakes failed, or got stung in the eye by a bee...who fucking knows...point is, it's very possible that it was out of her control as well.   In my opinion, I would want to ask her what happened before I decided to forgive that debt or continue.  Assuming she would be honest about it.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "She was driving on a road, likely a commercial one as this guy was at work. Unless it was icy out, going 40mph is hardly reckless. He also has exactly zero proof of her speed.",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "She may have been on the road. Maybe she got cut off, swerved and hit a curb then launched into op's truck.",
              "id": 158,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 145,
      "content": "NTA you did nothing wrong and she's TA for not having flipping insurance!",
      "id": 159,
      "comments": [
        {
          "score": 165,
          "content": "Unfortunately not everyone can afford it. Judging by how dire her situation is, I would understand not having insurance. But it is still reasonable for her to have to pay for the damages to the truck. $100 every other week seems pretty fair imo",
          "id": 160,
          "comments": [
            {
              "score": 64,
              "content": "Just for reference here, my total insurance costs come out to about 500/year. I’m on a family plan, so I’m aware that I’m getting an incredible deal, but I guarantee you that the cost of insurance for a year would have been cheaper than 3.8k. She shouldn’t have been asking herself “can I afford insurance”, she should have asked herself “can I afford to not have insurance”?\n\nShe was basically driving while hoping that she’d never make a mistake, because if you get pulled over, even for unrelated reasons, cops want your insurance first thing. Then you get fined, or your license is suspended—both of which are expensive.\n\nEdit: guys, I’m aware I have incredibly cheap car insurance. That doesn’t take away from the fact that having no car insurance is bad. It’s as important as a driver’s license. Driver’s license means you know how to drive a car (theoretically anyways) and driver’s insurance means that you can pay for not driving well. If you cannot afford to pay for not driving well, you should not be driving. When you drive like that it’s completely unfair to everyone else around you because they have to bear the burden of your mistakes.\n\nThis woman made a series of bad decisions, and I personally feel that she needs to understand that there are consequences to a) not having insurance and b) driving badly, or next time it might not be an empty car that gets hit. It might not have been this time.",
              "id": 161,
              "comments": [
                {
                  "score": 68,
                  "content": "[deleted]",
                  "id": 162,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Its worse than all that, this is a society where not driving often isn't possible, not like someone so broke they cant afford insurance can afford talking an uber to get to work.\n\nEver try to coordinate a schedule with public transportation? Waitress schedules especially.\n\nAt every turn the answer is just \"are there no prisons\"\n\nI'm not going to defending driving without insurance or with a suspended license, but I sure get why it happens.\n\nAll related to people who are still driving when they have lost the ability to do so. reflexes, visual/cognitive impairment etc.\n\nPeople get backed into the corner, everyone looks the other way, and the takes comfort by who they can blame.\n\nYeah lots of shitty people out there, but for many of them, they have just given up imo. break the law or starve? \"I stole a loaf of bread\"",
                      "id": 163,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "People aren't understanding that driving is a privilege, not a right.",
                      "id": 164,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "That’s definitely true but I was actually thinking of a different cost-benefit analysis: “Can I afford insurance” vs. “Can I afford being caught/having an accident without insurance?”\n\nComparing the likelihoods and costs of potential outcomes of a scenario is an excellent decision-making tool.",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Holy crap, where do you live to be paying $500/year??  I’m in Louisiana and I pay $700/MONTH.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Wtf, are you driving a lambo?",
                      "id": 167,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Can I please ask your age, car and road convictions?",
                      "id": 168,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "So how many tickets and accidents have you racked up to get that absurd pricing?",
                      "id": 169,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I’m still on my parents plan, am female, have a used Subaru, and a history of being an excellent driver. Plus in Washington there are some insurance companies which will give high school students discounts for good GPA (i guess the mentality is good student=good driver, i dont know the details but I wasn’t going to pass it up).\n\nI’m fully aware that I’ve got a stellar deal but my point stands.",
                      "id": 170,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "LA is notorious for having high insurance rates",
                      "id": 171,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "She most likely count afford insurance at all",
                  "id": 172,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I totally agree the women should have insurance but lots of states have HIGH HIGH HIGH insurance costs. I currently have MA insurance and pay a little over 2k a year, which is fine. I was looking into moving to RI and the same amount of coverage with the same company would be over 6k. It’s ridiculous",
                  "id": 173,
                  "comments": [
                    {
                      "score": 2,
                      "content": "That is indeed ridiculous!",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Yeah, insurance rates vary GREATLY by state and even location within the state. Living in Ohio, I paid less than $80/month for amazing insurance, moving to Michigan my insurance rate jumped to $200/month for decent insurance...neither my husband nor I have been in any accidents within the last 12 years, we're over the age of 30, and haven't had any tickets. If she lives in the Detroit area, her insurance could cost over [$450/month](https://www.economist.com/united-states/2018/07/05/why-detroit-is-the-most-expensive-city-in-america-to-buy-car-insurance). Escaping poverty is hard and our society treats poor people terribly.\n\nEdit: typo",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I had 1 accident and 1 speeding ticket in florida, my insurance is 450 A MONTH, you live in a fucking bubble",
                  "id": 176,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Umm, no. If you can't afford insurance you do not drive, period. Where I live, it's illegal to drive without insurance, so it's a no brainer to me. There are minimums to the insurance we have to have that covers the other party for their injuries and vehicle damage (it's at least $2 million).\n\nIf you can't afford insurance, you should take transit or walk.",
              "id": 177,
              "comments": [
                {
                  "score": 60,
                  "content": "A lot of areas walking or transit isn’t feasible. I’m not saying don’t hold the woman accountable, but we need to rephrase it as “if you can’t afford insurance, you’ll just have to deal with being screwed”.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Its not that black and white. There are many areas where there is no public transit, or the public transit is insufficient. For this woman, it might be the difference between making a living driving without a license or abject poverty. I know which one I'd choose.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's illegal most countries and apparently all but 1 U.S. state where it is legal if you can prove you can afford to pay certain amount in case of accidents. \n\nSo this women was all but certainly breaking the law.\n(Unless that 1 state thing is wrong I didn't research it but that's what people said and no one refuted and too lazy to research that given I not in U.S.)\n\nEdit: according to link another commenter put it's only 1 state where you don't need insurance or a big deposit. The others you need to put like 50k ish deposit if not insurance. This is obviously something the person that hit him couldn't afford so in all likelihood they were breaking the law.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I know in Texas that is, or was when I took driver's Ed, something you can do.",
                      "id": 181,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Where do you live that 2 mil is the minimum requirement on personal auto liability?",
                  "id": 182,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "If only it were that simple. I'm not condoning driving without insurance and I would certainly do everything I can to avoid having to do it but driving isn't optional in many places.",
                  "id": 183,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "If you can't afford insurance, you don't get to drive a vehicle. Driving is a privilege, not a right. There is no excuse for driving without insurance.",
              "id": 184,
              "comments": [
                {
                  "score": 7,
                  "content": "So many of you just don't seem to have any perspective on this outside of what you've personally experienced. Driving is not optional for a lot of people. It sucks, and I definitely don't want anyone driving without insurance, but of a lot of people out there it's literally a choice between driving without insurance or being unable to work, get to a store to buy groceries, or any number of other basic things that you seem to be taking for granted.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "There are dozens of excuses for driving without insurance!  We agree it's stupid and (typically) illegal, and people should not do it, but please remember that there are circumstances where every option sucks, and sometimes the least bad choice is uninsured driving.",
                  "id": 186,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Most countries and apparently all but 1 U.S. state it's illegal to drive without a licence. And should be.",
              "id": 187,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 134,
      "content": "Thank you everyone for your responses. Truly appreciate it. I’ll take your suggestions and comments into consideration on what to do here. \n\nAlso, I want to take this opportunity to tell you to not use Travelers insurance (at least in the mid-west). They suck and were complete dicks to deal with. I’m sure most insurance companies are but if I can keep 1 person from giving them money I will consider it a success.",
      "id": 188,
      "comments": [
        {
          "score": 40,
          "content": "Hey OP, just a quick note I didn't see mentioned here that should be noted. My mom was a waitress off and on my whole life, and it's been standard at every restaurant she has worked at to not claim cash tips, only those made by card. My mom on paper looked broke, but in actuality would usually have a few thousand sitting under her mattress. She wasn't a big spender or anything, but depending on the restaurant and the shift worked, she could easily come home on a Friday night with a few hundred. Waitressing supported her through college with two kids, and as an \"in between real jobs\" source of income, and any skilled server at a busy restaurant can make some really good money.\n\nEdit to clarify, I don't mean serving isn't a real job, it is hard work and a very toxic work environment most of the time, my mom just used the phrase \"in between real jobs\" when she would go back to it again. It's one of the many skills she gained over her life and she uses it when she needs to.",
          "id": 189,
          "comments": [
            {
              "score": 26,
              "content": "I have also worked at plenty of places as a server personally and while that might have been the case for your mom none of this should be generalized to all serving jobs.  I'm not sure if this was a federal or state level thing but if a tip wasn't put on the card then a percentage of the bill would automatically be claimed for tax purposes.  Sometimes that means cash tips don't get claimed, but sometimes if it's a stingy crowd you end up getting more recorded as income than you've made.  It's absolutely not a good idea to assume that the income statements obtained by the courts are wrong.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Just to add to something you said, you go after your own insurance company for diminished value, not the person who hit you. Your own insurance would pay that out but it's incredibly (intentionally so) hard to prove your diminished value and usually costs more then you'd actually get back from a claim to secure the documents to make a claim.",
          "id": 191,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Hey, good on you for reaching out. This is a bad situation for you both. You must feel guilty about the money, realizing how little she has of it compared to you. People make mistakes, and it sounds like this one is really going to drag her further down unless someone decides to help her out a bit. \n\nAt the same time, you aren't obligated at all. She was driving recklessly. She isn't all innocent in this, even if she is disadvantaged and easy to sympathize with. \n\nWhatever you end up doing, you seem like a thoughtful person.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I work in collections for a law firm and have worked with Travelers in many occasions, including with deductibles. They have a tendency to be dicks when it comes to paying on any side.",
          "id": 193,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Why were they dicks? If they purposely avoided paying repairs that were actually relevant, why don't you invoke the umpire clause, speak to your agent, or speak to your state's department of insurance?\n\nAnyways I would reach out and set up a smaller repayment plan. Then if she showed remorse and timely payments, I would forgive the debt after 6 months or a year as a kind gesture.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "State farm is from my understanding the best insurance you can get in the US so I'd suggest if you're on the lookout for new insurance to give them a look. I had someone wreck my vehicle a few years back ago that didn't have insurance and they covered everything for me including the rental and all repairs. I'll never have any other insurance. I do hear that geico is comparable too.",
          "id": 195,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "You make enough money, why in the world dont you have better insurance that covers uninsured motorists,  rental car and $500 or less deductible??!!",
          "id": 196,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "curious for updates whenever you can deliver",
          "id": 197,
          "comments": [
            {
              "score": 2,
              "content": "Here's an update for now... I told her she can defer the December payments if she'd like. I'd leave it up to her. Other than that, for now, I plan to collect the full amount. Maybe I'll change my mind in a few months.\n\nA lot of people's comments really rubbed me the wrong way. Like I said in one of my other comments, I can sympathize with people's situations, specifically this lady's. Often, people end up in unfortunate situations that are not always due to their own actions. I don't know her history, but this one specific situation arose only from her actions.\n\nSoooo many people have this expectation that I should forgo this money that I'm owed simply because I make soooo much more than her. This expectation really rubs me the wrong way. People saying I'm fucking her over financially, I'm going to make her be homeless, make her commit suicide, I'm taking food out of her kids' mouths, yadda yadda....\n\nI don't care if people think I'm an asshole for this, maybe I am. I was looking for other's perspectives and appreciate people weighing in.\n\nI'm already being way more lenient than I have to be. I could try to collect the interest at 12% which would add at least $500 to the amount she pays me in addition to the other court fees. I'm sure there are other avenues I could take to try to get the money even quicker. All of that would make me an asshole.\n\nLastly, a lot of people have a distorted view on what \"rich\" is. I'm not rich. Sure, my family makes good money. But, we've only been making good money for a few years. We're both employees with no job guarantees whatsoever. Either one of us could lose our jobs tomorrow, then what?\n\nI do and will continue to pay it forward to someone or to some organization that I feel is deserving of it.",
              "id": 198,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Did you not have uninsured motorist coverage? I know a lot of companies won't cover accidents with uninsured motorists without it.",
          "id": 199,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Who the hell has a $ 3,800 deductible?",
          "id": 200,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 122,
      "content": "[deleted]",
      "id": 201,
      "comments": [
        {
          "score": 37,
          "content": "There are many, many consequences to being poor.\n\nThere are few for being rich. What is a fine to one is simply the cost to do it for the other. \n\nThat isn't to say that anything you said is wrong. I'm just pointing out that the consequences for being poor are often astronomical. Why did she veer off the road? We're the roads slick or icy? Did she fall asleep from.working multiple jobs? Did someone swing into her lane and cause her to overreact? None of those excuse the incident of not having insurance or driving and having an accident. But they make the situation a little different in the light. Insurance is expensive, having a car in expensive, but not having a car at all could be the difference between life an death. That isn't an exaggeration - America has shitty public transportation. Cars are no longer a privilege if you want to live and survive in today's economy. Having a phone and Wi-Fi are also considered necessities for life today. You can live without them of course but not many people have that option.",
          "id": 202,
          "comments": [
            {
              "score": 1,
              "content": "[deleted]",
              "id": 203,
              "comments": [
                {
                  "score": 12,
                  "content": "That is also true. I am reminded, however, that they probably have a better leg to stand on in an emergency like this. They're far less likely to suddenly face homelessness over $3k let alone $500 just based on the income given. That doesn't mean it can't happen at all or that money should just be waived aside is if OP doesn't also have issues surviving. With the info given...they're just more stable than most of the people living day to day.\n\nA huge portion of the population can be instantly made homeless with one false move or accident. A filling of mine split a few days ago and even with dental insurance it will cost me close to $500 to fix. I make only $26k a year. In Denver. If I didn't have the help of a boyfriend that would tank me instantly. I can't NOT have it fixed but the reality is that money a month spent for insurance doesn't make getting sick easy at all.\n\nHe needs new tires, I need new tires, and our heater is broken...in Denver in the winter. We're fine and eventually we'll get it fixed. You just to tighten a belt and save for it or try and fix it yourself. That's the reality.\n\nLife sucks when you're poor. Getting into an accident where I would have to pay $100 every week or so? That would be devastating to me. I drive as careful as I can but the likelihood of an accident is extremely great anyway. One just has to hope that nothing bad happens and you can pull yourself out of the hole one day.\n\nThe commentary on being disabled sparks another problem with the assumptions in the thread about public transportation. Having a mobility issues means that even getting to a bus stop is extremely difficult when potholes and poor city planning are plaguing the entire country. Elevators goes unrepaired, busses still lack curbside assistance, and lights change so quickly that even I (a relatively fit 30F) has issues crossing in time.\n\nIt doesn't in any way excuse what OP is going through with their vehicle but nor does it excuse the person who is at fault. It just puts in in a sympathetic light for me because I can only imagine the worries that are happening with money in this situation.",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}