{
  "post content": "I work at a donut shop this summer. It means I have to be up at 4:30 in the morning and it just sucks. \n\nAll the early customers are these boomer assholes who just love to demean me while they sit on their asses drinking coffee and collecting retirement. The worst is Dan. I’d say Dan is abusive to me.\n\nLots of stuff has happened with him but his latest thing started last week when he said he needed a receipt. I was like “dude, you paid for a donut and coffee with cash, why do you need a receipt?” He said “I’m not your dude, print the receipt.”  My manager came running over and apologized to dan and said for me just to print off the receipt. Dan gave me such a smug “I won” look. \n\nWell since then every morning Dan asks for his receipt, doesn’t even look at it and then throws it in the trash while staring at me. It’s just a big duck thing to make me feel bad and he’s “over me.” \n\nI told my dad this afternoon that I’m going to say no in the morning. My dad said “don’t be an asshole, you’re the employee, you do what the customer and employer says.”  I tried to argue but he said I’m being stupid and petty. I was like dan started it. My dad said basically to shut up.\n\nWould I be the asshole if I don’t print that receipt?",
  "id": 1,
  "comments": [
    {
      "score": 24,
      "content": "ESH. Ya he’s an asshole but you made this hard on yourself. If a customer wants a receipt, they are 100% entitled to one. You’re choosing a strange hill to die on man.",
      "id": 2,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "Your Dad is spot on.  If you decline to give the receipt YTA -- and perhaps an unemployed one as well.  But I sense you are looking for a more complete explanation.  \n\nFirst, while Dan also seems like he could be a jerk , nothing you have shared even begins to approach abusive.  \n\nSecond, he asked for the receipt and you seem to think you are entitled to know why.   That you will provide it only if he gives you a good enough reason.  Why is not any of your business.   Maybe he is establishing an alibi for a crime.  Maybe he is a crazy scrap booker.  Maybe they are perfect to use as scrap paper.  Maybe he is tracking stuff for tax purposes.  Perhaps he found a sugar momma to underwrite his coffee habit -- but she demands receipts.   Maybe he uses them to post an update on facebook everyday.  Maybe he is tracking where he spends every penny.  Maybe he thought you were over charging.  Doesn't matter.\n\nThird, dude, you work retail.  Dealing with unpleasant customers is sort of in the job description.   Getting into some sort of strange contest with customers is not.\n\nFourth, you might be required by law to provide a receipt exposing your boss to fines.  Even if that is not the case, refusing to provide one could well result in your termination and refusal to provide a reference.  And might make your boss think you are somehow skimming....",
      "id": 3,
      "comments": [
        {
          "score": 4,
          "content": "or Dan wants his receipt because Dan thinks OP is stealing cash sales.\n\nCashiers in, food places especially (because 100s of transactions of the same amount happening in a short time frame) can make the change for the price of common purchases keep track of how many purchased were not rung though and pocket the not rung sales.   E.g every weekday 200 people order coffee and a doughnut for $3.56 op doesn't ring out 10 they take $35.60.  That or maybe OP was just an ass that first time so no Dan is fucking with OP.",
          "id": 4,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "> Lots of stuff has happened with him but his latest thing started last week when he said he needed a receipt. I was like “dude, you paid for a donut and coffee with cash, why do you need a receipt?” He said “I’m not your dude, print the receipt.” My manager came running over and apologized to dan and said for me just to print off the receipt. Dan gave me such a smug “I won” look \n\nApparently you have never worked retail. OP what were you thinking? You are lucky your manager didn't fire you on the spot. YTA",
      "id": 5,
      "comments": [
        {
          "score": -9,
          "content": "Over a receipt he wasn’t going to look at anyways?",
          "id": 6,
          "comments": [
            {
              "score": 10,
              "content": "Yep. Customer asks for a receipt, you give him one. It's not hard. You seem to have many chips on your shoulder about having to wake up early (you took a job in a doughnut shop what were you expecting?) and serving \"boomer\" clients. Newsflash, you will encounter pricks in any job you work at, especially \"boomer\" ones. This attitude of yours is going to cost you.",
              "id": 7,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "It's none of your business what they do with it.  Its theirs to decide. Also,  just because he doesn't look at it doesn't mean it's useless.  A receipt wouldn't print if you were pocketing the money. Maybe he's just making sure the owner isn't getting robbed by his employees.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "INFO- why the fuck did you care enough about his receipt to ask about it? \n\nYeah he's an asshole but what does stooping to his level do other than definitely get you in trouble at work?",
      "id": 9,
      "comments": [
        {
          "score": -16,
          "content": "Because he’s a boomer fuck and I don’t want to give in to him",
          "id": 10,
          "comments": [
            {
              "score": 11,
              "content": "He may be a “boomer fuck” to you but you’re acting like a “Millennial piece of shit” in his eyes. While you’re at work you represent a company, so you need to put your emotions/personal opinions away. This doesn’t change as you get older btw, you’ll always have to cater to the customer in retail.",
              "id": 11,
              "comments": [
                {
                  "score": 7,
                  "content": "I think the OP is too young to be a millennial. He's a Gen Z asshole.\nYTA",
                  "id": 12,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Fair point, you’re probably right.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Yeah, you definitely don't sound like an asshole with that reasonable explanation...",
              "id": 14,
              "comments": [
                {
                  "score": -10,
                  "content": "Boomers are all shit so it’s reasonable",
                  "id": 15,
                  "comments": [
                    {
                      "score": 7,
                      "content": "So yeah. \n\nYTA.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Someone isn’t a prejudiced asshole at all.",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "ESH -\nI agree Dan is being a dick. However, in most places of business you are supposed to ask if the customer wants a receipt. Doesn't matter what they pay with, it's mainly to keep track of finances and tax purposes. Even if Dan is being as asshole, which he is, you should still do you're job and give him a receipt if he wants one.\n\nEdit: after reading some of the comments and what you responded. I am curious why him being a Boomer is such a big deal to you. Doesn't matter that he's a Boomer, it doesn't automatically make him a dick.",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "Info: Is it worth losing your job over? It sucks getting up early and working with annoying customers, but it sounds like that’s the job. If you want to keep the job, just print the receipt. There are always going to be annoying things at whatever job you have.",
      "id": 19,
      "comments": [
        {
          "score": -2,
          "content": "Yes probably to make a point",
          "id": 20,
          "comments": [
            {
              "score": 6,
              "content": "What's the point you think you're making? You're a dick back to him and you get yourself fired? Well done. How does that affect him in literally any way?",
              "id": 21,
              "comments": [
                {
                  "score": -2,
                  "content": "That I don’t put up with boomers",
                  "id": 22,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Spoiler alert- you are literally the only person negatively affected here. I doubt he'd even notice it's a different person giving him a receipt the next morning.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "What is your deal with “boomers?” Surely they don’t all deserve your hatred?\n\nGrow the fuck up.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": " what that you are a child?",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "YTA- so is he but I'd say you started it, not him. Customer wants a receipt, you give it to them. It's your job.",
      "id": 26,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "ESH. He's a jerk for continuing to antagonize you, but a lot of people need receipts for expense reports and reimbursement, whether they* paid with cash or not. It's not weird that he would be asking for a receipt in the first place, and your initial reaction to his request was over the top.",
      "id": 27,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH. Unfortunately your dad is right. Dan is being a tremendous dick and deserves nothing but contempt...but unfortunately you can't do much about that since he's entitled to a receipt. It's also nearly guaranteed that if you refuse to print a receipt you will be fired, and that will make him feel like he won even more. Don't give him that.\n\nFind other petty ways to make his life miserable that won't actually get you fired. Intentionally make a batch of his favorite donuts shitty and serve only the shitty ones to him (but don't tamper with them). Always make sure to serve him the coldest, shittiest coffee. Or as another commenter suggested, be pleasant to the point of condescension so that he gets the message but can't complain without looking like a jackass. You can do a lot to him without breaking the law and without risking your job.",
      "id": 28,
      "comments": [
        {
          "score": 1,
          "content": "If he serves him bad food, crappy coffee, you best believe there'll be a complaint and a firing. Young people don't know the difference between \"shitty kind\" and tampering.",
          "id": 29,
          "comments": [
            {
              "score": 1,
              "content": "Yeah I was really not sure whether to say any of that because I recognize that complaints are likely and that the OP was probably young and would take it too far. But things like what Dan is doing do really stick in my craw so I wanted to feel \"helpful\" in getting even.\n\nYou're right that was probably the wrong impulse.",
              "id": 30,
              "comments": [
                {
                  "score": 2,
                  "content": "I understand what you're saying about Dan but when you're out on front counter, cashier, or what have you, you'll always have that one miserable customer. Most people don't know how to de-personalize it.  I had to learn that being at the office phones (not even face to face) for a company.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "YWBTA and your Dad is right.  The easiest way to get fired would be to start arguing with a customer about printing a receipt. \n\nMeh, your post just reeks to me of someone who is just angry in general (waking up early, \"boomer assholes\", love to demean you, refusing to print a receipt, etc.) and is trying to latch on to something to justify their anger.  To be clear, Dan is an asshole too for asking for a receipt to mess with you every time, but is that really something you hold close to your heart ... printing receipts?",
      "id": 32,
      "comments": [],
      "relation": "Attack"
    }
  ]
}