{
  "post content": "**Update:** Wow! I did not expect this much support :) After reading your comments and a long talk with the bf, I decided I needed to cut ties with mom & and Jen. In fact, he pointed out that if we had kids, the mistreatment could extend to them as well and that settled it for me. I blocked them both and sure enough, relatives were calling/harassing me left, right & center. I blocked all of them too except an aunt and two cousins who actually took time to listen to me and apologized. Honestly I've never felt this scared but happy in my life. I am literally shaking as I type this. Thank you guys so much! Had I not gotten such overwhelmingly amazing support on here, I might not have taken this step!\n\n&#x200B;\n\nSo I was talking on zoom to my mom & sister Jen (fake name). At one point, my bf came in & handed me some tea as I had killer menstrual cramps and tea helps. When Jen saw this, she said my bf's actions were \"offensive to women\" and treating me like a fragile princess was enabling me. She said her husband doesn't help her whether she's well or sick and that's how a partnership between equals works.\n\nThis made me mad. My bf is a sweetheart and he understands that this time can be painful for me, so he helps out in whatever way he can. I told Jen that when I'm well, I take care of him as well - pack his lunch (his office has reopened, but my college classes are still online), make him breakfast etc. She got even more angry and congratulated me for becoming a 1950s housewife. This was crazy! I love taking care of my bf, but that doesn't mean I'm giving up on my career. It's just that I'm a morning person, so I handle morning chores, he does nighttime chores.\n\nJen went on about how offended she was until I left the call. Later, mom, unbeknownst to me, texted bf and asked him to stop helping me out whenever I was zoom because it upsets Jen. He didn't take her seriously, at which point she said he - an outsider - was disrupting internal family matters (This is the man who has made it abundantly clear that the minute our financials are in order, he's asking me to marry him). He lost it and said he'll take care of whoever he pleases in his own house.\n\nSo, this is where it might have gone into a-hole territory. As my mom persisted, bf said he had to look out for me since no one in my family would. This is not very far from the truth. Mom thinks older children always get the short end of the stick and has over-compensated by going the other way (e.g. I wasn't allowed to cry as a kid because \"younger children get it easier, so my problems were nothing in comparison to Jen's\", I had to share my birthdays & milestone events with her so that she didn't feel bad). This used to hurt, but I've made my peace with it.\n\nNow my extended family is blowing up my phone, saying we were rude and hurt mom's feelings. I got a text from my mom saying she did her best to be a good parent, but she was only human. This made me feel terrible tbh. But then she added that she expected bf to apologize to her and Jen on zoom in front of the entire extended family. I lost it! I'm not going to make him apologize for taking care of me just because they feel offended by it.\n\nSo AITA for not making my BF apologize to my mom & sis?",
  "id": 1,
  "comments": [
    {
      "score": 8830,
      "content": "What the hell did I just read?!\n\nYou are NTA and your bf should most definitely NOT apologize to your family...\n\nIf anyone in this situation should apologize, it's your sister for her crazy rant and your mom for going behind your back to tell your bf he shouldn't do nice things for you...\n\nYou and your partner are in a loving relationship in which you take care of each other. If they find that weird, they need to take a long hard look at their own relationship.\n\n\n>She said her husband doesn't help her whether she's well or sick and that's how a partnership between equals works. \n\nBecause this is absolute bullshit.",
      "id": 2,
      "comments": [
        {
          "score": 5140,
          "content": "My spidey senses are telling me the sister is super salty that her husband treats her ass like shit. NTA",
          "id": 3,
          "comments": [
            {
              "score": 2005,
              "content": "100%\nAnd her only options are admitting her relationship sucks or pretending her sister's sucks...\nMuch easier to pretend!",
              "id": 4,
              "comments": [
                {
                  "score": 747,
                  "content": "Absolutely! \n\nThis is a different level of craziness. What even is the point of a relationship if they can't/won't take care of one another, just to populate the planet!??",
                  "id": 5,
                  "comments": [
                    {
                      "score": 762,
                      "content": "We can only imagine their first date..\n\n*Hello fellow human. You are of adequate attractiveness and you seem to have no obvious malfunctions. My prior research has indicated you enjoy human hobbies. I too enjoy things like carbonating air and procreation. My dislikes include being a robot, which I am most certainly not.*",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "Transactional relationships work fine between a person and a company, but not two humans in an ongoing partnership",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 152,
              "content": "She was coddled by their mom her whole life and the husband doesn't so she's an asshole about it.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "I'm guessing the sister thinks her  husband treats her ass like shit just because he doesn't indulge all her whims like her parents used to do.",
              "id": 9,
              "comments": [
                {
                  "score": 45,
                  "content": "They're not worried that he's enabling her. They're worried that he's empowering her. They're worried she'll learn her own worth from this guy, and then it's bye bye manipulated doormat",
                  "id": 10,
                  "comments": [
                    {
                      "score": 10,
                      "content": "You know what, you're absolutely right.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 92,
              "content": "It totally makes sense that the sister would be super salty about this too, since OP describes their mother essentially favoring her as the oldest and shitting on OP for being \"the youngest\" in some strange attempt to correct what she sees as injustice for the older siblings of the world. Makes me wonder if *she* was an older sibling who resented her younger sister or brother.",
              "id": 12,
              "comments": [
                {
                  "score": 9,
                  "content": "My little sister was coddled, the rules suddenly relaxed for her, got more allowance, better gifts, etc., but I'd never take it out on my own kids. I'd just try to treat them all the same.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "Or she’s been so gaslit into it that she doesn’t realize how backwards her logic is.\n\n“He doesn’t help me at all even when I’m suffering because that’s what equals do” isn’t exactly the kind of logic you hear from people who are mentally healthy.\n\nWouldn’t actually surprise me all that much if she’s a victim of abuse with a line like that. Many abuse victims depressingly spend their lives feeling they deserve the abuse they get and that it’s the way things *should* be.",
              "id": 14,
              "comments": [
                {
                  "score": 37,
                  "content": "It struck me that maybe because of her upbringing she didn't help her husband when he's ill so maybe in a messed up way he's decided he won't help her either and rather than discuss it they're just playing this perpetual game where they don't respond to the others' need and call it healthy?",
                  "id": 15,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Imagine if one of them, like, fell or something and needed to be rushed to the hospital or something. Would they still not help the other because \"they're equals\"? Like, \"Sorry you're bleeding out from a head wound but I'm not driving you to the hospital or even calling an ambulance for you because we're equals and that's not how a healthy relationship works.\" I hope they don't have kids.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "Came to say this. OP and her boyfriend are partners who take care of one another. It’s lovely.\n\nAnd all this over some tea?! I just brought coffee to my neighbors. Should I make sure they don’t think we’re a throuple where I am the subservient one?",
              "id": 17,
              "comments": [
                {
                  "score": 46,
                  "content": "Exactly. What kind of Bizarro world does sis live in where a boyfriend cannot give his partner a freaking cup of tea? Whether she's feeling poorly, or busy on a zoom call or whatever?",
                  "id": 18,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Imagine if he'd included a biscuit. THE NERVE. How thoughtless and intrusive to make sure she has a nibble as well as being hydrated! \n\nThat sister is a loon. A jealous loon, but one all the same.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Oh no, all those times I did things to help sick people, and all those times they helped me! What arseholes we were! People have brought meals and other supplies for my daughter and I while we've had a non-covid virus for the past few weeks. I should have thrown them back in their faces!\n\n/s",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "It never ceases to amaze me how upset so people become, just because people treat their partners decently.  I've had people tell me that I've set feminism back for grabbing my husband a coffee when I was already in line, so I just grabbed coffee for both of us, rather than making him wait in line separately.   He does the same thing for me.   Both of us take care of each other, and we always do our best to remember that at the end of the day, we're both on the same team.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You can always tell who settled for too little when they act like that.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "You said this and I'm now just picturing myself handing my elderly neighbour a casserole, then giving him a sound punch in the face to ensure I establish my dominance. He might be 90, but I'm sure he's still got a penis, and this ain't 1950.\n\nSeriously, OP's sister needs to never be in a relationship with anybody other than a housecat. And not one of those cuddly ones either.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 2,
                      "content": "“Hey, Mister Simon! How are you? Here, hold this?” You hand him the casserole and BAM punch to remind him kindness comes with a reminder, dammit!",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Salter than the dead sea.  She's used to getting everything that OP gets but Mom can't give her an actual good partner like OP's boyfriend, so the next best thing is to try to manipulate him into not being a good boyfriend.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "This was my first thought. Sister is jealous and doesn't like that OP's bf takes care of her. Especially since she's been catered to her entire life for being the oldest she probably expects OP and her bf to fall in line so she can again get what she wants. The mother going out of her way to tell OP's bf to stop taking care of them.? Who does that.?!",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Ding ding ding, she’s caught up in her on web and trying to throw it on others. NTA",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Yeah, this reads as 100% jealousy on her sister's part, and the mom being upset on her Golden Child's behalf.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 274,
          "content": "I think maybe op was the scapegoat and seeing her being treated so well has irked the people that has put her last in most situations. The golden child (the sister) has deemed op isn't allowed to be treated well therefore the bf should stop. Fuck them, you should play that behaviour up more in front of them in the future. Breakfast in bed? Make sure you're on a video call. Him doing chores, catch it on video, post it on social media about how good a bf he is and how wonderful your relationship is. Etc etc.",
          "id": 29,
          "comments": [
            {
              "score": 96,
              "content": "I can't upvote this enough because it totally sounds like the older sister was the golden child. OP you are NTA, your sister's marriage doesn't sound like a relationship, it sounds like a business contract. The fact her husband doesn't help her when she's sick is not a sign of a loving relationship. I second the breakfast in bed idea or just social media posts about how attentive and caring bf is, because your sister is jealous, she's never going to experience a loving relationship like the one you have with your bf.",
              "id": 30,
              "comments": [
                {
                  "score": 6,
                  "content": "I am boggling at OP's mom's thought process. \"Siblings are often treated unequally, with the older on the losing end. Rather than treat my children equally, I shall treat them unequally, with the younger on the losing end. As a collective win for older siblings everywhere, or something.\" That's some bullshit.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "My advice was to disengage from this drama and maintain boundaries but this sounds kind of fun. \n\nWhen my daughter was 13 her grandmother asked her if she was a lesbian (because my dtr didn’t dress “feminine” or like jewelry). So inappropriate. Now my daughter has a plan to invite a friend over when her grandmother is here. They plan to hug and cuddle and otherwise further confuse my mother-in-law. Too funny.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "NTA and this comment resonates with me! This whole post reminds me of my own mum’s relationships with her mum and sisters. My grandad was an abusive, alcoholic AH and my mum and her siblings bore the brunt of his rage while gran kind of turned a blind eye (was probably just glad it wasn’t her.) My mum married a lovely man (my dad!) who treats her kindly and with respect. My grandma and aunts always ask what Mum did to deserve someone so nice, and why did my dad choose her? Like, wouldn’t you be happy that your daughter / sister didn’t have a nightmare marriage too?! Crazy.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Seriously, this. I can't believe OP's mom thinks the OP's boyfriend should prioritize Jen's feelings over OP's actual physical pain.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 217,
          "content": "I'm utterly confused that OP's husband bringing her a cup of tea makes her a fragile princess. But the mother and family berating the BF not to upset the sister is somehow normal?\n\nNTA, OP.",
          "id": 35,
          "comments": [
            {
              "score": 109,
              "content": "[deleted]",
              "id": 36,
              "comments": [
                {
                  "score": 28,
                  "content": "Yeah, anyone messaging OP to have BF apologize needs to know that his only role in this circus is that he brought OP a cup of tea. The horrors.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "I mean, it's clear the mother has always favored and coddled the older sister and her reasoning behind it is absolutely bonkers, so it seems in-character for both of them to continue putting the sister's every whim above OPs. I hope, if she needs to, OP is able to go no contact and have a happy life with her partner.",
              "id": 38,
              "comments": [
                {
                  "score": 17,
                  "content": "Yes, there's only room for one princess in the family as far as the mother thinks and the sister is it.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It doesn't.  But it DOES highlight how awful Jen's husband is, and that's the real problem. God forbid the scapegoat child have something nicer than the golden child.",
              "id": 40,
              "comments": [
                {
                  "score": 10,
                  "content": "Perceived awful. The sisters husband wasn't even on the call and is probably sitting there like what????\n\nI would also venture to say if he doesn't wait on her hand and foot he's considered a poor husband. Kinda sounds like the older sister would be a poor wife herself. eh?\n\nedit: I would also say we don't know maybe she won't allow him to help her.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 2,
                      "content": "My read on this is that Jen resents OP for having a better relationship, not that she actually believes all that balderdash. \n\nAlso, not helping when your partner is sick pretty much does make you a crappy husband or wife. \n\nAs far as Jen maybe not being a good wife, that's certainly possible or even likely, but the focus in this post was on the partners, not the sisters.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "'Befuddled' is a word that is not used often, but a perfect fit here.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I'm trying to wrap my head around how OP can both be a fragile princess AND a 50's subservient housewife.",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -10,
              "content": "Feminest logic:\n\nMan yells at woman- You're going to the gulag\n\nWoman yells at man- Haha that asshole deserved it",
              "id": 45,
              "comments": [
                {
                  "score": 6,
                  "content": "That's not feminist logic. Hell feminist logic, OP's relationship is great because they are arranging chores based on their personal preferences rather than outdated stereotypes.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": ">You and your partner are in a loving relationship in which you take care of each other. If they find that weird, they need to take a long hard look at their own relationship.\n\nHonestly, been with my wife 10 years, married 5. I do this type of stuff for here because I want to make her smile and bring her joy.  \n\n\nOP, your mother and sister have a fucked up idea of what relationships are and you should avoid their advice. In fact, they owe you an apology for butting into your perfectly health and normal relationship.  \n\n\nNTA",
          "id": 47,
          "comments": [
            {
              "score": 41,
              "content": "[deleted]",
              "id": 48,
              "comments": [
                {
                  "score": 45,
                  "content": "My hubby and I have been married for a few decades, yes decades. There isn't enough room to list the times I have had to take care of him and he had to take care of me. Injuries, surgeries, sicknesses, deaths in the family, sometimes it seems like half of married life is saying to yourself \"how can I help get rid of my spouse's pain?\" Because you can't stand to see them like that. Then the tables get flipped and they are taking care of you. But when the dust finally settled you find yourselves in each other's arms stronger for the experience and dare I say more in love.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 9,
                      "content": "100%",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Beautifully put. A good relationship is split 50/50, but it's an average. Some days you take on more, and on other days, they do.\n\nOP's sister's description of a 'good relationship' made me wince. It's just miserable.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "That's kinda the opposite of how a partnership between equals works (in this sort of situation).  Partners shore each other up, not let each other fail.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "He should apologize. “Dear future SIL I’m sorry your husband doesn’t care enough about you to take care of you when you’re sick”",
          "id": 53,
          "comments": [
            {
              "score": 15,
              "content": "This is the way.\n\nOr just blocking/going low contact.  Depends on how much drama you want in your life.\n\nNTA",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "Yeah mom is definitely an AH too and a hypocrite for this: she claimed bf is an outsider interfering with family business yet she goes behind OPs back to interfere with her relationship. \n\nNTA, stand your ground OP. Tell your mom to stay the hell out of your relationship and your sister to keep her insane views to herself.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": ">She said her husband doesn't help her whether she's well or sick and that's how a partnership between equals works.\n\nThat's pretty much the exact opposite of a equal partnership.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "The sister is effing bananas.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "That’s not a partnership at all! Sister is crazy and obviously very unhappy in her marriage. NTA",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1995,
      "content": "Seems to me that your sister is jealous AF, probably after years of being at the center of attention she can't stand that your boyfriend is more supportive and nice than her husband. NTA",
      "id": 59,
      "comments": [
        {
          "score": 805,
          "content": "Even so, the fact that a hand with a tea mug came into view of the camera and she just lost her shit is wild! Seriously, what is her life?",
          "id": 60,
          "comments": [
            {
              "score": 363,
              "content": "Honestly I would have started laughing at her after she called me a fragile princess. She was THAT upset over tea",
              "id": 61,
              "comments": [
                {
                  "score": 208,
                  "content": "For real! Considering also that the one accusing OP of being a \"fragile princess\" is the same person who OP had to share the birthdays with in order to not make her \"upset\".",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 141,
                  "content": "“What is THAT?! WHAT! THE! FUCK! IS! THAT?!!!!!!!!!!Is he bringing you CAMOMILE LIKE A SIMP?!!” 🤬🤯",
                  "id": 63,
                  "comments": [
                    {
                      "score": 2,
                      "content": "😂😂😂😂",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I would’ve scream cackled. Couldn’t handle that.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "The whole thing is wild! I always bring my husband a cup when I’m making one for myself. Do his work colleagues think I’m enabling him? Do mine think he’s coddling me when he does the same? Do they also only cook one portion of dinner each?",
              "id": 66,
              "comments": [
                {
                  "score": 41,
                  "content": "My roommate and I always offer to make tea for each other if we're making it and sometimes we bring each other treats if we're stopping by the store and know the other one had a rough day and/or is really high (because the reaction of a high person getting a treat is always great). \n\nWe aren't even dating! It's just nice to do nice things, especially when they require next to no additional effort. This post is so weird.",
                  "id": 67,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Like, my parents are coming up on 70yo. They were born in the 50s. Mom was a sahm and dad was a factory foreman in the 80s. It’s fair to say  there’s been some “gender-role” bias when it comes to chores in their marriage. \n\nBut you know what happens after they clean up supper every night?\n\nDad makes mom a tea while she cues up her Coronation Street.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 984,
      "content": "She's just jealous her husband doesn't care about her at all. How can someone be offended by something that doesn't affect them? Let people be happy. NTA",
      "id": 69,
      "comments": [
        {
          "score": 109,
          "content": "Even if it’s not jealousy (which I agree it probably is), why do people assume that their relationship is the only way to have a “good” relationship. Different people have different needs and lifestyles. Maybe extreme independence does work for OPs sister and husband, doesn’t mean it’s how all relationships need to be.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I would get on a zoom call with the extended family and say, “I’m sorry that your husband doesn’t love you Jen.”",
          "id": 71,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -45,
          "content": "Welcome to the USA.",
          "id": 72,
          "comments": [
            {
              "score": 55,
              "content": "What a weird slam on the USA.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "I don't think it's just the US, I think it's people all over that are just too damn bored with their lives to not stick their noses where they don't belong.",
              "id": 74,
              "comments": [
                {
                  "score": -32,
                  "content": "Oh I'm sure it's not just the US. It was just too good an oppurtunity to not make the joke, lol.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 679,
      "content": "NTA. You would be TA if you tried to make this your boyfriend’s problem. This is a family problem; the dynamic around Jen as the golden child has been well established. They emotionally abused you as a child and they are continuing to do so now. Your mom’s guilt tripping and employing extended family to pressure you further is not healthy or normal behavior.\n\nFor her part, it sounds like Jen is miserable in a loveless relationship and wanted to take that out on you and your bf. Not your circus nor your monkeys. Pay it no attention.\n\nThis is firmly a “them” problem, not a “bf” or a “you” problem in any way.",
      "id": 76,
      "comments": [
        {
          "score": 134,
          "content": "As Hitchhikers Guide to the Galaxy says - this is an SEP\n\nA “somebody else’s problem”",
          "id": 77,
          "comments": [
            {
              "score": 2,
              "content": "TL;DR: Don’t panic.",
              "id": 78,
              "comments": [
                {
                  "score": 3,
                  "content": "🤣🤣🤣🤣🤣\nIf that’s not the most accurate summary of the book, I don’t know what is!!!",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "Wish this was the top comment, people are glossing over both how quickly mom switched to guilt tripping and how quickly OP started to question herself.  It couldn't be more clear there is a golden child/scapegoat dynamic going on in this family and good for BF for calling it out.  I just OP doesn't let a (not at all her fault) broken normal meter screw up her relationship with him because the people who install our buttons can be REALLY good at pushing them.",
          "id": 80,
          "comments": [
            {
              "score": 30,
              "content": "She wrote an update, and I’m sure you’ll be happy to know that she is cutting off her family because her boyfriend said “they could mistreat our kids”",
              "id": 81,
              "comments": [
                {
                  "score": 15,
                  "content": "I am so happy for OP!  Cutting out toxic family members can be terrifying (I know from experience) but IMO the end result of a MUCH improved life is worth it.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I’m really happy for you and her!",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 342,
      "content": "NTA. Someone tell Jenny that her marriage sucks.",
      "id": 84,
      "comments": [
        {
          "score": 93,
          "content": "Oh she knows it sucks. That's why she's trying to pull OP's relationship down to her level.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Nonono! Apologize for her sorry state of a marriage. Say you're sorry for not stopping in to make her divorce her unloving and unsupportive \"partner\" like mother should have. Apologize to the extended family that they got pulled into this insane abusive circus act.\n\nThey want apologies. Give them what they want.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 264,
      "content": "NTA\n\nWait.... Wait... What the heck?? You sister thinks that a couple taking care of eachother is sexist, because her husband doesn't so the same? Did I understand that correctly?? And then you mother went and said that your  boyfriend needs to stop caring for you?? \n\nWhat did I just read?....\n\nOP I'm very glad you found someone that takes care of you (and you of him of course) those types of relationship are goals in my opinion.\n\nI really really don't understand the reaction from you family. To me it seems more like you sister is jealous of you, because her husband doesn't do the same. And you mother... Honestly I don't even have comments, I just don't understand her reaction.",
      "id": 87,
      "comments": [
        {
          "score": 121,
          "content": "I think mum and the family are basically saying \"hey, we decided to not care about you, so NOBODY should ever care about you. Otherwise it points out that we treated you like shit for no reason.\"",
          "id": 88,
          "comments": [
            {
              "score": 19,
              "content": "ugh that kind of hurt my heart to think people actually think about some of their family that way. I do think it's spot on though.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This is exactly what I think too",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 232,
      "content": "NTA, your mom and sister are both absolutely ridiculous. They can voice their opinions but they don't control what you or your partner do. Your sister should be the one keeping it to herself and apologising to YOU. Your extended and direct family are TA. It's a damn cup of tea",
      "id": 91,
      "comments": [
        {
          "score": 2,
          "content": "+1 \n\nThe man brought her a cup of tea. How is that offensive???",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 115,
      "content": "NTA What the crap? Sounds like you have a healthy relationship with BF while your family has VERY bizarre ideas of what one is.",
      "id": 93,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 115,
      "content": "The fuck is this noise? \n\n> \"younger children get it easier, so my problems were nothing in comparison to Jen's\", \n\nSo your mum used to belittle your feelings, make out that anything you were upset about was childish and wrong? \n\nYou had to share your BIRTHDAY with your older sister because she couldn't deal with a kid having a day about them?\n\nAll of this is wrong, very wrong. \n\nHonestly, lay this all out to your mum, make her see her ridiculous mistakes, and cut her out if she refuses to acknowledge just how messed up this all is. Then cut out anyone who who backs her up.\n\nIs your sister a narcissist, by any chance?\n\nNTA.",
      "id": 94,
      "comments": [
        {
          "score": 19,
          "content": "As a mom of 4, this is VERY WRONG. \n\nLittle kids dont always understand, true, but if you give in to them, then they dont learn.\n\nOP needs to go low to no contact with her family.",
          "id": 95,
          "comments": [
            {
              "score": 4,
              "content": ">OP needs to go low to no contact with her family.\n\nCouldn't agree more, they don't seem like great people.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Damn, I'm the youngest of four (with a minimal 6-year age difference) and I was pretty much raised to believe that my feelings are childish and usually very funny/ridiculous, that I'm generally unreasonable and that I should always be a good girl and listen to the sage advice of my elders. I'm in my early 30s now and my mum and oldest brother still treat me that way. It's really weird to come to realize only as an adult that it's not okay and maybe it wasn't my fault that my whole life has felt kind of humiliating. Ugh.",
          "id": 97,
          "comments": [
            {
              "score": 2,
              "content": "It's OK, the point where we learn things are wrong is the first chance we have to start making a change. \n\nDon't let anyone minimize your feelings.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I love how the older sister, whose feelings would be hurt if OP got a birthday to herself, has the audacity to call OP a \"fragile princess\".  Lol girl bye.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 91,
      "content": "NTA My family make and bring each other cups of tea all the time just because, this a normal thing to do regardless of any reason. I can’t think of a single reason as to why making your partner a cup of tea would be offensive to women. I also don’t get why it’s so bad to be fragile sometimes- as a couple you are there for each other, you help out when the other person needs it because you care.\n\nYour mum was wrong to get involved, and to try to demand what your boyfriend can do in his own home. Your boyfriends comments may have caused some hurt, but if this is the way they have been treating you then the comments are not unfounded.",
      "id": 100,
      "comments": [],
      "relation": "Support"
    }
  ]
}