{
  "post content": "Hello! First time poster here so sorry if it’s not formatted like the usual posts on here. \n\nMy fiancé and I are expecting our first child together. We thought it would be fun to go with the new tradition of having a gender reveal for our baby. I am currently 17 weeks and plan on having the gender reveal when I am 22 weeks. \n\nWe told our family with the cute gestures you see all on social media now of days. And immediately my mom offered to plan the gender reveal and baby shower. At first I thought this was a great idea so it’s less stress on me and I figured my mom would have my best interest in mind. My mom is also financially well off mind you. I agreed to this but at the planning process has been going along things have been very stressful for me. \n\nFirst, she didn’t like the venue I chose as she said it looked as if it were for a wedding and she began pushing for us to have a “shotgun” wedding. I declined after her number attempts of pushing it on me, my fiancé and I aren’t the traditional couple and want to enjoy our engagement rather than rushing. \n\nNext, the other venues we found weren’t good enough for her. She said she thought they were in bad areas and didn’t want to be “catfished” as we couldn’t see the venue until after booking. Which I understood. I sent her more places over the week and she kept saying they were too far from her (she lives around 1.5 hours away from me) and kept suggesting places in her area. I declined as I wanted the venue near me as I am pregnant and don’t know how I will feel that week of pregnancy. \n\nNow, my fiancé and I decided to just have the reveal at our home. We thought we can plan it the way we want without restrictions from a venue or having to get event insurance. We have a big family so this was many of the issues we ran into. \n\nMy mom scoffed at this idea and started sending me venues that began overwhelming me. I didn’t reply and had my fiancé speak to her so I wouldn’t get emotional or say anything I regret. We met for brunch and I thought we were all on the same understanding that the event would be at our home. But after an hour, she text me asking if we are firm or if she can continue looking for places. I told her yes we are firm. She then text me lowering her original budget by over half! The event venue cost more than what she said she is willing to help with now. \n\nAm I the asshole if I ask her to not be apart of the process? How would you go about this? We both aren’t able to afford to do a huge gender reveal without her money which sucks but I am tired of her attitude towards the planning process.",
  "id": 1,
  "comments": [
    {
      "score": 72,
      "content": "ESH.  Don’t have a gender reveal.  Surely you have to realize that 99% of the people who attend do not care about the gender, and those who do don’t deserve a party anyway.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 56,
      "content": "Paying a venue for a gender reveal party is ridiculous just do it at home. Better yet, don’t do one and call your family and tell them the gender. Put all the saved money in your future child’s college fund, or put it towards diapers and stuff.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 53,
      "content": "ESH. Anyone who has a \"gender\" reveal is automatically THe asshole even.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 41,
      "content": "YTA - gender reveal parties are creepy, cringeworthy, ridiculous gift grabs. Just have a baby shower already.",
      "id": 5,
      "comments": [
        {
          "score": 17,
          "content": "How is it even a tradition now? Is it that hard to send out a group message saying \"it's a boy!\" or \"it's a girl!\" It costs nothing and the news gets out. The first recognised gender reveal was in 2008. The woman is is credited with starting the trend has since  come to change her mind on the practice.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Or better still, pick a neutral color like green or yellow and do a combo baby shower where you will reveal gender. If needed ask some close friends or family to bring food.  Focus on a fun time.",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "ESH. Gender reveal party?! Fuuuuuck. These are not a good look on anyone.",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 24,
      "content": "Info: the biggest expense was the venue, but you're mad at your mum for cutting the budget now that she doesn't have to pay for a venue? Is that the crux of your issue?",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 24,
      "content": "YTA for having a gender reveal",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "Gender reveals, especially those that are featured on TikTok are revolting. But that’s just my opinion. Save it for the shower. ESH",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "this much stress over the most pointless event ever oh my lord",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 17,
      "content": "Absolutely no one cares about the gender of your baby. People only attend to either eat your food and drink or booze, or because of some misguided social obligation. Do not live your life according to what you see on social media. \n\nYTA",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    }
  ]
}