{
  "post content": "I (33F) have been with my boyfriend (46M) for almost 3 years. He moved in with me about 6 months after we started dating. Things were going quite well. He does not work, as he is a disabled veteran and collects a pension. I work a decently paying job and make about $60k more per year than he does. He would give me a few hundred dollars here and there towards food/bills when I would ask and I paid my mortgage and the rest of the bills. He was paying about $1200/month in child support for his 3 girls who lived with their mom, now 15F, 17F and 18F.  I have 2 girls, now 10F and 13F, who live with me 60% of the time and live with their Dad the rest of the time. \n\nAbout 6 months ago his girls' mom decided she couldn't take care of them any longer. She had ruined their family home (no running water, septic was destroyed, holes in the floor, 5 gallon buckets used as toilets, etc). It was awful to discover, and at no point when the girls visited did they share this info with me. I don't know HOW he didn't know what was happening but he says he didn't.\n\nAt that time, the courts decided the girls needed to live with their father, who lives with me obvs. I knew this would be a tough transition for all involved, so for the last 6 months I've continued to pay for everything and he's given me $500/month towards their support (food, bills, etc). Their mother has contributed nothing. Upon discovering that I was getting a bit behind with finances, I itemized my spending and determined that my costs have gone up about $1700/month since they came here, just regular bills, which doesnt include Christmas presents, clothes, salon trips, vacations, going out to eat, etc that I have also paid for.\n\nI showed this to my boyfriend and asked that he started paying me an amount closer to the cost of the spending, at least the $1200 he was paying in child support before they came here.  He became very angry, accusing me of being money hungry and insinuating he was taking advantage of me. Then he told me he would give me $750/month towards bills. I expressed that if he felt he could support 4 people for less than what I was asking him to contribute on his own, then he should do that. He says I should be OK because it's \"for our family.\"\n\nI feel like I am being taken advantage of, and what makes this feel worse is that I discovered my boyfriend's ex wife also was dating a younger person with a good job, and that guy is now suing her for taking advantage of him. It almost hits too close to home, but I do love my boyfriend, and his daughters, and I feel like if he should contribute more to the support of his kids when I am paying the bulk of our expenses. \n\nSo, AITA?\n\nEdit: He did give me the $1200 I asked for. He will pay at the beginning of every month. I told him I would let him know if I needed more, and he said he understood. I also want to clarify, I do have a very good income. I did not sacrifice my children's college savings, my retirement accounts, my investment accounts, or my mortgage. I wasn't able to contribute to my savings account and I was willing to sacrifice that for a time, but I was over it when I calculated the added cost of everything. We've had some hard conversations lately, but it's been working itself out slowly and I want to thank everyone who contributed with advice and support.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I may be TA because my boyfriend told me I was a b*tch for itemizing the spending and showing it to him instead of just telling him I needed more money, however, when I expressed I wanted a bigger contribution a few weeks ago he rolled his eyes, said, \"oh great there's a price hike now?\" and suggested we shouldn't go out on our planned date because it would \"cost to much.\"\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. Sounds like they all need to move out of your house into their own place. You are being used.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA and your relationship was really doomed or over (because of deserved resentment) the moment he said you were money hungry.  See, he's stealing from YOUR children who are YOUR first priority.  So yes, he's taking advantage of you and basically told you to suck it up.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. He is a mooch and you should evict them, as harsh as that is.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA - he is an adult with three children! Nowhere could you support a family of 4 for less than the $1,200 and that would not include any of the extras that you mentioned. Unless he is trying to get them all thrown out on the street, and really be in a pickle he better does some soul searching on priorities and helping pull the weight of his entire family unit.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. If the kids take 1200 a month to support then that needs to go to whoever is actually supporting them which is you, even if your boyfriend happens to have a physical presence. He cannot move 3 more people into your house and expect you to pick up the tab for the things they need. If he can’t contribute appropriately then he needs to find somewhere else to live with his kids.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "The truth is you are hurting you kids in the long run by spending money on his kids. NTA and I’m sorry but this would be a dealbreaker for me. Good luck. Hope you update us",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA\n\nYou feel used because you are bein used.\n\nHe got angry at you because you finally caught on that he was using you.\n\nYou might love him, but if you couldnt provide for him and his kids anymore, if he had to step up, how long do you think he would stay?",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. IMO, You are right, if he was paying $1200 in child support before, he should be paying that amount either to you, or paying all his own bills directly and you pay NOTHING.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. Kick him and the girls out. He can support the four of them on his pension.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}