{
  "post content": "My husband and I (both 27) got married a few weeks ago and he obviously is still upset about it but I don’t think I was wrong so I thought I would ask here.\n\nWe only gave plus ones to married couples or if we knew the SO well. My husband has one childhood friend that was coming from out of state to attend. I’ve met him a bunch but only his girlfriend of three years a few times because of the distance. \n\nI didn’t want to give him a plus one but my husband begged since he was traveling and didn’t know anyone else at the wedding and he didn’t want him to be uncomfortable or have to travel alone. I said fine just to make him happy. \n\nFlash forward to the reception I see him with some girl I have never seen before. I asked husband what was up and he told me that his friend and his gf broke up a few days before the wedding and since he already rsvped as 2 he brought a friend with him. \n\nI was pissed since I made an exception for him and I didn’t want anyone random at my wedding. I had one of my bridesmaid go to him and tell him he could stay but can his date please go back to the hotel this is a private event. \n\nHe said ok and didn’t make a fuss but he left with her and didn’t come back. I though on everything was fine and had a great night. \n\nMy husband found out about it the next day and we got in an argument. He’s mad because his friend traveled and I kick him out without talking to him. I didn’t kick him out just his date. \n\nNow it’s a few weeks later my husband still brings it up from time to time and his friend hasn’t been answering his texts. I kind of feel bad but it was my wedding and I didn’t want any strangers there.",
  "id": 1,
  "comments": [
    {
      "score": 51118,
      "content": "YTA. What was the actual harm of this person being there at that point?   And he had a plus 1 and it is unlikely he knew you gave him a dispensation on your “special day.”   This comes off as power hungry and controlling.   You responded to perceived rudeness with the ultimate rudeness, you kicked someone out which come on, you knew her date was going to follow, so you booted your husbands friend. \n\nYou are a ginormous AH. YTA.",
      "id": 2,
      "comments": [
        {
          "score": 14370,
          "content": "And she did it sneakily behind her husband's back. Bc she knew he would object. Definently not trustworthy",
          "id": 3,
          "comments": [
            {
              "score": 10073,
              "content": "She sent the bridesmaid to do it.  A wedding is the last place you want to be alone after just breaking up with someone.  At this point, the meal was paid for, the invitations had been sent.  Shouldn't the bride be focussing on her partner and having a great evening instead of policing the guests?",
              "id": 4,
              "comments": [
                {
                  "score": 4796,
                  "content": "Yes all of this. Also she says it's my wedding and I didn't want any strangers there. But it's her husband's wedding too! It was a real AH move on OPs part. Definitely YTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3609,
                      "content": "He had to \"beg\" her to allow his friend to have a plus one. Sheesh. She has massive control issues.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 844,
                      "content": "That line struck me as well. Makes it sound a lot like she married herself since it's her wedding and no one elses lol.\n\nYTA op. Yes, the bride is a big part of the day, but you're joining TWO lives together (and sometimes even more if previous kids are involved), the wedding wasn't just for you by yourself.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 472,
                      "content": "Especially because there is no evidence that stranger was causing problems of any kind.  I certainly don't see how one stranger was such a problem.  Certainly seems like a bride looking for something to be upset about. \n\nYTA",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 362,
                      "content": "No. You misunderstand. It’s only her special day. The groom is just another accessory /s",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 230,
                      "content": "I can’t imagine being that much of an AH bride to have done a room check on attendees & made an issue, especially *during* the reception. YTA, OP",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 156,
                      "content": "Yes she makes it sound like he did him a favor or something. “I let him”",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This, I keep seeing all this crap in other posts about how it’s the bride’s day, almost like the husband is a second class citizen and doesn’t get input",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "That is always a fun one.\n\nWhen I (the future groom) was involved with wedding planning, it was always a great time when we talked with vendors who didn't know what to do with me even being there. \n\nThe best was a caterer who simply would not respond to anything I said or even acknowledge that I was in the room. She literally would not make eye contact with me. \n\nAs she showed my wife her portfolio, she had a lot of photos of recent work, saying as she flipped pages, \"This was Michelle's wedding...Tatiana's wedding...Louanne's wedding...\"\n\nThe photos were of the food and the brides in their wedding dresses. No guests, no grooms, nobody else, nothing. Eventually, I asked, \"Did these women get married *to* anyone?\" \n\nThat got her to look at me. I'm sure she was shocked we went with someone else.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yep, husband knows no one, so gets a friend who has a +1. The +1 isn't an ex of anyone getting married, so what's the harm in allowing the hubby's friend another voice to talk to when the hubby is doing marriage day things?",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1053,
                  "content": "Exactly, he possibly even scrambled to find someone to join him. How could he have known about the exception?",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 564,
                  "content": "Too bad the bridesmaid didn't have the guts to say, \"I'm a bridesmaid, not a bouncer. Have a little class and let the guy have his plus-one.\" \n\nYTA",
                  "id": 16,
                  "comments": [
                    {
                      "score": 237,
                      "content": "Sheeyut...She was probably afraid she'd get kicked out too at that rate",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "You know she picked flying monkey bridesmaids",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Birds of a feather, I'd reckon. No one else in life likes to deal with these pocket dictators, they usually form cliques with like minded crapbags.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 213,
                  "content": "She did have a great time cause she got her way. But this is not a good way to start a marriage. And have u noticed that all throughout the post, OP is referring to as “my wedding” emphasis on the “my”. The husband is just there to make “her wedding” a reality. The wedding’s over now, one item ticked off her bucket list. The husband is now dispensable.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 17,
                      "content": "She will be surprised to find that she is dispensable. Her husband can get fed up and walk at any time.\n\nI doubt he can respect her or himself after what happened.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 89,
                  "content": "I noticed that she referred to it as \"my\" wedding. Bad manners & mean spiritedness are not things to shrug off. Definitely AH.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "The wedding I went to last year (worst wedding I've ever been to) sent bridesmaids to follow you to the bathroom that way you didn't leave.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I’m curious!  What made it so bad?",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "OP seems like the type of bride to have complained if he HADN'T brought a plus one because \"he already RSVP'd for two and now that's a waste of moneyyyy\" so this guy was probably sol no matter what he did.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I don't *think* anyone was at my wedding who I didn't know, but honestly, I was too busy getting married and having a reception to even care if anyone brought a date I didn't know. If I had noticed, I wouldn't have minded, though.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "She’s acting like a petty bridezilla.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I don’t even remember everyone who was at my wedding. Everything went so fast and I was mostly focused on my husband.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 381,
              "content": "[removed]",
              "id": 29,
              "comments": [
                {
                  "score": 197,
                  "content": "this is what gets me. OP is so self involved that she doesn’t realize that her husband’s friend is a person too. despite going through that break up, he still managed to travel to celebrate their union, only to be unceremoniously kicked out for something he wasn’t even made aware was a problem. \n\nOP is the AH 100% and even if there’s some underlying financial reasons, it just makes no sense to treat guests like this and your husband’s childhood friends no less.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 63,
                      "content": "And OP had so little going on during her wedding that she needed to play bouncer? I had a small wedding and wouldn’t have noticed randos. And honestly, I was so goddamned happy and excited that I would have given them a high five and directed them to the bar.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Even still, the plate was already paid for. The caterer would have had the number of attendees  the week before at least. It wasn't going to cost any more or less at this point.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "[Bot](https://old.reddit.com/user/AcceptableIcfd) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/yui1p4/aita_for_kicking_a_girl_i_didnt_know_out_of_my/iw9hmp2/)",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 340,
              "content": "Exactly! I hate it when brides go \"it's my wedding!\" Umm, no, sweetie, you should say \"it's OUR wedding\". Your husband has as much right to have a say as you do.\nETA: YTA!",
              "id": 34,
              "comments": [
                {
                  "score": 23,
                  "content": "Right? Brides who post things like this make me understand why the divorce rate is so high.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 280,
              "content": "She knew what the friend's reaction was going to be if the plus one was kicked out. You would have to be a complete moron to not predict the husband's friend would leave after the person they brought with them was kicked out.",
              "id": 36,
              "comments": [
                {
                  "score": 415,
                  "content": "The husband can make it up to his friend (and +1) at his next wedding.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Exactly, this marriage will not last long. She just ruined a friendship over nothing and now he’s wondering what the fuck he’s gotten himself into.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Divorce party",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "I love it!!!",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 271,
              "content": "[removed]",
              "id": 41,
              "comments": [
                {
                  "score": 9,
                  "content": "Partial comment stolen from u/DeerGodKnow\n\nu/RemoteOppositd is a bot.",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Bad bot",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 221,
              "content": "And got the bridesmaid to do it!",
              "id": 44,
              "comments": [
                {
                  "score": 348,
                  "content": "Well of course. Mean girls travel in packs.",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 202,
                  "content": "OP is wrong and an asshole, but just FYI, this is pretty typical. If something goes \"wrong\" the wedding party usually handles it so that the bride and groom don't have to.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 59,
                      "content": "Yeah, in most other scenarios you should absolutely confront people and do your dirty work yourself\n\nIf you're being married however that's the time for a bit of delicacy",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 172,
              "content": "[removed]",
              "id": 48,
              "comments": [
                {
                  "score": 10,
                  "content": "[Bot](https://old.reddit.com/user/BackgroundCasef) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/yui1p4/aita_for_kicking_a_girl_i_didnt_know_out_of_my/iw9fjxu/)",
                  "id": 49,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Exactly. If my SO did smth like this, I would rethink the entire relationship just because they clearly think it’s okay to go behind my back, especially when they 100% know I will not tolerate what they are about to do.",
              "id": 50,
              "comments": [
                {
                  "score": 9,
                  "content": "For real. If I was OP’s husband I’d be low key getting an annulment. Just saying. There’s still time to rewind this decision he made hopefully. That’s depending on what country/state/province they live in of course. Poor guy.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "AND she sent her bridesmaid to do it for her! So much to be grateful for and she’s focused on *this*, which is a made up problem. She ruined her own wedding with her personality.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2437,
          "content": "YTA \n\nPlus the plate and seat are already paid for. If anything the friend was trying to make sure that money doesn’t go to waste. \nWhen we got married (smaller wedding) it was $56/a person that we invited. 6 people bailed last min because of travel issues and getting sick. That sucked. If they had told us with more time we would have grabbed a few people. At like a week before we can only add and not subtract plates/spots. If anything he did you a favor.",
          "id": 53,
          "comments": [
            {
              "score": 2070,
              "content": "Plus the friend wasn't comfortable without a + 1, so he ended up bringing a different person ***so he wouldn't be alone at a wedding where he knew almost no one. You responded by kicking out his date; of course he was going to follow.***\n\n>*ETA:  I kind of feel bad but it was my wedding*\n\nETA: No, OP, it was you and your husband's wedding and you essentially kicked out a close friend of his.\n\nYou've shown your new husband how petty you can be, and this isn't going to go away. Plus you did this behind his back. What else is he going to learn about you that makes him have second thoughts about the person he married?\n\nYTA big time.",
              "id": 54,
              "comments": [
                {
                  "score": 1390,
                  "content": "This is why I am **firmly** of the opinion that every adult guest should be given the option of a plus one.\n\nPeople who are comfy attending alone will happily do so. People who will be more comfortable with someone they know well attending with them will have that option.\n\nAs a host, why would I not want my guests to be as comfortable as possible? The hosts of a wedding (whether that is the bride and groom, their parents, or some combination) should be acting as gracious hosts - they’re inviting *guests*, not an *audience*. \n\nI understand that there are financial considerations, but hosting people involves expense. That’s a given, and you choose your guest list accordingly. I’d rather cut my guest list than invite someone with the stipulation that they are barely important enough to be invited but not important enough for me to consider what would make them most comfortable.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 571,
                      "content": "I would never want to attend a wedding alone where I knew almost no one. I'd rather not go at all.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 263,
                      "content": "I agree with you. It is tacky to not invite a plus 1 for adult guests. Bringing a date to a wedding is a common thing. And bringing friends is great! \n\nThen again, I'm sick of the \"it's my special day\" attitude towards weddings. No, your wedding is meant to be the celebration of joining of two families. Be a gracious host.\n\nMy parents invited someone they didn't even know to be a bridesmaid at their wedding because the girl was sad she'd never been asked to be one. My parents have been happily married for over 40 years. How you make people feel matters.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "And if your budget is so tight that you have to worry about an extra person showing up, you should be doing something less expensive. Yes, the wedding is ‘their’ day, but the guests attending are real people with their own lives who have spent time and money to do them the COURTESY of showing up. It’s not right to expect them to jump thru hoops and be miserable for your benefit. She didn’t know the woman? Well, she must not be too bad if she drove from another state to support friend so he could be there to support the husband, and she doesn’t know anyone. And then to be asked to go back to the hotel like a dog? Omg I would be mortified, and should OP.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "As crazy as it may sound, I have never actually ever considered weddings quite like this and you are really spot on.  The distinction between a guest and an audience is huge and you worded it very well.  I really like what you had to say and it definitely gives me some food for thought.  You make some very excellent points.  🥂",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Exactly. I have had absolutely enough of all this wedding shit where women become spoiled toddlers, act like they're some kind of entitled royalty and that no one else on the face of the earth matters but this fantasy wedding they must have or they'll just die! Never giving a thought that it's the beginning of a marriage, not a fairy tale where they're suddenly a princess and all the world must bow down to them. So utterly ridiculous. Fuck that noise.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Agreed! I had a horrible time at my cousin's wedding because I didnt know anyone there and im not super close to that side of my family. The only wedding ive enjoyed so far was for my best friend's sister because some of the guests were close friends who werent in the wedding party. Weddings suck when you dont know anyone",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 902,
                  "content": "That would be devastating: to go to an out of town wedding, staying in a hotel, and then be told you are not welcome and ordered to leave. I would never be able to face those people again.  Who would do this?!?  YTA",
                  "id": 62,
                  "comments": [
                    {
                      "score": 459,
                      "content": "Right?! He came from out of state (so at least several hours drive and perhaps even flying and renting a hotel) to see his friend of many years get married. He spent a lot of time, energy and effort to be supportive and OP craps all over him and his date for no reason.\n\nETA: she didn't want the +1 there in the first place (why did her now husband have to \"beg\" her for this accommodation?) It sounds like her way of following through on what she wanted originally, which was to deny the friend his +1.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 223,
                  "content": "I think she forgot that the day does include the groom and he can make a decision regarding HIS day. \n\nYTA",
                  "id": 64,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The fact her husband had to ‘beg’ to invite a plus one for him… Is it not his wedding too?!",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 80,
                  "content": "Exactly. I bet hubby’s *close friend* can never trust/like/respect the bridezilla after this.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Next time he will know better than to marry someone like OP.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yeah! I was surprised while reading how she considers her husband as he is nobody. He should be smart and had second thoughts when he had to beg for inviting his friend.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's just Shellfish\"",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Exactly! She was more worried about wedding drama than enjoying her wedding and new husband. I think he's going to resent her for a long time because she showed her true colors, a petty, rude woman who went behind his back to kick his friend out.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 208,
              "content": "I need to be honest here. \"Grabbing a few people\" who weren't invited in the first place is telling them they are your B-List. It's insulting, tbh.",
              "id": 71,
              "comments": [
                {
                  "score": 356,
                  "content": "I got a last minute invite to a wedding, and she was honest that it was because of cancellations. I didn't feel bad about it because we were co-workers and I never expected an invite. I was honoured to find out I was B List, didn't realize I ranked that high.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 235,
                      "content": "This is the right attitude.  My wife and I had a very small wedding in August, one of our friends cancelled because he needed to travel back to the UK because his dad was ill (plus he hadn't been able to see his family in 4 years).  One of my wife's former coworkers lived near where the wedding was so we invited her and her husband and not only were they thrilled to be invited (even as \"B-list\" or whatever) but they went above and beyond helping us by running picking up the food and cake, helping out with a lot of day-of tasks, etc.  We're actually a lot closer now because of it.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "The points you and others are making about co-workers are great. Heck, I'd jump at it, too for certain coworkers! If it's friends or family, tho...Ouch.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yeah, I’d be completely honest - they’d already know I was getting married and they hadn’t been invited.  Wedding food is usually pretty good - on the other side I’d absolutely take the free meal and have a good time.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 110,
                  "content": "Depends on how close you are. If it's like, a coworker or someone they're not close to who never expected to be invited then I'd say it's fine. They know that they are B-list, but they are still welcome at the party.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 101,
                  "content": "I was at at wedding once where our family was only invited to the ceremony not the reception.  Then after the ceremony the mother of the bride came over and begged us to attend the reception.  Turns out the grooms entire side rsvpd but didn’t show up because they didn’t like the bride.  I thought it was rude but went anyway because I felt bad for the groom\n\nPpl screw up weddings in so many ways.  One of my old workmates invited everyone at work but gave them a later time.  By the time they showed up the ceremony and dinner was over.  The bride just invited them for drinks and dancing.  They got KFC on the way home",
                  "id": 77,
                  "comments": [
                    {
                      "score": 73,
                      "content": "Ceremony but not reception, is just gift grabbing.",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "With times like the last couple years where some gathering sizes were limited, I think it makes sense that they might not be able to invite everyone they want at first, so they don’t go over",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Maybe. Depends on how close the relationship is though. I could think of a dozen people from work that if I said \"hey we suddenly have more space than we thought at our wedding this weekend want to come?\" They would probably come. Now if it was like my first cousins or something they'd be mad they weren't invited to begin with! But I think certain people would be okay with it.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah that’s fair. Our wedding was weird. My older bro got engaged about 6 months after us but decided to have his wedding the month before ours. \n\nDue to stuff with his first wedding and my moms beliefs (and bro getting drunk and inviting mutual friends and family to his wedding when we were supposed to discuss it a bit more) my mom asked us to not make family choose between us and asked us not to say anything about ours. People found out anyway because family talks and there was family and friends that wanted to go. We just held back on invites because of the debacle that happened with arguments and much more after my bro did this. \n\nDefinitely get even with this explanation it comes across insulting. Good call.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I had a 50 person wedding that was all family except for 3 friends. The minimum number of people we could pay for was 50 and we had a few cancellations due to sickness and snow messing up travel plans. We were only going to have 40 people, so there were a few randoms added last minute, like my brother-in-law’s new fiancee’s parents. My other brother-in-law actually had his girlfriend and a few friends crash our reception after dinner. I wish I would have known they wanted to attend because they could have come to the whole thing. No one was insulted to be invited last minute to a family only wedding.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I think it depends how close you are to the person. I got invited to a wedding of a dude I hadn't had contact with in about 8 years and didn't really know that well to start with lol, although we did got along pretty well whenever he had hung out. If I was getting married it wouldn't have even crossed my mind to invite him so I certainly wasn't insulted to get a last minute invite to his. It was a destination wedding and pretty clear some ppl must have turned down the rsvp and he was looking to fill spaces.\n\nBut yeah, if it was someone who would definitely be on my invite list and I felt I was getting a last minute invite to theirs, that's different for sure.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It depends, if you were going to have an event with only family for example, and they got sick, I know my friends would be happy to step up to fill those spots that were meant for relatives and not think they were b-list, just that the parameters of the event changed.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "We had 14 people cancel in the 24 hours leading up to our wedding, so down $1400. The reasons ranged anywhere from \"I forgot I had to work\" to \"OMG MY WIFE WENT INTO LABOUR EARLY\". \n\nWe were able to fill a few spots by just telling some people to bring another friend along if they wanted a free dinner, an open bar, and a party. We also invited our officiant to stay for dinner and she brought a friend. If the plates are already paid for, might as well have someone enjoy them! I don't even know the girl who caught my bouquet!",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "She is a major YTA-  \n\nWe also had a small wedding of 50, we paid 150 a person, and ended up having 10 people not show.  Was super annoying. We lost a lot of $$$$, from those 10 people not showing!  \n\nI didnt let it ruin my night, but i also didnt police my guest. I enjoyed my wedding. My god she is a major a-hole.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Hubby and I were invited to a wedding a few days beforehand because someone had cancelled last minute. The groom was a friend of hubby's from school. We had a good night out and they didn't waste money on empty seats. Win-win!",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 634,
          "content": "I am currently speechless with my jaw somewhere down in the basement.\n\nCan this actually be real?\n\nThe friend probably quietly left because he knew what his buddy was marrying into from previous meetings.",
          "id": 88,
          "comments": [
            {
              "score": 232,
              "content": "Honestly, I had the same thought too. If the friend hasn't talked to him in weeks because of this then he was probably disappointed/hurt, but not surprised by her petty behavior. You don't just stop talking to a friend over one incident, either, especially since he must have known it was her doing and not him. \nI wouldn't be surprised if he'd had a \"Are you really sure about her\" discussion with OPs husband over thus type of behavior.",
              "id": 89,
              "comments": [
                {
                  "score": 105,
                  "content": "If it was out-of-character for the bride to act this way, I expect the friend would have contacted the husband by now to say something like \"Hey, the brides maid did this, was this a miscommunication? I don't want bad blood between us because someone misunderstood.\"  Instead the friend noped out and went NC because he knew exactly what happened wasn't an accident or a one-off.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 16,
                      "content": "YTA- If she wasn't causing any problems then OP had no real excuse to throw them out.  Time for OP to get down on her knees and beg  all parties, (including the hubby, the groom's friends,  AND the bridesmaid turned assassin) to forgive her. \n\nOP  needs to send a generous gift card so Friend can go to a VERY NICE restaurant.\n\nHubby's friend could be STILL seething, and is not ready to have that conversation yet, because he doesn't trust that he will be able to remain calm and courteous.",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 616,
          "content": "YTA and I give the couple <3 years. \n\nToo bad the husband found out how awfully selfish the bride was too late. \n\nHad something like that happened before the wedding who knows if he would have gone through with the marriage.",
          "id": 92,
          "comments": [
            {
              "score": 234,
              "content": "3 years i give them 6 months , run hubby , run .",
              "id": 93,
              "comments": [
                {
                  "score": 116,
                  "content": "It's more fun to say less than 3, I mean you get to make a little heart <3",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Probably within the time frame for an annulment",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "I've got $20 on an annulment",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "3years?!?\nI believe that is very generous.\nI think it will be more like 3 months or until he tells her, “No” & won’t do something she wants to do.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I don't think there's gonna be *any* heart years.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 535,
          "content": "I just attended a wedding solo where I ONLY knew the bride and groom. And I traveled 3000 mikles for it. Not only did I spend a weekend alone in a city that I only visit to see said couple, it sucks. I can be friendly and chat with the people at my table - but it is most definitely not the same. It is awkward and lonely and, honestly kind of depressing. YTA. Someone cared enough about you to travel, get a hotel, buy/rent formal wear, take vacation days...and you left them with a bitter taste of regret.",
          "id": 99,
          "comments": [
            {
              "score": 109,
              "content": "And someone that didn’t even know her cared enough about supporting the friend so he could be there for husband that SHE also did all that for a couple she didn’t even know. And then got treated like that.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I agree- The wedding isn’t all about you! Two families & friends joining / blending together - you have the Nerve to slap a your husband’s best friend with such disgrace! \nPpl spent money to be there- you didn’t care about anyone else but yourself!",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "And he'd just broken up with his girlfriend of 3 years DAYS before! I'd have been an absolute state. Poor bloke.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 389,
          "content": "What’s bigger than ginormous? You’re that too. Megaton AH.",
          "id": 103,
          "comments": [
            {
              "score": 18,
              "content": "Also, she didn't want to give him a plus one but her fiance begged? Why is she bestowing invites like it isn't his wedding too?",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Megaton AH to the power of ♾",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 319,
          "content": "She could have just focused on everyone else around her and be happy that she’s marrying the love of her life, but nah… she’s hurt her husband, who is ALSO a main participant of their shared event. It’s so appalling.",
          "id": 106,
          "comments": [
            {
              "score": 127,
              "content": "Yes, why focus on that? She’s married, she’s hopefully enjoying her reception, but she sees one unfamiliar face and that means *someone broke what she wanted and*… she ignored what her husband had said (that his friend needed company) and blew everything up. Over what really was, at that point, a very minor detail for her, but a big deal for the guest. Person had already been there for a while. Don’t want someone you don’t know? Go over and meet her.",
              "id": 107,
              "comments": [
                {
                  "score": 30,
                  "content": "Exactly! Make a bloody effort to get to know your new husbands mate and the person he came with.\n\nGinormous AH, indeed!",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Instead she ruined her own wedding (and maybe even her own marriage).",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "All this drama and now distrust from her husband could have been avoided if OP had just been kind instead of controlling! No skin off anyone’s back at that point, so she should have let it ride.",
              "id": 110,
              "comments": [
                {
                  "score": 6,
                  "content": "I feel so bad for the husband. Dude just wanted his friend there and for his friend to feel comfortable around people he doesn’t know. ONE support for his mate. *smh*",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "But it was a Private Event! Obviously random people she'd never met were gathered outside with the paparazzi, just waiting for a chance to get in! If she'd let her prop - sorry, groom's, friend have someone to talk to, she'd have to let them all in! She had to maintain exclusivity somehow!       /s",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "This same situation happened to me, but it was my sister who brought a friend.   \n\n\nTurns out that \"friend\" hated my husband from elementary through high school! But my husband let the friend stay because who is going to kick someone out of their own wedding, ya know?",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "Not to mention she made her husband BEG for something at his own wedding. YTA the second hand embarrassment on this one is real",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "Not sure the husband will remain her husband for long. Such controlling & unforgivably rude behaviour. Also, I wonder what the bridesmaid thought about having to deliver that sort of message. OP, YTA.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 26438,
      "content": "You were so concerned about making the wedding perfect for yourself that you ruined it for your husband. YTA.",
      "id": 116,
      "comments": [
        {
          "score": 3609,
          "content": "It's just Shellfish.",
          "id": 117,
          "comments": [
            {
              "score": 1414,
              "content": "LOL so it took me a second to realize this was probably an autocorrect issue. But for a second there I was like what does seafood have to do with any of this? Gave me a good chuckle. Also yeah OP: YTA",
              "id": 118,
              "comments": [
                {
                  "score": 504,
                  "content": "I'm still trying to figure out if it's a related joke that I just can't figure out lol.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 77,
                      "content": "I thought Ted Mosby on HIMYM. Pretty sure that joke is in there somewhere",
                      "id": 120,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 38,
                      "content": "I was waiting for someone to explain the AITA reference that I don't know about aha",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "There was a selfish/shellfish joke on the pandemic episode of South Park.",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 125,
                  "content": "I thought it was a joke based on their username? Deer instead of dear? Know instead of no? \n\nOr is this just a whoosh moment for me",
                  "id": 123,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Oooh I didn't notice that. Could be what you said!",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I think they’re just silly.",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 69,
                  "content": "There was also a south park episode making fun of covid where someone didn't want the vaccine because it contained shellfish and he was allergic, so he didn't want it because shellfishness.",
                  "id": 126,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Is this the new \"I mess up common phrases\" account\n\nI ain't seen that account in ages.",
              "id": 127,
              "comments": [
                {
                  "score": 8,
                  "content": "I miss that person. Watching people correct them was always fun",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "🦞 or 🦀?",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Oh barnacles!",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 576,
          "content": "Not just that, OP was embarrassingly rude to a guest who had done nothing wrong for no reason. \n\nNot only did OP drive away her husband's friend beacuse she dosen't care about other people (including her own husband's) feelings, he is likely embarrassed to married to someone who would act the way she did (I sure would be), and she damaged a friendship he cared about for no good reason.\n\nHusband's friend had no way to know that his plus one was some sort of special exception from you. He had no way of knowing that the plus one you gave him was only beacuse you knew his girlfriend. He had no way of knowing your strange issues and requirements, since you didn't tell him. \n\n**From friend's pov, you invited him with a plus one. He RSVPed with a plus one. Your invited guests paid for plane tickets and a hotel to travel to your wedding. Then, when your invited guests got there, you kicked them out. Beacuse they failed to guess the secret requirement\\* of attendance by long distance reading your mind.** \n\n\\* The secret requirement is that you know the plus one. This is especially hard to guess since you didn't really know his girlfriend you did invite. How on earth was he supposed to guess this??",
          "id": 131,
          "comments": [
            {
              "score": 74,
              "content": "This. They did everything \"right\". They were invited and had every reason to believe they were invited. Then they get seemingly arbitrarily kicked out, by the bridesmaid, and end up all dressed up wtih no place to go and having used considerable time and money. \n\nUnfair as it is, not the best of beginnings for the friend's possible new relationship either.\n\nI can't imagine an apology that would make me forget who OP showed herself to be. Maybe a decade of sincere contrition would do, but I don't think OP does sincere.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Not to mention kicking the guy while he’s down after breaking up with his long term gf a few days prior",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Excellent observations, thanks and well said!",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 491,
          "content": "Something that none of these brides think of...the person they are marrying. These men need to get the marriage annulled after bs like this. If she doesn't  consider you on your most important day together,  she won't  be considering you during the rest of your lives together. Get out now! YTA",
          "id": 135,
          "comments": [
            {
              "score": 57,
              "content": "I don’t know what it is about weddings since I’ve never had one lol, but there is *something* about them that turns some women absolutely crazy. I’ve seen first hand multiple smart capable kind and otherwise great women I considered friends just absolutely lose their marbles and become Bridezillas, screaming at their parents or their future husband, just continually being a dick\n\nLike I genuinely thought it was just something that existed in movies until I’ve seen it actually happen. I could not believe it. Like yes I understand there is a TON of stress on the bride but it was more than that - it was like an alien came down and replaced the person I knew. Then after the wedding they were back to normal. It was almost creepy \n\nI’m sure groomzillas exist and I don’t want to harp on one gender unnecessarily, I’ve just never experienced one. It literally is just a party!",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "But it's her special day!  /s",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 258,
          "content": "Yesss. It’s your wedding, but isn’t it your husband’s too?",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "Yep, everything she says is about \"her\" wedding as if the groom wasn't really even a part of it.",
          "id": 139,
          "comments": [
            {
              "score": 24,
              "content": "He was...just as a place holder for pictures and formality.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 121,
          "content": "She did say “my wedding” instead of “our wedding.” That alone gives Yta vibes without hearing the rest of the horrible ah stuff.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "“My wedding” !!!",
          "id": 142,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Sounds like this marriage is doomed",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "She has literally said it's her wedding, so I doubt that she gives a fuck about ruining it for husband.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "She was so preoccupied with whether she *could* she didn’t stop to think if she *should*",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13499,
      "content": "You gave him a plus one and he used it…and then you were rude and revoked it, during the reception. \n\nHis plus one did nothing wrong, wasn’t causing a drunken scene or anything…and you got offended because she existed? Sorry bridezilla but YTA 🙄",
      "id": 146,
      "comments": [
        {
          "score": 3203,
          "content": "You know who else I feel sorry for, besides the embarrassed friend and his humiliated date? The poor bridesmaid that was given then task of telling them to leave. I would have told OP to fuck right off if that had been asked of me. Nope. Bridezilla indeed.",
          "id": 147,
          "comments": [
            {
              "score": 509,
              "content": "Good point!!!! The poor bridesmaid!",
              "id": 148,
              "comments": [
                {
                  "score": 681,
                  "content": "I feel bad for the husband. He didn't get to have his friend at the reception, and now he's gonna have to deal with this shitty behavior for the rest of his life.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 352,
                      "content": "I thought more about it, I feel bad for Everyone who has ever encountered this person. The poster was SO convinced she was “right” that she posted this here… imagine meeting someone in real life with this lack of self awareness and audacity level.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Hopefully when he decides to divorce her he let's his friend deliver the news.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "It was a childhood friend even, someone he’d known for decades who’d traveled to be there. So incredibly rude and controlling. OP is definitely TA. Poor groom.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Right, like how embarrassing for both the husband and the the friend. Super embarrassing for the poor date, too. I hope the bridesmaid was at least apologetic and didn’t do it in front of the date, that way not everyone was humiliated. :/  the lack of self awareness speaks volumes.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It's so weird that some bridesmaids are expected to do the job of a bouncer",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Agreed, 1000%. How dare OP make her bridesmaid do her dirty work and kick them out. In addition to this, OP’s husband now has to deal with the fallout. I hope that OP makes quick and sincere amends because that entire incident was uncalled for.\n\nOP is the AH.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 686,
          "content": "Exactly. She had already agreed to a plus one. *SO* tacky to revoke the invitation, especially when the guest is already AT THE WEDDING. \n\nAlso, this whole “but it was my wedding” line is total crap. It’s the husband’s wedding, too, and he wanted his friend there. He also wanted his friend to have a plus one, which makes total sense given the friend was coming from far away and wouldn’t know anybody else at the wedding.\n\nNewsflash, OP — your wedding should also be fun for your guests, who are spending time and money to be there. So long as you have room in the budget and there isn’t a known issue or conflict with any of the invitees, offering people plus ones is just the decent thing to do, especially if they don’t know many other people in attendance. No one wants to come to an event like that alone, where nearly everyone’s a stranger to them.\n\nYou can harp all you want about it being “your” day, but any decent hostess considers the comfort and enjoyment of her guests. You clearly only considered yourself. You didn’t even give a damn about what your husband wanted. Rude AF and embarrassing behavior on your part. Of course YTA.",
          "id": 156,
          "comments": [
            {
              "score": 140,
              "content": "I'd think it's absolutely normal for there to be people at a wedding that either the bride or groom doesn't know. Like family from far away, or friends from before they met.",
              "id": 157,
              "comments": [
                {
                  "score": 20,
                  "content": "I got married this weekend and there were absolutely people at our party I didn’t know, my husband has family and friends from everywhere!!  I barely remember more than highlights, having a random guest wouldn’t have even registered!  If the whole wedding was only like 25 people, then sure, an unknown person would stick out.  But if it was even close to a typical wedding, the poor date would have been fine.  YTA",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Weddings have gone so far from being an event where you *host* people to celebrate a marriage, to the point where it’s all about the bride’s Disney Princess fantasies. I don’t think this woman has ever learned a thing about being gracious.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Well technically it depends on a couple of things. FIRST. A GF of 3 years should not be listed on an invite as “and guest” aka +1, that’s offensive and rude. She should be addressed by name on the envelope. If a named guest cannot attend then they/the other invitee should revise the RSVP and ask the couple how to handle. However it sounds like the guy might’ve asked the groom and the groom OKed the rando +1 in lieu of the named guest ex-GF. In which case OP is TA. \n\nSECOND. If OP insisted on rudely and offensively addressing a 3 year GF as a +1 rather than by name as etiquette demands, then the named invitee was perfectly within his rights to invite any rando because that’s literally what the invite says. \n\nSo either way YTA OP.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I mean the plus one in the beginning alone could tell you she’s the asshole its not only her wedding I think the husband should be able to invite whoever he wants without needing her permission",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I don’t get this extreme, “it my special day” mentality about weddings. Like, is this new or has it always been this way? Sure, the wedding is MOSTLY about the bride and groom of course, but why invite people if you’re going to give your guests a hard time about stuff that doesn’t really matter? Why spend all that money if it’s not also about your guests having a good time? If even a single attendee was gonna have a crap time at my wedding I’d just save my money and not have one. Like, was op’s perfect wedding worth all this drama and social fallout? Is this situation really better than just letting a random girl hang out? So weird to me lol.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8374,
      "content": "YTA and hopefully a soon-to-be ex wife.",
      "id": 163,
      "comments": [
        {
          "score": 1275,
          "content": "Talk about controlling behaviour from OP. I wish her better luck in her next wedding.",
          "id": 164,
          "comments": [
            {
              "score": 261,
              "content": "She thinks her wedding was Berghain or something. I can assure the OP that people weren't queuing up to get in. The poor woman who was told to leave was probably attending as a favour for her friend who'd travelled across the country after splitting up with his significant other. Imagine the indignity of being told to leave a wedding you were attending as a favour!",
              "id": 165,
              "comments": [
                {
                  "score": 17,
                  "content": "Berghain is a disco, for those who had to look it up.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 10,
                      "content": "More specifically, it's one that people have to queue up for and are routinely turned away from.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Lol exactly. No one cares about your cookie cutter wedding, man, they just want to see their friend and have a good time",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 663,
          "content": "Yo, since it was only her wedding, I wonder if it'll be \"our\" divorce when she's talking about it with other people.",
          "id": 169,
          "comments": [
            {
              "score": 105,
              "content": "Nope, just \"his divorce\", because it's not \\*her\\* fault. /s",
              "id": 170,
              "comments": [
                {
                  "score": 11,
                  "content": "Beat me to it",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "👏🏼",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yeah if this isn’t making him question marrying someone so spiteful & controlling then he’s insane. \nImagine what she will be like when they have kids",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "This sub is so weird, dear God.",
          "id": 174,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7505,
      "content": "YTA\n\nYour husbands childhood friend traveled  for your wedding to celebrate you, days after his long term gf and him broke up. He (understandably) didn’t want to travel alone, or be at a wedding alone where he knew NO ONE.\n\nYou gave him a plus one, and had paid for the ‘head’ already. So he brought his ALLOWED plus one.\n\nThen, you decide to throw her (and by extension him) out of your wedding for NO REASON. \n\nBecause, unless your wedding was like 10 people, and your hate of having a +1 you didn’t know there was more important to you than your husband having his childhood friend there, I don’t understand how him having a date at a wedding where he knew nobody was so offensive to you that you couldn’t bear having her exist in the same space as you.\n\nYou need to offer your husband a massive apology. You also need to call his friend and offer him a massive apology for being such an asshole. If this is how you’re going to act for the rest of your marriage, it’s going to be short-lived.",
      "id": 175,
      "comments": [
        {
          "score": 772,
          "content": "I can only imagine what that poor woman is going to tell her friends when she gets back.\n\nHow was your weekend? Was the wedding fun?\n\n- I got kicked out of it.\n\nWhy, what did you do?\n\n- Nothing, just attended.\n\nWere you not invited?\n\n- I came as my friend's +1\n\nWere they not allowed a +1?\n\n- He was allowed to bring somebody\n\nThen why did they kick you out?\n\n- Because the bride is a total asshole.",
          "id": 176,
          "comments": [
            {
              "score": 115,
              "content": "I imagine her and her friends laughing so hard about this sipping on a glass of wine",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "\"Uh huh, sure Jan. Bride kicked you out for doing nothing\"\n\nIt's so mean, some people won't even believe it.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "If they wanted him to bring the girlfriend why didn't they say her name?",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 588,
          "content": "If I had a million awards - or even just 1 - I’d give them to you. Best response on this post. No judgement. All facts, and quite logical. I hope OP reads it. OP, you’re TA.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "Tell me you’re a narcissist without telling me you’re a narcissist.",
          "id": 181,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Im now realizing she said she hadnt met the ex gf either. So she approved the ex gf she didnt know to be at the wedding, but this friend cant be there? What is the difference?",
          "id": 182,
          "comments": [
            {
              "score": 17,
              "content": "She had met the ex-gf \"a few times\":\n\n> I’ve met him a bunch but only his girlfriend of three years a few times because of the distance.",
              "id": 183,
              "comments": [
                {
                  "score": 11,
                  "content": "Which was also not enough for her and almost didn’t make the invite! Lol the audacity",
                  "id": 184,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Well, her husband *did* beg, after all. She was in a generous mood that day.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "I’m at a loss too! I truly do not understand.",
              "id": 186,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Considering she couldn't handle *one* person she didn't know, you'd think she could empathise with how it would feel to ONLY know one person there.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I feel like OP would have had a problem even if he had turned up alone.",
          "id": 188,
          "comments": [
            {
              "score": 5,
              "content": "I feel like if he and his girlfriend hadn't broken up and showed up together, OP would have found something else to be upset about.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4355,
      "content": "YTA Bridezilla, and you probably won't be married long now that your husband has seen your true colors.",
      "id": 190,
      "comments": [
        {
          "score": 1205,
          "content": ">Bridezilla \n\nThis was clear from the point where her husband had to “beg” her for a plus one for his friend to his own wedding. Op is a narcissistic control freak.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 185,
          "content": "Bridezilla is right. I was reading this and literally saying to myself - WHO DOES THIS. I guess bridezillas thats who. SMH. YTA",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "My thoughts exactly. That second paragraph first sentence I was already thinking “bridezilla”.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3351,
      "content": "YTA - I wonder if your husband doesnt see you as a different person now.",
      "id": 194,
      "comments": [
        {
          "score": 453,
          "content": "He's probably seen this pettiness before.",
          "id": 195,
          "comments": [
            {
              "score": 225,
              "content": "Some people manage to hide the evil until the hook is set in their partners mouth",
              "id": 196,
              "comments": [
                {
                  "score": 19,
                  "content": "Considering he had to beg so his friend can have a plus one as if that’s not also his wedding it’s obvious he just ignored the red flags narcissists aren’t the good actors it’s just the victims gogo eyes blind them",
                  "id": 197,
                  "comments": [
                    {
                      "score": 6,
                      "content": "There are some narcissists who are good actors.  But I think in this case OP's (hopefully soon-to-be-ex) husband just ignored the red flags.  Until now.",
                      "id": 198,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "He’s seen so much pettiness from her he calls her Tom",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 184,
          "content": "He's already regretting his decision!!",
          "id": 200,
          "comments": [
            {
              "score": 18,
              "content": "Isn't there a 90 day money back guarantee?",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "He should.  What kind of self centred person ejects an invited guest from their wedding?  So trashy.",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Probably first time seeing the kind of person she really is",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Let’s hope and pray he does",
          "id": 204,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2277,
      "content": "[deleted]",
      "id": 205,
      "comments": [
        {
          "score": 599,
          "content": "I can’t believe the selfishness.  She even described the wedding as “my” wedding.  OP, it was also your husband’s wedding.  \n\nYTA and your poor husband probably thinks “ WTH did I just marry”",
          "id": 206,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 164,
          "content": "I read this whole thing thinking does she even value her husband? Her husband first had to beg for his childhood friend to get a +1. That should have been a no brainer yes why does her husband have to *beg*. Then she goes on to kick out that plus one knowing that same childhood friend really wanted a +1. Duh of course he was going to leave. Then she sees him leave and doesn’t change her mind knowing how much this meant to her husband? Yikes!",
          "id": 207,
          "comments": [
            {
              "score": 24,
              "content": "I kinda suspect what OP did could be revenge for her husband having the audacity to want to give his friend a +1 despite OP not knowing the friend's ex. And now that he showed up without the ex she used it as an opportunity to get back at her husband.",
              "id": 208,
              "comments": [
                {
                  "score": 10,
                  "content": "Probably. It seemed petty from the start",
                  "id": 209,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 131,
          "content": "The husband must be so embarrassed.  And ashamed that everyone knows he picked so poorly in a wife.  Poor guy.",
          "id": 210,
          "comments": [
            {
              "score": 20,
              "content": "Yeah that is a story that will get AROUND. Yikes!",
              "id": 211,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "It sounds like he’s trying to reach out and profusely apologize but the friend isn’t interested in talking to him. What a nightmare for him",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1677,
      "content": "YTA, so very much:\n\n\\- For not inviting unmarried long -term partners in the first place  (I seriously don't understand why people do that, how rude). \n\n\\- For kicking someone out of the wedding who hadn't done a single thing wrong, and who had actually traveled and paid money to be at your wedding (being a wedding guest isn't cheap)\n\n\\- For completely disregarding your husband and his friendship with his friend in all of this. \n\nI'm curious if the friend gave you a wedding present? If so the least you can do is give it back so he can get a refund.",
      "id": 213,
      "comments": [
        {
          "score": 413,
          "content": "And for prioritizing yourself over everybody else at every turn. We let every single person bring a +1 to our wedding if we didn’t already know their partner (to address to both of them). You know what’s even better than knowing every single person at your wedding? Knowing that every single person is having fun at your wedding. How can you make that happen? You can start by letting them bring *one* freaking person with them. Partner? Great. Long-time friend? Awesome. Neighbor who had nothing else to do that night? Whatever makes the guest happy!",
          "id": 214,
          "comments": [
            {
              "score": 65,
              "content": "As the perpetually single person in my family, I can’t agree with this more. Just because I’m not married doesn’t mean I’m not seeing someone or enjoy being alone at social events. I can handle my own but I find it fascinating that people invite mature adults to weddings without a plus one option. ESPECIALLY one they must travel to!",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Haha at our wedding we had 105 people booked for dinner....the week before a bunch of poeple dropped out (like 6-7 people) for valid reasons. We had already paid for the dinner so we opened it up. My best friend got to bring her 2 children (we'd previously said no children except family to keep numbers down). Also some friends of ours got to bring a guy who had been homeless but they were letting stay in their house for a while (our friend works at a homeless shelter and met him there, dude was trying to get his life together and they were helping him). Anyway the dude had never been to a wedding before and was blown away to be invited. He was the most fun all day. He cried during the vows and lit up the dancefloor all evening. Zero regrets. Best day ever.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "That’s so nice of you :’)",
              "id": 217,
              "comments": [
                {
                  "score": 19,
                  "content": "Thanks! Our priority really was for our guests to be happy. I married my best friend that day; I was going to be happy no matter how the rest of the day turned out!",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "That really confuses me on another of these posts lately. The use of the +1. I always thought that was meant for a single person to bring a date. If it's an established couple you address the invite to both of them. Instead of picking the 'closer friend and making the other one their +1. That's not really a +1 is it? If the host is deciding who they will bring?",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 250,
          "content": "Because obviously unmarried couples are bad luck at a wedding? Smh as a married woman I don't get it either. My friends who are in long term relationships but aren't married are just as committed as my husband and I. We just chose to add some paperwork and throw a kickass party to celebrate it.\n\nMy brother and his wife had this mentality and it blew my mind. They even went as far as not inviting my aunt because she was going through a divorce and they \"didn't want those vibes\" at their wedding.",
          "id": 220,
          "comments": [
            {
              "score": 117,
              "content": "Oh, ouch. Your poor Aunt.",
              "id": 221,
              "comments": [
                {
                  "score": 102,
                  "content": "Yeah I think she was really hurt by it. I tried to talk my brother into changing their minds at the time but he was adamant. Their whole wedding was non stop drama. I was almost uninvited myself a couple of times in the weeks leading up to it.",
                  "id": 222,
                  "comments": [
                    {
                      "score": 98,
                      "content": "I'd uninvite *myself* at that point. No thanks.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I'm hoping the Aunt didn't send a gift.",
                  "id": 224,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Now that I think about it, I'm pretty sure she got them a bridal shower gift and they also had a stag and doe that she and her now ex husband attended and would have spent money at. That made it even worse. She came to all the pre wedding events but then they filed for divorce shortly before invites went out and she got cut.",
                      "id": 225,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "Good point. OP better return his gift or at least reimburse him. Too bad she wont reimburse him for the time and expense for travel. YTA op for ruining your now husbands friendship over something really trivial, and by that point in time, done. Please never have kids, i can only imagine how unbearible you would be to deal with as a teacher.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Yeah the whole plus-one policy here is stingy as hell. I get that weddings are expensive and not everyone can afford to give everyone a plus one, but she didn’t want to let this guy bring his girlfriend of 3 years, especially when he’s traveling in from out of state and wouldn’t know anyone? Super rude. \n\nAlso the arbitrary cutoff that if you’re married for 2 seconds you’re fine but dating for years is insufficient? Even with a small wedding you’re not going to be absolute besties with every single person in attendance.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I gave my sister a +1, and specifically told her she could use it to bring a support person, because she suffers from bad anxiety. \n\nWe let them stay in our house the night of the wedding, because we were staying at a hotel, and the support person threw up in our bed. Still no regrets.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah, I didn't want randos at my wedding either, but that just meant that people who (afaik) were single didn't get plus ones. But I want gonna be RUDE AF and exclude long term partners unless there was a very good reason.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "The first point also weirds me out. I know a bunch of people in commited long-term relationships who simply don‘t want to get married but I think they have just the same right to attend events together",
          "id": 230,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 948,
      "content": "YTA. 100%. I bet you can quote chapter and verse about all kinds of wedding etiquette when it pleases your control freak Bridezilla soul, but you have not the first clue about hosting and hospitality.\n\nYour guest was CORRECT in bringing a date because he had already RSVPd. The guy just went through a breakup of a 3 year serious relationship,  STILL managed to come to his buddy's big day, and scrounged up a date to  politely fulfill his duties as a guest. You were unconscionably RUDE. Ridiculously wrong. And wow, instead of focusing on your man, and letting yourself be happy on your wedding day, you acted like a spoiled toddler having a temper tantrum. Etiquette is the framework for showing our GOOD MANNERS and good manners come from a kind heart and a desire to make others comfortable.  Polar opposite of what you did here.\n\n100 Points from Slytherin.\n\nHope your husband's next wedding is to someone with more kindness, and class. He deserves it.",
      "id": 231,
      "comments": [
        {
          "score": 196,
          "content": "In all fairness slytherins would have known the proper etiquette and not asked anyone to leave sounds more muggle",
          "id": 232,
          "comments": [
            {
              "score": 83,
              "content": "A Slytherin would have seen the 'stranger' as a potential new ally and would have tried recruiting them to the cause.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "As a Slytherin I agree",
              "id": 234,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "As a Hufflepuff who has Slytherin friends, definitely agree.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "None of us would have ever done anything so uncouth.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": ">STILL managed to come to his buddy's big day, and scrounged up a date to politely fulfill his duties as a guest\n\nThis is a really important point. If this is how OP acts when it's a guest she doesn't know, I don't think it's a stretch to assume she bills the friend for his plus one not being there.",
          "id": 237,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}