{
  "post content": "My sister in law wanted to do some family portraits as a Christmas gift to their parents. This was supposed to be to back in October of this year but we had to cancel because my husband couldn’t get off work (he’s a resident physician so he doesn’t get more than 4/5 days off a month — including weekends. He works a ton). \n\nWe also have a newish baby. She’s almost 6 months old and would have only been 3 months at the time and generally cranky all the time so it’s best we pushed it out. \n\nSo my husband found a kind-of free weekend in February (he would work till 3am Friday night and we’d leave Saturday morning) to back to his hometown 3.5 hours away to do these photos. \n\nHe told me about the window and I️ was like okay perfect we can do that, without checking my schedule (I️ know I’m a big a hole for not checking the calendar). When I️ finally did check the calendar last night as I️ was filing in his work schedule to it, I️ noticed that the weekend he mentioned is lunar new year. I’m Chinese and it’s a big deal in my family. It doesn’t help that it changes every year so planning for it is a doozy. And I️ have a baby so forget planning in general. \n\nHe told his sister that there was a weekend in February that might work but didn’t say when but now that I️ know it’s lunar new year I’m torn. My family is definitely going to want us to join for the holiday and I’m happy to go alone and let him go back with his family but the issue is our daughter. Both sides will want her and she will default to coming with me as I’m the food source. \n\nWIBTA if I️ asked my husband to do lunar new year with my family as it is our daughters first new year but in return offer to pay for family photos here where we live on a day off that he has and his family can come to us?\n\n\nEdit: his pediatric ICU schedule came out and he was able to get a golden weekend (both a full Saturday and Sunday off)! So we can make it work! 🥳",
  "id": 1,
  "comments": [
    {
      "score": 10,
      "content": "NAH. Mistakes happen, as long as you own up to it you're not an AH for it.  Reasonable people can work out something else just as long as you give enough time, so make sure this is communicated soon.\n\nIt sounds like the biggest obstacle here isn't you or your side of the family's traditions, it's your husband's schedule. He is the one who really needs to focus effort on this to find something that works for everyone (note: he's also not an AH for this, his work schedule sucks for reasons beyond his control).",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "YTA Show your husband you consider his family important. You told him it would work, it doesn't matter he hasn't told his sister yet. YOU TOLD HIM YES. You are treating his family like an afterthought.  The only way they can have your time is if your family doesn't want it 1st. \n\nYour parents will have to understand that you are married with children and they are no longer the most important people in your life. \n\nHow often does your husband and his family come in second to yours?",
      "id": 3,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "NAH.  It doesn't hurt to ask, especially since a photoshoot is easier to move than an international holiday, and it's already too late to be a Christmas present for this year anyway.  But be prepared for pushback and negotiations.  Hopefully, you can find a solution that works for everyone, but if not, you'd be an AH if you made your husband's family pay for your mistake and unilaterally ruined/canceled the photoshoot (I promise, the baby is most of the reason it's wanted) that you already committed to.",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "Agreed. My husband never gave his sister the exact dates but I️ do feel bad because she’s been looking forward to this.",
          "id": 5,
          "comments": [
            {
              "score": 2,
              "content": "You're only the AH here if you ask, they say no, and you don't accept the answer. Otherwise there's nothing wrong with asking.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA, the specific date wasn’t confirmed.\n\nWith your DH’s schedule and a new baby why are you even agreeing to drive 4 hours for this is the first place? Why can’t she come to you? Or get them done separately and have you all photoshopped together.\n\nThere is no reason for you to miss an important holiday for this.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA - cut yourself some slack, you're a new mum. Personally I think you've got a great alternative but it depends how flexible and laid back his family are. Could you not do the weekend separately?",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "Sadly my family is in a different town so we’d be two hours apart. His family wants like full family portraits so my daughter and I️ would have to be there. \n\nI’m happy to host them at our place and have photos done where we live since it’s a lot easier for my husband to get an afternoon off as opposed to a whole weekend to accommodate travel.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YWBTA. You did agree to the plans. It was a mistake but you did agree. It wouldn't hurt to ask of plans can be shifted to please everyone but you would be the asshole if you made everyone cancel these plans.",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "But that's all she's asking about, is asking to move, not demanding. NTA, but YWBTA if she doesn't accept no for an answe.r",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "You made plans now stick to them.  Everyone else accommodated your family.  You agreed to the plans.  You will just have to explain to your family what happened and that it can’t be helped.\nEdit:  I see that his family have not been told a date for sure so I change to no, just discuss it with all and see if it’s a possibility.",
      "id": 12,
      "comments": [
        {
          "score": 2,
          "content": "She said he told them it might work so nothing was set in stone",
          "id": 13,
          "comments": [
            {
              "score": 1,
              "content": "And she said it would work",
              "id": 14,
              "comments": [
                {
                  "score": 3,
                  "content": "She just said he didn't tell them when. So while she told her husband he didn't tell the sister. So as far as his family knows it is still only a possibility.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Oh.  Sorry I missed that part thank you",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I️ told my husband a date he suggested to go see his family was fine without checking the calendar and now I’m realizing that it’s not fine.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy sister in law wanted to do some family portraits as a Christmas gift to their parents. This was supposed to be to back in October of this year but we had to cancel because my husband couldn’t get off work (he’s a resident physician so he doesn’t get more than 4/5 days off a month — including weekends. He works a ton). \n\nWe also have a newish baby. She’s almost 6 months old and would have only been 3 months at the time and generally cranky all the time so it’s best we pushed it out. \n\nSo my husband found a kind-of free weekend in February (he would work till 3am Friday night and we’d leave Saturday morning) to back to his hometown 3.5 hours away to do these photos. \n\nHe told me about the window and I️ was like okay perfect we can do that, without checking my schedule (I️ know I’m a big a hole for not checking the calendar). When I️ finally did check the calendar last night as I️ was filing in his work schedule to it, I️ noticed that the weekend he mentioned is lunar new year. I’m Chinese and it’s a big deal in my family. It doesn’t help that it changes every year so planning for it is a doozy. And I️ have a baby so forget planning in general. \n\nHe told his sister that there was a weekend in February that might work but didn’t say when but now that I️ know it’s lunar new year I’m torn. My family is definitely going to want us to join for the holiday and I’m happy to go alone and let him go back with his family but the issue is our daughter. Both sides will want her and she will default to coming with me as I’m the food source. \n\nWIBTA if I️ asked my husband to do lunar new year with my family as it is our daughters first new year but in return offer to pay for family photos here where we live on a day off that he has and his family can come to us?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA - You should have checked the calendar. But that being said, you say that your husband told them a weekend in Feb MIGHT work, but he hadn't actually given them a day yet. So they couldn't have actually scheduled anything yet. Also because of your calendar slip up and his work schedule, you're offering to pay for the pics as long as they come to you. I think that's a good compromise, especially with his limited time off that he gets.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    }
  ]
}