{
  "post content": "I’ve (M32) been with my girlfriend (F29) for over a year now. She’s smart, funny, a bit quirky, and has a serious job with a good salary. We have a great time together and generally get along very well. The only thing is her choice in home ‘decor’ is bizarre, to put it frankly, and not something you think a normal, grown adult would be into. \n\nHer apartment is definitely a reflection of herself and interests. Not in the best way though. \n\nMy girlfriend has wall dedicated to animation in one room of her apartment, like Futurama pieces and etchings of some weird triangle guy. Then there’s the wall of framed preserved insects in another room. But not insects like butterflies or moths. Instead she displays tarantulas, beetles, and large stick insects. Her bathroom has a subtle theme of the ocean-pretty common. But instead of starfish or shells, she has a little anglerfish nightlight, a small vampiric squid painting, and then a framed diagram of what apparently is a Goblin Shark right by the toilet. \n\nI would say a majority of her home decor and furnishings are okay. The apartment itself is very modern and sleek. It’s just the random decor and juvenile-ish themes like cartoons, insects, and bizarre ocean creatures, is off putting.\n\nThis is where I might be the AH. I avoid bringing people over to her place, especially people from my job, because of how juvenile it looks. Everyone’s impressed when they see the high rise, but that quickly fades once you enter. The one time I brought a work colleague over they ended up telling me after that they found her insect wall terrifying. I work in finance and appearances and first impressions are important.\n\nMy office will hold casual gatherings where we get together for a few drinks, good food, and we rotate hosts. And this time, it’s my turn. The problem is my place is under some construction and not an ideal place to be right now, so I’ve been staying with my girlfriend. My girlfriend suggested that we host my colleagues here since she has the space and thinks it’ll be fun. I told her I planned on skipping my rotation and seeing if the next person would be okay with hosting early. She kept pressing on why I didn’t want them over here, so I finally said it’s because her home decor is strange and not something a grown woman would have, and also that her insect wall horrified the one colleague that did come over. \n\nMy girlfriend got mad and said at the end of the day, it’s not my space and these things bring her joy. She also said that she is indeed an adult woman, which is exactly why her apartment is decorated in such a manner. \n\nI love my girlfriend, I do. And it’s okay to have different interests. But does an adult really need to decorate with them besides a few things here and there? I mean, my own mother asked if my girlfriend was autistic after she saw the entire apartment for the first time.\n\nSo Reddit, AITA for telling my girlfriend her home decor is the reason I won’t host a work gathering at her place?",
  "id": 1,
  "comments": [
    {
      "score": 42749,
      "content": ">I think her home decor is childish.\n\nI.N.F.O.: What age children usually have preserved tarantulas and vampire squids as home decor?\n\n[edit] Obviously, the question was rhetorical. It's fine if you think her apartment's ambience isn't appropriate for a work event, but YTA for dating someone you don't actually like and then expecting them to dull who they are so your coworkers don't get the vapors. Yeah, I know you say you like her, and I'm sure you like her appearance and her money and her high-status building, but you clearly have nothing but disdain for her personality and interests. She doesn't have to beige herself down to satisfy your weird obsession with appearing \"adult\".",
      "id": 2,
      "comments": [
        {
          "score": 10078,
          "content": "I think those might be expensive decor for children to afford.",
          "id": 3,
          "comments": [
            {
              "score": 5233,
              "content": "Some pieces like that are VERY expensive (source- I collect similar items). They are dating now, but if this bothers OP so much, I don’t think this relationship is going to last. How are they eventually supposed to live in the same space? Is she going to be expected to get rid of everything that brings her joy, stuff that she has collected and curated over the years, just to appease a man that seems to have no personality, and hates that she shows hers off? YTA. Stop making her feel bad for being who she is, or break up with the poor girl. She deserves better.",
              "id": 4,
              "comments": [
                {
                  "score": 2328,
                  "content": "I guarantee you if he does think about living with her, he's expecting her to 'grow up' and get rid of her collections.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1138,
                      "content": "Almost like that guy who tried to throw away his gf's books because she's actually pretty, she can't be into reading.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 44,
                      "content": "Exactly. I used to work in finance and this type of guy and his colleagues are the reason why I left! Boring, pretentious, judgemental and care way too much about what each other think.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I almost had a flatmate once who might have been a lot like OP. We chatted a bit, she seemed nice, i invited her round for a second viewing.\n\nIt was once she thought she was *in* that it became clear she would be a \"everything my way\" kind of person - she didn't like my spooky decor \"no bother, happy to take some of it down\" but you could tell she would want *all* of it down. The flat had two box rooms, my old flatmate and I used one for storage and one for a guest room and she'd initially sounded fine with that as a concept but on the second run it was all \"oh I think we'd need one each\". I'd previously expressed that the heating in the flat was a bit useless so I didn't bother putting it on very often - but she was welcome to as long as she paid more this became \"we'll see how it goes\".\n\nThe kicker though was the room had been advertised for one person or a couple, with the clear statement that if it was a couple although rent would still be split 50/50, all bills would be split 3 ways. She'd not mentioned a guy before but on the second visit was \"oh my boyfriend might want to move in in about 4 months\" - \"no bother, but bills will be split 3 ways\". Her response \"oh why don't we revisit that closer to\".\n\nAbsolutely not, get the fuck out of my house. \n\nShe also had a dog she was claiming lived with her mum and would just be over occasionally but I very much got the impression once the mask started to slip that she was trying to move a dog in without telling me!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "i agree! \n\nbut, my wife is less than enthusiastic about my shadowboxes of skulls and preserved insects. the compromise was the butterflies and art prints are fine in common areas, but my other items are in my office and workshop/studio. i am building a curio cabinet that will be for a collection of skulls which she was excited about as it will allow appreciation while not dominating the decor.\n\non the other hand, my wife and i both appreciate absurdism quite a bit, so we have lots of quirky items everywhere. she's just less into the ageing goth collections ;)",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "This is the most important point, it's hard to admit but some people just don't mesh well, and that's okay. No one should give up on things they like to fit in to a certain \"preference\" or \"idea\"   \n\n\nPlus y'all should stop dating quirky girls if you can't take their quirkyness",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3133,
              "content": "[removed]",
              "id": 11,
              "comments": [
                {
                  "score": 1834,
                  "content": "Bill Cipher (the 'weird triangle') was a terrifying villain as well",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1068,
                      "content": "I'm a little in love with you for both knowing that Bill Cipher was the weird triangle guy and a fabulously terrifying villain. \n\nNow I'm off to Etsy to find some \"weird triangle guy\" decor.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "The fact that he doesn’t even know the “weird triangle” is from Gravity Falls shows how little he thinks of his girlfriend. If there was a whole cartoon wall in my SO’s house, I would def be asking them about it. \n\nYTA, your girlfriend is way cooler than you",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 861,
                  "content": "Good news everyone! Tomorrow you'll all be visiting OP's house, on the planet Mundanium. There you will be greeted with sleek white walls, white curtains, white rugs and white cabinets. Also, you'll need to only come dressed in modern, sleek, \"adult\" clothing, and showing up without this, despite not having a clear definition of what that is, will result in your immediate ejection through the airlock. Have fun!",
                  "id": 15,
                  "comments": [
                    {
                      "score": 260,
                      "content": "Not white decor: beige, ecru, taupe, and eggshell.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Sad beige clothes for sad beige children 😂",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "Questioning my life choices as a 40 year old man now due to op thinking I shouldnt be enjoying Futurama.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1908,
              "content": "[deleted]",
              "id": 19,
              "comments": [
                {
                  "score": 651,
                  "content": "I love the idea of the deep ocean- inspired bathroom! Houses like this are amazing to host gatherings in because of how unique they are.\n\nI thought OP was going to describe a pink-frilly childlike doll-like theme or something. Instead it’s actually something cool",
                  "id": 20,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Same here - from the description, I think I love her decor. \n\nI was imagining he meant something like a giant mirror with a rainbow unicorn painted on it over the fireplace.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "I’m genuinely terrified of the deep ocean but I’m dying to see the bathroom. Her whole house sounds like something I could get lost in. I love seeing people’s weird knick knacks.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "I agree but no need to put down adult doll collectors just to make your point. There’s nothing wrong with collecting dolls and displaying them, in the same way that there’s nothing wrong with OP’s gf’s amazing sounding collection (and apartment)\n\nMy point is that having dolls does not make you childish",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "For another thing, if she's into Futurama and (I'm guessing) Gravity Falls, hell fucking yeah I'm admiring her animation wall! I'm 33 and love those shows!",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I have a cousin with a fish tank in the bathroom floor, the fish are visible in front of your feet when you sit on the toilet, I love it!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I almost have this in one of my rooms. Pastel green with pink accents, Victorian maximalism. With dead bugs framed on the wall, and creepy antique dolls on shelves. Needs more vintage specimen jars and such, but there is time.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Personally, I would attach a night light to the angler fish so I don't have to turn the light on at night in the bathroom",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I have a Steampunk nautical themed bathroom and everyone loves it!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Shiiiiiit, my hubs and son have gifted me taxidermy insects for Mother’s Day and birthday. They know me and agree that those are cool.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 28,
                      "content": "[deleted]",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "My sister gave me a taxidermy butterfly and scorpion for my birthday, and I love them! She knows me so well.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "Yes. Also the triangle guy is totally bill from gravity falls and that indicates to me she has in general excellent taste.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Absolutely.  The fact that he misses this fact tells me she needs a new man.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Best advice.  Stop worrying what other people think. I mean, have you met other people?  They’re awful",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": ">OP's girlfriend's apartment sounds badass tbh.\n\nAH-GREEED. me and mine have a 3d printed space battle of colliding universes happening across our living room ceiling. we both love it and anyone who knows us and loves us loves it too even if it's not their taste. \n\nOP, YTA. move on, she deserves better. if you don't think her stuff is cool, then you're not cool.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My husband has bought me preserved butterflies to add to my collection! OP is an AH.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 20,
                      "content": "[deleted]",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "That was my exact thought at the age of 11, so I taught myself to do taxidermy! This man would hate my house- I’ve got over 15 years worth of animal bits, gothic paintings, haunted dolls and more from floor to ceiling in almost every room 🤣",
              "id": 38,
              "comments": [
                {
                  "score": 12,
                  "content": "I wish I could be your friend! I’ve always wanted a cool study with specimens 😭 I am also a woman.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4633,
          "content": "Tbh, I am terrified of spiders and most insects so I get not wanting to look at this type of decor. But still I don't think any of it is childish and I would not have reacted as op did. OP is very much TA and doesn't sound compatible with their partner at all. You don't have to like all the things she likes, but the way you're crapping over her interests is very disrespectful.",
          "id": 40,
          "comments": [
            {
              "score": 5520,
              "content": "His mom asked him if she was autistic, I guarantee meant insultingly, and he still thinks SHES the problem. I hope he gets dumped.",
              "id": 41,
              "comments": [
                {
                  "score": 7578,
                  "content": "I also hope she leaves him so he can go find his perfect “Live, Love, Laugh” wife to show off to his finance colleagues… -_- YTA, op.\n\nEdit: thanks for the awards, in this economy I hope they were all your free ones!",
                  "id": 42,
                  "comments": [
                    {
                      "score": 4683,
                      "content": "Everyone wants the ManicPixieDreamGirl until they get the ManicPixieDreamGirl, then they want to \"fix\" her.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 348,
                      "content": "Someone with beige everything",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2832,
                  "content": "Even if she is, OP is 100% TA. Adult people are allowed to have interests, whether off-beat or \"childish\", and to have their space reflect those interests! OP even says their GF's flat represents her...\"but not in the best way\"? OP, her decor IS her. OP's GF's flat sounds fucking cool and even though I hate insects I'd like to see the abyss bathroom.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 1155,
                      "content": "I personally hate live creepy crawlies, but that's cos I don't want them on me.\n\nCreepy crawly exhibits of live or dead ones where they're behind glass..... ENDLESSLY FASCINATING!\n\nthey are amazing creatures and deserve to be liked and loved, I just don't want them crawling next to my skin 🤣\n\nHer apartment sounds AMAZING. I'd LOVE to look around it and engage her in conversation 😁",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 608,
                      "content": "Right my 6 yr Olds favorite shark is the Goblin shark. And obviously, OP knows nothing about its history. They world thought it was extinct until one was caught in a deep sea net. It's also called a living fossil as it is the only kind left from its origin family 125 million years ago.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 502,
                      "content": "[removed]",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "If he thinks that's bad, he would hate our apartment. 🤣 Our entire office is Star Wars toys, with a sprinkling of other favorite childhood toys like Strawberry Shortcake. The stuffed animals had to be relocated to the living room because the cat kept stealing them, and the bedroom is where most of my piggy bank collection lives. \"Grown up\" decor is *boring*.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "He would probably shrivel up and die of he saw my house...\n\nMario clock and Mario lamp\n\nA Majora's mask replica\n\nA wall of shelves filled with amiibos\n\n3 curio cabinets packed to the brim with one piece, pokemon, Zelda, yu gi oh, and dragon ball z figures.\n\nHey OP, I'm a mid 30s married woman... And I find it ridiculous that you can be embarrassed by someone's choice of decor. My husband was thrilled that we have the same interests and can decorate accordingly \n\nYTA big time.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This reads to me as OP wanting a version of the \"manic pixie dream girl\" then getting mad when she's got unique interests.",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "This, I'd be f-ing terrified of the tarantulas, so I would be avoiding that as much as possible, but otherwise, if we all had the same design taste, then life would be boring.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1046,
                  "content": "[removed]",
                  "id": 53,
                  "comments": [
                    {
                      "score": 386,
                      "content": "More like the Girlfriend needs to find a soulmate and dump this Willy Loman wannabe.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 141,
                      "content": "This should be top comment. I hope this woman finds someone else as quirky and awesome as she is.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I feel so bad for her and I really hope she dumps him because this relationship doesn’t seem like it’s going to get better",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "But she lives in a sleek, modern high rise, and makes bank. Of course he doesn’t want a live laugh love girl- those he’d  most likely have to spend his own financing money on.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 788,
                  "content": "Yeah that jumped out at me.  Mama’s boy.  Who comes to Reddit to tell us what his mommy thinks of his girlfriend",
                  "id": 58,
                  "comments": [
                    {
                      "score": 815,
                      "content": "All he had to write was he is in finance and I could tell without anything else that he is indeed an asshole.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 452,
                  "content": "Yeah it was already a YTA for me and then I hit the blatant ableism(I have ASD) and it kinda threw me for a loop.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Agreed, OP is just SO mortified that his own mother thinks his gf could * gasp * be autistic. So what if she is? She sounds interesting and cool and OP sounds boring as fuck and ableist to boot. Hope the gf yeets him after this, she can clearly do better than someone who's only interested in impressing his colleagues.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "For real. Even if she was autistic? Why would it be a problem anyway ?",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Financebro acquires theory of mind, realizes girlfriend is full human being with thoughts, tastes and feelings. Runs to mommy in shock. Many such cases.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I'd bet good money that he didn't attempt to defend her after hearing this from his mother, either.",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Agreed. And as the mom of an autistic child, to have someone say something like that as if being autistic means you’re automatically “weird” or have weird interests is incredibly insulting. OP and his mom both need a course in kindness and acceptance. \nJust because you deem her decor childish, and just because ONE coworker found the insect wall terrifying does not mean ALL of your coworkers will. You should be proud of your girlfriend and her accomplishments. You should be proud that she trusts you and your coworkers enough to let you into HER space. You could’ve taken the opportunity to ask her questions about why she’s chosen that decor, why it appeals to her, and what it means to her to have it in her home. And in turn you could have gotten to know her better and gotten a better understanding of the whole person she is. \nYTA for sure. Seems like you like the idea of your girlfriend, or having a girlfriend like her- someone who is kind, smart, quirky and with an awesome job/salary- but you don’t actually like your girlfriend.",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "TIL having hobbies and interests is only for men or autistic people. Us womens must have something WRONG WITH US (I'm an autistic woman and I am so sick of the not like other girls factor being both held against us and called fake when we're called pick mes, and then seen as a bad thing if we're just being ourselves. We literally cannot win)",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 737,
              "content": "I hate this idea that adults need to give up on things they like because it’s not “mature”.  Fuck if I had a shitload of disposable income I would have a Jurassic park jeep, a set of stormtrooper armor, and other geeky things",
              "id": 67,
              "comments": [
                {
                  "score": 34,
                  "content": "I’m working on a set of custom Mandalorian armor, a Legend of Zelda shield, and a Tyranid army. I’m 43.\n\nAs far as I’m concerned, when you stop dreaming is when you start dying.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Real maturity is liking what you like and letting other people like what they like, as long as it isn't harmful to anyone else.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Ha, when I got my wrangler and was looking to repaint it I found a guy on the internet who redid his wrangler like the Jurassic park wrangler, but with Bed-liner material. He also had a storm trooper outfit that he would wear to cons. Your comment reminded me of him.\n\nEdit: Berliner to Bed-liner",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Thing is, I wonder if OP has a \"Man Cave\" with sports stuff in it. Or a collection of model cars. Because that's acceptable to his coworkers, guaranteed. It's not the odd taste in decor. If he had those things in his apartment, I bet you 20 Zoidbergs nothing would have been said. This is about a woman having cool interests and OP is being pressured by his co-workers into misogyny.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I want a Jurassic Park Jeep so badly.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "When I was six I had my tonsils out.   The doctor gave them to me in a jar.  \n\nI wanted to take them for show and tell but my mom told me to take them out to the trash can and throw them away.   *But they're MINE!* I wailed.   And she slapped across the face.   I had to put them in the trash.   I cried for days.    \n\nMy mom thought they were gross and I thought they were cool.    My opinion didn't matter.   \n\nNow I keep as much weird, gross (cool) stuff as I want.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Dude, if I had that kind of available income, I'd buy the Lego models of the Millennium Falcon, Death Star, Battlestar Galactica, Serenity and Nostromo, and a few other collectibles.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I have spare room that I have made into a gaming room, manga collection, anime, and TV series. It has pictures of stuff I have enjoyed since childhood. I probably won't be considered mature by OP standard. Yet I have my own home, car, stable job, stable relationships, investments, and savings. I can afford to take vacations and not get behind, but I guess I'm not mature either. \n\nHis GF clearly deserves better.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 681,
              "content": "You know what? He sound like anti fun-dresses guy or that anto fun-socks lady. Can we stick these people with no taste or sense of fun together so they stop being a nuisance to other people?",
              "id": 76,
              "comments": [
                {
                  "score": 46,
                  "content": "Lots of men really hate women's taste, especially if it's in any way off beat. A ton of them have what I term an absence of taste, meaning they don't like anything, they only dislike things. They want everything to be boring and inoffensive so it just fades into the background. My husband is like this. When women stop caring about what men think they often start doing the things middle aged women are known for, like wearing \"loud\" clothing and jewelry, having \"eccentric\" home decor, etc. They've always enjoyed those things but were put off by men's disapproval, but by middle age they reach the point where they no longer care. Luckily, younger generations care much less about what others think of their style so this trend is fading away, and men like OP really hate it. \n\nI can say from personal experience that many of the things I love will get negative comments from my husband and my uncle (who I live with part time due to his failing health). I've got a black romper covered in skulls that I debuted recently and which was the object of much confusion from both of them. Likewise, a deep blue jumpsuit with gold cheetahs on that I get heaps of compliments on whenever I wear it. My husband came around to that one after about the fifth time someone stopped me in the street to compliment me on it. Luckily in my case both of these men adore and appreciate me, so the comments are not mean spirited and do not dampen my spirit or enjoyment of the things I love, but with men like OP that's not the case. They genuinely want to destroy their partner's enjoyment and crush their spirit until they conform. I hope his girlfriend sees this and finds someone who truly appreciates her, even if they don't understand her (frankly, amazing) taste.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "May I have links to these other two? I am intrigued by the nonsense.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 93,
                      "content": "https://www.reddit.com/r/AmItheAsshole/comments/jrsflx/aita_for_not_liking_how_my_girlfriend_dresses_for/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button \n\nThis is an anti-fun dress one. I don't know the sock one",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "Anti fun-socks guy:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/gsefgv/aita_for_getting_mad_at_my_girlfriend_for_wearing/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I don't remember the anti-fun-socks lady, but I think this might be the anti-fun-dresses guy:\n\n[https://www.reddit.com/r/AmItheAsshole/comments/jrsflx/aita\\_for\\_not\\_liking\\_how\\_my\\_girlfriend\\_dresses\\_for/](https://www.reddit.com/r/AmItheAsshole/comments/jrsflx/aita_for_not_liking_how_my_girlfriend_dresses_for/)\n\nAlso, I think both girlfriends sound amazing and confident in their interests, and should definitely find better partners who will support them as they are, rather than trying to turn them into a beige trophy piece.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "I once overheard someone say that wearing fun socks at work is like taking your phone out at a funeral.\n\nI started wearing fun socks after that day just to piss them off.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 256,
              "content": "I would inform coworkers in advance in case some people are arachnophobic but otherwise it’d be a pretty interesting decor to step foot in.",
              "id": 83,
              "comments": [
                {
                  "score": 10,
                  "content": "I’d appreciate that!",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Hey OP, your girlfriend sounds badass. Shes single now right? Tell her Ill do so many work events at her place",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2296,
          "content": "I stopped reading at “angler fish nightlight” because omg I need one",
          "id": 86,
          "comments": [
            {
              "score": 710,
              "content": "I thought the same, I want my bathroom decorated like op's girlfriend.  Also OP, I'm in love with your girlfriend just based on her decorating style, if she ever becomes available...",
              "id": 87,
              "comments": [
                {
                  "score": 618,
                  "content": "Let’s form a nice orderly line people. The girlfriends about to get flooded with friend requests and date inquires from both genders. Let’s make this as clean and orderly as possible, she’s dealt with enough bullshit dating this bozo.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 51,
                      "content": "This is secretly a date profile incognito.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 42,
                      "content": "Bozo is the word I had in my head. What a lame-o. OP’s girlfriend sounds cool as hell. OP sounds like a tool. I used to have a back bathroom decorated with oddities, and it was definitely not on every tour for every guest, so I *sort of* understand the coworker thing and that’s actually just borderline to me. The “childish” stuff and everything else is garbage.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "She looks like the kind of person you could geek about your favoritr stuff - and maybe learn a thing or two! I would like a friend like that - or any friend who is not mean",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I am already married but op's girlfriend sounds fascinating. I'd offer to help screen these would be Romeo's and Juliet's annoyances from darking her door. \n\nMy credentials include glowing recommendations as best dad ever, proud owner of fossils including a 35 million year old megladon tooth, fantasy art, starwars figures, a corner peice of Hadrian's wall. \n\nMy dog thinks I am ace and my wife says I am being silly. If OPs girlfriend is dating this self pompous ...\nShe definitely needs advice about future entaglments.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 333,
                  "content": "I'm hoping she becomes available this week. She deserves better than OP. He's the immature one.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 11,
                      "content": "It's like he came out of the 50s lmao",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "She will be available, especially if she reads this somehow.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I have a sea monster both fictional and real decor in my bathroom.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 165,
              "content": "Right? BRB, going to Etsy.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "This sounds AWESOME, I want one so bad!",
              "id": 98,
              "comments": [
                {
                  "score": 115,
                  "content": "I have an angler fish book light and it’s the cutest thing ever! OP is genuinely just no fun",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I’m googling them as we speak",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1281,
          "content": "[deleted]",
          "id": 101,
          "comments": [
            {
              "score": 339,
              "content": "And I’m guessing the triangle guy is Bill Cipher from gravity falls",
              "id": 102,
              "comments": [
                {
                  "score": 27,
                  "content": "Oh I thought of pyramid head",
                  "id": 103,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Ooh yeh, that might be more fitting with the other spooky creepy stuff. \n\nNot relevant, but some days I swear I live in silent hill. It’s almost permanently misty in the morning and sometimes you can barely see your hand in front of your face.",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "While I appreciate your good taste, I'm certain it's most likely Bill Cipher, just based on the fact they called him a Triangle Guy and not a Triangle or Pyramid monster/man. Also would fit more alongside Futurama IMO. \n\n\nThat reminds me. I still need to order my Red Pyramid plush from Fangamer. Thanks!",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Funny enough, I saw a Gravity Falls journal for sale of Amazon and I was so tempted to buy it lol! It's been in my wish list for years lol. I also love Futurama (even watched it last night) but I wouldn't exactly use anything as decor.....although I have been known to use Fry's image as GIFs and Memes.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "It's telling that he doesn't know who the character is. It's on your girlfriend's wall, you haven't asked? I get not watching the show if that isn't your thing, but not knowing anything?",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Haha - I was obsessing about this a little - and yes, Bill was who I came up with too.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I was thinking triangle man from They Might Be Giants.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 12,
                      "content": "What's he like? It's not important. Triangle man.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Definitely Bill.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 310,
              "content": "I dunno, I loved it as a kid. As an adult, it's even better.",
              "id": 112,
              "comments": [
                {
                  "score": 145,
                  "content": "My son was about 12 when he started watching it. I ended up watching that, American Dad, and Family Guy with him. My husband would just roll his eyes because he was loyal to Sponge Bob and Gumball. Watching cartoons with your kids is great. I grew up watching Saturday morning cartoons.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 25,
                      "content": "My daughter is 12 and she’s been watching Bob’s Burgers with me for a couple of years. The truly adult stuff goes over her head. What’s fun is when older stuff is playing as background noise now and she looks at me and says “umm, Mom?” when she catches something that she didn’t even a year ago.\n\nI loved Futurama as a kid and did a complete rewatch during the pandemic. Show’s even better now.\n\nAlso, OP Im pushing 40 and have a framed The Little Mermaid print in my hallway- am I too childish for you too? YTA, Dude. The great part of adulthood is that you can decorate your space however you want!",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": ">My husband would just roll his eyes \n\nHol' up.\n\n>because he was loyal to Sponge Bob and Gumball\n\nHaha that's hilarious.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 265,
              "content": "You didn’t decorate your own bedroom with blackjack and hookers when you were a kid?",
              "id": 116,
              "comments": [
                {
                  "score": 18,
                  "content": "I erected a statue of myself belching flames.",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 139,
              "content": "Bite my shiny metal ass!",
              "id": 118,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "The more life experience you have, the better you get it.",
              "id": 119,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1012,
          "content": "Somebody tell entomologists their research is for children.",
          "id": 120,
          "comments": [
            {
              "score": 536,
              "content": "As an entomologist that studies beetles and who thinks deep sea creatures are cool af, I found all of this deeply offensive.",
              "id": 121,
              "comments": [
                {
                  "score": 388,
                  "content": "I'm a marine zoologist who specialises in deep sea creatures and cephalopods. I'm also autistic, so I find all of this deeply offensive also.\n\nAlso, I want her anglerfish night light!",
                  "id": 122,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Right?? Each new decoration described seemed cooler than the last, but the anglerfish nightlight took the cake. If being an “adult” means beige and boring, that’s a hard pass from me 🤷🏻‍♀️",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I'm not a bug scientist, but I think bugs are cool as hell, so I feel that. Imagine thinking insects are for children. They are the most brutal horrifying creatures in the animal kingdom. The stuff of horror.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I'm obsessed with frogs, which my husband finds gross, so naturally he follows frog pages to send me memes of. \n\nI'm offended because my interests were mocked and also because OP made a mockery of supportive and loving partners",
                  "id": 125,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "As the daughter of an entomologist who studies beetles (specifically weevils), I agree with you.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 396,
          "content": "god. i got so lucky to have an amazing, loving and supportive boyfriend who would never do or say that to me.",
          "id": 127,
          "comments": [
            {
              "score": 21,
              "content": "My boyfriend is terrified by most bugs. I also have a bug wall of ones I’ve found and pinned. He even bought a watercolor anatomically correct heart painting for me to hang right next to the door. Plus this post makes me want a deep sea bathroom when I finally get one good enough to decorate and I know he will support that, I mean how could you not love a anglerfish nightlight?!? Like that’s brilliant!",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I, at my big age, make dollhouses. Not to play, that's what my niece is for. But i enjoy creating them. My boyfriend supports me fully and has even helped me put together little wooden furniture kits. For Valentines Day, instead of real flowers, I mentioned lego flowers were a thing, and sure enough he got me some. Our apartment? Decorated to my style, not necessarily his. He supports my crafts, even if it isn't something that would interest him. I hope OPs girlfriend knows these men exist, too.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 178,
          "content": "42",
          "id": 130,
          "comments": [
            {
              "score": 141,
              "content": "And don't forget your towel",
              "id": 131,
              "comments": [
                {
                  "score": 39,
                  "content": "You hoopy frood!",
                  "id": 132,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "It's not a goblin shark, OPs gf has a Babel fish next to the toilet",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "Friggin cool ones I want to be friends with",
          "id": 134,
          "comments": [
            {
              "score": 264,
              "content": "Same!!! I was like..... how can I non-creepily track this woman down,  warn her that her boyfriend is a gaping AH and become best friends with her?",
              "id": 135,
              "comments": [
                {
                  "score": 127,
                  "content": "We got to the framed insects and I'm over here wondering which \"gothic home and garden\" fb group or reddit sub she might be in to share those.....",
                  "id": 136,
                  "comments": [
                    {
                      "score": 13,
                      "content": "There was a chain giftshop in my city that sold those; the store was called Green Earth and they tragically closed a few years ago.\n\nI never ended up getting any framed insects for myself (expensive) but I bought my bff the tarantula and bought my MIL the 3 blue triangle butterflies.\n\nThey also sold stick insects, goliath beetles, scorpions, and they were preserved/displayed sustainably and the proceeds went to a conservation charity. I loved looking at that wall! It was like a natural history museum in the mall.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "What gets me is “my own mother asked if my girlfriend was autistic.” Fuck this guy. I’m autistic and it’s clear from what he’s said that he finds that to be embarrassing/unacceptable. He’s obsessed with his own image, and delusional about what will reflect back on him. God I hope she leaves him.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I guess I'm a child because I vibe with OP's girlfriend. Because I have things like taxidermy, fanart prints, gothic/Halloween decor etc... I've also been married for over a decade and my husband never gives me issues over the things I like. Seen this song and dance before on reddit. One partner doesn't respect the other and wants them to confirm to what they think is \"normal\" you know what usually ends up happening in those posts, the disrespectful partner gets dumped.\n\nOP's girlfriend deserves somebody who respects her as a person and not as an extension of themselves. If OP actually gives a crap about their girlfriend, they need to learn real quick that their attitude needs to go or they'll soon have an ex-girlfriend who's better off without them.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 27364,
      "content": "YTA. So you don't like her interests. You don't have to be judgemental about it. Your one and only experience bringing someone over they were \"terrified\" of the insect display. So this one person and your own distaste has convinced you that everyone would be terrified??\n\nYou don't need to bring your work colleagues over, but if you yourself look down on your gf because of her interests and how she chooses to decorate, maybe you shouldn't be with her.",
      "id": 140,
      "comments": [
        {
          "score": 7573,
          "content": "I agree. YTA she's not childish you just don't like her. She deserves someone more interesting and interested in her rather than shallow appearances and \"finance\"",
          "id": 141,
          "comments": [
            {
              "score": 2884,
              "content": "Honestly, OP sounds like the only childish one here...",
              "id": 142,
              "comments": [
                {
                  "score": 3698,
                  "content": "He sounds vapid and desperate to fit in to a shallow work culture filled with other vapid people. Yet he secretly craves the vitality of a partner who doesn’t give a shit about that world. He’s not an asshole, just a spineless coward.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 1975,
                      "content": "He wants a hot goth gf with none of the work",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 342,
                      "content": "Shit man, I'd rather get called an asshole than a spineless coward.",
                      "id": 145,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 234,
                      "content": "He can be both an asshole and a coward. Most of the time both attributes are displayed in people like this.",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "Right? That sentence alone: \"But does an adult really need to decorate with them besides a few things here and there?\".\n\nHis place probably looks like a set from a Ikea store but even that would be too much decoration for him.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Interesting how the opinion of someone else he's not in a relationship with is so much MORE important than the opinion of the person he is with. It's because he never bothered to get a real adult perspective of his own and so he just borrowed the perspective from other people. \n\nLike his colleagues or his mother. Mimicking their thoughts and opinions to seem like them. Like a child **playing** adult instead of a child who grew into an adult.\n\nI'm so sick of seeing people like OP. They get into a relationship with someone like this GF who is vibrant and alive and let's what they love fly out freely in a glorious defiance of the crap we have been force fed about how to be an adult or mature or happy. Someone who has found their own goddamn happiness instead of eating a pre-packaged version that was peddled as the answer to all problems. Someone who says f*** it to the bland hotel art and the grey walls and all the other pathetic trappings of what someone else told you is *success.*\n\nAnd then comes along this insecure, spineless little man. Of course he's attracted to her, she's happy and alive. It's magnetic, it's magical. But because he's insecure and spineless he wants her to turn it off for \"the right people\". The people he admires/fears/wants to impress. The same people his GF has already ignored the opinions of (which is why she's f****** happy and magnetic and he likes her)\n\nSo they do what they always do. They step down on them. Stop being quirky, stop being happy, stop being so *weird.*\n\nHe loved it. He still loves it. That weirdness, that spark.  much of a coward to end it with someone he doesn't like. That's why he's still here with her. But he fears the \"adults\" more than he loves her. He's a coward. He's a child. So he tells her to stop, stamping his foot in a little tantrum. Because \"what will the others think?\" Because \"my mom doesn't like it.\" \n\nGrow the fuck up and enjoy the happy woman you were first enthralled by. Or grow the fuck up and end it so you can find someone who makes everyone you are obsessed with happy instead. Be a grown man and choose between two rough choices, like a real grown up does.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "We can probably add single to the list soon as well.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 563,
                  "content": "Reminds me of the CS Lewis quote: \"When I became a man, I put away childish things, including the fear of childishness and the desire to be very grown up.\"",
                  "id": 150,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I always adore this quote. Perfect for the situation, too.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "BRB. Writing this on my wall.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 561,
                  "content": "But mommy said it was weird and she’s a grown up!",
                  "id": 153,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I swear it’s like this thread was MADE for me. How common is this?!",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 745,
              "content": "this is the comment. YOU DONT LIKE HER. i wish someone would’ve told my ex that before 4 years went by.",
              "id": 155,
              "comments": [
                {
                  "score": 337,
                  "content": "[deleted]",
                  "id": 156,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Complete side note, but this made me so sad. Even through text, it reads very cavalier and that’s disheartening when people share things so traumatic or damaging nonchalantly. \n\nEnded up doing a (shallow) dive on your post history and you seem to be in a much better place and that makes me happy for you. I hope you have more happy days than not, stranger!",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 51,
                      "content": "I have this theory that guys will ignore stuff they find weird or incompatible in a partner in direct proportion tonhow hot they find her. Except that the lust stage always wears off eventually and that's when they'll start trying to change the stuff they never really liked to begin with.\n\nAs an autistic woman who is maxed out on the weirdness scale and only marginally hot, I have luckily avoided this particular trap. But I see so many cool, amazing women who don't know they're in a relationship like that because they are also really beautiful and they just haven't found out how he really feels about them. It breaks my heart, it really does.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "oof. I wish this wouldn't happen at all, but tbh I'm glad I'm not alone in not having seen the signs earlier lol. Took me ages to understand that if he doesn't like my thoughts, hobbies, jokes and hates the way I talks, he probably doesn't love me like he always claimed he did....came to a screeching halt last week when he demanded I apologised for not shutting up when he told me to. Woke me up real quick lmao",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "i see you sister",
                      "id": 160,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "I hate men like that.\nIt's such a shitty feeling when you notice that they couldn't careless about what you like, think or feel.",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Yup. He doesn’t like her, and most importantly, OP doesn’t know himself. He needs to rely on the opinions of others to form his own, half-baked opinion. YTA",
                  "id": 162,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 372,
              "content": "I was with a person very similar to this. And I’ll tell you what, I’m sure Op’s girlfriend knew as much as I did. There’s always a subtle push to change things about yourself. It starts out small and then becomes very oppressive. \n\nPoint being, you shouldn’t be with someone you feel any desire to change. That’s not a healthy relationship and not how anyone should approach one, like “oh you’re so close to being what I want… except this one thing.. oh and this thing, too…”",
              "id": 163,
              "comments": [
                {
                  "score": 43,
                  "content": "Completely agree! I could have written this. OP is TA because he’s dating someone he doesn’t actually like, not just cause he sounds boring af.\n\nMy ex girlfriend and I used to argue about it because I was always saying “it’s not a failing you just don’t LIKE me very much and that’s okay, but I need someone to like me not just love me” and she couldn’t get what I meant. Like genuinely I’d talk really excitedly about things I cared about, tried to include her so she could see what I was up to, but it was always just why do you do that, why does it take so long, I don’t believe band competitions last that long…oops that last one gives away my interest lol",
                  "id": 164,
                  "comments": [
                    {
                      "score": 12,
                      "content": ">I need someone to like me not just love me”\n\nThat's some real shit",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 348,
              "content": "100%. OP, YTA. You should find someone who is a boring minimalist. I'll date your girlfriend. She sounds amazing.",
              "id": 166,
              "comments": [
                {
                  "score": 40,
                  "content": "I got excited by just reading about it. It sounds cool af.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I was sold at angler fish lights tbh haha",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "She sounds like someone I would LOVE to hang out with.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "I'm glad I don't work in a field where I can't tell my colleagues \"holy shit you have to see my girlfriends vampire squid I'm going to marry her\"",
              "id": 170,
              "comments": [
                {
                  "score": 17,
                  "content": "This is not a field issue, this is definitely an OP issue.\n\nSource: I work in finance and have a ton of unconventional hobbies that I'm definitely not secretive about. It has literally never affected the way anyone sees me because if you do your job well and you're confident about your quirks people don't care half as much as OP thinks they do.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "The shallow appearances part. \n\"Everyone's impressed when they see the high rise\"\n🙄 \nSo she lives in a nice high rise, can afford to decorate her apartment with expensive oddities and he thinks all that is \"childish\". As if. \nI bet OP has bare white walls at home.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Agreed. YTA and so is your mother. It's her place to decorate and why should she bend to some random strangers from your work place.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "He knows he doesn't like her and that he's the asshole, too, because of what he put in his explanation (mod comment):\n\n>The action that should be judged is I told my girlfriend the reason I won’t host work gatherings at her place is because I think her home decor is childish.\n\nPay no attention to the fact that I don't like her, the ACTION THAT SHOULD BE JUDGED is me insulting her decor!!",
              "id": 174,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Agreed, the fact that he brought up his mother wondering if she is autistic kind of just seals the coffin on this. Incredibly abelist. I'll never understand why bland men who have domineering personalities start dating whole ass people with an actual fully formed range of interests, and then try and change them, into being more \"adult\". \nIf the shit someone puts on their walls can so easily spook you, I think we know who really needs to grow up.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1100,
          "content": "Yep agree - why is he with her if he so judgemental about her passion. It’s not my cup of tea, but I would not be embarrassed if my partner loved it.  \n\n‘I work in Finance and first impressions are important’ \n\nOP - if you are so embarrassed by her, why are you with her? Do you see yourself with her life with her in the future? If not  - time to move on as you’re too embarrassed by her passion, and you’re the YTA",
          "id": 176,
          "comments": [
            {
              "score": 612,
              "content": "\"Finance\" like fuck that's a meaningless statement.",
              "id": 177,
              "comments": [
                {
                  "score": 367,
                  "content": "Right? Like I work in finance….you should see how some of my colleagues dress. Hell a supervisor in my department wears fucking *pajama jeans* nearly every day",
                  "id": 178,
                  "comments": [
                    {
                      "score": 159,
                      "content": "Pyjama jeans?! Theoretically, where might one be able to find such an item?",
                      "id": 179,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "I’m a Controller, plus I own an accounting firm “on the side” so I’m firmly in “finance.” I have hot pink hair, wear yoga pants to work every day, have tattoos, and my office and apartment are decked out in profanity and feminist art.  OP is a probably a Baby Finance Bro who is still concerned with appearances. GF sounds rad, and she’ll move on from the beige soon enough.",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 342,
                  "content": "I work in “finance” and my sister and I have a condo filled with Godzilla figurines and other random sci-fi funko pops and what not. We are women in our 50s.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 30,
                      "content": "*licks palms and smooths down his hair with them*\n\nWell hello, ladies",
                      "id": 182,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": "Wanna be friends?",
                      "id": 183,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "Is there a friends position available? I'm goth and work in finance too! Also, Godzilla filled anything is life goals! My fave was the 90s Godzilla :\"3",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "50s woman here. I was an accountant for 20+ years, then changed gears and ended up working in software (focused on a specific finance sector).  \n\n\n>random sci-fi funko pops\n\nI'd love to visit your condo!  I have a bunch of random pops as well, but \"the apple of my eyes\" are the Alien Xenomorph Queen and Ripley in the Powerlifter. \n\nMy children are in their 20s. I gifted my son the HIMYM set (Barney, Ted with Blue French horn and Robin Sparkles) an Ezio Auditore and a few Overwatch pops, and my daughter with some collection pops like Iron Man (several!), Harry Potter characters, and other animation characters.\n\nThey thanked me with a Geralt riding Roach pop for Mother's Day.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 257,
                  "content": "I know. Half my friends, my husband and I are all technically \"in finance\", but not a single one of us has the same job. Sounds like he's a finance admin assistant trying to sound like an investment banker.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 221,
                      "content": "Wanna be crypto bro larping as Patrick Bateman",
                      "id": 187,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "I'm technically in \"finance\".\n\nI'm a UX designer at a finance company.\n\nI have a dead bug collection like OP's girlfriend. Also skulls and a couple of wet specimens.",
                      "id": 188,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 515,
              "content": "Right? \"She has an insect wall. I work in finance. I unironically think she's the lame one.\" \n \nHis coworkers would probably spend the gathering talking to *her* rather than him, unless all the finance people are as boring as he is.",
              "id": 189,
              "comments": [
                {
                  "score": 51,
                  "content": ">unless all the finance people are as boring as he is.\n\nWell they are finance people",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "A lot of these guys are cut from the same milquetoast cloth: golf, trading, and RINO politics is all they know.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 282,
              "content": "Man if I'm going to be dropping a bunch of money on decor why would I drop it on things that are \"visually appealing\" and \"adulty\" instead of things I truly enjoy and bring me happiness to look at? It's your home not a show house",
              "id": 192,
              "comments": [
                {
                  "score": 80,
                  "content": "Your home is YOUR show house. \n\nBecause of her decorating style it likely would or could be featured as a show house just because it is different.",
                  "id": 193,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "I don't think it's necessarily got to be a dichotomy of \"adulty\" vs. enjoyable. \n\nI spend my limited money supporting local artists in a variety of styles that I genuinely enjoy. No one would call my moody but colorful taste juvenile, I bet. However, I also know people who have a similar attitude about supporting artists but prefer to focus on comic book art or concert posters. I don't judge them juvenile for that (and they certainly spend more than I have sometimes — we're not talking about a teen's allowance here).\n\nAnyway, OP = YTA. It's OK to have different tastes. It's not OK to insult your partner.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 141,
              "content": "Right? Things that are childish: judging people based on \"first impressions\" or discounting them because they're \"different\" or quirky. \n\nOP YTA. I hope your gf finds a new partner that loves and appreciates who she is. Sounds like you need to find someone who is more cookie cutter and traditional (I'd say boring and uninteresting but don't want to be childish 🤣).",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 387,
          "content": "Someone said he should find a \"live love laugh\" gf to match him and it's so accurate I can't stop laughing",
          "id": 196,
          "comments": [
            {
              "score": 49,
              "content": "he needs live laugh love and her all beige and white decor to feel like a Real Adult",
              "id": 197,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It's so funny to me because I am so \"live laugh love\" but also so into taxidermy.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 307,
          "content": "Man OP has the coolest girlfriend and is too damn blind to see it. YTA OP. Even if you don't like the things she displays you should give her credit for the way she goes about it, it sounds tasteful, organized and tidy. The clear passion she has for her interests is admirable in a partner for me, I would never be ashamed of that. Clearly she worked very hard to make those rooms her own, I do not see what there is to be ashamed of.",
          "id": 199,
          "comments": [
            {
              "score": 16,
              "content": "YTA.  Girlfriend sounds RAD AF.  And way too cool for this AH.\n\nHow do we contact GF to let her know that she'd be better off without OP?",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "Right? I'm picturing a bunch of uptight adults in suits and belts screaming and knocking over furniture trying to shove their way out the door in order to get back to their safe houses with their \"Blessings\" and \"Grateful\" wall plaques because they saw some dead spiders.",
          "id": 201,
          "comments": [
            {
              "score": 15,
              "content": "I had to laugh here because my wonderfully quirky daughter-in-law specifically put on her shower registry \"No plaques with words, please\". Her family is always trying to fit her into their mold (sort of country chic) and that definitely isn't her!! She's an anime superfan with a minor in goth, and their house reflects that. It's 100% them, and I love it!!",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "Depending on the situation I can kind of understand not wanting to bring work colleagues around - if you work with super-stuffy people who look down on unconventional (interesting) people while you are the new guy at work who’s still trying to get his foot in the door. But if that’s not the case, then it displays a disdain for your partner’s interests and choices and shows you value other people’s opinions of you over her feelings.",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 84,
          "content": "Someone who has a dog phobia would be terrified of having a dog in the house. Just know who you bring over.\n\nIt's not the gf's problem his work colleagues (and he) sound rather square and is putting the blame on her and looking down his nose at her rather than not liking her interests and hobbies.\n\nShe sounds super fun in my book and have had many friends with similar homes and decor (who's parents hate it but then it's not their home, it's hers).\n\nDoesn't sound like OP and her are compatible.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "I have arachnophobia, and even I'm not terrified of preserved displayed tarantulas. Do I like them? No. Would I touch the frame or case that they're in? No. Would I be \"terrified\" of that room? Absolutely not. \nSeriously, how do they handle history museums? \n\n\nTbh her decor sounds awesome, and I *love* the deep sea bathroom concept! OP, please get me in touch with your gf so we can compare home decor notes.",
          "id": 205,
          "comments": [
            {
              "score": 14,
              "content": "Phobias are not one size fits all. I would absolutely be terrified of preserved creepy crawlies on the wall and could not spend time in that space. It's like a physical disgust or revulsion. I 100% could not comfortably exist in a room with bug displays.\n\nHow do I handle history museums? I skip the bug room. \n\n(None of this directly relevant to the OP, who shouldn't shit on his GF's decor. I just felt the need to chime in and defend the coworker with the same phobia as me.)",
              "id": 206,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16296,
      "content": "YTA. Your girlfriend sounds cool.",
      "id": 207,
      "comments": [
        {
          "score": 3836,
          "content": "So much cooler than him!",
          "id": 208,
          "comments": [
            {
              "score": 3156,
              "content": "whats she doing with a finance bro?",
              "id": 209,
              "comments": [
                {
                  "score": 2725,
                  "content": "Having second thoughts?",
                  "id": 210,
                  "comments": [
                    {
                      "score": 320,
                      "content": "Bahahaha—first laugh of the day—thank you!",
                      "id": 211,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 148,
                      "content": "Those second thoughts were probably her first thoughts until this glob of boring somehow convinced her otherwise",
                      "id": 212,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 127,
                  "content": "Don't rope us all in with all this! Just this one dude sucks, most of us a cool - that's why we like Excel sheets and fear daylight.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Excel changes lives",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I deal with lots of money and capitalization rates and all that bullshit every day and I have photos of insects next to my desk. I took them myself and they make me happy. OP is so boring.",
                      "id": 215,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 137,
              "content": "Lmao SO true, she deserves someone who doesn't talk shit about her interests. This guy is being so disrespectful towards her when she's giving him a place to live(yeah it's temporary but she's still providing him a place to sleep for the time being)",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1606,
          "content": "Agreed. \n\nI have paintings of Godzilla and a multitude of what others would consider ‘weird shit’ on my walls. I have insects on my walls too. My father in law actually bought me my last one. He also once gave me a mummified mouse and even made it it’s own sarcophagus. My partner is a complete metal head, we both are, and yet he still helped me paint my front room pink. And despite not being keen on animal print he still went halves with me on a cow print love seat. And despite me not being a fan of transformers, we have transformers figures up on the shelves for him.\n\nThis is one of the many, many reasons I know I married into the right family. They are awesome. I love them dearly.\n\nOh, the triangle character on her wall? I’m guessing that’s Bill from Gravity Falls, which is freaking excellent cartoon! I’m 43 by the way. I’m an -ologist. \n\nYou’re not an arsehole, per se. You’re just maybe not with the right person. Or rather, she isn’t. Or you need a moment of reflection; if you love someone, truly love someone, you accept it all. And you should never, ever be ashamed of what is basically an extension of someone’s personality. Because, that’s basically what is happening here. You’re ashamed of a major part of what your girlfriend is, and you’ve basically just told her that. So, well, actually, yeah, you are a little bit of an arsehole.",
          "id": 217,
          "comments": [
            {
              "score": 154,
              "content": "I was thinking it was Bill too!!",
              "id": 218,
              "comments": [
                {
                  "score": 16,
                  "content": "That's where I got angry-Triangle guy?  He has a name!",
                  "id": 219,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Its obvious there he doesn't even care about her interests!! It makes me mad for her",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "I’ve got a lot of bones in my house. Various skulls, leg bones, a spine, some teeth and a human jawbone. I’ve never had anyone say anything negative about it.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Reality's an illusion, the universe is a hologram, buy gold, bye!",
              "id": 222,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 901,
          "content": "Yeah I don't understand these posts where people are like \"ugh my girlfriend is cool and interesting, I hate it\". OP (YTA) needs to go find himself a \"live laugh love\" soulmate",
          "id": 223,
          "comments": [
            {
              "score": 234,
              "content": "I initially thought this post would be about “live laugh love” style decor. I don’t think I could sleep in the bug wall room, but I’d like to see it.",
              "id": 224,
              "comments": [
                {
                  "score": 54,
                  "content": "I’m pretty sure they’re dead.",
                  "id": 225,
                  "comments": [
                    {
                      "score": 17,
                      "content": "We can't say how much they loved or laughed, but dearly beloved... They did not live.",
                      "id": 226,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 126,
          "content": "My guess is that she'll be single soon.",
          "id": 227,
          "comments": [
            {
              "score": 106,
              "content": "Hoping like real soon. She sounds cool as hell!",
              "id": 228,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Good.  Hopefully then she can find someone more deserving of her than OP.",
              "id": 229,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 117,
          "content": "If he doesn’t want her I’ll take her! Triangle guy? That’s bill cipher! From gravity falls! She’s got taste!",
          "id": 230,
          "comments": [
            {
              "score": 16,
              "content": "I scrolled down to hopefully find comments about Bill!! Gravity Falls is a great show!",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Like legitimately would love to look at the bug wall if I was at a work party.  OP sounds dull as hell.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13487,
      "content": "Yeah, you don't really love her. If you did, you would rejoice in these FANTASTIC examples of her quirkiness. She sounds *great*. \n\nYTA because you're pretending to love this woman but you secretly look down on her and feel superior. \n\nBreak up with her and let her find someone who will cherish her awesomeness.",
      "id": 233,
      "comments": [
        {
          "score": 2484,
          "content": "This, this, this!\n\nHe is being a complete asshole by holding her back from finding someone who adores her. \n\nI know who I'd rather hang out with for an evening. \n\nYTA\n\nAlso, news alert, not all ppl with money are boring, beige, boring ppl. So your dull apartment is not going to impress anyone. Hers will impress ppl.",
          "id": 234,
          "comments": [
            {
              "score": 662,
              "content": "Well, it will impress *some* people (like me and you!). But he might be judging his coworkers accurately. They may indeed be beige and boring.",
              "id": 235,
              "comments": [
                {
                  "score": 439,
                  "content": "He sounds so screamingly insecure. I'm sure some of his co-workers are more interesting.",
                  "id": 236,
                  "comments": [
                    {
                      "score": 216,
                      "content": ">He sounds so screamingly insecure. I'm sure some of his co-workers are more interesting.\n\nMaybe. However, I recently moved into a neighborhood known for lots of finance bros, and will confirm it is about the most boring group of people I've ever had the misfortune to find myself surrounded by. \n\n(Although we've still managed to meet a couple of more interesting ones - they work in sustainable finance or something though.)",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 113,
                  "content": "I'm severely arachnophobic, so I wouldn't set a foot in an apartment with a tarantula (dead or alive), but even I think it's a cool trait of her to decorate her rooms in a creative manner. I would be running outside screaming if I were the coworker, but she's still cool for being herself.",
                  "id": 238,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "Seriously! I am over here thinking about how cool she is and wanting to be her friend. She seems like an absolutely incredibly interesting person who embraces her interest and hobbies. That’s an amazing person to have in their lives.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 262,
          "content": "Dude thinks being an adult means being boring.",
          "id": 240,
          "comments": [
            {
              "score": 52,
              "content": "Well, he's in finance, sooo...",
              "id": 241,
              "comments": [
                {
                  "score": 22,
                  "content": "The whole profession is about being as milquetoast and inoffensive as one can be so as to not alienate prospective clients. Pretty soon it becomes who you are",
                  "id": 242,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Get him a girl with \"live laugh love\" and quotes from the office in her bio.",
                      "id": 243,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "seriously, how can quirky decor be childish when children don’t have money? she has adult money to do whatever she wants, she sounds way cooler than OP",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "You're my main man right there. I identify with basically none of that decor but it sounds so goddamn awesome I'd date that woman and disappoint her greatly. \n\nIt's not about sharing that interest, it's about loving that persons personality that RESULTS in that decor. And OP doesn't seem to like her for herself. If OP did, they'd own that shit so hard, look at my interesting bit of human I can say is interested in me.\n\nDate someone who is not quirky, you don't seem equipped to handle it.",
          "id": 245,
          "comments": [
            {
              "score": 21,
              "content": ">It's not about sharing that interest, it's about loving that persons personality that RESULTS in that decor\n\nPerfectly said.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I have an nautical themed bathroom and WISH I had space for an angler fish nightlight! All I’ve got is a freaking metal fish and some tasteful wall art.",
          "id": 247,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11861,
      "content": "I hate people who gatekeep adulthood. They’re stuffy and boring and have no sense of whimsy. \n\nWhy do people have to give up the stuff they enjoy just because they reach an arbitrary age that makes them an adult? That’s bullshit. Love what you love and celebrate it until the day you die!\n\nAnd the triangle dude is almost certainly Bill Cipher.",
      "id": 248,
      "comments": [
        {
          "score": 2071,
          "content": ">I hate people who gatekeep adulthood.\n\nThis is the most perfect response.\n\nYTA OP.",
          "id": 249,
          "comments": [
            {
              "score": 348,
              "content": "Exactly. YTA OP. \n\nThe GF sounds exactly like the cool person I'd want to hang out with and show the bone cabinet to.",
              "id": 250,
              "comments": [
                {
                  "score": 28,
                  "content": "This woman is what I aspire to be. The place sounds awesome! Specimens everywhere! Ask whereshe got favorites so I can try getting some! \n\nI am a vulture as well, I have several skulls. A portion of them have natural deformities- my coyote was badly bitten by another (holes in the skull, looks like infection) and my red fox is missing a lower canine tooth- it's been like that a long time as the hole is shut, and I reckon something happened when it was young because the sides of the jaw aren't mirrored well. \n\nPlus I'm a diver and love the deep sea..  I wanna see that angler light!",
                  "id": 251,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1800,
          "content": "Imo the irony is that OP seems to have gotten stuck in the teen/ tween \"oh no, I must appear mature\" frame of mind, while imo with being an adult comes a certain amount of \"I like this and I don't care what you think\".",
          "id": 252,
          "comments": [
            {
              "score": 186,
              "content": "Half of learning to truly be an adult for me was UNlearning the hatred for the parts of myself that people didn’t relate to and I buried in my childhood and teens (a lot of the time it was after comments similar to OPs). I could never be with somebody who was embarrassed about the things I do to fulfill my inner child. My fiancé loves that part of me without exception.\n\nI also work in finance. I have toys on my desk and I get excited to talk about childish shit with my coworkers because it reminds them I’m not so serious all the time. I hope she finds somebody who embraces every part of her because YTA OP.\n\nEdited to clarify",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "Other posters are wrong.\n\nTHIS is the best answer.👍",
              "id": 254,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": ">  “When I became a man I put away childish things, including the fear of childishness and the desire to be very grown up.” \n\n-C.S. Lewis\n\nThe pretension in OP's post is disgusting. It's one thing to say, \"Hey, my work life expects a certain kind of decorum and your bug room doesn't fit that. Could we take it down for the event and put it back up after?\"\n\nIt's another to say, \"Hey, your bug room is creepy and bad. Also, animation is for kids.\"\n\nFuturama is for kids? WTF? My 11yo might get to see it soon but my 6yo definitely won't for a while. Its themes are 100% for adults - dealing with purpose in life, real romantic love, destiny and divinity... Same with its jokes - death by sex with giant women, time-traveling incest with your grandmother, \"jacking on\" as a drug metaphor...\n\nOP should do her a favor and leave her so she can find someone more mature.\n\nP.S. [Animation](https://www.youtube.com/watch?v=IeiQUsFvYR4) is [for](https://www.youtube.com/watch?v=Mm3hbLKaYh4) kids? [What](https://www.youtube.com/watch?v=C84PeTqz2AM) modern [animation](https://www.youtube.com/watch?v=_e8ALHji6uU) has [OP](https://youtu.be/_ovJGnjOjx4) seen?",
              "id": 255,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Also, fuck any job that pressures you to be a bland, uninteresting person just to conform. Trying too hard to fit in rather than doing what makes you happy is immature.\n\nYour home doesn't have to look like a generic catalogue just because you have a big boy job. OP is 100% TA.",
              "id": 256,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Being an adult means no longer giving a shit about what other people think.\n\nI'm 32 and at some point threw up my hands and went \"I wanna do all the stuff child mean never could\". I got a bed full of stuffed animals. A closet full of Miss Frizzle dresses. A computer full of video games. And as soon as I can afford it I wanna start collecting Lego projects. \n\nWhy do we talk about all the fun shit we're gonna do when we get older then when we're there we just wanna drink and complain? Fuck that - life is short and often miserable. HAVE FUN.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "And clearly needs his mother's approval still",
              "id": 258,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 459,
          "content": "Yes!! I was sitting in my living room the other day thinking about how much i miss my bedroom when i was a teenager.  Band posters, photos, interesting things...my wall was like a scrapbook of my personality.  Then i had this lightbulb moment where i was like \"I own an entire fucking house!  I could literally do this to every wall in every room\".\n\nYou are so right.  WHY DO WE STOP THIS.  Why is everything on my walls framed and lined up? When did i get this uptight.  It's so stupid!!",
          "id": 259,
          "comments": [
            {
              "score": 73,
              "content": "Go full send! Maximalism for the win!!!!!!",
              "id": 260,
              "comments": [
                {
                  "score": 24,
                  "content": "Yes! I’m planning a gallery wall in my spare room that’s a combination of huge family portraits from like the late 1800s to the 1910s and some cool stills and press photos from old vampire films. Kind of a What We Do in the Shadows vibe. “Juvenile” interest, maybe, but it’ll be pretty and fun and makes me happy, just like OP’s girlfriend’s decor does for her, I’m sure.",
                  "id": 261,
                  "comments": [
                    {
                      "score": 14,
                      "content": "High five idea twin! I dislike portraits but I'm doing a wall of \"creepy\" scientific illustrations heavily inspired by the intro to WWDITS with the bats and all.",
                      "id": 262,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I had the same epiphany recently. aged 49 and I was like why do I have to paint everything neutral colors and pick 'classic' decor? I painted everything the colors I love and am in the process of slowly curating decor that I love. This guy is totally TA",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Im 33 and just recently living alone with no roommate or girlfriend for the first time in my life, and I have framed Misfits and Alkaline Trio posters in my living room and a big ass socialist flag. I decided I don't care if I appear childish cause I kinda am childish",
              "id": 264,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 453,
          "content": "I’m 47 and I love Gravity Falls, I’m a Disney nerd and love K-pop   YTA and furthermore those animations that you think are for kids can sell for hundreds and are not cheap Edit oh wow thank you everyone for all the up  votes 🥰",
          "id": 265,
          "comments": [
            {
              "score": 26,
              "content": "Yeah. I’ve got subtle and not so subtle LOTR decor in almost every room in my house. I’m very much an adult.",
              "id": 266,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "38 year old animator here. I have an original cel from the little mermaid in my home office. Seeing that movie when I was 4 years old was what made me think “i want to do that when I grow up!” I’m an adult now and have lots of cartoon stuff on the walls besides that cel. And a whole attic with my collection of sonic, we bare bears and other cartoon merch!",
              "id": 267,
              "comments": [
                {
                  "score": 11,
                  "content": "I’m a few years older than you and I work in cinema as well. I have lot of cells too: American Dad, Simpsons, family guy, Akira, An American Tail and an Iron Giant, all for the same reasons . \n\nI have a lot of of other kitchy or offensive crap on walls and shelves and don’t give a fuck what others think.  I didn’t have money to buy this kind of stuff when I was young and starting out, so I’m enjoying this now. \n\nI’m glad my wife has the same “childish” and “trash” taste as me. Her office looks like a Sanrio museum. I don’t think we are ever going to  “grow up “ by the way. \n\nI hope the OP girlfriend dumps him and finds another dude with amazing tastes like her’s.",
                  "id": 268,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "My parents are in their 60s and they're hooked on Gravity Falls and Amphibia, my mom can quote scenes from Amphiba she watches it so much",
              "id": 269,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 249,
          "content": "The perk of being an adult IS to decorate HOWEVER YOU WANT! This lady has aced adulthood like no one else! \n\nI constantly have to remind myself that the rules are my rules and I can do whatever in my house when I start thinking like «no I cannot do that». Says WHO? Not me!",
          "id": 270,
          "comments": [
            {
              "score": 17,
              "content": "Every time I make a decor decision, people I talk to about it try to dissuade me. But I’m a grown tax paying woman, and I’ll do what I want. I think my house looks great. And I too have a wall dedicated to movies and cartoons. I even have Lego (the childishness! The horror!)",
              "id": 271,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 193,
          "content": "It’s like toxic masculinity saying people aren’t manly enough. But it’s toxic adulthood. \n\nFinance people are the worst about that too. Their whole life is built on the idea that money is the measure of a person and so they suck. \n\nOPs girlfriend is right to be offended. She clearly is more confident in who she is than OP is.",
          "id": 272,
          "comments": [
            {
              "score": 19,
              "content": "“Toxic adulthood”\n\nI love that term!",
              "id": 273,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "I'm in my 40s and sat in the lounge singing Disney karaoke with my stepdaughter the other day. She's 26 :D Neither of us if ready for the \"adulthood\" OP has in mind!",
          "id": 274,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I want to be OP’s GF’s friend. She sounds rad. \n\nI can look at her insect collection, and I can show her my rock collection then we can compare our Nerd Walls. I love her Deep Sea bathroom, and I’d love to show her my octopus themed kitchen. 😍\n\nOP sounds like a stick in the mud.",
          "id": 275,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4973,
      "content": "YTA - Let's say for a second that her decor could actually cause problem in your work (which I very highly doubt), there are 2 ways to go about it: \n\n1. Say that your collegeaus are a bit pretentions and close-minded, and you don't think they would react positively to decor that's outside of their norm. \n\n&#x200B;\n\n1. Insult her taste and her.\n\n? If this was really just about your collegeaus, you would have gone with the first option. But it's not, is it? The way you talked to her and the way you have written about it show that. The fact of the matter is that *you* don't like her decor and you saw this as an opportunity to show your true opinions about it, by insulting her decor and insulting her.",
      "id": 276,
      "comments": [
        {
          "score": 878,
          "content": "Agree. He probably also thought that by saying this, his gf would make adjustments for his preference. Good on the gf to stand up for herself. I hope she meets someone else that is supportive of her.",
          "id": 277,
          "comments": [
            {
              "score": 73,
              "content": "Yeah, I can guarantee he’s of the mindset that one day when they move in together she’ll be okay getting rid of her things for him.",
              "id": 278,
              "comments": [
                {
                  "score": 63,
                  "content": "[deleted]",
                  "id": 279,
                  "comments": [
                    {
                      "score": 55,
                      "content": "“Everyone’s impressed when they see the high rise…” \n\nYou’re spot on.",
                      "id": 280,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "She’s probably hot and he’s hoping to break her spirit and change her.",
                      "id": 281,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 377,
          "content": "This is the best comment and gets to the heart of it.  I actually don't fault him for not liking her taste and not wanting to host his event at her place; he's just as entitled to his taste and his comfort as she is to hers.  Where he becomes an AH, though, is insulting her and calling her childish over her passions and decor.  He clearly holds her in contempt over this and has been bottling it up for the past year, and couldn't resist blurting out his true feelings in this instance.",
          "id": 282,
          "comments": [
            {
              "score": 24,
              "content": "And then shifting the blame to his coworkers. Truly spineless. Anyone who valued their SO wouldn’t give a shit what their coworkers thought?! And would even step up and stand up against any demeaning comments about their SOS decor. “Yeah my gf is awesome her interests are so varied, it’s a brilliant part of her character that I love” - which clearly wouldn’t be what Mr. Finance would say, thats he’s embarrassed by her her and demeaning her and her decor as childish? 🚩",
              "id": 283,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 333,
          "content": "Yeah, this guy seems embarrassed by her. OP wouldn’t know if people like it, as he admitted he doesn’t even bother after one bad example. Even then “terrified” of her bug wall? Idk all seems super pretentious and judgmental af.",
          "id": 284,
          "comments": [
            {
              "score": 128,
              "content": "I would be terrified of the bug wall to be honest, only because of the spiders. I am very scared of them, always have been. I’m not pretentious. I wouldn’t insult her though! I’d just avoid that room. Other decor sounds cool.",
              "id": 285,
              "comments": [
                {
                  "score": 29,
                  "content": "Thats what i was thinking why do they have to tour her entire house??",
                  "id": 286,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Yeah, why exactly does it matter what kind of lights she has in her bedroom? Are his coworkers planning to spend a lot of time there? What kind of gathering is this, anyway? Lol\n\nETA: Whoops, he was describing her bathroom, and I misread.",
                      "id": 287,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Not to mention it seems like he dated her in the first place because she was well off and has nothing to do with her personality at all.\n\nI get it.  Kind of.  You want to date in the same economic group as you are and as you go up, your options begin to limit more and more.  But she can do without the dead weight.",
              "id": 288,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "This. And the fact that OP threw in that ableist bullshit of implying his GF autistic because she likes weird stuff.",
          "id": 289,
          "comments": [
            {
              "score": 21,
              "content": "That was such a weird thing to add to the post honestly and has truly nothing to do with OPs “problem”, it’s just rude.\n\nAm I autistic and have what OP would consider “weird” decor? Yeah. But does every autistic person have “weird” decor? No. I’ve been to plenty of NT folks home with “weird” decor, it’s just fun to express oneself in their OWN environment where THEY live.",
              "id": 290,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "This is really what it comes down to. There ARE fields and companies where people would judge what their home looks like and it would reflect on their status at work. I’m not saying it’s right, but it is a fact that appearances can be very important in some careers. If that was really the concern that’s all he had to say though. Throwing in the comments about her decor being “strange” and “not what an adult would have” make it clear that the problem is really him not liking her choices, not concern about how his coworkers would perceive it.",
          "id": 291,
          "comments": [
            {
              "score": 29,
              "content": ">This is really what it comes down to. There ARE fields and companies where people would judge what their home looks like and it would reflect on their status at work. \n\nYou're 100% right, which is what some people are missing here. If OP wasn't an AH, he would be blaming the work people, not the girlfriend. \"I can't bring my work colleagues here because their judgemental AHs\" rather than thinking the girlfriend is the problem.",
              "id": 292,
              "comments": [
                {
                  "score": 14,
                  "content": "OP sounds like he fawns over his colleagues' subtle off-white colored, tastefully thick, and  watermarked business card.",
                  "id": 293,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "You're absolutely right. This line:\n\n> But does an adult really need to decorate with them besides a few things here and there?\n\nHe didn't say the things he did to her because he was \"explaining\" to her. He said it because he hoped it would shame her into changing.",
          "id": 294,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3364,
      "content": "[removed]",
      "id": 295,
      "comments": [
        {
          "score": 1221,
          "content": "I scrolled far too far to read this. \n\nI can just hear the sentence clearly \"Even my mom asked if she was autistic\" like seriously wtf?? What would be the problem if she was, and why is having joy in your life a symptom of fucking autism? \n\n\nYTA YTA YTA",
          "id": 296,
          "comments": [
            {
              "score": 162,
              "content": "I hope this woman gets away from this actual child and his family",
              "id": 297,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Also...what if she was? OP, your girlfriend sounds absolutely awesome, interesting, and secure. Everything you are definitely not. YTA",
              "id": 298,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 403,
          "content": "Agreed. I can totally see where OP got his attitude from. Disgusting, both him and his mom.",
          "id": 299,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 186,
          "content": "Apples and trees.",
          "id": 300,
          "comments": [
            {
              "score": 77,
              "content": "Yup this is totally a case of learned ignorance! I cannot wrap my head around how the decor is juvenile. Odd, sure but juvenile? In what way??",
              "id": 301,
              "comments": [
                {
                  "score": 59,
                  "content": "Mostly interesting. \n\nLike fuck man, I like most adults am boring as fuck but the GF sure as shit isn't\n\nThat would be an awesome place to host, it's like a museum",
                  "id": 302,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 171,
          "content": "This was not unnoticed by me. The way he writes it, like autism is something bad and to be looked down upon. And anyone expressing something in any way out of the norm is bad and therefore autistic. Just so messed up. \n\nAnd if she is autistic, so what?",
          "id": 303,
          "comments": [
            {
              "score": 22,
              "content": "Frankly OP is so rigid and tonedeaf to social cues that as a member of the Spectrum myself, I wonder about HIM.  Not every autist is blatant enough to be identified and diagnosed, especially if the parents have a stigma about it.",
              "id": 304,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "too fucking right like yta and so’s your mum",
          "id": 305,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "My thoughts exactly!!  A snob.  Also boring.  \n“I wOrK iN FiNaNce” bullshit type of person.  “Oh look at me and my pretentious little life.  With pretentious little people”.  OP, fuck outta here with this American Psycho aesthetic.  Go find someone else.  YTA btw.",
          "id": 306,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Yea this makes it ten times worse. Can someone get ahold of OPs girlfriend and tell her to fucking run away from this clown of a dude and their mother?",
          "id": 307,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "This has got to be a class thing, this family sounds dead inside, like they're unable to understand that decor might reflect a person's interests, personality, and unique life rather than solely signalling status",
          "id": 308,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This is the part that got to me too. So what if she IS autistic? Is it a death sentence? Or does it just describe her brain?",
          "id": 309,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2830,
      "content": "YTA for insulting her really, why wouldn’t you decorate your home with things you love? That’s one of the best things about having your own place, that you can put whatever you want in it. \n\nBesides, isn’t it a little *juvenile* to bring your classmates from school to your house for snackies and juice? That’s what you sound like, and it’s completely arbitrary.\n\nThe fact is, she’s not a child. She is a grown woman, and that is *her* place. You are the one that needs to grow up.",
      "id": 310,
      "comments": [
        {
          "score": 384,
          "content": "I have rainbows and rocks *everywhere*. I love rainbow because I don't have to pick a favorite color, and rocks have always been my passion. I have other stuff, fun things, witchy things, artwork, etc. But my home is a reflection of me: a little eclectic, a little chaotic, and bright/happy/colorful. \n\nI was with my ex for years, and his idea of decorating was deep, dark colors, no natural light, and basically the opposite of me. I was so happy to be single again so I could have my light and colors back! My hubby likes the bright and I have a pretty free hand with the household decorating.\n\nHonestly, I dgaf what anyone thinks of my decor. They can walk out the same fucking door they walked in through!",
          "id": 311,
          "comments": [
            {
              "score": 17,
              "content": "I have a giant painting of a scene from Blood Meridian in my office. It’s quite graphic if you look at it long enough.  But my brother made it in art school and it’s one of my favorite books from one of my favorite authors. Ain’t nobody making me take it down.",
              "id": 312,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Rainbows! I’m 43 and I love rainbows. My kitchen is a rainbow theme. Idgaf what anyone thinks.",
              "id": 313,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "my husband and i have some similar taste and some opposite, we compromise and meld them together as best we can, and if its something the other seriously dislikes we try our best to compromise on putting it someone they wont mind, or we just dont put it up, because when it comes down to it, we love each other. \n\n&#x200B;\n\nthat being said, someone dark and gloomy and someone bright and colorful are a lot harder to meld together so im glad you found someone more like you interest wise. it makes life happier, and everyone (except certain people) deserve to be happy",
              "id": 314,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": ">why wouldn’t you decorate your home with things you love?\n\nfr, OP is an embodiment of the meme about men living in a space with just a mattress and a TV.",
          "id": 315,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1959,
      "content": "YTA. Your girlfriend sounds rad. If I walked into a coworkers house like that my respect level for them would go WAY up. Just let people be interested in things",
      "id": 316,
      "comments": [
        {
          "score": 329,
          "content": "It's also WAY easier to get to know someone when they are interesting and interested in things.\n\nIf I was hanging out with a coworker and saw that kind of stuff, it would be SOO much easier to launch into conversation.",
          "id": 317,
          "comments": [
            {
              "score": 25,
              "content": "A house that is sanitized of personality is the worst.",
              "id": 318,
              "comments": [
                {
                  "score": 16,
                  "content": "This guy sounds like he gets his relationship ideas from 90s romantic comedies - he wants the \"quirky artistic cool girl manic pixie\" he can smugly brag about dating to his drinking buddies, but also wants her to transform into an Instageneric beige trophybot when he wants to \"impress\" the work crowd. Can't have it both ways, and she can do so much better.",
                  "id": 319,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "For reals. Im a bit similar to OPs gf in the decorating department. My home is filled with framed bugs (also beetles and walking sticks type things, not butterflies) as well as fossils and a huge “science collection” (things like wooly mammoth hair, moon dust, etc). It’s weird. I don’t have cartoons, but I do have the scene in Jurassic park where the man gets eaten on the toilet turned into a watercolor and framed above my toilet. \n\nMy SO loves it. In fact, I’m pretty sure he used his admiration of it as a hint he wanted to move in with me (“what I love about your decorating style, is that it could be anyone’s place. It’s not too feminine, it could be either gender. It’s just interesting stuff.”) \n\nOP sucks.",
          "id": 320,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1607,
      "content": "YTA- also I won’t lie to you, I exclaimed “awesome” when I read about the cartoon wall of futurama and presumably gravity falls and then again about the bugs- you do realise these are her interests? If you don’t like them/ her home decor are you sure this relationship will work in the long run?",
      "id": 321,
      "comments": [
        {
          "score": 401,
          "content": "Oh, but surely she’ll realize she’s being infantile and turn into a responsible adult OP can be proud of? 🙄. OP is definitely TA.",
          "id": 322,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 263,
          "content": "Right? She had me at *angler fish bathroom*.",
          "id": 323,
          "comments": [
            {
              "score": 17,
              "content": "I clutched my angler fish necklace I'm wearing and gasped slightly when I read that part.",
              "id": 324,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I already love her!",
              "id": 325,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "Also the coolest bathroom I've ever heard of",
          "id": 326,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}