{
  "post content": "Throwaway because I have family that use Reddit as well. Next spring, I am getting married to the love of my life. We have decided that we don’t want children at our wedding. Not many of our friends and family have young children, and the ones that do are fine with getting a sitter for the weekend since we gave them a lot of notice. The only ones to put up a fight are my aunt and uncle who have a daughter with autism. She is 20, but will be 21 by the time my wedding day comes around. She is what they call “high-functioning”, which means she can talk and wash/dress herself, and she has some friends. She graduated from high school a couple years ago and is currently living with her parents (my aunt and uncle) while working at a grocery store. Despite her being technically an adult I just don’t see her as such. Every time I talk to her at a family gathering it’s like talking to a child. She is obsessed with toy ponies and barbie dolls, and brings them up at every opportunity. She draws in her notebook constantly and never makes eye contact when talking to me. She does not have loud meltdowns like other special needs kids I’ve met before, but I really don’t want to risk her ruining my special day. I told my aunt and uncle that I didn’t want her there and they became very upset. They said she already saw the invite and knew it was child-free but because she is an “adult”, she thought she was still included. My aunt tried to guilt me by saying she’d already picked out a dress and a gift but I didn’t want to hear it. My fiancé says I’m being an asshole and we should let her attend because she has attended other weddings before with no issue. Everyone is making me feel horrible for not treating her like an adult when she doesn’t act like one. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 38305,
      "content": "YTA. What exactly makes you think she would \"ruin your special day\"?  Simply the fact that she is autistic?!!",
      "id": 2,
      "comments": [
        {
          "score": 17373,
          "content": ">What exactly makes you think she would \"ruin your special day\"?\n\nOh! I know this one! It's ableism.",
          "id": 3,
          "comments": [
            {
              "score": 8233,
              "content": "I thought it was because Op was a mean girl with a mean spirit but ableism works too. (Was trying to joke a bit here. It’s definitely ableism) \n\nOP, get over yourself. Your cousin literally is an adult who like you said doesn’t actually cause disruptions or has sensory issues that makes sitting through events like weddings hard. You have no reason to not invite her other than you not liking her. Idk frankly it sounds like you’re the difficult one in the family.\n\nGo ahead and not invite her. But be warned that blaming your cousin’s autism is abelist and will likely lead to a bunch of family not showing up for your “big day” since they also see you as an AH. But no worries. You sound like you are someone who appreciates “aesthetics” think of it as guest minimalism. Imagine the photos, spaced out and gaps between guests, such a vibe. \n\nOr better yet, maybe your fiancé will get the drift and there won’t be a wedding. He’s already saying you’re the one in the wrong. Wanna bet what will happen if you actually go through with it?",
              "id": 4,
              "comments": [
                {
                  "score": 9074,
                  "content": "[removed]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4437,
                      "content": "What happens if they have an autistic kid? It runs in families since it’s typically tied to some level of genetics. If I was the family of the fiancé I would seriously sit them down and ask if they understood the gravity of what she is implying.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 259,
                      "content": "If i were planning to marry someone and they acted this way (to anyone, but particularly a member of their own family), it would seriously make me see them in a different light. I would probably start thinking about calling off the wedding, tbh.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 208,
                      "content": "I also hope that the fiancé thinks about this in the event that they want children.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 131,
                      "content": "Or god forbid they have a child that’s different.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "Autism runs in family’s so they could have an autistic child. What then? Can’t imagine the damage a mother like this would do to an autistic person",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "I agree! It's like, \"OH NO, the love of my life has developed dementia! Time to drop 'em off at the rat-infested nursing home for someone else to deal with!\"\n\nI could totally see her doing something like that.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "If she has an autistic kid, all hell is breaking loose.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "The username seems relevant. He should throwaway the bride 🤷🏻‍♀️",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "I’m disabled & ableism doesn’t just make me mad because it’s discrimination against me, but because every single abled-bodied person on the plant could become disabled in a second & yet we still get treated like shit.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I hope her fiancé gets the picture of how any child they have who is born with a disability will be treated.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 640,
                  "content": "And the OP wrote how the cousin has attended other weddings before with no issue so what is the OP worried about?",
                  "id": 16,
                  "comments": [
                    {
                      "score": 467,
                      "content": "Aesthetics. I mean I’m a woman who loves an aesthetic event. But I don’t place that above other people. \n\nThis OP clearly does. \n\nAnd I don’t think Op is worried about anything. I think this has everything to not wanting the “undesirables” (to be facetious) at her wedding. \n\n(To be clear just so no one is confused the “undesirables” comment is meant to be sarcastic or facetious. It is not my personal belief but what I think OP’s belief is)",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 316,
                      "content": "Her cousin talking too much about ponies instead of talking about the bride 💁‍♀️",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Fuck aesthetics. Like we are normal looking people with a neurodivergent mind wtf. \n\nIt's a shame that so many people do NOT understand the spectrum. Do I hate loud environments with lots of people? Yes! Do I know how to 'behave' in them? Yes. We ND people are NOT stupid, far from that even the autistic people on the lower spectrum. We feel, we hurt, we experience life, just a little different than our NT counterparts.\n\nWe don't choose to be disruptive and with proper care and guidance we know what NT people expect for social situations, do we sometimes miss the mark? Yeah probably but as long as it's not disruptive to the situation at hand? What gives..\n\nDamn, more so for highly functioning people, just because we got a label doesn't mean we are less then.\n\nSorry this shit always gets me worked up. You are right and OO is an AH",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 854,
              "content": "OMG CAN YOU IMAGINE A GUEST AT YOUR WEDDING AVOIDING EYE CONTACT???? THE ABSOLUTE HORROR!!!!\n\nOP sounds exactly like those people that think people with allergies are faking it for the attention.",
              "id": 20,
              "comments": [
                {
                  "score": 517,
                  "content": "I don't believe in premarital eye contact.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 16,
                      "content": "LMAO",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "🤣🤣😇",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "As an autistic I cackled while reading that🤣",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "It isn’t bordering on discrimination, it is. The reason for the cousin’s exclusion is entirely her autism. OP doesn’t like her autistic traits (no eye contact, “childish” interests) and is excluding her for those traits and for her diagnosis. That’s exactly what discrimination is.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 456,
              "content": "She honestly sounds like a very nice individual, I don't get what could possibly be the problem outside her having autism. Op has given no reasons other than she still plays with dolls....so what? The dolls are hurting anyone",
              "id": 26,
              "comments": [
                {
                  "score": 333,
                  "content": "For real! If I was a guest at this wedding, I’d be playing ponies with this young lady. And I’m a “neurotypical” old lady. \n\nWe’d be having fun playing ponies and doodling.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Agreed! Honestly, that sounds like fun. Plus the dolls or drawing would be a good way to help with any anxiety or other discomfort the cousin has. They're also other ways to communicate. Weddings are boring, I'd rather play with dolls and ponies anyway!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I was worried this was going to be a boring ass wedding with no kids to play with. I usually prefer dinosaurs, but I'll settle for ponies.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My thoughts exactly!\n90's born, Probably Autistic Too, but yeah, we and the elders have way more fun than people these days!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 332,
              "content": "Nothing like an ableist asshole to really start the week.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "But she might talk about ponies without making eye contact!!!! /s For real, OP is definitely the asshole here.",
              "id": 32,
              "comments": [
                {
                  "score": 159,
                  "content": "Fuck I’d love to talk to someone about ponies at a wedding n I’m older than the cousin.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 18,
                      "content": "At least it's something to talk about. Half the people I talk to at weddings it's hard to find anything to talk about that isn't just like... The weather.\n\nI'm not looking for deep philosophical conversations at weddings, but it's tiring talking about how nice or crap the weather is for several hours with whomever you sit down next to.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Invite me to your wedding.  I’ll even put a special Bridal Barbie in my bag to give your cousin and I’ll hang out with her for you.  We’ll eat wedding cake and talk about ponies.  I’m a 68 year old retired lawyer grandma so well over the no kids threshold.  What say?",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "oop, there it is..",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yup. I hope her fiancé has a come to Jesus moment over this and realizes exactly how his fiancée would feel if they have a special needs child themselves, or if he ever becomes disabled. \n\nIf she’s this callous to a cousin she’s known her whole life……\n\nFiancé needs to find someone with a heart before he ties his life, his finances and *his* heart to this heartless woman.\n\nEdit: YTA, OP.",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Crippled chick here. I think it’s ableism, too.\n\nFull disclosure: I didn’t get an invite either.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My adult cousin with Down Syndrome spent my whole reception living it up on the dance floor. I’m so glad he was there. That’s what family is all about.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Because she “tAlKs AbOuT pOnIeS, bArBiEs AnD hAs   a NoTeBoOk ShE dRaWs In!!” THE HORRORS 😱!!",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2281,
          "content": "[removed]",
          "id": 41,
          "comments": [
            {
              "score": 667,
              "content": "As a mother to children with autism I would make it a hard no to attend from me and my children. And I would definitely not send a gift. \n\nHope you cut out the cousins.",
              "id": 42,
              "comments": [
                {
                  "score": 167,
                  "content": "The there with you - don't invite my kid (who sat through a very dull funeral and reception, thank you very much) then don't bother inviting me. \n\nAnd you're not getting a gift.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Mom of an autistic individual here. Not only would we not come, but no one in my entire would family would come: my mom, dad, sister, aunts, uncles...If someone excludes my son, they exclude us all and everyone would know why we weren't there.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I really hope her aunt and uncle cut her off after this. This kind of behavior is disgusting and they need to protect their daughter from OP’s hatred",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Also parent of a child with autism. I’d send a gift but it’s be a card informing them of a donation to a charity for special needs children in their name with a note to never contact me again.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "If someone did this to my son, I would go nuclear and post/text all family members that my autistic child is simply not invited for being autistic. OP is a giant AH.",
                  "id": 47,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Would you even bother with OP in future events if this were the case?",
                  "id": 48,
                  "comments": [
                    {
                      "score": 22,
                      "content": "No. Never. I wouldn’t be mad and I wouldn’t make a big deal of out it. She would simply just be out of my life.",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 211,
              "content": "I am so sorry you have to deal with that. It hurts my heart to think people can be so callous. \n\nAlso, who on earth does the “don’t come, just send a gift” thing? I hope you’re not actually sending them something?.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "good grief. people are asking you for a gift with no invite but they think YOUR behavior is troublesome. what the hell is that about?!",
              "id": 51,
              "comments": [
                {
                  "score": 17,
                  "content": "It would be difficult to resist mailing them a gift wrapped piece of dog turd, the nerve to ask someone that jfc",
                  "id": 52,
                  "comments": [
                    {
                      "score": 9,
                      "content": "i like the way you think.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I hope you don’t send gifts when you’re not invited. That’s so fucking tacky of your cousins.",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "My son is high functioning and went through hell in kindergarten because he loved to talk about space, the planets, and Godzilla. He's always quick to politely correct his teachers too. \n\nOP, YTA, there's nothing wrong with your cousin. My son doesn't make eye contact often but he listens to everything being said around him. Do better OP! What ever happened to treating others the way you would want to be treated?",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "As a mama af asd/adhd children and nuerodiverse myself cut the cousins out of your life! It’s their loss not yours! Don’t send no gifts! People that can’t accept you for who you are absolutely don’t deserve you!",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Hugs to you. I can't invite you to my wedding because it was 30 years ago, but if husband and I ever decide to renew vows, expect an invite from out of left field. And no present- your presence will be gift enough.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "They didn't invite you and expect a gift?? Wow, that's a higher level of assholenes.",
              "id": 58,
              "comments": [
                {
                  "score": 8,
                  "content": "I bet OP asked her cousin for a gift.",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Isn't it great knowing we're hated so much?",
              "id": 60,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Yep, my thoughts exactly. I’m autistic as well, late diagnosed, I’m enraged for the cousin and aunt and uncle.\n\nThis is infantilism to the highest degree. Utterly disgusting and cruel. I can only imagine how devastated their cousin feels. I hope OP listens to the comments and learns and betters themself as a person or else I hope the fiancé is able to get out of their engagement and find someone with more kindness in their heart.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 844,
          "content": "Man, it's your wedding and you can invite whoever you want. However, that does not take away the fact that you are a big Ass Hole. There is very low risk something will happen with her and you can talk to your aunt and uncle to have her watched all time. But taking away from her the opportunity to be with the family in such an important event, is cruel. I am sure she will enjoy it more than the average Joe invited, and she has already suffered enough with her condition for you to be this insensible AH who will take this away from her.\n\nYou know what, I would be on your side if she was one of these special kids that throw tantrums, need to much attention or really don't know what's happening and couldn't care less. But, she is not like that. She surely will be happy to be there with all her loving family, except you, of course, who care so little about her.",
          "id": 62,
          "comments": [
            {
              "score": 580,
              "content": "But what if she talks about dolls and ponies like she does ALL the time? Or what if she draws and IGNORES OP?? I mean.. that would surely ruin the entire wedding right?/s",
              "id": 63,
              "comments": [
                {
                  "score": 546,
                  "content": "I wanna ignore op too",
                  "id": 64,
                  "comments": [
                    {
                      "score": 413,
                      "content": "Yeah, honestly, as someone with autism I would say there's a decent chance she's just not interested in OP.\n\nI'll lean hard into the special interest thing to get people I don't like to fuck off faster because it weirds them out and makes them lose interest.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 276,
                  "content": "What if anyone pays more attention to her than me?  My day, My Day, MY DAY!\n\nOP has the emotional development of a turnip.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 268,
                      "content": "It's the way she wrote \"high functioning\" in speechmarks that put my back up. Can't you just see her standing there saying it, doing air quotes?\n\nOP, speaking as a high functioning autistic person (and look! I can string a sentence together!), YTA. Massively.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 65,
                      "content": "this is completely off topic but thank you for this comment. i've been craving something different for dinner and now i'm gonna make a turnip & potato mash. haven't had one in YEARS and i am excited. haha",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 144,
                  "content": ">she talks about dolls and ponies\n\nSounds more fun than most weddings.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 130,
              "content": "Exactly! And if I were the fiancee of this AH woman I would run as fast, and far away, as possible. Imagine if they ever have a kid with a similar condition. That's what you, as a husband, will expect form her? Really? This heartless person will be in charge to  raise the poor kid. No thanks.",
              "id": 70,
              "comments": [
                {
                  "score": 10,
                  "content": "Exactly how can you fall in love with someone who believes as she does, her ignorance and lack of empathy are huge red flags,  as you say what happens if they have an autistic child.\n\nPerhaps as with a lot of men, her attractive qualities lie in only the physical and nothing more.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "The OP wpnt have her \"special day\" if her fiance dumps her.",
              "id": 72,
              "comments": [
                {
                  "score": 57,
                  "content": "Let's hope the fiance see the light.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Run away, fiance!",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yup, absolutely. I opened this thinking it was about someone who had a history of being rude to other guests, shouting, breaking things, etc where maybe it's worth discussing having a family only small celebration that she can better handle. But no.... OP literally just doesn't want her sitting there quietly because she think she's weird. What an ass.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 582,
          "content": "OP (probably): \"Someone with autism will ruin the aesthetic of my day.\"\n\nOP, YTA.\n\nHaving a child-free wedding has nothing to do with your cousin because she is NOT a child.  What you want is a wedding where no one has any type of disability or cognitive disorder.  You are the ah for: 1) your ableist attitude; 2) prioritizing some image that you have of \"your day\" over peoples' feelings; and 3) not giving a shit about what your fiancé thinks.\n\nEdit: Typo",
          "id": 76,
          "comments": [
            {
              "score": 59,
              "content": "Sometimes the bride can ruin the aesthetic of the day simply because of her character or lack thereof.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Imagine if she'd decided she wanted a 'no wheelchair' wedding. Same thing.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This is an excellent summary. YTA, OP.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 459,
          "content": "YTA your cousin may have trouble with eye contact and childish interests but she sounds like a perfectly polite and reasonable young lady. If she had extreme meltdowns I could understand but you specifically say she doesn’t. You’re being ableist and you should feel guilty.",
          "id": 80,
          "comments": [
            {
              "score": 193,
              "content": "Autistic meltdowns are different than tantrums. They come due to either too much stimulation or not being able to freely express your feelings or have them be invalidated. Nothing to do with tantrums which are usually due to someone throwing a fit because they can't have a toy or something.\n\nAlso there's nothing wrong with being nonverbal? I don't see what being able to speak has to do with any of this? *I'm* at least 50% nonverbal. I'm considered partially nonverbal. Which means I'm verbal in certain situations and not in others. \n\nNonverbal doesn't mean you're sitting in a corner, staring, drooling, and rocking while making weird grunting sounds. It simply means you don't use verbal communication as your primary form of communication. Many autistic people can edge into nonverbal territory when overstimulated. It's like your brain goes 'hey there's too much going on so to process it i'm gonna make it easier by taking away your need to vocally communicate'.\n\nThere are many different ways to communicate if you are nonverbal. If I have to go to an airport or grocery store by myself, I carry a notepad and pen with me. If I need help, I write my question down and show it to a staff member. Perfectly reasonable form of communication.",
              "id": 81,
              "comments": [
                {
                  "score": 41,
                  "content": "Also, if my cousin wanted to come to my wedding and proceeded to sit in the corner staring, drooling, and rocking while making weird grunting sounds I would just be happy that they were there and enjoying themselves. OP is TA for even caring if a person is verbal or not, because they are forgetting that their cousin is still, first and foremost, a person.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Very true",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "Meltdowns aren’t tantrums",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "There's no such thing as childish interests. People are allowed to like things.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 326,
          "content": "Easy... Although the cousin is \"technically an adult\", the OP \"doesn't see her that way.\" It's all about the OP's (heavily skewed and twisted) view of the world. Anyone that doesn't conform to HER definition of some standard is a \"risk.\"\n\nSo, yeah... ableism of the highest order.\n\nYet another bride that has convinced herself that it's \"her\" day and cares more about the wedding than the marriage. Kudos for the finance for calling OP out for being an asshole. Maybe the bride shouldn't be allowed at the wedding since she's \"acting like a child\" with her ignorant view of the world and needing someone to justify her \"feelings\" about what's right and wrong.",
          "id": 86,
          "comments": [
            {
              "score": 19,
              "content": "And all because her Autistic cousin likes ponies and sketching?\n\nLike, holy shit, how dare someone enjoy hobbies OP sees as “childish,” I guess?\n\nDoes OP hate equestrians and artists in general, or just the Autistic ones?\n\nThe only one here who really seems to be at all “childish” is OP herself.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Technically able to take care of herself, have friends etc. SHOCKING.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 299,
          "content": "*gasp* she might ruin her special day by talking quietly to someone about ponies and Barbie, and not look at the bride enough",
          "id": 89,
          "comments": [
            {
              "score": 169,
              "content": "i just commented that bc weddings are so boring i'd be thrilled AF if someone at my table wanted to talk about barbies & ponies. shit, i want to talk about cats & pandas.",
              "id": 90,
              "comments": [
                {
                  "score": 19,
                  "content": "Have you seen the panda video of the mama and baby, and the baby does a HUGE sneeze and it scares the mom? It's fab",
                  "id": 91,
                  "comments": [
                    {
                      "score": 10,
                      "content": "omg. i hadn't seen it but i just googled & found [this, which i'm guessing is the one you're referring to](https://www.youtube.com/watch?v=93hq0YU3Gqk)\n\ngood grief i love these babies so much.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "Right?? I mean if she doesn’t have sensory issues and can handle it, what’s the big deal if she sits and plays with her dolls and draws?? I mean she holds down a job for god sake, it sounds like she can handle a wedding.",
              "id": 93,
              "comments": [
                {
                  "score": 10,
                  "content": "It's been noted earlier that she has attended other weddings with no problems whatsoever.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 293,
          "content": "As a parent of 2 autistic children this post made my blood boil! 100% YAH! If anyone treated my kids this way they'd be immediately cut off. I can not believe the selfish entitlement. She's 20, finished school and holds down a job despite her personal difficulties but you think she'll ruin a wedding because she likes to talk about dolls... grow up. People are not extras in your show you can't just dismiss people who don't fit your ideals. I hope no one comes then you can have a 'perfect wedding' alone.",
          "id": 95,
          "comments": [
            {
              "score": 32,
              "content": "I'm with you. My daughter is 6 and is high functioning ASD. The worst thing mine does is correct terminology and colour code items. \nIf I was the aunt and uncle, with a 20 year old who has managed against all odds to finish school, hold down a stable job and is a functionibg adult in every sense of the word, I would have said, yep no worries unfortunately all 3 of us are unable to attend. \nAnd that would be the end of the relationship.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I hope no one comes, including the fiancé.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I know, that poor young lady literally jumps hurdles every day just to show up and get along at work, has done the same through school and probably has found drawing helps her regulate. I’m a neurospicy introvert I sat with a word search book and a stress ball at my brothers wedding as something to focus on.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I know, this broke my heart for her poor parents, who probably constantly worry that their daughter will be excluded from things, only for it to come from family? And she's so excited, she's already picked out a dress and a gift... what a way to turn a joyous occasion into a sad one for this family. For no good reason. The thing is, everyone will remember this act of unkindness from OP, and whether they still attend or not, the whole event has now been tainted by OP's nasty attitude.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 122,
          "content": "OP literally says that the cousin has been perfectly well behaved at other weddings, so there doesn't seem to be any sort of indication that this could be a concern. OP just doesn't have the same hobbies.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "When I saw “child free” and “autistic” I assumed they were speaking of a ten-year-old who the parents didn’t want to leave behind. No, they’re infantalizing a disabled adult. Definitely op is YTA.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18080,
      "content": "YTA. Your cousin will quietly mind her business and talk to her family members. Its going to be hard having a childfree wedding with your behaviour, though.",
      "id": 102,
      "comments": [
        {
          "score": 4750,
          "content": "Yup, the only child in this story is OP",
          "id": 103,
          "comments": [
            {
              "score": 770,
              "content": "I wish I could upvote this more!\n\nYTA",
              "id": 104,
              "comments": [
                {
                  "score": 18,
                  "content": "I upvoted on your behalf",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 298,
              "content": "That was my thought, she's a high school mean girl who doesn't want her cousin to embarrass her by talking to her friends. I would rather be autistic than a narcissist.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "That's an insult to children. I know plenty of children who are much more kind and empathetic than OP.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Here’s to hoping OP also has a child free marriage…",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Now why would you insult poor kids like that.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1621,
          "content": "If I were OP’s fiancé, I’d honestly be reconsidering the relationship if I realized the person I was about to marry is so ableist and selfish.",
          "id": 110,
          "comments": [
            {
              "score": 653,
              "content": "Can you imagine if she has an autistic child of her own? I wouldn't marry her. I hope she grows a *lot* as a person before she tries for a baby.",
              "id": 111,
              "comments": [
                {
                  "score": 260,
                  "content": "She would be the one to take on the identity of “activist mom,” though.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 179,
                      "content": "But she would only spout autism sp3aks rhetoric and try to find a cure.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 73,
          "content": "Have my last award for this one!",
          "id": 114,
          "comments": [
            {
              "score": 105,
              "content": "I appreciate the awards, but I don't deserve them. Saying the truth was enough for me. Autistic folk deserve the same opportunities as everyone else.",
              "id": 115,
              "comments": [
                {
                  "score": 15,
                  "content": "Thank you for using identity first language!",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "She never refers to her as her cousin. She calls her, \"her aunt and uncle's daughter\". She doesn't view her as a real person, much less an adult.  She's just irritated that she likes My Little Pony and other toys.  She's just looking for an excuse to exclude her. YTA op.",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "This! Please have my last award 👏",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9713,
      "content": "YTA holy shit. \n\n>she’s obsessed with toy ponies and barbie dolls\n\nSo what? Let people like what they like. It’s your wedding and you can invite (or uninvite who you want) but that doesn’t mean you’re not an AH for it",
      "id": 119,
      "comments": [
        {
          "score": 3223,
          "content": "Yep, I am nearly 40, Neuro-typical and I still watch cartoons on the weekends if I am up early enough.\n \nOP is def YTA",
          "id": 120,
          "comments": [
            {
              "score": 636,
              "content": "I love that I can find so many great cartoons on streaming now, including the ones I grew up with.",
              "id": 121,
              "comments": [
                {
                  "score": 259,
                  "content": "Right? I just found Thomas and Friends on Prime thanks to another user’s tip and now I get to relive my early-00s childhood except *better* because I can see the episodes in order instead of whatever happened to be on the VHS tapes I’d check out of the library. Same with Angelina Ballerina, which I found on Tubi (a site that’s free and browser-compatible!)",
                  "id": 122,
                  "comments": [
                    {
                      "score": 183,
                      "content": "THOMAS THE TANK IS ON PRIME?! what the hell? *goes to prime*\n\nThank you so much! My kids were soooo into this when they were little, and now they're all grown. This will help me re-live some memories. \n\nIs The Hungry Caterpillar on there? I'll look. <3",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I watch Batman Beyond the whole way through like once every six months.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 331,
              "content": "I'm 38 and have a stuffed bear that sleeps on my bed with me.  I've had it since the day I was born and it has been by my side every night since then.  There is nothing wrong with liking cartoons or ponies or barbies.  If it makes you happy, when so little in this world can nowadays, don't let anyone try and take that from you!",
              "id": 125,
              "comments": [
                {
                  "score": 230,
                  "content": "I'm a 32 year old man and I sleep with 8 stuffed animals. Gotta be who you are, yknow?",
                  "id": 126,
                  "comments": [
                    {
                      "score": 141,
                      "content": "34m and same bro. They all mean something or represent something, why the hell would I get rid of them?\n\nThe older I get the more I see the absolute sense in statements like \"embrace who you are and you'll be happy and content.\" It's taken years but I no longer hide the fact I'm a massive geek and a softy.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "They're so comforting! I have one that lasted through three sons - I rescued it when the last boy told me he was too old for teddy bears (in such a disgusted voice - he was about 10) and I've still got it, in a soft bag, sitting on my bedside table. \n\nMy youngest is now 32. I hope to have that teddy bear for a long long time, and I'll give it back to him when I feel he'll look after it properly (kidding there! I just don't want to part with it haha).",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 151,
              "content": "Spongebobs been slapping for two decades and I'm in my 30s and still love it",
              "id": 129,
              "comments": [
                {
                  "score": 16,
                  "content": "I’m on the bus with SpongeBob and I’m 61!",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Nautical nonsense is definitely something that I wish",
                  "id": 131,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Aye aye, captain",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "Okay but can I just say kids cartoons are the only thing I like to watch and knit? Like their relaxing, I know it’s going to have a happy ending and they’re just overall pleasant to watch. Plus a lot of them bring back childhood nostalgia for me. It’s very nice.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "I'm 27 and got excited to watch Duck Dodgers before all my kids were awake one weekend (my son does not enjoy that show)",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Ahaha my neighbour's kids visited me the other week, and they were impressed as fuck about my toys - painting-by-numbers, weaving, big PC, colouring pens coming out of my ears, colouring books - you name it. The only thing I didn't have was a sand pit, and I think I need one.\n\nEdit: Oh, and I'm 62. And we also did sewing.",
              "id": 135,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 499,
          "content": "[deleted]",
          "id": 136,
          "comments": [
            {
              "score": 196,
              "content": "The Barbie movie became the highest grossing movie for Warner Brothers ever. It beat out Batman",
              "id": 137,
              "comments": [
                {
                  "score": 37,
                  "content": "It beat Deathly Hallows Part 2. Absolutely unreal.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 8,
                      "content": "WOW!! I hadn’t heard that!",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "This reminds me of when I was in college but visiting my mom on a break. She introduced me to some of her drinking buddies as \"my adult child who still likes horses and cartoons and dress up\" as a way to put me down to seem cooler (or something, I stopped trying to figure her out years ago). At the time I was working at a stable near my college so I could use one of their horses in barrel racing competitions - a sport SHE got me into as a kid. I also made and sold cosplays as pretty lucrative side hustle.\n\nSo I wonder how much of \"but she likes ponies and Barbies\" is actually just an adult having normal hobbies like watching My Little Pony and being hyped about the Barbie movie. Those things are super mainstream right now, I'm sure plenty of the guests at the wedding (neurotypical or not) would be happy to talk about them",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I bet OP is the only one who never been to a Barbie Movie and probably thinks people that went to that movie are weird like her niece 🙄",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "The history of barbie and fashion dolls is also a suuuuper interesting topic to deep dive into! They're little glimpses into the zeitgeist of any era, and collector's pay ridiculous amounts of money to get their hands on pristine-condition vintage dolls.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 178,
          "content": "I'm 40 and Asperger's and I love Pokemon and cartoons but I know how to behave at a public function. I also tend to avoid eye contact and pretend to read too when I'm nervous or don't feel like talking but I'm fully aware of what is going on around me.",
          "id": 143,
          "comments": [
            {
              "score": 30,
              "content": "My middle son is a Pokemon monster - he's always out and about playing it. He doesn't have Asperger's, and he's 35. \n\nYOU do YOU. OP's post is a goddamn downer for people who are reading it and aren't NT. It's really angered me. Even if you DID go to a wedding and had a 'meltdown' who gives a fuck? Seriously? Fuck her.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "And how many neurotypical people play video games?",
              "id": 145,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "My bf is 32 and not on the spectrum and he loves Pokemon and anime.\n\nI think you guys would get along great 😆",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 160,
          "content": "I would 100% rather talk about ponies and dolls than other things I have been stuck listening to at events (stock market, computer technology, celebrities, etc.).",
          "id": 147,
          "comments": [
            {
              "score": 12,
              "content": "Does OP think guests are going to be talking about Proust? It's a fucking wedding, Ponies will be a welcome change,  frankly. A lot of my fortiesish friends could hold court on Ponies for at least an hour and I doubt OP would clock them as ND (ssh, don't tell them,  we are).",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "better to be obsessed with ponies than to be obsessed with yourself. at least ponies are interesting.",
          "id": 149,
          "comments": [
            {
              "score": 11,
              "content": "LMAO That's a very, very good observation. Oh my.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Is OP planning to ban any friends he finds out like collectibles and collect comic books too?",
          "id": 151,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Just to pile on OP. Half the dudes invited to her wedding probably have an unhealthy obsessions to one or more professional sports teams and talk about them constantly. \n\nTalk about a lack of awareness on the part of OP",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Wow, imagine what will happen when OP will learn that adult people collect toys, repaint their faces, dress them, build doll houses, make their own brands of doll food, furniture and pets. Or that someone from her guest list collects Lego, buys Funko Pop Toys? Terrible!",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6051,
      "content": "YTA\n\nYou have posted NO RATIONALE for not wanting her except that she has autism which makes you the AH.  The idea of no child wedding is for behavior issues, and at times to reduce the number of guests.  Your own post shows she has no issue with behavior and no mention that you are looking to save money.  You try to make yourself look like the non AH by saying she does not act like an adult, but your only evidence is she likes drawing in her notebook, and she doesn't make eye contact with you.  The only risk in ruing your special day would be the guests finding out how cold you are and how unloving of a family member with a disability.   You definitely are coming across as a bride/groom zilla.",
      "id": 154,
      "comments": [
        {
          "score": 1694,
          "content": "I'd  rather have the niece attend instead of my drunk uncle who's  embarrassing  at every family party...or the cousin  who suddenly proposes to his fiance on the dance  floor.\n\nYTA",
          "id": 155,
          "comments": [
            {
              "score": 709,
              "content": "I'm with you here. \nI'd rather sit and hear all about Barbie dolls and cute ponies for hours than listen to the typical \"did you hear what my neighbour did?\" Gossip or political debates. Or the funny uncles who aren't actually funny. \nYeah. Barbie debate team would be my table.",
              "id": 156,
              "comments": [
                {
                  "score": 342,
                  "content": "I would spend a solid half hour discussing a crossover event where Twilight Sparkle visits Barbieland. I AM ALL OVER THAT.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 141,
                      "content": "Wait, that's a thing?\nSee, this is why i need the Barbie table. I want to join the fun talks!",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I found a burned cd entitled “pony soundtrack” and wondered if our car would last long enough for when my kid  passes her kewl teen phase so we can pop that cd back in and sing along to twilight again",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 139,
                  "content": "I would play Barbies and draw with her while wearing my wedding gown. Sounds like fun , actually.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Photos would be adorable too.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "It doesn't even sound like she plays with toys, but rather that Barbie is just one of her special interests. So she has an encyclopedic level of barbie knowledge she likes to whip out? So what! I'd rather listen to the particulars of Barbie's 1985 release season than listen to some guy named Brad break down this year's stocks or hear about yet another of my cousin's MLM ventures.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "This!\n\nThe drunk uncle who gropes aka sexually assaults someone; the drunk aunt who verbally assaults the bride.\n\nMemories I'll sadly never forget.",
              "id": 163,
              "comments": [
                {
                  "score": 15,
                  "content": "The drunk cousin who kept staring at and saying how beautiful my 9yo (at the time) daughter was. I had to watch him like a hawk to make sure he didn't try anything. 🤢\n\nEdit to add, he was in his 30s",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Dude - preaching to the choir. My drunk uncle mixed Jameson and Vicodin and punched me in the face appropos of nothing at our last family gathering.  I'll gladly sit next to the aunt uncle and amazing cousin and talk Barbies and ponies all day long -  to distract from the fact that I'm obligated to attend the wedding of this selfish YTA OP.  I want to be there to see how the groom won't show up/calls the wedding off mid ceremony - live and in person.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yep. My sister in law punched my mother in law at my wedding. It's amazing how alcohol turns adults into children. I would have loved OPs cousin as a guest.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 85,
          "content": ">You definitely are coming across as a bride/groom zilla.\n\nYou are being way too kind, as OP's attitude likely goes way beyond the wedding.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "As an autistic person, this kind of attitude towards autism was (and still is) one of the most frustrating parts. The attitude of “She’s rude and childish.”\n\nMy entire life has felt like sacrificing my comfort for other people. I’m deliberate about the way I move and speak in efforts to make myself more tolerable for others. Something makes me uncomfortable? Well, it’s fine for everyone else, so just shut up and deal with it. I’m sensitive, or over-dramatic, or attention-seeking, or all of the above. And it’s funny, because I can’t remember the last time a NT person gave me the same effort to bridge the invisible “language barrier” that feels like it’s there. But here I am, staring in-between people’s eyes despite the way it feels so that they don’t think I’m being rude *to them.* They have the gall to get upset or assume I’m being mean when I’m putting effort into *every presentable aspect about myself* so that they don’t think that way. \n\nSeriously. The eye contact comment pissed me off. You are not any more or less important because an autistic person doesn’t look into your eyes while speaking to you. It’s not about that person at all, it’s about *our* comfort.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5272,
      "content": "YTA. If she's not prone to meltdowns, I fail to see how she'd put your special day at risk. Also, as a person with ASD, I find it absolutely hilarious that you describe \"high functioning\" as \"can talk, wash/dress herself, and has some friends\". Like.... my god lololol the infantilization and ableism is indeed present here.",
      "id": 169,
      "comments": [
        {
          "score": 1453,
          "content": "Right? Like what category am I in for having a degree and a high paying job with ASD? Lawl. I bet the cousin is probably fine and not at all childish but OP is one of those people who expects adults to only have Proper Adult Interests vs the cousin’s special interests.",
          "id": 170,
          "comments": [
            {
              "score": 664,
              "content": "I feel bad for how... aggressive my comment is BUT my fiance; my life, my love, my eternity, is autistic, as well as my very beloved sister, mom, best friends... hell, I'm probably autistic, I check out wayyy too many symptoms... and HOLY SHIT. This whole thing makes me unbelievably angry. Even a 'low-functioning' (ugh) autistic person is worthy of being allowed to attend important family events??? Fuck, man.",
              "id": 171,
              "comments": [
                {
                  "score": 175,
                  "content": "If your sister, mom, fiance, and friends all are, it's highly likely you are, too! At the very least, you'd be subclinical. Honestly, finding an autistic or AuDHD fiance is the dream for me because that's the only way he will understand me. haha",
                  "id": 172,
                  "comments": [
                    {
                      "score": 169,
                      "content": "Lmao the running joke my fiancé and I have is wtf are we going to do if we have a neurotypical child - we won’t know what to do with it. Both of us are autistic and have ADHD. Obviously we would not put our child up for adoption, but we joke that we would have to because how could we possibly deal with the challenges of a neurotypical child and their special needs.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 119,
                  "content": "The phrase \"this makes my blood boil\" is so accurate for that woman! I just can't even get my head around the mental gymnastics she's doing to try she exclude her autistic cousin.\n\nShe likes ponies? And barbie?? And drawing??? CALL THE ADULT POLICE IMMEDIATELY!\n\nI mean come the hell on.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I like all the same things as the cousin and I’m in my 40s and not autistic. (Not neurotypical either, though, I do have ADHD!)",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I like xiaolin showdown, DC comics, and transformers. I will talk endlessly about it if you let me. I guess I'm not mature enough to be an adult.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Meanwhile the bachelorette party is Barbie themed. She goes on a horseback ride on the honeymoon.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I work with autistic kids (and recently discovered that I’m likely autistic myself), and I can’t even begin to explain how mad this post makes me. Honestly I wish this was a troll post because I don’t want to believe that people like OP exist.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 176,
              "content": "Adult? But my dungeons and dragons playing husband with a job and kid is not.",
              "id": 179,
              "comments": [
                {
                  "score": 76,
                  "content": "I still collect Hot Wheels and Matchbox cars. Well damn, may as well give up on these last four credits of my MS degree cause I’m not an adult according to OP.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 19,
                      "content": "One of the big differences between being an adult and being a kid is that I finally understand why they groaned about the price of Legos and video games. So expensive ☠️",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "[deleted]",
                      "id": 182,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 163,
              "content": "I have 3 degrees and a good job, what am I?\n\nI also have obsessions with things (not ponies, but to each their own), and I struggle so much with eye contact that I spend most meetings reminding myself to look at the other person that I lose track of the discussion.\n\nBut I'd go to the wedding just to throw a tantrum if I were OP cousin",
              "id": 183,
              "comments": [
                {
                  "score": 82,
                  "content": "Eye contact is really hard. I have a job where I have client meetings all day, and I've got a routine down for making eye contact with each client for like 1-2 seconds at a time each, at least every 10 minutes or so. It's probably still woefully insufficient and one of my coworkers did call me \"robotic\" but no one has guessed that I'm autistic or outright complained about me being weird, so I guess it's working well enough.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Unsolicited advice warning: \n\nIf you are at least 5 feet away, you can usually get away with looking anywhere on their face (mouth works well if you have auditory processing issues). You can also look at a point behind them - not over their shoulder but like you pretend their head is invisible. Break eye contact every few seconds for a few seconds - longer if you have an excuse. \n\nI also recommend “taking notes” when people talk. Good excuse not to look at them. \n\nIf you are closer, I have had good luck with looking at an eyebrow. \n\nBest of luck! Hope that helps?",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I'm not even autistic (do have a lot of sensory issues though...) and eye contact is hard! Am I staring them down too much? Should I look away? Where should I look? Can I look at their shoulder?",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "When I was being assessed for ASD it came out that at some point I learned that I can look at people’s mouths instead of eyes and I’ve been doing that successfully ever since. They feel like I look them in the eye. Score! \n\nAlso I’m another one who’d be excluded from this wedding. High functioning ASD and ADHD, well paying job and a host of obsessions I will not shut up about when you give me the floor. But when there’s loads of new people (like a wedding) I’d just sit in the corner or ding the few people I know and stick to them.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "I dub thee *astronomicaly functioning ASD*.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 184,
          "content": "Yeah, as a person with ASD who is a college grad with a great career, relatively standard hobbies, a wonderful wife, and a pretty normal social life, I rolled my eyes so hard at that.",
          "id": 189,
          "comments": [
            {
              "score": 16,
              "content": "What about the ponies and Barbies? /s",
              "id": 190,
              "comments": [
                {
                  "score": 15,
                  "content": "NGL, I’ve been deep into the Barbie soundtrack lately 😂",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 164,
          "content": "She can do everything that other typical 20 year olds can, but *gasp* SHE LIKES PONIES AND BARBIES!\n\nThe horror! (sarcasm, ALL the sarcasm)",
          "id": 192,
          "comments": [
            {
              "score": 14,
              "content": "Hell, there’s an obsessive Barbie collectors community and I’m guessing the majority of them aren’t on the spectrum. They’re still adults, OP is just an ableist asshole. For fuck’s sake, I could not marry someone with such a cruel heart.",
              "id": 193,
              "comments": [
                {
                  "score": 9,
                  "content": "There’s a group of obsessive collectors for just about everything these days, so I don’t even see it as that unusual anymore!\n\nHonestly, if I were OP’s fiancé I would be hitting the brakes hard on this wedding and rethinking the whole relationship because the ableism is so blatant and nasty.",
                  "id": 194,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "For real.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": ">Also, as a person with ASD, I find it absolutely hilarious that you describe \"high functioning\" as \"can talk, wash/dress herself, and has some friends\".\n\nSame here. I consider (and I do this because I am high functioning) high functioning as you can't really tell the person has a form of autism. I didn't realise the bar for it was whether they can take a shit and put socks on by themselves lol.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Even if there's a meltdown she can always leave. One little scene doesn't ruin anyone's wedding, unless that scene is husband realizing he's about to marry an ableist, self-centered asshole.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "She’s embarrassed that her cousin is autistic. That’s the start and end of it. She’s not “normal” and OP doesn’t like people who don’t conform. I mean what if she *gasp* doesn’t make eye contact with someone! The day will be RUINED!",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Also idk, even if she were prone to meltdowns, I’d still want the people I love there for “my special day”. That’s part of who they are, it doesn’t ruin anything. \n\nBut i guess the difference is a normal person would love their autistic relative and she clearly doesn’t…",
          "id": 199,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Lol I’m high functioning and have lived alone since 17, am in university, have a job, have maintained long term romantic and sexual relationships, etc. \n\nAlthough, it’s funny how any job I’ve mentioned autism to has fired me almost immediately for “performance issues” that only seemed to magically arise since my disclosure, and that magically have no paper trail and have NEVER been brought up until the day before the probation is over. Curious how that works. \n\nPeople truly, truly hate high functioning autistics. Even when we pose no problem, when we ask for nothing, even when they’d never know if we didn’t tell.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "IKR??  I can't wear certain clothes, listen to certain sounds, or eat certain foods without climbing out of my skin.  I have trouble modulating the tone of my voice, and eye contact is incredibly painful.  I also have a driver's license, two jobs, and three teenage kids.  Autism is not a point on a slider bar and OP is being really shitty (because she's TA).",
          "id": 201,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4497,
      "content": "YTA!\n\n| **she has attended other weddings before with no issue**\n\nThis, you yourself are stating she has gone to other weddings without any issues arising so you are just being mean without a logical reason.\n\nEven your fiance is telling YTA... isn't that enough for you to realize you are being one???",
      "id": 202,
      "comments": [
        {
          "score": 719,
          "content": "Yes but those weren't *her* wedding and *her* special day, can't you tell that OP is the main character here??",
          "id": 203,
          "comments": [
            {
              "score": 347,
              "content": "head act whistle cows capable nail nine dinner plate spoon\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "id": 204,
              "comments": [
                {
                  "score": 26,
                  "content": "It’s a special day to SHARE with your guests and family. Op has hurt her cousin and cousins parents terribly by infantilizing her.",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Lmfao this is valid. Particularly when it follows the word “ruin.”",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Might as well say \"I don't want her there because she's weird and I don't like her, but I'm going to pretend it's her fault so I'm going to blame her autism.\" \n\nOver and over saying \"She doesn't have tantrums\" \"she's able to have sustained employment\" \"she doesn't have meltdowns\" \"she's behaved well at other events of the exact same nature\". OP has literally no reason to exclude this girl other than her having \"immature\" fixations. If her fixations were makeup and fashion do you think OP would give a singular fuck?\n\nShe just said point blank \"an adult that likes things I don't think adults should like is not actually an adult\" like she's literally gatekeeping adulthood. God forbid someone like something \"childish\". No gushers anyone, OP said you lose your adulthood card and can't sit at the big kid's table if you have any.",
          "id": 207,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Yup! I have a cousin who has ASD. He doesn’t do well with parties and weddings so they make alternate arrangements for him (he didn’t attend his brother’s wedding because he was struggling at the time and it was just too much). \n\nBut if she has gone to other weddings without issues, I don’t see why there would be a problem.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2499,
      "content": "YTA .\n\nLow support needing autistic here, and I gotta say, I would be crushed to find out my cousin held me and my interests in such contempt. She doesn’t make scenes, so what’s the problem?\n\nAlso, putting ‘adult’ in quotation just shows further that you see people with different interests that fall under the autism umbrella as children. Just say you’re ableist and be done with it.\n\n(Edited to replace the words high functioning with low support needing)",
      "id": 209,
      "comments": [
        {
          "score": 580,
          "content": "I'm right there with you- I have ASD myself, and the way OP talks about her cousin makes me sick to my stomach. The baseless discrimination is strong with this one.",
          "id": 210,
          "comments": [
            {
              "score": 241,
              "content": "Agreed. Reading this made me sad. The poor woman is just existing, and OP hates her for it. I hope this post somehow makes its way to her family.",
              "id": 211,
              "comments": [
                {
                  "score": 31,
                  "content": "The amount of people who hate disabled people just for existing is staggering & unless you’re disabled, you’ll never have any true idea about it.",
                  "id": 212,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Absolutely. Someone can even study disabilities and be considered an expert, but they'll never be able to have the perspective of someone who's lived it.",
                      "id": 213,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I hope this post makes it not only to her family, but also her in-laws and her friends and I hope every single one of them makes her feel ashamed about it.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "It's one of those you know people THINK but it never gets easier seeing it when they say the quiet part out loud.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yes. OP is being hateful. They're going to ruin their entire life if they don't change.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This is why I won't tell anyone at work I'm autistic. I mask well enough that no one would ever guess so why the fuck should it ever be a problem, but I'm never telling a coworker because I'm sure that sooner or later my career will suffer for it. Ableism is everywhere.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I don’t have ASD and I can relate to the cousin in interests and hobbies. I collect anime figures, play video games, doodle to pass time, watch cartoons, and don’t make eye contact as well as I should, especially if I feel uncomfortable with a person. By OPs standards, im also a child and shouldn’t be graced with an invite to her oh so special wedding.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "YTA if i was a guest at a wedding and found this out i wouldn’t go.",
          "id": 219,
          "comments": [
            {
              "score": 10,
              "content": "Nor would I ...OR I would go, but do like the SIL recently who had other friends wear white and all get toasters.",
              "id": 220,
              "comments": [
                {
                  "score": 9,
                  "content": "And lets be real alot of people would love to talk about my little ponies at a wedding! I know i would and i’m 41 years old not autistic",
                  "id": 221,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 193,
          "content": "Every single high functioning autistic I know is more intelligent and mature than this “adult”. I",
          "id": 222,
          "comments": [
            {
              "score": 20,
              "content": "Just letting you know because it seems like to genuinely aren’t aware, there’s a movement away from functioning labels as they can be harmful (and lead to discrimination like OP here) and focusing more on the level of support one requires. Someone previously known to be “high functioning” would now be considered as having “low support needs”",
              "id": 223,
              "comments": [
                {
                  "score": 10,
                  "content": "Good point, I’ll edit my original reply to put low support needing in place of high functioning",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "THIS. THANK YOU. 👏👏👏",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "Treating her not only as a child, but a *bomb* that could just go off at any time. Just because OP doesn’t understand her and doesn’t feel comfortable if they can’t predict her. God help OP’s children if any of them turn out neurodivergent, schizophrenic, etc.  \n\nSuper YTA.",
          "id": 226,
          "comments": [
            {
              "score": 139,
              "content": "Seriously- this poor woman has a high school diploma, a job out in society, friends that enjoy her company, and parents who clearly care enough to go to bat to her. OP’s own fiancé agrees that she should go!\n\nBut nooooo, because despite having no history of meltdowns, particularly at weddings, OP says she shouldn’t go because, lemme check my notes here…she likes pony toys and doesn’t always make eye contact.\n\nIf OP doesn’t wake up and change her mind, I hope cousin returns her gift and uses the money to get some awesome new ponies and Barbies instead!",
              "id": 227,
              "comments": [
                {
                  "score": 24,
                  "content": "Honesty this woman (the autistic cousin, not OP) sounds delightful and I’d love to chat with her at a wedding about her interests.",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 98,
          "content": "Also autistic here, I would never speak to my cousins again if any of them did this.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I am a 30yo autistic \"female\" - Genderfluid\n\nI've read through some of the comments and nobody that I've read has mentioned this. \n\nWhile some kids and adults with autism  CAN have developmental delays mentally or be considered intellectually delayed, (an \"adult child\" or said to be \"mental age is younger than physical age), it doesn't always equal that they are not the age that they are. \n\nStill, many NTs infantilize many ND folks, see us as \"less-than\" or less intelligent because of bias, ableism, toxicity, narcissism etc etc etc",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I go to Disney parks every year or two and have no kids. My office is full of Minnie ears.  I must not be an adult.  But I am sure as hell more fun. \n\nGuessing OP didn't have a fun girls night wearing pink to see the barbie movie.  Debbie downer",
          "id": 231,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1990,
      "content": ">Everyone is making me feel horrible for not treating her like an adult when she doesn’t act like one.\n\nI guess you think your behaviour is mature... excluding someone because they like toy ponies and don't make eye contact is pretty damn immature. \n\nYTA. Maybe your invitation should have read *no kids or people with disabilities*.",
      "id": 232,
      "comments": [
        {
          "score": 562,
          "content": "I think your last sentence hits the nail on the head. The cousin might like childish things but she’s graduated high school and is holding down a job ! And OP herself says that she doesn’t have outbursts etc and has been to other weddings with no issues. OP just doesn’t want her there because an autistic girl doesn’t fit OP’s idea of perfection for HeR SPeCiaL DaY. \n\n\nYou are a real C word Op. YTA\n\nEditing to say that I def do not think stickers and coloring books are childish as I am in my 30s and collect both lol",
          "id": 233,
          "comments": [
            {
              "score": 279,
              "content": "Hell, I'm a neurotypical 30 year old, and I like \"childish\" things. Stickers are fun as fuck. Stuffed animals are cute. People would be a lot happier if they'd embrace their inner child.",
              "id": 234,
              "comments": [
                {
                  "score": 200,
                  "content": "I'm in my 50s. At my last conference, we were given MR. SKETCH SCENTED MARKERS to use. You know absolutely ALL of us were sniffing those delightful treats while discussing high-level budget stuff.",
                  "id": 235,
                  "comments": [
                    {
                      "score": 37,
                      "content": "This gives me joy. There is hope for society.",
                      "id": 236,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "As you should.",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "One time my dad was at a conference and literally asked the guys around him for their Mr. Sketch markers to bring home to me and my bro ❤",
                      "id": 238,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": ">Everyone is making me feel horrible...\n\nI love the lack of self awareness here. You're feeling horrible because you're BEING horrible, Babe. The call is coming from INSIDE THE HOUSE.",
          "id": 239,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1120,
      "content": "[deleted]",
      "id": 240,
      "comments": [
        {
          "score": 401,
          "content": "Fiancé needs to think about this marriage. A lot.",
          "id": 241,
          "comments": [
            {
              "score": 171,
              "content": "He does need to rethink marrying her. He seems to have the sense to understand she's the a****** but he doesn't seem to have the sense to understand that's not the type of person you want to marry",
              "id": 242,
              "comments": [
                {
                  "score": 26,
                  "content": "Im not sure he truly understood the extent of OPs stance until now and seems hopeful she can be reasoned with. Poor bastard",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "But you know it will be different once they’re married. That fixes stuff.",
                  "id": 244,
                  "comments": [
                    {
                      "score": 9,
                      "content": "and if it doesn't, they can always have a kid or two! /s",
                      "id": 245,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 947,
      "content": "YTA. She is a functioning adult. Wow.",
      "id": 246,
      "comments": [
        {
          "score": 414,
          "content": "The cousin anyway. OP, not so much.",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 161,
          "content": "\"She's twenty, and graduated HS a few years ago.\"\n\nSoooo, on time?\nThat was such a weird jab.\n\n\"She lives with her parents, and works at a grocery store\".\nUhhhhh, she's fucking 20. There's nothing wrong with that anyway, but she's fucking 20 in an incredibly brutal economy. A lot of people living with mom and dad these days who are much older than her.",
          "id": 248,
          "comments": [
            {
              "score": 46,
              "content": "I thought this post was going to be about someone that is non-functioning that is prone to breakdowns and sensory overload. That I would understand.\n\nI have to believe this is rage-bait. OP is way too on the nose with things that put them *obviously* in the wrong.",
              "id": 249,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "They are acting like autistic people can’t be human smh",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "But not, like, an adulty-adult, you know? The kind that bore you senseless with politics and mortgage rates. /s\n\nFor real, the last wedding I attended (other than my own) my husband and 2 friends spent an hour discussing Dungeons and Dragons while I happily listened in. We’re all educated with good jobs, but I guess we should be sitting at the child’s table with our childlike interests?",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Big YTA to OP. This is hard to read 😬",
          "id": 252,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "op’s fiancé needs to reevaluate his wedding plans with this child.",
          "id": 253,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}