{
  "post content": "Firstly sorry this is on mobile and throwaway.\n\nI (F32) emigrated to my husband’s (39) home country 5 years ago and we have a beautiful son who is 3. \n\nMy mother (52) has always been controlling and frankly is a typical narcissist. She was dead against my moving and was even more upset when I had my son as a combination of her husband being terminally ill and the pandemic she wasn’t able to meet my son until this week and she has complained bitterly how we “cheated” her out of her special time with her first grandson. \n\nI wasn’t exactly excited about her coming to visit us but my husband convinced me we should try to let our son have a relationship with her. Well from the moment she arrived she complained - our house is too small, the garden is over looked etc. She complained my son doesn’t speak much english and so she can’t communicate with him. She complained that my son didn’t want to hug her, that he wanted to stay with his paternal grandmother.\n\nMy son spilt a drink and she shouted at him. We are taking the gentle approach so I told her not to do that and why and she lost it telling me I have no idea how to raise a kid. I told her she needs to respect my methods or she can leave. She stopped but the whole rest of the day you could tell she was furious.\n\nThat night my son was having one of those nights where he just isn’t going to sleep through. My poor husband also had an IBS flare up in the early hours and we realised we had no medication.\n\nWhen my son settled at around 7:30am I decided to do a quick run to the 24hour pharmacy to get some medication. Leaving son and husband both asleep on the sofa.\n\nI was gone for 20mins but when I came back my mother’s rental car was gone and so was my son while my husband was still asleep. He was as shocked as I was they had gone.\n\nTried my mother’s mobile but no answer. After 45mins of me becoming increasingly hysterical I called the police who came out very fast and when I explained as above took things seriously.\n\n6hours later my mother pulled back up and started telling the police (most adults know english here) that I had told her she could take my son out for the day, I am currently 6 months pregnant and she said it must be pregnancy brain which the police seemed to accept and acted like the matter was closed since my son was home safely and showing everyone the toys he been bought. \n\nI told my mother to leave and that I never want to see her again. She started telling family I kicked her out for no reason and she can’t find a hotel and they blew up my phone to which I told them she had kidnapped my son and I am going to pursue this with the police.\n\nNow I am being called an a-hole for saying my son was kidnapped when he was “just taken on a day trip by his loving grandmother” and that a accusation like this could affect my mother’s job as a nurse.\n\nEdit - lots of people saying my husband shouldn’t have pushed for this meeting. You are right but I don’t think he was wrong. He didn’t force me to agree to it, I ultimately had the final say. \n\nAnd I get it he is (we are) lucky his parents are amazing so despite knowing my mother isn’t great he didn’t want our son to miss out. We expected some snide comments and awkwardness but were ready to ignore that for our son. Since my mother’s normal weapon of choice is nasty comments he wouldn’t understand so if we kept smiling he wouldn’t know.\n\nI feel grief that my son is going “miss out” on having another grandmother but she made her bed.\n\nEdit 2 (holy s**t is this real life) So she is now trying to change the narrative to “I did not kidnap your son but also if you think your husband could just sleep through an abduction then your marriage is a sham/how could you be so reckless to leave your child with him@\n\nI can not even with this.\n\n\nUpdate (of sorts) thank you everyone for the support. It seems maybe I got a bit lost in my translation (emotional and the police spoke native language and very fast with strong accents) the case isn’t exactly dropped. \n\nThey have spoken to my mother and basically told her not to approach the house or they will consider it a threat/harassment and will act while they “continue investigating” but they feel her leaving the country tomorrow is enough of a resolution (apparently she has shown ticket info).\n\nI am still getting a lot of grief from family saying I should understand my mother is struggling after her husband died and so on….this again is making me question my reaction but I can’t forgive this. \n\nI will reach out relative embassies but I feel like nothing will happen. \n\nMy partners family are being amazing and looking after us all.",
  "id": 1,
  "comments": [
    {
      "score": 22654,
      "content": "Kidnapping is taking a child out of the custody of their legal guardian without permission or justification.\n\nThat’s literally the definition of what your mother did.  *By definition*, she kidnapped your child.   There are, like, a lot of laws against that.  \n\nAnd it should affect her work as a nurse.   There are rules about nurses not being kidnappers *for a reason*.   They have to be able to be trusted with people who are vulnerable, and kidnappers are by definition untrustworthy.",
      "id": 2,
      "comments": [
        {
          "score": 8995,
          "content": "Thank you. I knew she wasn’t the most trustworthy person….but this is off the charts",
          "id": 3,
          "comments": [
            {
              "score": 3834,
              "content": "NTA. I would have lost it. She left your home with your child. She neither asked permission or left a note. Your poor son probably does not know her and was traumatized. She can’t find a hotel? Her problem. Her actions are the reason you banished her from your home. Tell the people who are calling you instead of calling you to bi^%h their time is better suited trying to find her a hotel room or Airbnb.",
              "id": 4,
              "comments": [
                {
                  "score": 1223,
                  "content": "Traumatized is right! It sounded like she treated him like shit before that. It must have felt like being taken by a monster.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 234,
                      "content": "Likely not the first time, op must have other examples of abuse.  My head would come off if anyone did that to me.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 964,
                  "content": "She also didn’t answer her phone all day!!!!! Literally crazy!!!!",
                  "id": 7,
                  "comments": [
                    {
                      "score": 869,
                      "content": "This. Even assuming it was an innocent day trip not making sure you keep in contact with the mother is inexcusable. She wanted the kid to herself and unilaterally took him. NTA at all, OP, and congratulations on your bright shiny spine.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 315,
                      "content": "Exactly.  That puts the lie to her story.  If she took the son legitimately with permission, what possible reason could she have to not answer her phone all day?\n\nOP, did your Mom have a carseat for your son?  That would put the lie to her \"mommy brain\" claim if you want to pursue the kidnapping issue with the police.  If you gave her permission to take your son, why wouldn't you have moved the carseat so he would be safe?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 268,
                      "content": "Proof she knew what she did was wrong.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "That's what bothers me. If it was so innocent than why didn't she answer her phone????",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "Right I would have been terrified that she flew back home... WITH MY SON. OMG I can't even imagine the terror she went through for what did she say 6 hours. I would have lost my mind on her.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "What if he was on medication he needed and got very sick because Granny so selfish?",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 274,
                  "content": "The son probably also doesn't realize the grandma is trying to \"buy\" his affection.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 246,
                      "content": "He’s three. Pretty easy to buy affection from a three year old.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 249,
                  "content": "The best part is that she was unreachable! Who the fuck takes someone else's kid and goes NC",
                  "id": 16,
                  "comments": [
                    {
                      "score": 135,
                      "content": "I had a tenant do that. Her son had another little boy spend the night. They had not seen each other recently but the boy came to visit his grandparents. So the next day he went to pick up his grandson and they were gone. The apartment was beyond trashed worse than hoarders and they left the door unlocked. \n\nOf course the grandfather panicked. I didn’t know she was moving either. So I spent half the day trying to track her down until I finally found her. Most people didn’t have cell phones yet. \n\nThe grandfather felt just horrible that he let his grandson stay there. I really didn’t blame him because what happened was crazy. The only thing he could have done better was look inside. But they were friends in the past so that didn’t occur to him. \n\nAs a mom I can’t imagine letting your child have a sleepover and move. 🤦‍♀️",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "A malignant narcissist who is trying to punish the parents for setting boundaries and not putting up with her bullshit. That's who.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "I had that happen when one of my adopteddaughter's bio family members took her to \"church\" (she was 17) and then disappeared. Both she and my daughter were blocking my calls. Not funny.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "A kidnapper.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 202,
                  "content": "I also wonder if she had a car seat for him. I'm guessing not since it was probably in OP's car.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 43,
                      "content": "OP said it was a rental.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "That was my first thought too!!",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 68,
                  "content": "Or a flight home",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "“I would have lost it.” -THIS\nI was thinking that my mom would have been thankful the police were there when she came back HOURS later with my kid. I’d of likely tried to do some real damage to her.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Years ago my mom took my newborn and my car (for the carseat) to run some errands and get food while I slept. She left me a big note on my door about how she didn't want to wake me up. You don't just leave without letting someone know",
                  "id": 26,
                  "comments": [
                    {
                      "score": 3,
                      "content": "EXACTLY!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 478,
              "content": "Ask yourself; would you inform your husband if you left the house with your child? If your answer is yes then you can be sure that it is the norm. \n\nShe could have texted you, left a note. I mean once she got home she saw how upset you were, at that moment her \"motherly\" instincts should have kicked in and she should have done everything in her power for your well-being. Even if you had \"pregnancy brain\"...",
              "id": 28,
              "comments": [
                {
                  "score": 310,
                  "content": "I’m currently at home with my kids whilst my husband is at work. We have no plans to go out today (UK experiencing a ‘heatwave’ and I don’t do well in heat lol), but if we do have to go out for whatever reason, I always drop my husband a text letting him know. I would hate for him to come back to an empty house and panic!",
                  "id": 29,
                  "comments": [
                    {
                      "score": 221,
                      "content": "Not just that but it's good for someone to know where you went and when to expect you back so they know when and where start looking for you should something go awry...",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "My husband and I have no kids; however, we still let each other know if we have gone somewhere outside of work or home. It’s common courtesy to let the person you live with know if you are somewhere they are not expecting you to be. If I came home from work and my husband wasn’t home, and he didn’t tell me he went to the store or when out with friends, I’d be panicking because I expected him to be home. \n\nWe also let each other know when we are on our way home. This is 100% safety related. We are letting each other know we are on the road, driving.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Oh you are from UK! Nice :) a big hi from the Netherlands 😀\n\nYes the European heat waves hit differently... we just got out of the pool. Take good care of yourself. \n\nExactly, you would hate for your husband to panic, because he is your husband and his well-being matters to you. It's called loving someone, caring for their well-being, respecting them enough to not do things that will impact them negatively, which results in him trusting you. Ask yourself whether your mother takes such a position when it comes to you, do you trust her?",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My husband & I don't have kids & we STILL send a quick text if we're going to be out or late coming home from work. Basically anything out of the normal routine should be communicated to the people who may worry about it, it's common courtesy.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Dude I tell my husband when I won’t be at home even though our son isn’t born yet. I tell him things like I’m going to the store or I’m doing this or that. I tell him all the things so that if something happens we know where the other one is! He knows when I’m at work, he knows when I get off, he knows about how long it takes me to get to the house. Because we TALK to each other. I know his work. I know when he leaves cause he TELLS ME. He tells me everything he does and talks to me while he’s at work because he is allowed his phone and it gets boring. Seriously we don’t just go places and say nothing. That’s just us as husband and wife. If I take our kid places he’s going to know. That way if something happens he knows our plans and where we were! Heck we have our locations shared on our phone for this reason! If we’re meeting somewhere we send each other ETAs and everything. Neither of us asked the other to do this, we just do it. It makes sense. \nNot a single person will have my child without telling me where they are going and how long they’ll be gone. It’s not happening.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Wednesday is my girlfriends day off work and the kids have school only in the morning. I get selfies of them eating ice cream or chilling at friends or grandparents while at work. Sometimes followed with a text \"are you joining us for dinner here?\". Not that strict but we keep each other in the loop.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Exactly!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "NTA, OP (to get that out of the way).To be more specific - my *exhausted and sick* spouse is asleep on the couch with our kiddo. I gently pick up kiddo and let spouse keep sleeping. I then decide to take kiddo and leave for the day without telling anyone and not answer my cell phone when my spouse calls.\n\nWhy would anyone think that the sleeping parent would *not* be freaking out is beyond me!\n\nAnd, OP, I would be having a conversation with a police supervisor (or similar) about the officers not adhering to facts and not taking you seriously because you're pregnant. That's straight-up gender-based discrimination. \n\nShe decided to show you what will happen if she feels like you're \"controlling\" her choices with your baby by setting appropriate boundaries. I'd believe her and get any police reports appropriately amended so that it's documented appropriately and consider getting a restraining order. This would be even more important if you live in a place that has decided that \"grandparents' rights\" are a thing.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Even if she didn't do that, answer a call with \"he woke up and your husband was sleeping so I took the kid shopping\" is at least somewhat justifiable. \n\nThis is not",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The fact that she's pulling all of this when her daughter is pregnant is just out of bounds.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "There was even a post not *that* long ago in one of the nanny subreddits that was basically the same thing in reverse, where the OP nanny got worried because her employer didn't text her during the day and then was late home... pretty tragically it turned out her instincts were right as the woman had been in a fatal car crash. (The employer's mother also lived in the area and came to get the kids as soon as she found out that same day luckily.) It was posted on /r/bestofredditorupdates a small-few months back. It is a good idea any time a parent is away from a child for both parties to keep each other up to date.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "The fact that she lied and gaslit you is incredibly alarming. Get a protective order and get rid of her. Your coming baby is far more defenseless, and I'm afraid you will indeed need to sleep sometime.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "OP you need to immediately push this with the police. Go in person and ask to speak to the person above the people who came out originally. Demand a case be filed and the incident number. Don’t let this drop. That is so terrifyingly dangerous and wreckless what she did. What if something had happened to you or your pregnancy as a result of all of this stress?",
              "id": 42,
              "comments": [
                {
                  "score": 86,
                  "content": "[deleted]",
                  "id": 43,
                  "comments": [
                    {
                      "score": 48,
                      "content": ">\"pregnancy brain\"      Mother should be sitting in jail. The entitlement she is showing is absurd. Go NC until your son is 18!\n\nIn all my years that's the dumbest excuse I have heard. Since the cops went with her story it's only because they didn't care to follow through with their job. Anywhere else (USA) a kidnapping suspect goes to jail and arraignment you have no choice before you see the judge. Proper investigations must prevail.   \n\nNever have I heard someone tell a cop something that absurd.  Now since they had to make an incident report follow up on it.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Yes, and OP-telll the police that even if your mother had asked for permission to take your son out for the day, you would have said no anyway. Nothing to do with pregnancy brain at all.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 50,
                      "content": "1.) She disappeared without contacting parents\n2.) She refused to answer her phone or texts\n3.) She was driving a rental car without child safety seat\n\nShe literally kidnapped your son. She needs to face charges.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Would (or should) OP also report to her home country/ home country's embassy? Kidnapping is pretty serious. Even if the home country just gives her a slap on the wrist, there should be a documented complaint right?",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yea, such a good idea to go over the responders’ heads because they dropped the ball big time. Why did they not believe OP? Sexism? Ageism? (older woman = respect) or just laziness? I can’t believe it got blown off.  Pissants.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "At least now you never again need to wonder whether or not she should be part of your life. NTA",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "She knew what she was doing was wrong or she would have answered the phone. \n\nSounds like your mum is a nightmare but even if she wasn't, if she'd answered your call and said, \"hey yeah na I've just taken bub to the park for some bonding whilst yall sleep, dunno when we'll be back but we're all good,\"  it would have been sweet but she couldn't even pick up the phone and shoot you a message,  tells me that she can't be around your kid unsupervised. I would have done exactly the same thing,  definitely nta",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "I'm so angry for you! What an awful thing to have to go through and then be told it's pregnancy brain! You're beyond justified going no contact with her because my god you had no idea where your child was! What a horrible woman!\n\nEdit - forgot NTA my god so not.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "You're NTA, OP. My son is just a little younger than yours (he's 2 1/2) and I have a complicated relationship with my mother as well. But if she did THAT? That would be my hill to di_e on. That is unbelievable that she would do something like that to you and your husband. The panic you must have felt!!! I'm so sorry. You have no obligation to have any further contact with that horrible woman. Pursue this with the police, press charges, and let her deal with the fallout from HER actions. SHE KIDNAPPED YOUR SON!!! And then she wouldn't even answer the phone for 6 hours?! I'm literally shaking and furious on your behalf. Did she even put your son in a car seat for safety?",
              "id": 52,
              "comments": [
                {
                  "score": 55,
                  "content": "The look on my husband’s face when he realised what was happening will haunt me for the rest of my life.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Oh honey, it wasn't his fault or yours. Narcissists are clever and devious by nature, not unlike sexual predators. They know what it takes to achieve their goal: dominance over someone. Your mother took advantage of the fact that she's \"family\" and pulled a fast one on you and your husband. Now that you're aware of her modus operandi (method of operation), you can cut her completely out of your lives without a hint of guilt.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I can imagine. I'm so so so sorry that you both with through that absolute horror. That woman needs to be done. \n\nI hope your husband doesn't blame himself. After all, they were napping. Who would have thunk it that some crazy woman would STEAL your baby!? That's just insane. I'm so sorry and so glad your baby is safe.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I have IBS. Sometimes the flare ups are so bad it literally takes everything out of you. As a parent I know your husband will blame himself because his son being kidnapped happened on his watch. Just remind him that he’s not a fault. Neither of you are. NTA.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Your mother definitely kidnapped your kid. Anything could have happened during that time. It's wrong so so so wrong to take a child just like that without informing the parents and about the whereabouts. She did that knowing that you will be in panic knowing your child is missing and more over you are pregnant again. It's important to be stress free at this time. Your mom seems like this person who makes it hard for everyone around and that makes her the AH. \n\nYou NTA.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "NTA. Given that she did kidnap your son, I won’t blame you if you go scorched earth.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 354,
          "content": "I mean...this made me laugh but, requiring nurses to *not* be kidnappers seems like the bare minimum. Is there an actual rule about that? I can just picture someone at a job interview \"have you ever kidnapped a child before? if yes, why? if no, do you have any plans to kidnap a child in the future?\"",
          "id": 59,
          "comments": [
            {
              "score": 198,
              "content": "It’s an actual rule.  You also can’t be a murderer or a rapist or any other kind of felon.   \n\nI’m sure that practice varies by location, but where I live there is a background check that happens before your registration, and you do in fact have to fill out a form declaring that you haven’t committed any crimes.",
              "id": 60,
              "comments": [
                {
                  "score": 83,
                  "content": "Where I am, at least, even a violent misdemeanor, like a misdemeanor assault, will keep you from getting your license. A few people were let go from my CC nursing program every year for past charges that they thought didn’t matter as they were misdemeanors.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 68,
                  "content": "I live in Wisconsin in the US and here nurses fall under the \"Mandated Child Abuse and Neglect Reporters\" umbrella.  They are required by law to report even suspected abuse or neglect.  Taking a child without their parents' knowledge or consent would fall into that category for sure!",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Yeah my sister has to submit a police check when she does her nursing license renewal",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "> if no, do you have any plans to kidnap a child in the future?\n\n\"We don’t *want* you to kidnap children, but we would like to know you’re ambitious enough to be thinking about it.\"",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "It's not specific to kidnapping but you do need to pass a background check and most places won't hire a nurse with a felony on their record.",
              "id": 65,
              "comments": [
                {
                  "score": 20,
                  "content": "In CT. We have a \"list\" or registry.  If any licensed or unlicensed individual has any hope for becoming employed in my state that may have access to, directly or indirectly to protected individuals, our state runs a check against this as well as DHS, DSS,DCF,AID formally known as OPA. These agencies report and run with state and federal agencies as well. So even if you work in a cafeteria in a CT school, you'll be checked to make sure this individual has never been convicted of abuse, neglect, misconduct with patients ect. All kinds of stuff can land you on this list.  And different offenses keep you on the \"list\" for mandated different amounts of time. In hopes that it helps prevent agency hoppers, in n out of CT from offending protected individuals time and time again. \nYou would bet, if this grandma gets charged, the police and prosecutors will make sure if her state has a registry, she will be on it and the state licensing board for her state will also revoke and remove any further licenses she may have. They can also prevent you from EVER becoming a nurse again!!\nIf you want to volunteer at your child's school in CT, they also require, even if you're the parent and it's your child's class  You want to volunteer with, you will also undergo this same background check because the access to children is there.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Thank you for the clarification. I only worked in the kitchen of an elderly care facility for a few months, so I don't know much about the nursing side of things.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Where I live (not the US) you not only have to have a clean record but you also have to show a document from the police stating that you have never been charged with any type of child abuse and/or neglect including kidnapping if you want to work with or around children.\n\nYou can have a clean record even if you have done time if it's been x number of years after you got out, but the hurting children part will always stay on your record.\n\nSo your potential employer will ask you for these papers and not ask you if you enjoy molesting children in your spare time during the interview.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Definitely morality clauses/no felonies. In some places, something as simple as having a beer in uniform can cost you your job. Legal troubles can cost you your license entirely.",
              "id": 69,
              "comments": [
                {
                  "score": 2,
                  "content": "I worked in a state that getting a DUI charge could result in a suspension of your nursing/medical license for up to five years though you could appeal the decision after a year. The thinking was if you were drinking and driving how do we not know you are not drinking while working with patients who are vulnerable and trust you to make the correct decisions regarding their care!",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Not necessarily that sort of question, but they will do a background check. And of course, if there’s a kidnapping on your record, you won’t be a nurse.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Even a DUI will get your nursing license revoked.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Newborn abductions or attempts are far more common than one would normally think, the hospitals even have a specific alert code for them, code pink, or so i've heard",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "What baffles me the most is that the dumbass cops just accepted it like that, because the child was home again.\n\nNormally you'd think they'd do something about it when one or both parents say that she took him without their consent.",
          "id": 74,
          "comments": [
            {
              "score": 106,
              "content": "When do cops ever believe upset women?",
              "id": 75,
              "comments": [
                {
                  "score": 106,
                  "content": "I had my apartment completely destroyed one night after this guy I was seeing went into a drunk rage. I’m lucky he didn’t hurt me. He was 6’5” and I’m 5’1”. A cop came out and went above and beyond to make me feel safe. He took my pictures and a statement, gave me his personal number, and walked me through getting a restraining order which did end up having to get. He didn’t leave until I had calmed down and felt safe enough to sleep at my neighbors. And this is America and I’m not even white. I can’t express enough how terrified I was when he showed up, and how much better I felt when he left.\n\nSome cops are decent.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Lots of cops are profoundly decent as individuals. The problem is the blind loyalty to a horrific system, which makes them complicit. It's like my incredibly kind neighbors who are so helpful to our immigrant family... and then loyally vote for people who want to kick us out of the country. They probably see us as the GOOD KIND of immigrant family who tragically vote to murder babies. Hard to know how to feel, at the end of the day.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Some really are. I've had them save my life on multiple occasions and show me great compassion. I do think that they should be held accountable for their actions too just like everyone else though.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Damn, I'm glad you encountered a good one at least.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Seriously. Did they think the dad had pregnancy brain too?",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 57,
              "content": "Cops are pretty lazy, this outcome meant that they don't have to write a report.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Because at that point it became more of a civil matter and cops avoid that shit like the plague.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "Just so you know, ANYONE can be a victim of kidnapping. It doesn’t apply just to children. Anyone of any age can be kidnapped. Apart from this point, I agree with everything you said.\n\nI would add to this, OP, that your husband should have listened to you when you expressed concern about your mother having a relationship with your child. You are, after all, the person who knows her best. I mean, if my spouse told me that their mother was toxic and that they didn’t want her around our child, I’d listen. Not try to convince them that their mother deserves a chance.\n\nYou are NTA. Not only did she take your child without permission, but she could have avoided having the police called on her if she took your call when you tried to call her and returned your child.\n\nSo, in my mind, she deserves what she gets. Not only did she abscond with your child, which is kidnapping (so you’re absolutely right that she kidnapped your child), but she blew her opportunity to avoid involving the police.\n\nETA:  \n>Now I am being called an a-hole for saying my son was kidnapped when he was “just taken on a day trip by his loving grandmother” and that a accusation like this could affect my mother’s job as a nurse.\n\nHis grandmother is not \"loving.\"  I suspect that she is the narcissist you say she is. The fact that she felt she had the right to take your son without your permission and lie to the police sounds like narcissistic behavior.\n\nBut she is not loving. She did this because she couldn't stand the thought of not being adored. So, she absconded with him and bought him toys because she thought that would make him love her.",
          "id": 83,
          "comments": [
            {
              "score": 2,
              "content": "> Just so you know, ANYONE can be a victim of kidnapping\n\nThis is very true, but the definition of the word “kidnapping” changes if the person being kidnapped is an adult.   \n\nKidnapping a child means removing them from the custody of their legal guardian.\n\nKidnapping an adult means unlawfully seizing and carrying away a person by force or fraud, or unlawfully detaining a person by force or fraud with the intention to carry them away.\n\nThese are two very different actions.  That’s why I only defined the kidnapping of a child.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "I completely agree and you should take this up with the superiors of the officers who came out to deal with this because I feel like they really dropped the ball here! I’m so sorry that this happened. I can’t even begin to think how your husband must feel to have woken up to just find his son gone! To be clear I am NOT blaming him at all. Poor man and poor you. Good luck.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "As a nurse she should be WELL AND TRULY aware that taking a child off a sleeping parent, without permission, and also being unreachable for 6 hours straight is not acceptable behaviour. Much less one who also doesn't know her!\n\nNTA OP",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Imagine just giving birth, and finding out the nurse handling your baby had kidnapped a child.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Narcissists also shouldn't be nurses!!",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "You can even kidnap a kid if you also have custody. There's a reason my mom needed a signed affidavit from my dad granting permission for her to take me on vacation abroad. Parents that have split custody have kidnapped children.",
          "id": 89,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "Not to mention the rental car likely didn’t have a child safety seat!",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5724,
      "content": "NTA\n\nAlso, you should press charges and make sure a restraining orer is put cause it's only gonna get worse from there.  \n\n\nthis was a kidnapping, of a small child, and should be taken with the utmost seriousness.",
      "id": 91,
      "comments": [
        {
          "score": 3757,
          "content": "A small child she had physically spent less than 24hours with and couldn’t talk to",
          "id": 92,
          "comments": [
            {
              "score": 1119,
              "content": "I’d be histerical too. It is my worst nightmare that my nother would kidnap my kids. My older one knows her (from before contact was cut) but the younger does not. Take this very seriously. Your mother can easily escalate.",
              "id": 93,
              "comments": [
                {
                  "score": 154,
                  "content": "This!\n\nI hope that having cut contact has given you some peace.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "may have been a typo, but no-ther should be an official word",
                  "id": 95,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yes a typo! But when I re-read the comment I didn’t want to correct it. You are right, “nother” should be an official term. Lol.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 288,
              "content": "In a country that she’s visiting and I’m guessing doesn’t know all that well & doesn’t speak the local language. This is insane.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 276,
              "content": "Did she even have an appropriate car seat for your child? I’m betting not.",
              "id": 98,
              "comments": [
                {
                  "score": 449,
                  "content": "This thought is making me sick. \n\nEither she didnt and risked his life or she did so this was preplanned?",
                  "id": 99,
                  "comments": [
                    {
                      "score": 249,
                      "content": ">car\n\nI read this post a few hours ago and then went for a nap and woke up thinking of the car seat, then came back here to mention it.  \n\n\nThere is no way this pans out  ok:  \n\\-either the rental had a car seat and this was pre-planned  \n\\-or it didn't and depending on your country of residence she likely violated a bunch of safety laws, depending on where you are, not to mention just being irresponsible.  \n\n\nAlso keep in mind how quick she was with turning around the situation on \"pregnancy brain\". She may be trying to gaslight you, which would fit with what you said about her being a narcissist.  \n\n\nThere is just no way this was benign. It was a powermove.  \n\n\nIf anyone saw her take your boy out of that rental, see if they can remember. And I would definitely follow up with the police, in case they saw the boy being taken from the rental car.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 158,
                      "content": "Just definitely follow up with those officers’ superiors and the embassy. Maybe consult a lawyer for advice on the best way to get action on this if you need to.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 61,
                      "content": "Honestly if she didn't I'd make this my base when talking to your family. Even if she had had permission taking a child in a car without a carseat is reckless endangerment. Where pray tell would that kid be able to sit where he would be safer than his car seat should someone have tboned your mom? \n\nEven with the best of me intentions she was negligent and you have a right to limit exposing your kid to that.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "It further proves she didn’t have permission, as you would have insisted she use a car seat.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Call the rental company and find out if she rented a seat.  Or returned it with one.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 202,
              "content": "Waaaaaiitttt….. this is less than 24 hours after she arrived?? WTF?!\n\nNTA, OP. That is wild. And make sure to cut off all members of your family who don’t believe you / think it’s ok.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "while she was in a country she isn’t familiar with (i presume). run that shit up and get her ass in as much legal trouble as physically possible. she abducted your child - no way in hell you’re the ah. nta <3 good luck w this moving forwards",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "The child is taken illegally from the person who has custody. If the child was taken legally, there was going to be known that it's taken.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "I’m really confused how it’s kidnapping when she brought the kid back. Kidnappers don’t return their victims. Her mother is definitely crazy & she should be cut off, but pressing charges this serious against her to be spiteful is bad karma.",
          "id": 108,
          "comments": [
            {
              "score": 1,
              "content": "this is kidnapping because she took him against the wishes of the mother.  \n\n\nif you steal something and give it back, you still stole it, and kidapping is much more serious than that.  \n\n\nnone of this is about being spiteful or \"bad karma\", it's not reddit, it's real life.\n\n She need to protect her child, and the only reasonable tool she has at her disposition is the law",
              "id": 109,
              "comments": [
                {
                  "score": 0,
                  "content": "In many countries kidnapping is punished by a death sentence or life imprisonment. Do you really believe the mother deserves one of those punishments for taking the child on a day outing without permission? Really? You cannot be a reasonable person & believe that.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2986,
      "content": "NTA\n\nIt's truly irrelevant what all these people think. You escaped all the toxicity successfully by emigrating. Cut all ties with the kidnapper and everyone who supports her.",
      "id": 111,
      "comments": [
        {
          "score": 1494,
          "content": "Thank you. I feel like we are going mad her because so many people in my family are telling me I am",
          "id": 112,
          "comments": [
            {
              "score": 848,
              "content": "[deleted]",
              "id": 113,
              "comments": [
                {
                  "score": 608,
                  "content": "This! Everyone gives her what ever she wants and since her husband past away it has 100% got worse",
                  "id": 114,
                  "comments": [
                    {
                      "score": 333,
                      "content": "I hate to say it but you may have to be really careful about allowing any of those family members to visit too, if they don’t see a problem with what your mother did or are trying to excuse it in any way. I wouldn’t trust them not to try and keep contact between your mother and your son in some way, even through virtual means like facetime, because they ‘feel bad’ for her.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 130,
                      "content": "The thing that really was shocking was she took your child for 7 hours! One or two is not unreasonable, but 7 and not telling you? Oh hell no press charges, send a mass email to all of your family outlining what actually went on, include the exact times so she can't argue and say it was only one hour. Tell them she is banned and that no family is ever allowed to stay with you again. If you want to visit everyone must book a hotel, no exceptions. And your children are never to be removed from their home without your approval. Anyone wanting to support a kidnapper is free to do so but will be completely cut out of your life. \nYour job as a parent is to keep them safe. You must cut those people out of your life that threaten your children's safety, regardless of what anyone says. \nNTA",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 73,
                      "content": "She's a narcissist, narcs put on a public show for others while making it hell in private to her kids. It's why everyone else sees her as the \"grandma who just wanted a loving day with her grandkid\" and not \"horrible woman that kidnapped a kid against his parents will and disappeared without a trace for a while day\". \n\nIf a non-narc mother had done that, they would've at least texted you \"i see you two had a rough night, I'm going to take the kid to the park and mall for a couple of hours while you two rest up after that night, we can bring lunch\" OR SOMETHING to HELP YOU and not make it about HER. \n\nCome over to /r/raisedbynarcissists where you'll find a lot of support and stories about dealing with this. You need to go NO CONTACT with her, now.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Does your mother live in the same country as you? I hope not! \n\nWhat was her rationale for taking your baby and disappearing? That's nuts.\n\nWhy do you think she did that? Do you think she did it as a form of control over you? Why would she stress you when you are pregnant...\n\nNTA",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Do you leave spare keys in the house anywhere she could take them? If so, change your locks.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Did she take a diaper bag with her, did she feed him?",
                      "id": 120,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I strongly suggest you buy & read this book!\n\n[https://www.amazon.com/Stop-Walking-Eggshells-Borderline-Personality/dp/1572246901](https://www.amazon.com/Stop-Walking-Eggshells-Borderline-Personality/dp/1572246901) \n\nStop Walking on Eggshells: Taking Your Life Back When Someone You Care About Has Borderline Personality Disorder Paperback – by Mason and Kreger",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "This really helped me to understand the people who enabled certain toxic people in my life: https://www.reddit.com/r/exmormon/comments/e85bgb/dont\\_rock\\_the\\_boat\\_analogy/",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": ">You're going to the congregation to ask if the preacher knows the word of God, of course they will say yes. \n\n>You need to look outside of your mom's little cult of followes for opinions, because anyone who doesn't worship her will tell you she is bat shit crazy.\n\nBeautifully said! Yes, exactly this. Don't look to people who embrace the crazy to tell you you are right to reject the crazy. Keep a record of everyone who has given you grief about this. Those people are not safe people and should never be around your child.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yeah, this is just like when people from Jim Jones' congregation was interviewed and they all said he was the best",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 154,
              "content": "No.  People take a while to process.  Hold firm.  You know exactly what happened.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "It’s easier for them to accept the idea that you are overreacting then accept the reality of your mother kidnapping your son. Which is what she did.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "My mother is the same kind of person as yours. It is easier for them to gang up on you and try to get you back in line than confront her. She will do damage if they round on her and they all know it. They do NOT want her to be their problem so they are going to berate you into keeping her your problem. Do not judge yourself based on people who are willing to sacrifice you in their own self-interest, whether they realize it or not.",
              "id": 127,
              "comments": [
                {
                  "score": 7,
                  "content": "Super this. Its called ‘flying monkeys’ when discussing narcissism.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "They're telling you that because they got her side of the story. Whoever gets the word out first is usually the one who gets believed. Anything you say or explain now looks reactionary.",
              "id": 129,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "A narcissist is a master manipulator and unfortunately will usually succeed in convincing everyone they’re innocent… don’t let this discourage you!!! Just turn to your husband for support to keep the sanity. Also maybe let him handle most of the coming legal stuff, so you don’t have to put stress on the baby! Congrats early",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "That’s because she has, what I refer to as, circled the wagons. Where the person knows they’ve done wrong so they quickly call everyone they can to tell their skewed side of the story first and play victim.      \nUsually the person who gets their story out first gets more people on their side. They’ve only heard her side. She knew she has done wrong but she is absolutely not going to admit it. I’d pursue charges. This isn’t funny at all.",
              "id": 131,
              "comments": [
                {
                  "score": 9,
                  "content": "Thank you. I feel crazy saying all out loud",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Can someone send OP the boatrocker post?",
              "id": 133,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Families can be MADE. You are making a beautiful new one.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Do not listen. Many people will keep telling you you are wrong or justify anything because she is your mother and is family. \n\nDo not back down, you are just doing what any mother will do in keeping dangerous people away from your babies\n\nNTA despite being related to a grade A Ahole",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1443,
      "content": "You are NTA. Your mother did kidnap your son, and this likely won’t be the first time she tries that. This is potentially a trial run to see if she could get your son out of the country. Do not let her visit you again. If your son has a passport, keep it under lock and key. If the police who responded don’t believe you, talk to their boss. Ask to speak to the local prosecuting attorney. Perhaps even explore if there are orders of protection you could take out to legally flag that your mother isn’t allowed near you or your children.",
      "id": 136,
      "comments": [
        {
          "score": 818,
          "content": "I am so terrified because our garden is next to a public path/playground and the fence is only hip height.\n\nI don’t want to let my son play outside right now despite my parents in law and brothers in law coming here incase anything else happens.",
          "id": 137,
          "comments": [
            {
              "score": 370,
              "content": "Get cameras, you can find some relatively cheap ones, make sure they record so you can look back and see if people are creeping around the outside of your home",
              "id": 138,
              "comments": [
                {
                  "score": 13,
                  "content": "Ring is a good camera system use that",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 133,
              "content": "Pin an apple tag to the inside of your sons clothing.",
              "id": 140,
              "comments": [
                {
                  "score": 107,
                  "content": "I’m really tired and at first read I missed the word “tag” and was trying to figure out what putting an apple in his shoe would accomplish.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 50,
                      "content": "He can't run off,  with a whole apple stuck in his shoe. Jk I missread it too.",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 35,
                      "content": "An apple in the shoe is the international sign for \"I've been kidnapped!\".",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Or on his shoes laces so it goes with him everywhere.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It's so nice that your new family is being so supportive. Seems like everyone has learned a valuable lesson. Hopefully she'll return to her country and you can feel a bit safer. You chose the right man to marry with a real family who has your back.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "Disappearing out of the country with the child was what I thought of when I read the post.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "Well said!\n\n*Especially* the bit where OP should talk to the local police chief about the officers not taking a legal guardian's word and offering no follow up options. It's unprofessional.\n\nNTA, OP. \n\nDo all of this, and cut the extended family off. This was not for them to butt into and you owe them nothing.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This!!!",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 954,
      "content": "NTA.\n\nShe took the child without permission and disappeared, not even a text telling you where they were or that she was taking him to the park or something. She waited for the moment he was unsupervised, took him without a word and purposely didn't answer her phone.\n\nIt was a kidnapping, it doesn't matter if she is the grandmother. She has no right to do that.\n\nAll she needed to do was ask permission or at the very least call you and tell you so that you knew where your son was. Instead, she acted as if she could do whatever she wanted.\n\nPut a stop to that, call her a kidnapper, and tell the rest of the meddling family that they can go fuck themselves.",
      "id": 149,
      "comments": [
        {
          "score": 682,
          "content": "Thank you. \n\nI fell like I am going mad here but who takes a child they have physically spent less than 24hours with and they can’t even speak that child’s language.\n\nShe also clearly let him have cola which we had been avoiding since he has asked for it twice today",
          "id": 150,
          "comments": [
            {
              "score": 290,
              "content": "You established boundaries, she violated them. You are in your right to be upset.\n\nWhat if your kid was allergic to something, you told her not to give him that and she went and did anyway? Different story, right? Now the kid is harmed. \n\nHow can you know something like that can't happen? If she doesn't respect your boundaries, how can you know the kid is safe with her? You can't know.",
              "id": 151,
              "comments": [
                {
                  "score": 19,
                  "content": "My narc mum often tries to give my son dairy to “prove” he’s not really allergic to it.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "Wtf. Kids that age don’t need any type of pop!",
              "id": 153,
              "comments": [
                {
                  "score": 50,
                  "content": "Thank you for saying pop. I feel so seen right now😅 ppl usually make fun of me for it",
                  "id": 154,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I get crap for saying soda once in a blue moon lol it’s normal in the Midwest to call it pop. I only call it soda cuz I was a pretentious kid that didn’t like Freddie Jones from scooby doo and went with Johnny bravo with the pop/soda debate lol",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "My MIL gave my kid her first sugar (cookies) while looking after her at my father's memorial. Spent years howling with laughter ar how upset it made me, \"hey, remember that time I gave her cookies depsire knowing you didn't want her introduced to sugarvyet? Boy were you cranky! Lololol!\"",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I have life threatening food allergies. My cousin's son could die from smelling peanuts and almost as bad with corn. I would be scared that \"loving grandma\" might accidentally harm the child if there's any food allergies that might not be known yet or maybe you're still sorting out which one and hadn't said anything to her, because she's not going to be feeding him without you, and then.... bam.... yea... no NTA and please please file a report, install cameras, report the responding officers who didn't take you seriously, and go NO CONTACT with anyone who disagrees with that choice. My ex MIL is certified, been committed twice, crazy and I've had to do this after my ex passed just to make sure she wouldn't come and try to take the only part of her son left, my kids. Good luck and find a counselor to help process the trauma of this. You don't need to develop PTSD while you're preparing for a newborn. Love and light!",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It would still be absolutely horrible if she'd at least taken him and then texted to say she'd done so but no word at all is just so far beyond even that. No word at all is what you do when you're trying to *permanently* kidnap someone to give yourself a bigger headstart. Or what happens if you get hit by a semi-truck on the way to wherever you're going.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 508,
      "content": "> “just taken on a day trip by his loving grandmother\n\nWhich part was the loving part? When she complained he's a foreigner who won't speak English, or when she shouted at the two year old child for spilling his juice?\n\nYour mother did kidnap your son. She took him without permission or even anyone's knowledge then actively avoided communication even to let you know the kid was safe. She just somehow managed to get the cops to believe she did nothing wrong since she brought him back. \n\nNTA and now you can't leave your kid out of your sight so thanks for that mom.",
      "id": 159,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 315,
      "content": "NTA it was kidnapping. Also CUT ALL CONTACT. That woman is nuts. Don’t let her gaslight you into staying in contact, pls. She will just do it again and more bc she got away with it the first time.",
      "id": 160,
      "comments": [
        {
          "score": 37,
          "content": "I'm sorry but I'd raise hell at the police chief as well as the fact she only just met him. So I'd push on this matter especially kidnapping and not answering calls. But I'd tell all family members what she did what she said to to stuff it if they can't get behind you on the matter. I'd also call her employer as well as the people incharge of nursing licenses and report what happened and give them the police report case number to back up you pressing charges. It's a serious offense and should be conducted as such. Stupid games get stupid prizes.",
          "id": 161,
          "comments": [
            {
              "score": 3,
              "content": "Yep! This is what I’d do too. I can’t even imagine how freaked out I would have been but I’d make damn sure it wouldn’t happen again!",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 286,
      "content": "NTA - Your mother obviously took advantage of the situation.  She waited until both you and your husband were indisposed to take your son without your consent.  That is kidnapping.",
      "id": 163,
      "comments": [
        {
          "score": 208,
          "content": "I’m curious if she had any kind of car seat in the rental car. You can’t just strap a 3 year old in with a normal seat belt, that would be really unsafe.\n\nOP is absolutely NTA, if I were her I’d be going NC with her mother. Her behaviour was completely unacceptable.",
          "id": 164,
          "comments": [
            {
              "score": 327,
              "content": "I haven’t even thought about the car seat. \n\nSo what either she risked his life or she preplanned this??? \n\nThink I am going to be sick",
              "id": 165,
              "comments": [
                {
                  "score": 138,
                  "content": "OP you and your husband please find out -- was there one in the rental car, or did she take yours, or did your boy do the whole day seat-less?\n\nIf this gets to court, the judge is gonna care. Trust me.\n\nYou should be able to tell if yours was taken from your car. But I bet she didn't bother.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 140,
                      "content": "Not sure how I can…the police would need to ask the rental company but I can try. \n\nWe don’t have a car so it’s not from here.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 62,
                  "content": "You’re gunna be okay hun! Slow down and breathe! I know it’s scary, but the what ifs aren’t going to help you right now. Your son needs you now more than ever. He might seem happy at the moment because she bribed him into enjoying his ‘day out’ (with all the toys), but deep down, he will be scared by this as well. He’s home, he’s safe and he’s healthy. Hold onto him right and take a breather where you try not to think about this for a minute. Come back to it with a fresh mind so you can come up with a plan of action moving forwards. I promise you, taking that breather and holding him for a bit will help you rationalise and think easier enabling you to come up with a solid plan (holding him will help trigger maternal instincts, which include protection) xx",
                  "id": 168,
                  "comments": [
                    {
                      "score": 195,
                      "content": "Thank you. \n\nMy husband’s family have descended on the house to support us so my son is with his cousins and a load of dogs so he is pretty happy and there currently 10 adults keeping an eye on things.\n\nJust taking the time to type it all out has been very clarifying.\n\nI am going to notify the embassy and see what options I have to get something official if only so I can show him one day why he doesn’t get to know my mother",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "I'm so sorry. Your kid is back with you and your husband. You might want to see if the in laws you can trust will visit with you for a bit, having people you know you can trust could help. Can you ask the police to make a report so there's something on file?\n\nEdit; wording",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Unfortunately, that's what it looks like. Either she tossed him into an adult seat without one, or she planned ahead of time and had a car seat ready to go. I'm sorry you and your family are going through this, but it looks like you have a large, solid support network in your husband and in-laws.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This is awful. Is there anywhere you can stay, maybe with your in laws, that she doesn't have the address? Just until she leaves the country (or gets locked up for kidnapping)? You are justifiably stressed out and I think you would feel better and safer if she didn't know where you and your son were.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 207,
      "content": "NTA OP, refuse to be muzzled. If I may quote the amazing Lizzo: truth hurts. \n\nMama, I cannot imagine enduring the six hours you spent in sheer terror, wondering where your mother had driven off with your son, in a rental car in an unfamiliar country. Did she even have a car seat/booster seat for him? Is that required by law where you are? \n\nYou just keep on telling everyone the plain facts, very clearly. There's no need to exaggerate or get super emotional because the facts themselves are so damning (*\"She took our toddler away in her rental car, without our permission, and went god knows where with him for six hours: no text, no call, nothing. For all we knew, they were dead in a ditch somewhere. Then she came back and said she had done nothing wrong. That's why she's banned from our house forever.\"*)\n\nIf the police won't take your criminal complaint seriously, that sucks. But there must be a civil process where you can swear an affidavit or provide in-person evidence, and ask for a restraining order against this person? Once you get that, it will speak for itself. And feel free to provide it to the Board or College that licences nurses in her home country -- people with no boundaries or conscience should not be nurses, eh?\n\nAs for the \"faaamily\" pecking at you: tell the truth, fearlessly, and if they are still dumb enough to take crazy grandma's side... well, your Christmas card list just got a lot shorter. You don't need folks like that in your life, and neither does your little boy. \n\nWishing you peace and security, OP.",
      "id": 173,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 126,
      "content": "NTA. She *did* kidnap your son, & if other family members don't want to hear that word, too bad for them.",
      "id": 174,
      "comments": [],
      "relation": "Support"
    }
  ]
}