{
  "post content": "I (30f) divorced my husband (36m) 2 years ago after 10 years of marriage. We have 3 kids. My ex's new gf, whom he's only been dating for 9 months, just found out I never went back to using my maiden name. I kept my married name. In part so I would have the same last name as my kids but also because my maiden name was a little embarrassing. She asked me when I planned to change it. I told her I do not plan on changing it back ever. She has convinced her family and my ex in laws that I am only keeping the name to spite her and my Ex. My ex sister in law has even called me the A-hole for \"keeping a name that isn't mine\" My ex says he doesn't care one way or the other. so am I the A-hole?",
  "id": 1,
  "comments": [
    {
      "score": 9275,
      "content": "NTA I would laugh to myself knowing my ex had to put up with this psycho behavior on a daily basis. Tell her when they marry he can take her last name",
      "id": 2,
      "comments": [
        {
          "score": 2768,
          "content": ">Tell her when they marry he can take her last name\n\nThis is brilliant.",
          "id": 3,
          "comments": [
            {
              "score": 1276,
              "content": "Or even better, OP can offer them her maiden name.",
              "id": 4,
              "comments": [
                {
                  "score": 479,
                  "content": "Ooh I wanna play! OP can take the girlfriend's last name.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 355,
                      "content": "One name to rule them all and in the darkness bind them",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Ha ha ha I honestly laughed out loud",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Or OP can change her name to the GFs name so when they do marry that one is taken already",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 369,
              "content": "Tell GF that if she can convince Ex to allow OP to change their children's names to her maiden name, then and only then she will re-take her maiden name.",
              "id": 10,
              "comments": [
                {
                  "score": 309,
                  "content": "This. OP this is what you do.\n\nSend a message to each person who harasses you with this:\n\n\"I find it odd that a woman who has been casually dating (name) for 9 months feels this threatened by my last name. But, whatever. I refuse to have a different last name than my children. So, we can either go through the legal chanels to change their last name to mine, which will be a pain in the neck legally as well as confusing to them, or we can all take a step back and realize that this whole discussion is crazy and that I have a valid reason for wanting the same legal last name as my children.\"\n\nThat said, OP, your Ex is foolish for not shutting this down. I'd broach THIS subject with him. The fact that he needs to shut her down because you both know that there is a valid legal reason pertaining to your children's health and wellbeing that you are retaining your married name. It has nothing to do with him or her and EVERYTHING to do with your children.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 32,
                      "content": "My mom kept my dad’s last name when they got divorced as she wanted my sister and I and her to have the same last name. My dad had 2 wives after my mom and is dating. No one EVER has had an issue with my mom’s last name. This is the answer, OP make this your ex’s issue because this is just insanity!!\n\nAlso my bf’s ex wife changed her last name to her maiden name after their divorce and I thought it was weird that she didn’t want the same last name as her kids. My Bf loves that about me. Your ex’s new- emphasis on new- gf is the problem.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "This is the perfect response",
                  "id": 13,
                  "comments": [
                    {
                      "score": 39,
                      "content": "I dislike the idea that the ex-husband's name is \"his\" name and that OP's maiden name is \"her\" name. Her and her ex-husband have the same last name. It became equally hers the day she legally changed her name to that. The idea that the ex-husband somehow has ownership over the name irks me, when legally it is no more his name than it is hers.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This!",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -3,
                  "content": "Kids are people, not props to be used in petty squabbles.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "Ok funny story. \n\nWhen my mom and stepdad got married he took her last name. At the time I thought it was really cool but later realized it was because my mom was either his second or third marriage and he was just over his own last name. My mom supported him through law school and he established himself as Mr. [Mom's Last Name] and even self-published a (bad) book under it. They get divorced and he keeps her last name, then GIVES IT TO HIS NEW WIFE a few years later. We were all so confused.",
              "id": 17,
              "comments": [
                {
                  "score": 39,
                  "content": "Less marriages involved in my story, but my mom kept her married name when she and my father divorced after a couple decades of marriage. She rationalized that she had been known by her married name for almost as many years as she was by her maiden name — essentially, her entire adult life. She many accomplishments associated with her married name, *her* name. This logic made sense to me. 🤷🏼‍♀️\n\nHaving somewhat established himself professionally under this new last name, I can see your stepdad wanting to keep that name he had created for himself (not so much the last name, but *his* name — *first name + married last name*)",
                  "id": 18,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Yeah the professional logic I understood it was the woman he cheated on my mom with knowingly taking her last name that was weird to me.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -6,
              "content": "[removed]",
              "id": 20,
              "comments": [
                {
                  "score": 2,
                  "content": "Bot",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -44,
              "content": "And unlawful in many states",
              "id": 22,
              "comments": [
                {
                  "score": 12,
                  "content": "What is?",
                  "id": 23,
                  "comments": [
                    {
                      "score": -28,
                      "content": "The groom taking the brides name. It’s an antiquated law that no one has bothered to change in most states. Connecticut I’m sure of. My son wanted to change his last name to hers for the children’s sake, they were 5 and 6. No such luck",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 498,
          "content": "But then how would the girlfriend ever learn the joy of getting your name changed on every single account and document?",
          "id": 25,
          "comments": [
            {
              "score": 158,
              "content": "And companies do NOT make it easy to do! I haven't been able to change my car rental account because you HAVE to do it online, but the site says it is processing and never actually does anything and customer service won't help. It's infuriating.",
              "id": 26,
              "comments": [
                {
                  "score": 104,
                  "content": "I noped the hell out of that one REAL fast after my wedding. I was more attached to my maiden name than I thought I was but especially after hearing the horror stories about name changes AND getting married right before COVID lockdown? Nah I'm good. My kids can have hubs' last name, but I'm keeping mine!",
                  "id": 27,
                  "comments": [
                    {
                      "score": 60,
                      "content": "My kids have mine, not hubs’. It’s so convenient, because I’m always the one that signs all the school forms.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 39,
                      "content": "I hated my surname. A kid can only handle getting asked, \"Can I have fries with that?\" so many times. IT WASN'T EVEN SPELT THE SAME. Plus I was raised that kids have their dads last name (reason why my mum said I wasn't allowed to change my name to her maiden name) so after 10years of being together and raising 2 kids I only wanted to get married for the piece of paper so I could use it to legally change my name to have the same as my kids. Should hubby and I ever split, I ain't going through all that hassel and paperwork again.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "It was a pain in the ass. I had no issue with Social Security. But the dmv? Took forever. I kept getting new licenses addressed to me correctly but when I looked at the license, it still had my maiden name on it. I about lost my shit the last time I went in.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "This is typical in most of Europe - I know a lot of dutch people (hubby from there) and none of the women changed their names at marriage....i never changed mine - we don't have kids though......",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Yea, I kept my maiden name because I got married during covid, and like hell, I was going to send original documents in the mail to the paperwork blackhole known as the social security office. I have his last name on Facebook, so good enough.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Been married for 2 years and I get asked why I haven't taken my husband's last name yet. I said I don't want to deal with the paperwork and change *everything*. Family doesn't really like the answer but that's my decision.\n\nFunny enough, I was partially inspired by my bosses' from my old job. The wives of the bosses, who are also founders of the company, still kept their maiden name. Thought that was pretty neat.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 34,
                  "content": "Some places wanted original marriage certificates— for a rewards program. It’s been 15 years and I still can’t get Verizon to update my last name.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Or copies of divorce decrees. I'm sorry, but nobody but the court and the ex needs to know what's in that document.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I got married while in college.  And working for the college.  Changing my last name was easy on the employment side.  On the school side it was a pain.  They demanded to see an original of the marriage license.  Then nearly kept it.  They were only place that gave me issue once I got a new social security card and driver's license.\n\nStill get annoyed thinking about it even now.",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I came here to say this. When my parents got divorced visa wanted the signed affidavit and all the lawyers documents for my mom to go back to her maiden name. She had had the same account for like 30 ish years, way before her and my dad even got married so she had been with them under her maiden name. She cancelled her visa then and there and hasn’t gotten another one",
                  "id": 37,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I go by my middle name privately and professionally and created my original PayPal account in that name. After getting married I completed the form to change the name from Middle Maiden to Middle Married and submitted my marriage certificate as requested. They added in my first name even though I hadn’t put it in the form. After writing four increasingly frustrated emails explaining that First Middle Married wasn’t a name I go by and I didn’t want everyone I buy crap from on the internet and every friend and colleague I PayPal money to to see it, with them insisting that they were powerless to change it unless I gave them legal documentation of a name change from First Middle Married to Middle Married, I deleted the account and just created a new PayPal account under Middle Married, no proof of name needed. It was insane.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My sister had the most difficult time getting her SkyMiles name changed! I think it too wouldn't allow her to do it online, she had to call. Even Social Security was easier.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Social security was honestly the easiest out of anything. My banks/credit cards all had different \"federally required\" procedures. Most of my accounts I haven't even bothered yet.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I had a joint bank account with my mom from aaaaagggesss ago and I completely forgot she was on there (her name wasn’t even on my online banking thing, she never touched my money, which is how I forgot). I went to the bank to change my name after getting married, and I freaking needed my mom to be there. It took 7 years before our schedules aligned during bank hours for us to go in and change my last name. \n\n(We also removed her, haha)",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I had a jewelry account which, after multiple phone calls, insisted that I mail my actual social security card. I noped right out of that one. Eventually they canceled the account.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I just made entirely new accounts for car rental and frequent flyer because it’s faster than the process they require for a name change. I really do understand the security aspect but there are limits to the absurdity one should go through for sending original documents to companies.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Easy. They should hyphenate her last name and OPs maiden name.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Right? I got married in 2019 and still haven’t gotten everything switched over to my married name. There’s a few places I have to go in person and well 2020 happened and then we moved and honestly wish I’d just kept my maidan name at this point.\n\nNo way I’m going through all the paperwork and fees to change it back if we ever divorce",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 393,
          "content": "He gave her his name, there are no takebacks.  If you want a woman to take your name and change 1000 documents so it is legal and give it to her children and live with it for years you don't have control anymore - that name is now apart of her and she gets to choose what to do it it.  Maybe for the next wide have her keep her own name if you don't want to hand it out anymore.",
          "id": 46,
          "comments": [
            {
              "score": 7,
              "content": "Off-topic, but I wonder if Ben Affleck considered any of this? Like, I know that Garner kept her name professionally, but it’s possible that she was privately known as Jennifer Affleck? And now, JLo is Jennifer Lopez-Affleck…and I just want to know what kind of family conversations were had!",
              "id": 47,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "I agree. OP, take joy out of bothering this woman who needs a hobby.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "INFO: what is OP’s maiden name?\n\nIs it Mulva?",
          "id": 49,
          "comments": [
            {
              "score": 51,
              "content": "I mean Gay, Hooker, and Cox are all not uncommon last names that one might find embarrassing.\n\nEdit: To be clear that list of names is not intended to be exhaustive only a sample of surnames people may not want to go back to.",
              "id": 50,
              "comments": [
                {
                  "score": 23,
                  "content": "I had a friend whose last name was Dick",
                  "id": 51,
                  "comments": [
                    {
                      "score": 29,
                      "content": "My sister dated a guy with that last name and he was in the navy... Seaman Dick",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "Dad had a coworker \"Double Dick\"... His actual name was Richard Dick. What were his parents thinking?",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "Had an assistant band director named Richard Eader. It took nearly 8 months for somebody to figure out his first name because he wouldn’t share it with anybody. I cannot imagine why you wouldn’t change that the second you turned 18, much less why you would become a high school educator with that name. 🤦‍♀️",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "I have an acquaintance with the last name of Pussey.  Says it's pronounced pew-zay. Nah, that's not how everyone else says it.  \n\nAlso had a coworker named Fuchs. Pronounced Fewkes. I loved when people would call for her and pronounce it every which way but the way we're all thinking",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Was his first name Harry? Or perhaps Hugh? If one must have Dick as a last name, they should make the most of it",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I, really truely, knew a woman, surname Chew (frankly bad enough in itself) whose partner’s surname was Cox.  She wanted to hyphenate their only son’s name. She was persuaded out of it.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 3,
                      "content": "She had to be *persuaded*?  😂  OMG.  That poor kid never would have stood a chance.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Sack. Harold Sack, aka Harry Sack. Seriously.",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I knew family of Cracks. NTA",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "“Now let’s try ‘breast’…Celeste…Kest…Rest…Sest…Hest…”",
              "id": 61,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "There was someone in my high school with the last name Wiener, that could be it possibly.",
              "id": 62,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Butt or Butts. Probably Butts.",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 45,
          "content": "My ex was just the opposite. I wanted my maiden name back with the divorce, and they threw a full temper tantrum in court. I laughed and told him to give it to his girlfriend, who was in court with him. She went on to become his 2nd ex-wife, and she took her maiden name back, too🤣",
          "id": 64,
          "comments": [
            {
              "score": 28,
              "content": "I couldn’t change my name back to my maiden name fast enough. Then he went and married a woman of similar age and professional training as me and with the same first name, and she of course took his name. I spent the next 20 years fighting off their creditors.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My ex was really upset I was changing my last name back too. Is this a control thing? It just seemed odd to me. I shot the tantrum down real fast.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I really don't get name ownership. When OP got married and legally changed her name, it became hers. Period.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "NTA, I have been divorced 9 years. I still have my married name. I'll be damned if they were only going to share a name with my ex. Plus after 14 years, I had come to like my name. My current partner doesn't give 2 shits. His ex kept his name too. Oh well. We have even decided if ever marry, I'll keep my current name.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "No, I'm pretty sure that making a problem where there isn't one is a sign of maturity and emotional intelligence. The emotional intelligence is strong with this one.",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "So immature and petty",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2619,
      "content": "NTA\n\nThe name is in fact yours. It became yours the day you changed it, and it will be yours for as long as you want it. This is how names work. Your name is none of her business whatsoever.",
      "id": 71,
      "comments": [
        {
          "score": 298,
          "content": "Exactly! She can keep that name for however long she wants. I have a family member who divorced her husband and remarried. When she divorced the 2nd husband she went back to 1st husband's name because while it was also the same name as her kids but also cause she and 1st husband were together a long time. She'd been Mrs Smith far longer then Miss Jones or her second husbands name, so she goes by that name rather than her maiden name.",
          "id": 72,
          "comments": [
            {
              "score": 252,
              "content": "My ex frequently expressed that he didn’t like that his mother had kept her married name after divorce. At the time of divorce she’d been Mrs Married Name over 35 years, it had been her name much longer than she’d had her maiden name, not to mention it was the same surname as her kids and grandkids and she was a teacher, so it had been her professional name her entire career. It was a baffling opinion. \n\nMeanwhile my ex sure was set on our kids getting his last name despite the fact I never took his surname. Because apparently names being a familial connection *does* matter.",
              "id": 73,
              "comments": [
                {
                  "score": 37,
                  "content": "Crazy. My family member thankfully hasn't gotten any grief about going back to her 1st husband's name, but then again they are the best of friends as long as they aren't married lol",
                  "id": 74,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I have one of those!!",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "My wife kept her maiden name. Just seemed silly. Our daughter has her mom’s last name. Sons would get mine.",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "My best friend's Mom has been married 4 times. She kept her first husband's name until she married her second. All her children had the second husband's name. She was widowed from second and kept his name until she married third. When she divorced third, she went back to second. She then kept that name until she married fourth. When she divorced him, she went back to second.\n\nShe has since decided that she is unlucky in marriage and at 74, she has been content to live happily with her partner for the last 15 years. Her current relationship is longer than all her marriages combined.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My mother did this after both of her subsequent marriages/divorces.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "It’s unusual for a woman who had kids during the marriage to change her name back to her maiden name anyway. Not unheard of, but not the norm. She usually keeps her kids’ name. If there are no children, it’s more common to change back to the maiden, but even then, it’s a personal choice. This woman sounds like a lunatic. (NTA.)",
          "id": 79,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1419,
      "content": "Um, no. You’re not the asshole OP. But there are plenty of assholes chirping in your ear for some reason. My recommendation is when they do this, just imagine they are a cute little mouse talking to you. So gently pick them up by the tail, and place them in the middle of a cake plate. Then replace the glass cover. Now you can still see them, and they can talk and talk and talk and talk and talk? And you are not going to hear a word they’re saying. \n\nYou want to have the same last name as your kids. Soldier on. \n\nNTA",
      "id": 80,
      "comments": [
        {
          "score": 105,
          "content": "LoL! What a comment, I will use this for all shit talkers! \n\nOP NTA",
          "id": 81,
          "comments": [
            {
              "score": 76,
              "content": "Yeah. It’s a perfect visualization for when people are nagging at you and bothering you but not saying anything helpful? And they can’t hurt you.\n\nI use it for voices inside my mind sometimes. In a very non-crazy way. I promise.",
              "id": 82,
              "comments": [
                {
                  "score": 4,
                  "content": "Tbh I will use this in a crazy way too, because it’s very helpful.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "That is a good advice!",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": ">and place them in the middle of a\n\nI thought you were going to said road.",
          "id": 85,
          "comments": [
            {
              "score": 13,
              "content": "Another option!",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "My MIL still keeps the same last name as my husbands father who cheated on her solely because it’s her kids last name. That’s enough reason for anyone with half a brain because even the bitter jealous woman he cheated on her with and married doesn’t have anything to say about it. \n\nit’s your name OP, who cares what anyone else says. Deciding to keep the same last name as the children you bore does not make you an asshole in any way.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1017,
      "content": "NTA. Plenty of parents keep the same last name that their children have after a divorce to keep things simple. Some just don't want to go through the hassle of changing a name, again.\n\nI would flip the script on them, \"Why are you so obsessed with me?\" \"oh my gosh, I didn't know that me keeping my last name meant so much to (ex-husband). Is he still in love with me or something? I will tell him that you said he's been asking about me...\"\n\nTo his current GF \"Wow, you must really be threatened by (ex-husbands) ex wife to worry this much about my last name. Have you always struggled with insecurity, or has (ex-husband) brought this trait out in you?\"\n\nI feel like instead of becoming uncomfortable with their allegations, just make it 10x more uncomfortable for them and they will stop. Elementary school bullying 101 works into adulthood.",
      "id": 88,
      "comments": [
        {
          "score": 295,
          "content": "I'll have to try that :)",
          "id": 89,
          "comments": [
            {
              "score": 79,
              "content": "Please update us when you do.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "I’m gonna be honest I don’t think you should do this. Your ex isn’t the one giving you any trouble and I don’t think saying “oh is ex still in love with me” is going to work well for anyone. He’s not going to be happy about you throwing him under the bus and then he’ll also probably start pushing you to change your last name",
              "id": 91,
              "comments": [
                {
                  "score": 52,
                  "content": "He also isn't shutting down this bullshit so who cares if he's happy or not.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Agreed.  “If you are neutral in situations of injustice, you have chosen the side of the oppressor.” - Desmond Tutu\n\nIf someone isn't saying anything about something that's obviously wrong, then they are by default taking a side.  By staying quiet OP's ex is taking a side here, he's just not saying it out loud.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -2,
                      "content": "Op will care when he also starts in on her",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "Or even add, you know what your right I will go right ahead and change the children's and my last name.\n\nSit back and wait for the no that's not what we ment. We'll they know where you stand on having the same name as your kids so it must be what they meant. How else could that be taken. Play so dumb about it that it was their idea you change the kids names.\n\n  \n\n\nBecause if it's so important to ex hubby and in laws that you don't have the same name as your children because it's his last name, it can be him who has a different name to his children. They are pushing it so they deal with the consequences.\n\n  \n\n\nThey get 2 options, shut the fuck up and get over it, or you and your kids get new names.\n\n  \n\n\nIt's important to you to have the same name as your kids for simplicity and any other reason you damn well want.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "It's definitely not going to de-escalate things. I'd just say \"I'm not changing my name. Leave me alone.\" It's not as pithy but it's less antagonistic (even though you're entitled to respond in kind, it's just about whether you want the situation to go away or not)",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "NTA wow this girl has got some real dumbass nerve. I kept my name when I divorced for the same reason you gave. I wanted to keep the same name my kids have. It's easier and better when dealing with school and other things. Ask her if she is jealous because he hasn't offered her the name yet.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Change your name to the gf’s name instead?",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Tell her to change her name to consuela bananahammock. It’s a name. That’s all it is. \n\nFor your children, totally understand keeping your name. And for the record, I didn’t take my husbands last name. It’s a friggin hasssssllllleeeeeee.",
          "id": 99,
          "comments": [
            {
              "score": 7,
              "content": "Did not expect to see that name here tho it’s excellent advice hahaha",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I love this idea.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I never considered changing my surname because every government form I’ve ever seen in my country asks for a history of name changes, with evidence. Imagine how complicated that would get with multiple changes over the years. Extra paperwork is an entirely valid reason to never change anything or never do it more than once.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Not to mention, it's such a significant pain in the ass to change your name. Credit cards, bank accounts, school contact info, a million different mileage clubs and rewards cards, passport, drivers license. Not to mention, any professional reputation built on an older name.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 283,
      "content": "NTA\n\nWhy should you have to change your name you've been using for the past 10 years? Why should you have a different name than your kids? Also consider that the kids are going through a lot of changes; to have their mother suddenly have a different last name is just one more unsettling thing they'd have to deal with. Tell your nosy SIL that you're trying to give the kids as much stability as you can, and keeping the same last name as they have is part of that. And then tell her to mind her own beeswax.",
      "id": 104,
      "comments": [
        {
          "score": 21,
          "content": "I agree she is NTA but disagree that had she reverted to her original name, it would disturb her kids. I changed my name back after a divorce and explained it in a matter of fact way to my kids, who were young at the time. They never questioned it and have never had a problem with it.",
          "id": 105,
          "comments": [
            {
              "score": 73,
              "content": "When my mom got remarried in my early 20s she took her new husband’s name. It still feels weird all these years later that we have different last names. Every kid is different and feelings aren’t always rational.",
              "id": 106,
              "comments": [
                {
                  "score": 15,
                  "content": ">\tEvery kid is different and feelings aren’t always rational.\n\nExactly. By comparison my mom got married when I was 16 and hyphenated her name, but only to really keep her maiden name for professional reasons, in every other situation she used my stepdads name. Didn’t bother me one bit.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "That's what my kids said🙁 I just didn't want to be associated with my ex any more",
                  "id": 108,
                  "comments": [
                    {
                      "score": 4,
                      "content": "My mom originally kept it because of her career and I think later there were some discussions/issues from her new husband about it so she changed it legally and kept work as her 1st married name until she retired. \n\nI totally understand someone wanting to ditch the name. My dad was an absolute nightmare so I wouldn’t have blamed her. Even I want to get rid of this damn name!",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "It may not disrupt the kids but I know when I was in school and my mom got remarried with a different last name she struggled with making me doctors appointments and sometimes even the school would ask for extra proof I was hers even tho her married name was on my contact info. My step sister had the same issue and even ended up legally changing her name back to her exes again just to keep the same one as her kid.",
              "id": 110,
              "comments": [
                {
                  "score": 7,
                  "content": "Fortunately, most places have come out of the 1940s and understand now that people get divorced/remarried… I’ve only had one or two comments in the almost ten years I’ve been divorced.",
                  "id": 111,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "My stepmother kept her first husband's last name because her kids have that name. When she married my father, she actually hyphenated both married names so she would share a last name with kids from both marriages.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I didn’t change my name during the divorce proceedings because it seemed like it would be a whole lot of hassle and for what? I wasn’t mad, just needed “out” There are days when I kinda wish I had. I wish I’d thought about it just a little more during the proceedings, because it’s relatively simple to do it right then. But now? It would be a self inflicted administrative nightmare.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "> Why should you have to change your name you've been using for the past 10 years?\n\n10 years that basically amount to OP's entire adult life. If they were married for 10 years and have been divorced for 2, then OP was 18 when they got married. That's the name she's used for any adult identity she's built.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 179,
      "content": "NTA. It *is* your name. I also kept my ex's last name after the divorce because my kids have that name.",
      "id": 115,
      "comments": [
        {
          "score": 72,
          "content": "Same here. NTA OP. I kept mine after the divorce cuz it’s too much trouble to change it and I’m lazy! We don’t even have kids but I don’t hate my ex. He gave me the name and I chose to take it. It’s mine! For all eternity! BWA HA HA HAAA",
          "id": 116,
          "comments": [
            {
              "score": 33,
              "content": "Lol. Changing your name legally is such a pain in the ass. When I remarried I just added my husband's last name to mine as a hyphenated name. If I divorce again I'm taking my Gramma's maiden name as my last name for all eternity.",
              "id": 117,
              "comments": [
                {
                  "score": 4,
                  "content": "One question as somebody from a culture with two surnames (father + mother) I understand that the change is a pain with bureaucracy but it you want to keep your surname the same as the children, wouldn't it be possible to change your and your children's? Or has it legal repercussions as the father not paying child support?",
                  "id": 118,
                  "comments": [
                    {
                      "score": 9,
                      "content": "It’s a expensive as hell, and the Ex would have to agree to it, and a judge would have to sign off on it. Changing your name as an adult is a hassle. Changing a kids name more so. OP would have to go through the legality 3x. Where I am that would be $800 x 3 just for the court paperwork for the kids.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Pretty sure dad would have to agree to the name change. Though I could be wrong, never changed a kid’s name, just my own.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Typically the father has to agree or it has to go before the courts. Not impossible but can be difficult",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Changing your name is always a pain in the ass, but there are few situations (marriage, divorce, and adoption) where it's easier because the change is basically preapproved and you just need to fill out the paperwork. Outside of those situations, in addition to the bureaucracy, you need to go in front of a judge and get the change approved.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Many states in the US have lowered burdens for changing a name when it’s in conjunction with a marriage license or a divorce decree. To change a name outside of these narrow circumstances requires a lot of hoops: going in front of a judge, a declaration that you’re not doing it to escape criminal charges or debts, and sometimes even publication of the name change in local newspapers. A judge could always say that you don’t have a “good” enough reason to change your name and not approve it. In a situation like that, where the father isn’t signing off on it, it would be next to impossible to change kids’ names, even if the name was being changed to their mother’s.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "That's very cost prohibitive. And my kids have a great relationship with their dad.",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I didn’t bother to change my name after I got divorced, either. I just wasn’t in the right space emotionally to take on one more hassle, and by the time I *was*, enough time had gone by that it would have been way more hassle than it was worth. \n\nI changed it when I got remarried.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I joke that the only thing my ex left me was his géneric last name.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "My mom kept her married name after my parents split, and it never occurred to me until a couple years ago (they divorced in the 90s) that she could have gone back. I wouldn't have blamed her, but I'm personally glad she didn't. My dad sucks, so to only share a last name with my shitty parent and not with the one I could actually count on would have made my childhood and adolescence just a little bit harder than they already were.\n\nIf my husband and I split up, even though my maiden name is an objectively better last name, I don't think I would change back, because I'd still personally want to have that in common with my child.",
          "id": 127,
          "comments": [
            {
              "score": 2,
              "content": "When I married I hyphenated my last name with my husband’s. When we divorced I went back to my maiden name alone. Interestingly, two of my three children have chosen to take my former married name (so, hyphenate their parents’ last names), and the third has chosen a different last name entirely. (They’re teenagers.)",
              "id": 128,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "My ex and his gf will pry that name from my cold, dead hands.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Same here.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "If you married again, would you still keep your ex husband's name, or change it to the new husband's name or perhaps another name?\n\nI'm curious to what people think.",
          "id": 131,
          "comments": [
            {
              "score": 2,
              "content": "I remarried and changed my name again, so I don’t have the same name as my first child anymore but I do have the same as my other kids.",
              "id": 132,
              "comments": [
                {
                  "score": 2,
                  "content": "Thanks\n\nThat's how my family was growing up too.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Me too. I don't like it but I plan on keeping it until my kids are out of high school. I just prefer having the same last name as them for now. It makes it easier when having meetings and even their doctor appointments.  I'm NC with the ex now but I'm keeping the name for two more years.\n\nNTA",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "My mum did the same when she divorced my Dad. They’ve been longer divorced than they were ever married now but whatever.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yes, me too. And all my educational and professional accomplishments are under that name! And all my work history! Why should I change my identity???",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 103,
      "content": "NTA\n\nMy husband’s ex-wife kept his last name because she hated her old last name and didn’t want to change it…..\n\nI kept my maiden name because of my own reasons and not wanting to change it….. \n\nMy husband couldn’t care less who has his name, lol.\n\nShe’s making a big, crazy deal out of nothing.",
      "id": 137,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 78,
      "content": "NTA There are many reasons to keep your married name after a divorce. I joined the military while married but separated. When I finally divorced, I didn't want to  get rid of the 'name recognition' that went with the married name. Ignore the ones who are saying otherwise.",
      "id": 138,
      "comments": [
        {
          "score": 20,
          "content": "This is why my MIL kept her married name, she had an established career with that name (in the late 60s). Getting reestablished as a known book designer would have set her back.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Exactly. Personally, I prefer to keep my ex's last name for legal and professional reasons. We don't have kids, so that wasn't a factor. But we were married for over 10 years from my mid 20s-30s, just as I was building my career. And changing your name on all your accounts and with various government agencies is a PITA.\nAlso, I'm a private person and I like to keep my personal and professional lives very separate. I absolutely HATE the idea that everyone on my contact lists would be alerted of my updated \"relationship status\" next time I send an email or they glance at the letterhead.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 62,
      "content": "NTA\nNot having the same last name as your children could become a problem- or at least annoying.\n\n\nAnd the name is yours. It has been for 10 years and to change it is nobodys business but yours.",
      "id": 141,
      "comments": [
        {
          "score": 9,
          "content": "Absolutely it could be a problem - especially if travelling abroad. I’ve heard stories where a mum with a different surname has been vigorously questioned at check in",
          "id": 142,
          "comments": [
            {
              "score": 7,
              "content": "I can attest to this. I went to Cuba with my children and it was a PROBLEM. I knew to have a ton of documentation including a certified letter translated into Spanish that my ex was giving me permission to travel to Cuba with them. Had their birth certificates translated. Still had a 2 hour delay in customs. Physically sweating my ass off and panicking the entire time since they pulled my kids into another room to talk to them.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "OP should also ask her if she wants her to swallow her kids back",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 58,
      "content": "NTA\n\nChanging your name is a pain in the ass and if you don't want to change it then don't.\n\nIt means you & your kids continue to have the same name.",
      "id": 145,
      "comments": [
        {
          "score": 31,
          "content": "Not to mention the expense of paying for a new driver's license and passport.",
          "id": 146,
          "comments": [
            {
              "score": 10,
              "content": "And the expense of a name change. If she had done it as part of the divorce proceedings, it likely wouldn't have cost anything additional other than the new documents. Now, it would be a legal name change with an additional court cost on top of those new documents.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}