{
  "post content": "My parents had me (16f) and my sister (14f). We lost our dad a few years ago. My mom has heavily favored my sister since she was born. To the point she has raised my sister to be a pretty shitty person to be around. At least she is to me. Dad noticed it and called mom out and at some point they did therapy where apparently it came to light that the grandmother she named me after, was a person my mom had a lot of resentment toward. Why she named me after her then I will never really know. She claimed not to realize at the time. But she at least has some resentment toward me based on that. She also had some PPD when I was born and claimed the early months with me were a very dark time. \n\nWhenever we fight, she takes my sisters side regardless of what happens. Sister takes food off my plate? Won't get in trouble. If I yell at her for it? I get punished. If I take food off my sisters plate in return? I get punished.\n\nSister takes something from my room? Nothing said. I bang on her door after she locked it and try to get it back? Punished for harassing my sister and making noise.\n\nI tell my mom about this stuff happening? She says something about learning how to share or my sister being the baby or my sister needing more so let it go.\n\nMy sister loves to gloat that mom loves her more. My sister has told me that mom has told her she loves her but tolerates me. My sister told me mom wishes I had died instead of dad. She told me they talk about that stuff. She also told me after dad died mom pulled all the money from my college savings and put it into hers.\n\nMy sister also lies to mom and claims I did stuff when she feels like I didn't get in enough trouble recently. In June she got me grounded for the whole month by breaking her laptop and claiming I had done it. She knew it would be believable too because I resented mom for buying my sister a brand new gaming laptop while I had to buy a really cheap second hand one myself, with money from my birthday and Christmas. Mom didn't even let me say anything and my sister gloated that mom will always believe her over me.\n\nIt came to my mom's attention a few months ago that my sister is struggling in school in a couple of places and she can't seem to catch back up easily. But I always had good grades. I could even graduate early in theory, if my school offered that. They don't. My mom is aware of this from past years. So she told me a couple of weeks ago that I need to start tutoring my sister before she gets into a hole she can't climb out of. I told my mom I won't help my sister. Mom told me I will and it's my duty to help. I told her to spend money on a tutor for her favorite daughter because I won't do a thing to help either of them with this. I told her they don't deserve my help.\n\nMom asked how I could put my sister's future at risk. I shrugged. Mom called me names and slammed a door when she left me. The tension is high because of this and my sister is loving it. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 9450,
      "content": "NTA\n\nTell her you don't have the time. Since she allegedly took everything from your college fund, you need to work extra hard for scholarships. Your sister has a cushion you don't. \n\nWhen and if she denies, bring up all the lies your sister has told you. It's ugly, but a necessary fight. You can finally know if they were lies or not. \n\nIf she doesn't deny the allegations tho, just walk out. Stay in the library longer, or think of getting a part-time job. Anything to avoid them.\n\nStand your ground tho. Your sister will put all potential fuck ups on your head. You don't wanna be responsible for her grades or future. The duo will likely harrass you for the rest of your life saying her life is shit coz you intentionally sabotaged it or something. She likely wll ruin it out of spite just like her laptop. Stay as far away from it as possible.",
      "id": 2,
      "comments": [
        {
          "score": 5002,
          "content": "The sad thing is, I believe what my sister told me or at least that there's a lot more truth than lie in there. Most people would say don't believe that of your parents/parent. But I believe it based off of my experiences with my mom.\n\nI had a part time job for a while until my mom called and got me fired from it.",
          "id": 3,
          "comments": [
            {
              "score": 2436,
              "content": "What even for? You aren't allowed to work? \n\nJust use this as an opportunity to clear the air, instead of living in doubt. You will have a clearer picture of what to do next, for YOUR career and life. Figure out how. \n\nCheer up, even if they don't love you, there's one person who always will. Yourself. Your dad had such faith in you too. You have great potential. Don't let them squander it, live your life. You matter. There's whole wide world outside your mom/sis drama.",
              "id": 4,
              "comments": [
                {
                  "score": 3188,
                  "content": "She said it was because I refused to use the small discount I got where I worked and bring stuff home for my sister when I finished each day. But I think my mom just hated that I got the job in the first place and was doing alright. Or maybe both. If I had been pampering her little spoiled princess maybe I would have been allowed to keep working.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1677,
                      "content": "Don't go back, look forward. Stay back in school, or form a study group or something for SATs. Again, the drama your sister thinks is the entire world, will prove to be immaterial very soon. Ignore and look at the bigger picture. \n\nLet that little brat figure out her own life. If she can concoct such elaborate lies and schemes and emotional manipulate both you and your mom(not saying she's a saint) she can figure out a few classes. \n\nBe your own number one priority ❤️",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 393,
                      "content": "get another one and bullshit it . Don't give her any details on the job. Speak to your equivalent of social services  if you need to .  The tactic of getting you fired to make you financially dependent on her is financial abuse.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 294,
                      "content": "Offer tutoring services for a fee. Don't tell your mom you're being paid for them. Keep an eye on your credit just in case she takes cards out in your name, and if your father had a lawyer or someone he put in charge of the estate, talk to them about what's been going on.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 195,
                      "content": "NTA. Laugh your head off when you get out of there and your sister has nobody else to take her meanness out on than your mom. It's going to be glorious.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 146,
                      "content": "You are suffering from controlling abuse from both your mother and sister.\n\nYour mother doesn't realise your sister will abuse her just as quickly.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 129,
                      "content": "OP, be aware that when you turn 18 or when you graduate, your mom will kick you out.\n\nFind your paperwork (birth certificate, SS card, etc) and hide it somewhere or ALWAYS keep it on your person. \n\n(or comparable if you are outside the US)",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 89,
                      "content": "I promise you'll enjoy watching your sister fail at life soon. Keep us updated.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 76,
                      "content": "Do you have a relative or teacher at school you can openly talk about this with?  It is such a bad situation for you and what they are doing is at least mental abuse! Can you try to stay with a relative or get CPS involved to get out of there? Try to make recordings too, so you have prove.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "Document every single shitty thing your sister and mom do to you. Do it in a way they cannot access, delete, or steal (online blog/diary, texts, whatever). Record your sister saying those shitty things to you (do it in a way she doesn't know about). Even if your mom listens and refuses to punish your sister, when you leave you can play those recordings back to anyone who doesn't believe you and tries to let them harass you. (Police, school, job, extended family etc). You can record your mom screaming about it too. You don't deserve this. Protect yourself. Also don't worry about recording laws, it's not like you're using it in court. You're using it just to prove to the people who may harass you once your mom loses her punching bag (when you graduate and move out).",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "Get your birth certificate, ss card, bank info if you have it and pay $50 for a safe deposit box at a bank.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "She's tried to clear the air, she has YEARS of being told she's lying and not being believed. One more fight isn't going to fix things.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "some parents are just psychotic like that. they get off on controlling and abusing their kids. it's honestly really depressing how many kids get fucked over in life because they were unlucky and got a nutcase for a parent.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 224,
              "content": "Do you have grandparents? Aunts? Uncles? Anyone you can get involved to shame your mother and knock some sense into her?",
              "id": 18,
              "comments": [
                {
                  "score": 512,
                  "content": "Technically I do on my dad's side but they don't want to know me. I was conceived before my parents were married, they wanted nothing to do with my dad after that. They didn't even come to his funeral. So I can't turn to them. My mom has a sister but she's a shitty person and wouldn't help anyone let alone me.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 97,
                      "content": "What's the source of your information about your dad's parents and your mom's sister?  I'm thinking it is likely your mom, or your mom has embellished the basic story.  Why would you believe her given the way she behaves toward you?  You may want to cautiously reach out to them and see what kind of response you get.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 68,
                      "content": "I really do have sympathy for you. It seems that your dad saw what was happening. You said you don't have any family to help you, do you have any really good friends you could turn to? Any parents up your school who could maybe help or teachers? \n\nI honestly think your best bet is to leave these people behind as soon as you're able to do so. As another post said, these people will continue to bring you down and blame you for everything. \n\nAs your doin well in school use this time now to look funding, grants ect for college. Work your ass off to get these grades and get into college. If possible, find another job to start saving a small fund. \n\nThe best revenge is success!! Be great, do great, and become someone you are proud of, and when you finally become stable and independent, watch them try to gain access back into your life. They will most likely want money or help with something , by the sound of it, your sister isn't gonna have any type of skills to make it in life without mommy. When that day comes, stand tall and tell them where to go!.. \n\n\nTry to gather and collect all important documents. Maybe lock down credit, etc. I would not be surprised if your mom for got loans in your name for your sister.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Dear OP you are NTA and bravo you stood for yourself. I may not have kids but I want to tell you something: You are NOT responsible for your sister's academic progress and you are NOT responsible in tutoring her either. You are actually right that she needs a proper tutor but mum is not listening to you. My sympathy goes to you and I am truly sorry that your mum is parentifying you and treating you badly \n\n\n OP, you may think this is a totally unfair world to you but remember to seek help. Do not suffer in silence but please talk to your teacher, a friend's parent, a school counsellor or someone at a local teen/child community organisation. If you ask them whether you are responsible for sister's academic progress, they will agree with what I said. I want you to remember this: telling a trusted adult about your mistreatment at mum's hand is not airing dirty laundry. Do not let anyone tell you that because anyone who claims that talking to someone about being mistreated by a family member will bring disgrace is actually enabling familial abuse. Speaking out is seeking help \n\n\n You said that you have good grades right? Since you said you are 16 now time is of the essence and you must taken action quickly. Talk to your school counsellor or teacher into looking for grants, scholarships and bursaries that can help you to cover your studies when you enter university or vocational school. Any application to uni or vocational school as well as scholarship approval letters should be posted to a safe address e.g. friend's address, employment address or school address so that mum does not sabotage your chances by hiding the mail or lying to the university that you decline the offer\n\n\n Are you also working part-time? If you are, do make sure you talk to your employer or a trusted coworker to get a bit of moral support and at the same time work hard to prove you are a capable part-time worker \n\n\n My next advice to you about what you need to do the moment you turn 18 two years from now: if you plan to move out by the time you turn 18, you best do it at least three or four months before turning 18 by slowly moving out your stuff (e.g. school certificates, awards, clothes) little by little and get your friends to store them temporarily for safe keeping. That way you will not go on panic mode on the day you leave. Crash with friends for a couple weeks or months until you find a suitable place to live and rent \n\n\n Make sure you don't just get important documents before leaving but also do a full credit check to make sure your mum is not commiting identity theft under your name to apply for loans or credit cards just to feed your sister. Getting a dented credit history no thanks to identity fraud/theft is no laughing matter. Once you get all that done, do consider seeking legal advice to create a will with ironclad rules to ensure that whatever money you earn right now and in the past few years will not fall into mother and sister should something happen to you \n\n\n When you get out at 18, try and find out if you can change your social security number and protect your bank account too. OP I am not sure if you like the name you were named after your grandmother, if you want to legally change it to make yourself happy then go for it when you are 18. But if you are happy with that name I want you to know this: a name after a person does not define you. Then again it is up to you \n\n\n You wrote about your sister's behaviour right? I bet she behaves the same towards her own schoolmates. Focus on your academics and tell yourself that you are doing it for yourself and sister's failures are none of your responsibilities. Tell yourself that sister is responsible for her actions alone. I can promise you this: one day when you go far in life, she will not progress much. If she and mother deearest blame you for sister's failure, ignore them \n\n\n Lastly, don't forget to seek counselling to maintain your mental health as well. Hang in there OP and give us an update ",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Damn, I'm so sorry you are going through that",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "So no family. Any friends with great parents?",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -132,
                      "content": "Maybe you could try getting in touch with them anyway? Try to ingratiate a bit, that you know what your parents did was wrong, but you feel very alone and want a real family? If they're religious they might come onto your mum like a ton of bricks.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 178,
              "content": "Your mom and sister sound REALLY damaged. I am so sorry you are dealing with this.\n\nKeep your grades up so you can get a scholarship and get out of there.  Your life will improve so much when you get away from that toxic environment.",
              "id": 26,
              "comments": [
                {
                  "score": 133,
                  "content": "AND have college acceptance letters sent to a friend's house so mommy dearest doesn't know where she went!",
                  "id": 27,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Even with scholarships, you have to fill out the FAFSA. It will come out.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Your mom will try to ruin your hope of college, too. You may have to speak to college admissions staff and have your info password protected if that is possible.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "Your mom can only punish you if you let her. Like take being grounded, if she's not physically there, she can't stop you. If she puts hands on you call CPS, there are many things you can do to make life difficult for your mother but sometimes it's not worth the fight\n\nHave you grand parents or relatives you could stay with? It's easier than fighting the fight",
              "id": 30,
              "comments": [
                {
                  "score": 94,
                  "content": "In another comment OP said her mother got her fired from her job, so it seems the mother will lie in order to punish her however  she sees fit.\n\nIt really is no surprise that the sister is lying to get OP into trouble.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "That is simply not true. A parent has a lot of legal power over their child, and OP shouldn't jeopridize her future trying to score points over their mother. She already got OP fired by lying, but she probably didn't even need to lie; if a parent says they don't want their minor child working, they probably can just forbid it, and in any case most employers wouldn't want the hassle. Sadly, the best option OP has is to keep their head down and work towards leaving the mother's house as soon as possible.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "In the U.S., parents are allowed to hit their minor children.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Shit seriously? That's unfortunate. I'm guessing any call that got CPS out would still be a pain in the ass but yeah, I'm not from there",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "Find out for sure then I'd apply for a different job one that doesn't have a discount. At 16 I was able to work in a nursing home as a CNA and you can tell them what your mom did at your last job. Not that there are any discounts to be had at a nursing home. It literally sounds like your mom wants to ruin your life. Is there a counselor or trusted teacher you can talk to?",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Get emancipated. Your story reached Facebook, everyone is saying the same thing there. You deserve more. I’m a mother and I would never dream of treating a child that way. You shouldn’t either.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Keep us updated.",
              "id": 37,
              "comments": [
                {
                  "score": 8,
                  "content": "This, please!",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "What did your mother say to get you fired?",
              "id": 39,
              "comments": [
                {
                  "score": 148,
                  "content": "She demanded it and said she would not leave them alone until they let me go.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 140,
                      "content": "That was still shitty on your jobs part. They could have just called the cops on her for harassing them . Oh, I am so sorry that happened. Maybe there's a guidance counselor at your school you can talk to about the situation. Just hold on for two more years get good grades. I feel you can do it. I'm rooting for you.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "She probably didn't want you taking steps towards independence from her. If you start getting work experience now, when you graduate HS you'll have more job prospects and earning potential.\n\nI'm sure she is terrified that you'll move out when you graduate / turn 18, and she'll do anything in her power to prevent that. If you don't have any income it'll be much more difficult to get an apartment. Don't let her keep you trapped in the hell she is creating for you.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "I am so sorry you are going through this. You are probably a very honest person, so this is not going to be easy, but you are going to have to learn to lie lie lie. If you get caught in your lies, you will be punished, yes- but you’re getting punished anyway for doing everything right. \n\nYour family is going to try very hard to hold onto you, especially the closer you get to independence. You have been living through hell but you are very very close to getting free. They don’t want you to get free. But they don’t want you to have a happy life, so what they want doesn’t matter.\n\nI want you to lie about your job and I want you to lie about you college applications. If you tell them that you’re keeping your applications private, they will work very hard to find out where you are applying and sabotage you. So you need to apply to some nearby colleges and tell them you would never dream of going away from your family (or whatever you think is believable) WHILE AT THE SAME TIME opening a PO Box where your real college acceptance letters are going to arrive. If they don’t know about them, they can’t sabotage them. \n\nYou also need a fake job and/or after-school obligation. Maybe it’s something you do occasionally (mine was Bell Choir lol). That’s where you say you are when you’re actually at your new job. \n\nYou do NOT deserve this treatment in any way. Please PLEASE keep your eyes on the future. This is going to suck for a few more years but you can get free, get a job, make your own money to play for your own place and your own therapy (do not trust guidance counselors or anyone affiliated with your school at this point- you may have rights to privacy but they are more concerned about your mom suing them than a kid getting a lawyer). Picture what you want your future to look like and lie lie lie to get there. You can go back to being an honest person after you escape living in hell.\n\nAlso please be very cautious with drugs and alcohol. Your situation is painful and anyone would want the escape that substances can offer but it would be easy to get addicted when your day to day life is so challenging.\n\nYou can do this. I don’t know you but I believe in you. ❤️❤️❤️❤️",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "OP. \n\nPlease look into how to gain legal emancipation. \n\nThere are stories about parents who will refuse to give their tax information to their children and that it SIGNIFICANTLY crippled their ability to go to college.\n\nYou need something called the FAFSA to apply for government student loans and they use your parents' financial information until you're 25 years old. This is for all colleges in the United States too, btw.\n\nDon't allow her to win. \n\nI don't know how the process starts, but you have to at least look.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Op you are NTA. I'm so sorry for what you are dealing with. I believe you and understand you for believing what your sister has told you. I can relate to you cause my mother used to tell me to my face how much she didn't want me. Most ppl will always tell you/make excuses/advice you and even try to convince you to not believe it. They will tell you to be the better person. That you need to forgive cause she will always be your mother.  They are partly right. Your mother will always be your mother.  Also you do need to learn  to forgive her, but only when you are ready.  But when you are actually ready to forgive either of them. Make sure you forgive them not to make then feel bette. When you're ready you forgive them for you. You forgive them cause you are ready to move past them and live your best life. Please remember that forgiveness does not mean you have forgotten.  It also doesn't mean that just cause you forgave them they will be allowed back into your life. Just cause they are blood don't mean they are family.  Don't let anyone guilt you with the \"cause family \" bullish. I sincerely wish you the best. I'll be your reddit mom and reach out if you need to vent, or just need some encouragement.",
              "id": 45,
              "comments": [
                {
                  "score": 5,
                  "content": "And for this level of abuse, I’d expect that feeling of forgiveness and understanding to be appropriate when OP is about 30 or 40 yo. Until then she will be too busy building a life despite her own family’s sabotage.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You are right. I did so in my 30s. It took me a while to realize I could just let go and move on with my life.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Do you have any other relatives you can go and live with. You really need to get out of their as I can only see things getting worse.",
              "id": 48,
              "comments": [
                {
                  "score": 67,
                  "content": "No, my mom has a sister but she's as shitty or maybe even worse, than my mom.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I just want to tell you that I admire you.  I was not able to put the limit you’re putting now until my twenties, you’re really brave and have a shining spine. \n\nDo you have some place where you can pass the time so you’re not home so much time? I think if you start spending more time at school, at friends or the library and do it a routine you should be able to get a job in couple months following that same routine and your family doesn’t need to know, it’s what I did and it helped a lot, if you cannot get a formal work because of paperwork or something you can find a couple tutoring gigs or babysitting.\n\nI really wish you the best, I’m sure you can do it, 2 years seems like a lot but in reality is not and you’re almost out. \n\nPs: once you’re free of all this try to get therapy because it really messes up even if we don’t notice it now.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Along with emancipation, you can also look into what would happen if you just left home and didn't return. Basically a runaway. Every state will be different with that. In our state, it used to be that as long as you are 17, you can leave home and the cops will do nothing about it. Parents can try to drag you back home but cops won't intervene. If you commit a crime during this time before you turn 18, you will get tried as an adult. You can call your local city or county police to get their answer on this and also call CPS to get their answer. As others have said, get your documents. Store them at a friend's home in a small lockbox. Get in touch with the credit reporting agencies and have them freeze/lockdown your info. You may be able to do this online but not sure since you're still a minor. Might have to call. Cut your egg donor and egg sibling out of your life as soon as you can. As for FAFSA, I  would see what the conditions are for not reporting a parents earnings. I know emancipation is one of them. In the meantime, remember to love yourself and keep your studies up. Best wishes to you.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "This! Start planning your escape now. Find out if you can live with your extended family the last two years.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1644,
      "content": "Wow. Your mom sounds awful. You can emancipate at 16. If it was something that could work out for you. Cause that situation sounds terrible and any kid should be with people who love and respect them. NTA.",
      "id": 53,
      "comments": [
        {
          "score": 1156,
          "content": "Emancipation is not an option for me. I have researched and asked a lawyer I know. In other states I would have a chance but we really only allow it in a select few cases.",
          "id": 54,
          "comments": [
            {
              "score": 606,
              "content": "As a mother your post and your life breaks my heart, no mother should treat their child like you are being treated. \nHave you any grandparents, aunts or uncles on your father's side that you can talk to or that will take you in. \nYou should tell your mother your sister told you that she put your college fund into her golden failure at school child and therefore you are not doing anything to help your spoiled brat of a sister. If you help your sister and she still gets low grades you will be blamed, not her.",
              "id": 55,
              "comments": [
                {
                  "score": 727,
                  "content": "I don't. My dad's side of the family is very religious and they wanted nothing to do with my dad or me because I was conceived before my parents were married. They didn't even come to my dad's funeral.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 310,
                      "content": "Oh no, that's absolutely awful. Does your school have a councillor you can talk too? You do need someone you can talk too about your mother and sister and how you are treated, they may be able to help. You are a good student, hopefully you'll get far away from them when you go to college .",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 119,
                      "content": "You are in a very vulnerable situation as it is, don't invite back more trouble into your life! Be careful who you trust tho, don't let anyone take advantage of your position.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 77,
                      "content": "Dude I would lie and say you are seeking salvation or whatever bs you can come up with to escape.\n\nI’m team you.\n\nIf I were you I would actually take notes from your sister. Don’t be mad or feel angry about all this just keep a chip on your shoulder and brush off their bs.\n\nNo reactions no interactions beyond what is necessary. Stonewall the fuck out of them until you can escape.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "You are surrounded by shitty people, but the great news is that you'll be out in just a couple of years.\n\nFor college, get a P.O. box for your mail so your mom and sister won't sabotage you. Or a good friend with good parents who will let you use their address. Or check with your school for other options. \n\nMake sure no one has access to your email but you, and set up the multi-factor authentication sign-in for them (do this with all things in your life; bank, email, everything.)\n\nTry to obtain all your important paperwork (birth certificate, social security card, etc.) and keep those in a secret place only you can access. \n\nWhen you're old enough to get a bank account, get a lockbox as well and put your important paperwork and sentimental items in there. Turn on all the notifications for your bank account, especially withdrawals and debits.\n\nKeep your life as private from them as possible because they will try and blow up your chances for college. Look up the \"grey rock method\" and apply that to your family.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Do you have a bank account in your name only that your mom doesn't have access to? That's a good place to start. Make sure you have important records stashed away, too: birth certificate, social security, medical records if possible. Either hidden in a safe place or left with someone you can trust.maybe a friend or councillor. Idk if you can get a p.o box or someplace outside the home to store things, but this could keepnyour mom or sister from stealing things you'll need to escape and gain independence.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "So, they value their personal relationship with their imaginary friend over their relationship with an actual person? An imaginary person who preached against judging others? I guess that they meet with their fellow travelers once a week to congratulate themselves for being a member of the winning team while completely ignoring every aspect of human decency for the rest of the hours of their week. They talk the talk without walking the walk. I have no respect whatsoever for your paternal grandparents. You are NTA. Your mother is an abuser.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Maybe you have a good friend whose family would let you live with them?",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -14,
                      "content": "You can 'agree' with them. What they did was wrong. Having a kid before beeing married. I don't care if you think that's true. But you can get them on your side now. Get their support against your mom\n\nJust play it smart now",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "This sounds horrible but I got married as a 17 year old to become “emancipated” because I was also in a state that was anti-emancipation. Best thing that ever happened to me tho tbh.",
              "id": 65,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "Hey, do you have any friends whose families might be willing to help you? Even just providing you with a safe space to store a few important things or hang out after school so you can avoid being home?\n\nAnd nta. Not ever.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Then start documenting every incident without them knowing and show it to the lawyer. Guaranteed you’ll win the case and get emancipated.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "She said her mom got her fired. To be emancipated you have to prove you are providing for all your own needs….including working. My best friend went through this at 16. He had his own apartment and job as his mom abandoned him. ",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "In the US emancipation is almost impossible, and usually takes longer than just waiting for turning 18.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1015,
      "content": "NTA.\n\nInstead of telling your mum it’s about favouritism, tell your mum that you aren’t a good teacher, and that your sister deserves ‘the best’ and that you don’t want to be responsible for her grades because you know that ’the dynamic between you isn’t conducive to learning’.And then don’t do it. Because it’s shitty. (This is the hogwash she can lap up because it suits the narrative she already carries right? Not a good truth but a believable one for her.) \n\nHold on hon, in a few short years you will be able to grab your college fund, and hopefully a scholarship and bug out of there fast. Do so. You deserve the best.",
      "id": 70,
      "comments": [
        {
          "score": 334,
          "content": "I agree with this. Just for your peace of mind, play the game. \" I'm not a good teacher \"\n\nTell your sister your mom doesn't love you enough to get you a tutor . Haha\n\nFind something extra curricular in something you're really really good at and let faculty endorse you in a program or volunteering or some valid stuff that gets you out of the house.\n\n2 more years. Focus and know that you're good. Let their words flow into one ear and out the next. Prep to work at 18 and be self supporting since emancipation is not an option.\n\nYou can do this. I was lumped in the home of a relative for college, was considered the lesser and uglier one (all cousins were around my age) and boy, it was a hard 4 years. I feel you to some extent.\n\nNTA",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "It's also 100% true. Sister won't learn anything from OP.\n\nSure, it leaves out a few \"details\", like that the dynamic between the parent and the tutor is the main thing that makes learning impossible. Or that it's the parent's desire for \"good grades\" rather than genuine learning that will make learning impossible and put both tutor and tutee at risk of committing academic fraud. Or that the \"best\" tutors will never accept her as a student.",
          "id": 72,
          "comments": [
            {
              "score": 29,
              "content": "Absolutely this, it would also be another opportunity to blame OP to boot.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I'm wondering if mom really expects Op to tutor the sister and help her learn or if she just wants Op to do all the homework for her to improve her grades. Either way, it will definitely be Op's fault when the tutoring doesn't work.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "If they are in the US,  does mom receive Social Security because Dad has died?    If OP moves out, does mom lose that?  It could be why she got OP fired. No  escape funds.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 468,
      "content": "Tell your mom to eat a shit sandwich. If you are in the US you can actually take your GED at 16, I got mine at 17. Luckily my Dad's cousin was on the GA Board of Regents, so he greased the wheels for me. As soon as I took it (and passed with the highest scores they had seen on a GED at the center where I took it!)I enrolled in college and that was the END of living in my Dad's house, I never went back! I think you have to get parental permission but if you put it like, hey I can go to college NOW and be out of your house your mom might go for it. Meanwhile, I'm sending healing and the light of protection. Best wishes!🤍🙏🌛🌝🌜\nNTA",
      "id": 76,
      "comments": [
        {
          "score": 213,
          "content": "Her mother is exactly the type of person who would deny permission, unfortunately ",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 197,
          "content": "OPs mother doesn't want her out of the house; she wants her nice and close to take out her misery and resentment onto.",
          "id": 78,
          "comments": [
            {
              "score": 75,
              "content": "Yep, she doesn't want to get rid of OP, she wants OP close to torture her. That makes me believe the sister was telling the truth about the things the mother said to her. She's a monster and is raising another monster.",
              "id": 79,
              "comments": [
                {
                  "score": 32,
                  "content": "If sister ever breaks the law because she’s spoiled, they want OP close enough to blame.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "OP could sign her mom’s name on the GED form if mom refuses. It’s not the best idea, but it’s what I had to do to get my drivers license because my parents wouldn’t do it.",
          "id": 81,
          "comments": [
            {
              "score": 25,
              "content": "Sometimes it's a \"By any means necessary\" situation",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "She will need to talk with the school counselor and get them on board.  They could help her set up a solid plan to take the test/graduate, fill out scholarships, and college admissions.\nHell - she can call CPS and they might help her.\nMaybe even a lawyer to get help her get away from her mom via that route (maybe they can get the college money back in place and freeze withdrawals to the account).\nHer mom will fight - especially if her mom collects the Social Security benefits for them.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I wish, but it seems like her mother *wants* her to languish there.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 424,
      "content": "If you're advanced enough in your current classes, talk to your teachers/ counselor/ principal about taking classes at a community collegethat can be counted for high school and college credits. I've heard of people doing this so that when they graduate high school, they qualify (fully or partially) for their associates degree in college",
      "id": 85,
      "comments": [
        {
          "score": 127,
          "content": "Advanced placement classes do this as well. I had almost my first year of college done because I took so many AP classes.",
          "id": 86,
          "comments": [
            {
              "score": 72,
              "content": "If she does dual enrollment with a community college, she could possibly graduate high school with an associate’s degree as well.\n\nShe can also look into taking CLEP exams to gain college credit without the courses.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "AP classes are far more work and not a guaranteed pass with the test than community college. They also aren’t guaranteed to be accepted at all universities. \n\nIf she can do community college it’s a better way to spend her time. \n\n(Source: former ap teacher)",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "That’s such a good way.  Also, the college classes where I live are free while in high school.  Some of the general classes done and free by the time OP graduates",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Do this!  If mom actually moved the college fund, any credits you can get now will be credits you don’t need to take a loan out for.  Dual enrollment is often free of charge, so seriously look into this!",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 223,
      "content": "NTA - Go live with another relative?\n\nI personally would sabotage both of them every chance i got because this environment is awful and they deserve it and then just walk out on them",
      "id": 91,
      "comments": [
        {
          "score": 286,
          "content": "I don't have another relative to live with but I wish I had.",
          "id": 92,
          "comments": [
            {
              "score": 54,
              "content": "That was gonna be my question. If you had a grandma or aunt that could take you in. You are gonna have to prepare for a long future of them being against you if you choose to keep them in your lives into adulthood. Start recording conversations. Document her lies. She can't fight a voice recording of her saying she's gonna sabotage you.",
              "id": 93,
              "comments": [
                {
                  "score": 1,
                  "content": "You need to make sure that it is either a one party state or you have permission to do it, because she can fight it if you don’t have consent. ",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -18,
                  "content": "i wish you the best OP,  maybe go live with a boyfriend or something? i know doing that at 16 is a little iffy but probably no worse than this shit show you are in now.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Going to live with a bf at this point of her life is one of the worst advices ever. Do you want her to move from one trap to an other??  \n\n\n There is no decent extended family. \nOp, it is difficult but you have to think long-term. You need to study hard and gather some money. I hope American redditors  may know some resources. What I can tell you, if you can't leave your house to move to a safe space for you ( absolutely not moving with a boyfriend) keep a low profile at home, try to be on your mom's sunny side. Use flattering, greyrocking, whatever helps. Visit the channel for chidren with narcissistic parents. Stay strong, until you can say goodbye to both of them.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Your mom is doing a really shitty job at parenting, even if *some* of the things your sister has said are lies. You deserve love and fairness from your family, and I'm so sorry you don't have that right now. OP, please hear me: There **IS** a light at the end of this tunnel. The clock is ticking on how much longer you're required to be immersed in their cruel BS. On the hardest of days, remind yourself of that and **don't give up**. You will make your life's second act a great one!\n\n\nEdit: NTA obvs ",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "How about a friend whose parents would allow you to stay with them - even just weekends or a few nights a week. A place to store anything valuable at least? I’m so sorry this has happened to you. You deserve a loving family.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Out out feelers to adult cousins if you know any of their names. I guarantee at least one of the cousins is either excommunicated from the family or doesn't believe the religious crap and might be willing to help you. Or the parents of a friend from school might help once you are 18.\n\n\nRegardless, find or get copies of your birth certificate, Social Security card, and passport. Get them somewhere safe. Then check your credit, but be ready and willing to follow thru with identify theft charges if your mom has used your identity for credit cards or loans.\n\n\nOh, and NTA.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "You seem to be doing well in school so make sure you take advantage of grants and FAFSA if possible when college comes around. Talk to your counselors and explain your situation. Unfortunately you’ll have to tough through it with your mom until you graduate but there are a lot of options available to students like you to be supported through college.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Any friends.",
              "id": 101,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "There may be youth shelters in your area you can reach out to. ",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 33,
          "content": "I also vote for sabotage. I grew up in a cult with an extremely overbearing mother and those little bits of revenge I got were the only thing that kept me saying until I escaped for college",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Read this thread again. It has been mentioned several times that she\n Does NOT have another relative.",
          "id": 104,
          "comments": [
            {
              "score": 3,
              "content": "When he posted 9 hours ago, it hadn't been. OP's response to this person was the first time it was mentioned.",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 195,
      "content": "NTA\n\nI'd tell her that you've been informed by sis that you have no college education fund and since mumsie believes sister dearest in all things, you believe this to be true, too.  Therefore, you can't tutor her, because you'll need to prepare to be on your own for college.  This means scholarships and grants and whatever good grades will get you.\n\nI have no good words for your family.  May you be blessed with found family.  And therapy.\n\nI wish you well.",
      "id": 106,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 89,
      "content": "NTA\n\nI'm so sorry you're in this situation, and that the one person who could have seen the truth is gone. You're so strong!\n\nYour mom is taking further advantage of the fact that you are nothing like the two of them. If your sister is loving the tension being high because of your refusal to help, she's jeopardizing her future without doing poorly in school. But, your mom knows you won't sabotage your sister. Still, that doesn't mean you can't remind her that if you're tutoring your sister you certainly have the power and brains to sabotage her and she'll be too stupid to figure it out. Or lay down conditions about what each tutoring session will cost (a written apology, sister doing your laundry with threat of paying for anything she damages, mom cooking your favorite food that sister hates...I'm petty but I don't like blatantly hurtful disrespectful behavior and I'm pissed on your behalf).\n\nYou're going to leave them eating your dust one day. I hope that day comes very soon. Good luck.",
      "id": 107,
      "comments": [
        {
          "score": 17,
          "content": "OP may not sabotage her sister, but I wouldn't trust that the sister would cooperate with the tutoring. Since the sister lives getting OP in trouble. I would refuse based on the fact that mother should get sister a tutor that sister will listen to.",
          "id": 108,
          "comments": [
            {
              "score": 3,
              "content": ">OP may not sabotage her sister, but I wouldn't trust that the sister would cooperate with the tutoring.\n\nI wouldn't put it past the sister to try to sabotage OP, and I absolutely agree OP shouldn't do it. \n\nI would just like the family getting a bit of a reality check. They're not likely to agree to any of these hypothetical conditions, and OP definitely should reject even if they do It would be nice to remind them that what they're mistaking for weakness is just OP being a better person, and that beggars shouldn't be choosers.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 72,
      "content": "NTA, it Sounds like you'll be going to college far, far away and never coming back if Mom keeps this up.",
      "id": 110,
      "comments": [
        {
          "score": 21,
          "content": "[deleted]",
          "id": 111,
          "comments": [
            {
              "score": 2,
              "content": "You aren't wrong. I wouldn't blame OP for walking out now and never looking back.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 62,
      "content": "NTA, but if you have any other family members to turn to who you can trust, go and tell them EVERYTHING that has been happening, especially since your dad died. Get their help with opening a new bank account in a different bank from where your mother and sister bank and transfer everything but $5 to it and make sure any money that was going into that account now goes directly into the new account. And get their help in locking down your credit today. Find all your important documents and give them to a trusted adult. If your extended family support you, see if you can spend more time with them and use that time to get another job. Start planning your exit strategy and once you turn 18, leave. Get a new number and stress that anyone who gives your number to your \"mother\" and \"sister\" will no longer have contact with you. New emails and social media accounts too (use a nickname for social media to make it harder for them to find you and don't use your own photo for the profile picture).",
      "id": 113,
      "comments": [
        {
          "score": 165,
          "content": "I don't have extended family I trust and feel would support me. I'm basically on my own with this. I have friends but they can't really do anything to help me. Just the way it is for now. I want to make my own family in the future.",
          "id": 114,
          "comments": [
            {
              "score": 111,
              "content": "Talk to the parent of a friend you trust the most. Explain that you are being emotionally abused and you need help leaving home for university as soon as possible. \n\nYou could possibly test out of school and go to university early. Speak to a school counselor and a university counselor. Don’t take one person’s word as gospel.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Is your school guidance counselor a decent person? Because they can be super helpful",
              "id": 116,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "You have a fine head on your shoulders. It does get better. NTA, obviously. Go no contact with all these people as soon as you're out and safe and have your own resources. New number, new email, don't tell them where you work or what college or where you're living. Let all your friends know to not share any information with anyone, not just them. Do this because they sound very interested in wrecking any good things you manage to do for yourself.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Then you need only hang on for what? 2 years, tops? You can do that while planning your escape.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}