{
  "post content": "I'm sorry if the title isn't accurate, I can't think of another description to describe the \"training\".\n\nMy cousin Amy (25F) has (6M) twins and has a nasty habit of dumping them onto relatives to babysit for the entire day without any warning or regard for their time. I (27F) have a very strained relationship with her but because my mom's side of the family demands that we all remain close-knit, so I have no choice to tolerate her.\n\nWhen she initially gave birth to them, she teased me that I'll have to take on babysitting duty from now on. I'm no good with kids, so I remarked to her that if I ever have them, I'll train them, not babysit. She brushed me off.\n\nThe kids now are hella destructive and loud. Pulling out stuffing inside furniture, holes inside walls, smashing anything glass and porcelain, screaming louder than a fire alarm, you name it. When it was my first turn to deal with them, I immediately walked with them to the store and grabbed the biggest bag of M&M's I could find and trained them so that every time they follow my orders and behave, they get one. If they misbehave, I get one.\n\nSoon enough, every time the kids were dumped on me, they went with my guidelines and behaved. Whenever I say sit, they sit at the table. When I say stay, they don't leave that spot, etc.\n\nTwo days ago there was a party planned with the whole extended family (I know, pandemic. Didn't want to, but mom insisted) and I grabbed the M&M's since the twins were there. Arrived, twins were being so destructive (an entire tray of food was spilled) that all the adults had enough and yelled at Amy to control them. She vomited the same excuse of them just being kids and they'll grow out of it eventually.\n\nI shouted the twins' names and shook my M&M bag. They came running over to me and I popped 6  pieces into my mouth for their misbehavior. I told them to go clean up the mess or no candy all night. They do so.\n\nHalfway through the party, every time something similar came up or they just weren't behaving, I was the one able to calm them down. When Amy saw what I was doing, she got angry and started yelling at me about how her children aren't animals and that I shouldn't be giving them so much candy anyway. I told her that I'm their aunt, not their parent, why am I the one disciplining them? Isn't that her job?\n\nShe screamed the same argument at me and since she's their mother, to stop giving them candy. One of the twins overheard and went apeshit. Dashed straight into the kitchen and started shattering anything they can get his hands on, shouting over and over that he wants candy. His twin joined him soon after. \n\nI repeated that she's their mother, and just sat in the living room watching it all unfold. At the end, Amy blamed me for them turning out this way. The other relatives she dumped them on (a majority) disagreed, but when I told a friend about the situation, he told me that the training I did can really fuck up the kids mentally later in life. \n\nSo, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 25716,
      "content": "NTA this is hilarious",
      "id": 2,
      "comments": [
        {
          "score": 6832,
          "content": "You’re just saying what everyone else is thinking lmao\n\nDang this comment blew up. Thanks for the upvote, guys! :-)\n\nAdding: thanks for the awards guys!",
          "id": 3,
          "comments": [
            {
              "score": 3611,
              "content": "This is an episode from big bang theory when Sheldon used bf skinner's theory of behavioral modification on penny.",
              "id": 4,
              "comments": [
                {
                  "score": 641,
                  "content": "Best episode!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 861,
                      "content": "My favorite is the one where Sheldon and Amy break up and Sheldon gets all of the cats.  I keep hoping to find someone in the park giving away a cat and $20.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "Agreed! Though the last couple.of seasons didn't seem to have the same witty dialogue as earlier seasons.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Chocolate?",
                  "id": 8,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "I was literally thinking of this episode when reading this!",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeah, OP is only using the principal's of applied behavior analysis with the kids. Careful varied type and schedule of reinforcement would help to prolong the desired behavior and maybe even allow OP to fade the use of reinforcement, especially if this technique was used by the kids mom as well. She isn't treating the kids like animals. She is using a technique that just happens to be used on animals because it works so well.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "If we say NTA maybe she'll give us M&Ms",
              "id": 11,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2236,
          "content": "Right. I laughed out loud at the thought of her shaking the bag of M&Ms at them, they run over and she eats 6 😂😂\n\nI’m taking notes for my own kids\nNTA",
          "id": 12,
          "comments": [
            {
              "score": 1394,
              "content": "Let's be real, kids are basically animals for the first few years, anyway. This is a brilliant idea!\n\nSource: Have been stuck inside with my two kids since March, and this is sounding better and better the more I think about it.",
              "id": 13,
              "comments": [
                {
                  "score": 1016,
                  "content": "My daughter just started crawling. She crawled for the first time because I was holding snacks and she wanted her puffs. Babies are just puppies lmao",
                  "id": 14,
                  "comments": [
                    {
                      "score": 714,
                      "content": "My daughter took her first steps in pursuit of refried beans.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 510,
                      "content": "My older daughter trained my son to turn in a circle like a dog for puffs. My husband didn’t know what was going on when he got out the puffs and our son started turning in circles, lol.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 164,
                      "content": "God my niece loved puffs. She used to go crazy for them. Then she started sharing with the dog and if we shook the puff bottle they would both come running. \n\nShe’s since traded her puff addiction for Chicken N Biscuit crackers and Pringles. The dog is also pleased.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 124,
                      "content": "Tbh I am still a puppy. 100% food motivated.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "Nephew walked for a piece of fajita meat the first time, at a birthday party. Like, got up, and made it halfway across the room, then got up again. Lmao",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Mine walked the first time for cheese. Definitely my kid.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My son crawled to get the tv remote. 13 years later I see the significance.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Can confirm. My son is 9 months old and between him and our two dogs, it’s still hard to tell who is more food motivated.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "We enticed my oldest to crawl with a cat toy - a butterfly on a wire. He wanted to grab it so he finally crawled to it!",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 379,
                  "content": "Dogs have the mental capacity on par with a 2 1/2 year old (breed dependent) but training techniques that work with dogs often work with kids (and some adults...).",
                  "id": 24,
                  "comments": [
                    {
                      "score": 162,
                      "content": "My dog trainer might have written up a blog post on how she used operant conditioning and shaping to teach her 3 year old to ride the roller board on the scooter.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "I did that with my little cousin when she was 2 or 3 after leaning this fact. Worked like a charme. I got yelled at. Would totally do it again !",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "At least dogs are fuckin tolerable. Unrelated note, Is your username based off of the minecraft mod Tinker's Construct?",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "They do im a daycare teacher. I started giving my threes goldfish crackers or stamps when they listen and do as their told. Even if only one listens as soon as they see the treats being given out they all comply because they want to be included.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "With occasional exceptions, I had one who understood more words than the average teen.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Our German Shepherd is scary smart. She definitely understands the majority of what we say to her.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I raised my daughter the same way I raise my dogs - it's effective and it doesn't do any harm. Balanced trainer, btw.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Always work on adults, it's just harder to figure out how to reward adults since you have so much less control. Like cats, cats are very trainable but most of them are difficult to motivate.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 216,
                  "content": "I read an article about a marine biologist who used dolphin training methods on her husband. And it worked.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 183,
                      "content": "Do you mean handjobs before every significant interaction?",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 53,
                      "content": "I had to go look that up, it's interesting! I've often compared teaching my kids to teaching dogs. Never thought of using the same techniques on hubby though.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I was about to mention this! It was in the NYT Modern Love column.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Oh my god, this comment gave me mega Jotaro energy. (He probably trained lil Jolyne like a dolphin)",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I remember this too but in my memory it was an exotic animal trainer!\n\neta: the article i was thinking of: [what shamu taught me about a happy marriage](https://www.google.com/amp/s/www.nytimes.com/2019/10/11/style/modern-love-what-shamu-taught-me-happy-marriage.amp.html)",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "To me kids are from about the time they start walking until the age of four or five, basically little drunks. They wander around drinking from a bottle. They fall down a lot. They have a hard time getting back up. They knock shit over all the time. They slur their words. They say silly stuff. They soil themselves often. And when you've had enough you get to fight them to go to bed.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "CGP Grey has said that his advice to new teachers is to watch the Dog Whisperer.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Mother of 4 minions, I concur, they’re very primitive for a several years",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I've had better luck thinking of my very young and untrained puppers as little problem kids with fangs and problems with authority figures. I try to be empathetic when they misbehave and think on how a lesson could reach these \"savage kids\" and more often than not thinking like these has been way less frustrating. I used to be a cat person, not really used to dogs but now I feel like these puppers are part of the family.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "First few I would say first several at least. Hell I would say teens fit into this as well with diffrent motivations.\n\nMy gf's tween nieces are obsessed with WiFi so I use that to enforce decent behavior. They usually behave perfectly for me because I see through their bullshit and I won't scream and yell but I'll shut off their WiFi in a second.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My two just doubled to 4 in June. I feel this story is a glimpse into my twin having future. 😭😭😭",
                  "id": 44,
                  "comments": [
                    {
                      "score": 3,
                      "content": "OMG, my heart goes out to the parents of twins! You guys are super parents!\n\nHang in there. Invest in something cheap and dumb that they love (my kids go bonkers over glow sticks and bubbles) to keep them distracted, and hope for the best. You'll be fine!",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 219,
              "content": "It’s 1000% how my brother and I were potty trained.",
              "id": 46,
              "comments": [
                {
                  "score": 179,
                  "content": "My daughter and neice too. 1 choc chip if you poo in the potty. A gummy bear if you pee.  They'd live on the potty for a treat.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 181,
                      "content": "I like how the most poop-shaped treat is a reward for pooping",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Ditto. My sister and I and our kids too. M&Ms specifically",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Same. Cookies!",
                  "id": 50,
                  "comments": [
                    {
                      "score": 42,
                      "content": "I got mini cupcakes that I got to put icing on! My sister got a wax candle that she got to hold while on the potty. I think I got the better end of that deal. Although she did try to eat the candle.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I was potty trained on macaroni and cheese.",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I used stickers instead of m&ms tho, with a paper on the wsll over the potty to display them.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 121,
              "content": "I do that for my cat. Especially when I want to make sure she isn’t in a closed closet or something.\n\nThe doorbell does it for me. (Pizza? Groceries? FedEx? TREAT?!)",
              "id": 54,
              "comments": [
                {
                  "score": 3,
                  "content": "Me too! My cat would crawl over hot coals for treats. As a result I can leave a door open with her sitting right at it and she won’t go outside, I mean I couldn’t leave it for hours but if I need to dash inside for something she’s a really good girl ❤️ And they’re a godsend when she’s exploring in the garage!",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "I have kids and do this. Not on behavior, but on learning new things. It's no different than rewarding a child with a new toy or a prize, I do that and M&M's. Especially over sight words, they fight learning those but if they get a yummy candy for trying they'll earn them like crazy.",
              "id": 56,
              "comments": [
                {
                  "score": 3,
                  "content": "I was terrified of swallowing pills until I was 12.  I was big enough that some medication I got prescribed around then (an antibiotic I think?) wasn't available in liquid doses for someone of my height and weight at all affordably so my parents bribed me into swallowing pills with $50 and I practiced with M&Ms.  That way if I panicked I could chew them and it wasn't awful.  Learned how to swallow pills pretty quickly after that.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "So, this is not actually a good approach for your own children.\n\nOP is NTA because parenting these kids is not his or her job. And she did  what she could to control them when they were dumped on her, and not anything abusive. \n\nBut this sort of behavioral training (punishments/rewards) is not effective in turning kids into good people as it does not lead to them internalizing values or make  them behave when you aren't looking/they don't think they'll be punished/rewarded. As you saw, they are behaving when OP is right there with his/her M and M bag, but it hasn't lead to them understanding or caring about why their behavior is unkind to others or behaving better when OP isn't standing there with candy.\n\nSo yeah, for OP's goal of them behaving for occasional visits to their house, it's fine. For the goal of raising well adjusted moral young people who you can trust out in the world, not so much.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Kids respond to food better than anything else anyway. My 15 month old (and my 4 year old when she was that age) will do anything for food (hollow legs) but not for the sake of doing it (I.e. getting shoes on). You have to do what needs to be done in order to get kids to behave - food is usually one of the most effective! Tbh, im surprised the mother hasn't clicked with this method... NTA",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 595,
          "content": "Would have been better if OP clicker trained them.",
          "id": 60,
          "comments": [
            {
              "score": 141,
              "content": "Right? Saves on treats.",
              "id": 61,
              "comments": [
                {
                  "score": 27,
                  "content": "Clicker training doesnt stop you treating them every time, you're just creating a stronger relationship between the action and the treat by reducing the time between action and \"reward\", as they learn that click is synonymous with treat",
                  "id": 62,
                  "comments": [
                    {
                      "score": 19,
                      "content": "you can reduce the treats as soon as you bridge the click. Intermittent reward creates stronger response than consistent reward.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My puppy brought the clicker to\nme last night and wouldn’t leave me alone until I started training him again and giving him treats (aka kibble).  Maybe we aren’t doing something right.",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "Nothing wrong with the classic(al conditioning) route.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 462,
          "content": "Exactly. This cousin is playing [some sort of]  game, it's time she wins [some sort of] prize.\n\nINFO - OP, it is starting to get stale with the same party tricks of \"sit\" and \"behave\". Can you start getting to more advanced stuff like \"roll over\" and \"shake a ~~paw~~ hand\"?",
          "id": 66,
          "comments": [
            {
              "score": 403,
              "content": "I 100% have used “Leave it” with both my kids when they were younger. The first time it just slipped out in the moment, then it worked, so I just kept using it. Got some looks from my dog though. She was properly apprised of her good girl status each time of course.",
              "id": 67,
              "comments": [
                {
                  "score": 122,
                  "content": "Oh my god. The first time I watched my nephew with my dog around my dog was *so* confused. Poor little pup had to be praised constantly. Honestly. I’m good with kids. Like. Great. But alive had my dog for 11 years, and leave it works just fine for both pups and small humans.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Woks for my cats and my husband too.\nAlso \"DROP IT\"",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Y'know, I'm not one of those people that is naturally good with kids. I want to be, I love kids, but I'm just not. But I am great with dogs. Dogs friggen love me. I love them. \n\nI can't scratch a kids butt without raising a few eyebrows, but I realised that I *can* be the gregarious, enthusiastic tickle monster that dogs adore. So that was my solution: act with kids the way I do dogs, and suddenly kids are a lot easier to get along with.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I mean, no matter what the kids lose - not parented by mom, only able to be controlled by bribing them with sugar in the best scenario. That training only works if you can give them limitless candy, so while it works in a pinch it’s not healthy (emotionally, developmentally they aren’t maturing or learning healthy ways of behaving or dealing with disappointment).",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 206,
          "content": "Lmao ikr!!!! Op is so smart. Maybe if we started training ALL kids with treats they would behave better 😂😂😂😂",
          "id": 72,
          "comments": [
            {
              "score": 206,
              "content": "This is exactly how potty training works for a LOT of kiddos. Bribe ... I mean use positive reinforcement ... with M&ms or stickers.",
              "id": 73,
              "comments": [
                {
                  "score": 77,
                  "content": "We used stickers. My son looooved them. I made a board with his name and every time he went, he would choose a sticker and place it on the board all by himself.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Hell, as a teacher, I used stickers and other rewards all the time. The program I went through gave us all kinds of examples of positive reinforcement for behavior management, kinder and high school teachers alike.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "I’m not supposed to train my kids with treats?!  Oops....",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "I'm laughing harder than I should at this and I would have a way meaner response to the sister reaction LOL \n\n\"If you weren't so bad a parent their behavior wouldn't be worse than the dogs in Victoria Stillwell's show.\"",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "All I can picture is the chubby little maniac child from A League of Their Own. “Stilwell, angel, have another chocolate bar!”",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "LMAO I came here for this.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Jeez thank you all for the upvotes and awards I truly did not expect this, but I guess it must be a common sentiment!",
          "id": 80,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "\"they're not animals\" oh dear, that's *really* not what it seems lol😂",
          "id": 81,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11142,
      "content": "NTA. This is kinda funny. Shes not a good parent for not discipling them herself. You told her they would be trained. They where. At least they have a system for discipline",
      "id": 82,
      "comments": [
        {
          "score": 5858,
          "content": "Lol in the education field we call this extrinsic motivators. Teachers do this all the time in a more subtle less obvious way ( i.e without candy.)\n \nSide note- Honestly sounds like the kids need therapy. Amy is neglecting her children and thats a form of abuse. \n\n\nNTA.\n\nEdit: updated language.\n\nEdit: To clarify,  all schools and administrators are different. In the school I was at unfortunately they didn't approve of rewards. I was scolded for it during an observation. I was then told by my teaching mentor that I had to be subtle about it because the APs hated it and will give you a bad review for it. If you have a principal who doesn't care or approves of it that's great! I'm jealous of you and the support you have. I wish I had that as a first year teacher.",
          "id": 83,
          "comments": [
            {
              "score": 1946,
              "content": "Just call it rewarding good behavior instead of punishing bad behavior, and now it sounds better lol. I had to design a lesson plan for psych and it revolved around giving adults stickers. I think its top notch. Do good get good stuff.\n\nEdit: I was unspecific lol, yeah it's the basic reward system instead of punishing which while not as effective as teaching kids to do things for themselves is more effective than yelling at them which can cause life long issues",
              "id": 84,
              "comments": [
                {
                  "score": 902,
                  "content": "Word. I’ll do anything for a sticker.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 615,
                      "content": "Especially a holographic glittery sticker",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 268,
                      "content": "I'm a 36 year old man and I'll do almost anything for a dang sticker.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "Same",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "A banana sticker.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Jesus. I'm 27, pregnanat, have a full time job, contribute to my 401k religiously and I would suck a stranger's dick for a cool sticker.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My nurse at my GP practice and I were discussing stickers as motivation. She has 35 years nursing experience and she said nothing works better with kids or adults.\n\nAnd that is why I have a glittery winking potato sticker on my phone case as a reward for being through some medical stuff recently. I’m 42 and it makes me feel like a bad ass every time I see it.\n\nYou are never too old for positive reinforcement and goals. And stickers are suitable for everyone except fun sponges and poorly behaved people. Win-win!",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 640,
                  "content": "Seriously, I teach freshmen who are super into trying to prove how cool they are, and how much they don't care about what adults think about them. \n\nI break out my \"Awesome Job!\" and \"You are a STAR!\" stamps, and suddenly they are looking at me like I shot an arrow into their heart because I didn't put a stamp on their journal entry. \n\nGuess who works harder on the next journal entry to write at least 4 sentences? All of those too cool for the teacher freshmen.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 402,
                      "content": "A coworker tried to say her 6th grade English students were “too old” for sticker rewards. I had to cover her class for a while, and I brought the stickers I gave out to the kindergartens I was teaching. Those kids were so well behaved when they learned that they started with 3 stars next to their name. She had it where if they lost all their stars, she’d talk to their parents. I changed it. Every time they talked back or refused to participate, I’d take a star away. However many stars left was how many stickers they got to pick at the end of the class. They were so well behaved for me that week (and subsequently learned a lot more) that they couldn’t wait for me to teach them when their normal teacher was gone and the first day she was back they cried because no stickers!\n\nShe eventually adopted it with all students, even her high school cram school kids. Everyone loves stickers. For real. Yes, they could go to Daiso and buy their own stickers, sure, but to earn them was like the best thing ever.\n\ntl;dr stickers. Always have a plethora of stickers in hand.\n\nEdit: I’ve even given stickers to kids at the grocery store when they say hello and talk to me, because most of the time they’re too shy to use their English (I’m in Japan, so it makes more sense lol) so I give them a sticker with “good job” on it in English and ask if they can read it. Parents fucking love it too because the kids get a confidence boost and a chance to show off their “English skills.”",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 325,
                      "content": "When I was doing AP if I got a sticker it was a good day. It's not embarrassing like getting a compliment can be because it's just a sticker and no one has to see it if you dont want them to but also it's a reward and it's fun! Also it gets around any anti food rules schools may have so honestly stickers are just the best. Although now doing college classes every time I get a good job! I freak because I'm so happy. One time I got a \"Your explanations were exactly what I was looking for.\" Positive reinforcement is the best motivator imo",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 169,
                      "content": ">and suddenly they are looking at me like I shot an arrow into their heart because I didn't put a stamp on their journal entry.\n\nThere is something strangely adorable and heartwarming about that.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 133,
                      "content": "Lol I stamp my warm-ups with 11th graders and I love the \"MS. JENHAI YOU FORGOT MY WARM-UP. I NEED THE STAMP.\"\nWhich usually is \"No I didn't forget. You didn't have it done when I came around.\"",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "My mom was a primary school teacher and she'd ask me to help mark spelling and such and I would draw in the books. The kids went nuts for it. I created a monster because I'd have to spend hours drawing, or they'd be heart broken.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "My Japanese AND Linguistics professors would put stamps on excellent tests and assignments. As a college student those little things were small pieces of joy for me and many of my classmates. I even use stamps on the kids I helped tutor at the community center simply because of how much better that little 1.5\" colored mark made my day when I'd get one all those years ago.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "In my AP english class junior year my teacher wouldn't do stickers. Obviously everybody loves stickers, but she had something else in mind.\n\nApparently a student from a few years back had given her this giant gold star (the size of a very large hand) for something totally unrelated. She decided that she would allow kids to take a picture with the gold star and have it for the rest of class if they said something she found really profound during class discussions (which occurred almost every day).\n\nWe fucking loved that star. She was probably the best teacher I've ever had, and we all really respected her, so earning her acknowledgment felt crazy good. I only got it once, but that was a beautiful day. Anytime us students found something another student said really profound we'd all sound out like the seagulls from Nemo (Star? Star? Star?). Even if she didn't give it to them after the sound out, it was obvious they felt really proud after being recognized.\n\nIt's amazing how just being given a giant shiny gold star makes you so excited to participate in your education",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I work in a county government office. I hand out those stickers to co-workers. It started as a joke with one of my friends then snowballed. People wear them on their badges, put them on their desks and cube walls... We also ordered some adult stickers. \"Didn't quit my job today\",  \"came in late and didn't get caught\",  \"didn't yell at any customers\"... \n\nYou never outgrow stickers",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I did some adult education in a company (new technology), and I gave $5 Starbucks card to folks who got the most points on their \"homework\". Paid it out of my own pocket, didn't want to deal with explaining to the expense folks. Worked like a charm. Stuff was handed in complete and on time. Small price for much higher productivity. Sales department is doing something very similar. They call it bonus. But sometimes they also announce iPad prizes. Those are cheap in comparison for the increased revenue for a whole sales field...",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 125,
                  "content": "Yeah bribery is perhaps not ideal, but better than yelling and better than doing nothing. Bribery as a discipline method is also perfectly fine for an aunt/babysitter to use when watching the kids occasionally. Bit of bribery never hurt anyone.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 218,
                      "content": "Actually in psychology, this is them being rewarded and not bribed.  A reward comes after the good behavior while a bribe would come before the good behavior.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 84,
                      "content": "I’m no expert but as I understand it they’ll eventually just do what needs to be done for other rewards, and eventually they’ll learn to do it for what we call the right reasons and not cheap rewards or extrinsic motivators, as someone said above. \n\nTotally NTA. She’s gotta discipline or teach her kids so they’re not monsters for the family to manage.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "If she was bribing the kids they'd get the M&Ms in advance of the good behaviour. The way OP describes it they get sweeties as a reward for displaying the good behaviour first.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Banana stickers!",
                  "id": 106,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I don't even like bananas but I'd kill for a good banana sticker",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Is that a reason they give out “I Voted” stickers?  Cause, I do love those.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I never thought about that! Maybe it is!! Thatd be hilarious if the government was secretly encouraging voting by bribing citizens with *gasp* stickers",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Hey, um… I heard there were stickers?",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Teacher here! I find stickers take too long to hand out so I use stamps! I have a bunch of really cute ones and my kids love to get their book, notebook, or hand stamped",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 285,
              "content": "NTA, OP. Sounds like you're doing better at raising the kids than Amy, tbh\n\nWhat was that story about a D&D group and their game master, where she wouldn't tell them anything about herself but she would give them stickers for good behavior and if they did something bad she'd mention not giving them one next time?\n\nThe leading theory at the time was that she was a teacher, but everyone agreed that the important thing was that the guys were enjoying their games more with her in charge because it was a nicer environment more suited to adventures or something.",
              "id": 112,
              "comments": [
                {
                  "score": 366,
                  "content": "I was a teacher and a current DM.  While I don't use stickers to motivate my players to play D&D, I can tell you that that happy feeling of getting a sticker from a person in a position of \"authority\" never goes away. \n\nWhen I taught seniors and they found out that my freshmen got stickers on their tests and quizzes and they didn't (I made the mistake thinking that 17/18 year old people going off to university wouldn't want any) all hell broke loose.  I got \"yelled\" at so badly. \n\nNow, when I was an quality assurance supervisor at a health insurance company, I would hand back reports to the team, I would put stickers on my employees that would score 90% above.  These grown ass adults would get so happy to see the theme of sticker I chose for the month. \n\nTo correlate that to my d&d group, I hand out extra points for really good RP, inspiration die for critical thinking skills, etc.   The squeals of excitement from my d&d players mimic those of my freshmen students. \n\nLike I said, no one ever grows out of it.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 199,
                      "content": ">When I taught seniors and they found out that my freshmen got stickers on their tests and quizzes and they didn't (I made the mistake thinking that 17/18 year old people going off to university wouldn't want any) all hell broke loose.\n\nI taught college juniors and seniors (now I have freshmen). One quarter, I gave them all stickers as they turned in their final exams. They lined up for them! I even had one student who always put on these super-tough airs, leather biker jacket, the whole nine yards. I asked him if he'd like a sticker. He glared at first, then sighed and went \"*Yeah...*\"\n\nDude walked out with a neon happy face sticker on that jacket.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 131,
                      "content": "I was just handing out mandalorian stickers at work.  I don't think anyone said no.",
                      "id": 115,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 113,
                      "content": "I'm 44 and was disappointed when the \"I voted\" stickers ran out. :)",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "We are truly all 6 year olds at heart",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "When I DM, I like to give stickers for when they do something especially cool or memorable as inspiration points. No kidding, some of my players character sheets look like a 90’s trapper keeper. I also give out hand drawn cards for items or special things, and they like that too.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "The moral of this story: everybody loves stickers",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm in one group (not D&D, but another system where xp is more valuable) where the GM will hand out experience points for what he considers a smart move or question. It rankles me when I was thinking the same thing but didn't want to dominate the RP or didn't understand the situation and didn't think something was possible. \n\nWhat I do with the games I run is award xp to everyone for what one person does because it then becomes a situation where the only thing lost for not speaking up first is the pride of being the one to earn it for the group",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 219,
              "content": ">Amy is neglecting her children\n\nThis right here. Too many people think that neglect means the kids aren't being fed, bathed, or clothed properly (which it definitely is), but there's so much more than that. Are there days where the bare minimum gets you by? Of course, but in the end it's our job to teach our kids right from wrong and real world expectations. Kids understand much more than we give them credit for.\n\nFor anyone reading, I highly recommend instilling rules and expectations from the moment they can walk. Will they meet those expectations? Fuck no, but you've set the standard before they even know anything else, so they grow up knowing that we don't smash people's belongings, or kick holes in walls, or spill platters of food, etc. OP is trying to undo the shitty behavior her cousin has made acceptable, which is so much harder than just instructing from a young age.\n\nOP is absolutely NTA, and incredibly incentive.",
              "id": 121,
              "comments": [
                {
                  "score": 143,
                  "content": "Child psychology 101 is that children need rules and boundaries to grow up safe and happy and healthy and become functioning adults. Without it, they cry and act out and seek to find the boundaries where the rules start.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 59,
                      "content": "Yes!! I don't know why, but too many parents just give up when their kids push boundaries. It's part of the process, and the end result is easy, well-behaved kids. It's hard, but so worth it!",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 180,
              "content": "No, we call this \"extrinsic motivators\"-ie: getting a prize for doing something you're supposed to be doing.  Research tells us that lasting progress only comes from intrinsic motivators: ie: I do it because I can feel good about myself and my accomplishments.  But hey, Amy found a method that worked for \\*her\\* when the kids get dumped on her.  It's the mom's job to figure out the lasting behavior.",
              "id": 124,
              "comments": [
                {
                  "score": 120,
                  "content": "I was just reading something about there being a fair amount of research that the combination of both is the most motivating. Very few \"feel good\" motivators are solely internal, they often come with recognition, reciprocity, reinforcement, etc. Eg we think of adult learners as being strongly intrinsically motivated but they are rarely 100% intrinsically motivated, there are usually some extrinsic factors involved such as recognition, potential for promotion, feeling more knowledgeable among peers, etc.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 59,
                      "content": "I get motivated if it means a sticker and/or candy.\n\n... I want a “great job!” stamp on my quarterly financial reports.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "As a grown ass adult, nothing felt better than asking coworkers to check my kanji and sentences to see if they’re right when I was studying and having them stamp them with the same stamp they did on their students kanji sheets! I still have that notebook with a bunch of “good job” and “がんばって” stamps on it, because they make me smile still years later.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 71,
                  "content": "[Text of original comment deleted for privacy purposes.]",
                  "id": 128,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Yeah but paychecks reinforce negatives, not positives. Its not \"If you do well I'll give you a treat!\" its \"If you don't do well you'll be homeless and destitute!\"",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "True--I'm pretty motivated by a paycheck.  But eventually the paycheck wasn't enough and I had to look for other opportunities.  But I always want to do a good job where I go because it makes me feel self-worth.  Maybe there's a happy combination of both?",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 44,
                  "content": "I was wondering this. I used the same training methods on my nephew that I used on my dog until he was 3. Worked for me. I combined it with doesn’t it feel good to be clean from a bath, etc etc. to try to lay foundation for intrinsic, but I don’t know if it stuck since his parents believe in punishment parenting rather than rewards.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I mean, you stop using treats with dogs, too, right? Or reduce the frequency. But they still sit and heel and roll over.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "that can't possibly be correct. There is no reality where intrinsic motivators are isolated.",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "I had a teacher who did it with candy. It worked. 😂",
              "id": 134,
              "comments": [
                {
                  "score": 52,
                  "content": "I had a university professor last year who brought snacks for us once a week, and while I think she did it just because she’s a super sweet person, I feel like it also totally could have been a motivation tactic to get us to attend. Worked on me at least, I looked forward to the snacks every week.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 60,
                      "content": "One year I had a professor who noticed that most people skipped his Friday afternoon classes, so he started bringing donuts every Friday! Class attendance definitely picked up later in the semester, but idk if that was because of the donuts or if because everyone was out of free skips lmao.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "My boyfriend always brings dinner for his students when he teaches evening classes (although he does it because he feels genuinely bad that they don't get to eat all day, rather than for outright bribery). They're pathetically grateful for free food and I suspect it's probably a great motivator for going to class!",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Had a teach that brought in toothbrushes for good work. Guess which teacher ended up voted best on campus. Everyone like getting free things no matter what.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I got yelled at by my assistant principal for giving our candy. So no more candy for the kids.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Really? I literally bribed a kid to take a standardized test for a bag of cheez-its in front of my assistant principal and she was like: **shrug** whatever works!",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "I can confirm that my love of stickers thrived when they were given as awards by teachers\n\nEdit: Most of our class loved stickers and we were able to spell the 6th grade vocabulary words in 4th grade because of some of the reward systems",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Teacher here. 6th grade. \n\nNot subtle, not less obvious. An actual big-ass bag of candy in my desk.",
              "id": 142,
              "comments": [
                {
                  "score": 4,
                  "content": "My co-workers quickly learned that I'm easily bribable with chocolate. If it doesn't go totally against my interests/morals there's a lot you can convince me to do with chocolate. ;) \n\nEspecially if it's good stuff.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Exactly, we just make reinforcement seem more palatable than dog training along with giving them more choices as they mature. It doesn't sound like her nephews have the self control for choices yet. A few m&ms are far less destructive than what their mom is doing to them.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That's exactly what it's called in every field. Including dog training",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Percy the Platypus (pre-covid) was my SO's savior with keeping five-year-olds focused on the tasks at hand. \"If your table gets too loud or doesn't follow the rules, Percy gets scared and goes to another table.\"\n\nSo I did that with our Doberman and it works great! \"Apollo, if you can't calm down Mr. Gumbi will sit on the porch outside.\" Dude grabs Gumbi and hauls ass to his bed.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Lmao these comments are as hilarious as the post",
          "id": 147,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "In reality it was what? 6-10 M&Ms per hour at most?\n\nMy aunts, uncles, grandparents etc gave me way more sugar and candy in single sittings. Ice cream, sundaes, candy bars, soda, etc.\n\nThat mom is cray",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7076,
      "content": "Yeah these kids are not gonna be harmed by you training them with m&ms. If anything, it should show their mom they are apparently able to control themselves.\nYou do you, it's very smart and also hilarious. Also. I think you just might be their favorite aunt lol. Go girl!",
      "id": 149,
      "comments": [
        {
          "score": 3675,
          "content": "Now that I think about it, that's probably why she kept dumping them on me after the first time. I don't even know if they get candy outside seeing me.",
          "id": 150,
          "comments": [
            {
              "score": 2785,
              "content": "Give her a choice: M&Ms method, or you call CPS the next time she leaves them with you with little/no warning.",
              "id": 151,
              "comments": [
                {
                  "score": 834,
                  "content": "For abandonment",
                  "id": 152,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 700,
              "content": "Here's a tip;\n\nToddlers are developmentally the same as dogs. Dog tricks work with them because it's like trying wrangle a puppy. \n\nYou do you, boo.",
              "id": 153,
              "comments": [
                {
                  "score": 1004,
                  "content": "How dare you! Children are not dogs!!!\n\n\\>Said as I feed my child then wait 20 minutes to change her diaper. Then feed my puppy and wait 20 minutes to take him for a walk.< \n\nThey are not the same at all!\n\n\\>Gives squeaky toy to puppy<\n\nThey are completely different creatures!\n\n\\>Gives different squeaky toy to toddler<\n\nOh damn, I gave the baby the dog's squeaky toy. Ah well, they're both happy. It's fine.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 233,
                      "content": "You mean the dog and the toddler don’t just take each other’s toys?",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 97,
                      "content": "  this is the best thing i've read so far other then the story above.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "which squeaky toy is more chewed up ?",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": " FYI, the kids are 6 years old.",
                  "id": 158,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 262,
              "content": "IMO I'd swap to stickers or something non food related over candy, because your friend is right in that you don't want these 6 year olds to associate sweets with rewards and grow up associating overeating with love/affection. Bribery is how you get little kids to do things so the concept isn't a bad idea.",
              "id": 159,
              "comments": [
                {
                  "score": 155,
                  "content": "I mean then she'd lose a bit of the leverage she gets by eating the m&ms each time they misbehave",
                  "id": 160,
                  "comments": [
                    {
                      "score": 228,
                      "content": "Eat the stickers, total power move.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Just eat the stickers.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "She could keep the stickers! Make a whole Gollum production out of it - \"MY STICKERS! MINE!\"",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "No then she gets a sticker and places it right on her forehead",
                      "id": 164,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 109,
                  "content": "OP can give them challenges too. \n\nEg “I wonder if you could have your homework finished by the time that I have finished taking a shower.”\n\nWorks like a charm.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "It isn't bribery- bribery means that the kid gets the sweeties *before* performing the behaviour. This is a reward,  as they get the sweeties *after* performing the behaviour. It's the same as saying 'When you've eaten your vegetables, then you can have a dessert'- outcome is conditional on behaviour.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "Tell her you arent treating them as animals and your style of teaching is called positive reinforcement conditioning. The actual term of this psychological training. (Which works on animals but also does on kids and even adults like to be rewarded) Like if you do a good job at work and get a pay raise. Same reasoning.",
              "id": 167,
              "comments": [
                {
                  "score": 7,
                  "content": "it's not just positive reinforcement. there are four quadrants to operant conditioning, which are positive and negative reinforcement and positive and negative punishment. reinforcement increases behaviour and punishment decreases behaviour. op eating m&ms the kids can't have is not positive reinforcement, it's negative punishment (removing something the child wants to decrease the undesirable behaviour)",
                  "id": 168,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Cant argue the book definition but I do believe in consequences and rewards. In this scenario it works as well as in adult life. Work hard pay raise for the most part, do a bad job often enough get fired. Lessons they are learning young.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "Gotta get that high value treat yo. \n\nYou should double down and get a clicker. It’s actually super fun to try to guess what the person with it is trying to ‘train’ you to do and I bet the kids will love it.",
              "id": 170,
              "comments": [
                {
                  "score": 16,
                  "content": ">It's actually super fun to try to guess what the person with it is trying to 'train' you to do\n\nWhy do you know that?",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Also as long as you don't try to reinforce good behavior they already enjoy doing (like if you see they like reading or they always eat everything on their plate), thus teaching them to expect a reward for them and chipping away at the original motivation, then there's absolutely no harm done by conditioning them to do what you want them to. \n\nAt that age they probably do best when they see immediate consequences to their actions anyways.\n\nDefinitely nta",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "After this she may not leave them with you after this.",
              "id": 173,
              "comments": [
                {
                  "score": 46,
                  "content": "It's a terrible thing for the kids, but I don't see the downside for the aunt.",
                  "id": 174,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "M&Ms were how a friend of mine potty trained her son. They didn’t do candy, but every time he pottied in the toilet, he got an M&M. All you’re doing is finding the reward that works to teach and reinforce good behavior. NTA",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You might need to train yourself to set some boundaries. You are 27 years old and “forced” into attending large gatherings when it isn’t safe, “forced” into babysitting two kids for long periods of time, and “forced” into a relationship with a cousin you don’t like.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I mean, it's not great for their development, but 6 year olds should not be acting like that, so they clearly have huge problems from her that are way more impacting.  Like, not great for a 16 year old to drink beer, but at home they're getting heroin mainlined - there's perspective.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I don’t know about harmful, but it’s definitely not a practice one should use in good parenting. Obviously that wasn’t the situation here, and I think it was a brilliant idea on OPs part. She didn’t parent the kids so well that her cousin would be like “you raise them” but she definitely got positive behavior in the moment, which was all she needed. \n\nI feel really bad for the kids. The only positive discipline they’re getting is behaviorist training. Their mom is irresponsible.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I’d like to offer the other side to this. I think it is harmful, not because it’s training, but because it’s using unhealthy food as a reward. This is precisely the type of parenting that led to my binge eating disorder and weight struggles. I’ve been battling the junk=reward mindset for years. OP should use a different reward.",
          "id": 179,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Yeah M&Ms aren’t even that much candy, at least op isn’t giving them full size Hershey bars 😂",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "The risk is discipline through food sets kids up to eat to control their emotions later in life, but thats the least amount of damage that could come from their childhood from the looks of it",
          "id": 181,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3435,
      "content": "NTA. If Amy doesn't like you treating them like \"animals\", maybe she should have come up with a better parenting strategy than just dumping them on other family members. They sound destructively out of control, too bad you're the only one who has come up with a solution",
      "id": 182,
      "comments": [
        {
          "score": 888,
          "content": "This story is kind of cute, but below the surface - what her sister is doing to her is absolute shit. Lock the door and do not let these kids in. It's not okay that they are getting left to her care.\n\nIt's horrible that her sister had kids and thought sister would care for them.\n\nI don't care what mom says - I would move away from these people.",
          "id": 183,
          "comments": [
            {
              "score": 163,
              "content": "*cousin, not sister.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 749,
          "content": "If Amy doesn't like her kids being treated like \"animals\", maybe she shouldn't have raised them to act like animals.",
          "id": 185,
          "comments": [
            {
              "score": 399,
              "content": "[deleted]",
              "id": 186,
              "comments": [
                {
                  "score": 61,
                  "content": "Potato, tomsto",
                  "id": 187,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "So, exactly the same thing. Nurture is a big part of what makes us human.",
                  "id": 188,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "excuse me, my animals would never be that destructive!",
              "id": 189,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I mean, act like animals get trained like animals",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "And she doesn’t even have to invent one, she just has to educate herself, take a look outside herself and get some advice!",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2699,
      "content": "NTA.\n\n&#x200B;\n\nYou should try clicker training ( [Clicker Training Your Dog in 10 Simple Steps](https://www.advantagepetcare.com.au/au/training/guide-clicker-training-your-dog/)) which would eventually remove the Candy, much better for their health!  \n\n\nAnd seeing as they are such high energy, consider Agility Training - fun for all involved!",
      "id": 192,
      "comments": [
        {
          "score": 512,
          "content": "I’m dying. This is awesome.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 230,
          "content": "Holy fuck this would be amazing. This story is hilarious. OP NTA",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "Have you seen House MD?",
          "id": 195,
          "comments": [
            {
              "score": 32,
              "content": "Yes, loved the early seasons.\n\n&#x200B;\n\nI presume he tried training some of his students?",
              "id": 196,
              "comments": [
                {
                  "score": 66,
                  "content": "His girlfriend’s kid and it worked. It’s in the second to last season.",
                  "id": 197,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I stopped watching cause they got rid of Cuddy.\n\nI’m still very bitter about it all these years later.",
                      "id": 198,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Ok this comment actually made me lol\n\n\n\nThe real dog in this story is *Passive Aggressive*. OP made it sit up on its hind legs and beg, like such a good boy.\n\nOh and NTA",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Additionally, stickers and positive affirmation are good alternatives to candy.",
          "id": 200,
          "comments": [
            {
              "score": 4,
              "content": "Stickers got me through potty training! I still have my poop sticker chart.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1877,
      "content": "YTA\n\nBut to yourself.\n\n>I (27F)\n\n>my mom's side of the family demands that we all remain close-knit, so I have no choice to tolerate her.\n\n>I know, pandemic. Didn't want to, but mom insisted\n\nGrow a fucking backbone.",
      "id": 202,
      "comments": [
        {
          "score": 686,
          "content": "I had to double check OP's age. I was expecting like 16, 17 tops. But 27?! No, your mom did not \"force\" you to go to a gathering during a fucking pandemic. You went and didn't want people to judge you for that. Grow up. My God.",
          "id": 203,
          "comments": [
            {
              "score": 417,
              "content": "I agree, but I can see how it's tricky with family.\n\nI bailed on a family reunion one year, because every year I went it felt like the rest of the family was judging me. My mom bugged me about it for a couple weeks leading up to it, but I stayed home anyway, it really upset her.\n\nThat was the last family reunion my mom went to. She lost her battle to cancer the following fall. It meant so much to her and I stayed home and played video games because I didn't want to deal with the family.\n\nI still feel horrible about that; apparently more than I thought because that was still really hard to type.",
              "id": 204,
              "comments": [
                {
                  "score": 149,
                  "content": "I'm sorry for your loss. I know it's difficult but please don't dwell on not going to the last family gathering. Your extended family was not being nice to you at those things for years, why should you have to deal with that. \n\nLook at it from another way, if she were still alive would you have attended the next year, or now that you'd found your independence from it, would you have again made your own plans. \n\nIt might have meant alot to your mum but she wasn't the one facing the judgement. You did what you had to do for your own mental health, not to spite your mum and I'm sure deep down she knew that",
                  "id": 205,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I like to think so. I wound up moving about 800 miles away about 7 months after my mom passed, so I haven't been to another reunion since. I would have kept attending the function had I been able.  \n\n\nI've gotten over the need to be close to my family. I felt horrible for years for feeling so estranged, then I realized it's a two way street; all of the attempts I made to feel more involved, they never made it any easier, so now I just focus on the family I've chosen and built.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 462,
          "content": "I was going to comment the same thing. Did your mom put a gun to your head and force you to the gathering? No? Then don’t go.",
          "id": 207,
          "comments": [
            {
              "score": 8,
              "content": "No, but she’ll probably take away OP’s M&Ms...",
              "id": 208,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 106,
          "content": "Yeah, by the time I was 27 I was really good at telling mom no to any bullshit she came up with. In fact by that age I had cut off most of her relatives because they certainly weren't family.",
          "id": 209,
          "comments": [
            {
              "score": 12,
              "content": "I can relate to that. After my mom passed, everyone on her end of the family lined up and told me to call them if I needed anything at all. \n\nSix months later when my landlord was selling my house out from under me and I had nowhere to go:\n\n\\>\"Gosh, that's tough. Try to keep a stiff upper lip, bud\" -The whole famn damily",
              "id": 210,
              "comments": [
                {
                  "score": 4,
                  "content": "Sounds like my mom's asshole relatives.\n\nGrew up watching them give her all sorts of shit in the name of their religion since they felt like she wasn't the 'proper dutiful daughter', even though her parents were a-okay with how she did things. So by the time I was an adult I cheerfully cut them out of my life because the handful of decent ones had passed on due to illness or age.\n\nMom followed suit then after a week of grieving realized she was much happier.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "Exactly, wtf. If you're not a teenager still living at home, whatever your mom says is just an opinion and you still get to make your own decisions.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 75,
          "content": "Honestly, learn to say no just once. Why is mom deciding where you go during a fucking pandemic at 27?",
          "id": 213,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "[deleted]",
          "id": 214,
          "comments": [
            {
              "score": 18,
              "content": "Same. How is everyone else just overlooking this?",
              "id": 215,
              "comments": [
                {
                  "score": 7,
                  "content": "Because they got too caught up in the circlejerk to turn their brains on.",
                  "id": 216,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "Right??  \"My mum insisted\"?  Boo hoo.",
          "id": 217,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Have y’all ever dealt with difficult family members who push and push and push? I say no to my family all the time but they push and guilt and use gaslighting tactics and abuse to get their way. It’s not that cut and dry and it’s not really fair to blame victims of familial abuse or pressure for having a hard time standing up for themselves.\n\nI’m not saying that’s what’s happening here but if you ever check out r/justnofamily or r/raisedbynarcissists you’ll see how manipulative family can be.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I’m the same way and I’m 22. Working on it, but it sucks.",
          "id": 219,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1009,
      "content": "INFO Why do you *have* to stay in touch with her? I get that families can apply pressure, but is it worth it? Is their living condition bad enough that you can call CPS to get them involved? These are children who seem to have no adults in their lives and that's really messed up.\n\nI don't know what the laws are, but if you tell her \"you can't drop them off here\" and she still does, I'm pretty sure you could call CPS (or some official) and report that they've been abandoned.\n\nThis is not a good situation. I get that it's bad for you, but it's so much worse for these kids. They didn't do anything to deserve being in such a dysfunctional family.\n\nI'm *definitely not saying you should step in as a parent*. It seems pretty clear you're not equipped to handle kids. But haven't you pursued any other avenues, for the sake of your nephews if nothing else?",
      "id": 220,
      "comments": [
        {
          "score": 1036,
          "content": "Outside of her dumping her kids, I'm not in contact with her, so I can't say for sure what they're living situation is. Another relative had called the police when Amy did it to them, but I don't know enough of the details to see if the outcome was good or not. Seeing as she still has them, probably not. \n\nI can't directly tell her not to drop them off, she makes them get out her car and speeds off the second I open my door and I don't have her phone number, but I will contact CPS and see what they can do.",
          "id": 221,
          "comments": [
            {
              "score": 1013,
              "content": "Yeah, definitely call CPS. Every time she tries to leave them with you, call the authorities and report that they've been abandoned.\n\nShe's messing up her kids and this isn't a safe situation for anyone. Getting the authorities involved may not fix the problem, but it should at least put her on their radar, which is a start.",
              "id": 222,
              "comments": [
                {
                  "score": 527,
                  "content": "THose poor kids. No wonder they act out.",
                  "id": 223,
                  "comments": [
                    {
                      "score": 478,
                      "content": "And respond super well to the m&m training, they’re probably craving structure and positive reinforcement like crazy",
                      "id": 224,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "If she is even having them at home ever? Maybe she just continues to dump them place to place...they could be with anyone! Being abused!? Anything!",
                      "id": 225,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 462,
              "content": "She leaves her kids with you and YOU DON'T HAVE HER PHONE NUMBER??",
              "id": 226,
              "comments": [
                {
                  "score": 242,
                  "content": "What if there is a medical emergency? She is awful.",
                  "id": 227,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 75,
                  "content": "Serious yikes after reading that. Went from hilarious to tragic real fast...",
                  "id": 228,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Nah, it was already tragic. I’ve never heard of kids who go literally break anything that shatters when they don’t get candy. They’re obviously traumatized from something, even if that something is “just” neglect.",
                      "id": 229,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 360,
              "content": "Holy crap, that is next level f\\*\\*ked up. Definitely call CPS.\n\n&#x200B;\n\nLiteral abandonment, which must be devasting for the kids emotional well being. No wonder they are acting out so badly.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 247,
              "content": "OP, their behavior is beyond poor impulse control.   These kids really need intensive mental health intervention.    \n\nThat can be hard to find and afford on your own...but, you know who can fast track services?   CPS.   The kids are not likely to be taken away from Amy, but if they can get a case worker and referrals to agencies with IICAPS (Intensive Psychological Outpatient Services for kids)  or FFT (Functional Family Therapy) programs, they have a shot at getting the help they obviously need.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "What the heck would happen if you weren't home??",
              "id": 232,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 103,
              "content": "She sounds awful, but it also sounds like you have a problem with telling your family no. There's never a time when you are face-to-face with her and you can tell her that you will not babysit anymore? Also, you're 27, why are you not able to say no to a large family gathering in the middle of a pandemic? It seems like you're completely dismissing any possibility of talking to your relatives, setting boundaries, or saying no.",
              "id": 233,
              "comments": [
                {
                  "score": 20,
                  "content": "This. I wanna say mild ESH. The sister (and many other adults in the family, it sounds like) are the major assholes, but OP is a bit of one for not standing up for herself as an adult. Unless she relies on them financially or something, but she didn’t mention that.",
                  "id": 234,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Holy shit. Do you have a ring doorbell or some kind of camera recording that? I'm sure CPS would love to see footage of that. That is absolutely child abandonment.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Just drive the kids over to their grandparents house, and when Amy knocks on your door, just ghost her.  She'll figure out where her kids are eventually.  Yeah, or just call CPS the minute Amy drops off the kids.",
              "id": 236,
              "comments": [
                {
                  "score": 6,
                  "content": "That is delightfully evil\n\nAnd completely deserved",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Train those kids to learn her phone number.  Offer some special treat....a cake?",
              "id": 238,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Also, you are 27. You don’t HAVE to stay in connect with your sister because your mom tells you to. And you definitely don’t HAVE to go to a family party during a pandemic because your mom tells you to. You have a voice and the decisions you make are yours, don’t try to put them on anyone else. What you did with the kids is hilarious but, again, you can say no.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 640,
      "content": "[removed]",
      "id": 240,
      "comments": [
        {
          "score": 292,
          "content": "There’s a special place in Purgatory for people who make ASCII art out of Braille cells.\n\nAnybody using a screen reader to read this thread just had your “surprised Pikachu” read to them one character at a time. And anybody using a refreshable Braille display to read it got a bunch of gibberish in an entirely linear format, 40 cells (or so) at a time.",
          "id": 241,
          "comments": [
            {
              "score": 219,
              "content": "I'm sorry if I offended you somehow, I was just trying to make the surprised pikachu face\n\nIf you would like I will delete it.\n\nI never thought about it that way, that I am basically making fun of people who use Braille",
              "id": 242,
              "comments": [
                {
                  "score": 202,
                  "content": "I think it’s less making fun of them and more making it difficult for them to enjoy reddit because they get stuck on the ascii art for a long time!\n\nOriginal commenter (OC? Do people say that?) def took a bit of a mean approach to an educational moment but regardless, I learned something new. I wonder if the issue is the same with other characters or if it’s that character specifically? I could see most characters taking a long time to listen to. \n\nI did think that comments would be skippable with a screen reader but I don’t know for sure how reddit is implemented.",
                  "id": 243,
                  "comments": [
                    {
                      "score": 143,
                      "content": "I agree, I am very fortunate to have my eyesight and will not post something using ascii again (unless it has an actual meaning) as I am basically ruining it for people who read using Braille. Thank you for telling me about this u/mildly-strong-cow",
                      "id": 244,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "It's definitely skippable. I think it'd be fine if you included a description for screen reader users.",
                      "id": 245,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 109,
                  "content": "Actually a screen reader user could easily skip past it. And many might find it amusing or funny that you used braille to make a pikachu face, once they know what it is.\n\nHere's a win/win: just put a description at the top and then everybody's happy",
                  "id": 246,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Description helps mobile users not spending an eternity figuring out wtf it's supposed to be, too.",
                      "id": 247,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I didn’t realize you had made it yourself - I figured you had copy-pasted it from somewhere. It’s pretty impressive work. \n\nI have a deep hatred of ASCII art, because for leisure reading I’m usually using VoiceOver while I do other stuff. Getting my hands freed up (and clean enough to handle my phone) can sometimes take a minute or two, by which point, if it’s something small, VoiceOver has finished reading Every. Single. Character aloud.\n\nLarge ASCII art is thankfully rare, so usually I just assume that by the time I’m able to skip ahead it’ll be done. Having it keep going (and going and going) is really frustrating. \n\nFor most uses, it’s better to take a screenshot and use that with descriptive alt-text. When that’s not possible, it’s better to just not use it at all. \n\nSorry I was so rude. I was trying to unwind after a crappy day and that really didn’t help, but I could’ve been more polite about it. \n\nThank you for being willing to listen. Usually I *am* polite about it and either get ignored or get told that ASCII art is a normal part of the internet and I just need to shut up and deal with it.",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Where is 8 dot Braille used? I've only ever seen 6 dot cells.  Braillenotes have an option to skip entire paragraphs, so at least for people with that tech, it's not a huge problem.  One of my totally blind students actually really likes ascii art and makes it all the time.  They gave me an Eiffel tower made with Braille last year.",
              "id": 249,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 338,
      "content": "NTA. You've proven the kids can be taught to behave. Your cousin just lost her go-to line when she lets the twins run wild. At least she won't dump the kids on you again...",
      "id": 250,
      "comments": [
        {
          "score": 5,
          "content": "\nDestroying things and acting out is usually a parent problem not a kid problem.",
          "id": 251,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 312,
      "content": "ESH. Training kids like animals really isn’t cute or cool. But she seems to have assumed you exist to be a free babysitter and she doesn’t discipline her kids.",
      "id": 252,
      "comments": [
        {
          "score": 158,
          "content": "i can’t believe i had to scroll this far to find this judgement! OP worded it to sound all “heh look at this cool idea i did to get the kids to behave” knowing full well it’s gonna fuck those kids up. so many comments saying its harmless — uh, the story literally ends with hell breaking loose as the twins go shattering shit in the kitchen. that is both the aunt’s bad parenting and OP’s idea of “training” at fault. \n\nthe kids are definitely brats and were always brats under the aunt’s parenting; OP turned them into brats who know how to fake obedience if it means there’s an instant award.",
          "id": 253,
          "comments": [
            {
              "score": 74,
              "content": "I've used dog training methods on children, just not with candy. Social rewards are super effective.\n\nI watched a kid who was super destructive, and we did not share a common language. I could not use reasoning with him. All I had was body language.\n\nIt's just starting off with blank face and smiling face, and changing back and forth instantly with their behavior. When they're acting out, you stop them from destruction but remain completely grey rocked. No expression. Just complete calm and prevent them from damaging something. If they attack you, don't react.\n\nThe *second* they stop immediately turn to them and smile. Have a plan of someway of engaging them, like a toy, or TV, or game. But the second they revert, you also immediately stop and go back to a blank expression. \n\nVery quickly they figure out what will get them what they want.\n\nOften kids who act out so excessively are those who don't receive enough outlet for the energy or simple pleasures. They're constantly being punished more than they can withstand, so they've learned they *must* ignore boundaries in order to function. So the reward of kindness and engagement is super effective. *Don't make them wait* you reward them immediately when they're in the super destructive state. Chances are their parents are punishing them for hours or days and rarely reward them or wait excessively long before a smaller-than-appropriate reward. They've lost trust in rewards, so you gotta dole them out constantly in the beginning. But really, a simple smile and giving them your attention is all the reward they need.",
              "id": 254,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "It's not OP'S \"idea of training\", classical conditioning is a valid learning method. Not only OP use it, my ex coworkers (clinical psychology clinic) and other staff at clinical psychology clinics use it on children all the time, especially ones with behavioural or development issues. OP didn't invent classical conditioning.",
              "id": 255,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "What their mother is doing is way worse\nNo discipline. Excuse their behaviour as being 'just children' . \n\nBesides, rewards is how most parents train their children. Father Christmas brings your stuff if you're good. Elf on a Shelf etc.\n\nI don't agree with using sweets, as that can lead to addiction.",
              "id": 256,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "The twins shattered things because their mother said they wouldn't get any candy. They are reacting to their reward being taken away, and reverting to their pre-training behavior.\n\n\"Fake obedience for reward\"? Do you think kids behave because they like to sit still and be quiet? The kids finally have a motivation for behaving, and from what OP says they took to the program really quickly. Plus, \"fake it until you make it\" - with consistency, the kids could learn to behave at all times because it was what was expected of them.\n\nIf Amy was onboard with this kind of thing, she could change the reward to something other than candy, like a small trinket or a coloring book or a trip somewhere fun. Lots of parents use \"sticker charts\" and such to train good behavior. But no, her reaction was to freak out (likely because she realized what a shit parent it made her look like) and trigger a meltdown tantrum from her kids.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Exactly. Besides, she hasn't \"trained\" them. If anything, she spoiled them more because they just want candy. The second the candy is gone, their behavior is worse than ever. Not to mention all of that candy is, in fact, bad for them. They're not toddlers, they're 6, and treating them like dogs isn't funny or cute. If your cousin is neglecting them this much, stop being a pushover, call the appropriate authorities when she dumps them on you, and be done with it. Don't take it out on the kids just because they have a crappy mom.",
          "id": 258,
          "comments": [
            {
              "score": 63,
              "content": "Plus if they begin to associate food with good behaviour, that's going to mess up their relationship with food later in life.",
              "id": 259,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Right, even if this story is real (big if here), it's not cute or quirky or funny, and OP would be TA for going to a party during a pandemic regardless.",
          "id": 260,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This feels like it based on the idea that humans are inherently different than animals. \n\nThis just isnt the case. We are animals, positive reinforcement is no more bad for us than it is for dogs. \n\nAnd what's the alternative? Negative reinforcement? Just scream at them and hope it works?\n\nI have some issues with the exact way op did it, having food/candy as the only motivator is not ideal, but at the same time fun aunts are allowed to spoil kids with lots of treats, op just paired her treats with discipline.",
          "id": 261,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "From the sound of it, the kids basically acted like animals before OP started the M&M method. Ripping cushions? Smashing things? Holes in the walls? That sounds like zoo animals.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}