{
  "post content": "My son (24M) and his girlfriend (24F) have only been together for 6 months, and she is apparently 4 months pregnant with his baby. They have actually been friends since high school, and so my husband and I have known her for a few years as well. \n\nShe is a lovely girl, but honestly she is not someone I had hoped would be the mother to my first grandchild. First of all, she is a recovering drug addict and alcoholic, and while she says she has been clean for 3 years, a relapse is always possible. She only finished high school with her GED, and she now works as a waitress full time. Her parents died years ago, so she is largely on her own.\n\nOur family is considerably better off, and my son is joining his father's business, meaning his salary will be quite high and will only continue to grow. \n\nSince my son first told us she is pregnant, it can't escape my mind that he may not really he the father, and that she picked him out of potential others because he would be the \"best\" in terms of support. \n\nMy son is pushing us to help her with some of her pregnancy expenses, and I told him we would under the condition that she get a paternity test first. He completely blew up at that, accusing us of disliking her (untrue) and not wanting to he grandparents (also untrue). He says he loves her and trusts her and that he can't wait to meet his baby. I get that, but I think he's being idealistic. If he wants our support, we want a paternity test first. If the baby is truly his then we would be happy to welcome her into our family and we would be happy to help her out. AITA?\n\nEdit: there are 7k replies to this post, and over 200 private messages in my inbox that I can't reply to. It's a pretty even mix of YTA and NTA, so clearly the only thing everyone can agree with is that it's complicated. I've gotten messages to kill myself, I've gotten messages calling my son an idiot, and I have gotten messages from the MGTOW subreddit telling me that the girlfriend is clearly a lying sociopath. I have also gotten a lot of messages from men who found out their child wasn't theirs after several years, who wish they had found out sooner. \n\nIt's a lot to read, and a lot to think about. Many people have called out my attitude towards this girl and I'll be honest, it is making me think.",
  "id": 1,
  "comments": [
    {
      "score": 28134,
      "content": "> He completely blew up at that, accusing us of disliking her (untrue) \n\nRe-read the first part of your post. Even to internet strangers it's pretty obvious you don't like this woman. Right off the bat you aren't being truthful.\n\nYTA.",
      "id": 2,
      "comments": [
        {
          "score": 6625,
          "content": "Agreed, YTA. OP, your son loves her and wants to be with her and *believes this is his child*. If you have the money available (and would’ve helped if it was someone you “approved”) then support your son *and his soon to be family*. No one is saying throw millions at it, go into debt, or write them into the will.\n\nETA something i just commented below:\n\n>Would OP want a paternity test if the situation was different? If the girl hadn't been drug addict?\n\nExactly. If the girl was Polly Purebred with a perfect pedigree would OP have asked for a paternity test before helping? Not to mention, asking for a paternity test now is questioning the integrity of the people involved (son and gf) and in no world does that not make OP an asshole **to them**. \n\nThere are too many other variables going on - they’ve known each other since high school, who knows what kind of relationship they’ve had or how much son tells OP. It’s irrelevant if they’ve been FWB and started a relationship, or have been friends for years and started a relationship, or had a one night stand turn into something more. They’re already past the first trimester. They’re in a relationship. They’re having a baby. \n\nSon asking mom to help out with a few expenses - not the asshole. Mom declining to help because she doesn’t feel comfortable doing so - not the asshole. Mom/OP putting the stipulation of a paternity test before helping - asshole.",
          "id": 3,
          "comments": [
            {
              "score": 6813,
              "content": "Why does a 24 year old, who is going to be working for his daddy's company need his mom's money to pay for his child?",
              "id": 4,
              "comments": [
                {
                  "score": 1206,
                  "content": "This reply should be way higher. It's all I could think reading the post",
                  "id": 5,
                  "comments": [
                    {
                      "score": 563,
                      "content": "I don't think op is an asshole for not wanting to support their adult son's child.\n\nThat wasn't the question though - - OP is definitely a spoiled, classist asshole. They're accusing the girlfriend of cheating because she didn't grow up with rich parents.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Same.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 384,
                  "content": "OP implies that her son does not yet work for the family business but will be soon. (\"and my son is joining his father's business\")",
                  "id": 8,
                  "comments": [
                    {
                      "score": 425,
                      "content": "Her son is an adult and about to start working for his dad, where OP mentions that he will make a lot of money. So again, why would he ask his mommy for money?",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "Well, OP’s son should get a job while he is not yet cashing in his pop’s big bucks. You know, like his girlfriend does ...",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Seems a bit like she believes everything her son has is technically hers.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Because if they were planning on giving money anyways, withholding because they don't approve of his choice is an asshole move. It's the same situation as if a parent offered to pay for their child's college but then didn't once the kid changed their major.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "[deleted]",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Sounds like what he really needs is Mommy's approval to get Daddy's money. Unless mom's got her own money too, or they live in a community property state and the situation is such that the assets are shared 50/50. \n\nDontcha wonder what Daddy's thinking?",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "So he can spend his own money of stuff he enjoys and not take responsibility himself.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3164,
              "content": "I don't think I've ever disagreed with a top-rated AITA judgement more.\n\nIt's clear OP has doubts about this girl's parenting ability. Which is absolutely fair, because she has a difficult history and she got pregnant less than a year after dating OP's son. Rather than saying \"well there's no way in hell we're going to get behind this one,\" OP is giving their son a chance to bring them on board by showing some definitive proof that their relationship is in good faith.\n\nA lot of young people tend to believe their partners to a fault. \"We're in love!\" declares the young man with a partner of six months. OP is old enough to have a son in his 20s. They have probably seen some shit.\n\nBeing willing to support a child only when they're with a partner you feel you can trust doesn't make you an asshole. Good parents don't subsidize bad decisions for fully-grown offspring.",
              "id": 16,
              "comments": [
                {
                  "score": 1019,
                  "content": "I couldn’t agree more with this. The amount of blind faith and support this thread has for the girlfriend is so bizarre. In a perfect scenario, he’s the father, she continues to remain clean, and they live happily ever after, but I don’t think it’s completely outrageous for OP to demand a paternity test before financially and emotionally committing to this girl and her future child. NTA.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 888,
                      "content": "This sub is just a self-righteous circlejerk. Look at some of these comments practically weeping with how much they \"admire\" the girlfriend for getting her GED and getting over her addiction, and how the evil judgy OP and nepotistic son would be \"lucky to have her in their lives.\" This sub is very political even by reddit's standards, they're just taking the party line.\n\n> I get that, but I think he's being idealistic. If he wants our support, we want a paternity test first. If the baby is truly his then we would be happy to welcome her into our family and we would be happy to help her out.\n\nThis is 100% reasonable. *Especially* because this girl got pregnant *2 months into the relationship*:\n\n> have only been together for 6 months, and she is apparently 4 months pregnant with his baby\n\nOP has every reason to be wary. You're supposed to trust a 2 month relationship with an 18 year commitment, just on their word?\n\n> your son loves her and wants to be with her and **believes this is his child**\n\nCompletely devoid of logic. 4000 upvotes.\n\nThis sub is just gonna jerk off about class politics and the OP's judgy attitude, but she is 100% in the right, and therefore NTA.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "It’s because reddit constantly hates on well-off people, and puts a lot of bias in supporting struggling poor people.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "What happens if they don't work out? In order to get visitation rights OP's son would have to establish paternity 1st and foremost.\n\nI've lived this. I was engaged and had a baby with my fiance. I raised a little boy for 2 years only to find out she cheated on me and he wasn't my child.\n\nPaternity test 100% of the time when unmarried.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 145,
                  "content": "> It's clear OP has doubts about this girl's parenting ability. Which is absolutely fair, because she has a difficult history and she got pregnant less than a year after dating OP's son. Rather than saying \"well there's no way in hell we're going to get behind this one,\" OP is giving their son a chance to bring them on board by showing some definitive proof that their relationship is in good faith.\n\nWhat makes OP the asshole is not the healthy distrust in her parenting ability. That's fair game, she was a drug and alcohol addict, she had a rough childhood I'd assume. This type of person is just very likely to be kinda below average as a parent. And there would be little to no problem if OPs demand would be for her to check in with a therapist a few times to get confirmation that she's on the right path.\n\nBut that's not what OP is doing, OP literally accuses her of either cheating (2months into the relationship) and/or having a little cuckoo baby. OP is literally lying to us when she claimed it's untrue that she doesn't like her sons GF, because she very clearly dislikes her, a lot. OP also implies that she doesn't believe that the girlfriend has the stability to remain clean, you know, rather than supporting her into living a healthy life.\n\nIn the end, OP could be right, sure. We don't know the girlfriend, maybe she's still a sketchy person. For all we know the claim could be justified. But given the presented information OP is absolutely the asshole.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "Not just under a year, about 2 months into the relationship according to OP.",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "> \"We're in love!\" declares the young man with a partner of six months\n\nShe got pregnant after 2 months. 6 month relationship, 4 months pregnant.\n\nIf you don't ask for a paternity test for a pregnancy 2 months into a relationship, you're an idiot. If you think asking for one in that situation makes someone an asshole, you're a bigger idiot.\n\nThe voices calling for OP to just blindly trust the gf and parroting stupid mottos like \"if you don't trust your partner, you shouldn't be in a relationship\" either A) didn't read the whole post/do the math, or B) are just blinded by their politics.\n\nYou would think from these comments that evil witch OP was forcing the son to break up with her, or was pressuring her to get an abortion.\n\nShe is clearly disappointed in what she sees as an unfit match for her son, but is still willing to step up and support the mom and baby... if it is in fact her son's baby.\n\n\"Oh yeah, well she was dishonest about not being judgy!\" Idgaf. It's not \"am I an asshole\", it's \"am I *the* asshole\", aka \"was I in the wrong.\" Nope. NTA.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I'm glad I wasnt the only person shocked to see the \"YTA\" verdict... \n\nI think OP's suspicions are reasonable to be honest...",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": ">A lot of young people tend to believe their partners to a fault. \"We're in love!\" declares the young man with a partner of six months.\n\nThis is why my brother is now stuck financially supporting a child that is not his for another 15 years even though he is most certainly not \"in love\" anymore.\n\n\"She'd never lie to me!\", he said.\n\nExcept, she did, and the law doesn't care he is not the biological father because he \"agreed\" to be the dad at the time the little girl was born and is keeping him on the hook for supporting the child.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Not even 6 months. She got pregnant after 2 months. No matter who you are that’s just irresponsible. You don’t have a baby with a bf/gf of 2 months.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Thank you. I was confused at the amount of people bandwagoning on this. \n\nThis mans adult son is asking for financial assistance. That son is 24. Instead of outright rejecting it and saying he is not going to help he is asking for genetic confirmation. \n\nYes he is being judgmental but its not without reason. His son’s girlfriend already has a history of making bad decisions its not like he is pulling this out of thin air.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Exactly, people calling the OP TA are delusional, we are talking about 2 fucking adults in their mid 20's, is not 2 14 year olds, they are in their freaking mid 20's. They ask for money and OP laid the term for them to get that money and they are going to act all offended, after they offer him a job that is going to set him for life. Fuck that OP son is the one acting entitled, is your fucking kid, be a man step up yourself, OP and her husband don't owe anything to the girl, the baby or their son cause once again mid fucking 20's.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "T-H-I-S!  I've know several brutal situations where the child was not the fathers and yet the female insisted on complete emotional and financial committments.  Note the emotional trauma suffered by the accussed 'fathers' was terrible and far worse than any financial burden.  In this case, the 'grand' mother is worried.  She's been around.  Is she perfect?  Nope.  She's a mother.  They want her money?  Have a simple test.  This is ridiculous..... and 2019.  I'm also 2 yrs booze free and, no, any kind of 'judgement' about my former behaviour would not bother me in this situation.  I know who I am.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 837,
              "content": "I don’t know if it matters what he believes. I’m not sure what the issue with the paternity is...",
              "id": 30,
              "comments": [
                {
                  "score": 1015,
                  "content": "Paternity tests imply distrust.\n\nImo in a perfect society they wouldn’t, but we live in this world instead. Most woman would probably be offended by it.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 891,
                      "content": "Yeah, the parents don’t trust her. If she wants their support she should do what she can to make them trust her. If the baby’s father is the dude, there’s no issue.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 489,
                      "content": "Given that out of 8000 paternity tests conducted in a \"family law\" setting resulted in a 23 percent non - paternity rate, It's entirely reasonable to seek a paternity test before making a long term commitment.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "[deleted]",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Isn't what he believes all that matters? Even if this child is not biologicaly his, he believes it is his enough to not want a paternity test so he is willing to raise it accordingly. It will be living as his child so it will be the grandchild of his parents. \nThe grandparents should respect whatever the son decides to do because it will affect his live the most. \nBut if the decision of the son that this is his child doesn't matter anyway, it has to be all about the distrust and dislike of the mother (even when they say they liked her) and that makes the grandparents pretty much A-holes I think.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I mean do you really not see why the insinuation might be insulting?",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "I don’t think she has to help financially at all, they’re both close to kid 20’s.",
              "id": 37,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2466,
          "content": "Also want to call out that a GED is no lesser feat than a high school diploma. They are functionally the same, and in some cases have *more* requirements than a HS diploma.",
          "id": 38,
          "comments": [
            {
              "score": 5035,
              "content": "I respect an ex-addict with a GED who works full time to support herself without parents to fall back on over a kid making a great salary because of nepotism. OP and the son sound lucky to have her in their lives.\n\nEdit: Did not expect this to be my most controversial reddit opinion, but I just want to add to it. I am a privileged white woman with a Master's degree and I've met tons of people like me throughout my life. But if you're ever around someone who has had to fight and claw their way out of hell and in to a meager existence? Shut your mouth for 5 minutes, you might learn something.",
              "id": 39,
              "comments": [
                {
                  "score": 1897,
                  "content": "This is 100% what I was thinking as I read this. I admired this poor girlfriend more and more, even written from the perspective of OP who clearly looks down on her! She is totally on her own, she’s been clean for years, she works full time, she got her GED... sounds like she’s worked hard to get her life on track.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 625,
                      "content": "Sounds like she's doing better than most of us would under the circumstances. I doubt the Op would do that well. She sounds like a keeper.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 540,
                      "content": "Ex-fucking-actly. I also hate people's immediate disdain for addicts who are in recovery. I'm 3 years clean myself and the thought that there are people who would view me as a relapse waiting to happen is gross.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 175,
                      "content": "yeah, it legit almost reads like it's the girlfriend or son writing it from the parent's perspective because of how every detail seems to support the GF actually being really admirable.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Exactly what I was thinking. This poor girl is working hard to turn her life around, despite not having any family. And then OP goes and shits all over her.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Fuck, she may have been an addict and alcoholic due to the depression of losing her parents at such a young age. You shouldnt hate someone because they sin differently than you.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 470,
                  "content": "Not to mention, she’s 24 and been clean for 3 years.\n\n...Something tells me she had to deal with something deeply traumatic and life-ruining at a young age, likely something to do with the fact that she lost BOTH her parents. This girl fucking rallied.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 365,
                  "content": "And who wants mommy and daddy to pay for pregnancy expenses for his child!",
                  "id": 47,
                  "comments": [
                    {
                      "score": 383,
                      "content": "Seriously! Spoiled brat son can’t help out his hard working, pregnant GF and OP thinks the GF is the problem?",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 50,
                      "content": "Seriously... isn't that where a baby shower comes in?",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 262,
                  "content": "Heck yeah, she sounds like a badass. Plus people in recovery tend to have done a lot of soul searching and are kind and humble folks. 3 years of sobriety is a huge accomplishment!",
                  "id": 50,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Thanks, I’m on year 3, went to planned parenthood today, HIV negative! Have to wait on the rest of the results, but I was nervous about that and hepatitis. So we’ll see, maybe once I know I’m clean I’ll be able to date again. Been pretty isolated these last few years,, but I feel a change coming.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "[deleted]",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "If she’s so squared away, how is she pregnant two months into a relationship?\n\nI’d get it if there was mention of antibiotics suppressing hormonal birth control, etc. but there was none of that.",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Some people in recovery are like this.  Some are giant assholes.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 124,
                  "content": "YAS!! My thoughts exactly. I’m proud of this chick. She can overcome addiction and the lose of bother parents. She’s gonna be a kick ass momma",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 86,
                  "content": "Yes! Also her parents died when she was young, no wonder she is an ex addict. How the hell is a kid supposed to deal with that with no support. She was smart and strong enough to pick up the pieces and get back on track.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "I was just thinking this!! And not to mention that her parents actually dying very early in her life might also explain the other things OP doesn’t like about her .... sounds like pretentious rich ppl to me",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Right?! OP sounds like such a judgemental bitch.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Ehhhh don’t know if I’d go *that* far. Sure it sounds like she’s weathered through some very tough times and that’s commendable, but to say that OP and son are lucky to have her get pregnant after 2 months of dating is a huge leap",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 733,
              "content": "Work in education, can confirm. GEDs are easily harder to get than a high school diploma. Testing standards are higher.\n\nI got my diploma just fine with all Ds. That shit won't fly with a GED.",
              "id": 60,
              "comments": [
                {
                  "score": 253,
                  "content": "Left HS and had to take  a proficiency test, so on paper I 'barely finished HS' because the grade we get doesnt show to others. Mine was 93% of the entire national testing (which would have put me as honor student in a regular school. I HATE when people downplay what is required on a proficiency/GED :(",
                  "id": 61,
                  "comments": [
                    {
                      "score": 136,
                      "content": "Meanwhile I DID barely finish high school. I had a shitty home life at the time and I came back with a vengeance in college, so I don't beat myself up for it, but even though it was on terrible grades, no one has ever questioned the legitimacy of my diploma the way people shit on GEDs.\n\nIt's so stupid.",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "[deleted]",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Bullshit. It's only harder for incompetent D students",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "High school dropout with a GED here, your statement is a fucking joke if I've ever heard one. I could have shat alphabet soup onto the GED test and probably passed.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Thats bullshit.  GEDs can be had with a couple months of work, a high school deploma takes years and often means having to complete, with competency 990 hours of school work. Are there shitty high schools? yes.  Are there academically challenging and prestigious GED programs, NO.",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yeah no way, a GED takes minimal effort and can be completed in a way shorter amount of time....",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "LOL. A GED is absolutely a lesser feat than a high school diploma. It says the person was unable to finish high school in the standard manner, which is a trivial task.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1095,
          "content": "Also, OP sounds like a snob.  She is only a waitress?  Clutch the pearls!",
          "id": 69,
          "comments": [
            {
              "score": 1161,
              "content": "Unlike her precious son, who will join his father's already established business at some future point, making him somehow better than his gf who supports herself now, having lost both her parents.",
              "id": 70,
              "comments": [
                {
                  "score": 861,
                  "content": "It's bizarro world.  A self-made woman who got her GED despite her parents both dying is somehow not good enough for the Heir Apparent.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 393,
                      "content": "And why doesn't her precious boy seem to be employed at 24?",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 151,
                  "content": "Look how amazing and special our son is for receiving this life we are going to hand to him on a platter.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 9,
                      "content": "[deleted]",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "So he gets the easy good life handed to him, and the girl who's had a hard life is working her ass off is not good enough for that? Can he even do his own laundry? Have him get. Job and pay the pregnancy expenses, it's his kid too. She deserves better.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I hope this capitalist bitch is reading this thread.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 869,
          "content": "OP you only assumed she must have gotten pregnant by someone else because you look down on her... I mean wtf do you mean you don’t dislike her? Oh it’s just that she used to be a drug addict so she must be a cheater or a liar? Yiiikes.\n\nOf course YTA Op.",
          "id": 77,
          "comments": [
            {
              "score": 69,
              "content": "And was she an addict or a kid who used drugs and then quit?",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 445,
          "content": "Absolutely. You’re making excuses as to why she could be dishonest. It sounds to me like she is doing well as far as recovery, she also got her GED, so what, are you that much of an AH to not see she has tried and succeeded so far to survive with little to no support. Her parents passed away so even her family can’t step up. \n\nIf your family is well off enough you could at least support her through the pregnancy and maybe then it would be easier to get a paternity test once the baby is born. \n\nIf they were married would you be questioning the paternity?",
          "id": 79,
          "comments": [
            {
              "score": 26,
              "content": "I'd have a few concerns if they were married and 4 months pregnant within 6 months of starting a relationship.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You fail to mention she gets knocked up 2 months into a relationship (unplanned) which means she's still not making great choices although OP's son is equally guilty here... And that's just what a child needs! Yay for 2 irresponsible parents.\n\nAlso paternity tests are easy to do before birth as well, these days, it just costs more but that's not a problem if OP is getting the bill.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 384,
          "content": "Obviously YTA. It seems you’re operating from a biased and paranoid stance. You have zero hard evidence to support your *theory* on why she’s trying to “trap” your son. Also, the things you are judging his gf for are the exact things that make her fucking resilient. That is, in the aftermath of great devastation (i.e., the premature deaths of *both* her parents), she still managed to eventually get her GED, fight her way to sobriety (which for the record is understandable that with zero support she would turn to drugs and alcohol to help numb the pain) and tirelessly fight day in and day out for her sobriety and she just recently celebrated 3 years? Wow. Your son is lucky to be with such a strong, resilient woman.",
          "id": 82,
          "comments": [
            {
              "score": 170,
              "content": "[removed]",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 219,
          "content": "And that they don't like her because of her upbringing and struggles with addiction. Definitely YTA.",
          "id": 84,
          "comments": [
            {
              "score": 111,
              "content": "[deleted]",
              "id": 85,
              "comments": [
                {
                  "score": 6,
                  "content": "One year of sobriety for me. It makes me feel a little bad that they are people thinking like op. In a way, I can understand... but it hurts.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Congratulations! That’s such a huge accomplishment.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": ">SAYS she's been clean for 3 years.\n\n>ONLY graduated with a GED. \n\nThey clearly don't trust, and look down on, their sons partner. I'm glad their son realizes that people can go through struggles, and most do, and can still be decent, honest people. Accusing a woman of trying to foist another man's baby off on a man is a pretty dire accusation. I would never make that accusation without some history of dishonesty of infidelity. They've known her for at least 7 years, since high school. OP didn't mention girlfriend being a liar, just no quite good enough for their family.\n\nYTA OP.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Lmao. I was literally about to say... Everything OP says in the beginning is throwing shade and is derogatory towards this woman. And it's clear that the way it's written, OP has no clue how she comes across thinking like that. \n\nBasically calling the girl a gold digging drug addict who she doesn't want to be the mother of her first grandchild. Give me a break. YTA.",
          "id": 89,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "At no point does she say she doesn't like her.  She just doesn't want to be her mother in law.\n\nJesus...\n\nNTA",
          "id": 90,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12291,
      "content": "YTA. Your son believes in treating his girlfriend's pregnancy as his, so follow suit. You under no circumstances are obligated to assist financially regardless of who the father is, but your disdain and judgment is incredibly vulgar and you ought to be ashamed of yourself.",
      "id": 91,
      "comments": [
        {
          "score": 3580,
          "content": "Right?! I was blown away by how OP says 'i don't dislike her' and then goes so hard against her, all but saying \"she isn't good enough for my son.\" So glad another person agrees, YTA..",
          "id": 92,
          "comments": [
            {
              "score": 2034,
              "content": "“She isn’t the person I saw my son with” aww I’m sorry, he didn’t manage to find that ridiculously good looking heiress to her daddy’s fortune woman who has her life perfectly in check and high grades, a college degree and a university degree.",
              "id": 93,
              "comments": [
                {
                  "score": 2136,
                  "content": "And Op has zero empathy... sounds like her life was thrown into chaos because HER PARENTS DIED? Small wonder why she got into drugs. And she pulled herself out of that — wow! She sounds amazing? Not everyone has the willpower to turn their life around after being devastated like that.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 608,
                      "content": "I lost my adoptive dad/biological grandad 3 years ago and I didn’t turn to alcohol or drugs, but my god losing a parent fucks you up big time. It’s the worse depression I’ve ever had in all the years of depression. I had to get counselling. Especially losing a parent at a young age. It’s not hard to realise this girl turned to drugs to cope with a hole in her life. Something this MIL doesn’t seem to get. Nor does she get that she’s been clean for years.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 112,
                      "content": "Damn straight, the GF sounds like an absolute wonder woman.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": ">a college degree and a university degree\n\nis that not the same thing",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 310,
              "content": "classic, \"I'm not a racist but...\"",
              "id": 98,
              "comments": [
                {
                  "score": 23,
                  "content": "This is why you don't listen to what people tell you about themselves you look at how they act.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 115,
              "content": "Right? Dislike doesn’t mean detest! I can believe that they might not hate her, but wow; it’s pretty clear there is some dislike there!",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Clean for 3 years is fucking impressive. I dont think that should be downplayed.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "But you don't understand, OPs family is better off and the gf is just a lowly drug addict turned waitress!\n\n/s",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Exactly this. I thought this was some kind of r/justnoMIL troll post when I read it. I'm sure the girlfriend will be browsing that sub once OP actually becomes her MIL...",
              "id": 103,
              "comments": [
                {
                  "score": 5,
                  "content": "100% this woman will have a nickname on there soon.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 254,
          "content": "Not to mention OP only sees her as a walking incubator at best. If the baby IS his , of course.I will welcome her!! Cool, nice to know she's a shit person but grandfathered in by the virtue of being a sperm holder. As soon as that baby is born she'd go back to being treated like shit hey",
          "id": 105,
          "comments": [
            {
              "score": 52,
              "content": "She'll be treated like shit from the get-go because OP thinks she and her son are better.",
              "id": 106,
              "comments": [
                {
                  "score": 67,
                  "content": "That’s because her son is obviously amazing. He managed to...be born...and...have a living father with a company he can work at. Not like that shiftless grifter with the dead parents.",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "She sounds like she is going to be a miserable MIL.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 236,
          "content": "It says so much that they weigh her genuine efforts to improve her life against the son's exceptional ability to be gestated in the right uterus and find that it is her that is wanting.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "Plus paternity tests during pregnancy are not nearly as safe as just getting a paternity test once the baby is born. OP is asking the GF to do something that is actually potentially risky, all because of a baseless suspicion. YTA.\n\nEDIT: Looks like NIPT is an option, but a costly option at that and still an asshole move when the actual father of the baby isn’t even worried about paternity.",
          "id": 110,
          "comments": [
            {
              "score": 38,
              "content": "You can apparently do a prenatal paternity test by testing the mother's blood these days, which is safe, but it's rather expensive and there are still the other issues of demanding a paternity test...",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "They actually have his new thing called NIPT— non-invasive prenatal testing— where they draw the mother’s blood and baby’s DNA can be found floating around in there (it’s basically debris from the placenta if that makes sense) which they normally use for detecting genetic disease, but could absolutely use to test for paternity. Problem is it’s not cheap.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": ">You under no circumstances are obligated to assist financially regardless of who the father is\n\nWell that’s what this is about right? She’s not obligated to financially assist the child but the son asked her to. So she said she would under the condition that the girlfriend gets a paternity test. I don’t really see the problem here honestly.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Then the son should pay for it. If he wants mommy and daddy to pay for it then he should be willing to give them peace of mind. He can do whatever he wants with his money, but he shouldn’t expect others to do the same/have the same standards.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Jesús Christ. Just because he’s love drunk on some chick that he’s been dating for 2 months doesn’t mean that OP should just accept this child that may not even be his.",
          "id": 115,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5507,
      "content": "INFO\n\nWhy does your son not take responsibility for his own actions and support the GF himself?\n\nWhat kind of pregnancy items does someone need at 4 months?",
      "id": 116,
      "comments": [
        {
          "score": 3368,
          "content": "Probably stuff like prenatal vitamins, obgyn check ups, maybe other stuff if she’s having a particularly hard pregnancy. Doctor visits can add up to be quite a bit. \n\nNot to mention at 4 months you’re in the “safe zone” so maybe they’re starting to buy baby stuff for it’s nursery or breast feeding equipment? \n\nNot to mention if they’re in the US, they’re looking at at least $5000 of bills for the labour alone.",
          "id": 117,
          "comments": [
            {
              "score": 1711,
              "content": "I keep forgettig  how expensive any medical is in the US. Still, the son is an adult, if he wanted to be a father he should have ensured he could afford it.",
              "id": 118,
              "comments": [
                {
                  "score": 867,
                  "content": "Oh yeah, you see photos of bills women post for simple checkups and the sums are mind blowing. \n\nAnd the girlfriend in question doesn’t have health insurance so she’s probably going to be in debt by the time her baby is born. Even if the son makes money, he probably doesn’t have enough savings to pay everything off immediately. \n\nBut as you said, they’re both 24 as nice as some help would be; they’re not entitled to his parents money. Especially as the pregnancy bills are only the beginning.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 299,
                      "content": "She should qualify for Medicare which should cover most, if not all, of the expenses.\n\nEdit: Thank you to the fifteenth people who told me Medicaid, I get them mixed up\n\nEdit 2: Make that twenty",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Hell, even as someone who has never been pregnant before, I had to dish $150 out of pocket for an ultrasound to check on my IUD. \nWithout my insurance paying some of it, my bill would have been over $316. Not a whole lot of people can afford to just pay that. \n\nI can't even imagine the cost of pregnancy, especially since there are so many more ultrasounds and scans involved with pregnancy and childbirth as compared to a healthy and nonpregnant female. \n\nI have seen medical bills where women got charged to hold their child after it was born? Like, literally got charged $30+ for skin-to-skin contact between momma and baby. It's insane.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "If she’s in the US being pregnant and uninsured almost immediately qualifies you for med assistance.",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 88,
                  "content": "condoms and pill aren't 100% reliable",
                  "id": 123,
                  "comments": [
                    {
                      "score": 13,
                      "content": "WHAT?! They should put that on the box.",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 43,
                  "content": "It sounds like it wasn’t a planned pregnancy, but I can tell you that it’s difficult to be able to afford even if it’s planned. I gave birth 3 months ago and with my kid being in the NICU for 5 days, plus my C section the original bill was $90,000 before insurance negotiated it down to 30,000 or so. I owe like 5,000 of that on top of the 2,000 I paid out of pocket for prenatal care. I have a good job and I’m still paying it off on a payment plan.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Just after getting home from giving birth, I noticed a piece of mail from my insurance company that had arrived the day I went into labor.  It was letting me know the list of hospitals that were no longer “in network” for my insurance.  I think my heart skipped a couple beats, but the one I’d happened to use was still covered.  It could have been bad.",
                      "id": 126,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Not everyone who gets someone pregnant wants to be a father.  Not everyone who gets pregnant does so by being irresponsible.",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "It's still fucking mind-blowing US doesn't have mandatory health care for everyone which covers shit like this. Most of the times any checkup bill is the same amount as a year of paying for health care",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Who needs eugenics when you have economics?",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "It blows my mind that you pay for babies in us! I had a very complicated pregnancy which required 3 months stay in hospital until the birth then mental health treatment afterward for post natal depression. Total cost= 0, thank the gods for the NHS!",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 278,
              "content": "But OP says son is working for daddy’s business and apparently is gonna be making bank. He’s supposedly **way** better off than baby-momma although OP has shit for class. Why son can’t pay for his GF’s needs is beyond me.",
              "id": 131,
              "comments": [
                {
                  "score": 183,
                  "content": "Because in wealthy families the grandparents will buy all the major expenses for their 24 year old son who will, but isn’t yet, making bank. Things like that are one of the many great ways money is moved between generations tax free. Just cause the kid isn’t rich yet doesn’t mean the grandkids suffer in the grandparents eyes. Op is expecting to do so for her son hence post. Can’t have a grandchild in a $50 stroller when a top of the line bugaboo is better, and you need that thousand dollar car seat too. Stuff like that.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Don’t forget they’ll also judge TF outta those who *actually* make something of themselves. I mean the **nerve** of that “girl” (who’s 24 fucking years old, she’s a woman). She dealt with being parentless, addiction, sobriety and obtained her GED—all by 24. And OP judges her? \n\nOP is gonna regret this. She’s gonna spend the rest of this child’s life regretting this. Ten bucks the mother of the child ends up being a *way* better person than OP and actually forgives them.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 190,
              "content": "It was $13,000 for me to have my first child. That’s just the hospital portion. Not including the $1200 bill from the anesthesiologist for the epidural and the $7,600 from the OBGYN for prenatal visits, and $3,000 for the ultrasounds. Granted we have insurance. But we still ended up owing a lot.  It will obviously be different in different states/countries.  \n\nEdit:  a word.",
              "id": 134,
              "comments": [
                {
                  "score": 95,
                  "content": "Indiana, c-section. They billed about $56,000 in all , so doctors visits, ultrasounds, labs, delivery, hospital stay. \n\nThe insurance I was lucky to still have through a parent took a $40,000 discount, paid $14,000.\n\nI also qualified for medicaid. That paid the $2,000 I didn't have for the deductible. \n\n(I then turned 26 the next month after having my baby and lost the health insurance through my parents.)",
                  "id": 135,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Absolutely fucking insanity",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Here in Sweden the government would be executed for high treason for billing a fucking dollar for child birth, hell any operation costing more than parking and some stress eating would make heads roll.",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Why don't you move to somewhere like Scotland? The weathers shite but we all speak English (kinda), we love immigrants, have free health care, no severe racism problems,  housing is cheap (compared to the rest of the UK) and plus we're not English. You'll have a great time here.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "This thread is sponsored by the European Health care system!\n\n\"Don't want to be broke because of life? Come to Europe!\"",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Same here in Texas! In my region we’re one of the most “low cost” regions and for my obgyn visits we paid 5,000 (WITH A DISCOUNT bc it’s my first pregnancy and that’s only if I had a normal pregnancy ) and for the hospital we’re paying another 5,600- and that again is with a discount bc my doctor is affiliated with the hospital. It may not sound like a lot but my husband and I are paying out of pocket and having to come up with 10,600 ish bucks in only 9 months is TOUGH",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "[deleted]",
              "id": 141,
              "comments": [
                {
                  "score": 5,
                  "content": "And because the pregnant women is now considered a family of 2 so her income limit is measured by that fact.",
                  "id": 142,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "She is a pregnant 24 yo waitress. It’s quite likely she qualifies for WIC and Medicaid. The presumed father can buy ginger lozenges and maternity clothes. I became pregnant with my first kid at 24. That’s NOT a young pregnancy. The parents can deal with it. But, yeah, grandma hates mom.",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1152,
          "content": "I’m a little surprised at the Y T A’s in here. NTA for me. Mostly because of this. He’s 24. Whether he or anyone else likes it or not they are coming to mommy and daddy for financial help for something they did to themselves. It can come with stipulations if mommy and daddy decide. Also surprised that people are being so critical of the parents with the girl’s background. I’d want to proceed cautiously as well. Addiction is no joke and you’re going to be in for a ride and likely some tough times. \n\nHowever, OP you need to consider your plan if he isn’t the father but still wants to be dad. He could like this girl enough it doesn’t matter.",
          "id": 144,
          "comments": [
            {
              "score": 369,
              "content": "It's a matter of motivation more then action. Op comes off as judgmental and their support as conditional upon their son doing as they wish.",
              "id": 145,
              "comments": [
                {
                  "score": 406,
                  "content": "In reality, their support is conditional upon proof that the grandchild they'd be supporting is theirs.\n\nNot sure why two working adults aren't supporting themselves, though, and just expect the grandparents to foot the bill no questions asked.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 148,
                      "content": "That grandchild, even if it is theirs, is not their financial responsibility.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "IMO, that's the real issue. I don't understand the sons anger. Its not OP's kid.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 198,
              "content": "Yea she may be an ass but she isnt wrong to protect her finances and family. \n\nThat being said she does sound anti mom in the original post and she does risk driving her child and grandchild away and this in four months.\n\nI think medicaid for the mom, maybe even help her fill out the forms, and some budget help for dad should doable until paternity is established.\n\nOP you may need to get use to this being your son's future though.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 484,
          "content": "Exactly. They both have jobs. He's working so why should his parents foot the bill?",
          "id": 150,
          "comments": [
            {
              "score": 244,
              "content": "[deleted]",
              "id": 151,
              "comments": [
                {
                  "score": 281,
                  "content": "The post says the son is pushing for his parents to help with pregnancy expenses, that makes the son TA not the woman. It is perfectly reasonable for a pregnant woman to ask her boyfriend to help with pregnancy expenses.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 37,
                      "content": "[deleted]",
                      "id": 153,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I imagine the son has been coddled all of his life and he's used to just asking for the things he wants/needs and they are delivered to him with a bow on top. \n\nThe tone of OP's original post makes it very clear that they have their son's life path all planned out for him going forward.",
                      "id": 154,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "Except I thsus case it would seem that the parents would be happy to help but only if the gf meets mom's moral standard.",
                  "id": 155,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 303,
          "content": "I got a chuckle out of this.\n\nHer **24 year old son** is coming and asking for help to pay expenses.  Where is his job?  The nice fancy, well-to-do one with the pointlessly huge nepotism salary?  \n\nDo they pay for his rent, bills, and car, too?\n\nI feel bad for him in a way.  That ragamuffin street urchin that he's dating might actually pull him back down to Earth if OP doesn't watch out.",
          "id": 156,
          "comments": [
            {
              "score": 12,
              "content": "Did you even read the post? He WILL have that job, he doesn't yet",
              "id": 157,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Having a kid you can't afford is like totally cool, but someone else not wanting to pay for that adult's kid is like totally bad.\n- Reddit",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "I’m wondering if it’s more about OP’s son just wanting his parents to be involved and show that they support her.\n\nOP, weigh the cost of possibly helping a young woman whose own parents are DEAD get through a pregnancy & have a healthy baby that may or may not include any of your own personal DNA, vs. the cost of alienating your own son and the mother of your first grandchild because you assumed she was unworthy of your help.\n\nSince you obviously can afford it, you could help her regardless just to be a good person.  If you don’t, you better hope to God your suspicions are correct because they are never going to forget your choice.",
          "id": 159,
          "comments": [
            {
              "score": 16,
              "content": "That would be a great kindness, but it's not in this woman's wheelhouse.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "He has been, but since he is still getting started he doesn't have that much money of his own yet. The expenses have mainly been medical bills, as she doesn't have insurance right now.",
          "id": 161,
          "comments": [
            {
              "score": 607,
              "content": "Hey, I'm not going to say you're an asshole, but I want you to hear what I have to say. \n\nAt 18, I was a senior in high school and met a guy I began what was supposed to be a fling before I went to college the next year. Despite birth control, I got pregnant either the first or second time we had sex. He was a pothead with no job. We were both from low income families. \n\nRumors started flowing through his family and friend group about 2 months in, that I was trying to pin the twins on him and they belonged to a friend of mine. By 4 months, he had ghosted, I had basically told him to either make myself and our unborn children his priority or get lost and I'd call him when I went into labor. I was finishing highschool with straight A's. I felt like a loser because my child's father was a worthless deadbeat. It was extremely mentally stressful.\n\nI went into labor at 24 weeks, gave birth via csection at a rural hospital without the supplies needed for micropreemie care. He showed up drunk not long after I woke up from anesthesia and was welcomed in by my family because the girls' prognosis wasn't good. \n\nThe hospital kept my babies alive until a larger hospital could come get them. I allowed him to stay with me in the hospital because I didn't want to be alone, while I was doped up, he tried to convince me to change their last names to his instead of mine, which I refused. That next night, we received the call that twin A had a massive brain hemorrhage and wouldn't live long enough for us to get there to say goodbye. I left AMA to get to her, my relative drove us the 3 hour trip. \n\nTwo days later, his mom and dad come, they see my critically ill babies, fighting for life, and his father quietly tells him after they leave the room that he needed a paternity test asap and not to sign any papers or give me any money or support until that happened (remember how I said he was unemployed and broke? Yeah, MY family was the ones helping us). I felt disgusted at them, my babies were fighting for their next heartbeat, not expected to survive, and he's worried about paternity?!\n\nIt was a continuous discussion for the next two weeks he was there, I welcomed the paternity test, but he had to pay for it and the hospital wouldn't do it. He could have begged his parents for the $100 to get a test done, but he didn't. \n\nHe left when they were 2 weeks old, returned once when twin A had a crisis and was expected to die, left after a few days, and returned again once more when she was getting her trach put in and I needed him to get training to care for her or she wouldn't be allowed to come home, (there had to be 2 people, and no one else would do it). He left again and she died in the hospital at 6 months, a month after her twin was discharged. \n\nI personally drove to his home to invite him to her funeral, told him the day and time, and let him know that the funeral home wouldn't publish her obituary including his name or his family's name unless he came and gave permission. \n\nHe didn't show, neither did his family. His best friend that introduced us came and I appreciated him coming to acknowledge her and her twin. When asked directly after the funeral via text why he couldn't even honor her in death, he replied that it was his mother's birthday and he had plans already. \n\n2 months later the paternity test came back on my surviving twin, positive of course, no apologies from his family for their disgusting behavior. But I made him suffer, not for doubting me, I understood that, but for dishonoring my now dead child by denying her a father her entire life and I her death, she didn't deserve that. I made him look at her pictures and her ashes, and told him that wasn't his daughter because he threw her away, she was so sick and needed him and he threw her away. \n\nTo this day, no one in his family is allowed to claim my oldest daughter, she is mine and mine alone. I have a strained relationship at best with them, best with his mother after I made her sob in despair over the life of my oldest daughter that meant so little to her, made her realize how badly she messed up, that she'd tossed her grandchild in the garbage metaphorically and that I'd never forgive it and that she'd never have the privilege to claim her. My oldest daughter died without a father on her birth certificate, legally, she doesn't have one and she never will. \n\nI tell you all this because you underestimate the hatred a mother can have if she feels you've hurt her babies. Your behavior can directly affect not only your relationship with your son, but your grandchild, because if something happens to that baby, the mother will never forget your rejection, it will eat her up and make her hate you. \n\nIt seems to me that the safest bet you can make is to apologize and help. If the baby is your son's, then you begin with a good relationship, if the baby isn't, then you're out a couple thousand but get to maintain your dignity and integrity. Either way, if you reject this baby right now, it will strain the relationship with your child and possibly break it.\n\nETA- OP, what I really want you to think about is this, do you want to be right or do you want to be happy? I don't forsee rejecting this baby as anything that will bring you happiness.",
              "id": 162,
              "comments": [
                {
                  "score": 146,
                  "content": "Damn, I think this settled a few things for the OP if they read this. What an asshole of a sperm donor.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 96,
                      "content": "I married him....... 5 years this past October. Very long story involving a lawyer telling me that he could get joint custody of my special needs surviving infant with no care training to make sure she doesn't die. \n\nHe's grown up a lot. He's my best friend and a great father now, though he still can't call my oldest daughter his, it's a hang up I haven't been able to shake. \n\nHe can say what he wants, but I'm pretty confident that he was just a scared 20 year old that didn't want to grow up yet, so latched onto the rumor, then when they were born sick, latched even harder because it's SCARY to have foot long, see through babies and a bunch of doctors throwing long, confusing words around, there's hoses and cords everywhere and machines beeping and numbers changing and you're exhausted but if you close your eyes, you're scared you'll sleep too hard and you'll wake up to the news that they died while you slept. \n\nWhen twin A died, he latched even harder, because if he didn't look at her body, didn't acknowledge her existence and death, he didn't have to face what a shit person he was for never knowing her. \n\nI watched parents up there pull support for babies that would've been fine in just a couple months, they couldn't handle it. In some ways, it's easier for those people to have a dead baby than a sick baby, you don't have to live in limbo or invest part of your soul into someone that might leave you. I was the opposite team (I've noticed it's usually complete rejection of sick babies, or complete obsession, very little in between), I HAD to invest my entire existence into them, I had to let them know how precious and important they are, I had to do everything I could to convince them to keep fighting and stay with me.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Damn...",
                  "id": 165,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I'm so sorry about your child. Internet hugs from a stranger <3",
                  "id": 166,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Thank you, she was very important. She was sassy and strong and just beautiful. Every day without her is another day closer to being with her and my lost son again.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 321,
              "content": "Has she applied for Medicaid? They'll often pay bills she got before she was approved, if they're for this pregnancy.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 164,
              "content": "So he decided to become a father knowing he couldn't afford it and expecting  you to cover him. If you raised him that way then it's no wonder he expects you to cover his ass. I think you are entitled to ask for a paternity test  but I also think it's time you let go of the apron strings and he learns how to be a responsible adult in the world and steps out on his own.",
              "id": 169,
              "comments": [
                {
                  "score": 108,
                  "content": ">I think you are entitled to ask for a paternity\n\nI can think of very few circumstances where someone who isn't a parent or a child is \"entitled\" to a paternity test.\n\nThis is not that set of circumstances. OP can help or not that is their right, but they're not \"entitled\" to anything.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 20,
                      "content": "> This is not that set of circumstances.\n\nNot sure what you mean by \"entitled\". OP is fully entitled to say \"do X if you want my money, or best of luck to you otherwise\". It's *not* a life-and-death situation, just helping out with pregnancy expenses that the couple should be paying on their own anyway.",
                      "id": 171,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "They mean entitled to a test *to get their support.*",
                      "id": 172,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "They are entitled to put whatever conditions on THEIR money that they want.  If you are asking me for money, I'm entitled to say that you have to put on a chicken suit and sing \"Go Go Power Rangers\" in order to get it. You have to right to refuse.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I said \"ask for\". If someone asks me for a loan, or a straight out gift, I am entitled to ask for any terms I require. They don't have to comply, its their choice.",
                      "id": 174,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 110,
              "content": "You seem pretty up your own asshole about your superior son who doesn’t have his own money, but whose girlfriend actually DOES support herself.",
              "id": 175,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 95,
              "content": "Just to reassure us: did your earnings match your husband's when you got married?",
              "id": 176,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "First nta for not giving money but your attitude stinks.  If she’s waitressing she will almost certainly qualify for help. Your best bet is to apologize but tell them to utilize services. Consider if you want to offer childcare after the baby is born ( if they forgive you and let you). Perhaps offer help with diapers (you can ask if she wants to use cloth or disposable, cloth is a big upfront cost you could help with that will save them a ton of money over the childs first years).  A thing to remember is even if this child isn’t biologically his he may choose to raise it as his and why would you want to miss out on loving an innocent child regardless of biology.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "YTA. You obviously don’t like this girl, but your son feels differently. If you want a good relationship with your son, future daughter-n-law, and grand baby, you need to get over yourself and stop being a snob. You are under no obligation to help due to their ages so don’t help financially if you don’t want to. But if you don’t change your attitude toward his girlfriend, you will drive a wedge in your relationships with them. Think about that while you are putting her down for having a GED. You should be ashamed of yourself. And this is coming from a mother, mother-in-law, and grandmother.",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "INFO: what would you do if they took the test, he was not biologically the father, but chose to raise the child anyways? Functionally, that scenario is no different than the current, as he has decided to raise this child. Is it the DNA that matters to you, or helping your son?",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "You're not the asshole for asking for a paternity test if you're going to be financially involved as it's been a short-term relationship. You are an asshole in general for the way you've written the post which i believe clearly shows you hope it isn't his and won't admit it. You really gave off that two-faced \"I'm a good church going person\" vibe.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "So your son is 24 and an adult and cant even support himself and his child yet you judge this woman? Maybe you should have raised your son better so he wouldnt come running to you for everything",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 56,
          "content": "because lots of reason \n\n* Hospital bills if in usa between $5k and $14k+\n* crib\n* other baby supplies \n* two bedroom home is probably outside there incomes",
          "id": 182,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "Right. He's so \"excited to meet his son.\" Well how about he start by fucking paying for the baby and mother then. Why is he trying to mooch on his parents for financial support for a baby he's totally convinced he made?",
          "id": 183,
          "comments": [
            {
              "score": 4,
              "content": "Because he is waiting for his job to start... like it says in the op...",
              "id": 184,
              "comments": [
                {
                  "score": 4,
                  "content": "I've reread OP twice and nowhere do I see it saying he's waiting for his job to start. He's 24. It's a safe assumption he's working SOMEWHERE. What the post states is that he is is joining his dad's business and will eventually be making quite a bit of money. Why eventually? Why not now? He waiting in a job interview from dad or something? There's missing information here, because for the life of me I can't understand why he is asking for help with his baby momma expenses.",
                  "id": 185,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "I'm exactly 17 weeks pregnant today and my OB has already seen me three times, ordered for me to have two ultrasounds at a special facility, and required me to go for bloodwork multiple times. And that's for a very normal pregnancy where everything has gone smoothly! I just added up all my bills and I'd owe a total of $3,868.16 if not for insurance. Thankfully our insurance is great and covers just about everything, though even then I've still paid several hundred out of pocket. Healthcare in the United States is incredibly expensive.",
          "id": 186,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Agreed. The pregnancy is his and the mother, not his parents. If he is taking it as his own he should support her. There is no reason for his parents to support the pregnancy of a 24 year old couple",
          "id": 187,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4671,
      "content": "[deleted]",
      "id": 188,
      "comments": [
        {
          "score": 1202,
          "content": "A tad? I'd hate to see full blown judgemental, lol",
          "id": 189,
          "comments": [
            {
              "score": 398,
              "content": "\"She's a recovering drug addict\" is apparently more salient information than \"her parents died years ago.\" No shit, if my parents had died before I was 24 I'd probably be a fucking drug addict, too.",
              "id": 190,
              "comments": [
                {
                  "score": 98,
                  "content": "[removed]",
                  "id": 191,
                  "comments": [
                    {
                      "score": 26,
                      "content": "This!! She’s been in recovery for THREE YEARS! That’s a long time! With a baby and a financially stable bf, she probably won’t relapse. This isn’t the 1800s, we don’t marry or have kids with people in our same class. I feel like OP is just shitting on her cause she’s less fortunate....",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Also, some people have wildly different definitions for drug addict/alcoholic. For all we know this girl partied a bit and then calmed down. Some people like to use the addict/recovery label when it’s far from the case.",
                      "id": 193,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "My mom died when I was 13 and I’ve never done anything more than smoke pot. Does that make me better than you or just another normal person?",
                  "id": 194,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 939,
          "content": ">Someone is sounding a tad judgemental.....\n\nA tad... but she DID lead with 'she is a lovely girl'... \\*eyeroll\\*  \n\n\"she says she has been clean for 3 years, a relapse is always possible\"\n\nAnd for someone who's never done any illicit drugs or drunk alcohol, it's always possible they become an addict. 3 years sober is awesome.\n\n(Edited to add a hard return/paragraph break)",
          "id": 195,
          "comments": [
            {
              "score": 438,
              "content": "Also the way OP uses the word says. Not \"she has been clean for 3 years\" but \"she says she has been clean for 3 years\"... Do you not believe her recovery date?\n\nEdit: typo",
              "id": 196,
              "comments": [
                {
                  "score": 33,
                  "content": "Yup.",
                  "id": 197,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": ">but she DID lead with 'she is a lovely girl'.\n\n\"Bless her heart!\"",
              "id": 198,
              "comments": [
                {
                  "score": 12,
                  "content": "That is EXACTLY what my country ass was thinking.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "What stands out to me is the misunderstanding about relapses. Unless you believe in woo pseudoscientific 12 step programs relapses are pretty much expected for people who have addictions, but the frequency and intensity of relapses tapers off for somebody who is recovering. E.g. a person who used be a \"full blown addict\" might have a night where they get drunk and do something stupid years into their recovery... but the consequences of that relapse probably won't be bad, and they probably won't relapse again for many more years.\n\nBasically what I'm trying to say is that there *is* a non-negligible risk that this woman will have a relapse, but it's unlikely that it will destroy her life or the lives of the people around here -- it happens and it's rare for an addict to totally relapse so long as they continue to have the support of their loved ones and they continue to get professional help. Given that OP's son intends to stick around, it is tragically ironic that OP's judgementalness is the opposite of helpful and would actually make a more severe relapse more likely than if she were a supportive MIL. Whatever you need to paint the mother of your coming grandkid as a villain, I guess.",
              "id": 200,
              "comments": [
                {
                  "score": 12,
                  "content": "I agree 100%. My point was only that people with no history of addiction can easily become addicts.\n\nAlso \"woo pseudoscientific 12 step programs\"... seriously. Shame those are so popular despite evidence that they work for few people. But... to each their own, I guess.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 480,
          "content": "My mother in law also erroneously believed I was not good enough for her son and for no good reason, doubted it was his baby I carried. As soon as our son was born, the unusual similarity between his looks and my husband's, his father's, and grandfather's baby pictures was striking. My chagrined mother in law soon admitted \"He's a Johnson alright,\" but in my eyes, the damage was already done.\n\nShe learned a lesson about trusting me and inadvertently taught me the opposite lesson about not trusting her.",
          "id": 202,
          "comments": [
            {
              "score": 15,
              "content": "Don't forget that lesson. People like her don't change.",
              "id": 203,
              "comments": [
                {
                  "score": 27,
                  "content": "Funny story about when I and that husband divorced long after the child was an adult. My ex suggested a joint phone call so he and I were both on the line when he called to tell his mother we were divorcing. In those first seconds when he told her, she didn't yet know I was on the line, so I heard her immediate reaction. \"Be careful and get a good lawyer or she will take your money.\" Now, bear in mind, during the marriage I made slightly more than my husband and we had already agrees to split all assets 50/50. Yep, still a bitch who didn't trust me.",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Go on....",
              "id": 205,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "There's one silver lining to this: your MIL showed you who she is and you have taken note. A\nWhile she is extremely shitty, you won't have to operate under some illusion that she is a decent person only to be blindsided by her shiftiness at a later date and time. \n\n(I'm just saying if all the shitty people could be so upfront about it, we would save so much time. And then we could keep the focus on the people who make the world a friendlier place if that makes any sense)",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 280,
          "content": "Even she did choose him because of a wealthy family, the baby is probably still his, they have been dating and sexually active. I have a feeling that a positive DNA result isn’t going to make OP supportive and welcoming.",
          "id": 207,
          "comments": [
            {
              "score": 38,
              "content": "Exactly. Her main reason for wanting the test is she assumes the gf made a list of men, decided the son is best, and trapped him because she wants support. Which alone is stupid because if he was the best support he wouldn't need their money already but ok. So even if the baby is just that doesn't change OPs mind at all. Because they'll still assume she did it to trap him from a list of potential men  except she's at least not a cheater to do it!",
              "id": 208,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Also the comment about her being 3 years and theres a chance of relapse. A person could be clean for 20 years and theres a chance of relapse OP you AH. Jeez. Get outside your privileged bubble",
          "id": 209,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3543,
      "content": "Yes YTA. Think carefully how you treat her or you may not get the privilege of being the grandparent. If my mil did this I would wipe her.",
      "id": 210,
      "comments": [
        {
          "score": 1146,
          "content": "My father's mother thought I was the product of an affair, instead of my father's biological child. My parents were married for 6 years and already had another child together, so say what you will about the differences in the situation but my mother has never, ever forgiven her for that.\n\nAnd my father's mother treated me like shit my entire life even after it was abundantly clear that I am my father's daughter in every possible way. She's never been able to get past her assumptions. And I don't have a relationship with her. I've seen her exactly twice in the last fifteen years and once was only because my grandpa died.",
          "id": 211,
          "comments": [
            {
              "score": 594,
              "content": "Women like this make toxic mothers and even more toxic grandmothers.",
              "id": 212,
              "comments": [
                {
                  "score": 249,
                  "content": "Yes, yes they do. She was a pretty awful mother to my dad, but he didn't see it as being abnormal until much later in life. If my dad could do it all over again, he'd never have seen his mother again the moment \"well I just don't think that little girl is yours\" came pouring out of her mouth.\n\nSadly, the pressure around \"but they're family!\" won out and it wasn't until my brother and I were adults that she was cut out of our lives aside from very distant pleasantries over Facebook once or twice a year.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Your dad seems great and an all round family man. Sadly some toxic mothers produce the most toxic sons with a lack of basic respect for women. I hate that my ex raped me, but seeing how his mum treated him and his siblings, how much money corrupted her, it’s not hard to see why he thought I was just an object too. Money and status and too much self-pride corrupts people.",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I'm sorry that this happened to you, but I would like to draw attention to your comment for OP's sake. You mention your \"father's mother\" for her and later on \"grandpa\" (for her husband I assume?). OP has a narrow window to decide if she wants to be a grandmother/grandma or a father's mother.",
              "id": 215,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "My father's mother was also like this. My mom had a kid out of wedlock that she put up for adoption when she was 21. She met my dad when she was 25, married him at 30 and had me at 33. As my mom tells it, she told my dad \"if she can have one bastard baby, she can have two\" insinuating that I was not my dad's child. \n\nTheir relationship never recovered, and it didn't help that I look more like my mom than my dad. My sister, however, is the spotting image of my aunties on my dad's side. She always got preferential treatment over me. \n\nTook me a long time to come to terms with all of that, and I only learned what she said to  about my mom after she died.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "OP sounds like an absolute crone.\n\nBaby Momma lost her parents years ago. Probably fell into a bad crowd due to lack of guidance and the trauma of losing her parents. Somehow rises above that to get her GED, stay clean for 3+ years, and now works full time supporting herself.\n\n...while OPs son is riding along on Daddy's coattails to get a golden spoon in the mouth with the family business.\n\nOP you are under no obligation to give money to your son or his Baby Momma.\n\nBut you, my dear, are a massive asshole for your judgement of this young woman. Sounds like she's worth 10 of your son.",
          "id": 217,
          "comments": [
            {
              "score": 29,
              "content": "I don’t feel the son should be thrown under the bus here in the slightest. He’s taking responsibility for the child, he’s defending this girl to his own mother, and all around trying his best. Yeah, he got some really nice setups, but that doesn’t seem to have made him any less of a person. He’s taking ownership and responsibility of the situation even when his mom is trying to stop it. That’s really mature, and absolutely deserves credit.",
              "id": 218,
              "comments": [
                {
                  "score": 8,
                  "content": "Yes but the OP does not value those things. To her, her son is valuable because he is set for life in daddy's company. It's gross.",
                  "id": 219,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "THIS is what I came here to find!!! Thank you for a well articulated YTA. I wish I had points to give you gold.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 83,
          "content": "My MIL did do this for much much less. Woman had the gall to tell him husband not to get a vasectomy because \"What if your next wife wants kids?\" She never quite said she didn't think our son was his but the sentiment was there. Took about 10 years to get on good terms.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2677,
      "content": "I think you're probably an AH, but I'm going to say NTA because these are adults and you shouldn't have to pay for her expenses, they should pay for their expenses. \n\nYou do sound like a snob, and it sounds like your son had a lot of opportunities (Like working for daddy and wealthy parents), whereas this girl has had to hustle and struggle.",
      "id": 222,
      "comments": [
        {
          "score": 836,
          "content": "I read it more as he asked for help and a simple no would probably not have caused as much friction as the implied accusation of infidelity",
          "id": 223,
          "comments": [
            {
              "score": 460,
              "content": "I agree.\n\nHe's angry because OP accused his gf of cheating and lying to him, not because they refuse to help financially.",
              "id": 224,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Lol not even implied and I'm sure mother has made her feelings known. Self made woman who works hard, finished school, overcame a problem, without any family support... and yet she obviously picked her son off a list to support her, despite him needing help with money already, so obviously not a lot of support if that's all she wanted! \nI'd be angry too. Not just accusing me of being a cheater but being a liar, lazy, gold digger, beneath you because I'm just a waitress.\n\nLol her edit implies its mixed (it's not) and she only comments on people that agreed the girl is lying or men that wish they knew sooner. Nothing about anything else!",
              "id": 225,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "This! Jesus christ the accusation of cheating would be enough to ruin any relationship I had with this woman if I was the girl.",
              "id": 226,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 161,
          "content": "This, entirely.",
          "id": 227,
          "comments": [
            {
              "score": 104,
              "content": "i mean, you can't just say \"you are adults it is your responsibility\". instead you need to accuse infidelity. thats asshole stuff.",
              "id": 228,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "Well said. Probably NAH then as son and his GF certainly aren’t assholes.\n\nWould also like to add that for a couple that’s only been dating for 2 months, a paternity test is probably always a good idea. OP certainly doesn’t have much respect for her sons GF though.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "she doesn't have to do anything she doesn't want to do. but if the reason she doesn't want to support them (whereas she would have otherwise) is because of her prejudices- then she is the asshole.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "She’s NTA for not wanting to pay unless knowing it’s for sure her grandchild but she is TA for how judgmental she is.\n\nNot gonna lie though if I was a mom I’d be suspicious of my sons’ gf getting pregnant two months into the relationship. I wouldn’t automatically think she was a gold digger but I would think something was off. Women in their right mind don’t want to be pregnant with their bf of two months baby.",
          "id": 231,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Agree with NTA and the snob bit. They want to keep the baby then it's up to them to be financially responsible for it.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "How the hell is this not the top comment? They are 24 year old adults, OP has absolutely 0 obligation to fund their unplanned pregnancy.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Sure OP sounds like a snob. But I think a paternity test in exchange for financial aid that the vast majority of other new parents wouldn’t receive is fair play. I’d honestly want the same thing, but it is obvious OP doesn’t like this girl.",
          "id": 234,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1339,
      "content": "YTA Because he clearly is planning to be the father of this baby, so the genetics no longer matter. If he's going to be the dad, then it's his kid too and your first grandchild.",
      "id": 235,
      "comments": [
        {
          "score": 515,
          "content": "Any guy can be a father, not every guy can be a dad.",
          "id": 236,
          "comments": [
            {
              "score": 150,
              "content": "But he can't afford it and is begging parents for money and the kid isn't even born yet.",
              "id": 237,
              "comments": [
                {
                  "score": 40,
                  "content": "Where did you get \"begging\" from?\n\nPlenty of people ask their parents for financial help at tough times in their life. It also sounds to me like OP would happily help out financially if the girlfriend was someone she deemed good enough for her precious son.",
                  "id": 238,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I think he's asking to add her on the company health insurance. She has medical expenses.  It's a much different request, than \"begging parents for money\". He gets his insurance thru daddy's company.",
                  "id": 239,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "For one thing you gotta know a lot of jokes.",
              "id": 240,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "“I’m Mary Poppins Y’all”",
              "id": 241,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 256,
          "content": "Until they do. It is simply impossible to know how he would respond to any news that he is not the father. He himself wouldn't be able to say how he'd take the news.\n\nWhile I think the conditions the OP offered are unsavoury, my bigger question is, why can't their son pay for the pregnancy costs? That isn't OPs responsibility. He's 24. Not a baby.",
          "id": 242,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 228,
          "content": "You're not wrong, but you're making it sound like the paternity is seriously in question, which it isn't. OP doesn't mention any evidence of cheating, she's just suspicious because she judges the young woman's background.",
          "id": 243,
          "comments": [
            {
              "score": 50,
              "content": "Ah I didn't want to make it sound like it was in doubt. More that it only matters if it matters to the father. I know some of my family is not genetically related to me. It's a 100% known fact (well, except in the way all humans are). Doesn't make them any less my family. If someone accepts a child as their family, then it's their family. But yes, there is also no evidence that he isn't the bio-dad. I just don't think it matters unless it matters to him.",
              "id": 244,
              "comments": [
                {
                  "score": 12,
                  "content": "But what if BF/son finds out he's not the father? Can't expect his reaction to be OK with it. He might, but he might not.",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I totally agree, I just think that focusing on that stuff could derail the discussion a little bit.",
                  "id": 246,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "It sounds like wishful thinking.  OP just doesn’t want the baby to be his.",
              "id": 247,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Eh. Friends for years. Get into a relationship. 2 months into the relationship get pregnant\n\n&#x200B;\n\nSounds suspect enough to me. Also OP may not have the evidence they need, since I'm sure whatever info came from the son. And he might not tell them whatever theoretical reason a pregnancy happened.",
              "id": 248,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "That’s wildly naive . If she is misleading him about being the father then he deserves to know.",
          "id": 249,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Genetics no longer matter? What a time to be alive.",
          "id": 250,
          "comments": [
            {
              "score": 22,
              "content": "I'm honestly flabbergasted by the general response of this sub. Not only is it unreasonable to have reservations due this girl's checkered past, requiring some sort of insurance like a paternity test, the consensus seems to be \"who cares if it's his or not?\"",
              "id": 251,
              "comments": [
                {
                  "score": 4,
                  "content": "It’s mostly women who don’t have to face the possibility of raising a kid that’s not theirs. It’s hard to empathize with a situation you can’t imagine yourself ever facing.",
                  "id": 252,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "[removed]",
          "id": 253,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Lol genetics do matter. If I have a kid with a girl and I find out years later it's not my kid, I would still love the kid but I'd kick the girl to the fucking curb. Constant proof of unfaithfulness. Even if I trust me wife 100%, if my mom wanted a paternity test in order to help us out financially, idgaf she can have her paternity test, doesn't matter to me.",
          "id": 254,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "You don’t know that. He might be doing it solely because he believes it’s his and therefore his obligations to raise and support. You can’t say he would raise the kid regardless of paternity from the information given here.\n\nThey are in their mid 20s and while OPs actions are distasteful, they are in no way obligated to give help. So they can put whatever conditions they want for financial help. NTA",
          "id": 255,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": ">\"Who cares if the kid is actually came from him, if she fucked another guy and got pregnant behind his back he at least *thinks* it's still his kid, so it doesn't matter.  See, everything is great! :)\"\n\nI'll take cuckholdery for 500 Adam.",
          "id": 256,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "[deleted]",
          "id": 257,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1224,
      "content": "It’s your money. This seems reasonable. But I’m not sure why you said it’s untrue that you dislike her and don’t want her to be the mother of your grandkids as you basically said everything you dislike about her and that you didn’t think she’d be the kind of person to mother your grandkids. If you dislike her just say it. You wouldn’t be the first person to dislike their children’s SO. NTA",
      "id": 258,
      "comments": [
        {
          "score": 149,
          "content": "I don't get why people are so afraid of having character judgement. If you have that gut instinct about her, then so what, you are allowed to feel that way.. it's your right. \n\nYou cant control this situation though, the overprotective mother strategy doesnt work here. Hes an adult and can do whatever he wants. You dont have to foot the bill though and dangle the family fortune over his head like a guardian angel for his moral compass, guiding him on exactly what to do. That's not how humans work nor should it be.",
          "id": 259,
          "comments": [
            {
              "score": 39,
              "content": "Because it's reddit and any \"gut feeling\" against someone of a lower socio economic class isn't allowed.\n\nSeriously if OP had judged the gf and the gf came from an affluent background (and OP a less affluent background), you would be getting way more NAH/NTA in this thread.\n\nClassic, irrational, \"eat the rich\" mentality. Reddit's bread and butter.",
              "id": 260,
              "comments": [
                {
                  "score": 23,
                  "content": "Oh my god, there IS sanity in this thread! I was really starting to wonder if anyone here was actually reading this post.\n\nOP’s son has been in this relationship for SIX MONTHS. That’s such a short amount of time, and to already have the burden of parenthood looming over them is absolutely indicative that maybe these two people don’t make the smartest life choices (e.g. unprotected sex). I would probably be suspicious, too. Is it an asshole move to hold the gf’s tumultuous past against her? Maybe a little, but the son and his gf aren’t entitled to his parents money at all. NAH",
                  "id": 261,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "It's not a \"gut feeling.\" Being a recovering addict and alcoholic implies a past of very poor decision-making. OP would be irresponsible not to ask for a paternity test as an insurance before investing her own resources into her son's maybe baby.",
              "id": 262,
              "comments": [
                {
                  "score": 16,
                  "content": "Hell, getting pregnant when you can't afford it is bad decision making too",
                  "id": 263,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I agree. In essence, OP is an asshole, but maybe NTA.",
              "id": 264,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "You can be concerned about a person's past without disliking them, especially when that past concerns drug use, and potential relapses. If OP knows that much about her past, I can only imagine how much OP (and son) don't know.",
          "id": 265,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I mean, I have friends I love from the bottom of my heart that I wouldn't want as mother of my children. I think that's fair. You can *like* someone without thinking they're the ideal, responsible person you'd want raising your children or grandchildren. Sometimes it's not even judgemental, it's just knowing they love freedom and would probably deal poorly with being cooped up having to take care of a child instead of going out. Or knowing they're the sort of person that loves fun a tad too much, and you like them as a fun, enjoyable person but you know they're a hot mess by their own admission and don't trust them to have the responsibility to raise a child.\n\nDont get me wrong, OP is a judgmental asshole for asking for a paternity test. The fidelity of his daughter in law isn't his business. But I can see how you can like someone as a person but not like someone as a wife for your son. I'm sure my parents think similarly about some of my friends. They're alright with our friendship and would help the friends in anyway they could, but they'd be very worried if git them pregnant.",
          "id": 266,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 865,
      "content": "This is disgusting if it’s a real post. You’re judging the girl on her past and assuming she’s so below your son that it’s definitely not his. What has your son joining his dad’s business got to do with her? What? Is it going to reflect badly on him? Is it him ruining his life being with her and his child? You really need to get to grips with reality and stop trying to find loopholes in this all being true. It’s disgraceful.",
      "id": 267,
      "comments": [
        {
          "score": 472,
          "content": "To be fair they had only been together a very short time at the time of conception. It's really not all that outlandish to think it could not be his",
          "id": 268,
          "comments": [
            {
              "score": 328,
              "content": "People get pregnant from one night stands. Length of relationship (or existence of one at all) does not dictate if an egg will be fertilized.",
              "id": 269,
              "comments": [
                {
                  "score": 86,
                  "content": "Not commenting on the OP but length and existence of a relationship are pretty much the primary factors you would look at, statistically speaking, in making an educated guess of paternity.",
                  "id": 270,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I’m pretty sure that isn’t the point at all. Obviously longer relationships have a bigger chance cause more sex, but I’m pretty sure the implication there is that often when people are dating and early in relationships people aren’t always exclusive until it’s agreed upon and they actually become a couple. There was almost a month of dating my now wife where we still had some dates with other people before we decided to get serious and be exclusive to each other. That’s pretty common now. So if she got pregnant within a couple months of the relationship I guess it’s possible she may have still been seeing other people (him too). Though if I were OP I would trust what my son tells me on that front and so this in no way excuses OP as I think they are TA.",
                  "id": 271,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "They’ve been together 6 months, she’s 4 months. It really is. She’s implying the girl has cheated on him.",
              "id": 272,
              "comments": [
                {
                  "score": 171,
                  "content": "\"Been together for about 6 months\" can mean very different things to different people. Started casually going on dates six months ago vs in a committed relationship for 6 months",
                  "id": 273,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Most people don’t tell their parents they are dating until things get official. It would be a stretch to assume that a 6 month relationship includes 3 months of casually sleeping around with different people.",
                      "id": 274,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 247,
          "content": ">You’re judging the girl on her past\n\nWe judge everyone by their past actions; it's the only reasonable way to judge someone's character. Instead I think you mean to say that OP's judging her on the worst aspects of her past (the drug and alcohol addiction) while discounting the good parts (that she's been clean for three years).",
          "id": 275,
          "comments": [
            {
              "score": 21,
              "content": "Yes, exactly. \n\nAll we have to go on for basing a persons character is their history (although present factors can sway that analysis to a certain extent). \n\nIf people dont consider both the positives and the negatives then they have an agenda/bias.",
              "id": 276,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "and how hard it is to get help, stay clean for 3 years. All list while being orphan and 21. Props to the new mother. I hope she never has to go down that road again",
              "id": 277,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 153,
          "content": "How are you supposed to judge someone if not by their past?",
          "id": 278,
          "comments": [
            {
              "score": 52,
              "content": "Their actions? People are allowed to learn from their past, right?",
              "id": 279,
              "comments": [
                {
                  "score": 27,
                  "content": "How are their actions not in the past. Please tell gatekeeper how old of an action is to old to be judged?",
                  "id": 280,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 847,
      "content": "Ehhhh I'm gonna go with YTA for this:\n\n> She is a lovely girl, but honestly she is not someone I had hoped would be the mother to my first grandchild. First of all, she is a recovering drug addict and alcoholic, and while she says she has been clean for 3 years, a relapse is always possible. She only finished high school with her GED, and she now works as a waitress full time. Her parents died years ago, so she is largely on her own.\n\nYou sound very judgmental of this young lady who apparently has had a rough go of it (how long has she been an orphan and was she brought up in the foster care system? That is a difficult life for a child). She was an addict in her teens/early adulthood and has turned that around, which is a sign of strength and resilience; of course a relapse is always possible but it sounds more to me like her upbringing caused some struggles with substance abuse and she has now grown. I don't see any reason other than a vague assumption for you to believe this will be an issue. And she doesn't have a lucrative job, so what? Being a server is a valuable job and not everyone needs or wants to go into debt for secondary education. Not everyone wants to be a high earner either, and that's nothing to look down upon. It also doesn't make someone automatically a gold digger because the person they are with does have high earning potential. Also, I think it's a bit hypocritical that you're judging her for her job when your son's career is being handed to him by you and your husband.\n\nI don't see anything to indicate that she is trying to use your son or that she has been sleeping around. Yes, they are probably rushing into the choice to raise a child together after only six months, but they've been friends for years and your son trusts her character. You seem to believe this is a possibility solely because of her lower class background and education/job.\n\nYou are not TA for choosing whether or not you support them financially. But your son has made it clear that he will not tolerate the insinuation that she is cheating on and lying to him, and I applaud him for that. Either help them or don't, but this condition is clearly not going to be met so you need to drop it.",
      "id": 281,
      "comments": [
        {
          "score": 160,
          "content": "This is the best answer IMO. I completely understand *some* of the apprehension on OP’s part, and it’s definitely up to OP if they want to provide financial support. \n\nHowever the language of the post oozes judgement. It’s clear that their apprehension is not because of the circumstances—it’s just an excuse for it. \n\nPersonally I would be much more impressed with someone who has been in recovery for three years, and is doing a lot to better themselves, than someone who coasts along and/or lived a comfortable life growing up. I have nothing against folks who come from well to do families—we don’t get to choose where we come from, and it doesn’t make logical (even biological) sense to not provide as much as you can for your family with your resources.\n\nThat being said I’m more likely to put my faith in someone like this young lady than OPs family. She’s gotten her GED, been sober for 3 years, and has lived through the struggles and trauma associated with losing her parents. Each one of those is impressive enough, but all three of them together is amazing. Plus OPs son clearly recognizes this, and trusts her. So trust your son, OP.",
          "id": 282,
          "comments": [
            {
              "score": 6,
              "content": "well, judgement is totally fine. you are allowed to judge",
              "id": 283,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": ">you’re judging her for her job when your son’s career is being handed to him\n\nTHIS RIGHT HERE. \nThe lack of self awareness in this post is mind blowing. Lady, your son is not a better or more deserving person because luck of the draw landed him in your wealthy family instead of her nonexistent one. GTFOH. This is so gross.",
          "id": 284,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}