{
  "post content": "I have a co-worker who is a single guy and is a barely functioning alcoholic and has some mental health issues to boot. (We work at the post office, and this is something we all know about him). I am a pretty good cook, so often when I eat my lunch he will comment and ask what I made or what I am having for lunch. So, one day, I brought him a portion of my leftovers and he was so happy and made a big deal about it. He doesn't cook or have any family at all, so he was really happy and talked about it for days. My husband didn't mind me sharing our leftovers with him, so a couple times a week I would bring him leftovers, and he would eat it immediately.\n\nWell, needleless to stay I am regretting ever bringing him food. (He does have manic episodes and some personality disorders that he takes meds for). On the days I do not have food for him, he will treat me horrible and yell around the office and act like an a-hole to me. One day he was yelling and being a jerk and a customer called our postmaster because she \"feared for my safety\". He just gets so mad when I don't bring anything. And he isn't thankful anymore when I do bring anything. He has gone as far as to criticize the meals I do bring and tell me it sucks but he is starved and will eat it anyways.\n\nHe is much nicer and calmer if I just bring him something, anything. Cheeseballs, chips, and even a stale bagel he will eat. My sister (a therapist) says alcoholics are starved a lot and need the nutrition. I finally couldn't take the stress of finding him food every day/packing him lunch, just so he won't have a fit (by the way he is 55) so I have just stopped it the past 2 weeks altogether. Today he comes into my area and tells me he has lost 12 pounds and starts cursing and flying off the handle. And I feel guilty. I just read a book and it says the Bible says to feed the poor, share your food etc. But he isn't poor, he makes way more than me and has more money than most of us at work. (he recently inherited a lot of money when his mother passed). He boasts about all his money in fact.  \n\n\nMy sister feels the Christian thing to do would be to bring him food when I have leftovers that will otherwise go to waste and help out a troubled person. My husband and children don't even yell at me and speak to me the way the co-worker does so I feel justified in not bringing him food anymore.  Am I horrible person? AITA?\n\n​",
  "id": 1,
  "comments": [
    {
      "score": 3632,
      "content": "NTA, but you have to see that giving in to violent demands will only be met with more violent demands.",
      "id": 2,
      "comments": [
        {
          "score": 1195,
          "content": "I have been holding my ground and not offering him anything. He is sullen and mad about it though.",
          "id": 3,
          "comments": [
            {
              "score": 1429,
              "content": "Does the post office have HR? This is not ok to have to work with this harassment.\n\nEdited to added: as a Christian myself, I would encourage you and your sister to read Boundaries by Cloud and Townsend (Christian authors).",
              "id": 4,
              "comments": [
                {
                  "score": 438,
                  "content": "The post office is basically the government - there are posters everywhere about hostile work environment, sexual harassment, etc, and who to call about it (which is usually the OIG).  There isn’t HR like private companies have.  It can be difficult to get these things resolved, though, supervisors tend to rug sweep.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 369,
                      "content": "This is exactly what I am dealing with now.  I emailed my superiors about this last week but so far, I haven't gotten a response.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Lol in my experience as someone who worked with a racist, sexist postmaster who recently was found at fault for a fire in the office, he has had zero repercussions. And yes there have been complaints. He literally has left one of the other smaller offices completely unstaffed more than once. I went in for my mail and there was just no one there",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Also I think the PO is probably union so for sure nothing will be done if that’s the case",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 88,
                  "content": "This is a situation where \"what would Jesus do?\" is not a good question. I am not a Christian, but Christian belief is Jesus is one of the manifestations of an infinitely powerful god. As such, Jesus has nothing to fear from an unstable alcoholic. Jesus also doesn't need a job at the post office. OP, as a human, has a lot to legitimately fear and needs that PO job. \n\nThese are important differences, and that just scratches the surface.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I am a Christian and let's also not forget that \"what would Jesus do\" requires we take a look at what Jesus actually DID when faced with people leading not-so-great lives... primarily called them to repentance. OP has been a good Christian to this dude by not judging him overly and trying to see the person behind the bottle but she needs to do them both a bigger favor by trying to push him towards the help he actually needs (which imo is some kind of intervention by HR and probably an alcoholics group). Continuing to support his demands/tantrums is enabling his addiction and I don't believe that's what Jesus would do either.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Also Jesus would be pretty annoyed that a man with plenty of money would try to force one of his co-workers to give him her food, that's the opposite of his teachings",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "My therapist recently recommended this to me when dealing with my mil. It's been so helpful.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Perfect!",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -53,
                  "content": "[deleted]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 98,
                      "content": "Great, then there's a post office worker you could start feeding.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "They’re recommending the book because it’ll help the OP (who stated that they are a Christian) better understand what the Bible says about serving others and setting appropriate boundaries to protect yourself from harm. I don’t think the commenter disagrees that all sorts of people with different beliefs do charitable things. There are a lot of Christians who struggle with guilt about setting appropriate boundaries, and I often recommend this book to people if I know they’re Christian. If they aren’t then it wouldn’t make sense to recommend a book citing the Bible.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 155,
              "content": "He will decide to get his disease treated and start eating or he won’t but it’s not your job to care for a grown man.  It’s true alcoholics eat poorly and are often malnourished because of that but it’s a problem of their own making (recovering alcoholic myself), you feeding him won’t fix him it will just give him one meal but he’s not even appreciating that so why bother.  Frankly I’d take it to HR and stay away from him.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "Where is your supervisor when he's ranting at you?  Why aren't the managers and HR department at your workplace doing your fucking job, which is to crack down on anything that creates a hostile workplace?  \n\nWell, if they haven't come to you as they should have, you have to go to them.",
              "id": 18,
              "comments": [
                {
                  "score": 110,
                  "content": "They have heard and talked to him, and he will quiet down.  But it never lasts.  They all say, \"You know how Douglas is, he is just a hot head\". Then they will tell me, \"We are just nothing but babysitters here\".  And that makes me so mad.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 166,
                      "content": ">They have heard and talked to him, and he will quiet down.  But it never lasts.  They all say, \"You know how Douglas is, he is just a hot head\". Then they will tell me, \"We are just nothing but babysitters here\".  And that makes me so mad.\n\nThen you need to talk to your union representative and let them know that your supervisors are allowing another employee to harass you.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "Oh no, that's not the correct answer. This is a cliché, a hot head alcoholic working at the post office and everybody knows he has problems but nobody has the cojones to intervene. When he brings a weapon to work and kills someone, they'll all be \\*shocked Pikachu face\\*\n\nKeep reporting him. Go up the ladder to your union rep, regional directors, whoever you can talk to.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "You need to keep reporting him to HR whenever he does this. Document, document, document.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "Ask them what will happen when he ”goes postal” because they are refusing to do anything to prevent it",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Next time you feel threatened,  call the police.   Then you have it documented for future reference and probably won't go over well with the higher ups.  They'll have to deal then!  Talk about a hostile environment,  smh.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Your leadership is not doing their job. HR needs to get involved \n\nHe needs to be fired and your direct managers/supervisors need to receive disciplinary action. He is creating a hostile work environment and they are not doing their jobs here.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "\"Well, you need to know how **I** am, and I am not going to stop complaining about his treatment until it stops, one way or another\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Apparently the concept of \"going postal\" is foreign to these PO supervisors.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "\"You know how he is.\"\n\n\"Yes, abusive. You know it, too. Why is his behavior my problem?\"",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Scares hell out of me, OP. \nPlease take this seriously. ",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Because she's been socialized to be \"so nice\" that she wouldn't dare go to her manager to say - hey, this is what is going on.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 124,
              "content": "If you want to go for a quick and friendly solution: get some menu's of local lunch places that let you order from the office. Put it in a clear place at work, and just tell him 'it's too much for me to take on an extra lunch every day, and you didn't particularly seem to like my cooking, but here's some easy lunch solutions for you,  so you don't get hangry on the job.'",
              "id": 31,
              "comments": [
                {
                  "score": 65,
                  "content": "Omg!  This is brilliant.  He threw some chili I made once out in the grass because he said it sucked.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 61,
                      "content": "I don't know how you've put up with it as long as you have. I would have had some choice words for him.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "Honestly I'd be speaking with your boss. He sounds like he's unstable and escalating his anger.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "No one would argue against you not making him food if you tell them this",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Yta to yourself for ever bringing him food again after he pulled that. Good grief. ",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "It's all very well being nice and Christian but OP shouldn't have to do this. If it makes her feel better, OK, but it isn't what she's paid for. She has actual work to do. He's a barely-functioning alcoholic and the employers are too lazy to tackle the problem.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This is a great idea. If he has money, he can buy premade meals at any grocery store too.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It's a good idea, but as a recovering alcoholic, I can say it is very unlikely to solve the issue. Serious alcoholics rarely ever think about food even though they're almost always hungry since they don't eat enough. From personal experience, you'll almost always gobble up anything anyone puts in front of you. Otherwise, you really can only be bothered to think about food or put in the effort to find something to eat when you're already drunk and suddenly ravenous. It's just one of the many ways that alcoholism completely changes your brain.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "NTA.  He's an adult and it's not your responsibility to feed him.  Especially if he's so ungrateful.  Your sister can feed him if she wants, but that's not on you.  He treats you horribly when you don't bring him food.  You need to address this either HR and your supervisor.  This is a hostile work environment.",
              "id": 40,
              "comments": [
                {
                  "score": 14,
                  "content": "Yup, if Sister lives nearby why isn't she dropping off his lunch every day?  Any reason she gives to not do it herself would also apply to OP.  \n\n\n(edit- deleted duplicate comments, not sure why that happened!)",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "One of the personality traits of the alcoholic is that they feel like a victim everywhere they go. Other people are always assholes, trying to do them dirty. Another characteristic is that they LOVE to make non-alcoholics lose their shit and yell at them. They’ll act out till they get what they want. It’s the attention ~ when someone is enraged at them and in their face, they are that person’s full focus for a few minutes. He’s trouble and he’s not going to improve. Get help!!!",
              "id": 42,
              "comments": [
                {
                  "score": 2,
                  "content": "As someone who is currently going through the hell of being married to an alcoholic, this comment resonates so hard.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Your supervisor really needs to know about this.  If they don't do anything about it, then THEIR supervisor needs to know about this.  Your coworker sounds dangerous, unstable, and volatile.  It's not about food.  The last thing anyone wants is another \"going postal\" incident.  Oh, and your sister is an idiot.  Don't listen to her.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It is astonishing that he can behave that way and still keep his job. He needs to get canned for this.",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I hope he gets over it quickly and stops putting the safety of his coworkers at risk.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It sounds as though he is sullen even when you bring him something though?",
              "id": 47,
              "comments": [
                {
                  "score": 2,
                  "content": "Often times yes, he is sullen if it isn't very much, or he doesn't like what it is. Normally in those instances he will say, \"I don't like this, but I'm starved so I will choke it down\".   If it was something he deemed \"good\" or what he likes he will be relatively happy and in a better mood. But never says thank you or is appreciative. I know you shouldn't \"give\" to get thanks but sometimes it would have been nice.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "> violent demands \n\nHonestly, you should be documenting this and reporting it to your superiors. You should never need to put up with violent demands at work, and he should be fired.\n\nEdit: Sounds like you already did this and it's pending. Good luck",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "OP, you need to report this man to someone. What are you doing? Don't even think about giving him more food!",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "How does he still have a job there?",
          "id": 51,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 915,
      "content": "NTA\n\nCall you supervisor and HR immediately.\n\nIf he is really acting this way this is an issue that needs to get remediated as soon as possible and it's not your job to do so.",
      "id": 52,
      "comments": [
        {
          "score": 265,
          "content": "Has no one remembered the expression “to go postal”? This coworker is going postal on OP and no supervisor notices?  \n\n OP, make a list of the weeks you brought 2-3 meals, then just chips, now nothing, and end that list with the customer calling in. \n\nThis is an abusive environment.  And get your union rep too. ",
          "id": 53,
          "comments": [
            {
              "score": 2,
              "content": "A few years ago I had to explain that expression to my younger colleagues. Happened mostly in the 90s? 80s?",
              "id": 54,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Seriously. ⬆️⬆️⬆️ If he’s so abusive he’s alarming customers and management has not addressed it, then there’s more that’s wrong here than just his bad behavior.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This is the way.  And NTA.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 428,
      "content": "Talk to your supervisor.  It doesn't matter what mental issues he has.  No one should be harassing you at work.  Yelling at you, treating you poorly, so poorly that a customer called on your behalf, is harassment.\n\nDon't set yourself on fire to keep others warm.  NTA to stop bringing him food AND for reporting him to HR. Document, document, document.",
      "id": 57,
      "comments": [
        {
          "score": 28,
          "content": "I 100% agree with this idea. I hope the OP sees this post and starts documenting all the incidents of bad behavior.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 204,
      "content": "I’m not religious by any means, but sometimes I feel even a religious person needs to step back and look at things from a MORAL perspective. Because while we are not all religious, I feel a basic sense of morality is shared among everyone who is a human. It’s common ground we can all stand on. \n\nThat being said, it is not morally right to bite the hand that feeds you, make someone feel belittled or inferior at work, or use them. All of which, I think he has done. You are certainly NTA. \n\nStop feeding him. Don’t interact with him if possible. Stray cats keep coming around if you put food out for them. Contact HR as well.",
      "id": 59,
      "comments": [
        {
          "score": 5,
          "content": "Or by all means feed the poor and needy - unfortunately I’m sure there are lots near where you live, so keep the leftovers for your family, and donate some groceries to your local food bank or volunteer at your local community food kitchen. NTA",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 147,
      "content": "How does this person maintain a job at the US post office?",
      "id": 61,
      "comments": [
        {
          "score": 75,
          "content": "He is on FMLA for his alcoholism and mental health issues (he said he has bi-polar) so supposedly this makes him unable to be fired or get in trouble for things. It offers \"protection\" or something.  Plus, the USPS has a union which he is a member of, and our union steward has had to bail him out of trouble before.",
          "id": 62,
          "comments": [
            {
              "score": 212,
              "content": "That’s not how FMLA works. FMLA is where you leave for a while to help take care of a sick relative, heal up from your own sickness or take care of a child. This would mean he isn’t coming to work. You need to talk to your bosses and HR.",
              "id": 63,
              "comments": [
                {
                  "score": 73,
                  "content": "There’s intermittent FMLA - it’s for people who have chronic health conditions (or family members who do). It’s a PITA to document - I had an employee who was on it and the paperwork/reporting was a nightmare.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Okay fair but when this guy is at work he should still be able to be written up or fired as he is back at work even if it’s only temporarily back, right?",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Idk. I know a nurse who od’ed on opioids and she still didn’t get fired and came back to work intermittently.  Once you declare an illness it’s a protected status and can be very difficult to get fired because HR doesn’t want to deal with a potential lawsuit b",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 63,
              "content": "This isn't true. Fmla doesn't protect someone like this. He's creating a hostile work environment and your higher-ups are to lazy and afraid to handle him properly. \n\nAs long as they accommodate him reasonably, and this is above reason they're ok. This is just insane.",
              "id": 67,
              "comments": [
                {
                  "score": 13,
                  "content": "The union must be protecting him because FMLA would not",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Is your post office the only one he can work at? Is there some way you can try and make sure he goes to a different location?\n\nI am legit concerned for your safety around that unhinged and violent person.",
              "id": 69,
              "comments": [
                {
                  "score": 41,
                  "content": "I don't know if he can transfer or not, he is 7 years away from retirement.  Everyone here just recommended not to give him food anymore and he will get over it. The postmaster had a conversation with him when the customer complained about him yelling in the office (the customer could hear it as she was collecting her mail from the PO box) and he calmed down for about a week.  He is just so manic you never know.  I make it a point never to eat a bite of food when he is near.  But we have an \"office\" refrigerator, and he gets in there and looks at what all is inside.  And to make matters worse he quit smoking last week because his cigarettes went up to $10 per pack.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 33,
                      "content": "All of that sounds like a “him” problem that he, his boss, and HR need to solve.  \n\nOP you just go live your life and stop walking on eggshells around him.  If he bothers you go to supervisors/call the police.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Why are you taking on how many years he has til retirement, how much cigarettes cost him, etc.?  None of that is any of your concern.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Keep your food in your vehicle and eat lunch in there. I would also get some mace and maybe other self defense options to keep close Incase he escalates. Good luck OP and I'm sorry that you're in a hostile work environment",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I’m on intermittent FMLA for my chronic illnesses. FMLA just means that I can take up to 10 weeks off without getting fired. I could be transferred to a job that is deemed equal to the one I’m currently in. If I act the fool on the job, they can definitely fire me. I am a teacher with due process, so supervisors have to be documenting things. A lot of supervisors don’t do that because it’s so much extra work. \n\nFTR: I’m not alcoholic. I have nothing against people struggling with addiction, but since I mentioned that I’m a teacher I wanted to clarify that my intermittent FMLA is for rheumatoid arthritis and trigeminal neuralgia.",
              "id": 74,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "FMLA means Family Medical Leave of Absence. When you take a leave of absence to care for a sick family member.  So no.   \n\nThis is all kinda of wrong.  \n\nSorry,  but this story doesn't make sense.",
              "id": 75,
              "comments": [
                {
                  "score": 3,
                  "content": "What part doesn't make sense?",
                  "id": 76,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I work at the post office too and this story 100% seems believable, dont listen to that commenter. There's some wack jobs who work here. I've had many customers ask me wth is going on because of what they hear getting their box mail. I just shrug.\n\nWith that being said, I just saw an email the other day (not sure if you're a carrier without email access) about this new thing they're (edited word) starting about harassment. Basically the \"zero tolerance\" policy but you can actually talk to someone. This is the number: 877-521-4272. I haven't had to call so I'm not sure how it works.\n\nGood luck.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My guess is that he has a disability or ADA claim.  He's not protected by the FMLA but by his disability.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Sounds like you also need to go to the union when you make your complaint. Especially if you're a member. They need to be on your side if this comes to a matter of firing him. \n\n\nCheck your local laws and, if it is legal, try to make a (ideally video, but voice might be safer and more subtle) recording of him going off on you as well. Your words may get ignored or dismissed, but a recording will make things very clear. Especially if there are multiple.",
              "id": 79,
              "comments": [
                {
                  "score": 4,
                  "content": "The video is an excellent idea.  Plus look into an EEOC claim on the basis of harassment based on gender (see my other comment).  This is unacceptable and there are things you can do to make this better!",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It offers job protection if a person is out sick for a documented medical issue that has been previously discussed. It is not a catch-all for every reason a person is gone, nor is it an exemption from termination for actions while in the workplace.",
              "id": 81,
              "comments": [
                {
                  "score": 2,
                  "content": "It often puts a target on your back as well. I've experienced it and watched others go through it. It's got to be the union plus the toxic HR that is allowing this",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm in a similar workplace.  You know you can file a union grievance too for harassment and hostile workplace.  Why does a 55 yo man expect a young woman to cook for him.  If you don't want to escalate it, ask for a transfer on this basis.  I'm in a federal union and you have a hostile workplace (I would frame it as on the basis of gender - 55 yo man expect a young woman to cook for him).  It's unacceptable that you have to put up with this FMLA or not.  PM me if you want more info.  I feel for you and this situation is so wrong.",
              "id": 83,
              "comments": [
                {
                  "score": 2,
                  "content": "Thank you so much!  I will PM you!",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The purpose of FMLA is to deal with medical issues.  If you have a long term chronic illness, for example, FMLA helps by letting you go to medical appointments if you don't have sick leave left. My daughter used FMLA to adjust to her chronic illness diagnosis. He still needs to be accountable for bad behavior.   I looked at the EEO Complaint site because that really would need to be addressed outside the powers of the union.  Would he or the supervisors agree with this abysmal treatment of you if you were a man? He would not even treat you like this if you were a man.  I recommend you document these behaviors each time in writing and provide the document to your supervisor and union each time.  You also need to file an EEO complaint.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Maybe he has a 504 to make accomodations for his bipolar?",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "We had a very aggressive postal worker in our town that tried to run people down, kicked peoples doors, threw things at people.  He was just moved to another post office.  ",
          "id": 87,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 93,
      "content": "NTA. Is there is someone higher up in your workplace you can report his behaviour to? Mental health issues or not, the way he is treating you is unacceptable. Stay firm in your decision, it is the right one.\n\nAnd tell your sister “God helps those who help themselves.”",
      "id": 88,
      "comments": [
        {
          "score": 18,
          "content": "This co-worker is on FMLA for his alcoholism and mental health issues (he said he has bi-polar) so supposedly this makes him unable to be fired or get in trouble for things.",
          "id": 89,
          "comments": [
            {
              "score": 77,
              "content": "FMLA is the Family Medical Leave Act... he can get fired for his actions. being bi-polar isn't an excuse...",
              "id": 90,
              "comments": [
                {
                  "score": 54,
                  "content": "Thank you for this information! I will definitely be speaking to my postmaster today about all this.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I may not be in your country but I do know people who are bipolar and manage it rather effectively. It sounds like he is not following any treatment?\n\nBut I agree, he may not be able to be fired simply for having a condition, but his actions are detrimental to others (including customers) and that is a problem management needs to know about! He might not be fired and some other action is taken instead but this cannot be allowed to continue.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "What has taken you so long in the first place?  You need to think about your own passivity in this matter.  You seem to not like to make waves.  Why is that?",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "He's probably not under FMLA.  He's probably under ADA (Americans with Disabilities Act).  In either case, your supervisors can not share that information with you.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Yeah a quick google search is telling me this only protects them from being fired if they require extra medical leave/time off (within a limit). It has nothing to do with being protected while harassing other employees or disturbing customers.\n\nOP, this guy either doesn’t know the limitations of FMLA or is trying to trick you into not reporting his behaviour.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 8,
                      "content": "You are correct, FMLA for having to take leave for either yourself or to care for a family member. So if he were to check into Rehab they could pay him for so much time but after a set limit they can let him go.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Bipolar person here. Drinking makes the bipolar 1000x worse.  I learned this in my 20s.   He needs to kick the booze if he has any prayer of ever getting the bipolar under control.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "FMLA guarantees you have a job to come back to after being out of work for up to 12 weeks due to medical reasons. If he’s still working every day - he can’t be on FMLA.",
              "id": 98,
              "comments": [
                {
                  "score": 18,
                  "content": "He \"says\" his FMLA allows him to call in sick up to 4 times a month without getting into trouble due to his alcoholism and bi-polar.  (This is just what he is saying) I know he did get in trouble once for calling in for an entire week when he went on a bender because he exceeded the 4 days FMLA covered him for.  The union had to represent him about it.  He didn't get fired but he did have to use LWOP (leave without pay) instead of using sick leave.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Yep that’s probably the case regarding his sick leave but this is workplace bullying and a whole other kettle of (unprotected) fish.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It seems like the FMLA is sanctioning him taking time off to drink even though that seems counterintuitive - and I do not think that is the intent of FMLA. \n\nMy daughter's paperwork stated one appointment like every month (LS) but she look LWOP so she could adjust to new medications.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "But all that is different than making your workplace a hostile work environment and being verbally abusive to you and your coworkers.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Someone seems to be lying here then. FMLA only covers 12 weeks for a one year period and it has to be submitted and approved before the leave is taken.  \n\nEither way FMLA only protects your job for those medical reasons for those 12 weeks. However if you are doing things that are fireable offenses FMLA will not prevent your firing. \n\nYou need to talk to HR or a labor board or something about this",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "You know entirely too much about him.  Why are you even engaging with him in ANY conversation other than something that directly affects your work?  You have let yourself become knowledgeable about his life when you need to draw boundaries.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Intermittent FMLA is legit. Many people use it to have their job protected if they need to call out say, 1x per week, or 6x per month. I used to fill out the paperwork regularly for patients.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "There’s such a thing as intermittent FMLA.  It’s used for chronic conditions that occasionally flare up but otherwise let you work.\n\nSource:  Before I got meds that actually worked, I was on intermittent FMLA for my migraines.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Not true.  That just means his absences can't be held against him.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "FMLA would keep him from getting fired for calling in sick. It doesn't have anything to do with his behavior at work. That should be getting him fired.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 60,
      "content": "NTA. He’s treating you like an abusive alcoholic treats their spouse. He’s bullying you into doing what he wants. I would suggest you look (with a therapist) into how abused spouses react and are treated, and I would suspect you’d find a lot of parallels to your situation. It may be the “Christian” thing to help him, but you’re subjecting yourself to repeated abuse to do so and that isn’t fair to you.",
      "id": 109,
      "comments": [
        {
          "score": 35,
          "content": "You are right.  I admit I was grabbing him a Little Debbie cake or a bagel, or even a half-eaten bag of chips out of my pantry everyday just to make him be nice to me that day. I have a pleaser personality and I am an empath, so I feel guilty for such dumb things.",
          "id": 110,
          "comments": [
            {
              "score": 30,
              "content": "It’s good you have insight into that. A therapist can help you develop strategies to manage your own feelings. In spite of the protections he’s been afforded, I would make a point of documenting and recording (at least in writing) his behaviour to you. As protected as he is, at some point an employer will be forced to act, even by transferring him away. You have a right to feel safe in your workplace. \n\nAs for your sister, I would highlight that you cannot be expected to continually expose yourself to violence to “be a good Christian”. You have to take care of your own mental health, or the stress of his behaviour will affect you in your other relationships, particularly at home.",
              "id": 111,
              "comments": [
                {
                  "score": 11,
                  "content": ">I would highlight that you cannot be expected to continually expose yourself to violence to “be a good Christian”. \n\nOP, I hope you listen to this. Think of your family! This guy sounds dangerous. What if he hurt, or God forbid, killed you? You have children. Caring for this coworker is a noble impulse. But it cannot come above your personal safety, so that it jeopardizes your ability to take care of your children. \n\nThis man absolutely should not be employed. I know that there can be a lot of red tape both with government jobs and when a union is involved. Are you a member of the union, too? If so, they also have an obligation to protect you, not just this guy. And your postmaster needs to step up and deal with this guy. I highly doubt that anyone will be sad to see him go. You are NTA, and I hope you really take all of these comments to heart.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 2,
                      "content": "thank you, and I absolutely am reading every comment and taking it to heart.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "He’s 55.  He’s an adult.  He can bring his own food in.  The first time he criticized your homemade food, I would’ve stopped bringing in *anything* else. \n\nAlso, has he ever offered to pay you for any of it????  He sounds like an absolute leech.",
              "id": 114,
              "comments": [
                {
                  "score": 2,
                  "content": "Never offered any money or anything.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "An eMpAtH - girl, you are just a traumatized doormat, not magical.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "[deleted]",
              "id": 117,
              "comments": [
                {
                  "score": 3,
                  "content": "If you read all the comments, you would see I have gone to both my supervisor and my postmaster.",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 46,
      "content": "This has nothing to do with Christianity and everything with your safety and work environment. Contact your postmaster, highlight his behavior. His actions have even been noted by customers. \n\nStop bringing him food. \n\nNTA",
      "id": 119,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 40,
      "content": "I am absolutely sure that Jesus did not mean an abusive alcoholic who makes more money than you when he said feed the poor.  NTA",
      "id": 120,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 27,
      "content": "NTA.  Sharing is supposed to be a gift and received as a gift.  This man is demanding food!  \n\nYou will be doing him wrong by enabling his behavior, he needs therapy and you need to go to HR and document all that is going on.  \n\nRecord him if he curses and yells again. .",
      "id": 121,
      "comments": [],
      "relation": "Support"
    }
  ]
}