{
  "post content": "(Sorry in advance for any grammatical or spelling errors, English is my first language)\n\nI'll keep this post short, sweet and directly to the point as possible.\n\nSo I (26, F) have two little siblings who are twins (20, F, F). I pay for Netflix and Disney+ and I've shared my login with my sisters so that way they can use my subscription. We've discussed them paying me for using the subscription, but I have told them, no, it's fine, they don't need to pay me anything and they can use the services for free. Of course we have an agreement set up where if I am going through any sort of financial crisis and can't afford to pay for the services that month, that I can give them a weeks notice, and then pause the subscriptions and reactivate them when I'm in a better spot. (That hasn't happened yet thankfully) Now to be honest, my sisters don't use Netflix and Disney+ as much as I do.\n\nI'm also paying for one other subscription based service that the three of us end up using more frequently since we **L-O-V-E** video games and playing video games together. I have a Nintendo Switch Online account that I pay for a yearly subscription on. (The type that I have is $34.99 USD, last I checked.) Now that specific subscription bills directly on January 1st, right after the holidays. And I know right after the holidays money is tight for everyone.\n\nHere's the thing, I told my sisters early on in 2020 that I didn't expect them to help me pay for the Nintendo Switch Online subscription service. However I am switching jobs as of right now because the department that I work in is shutting down at the end of November, and I'm not sure how well I'll end up doing at this new job / how long they may keep me.\n\nNow here's where I think I could be the a\\*\\*hole. I was thinking of maybe asking my sisters if they'd be willing to help split the cost on that one subscription. I'd only ask for $10 each, while I pay $14.99. I am only thinking about this because I don't know what my financial situation will be in January and since all three of us actively use the service, is it fair to ask them to help pitch on just the one subscription service alone even though I previously told them I didn't expect them to help me? I haven't discussed this yet with my sisters.\n\nI will accept whatever judgment comes my way.\n\n**TLDR**: I pay for my sisters Netflix, Disney+ and Nintendo Switch Online. Is it fair of me or is it rude of me that I ask them to help pay for just one of the services since I'm switching jobs and the service bills right after the holidays?\n\n&#x200B;\n\n**Small Update**: So it's been a while since I last posted. Not that many people saw my original post but I have good news. I had a civil conversation with my sisters and they were very understanding of my situation and it was eventually decided that if things are still rough at the start of the new year, they would help out with the subscription to Nintendo. Thankfully, while it is difficult for me I am indeed doing well enough at my new job that I won't need their help to cover the next year of Nintendo service!",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "NTA. if they use the subscription service,  they should help pay for it",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n(Sorry in advance for any grammatical or spelling errors, English is my first language)\n\nI'll keep this post short, sweet and directly to the point as possible.\n\nSo I (26, F) have two little siblings who are twins (20, F, F). I pay for Netflix and Disney+ and I've shared my login with my sisters so that way they can use my subscription. We've discussed them paying me for using the subscription, but I have told them, no, it's fine, they don't need to pay me anything and they can use the services for free. Of course we have an agreement set up where if I am going through any sort of financial crisis and can't afford to pay for the services that month, that I can give them a weeks notice, and then pause the subscriptions and reactivate them when I'm in a better spot. (That hasn't happened yet thankfully) Now to be honest, my sisters don't use Netflix and Disney+ as much as I do.\n\nI'm also paying for one other subscription based service that the three of us end up using more frequently since we **L-O-V-E** video games and playing video games together. I have a Nintendo Switch Online account that I pay for a yearly subscription on. (The type that I have is $34.99 USD, last I checked.) Now that specific subscription bills directly on January 1st, right after the holidays. And I know right after the holidays money is tight for everyone. \n\nHere's the thing, I told my sisters early on in 2020 that I didn't expect them to help me pay for the Nintendo Switch Online subscription service. However I am switching jobs as of right now because the department that I work in is shutting down at the end of November, and I'm not sure how well I'll end up doing at this new job / how long they may keep me.\n\nNow here's where I think I could be the a\\*\\*hole. I was thinking of maybe asking my sisters if they'd be willing to help split the cost on that one subscription. I'd only ask for $10 each, while I pay $14.99. I am only thinking about this because I don't know what my financial situation will be in January and since all three of us actively use the service, is it fair to ask them to help pitch on just the one subscription service alone even though I previously told them I didn't expect them to help me? I haven't discussed this yet with my sisters. \n\nI will accept whatever judgment comes my way. \n\n**TLDR**: I pay for my sisters Netflix, Disney+ and Nintendo Switch Online. Is it fair of me or is it rude of me that I ask them to help pay for just one of the services since I'm switching jobs and the service bills right after the holidays?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. Be sure to emphasize that unlike D+ and Netflix, Nintendo is just once a year, and they won’t have to worry about it again until next January (if at all).",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "I'll be sure to keep that in mind, thank you. Hopefully I won't have to have this discussion with my sisters but who knows what the future holds.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > > Posts without an interpersonal conflict related to your action(s) or a clear statement of why you might be the asshole here will be removed.\n> \n> \n\nI pay for my sisters Netflix, Disney+ and Nintendo Switch Online. I wanted to know if I would be the a**hole to ask them if they'd be willing to help pay for just one of the services since I'm switching jobs and the service bills right after the holidays even though I previously told them they didn't have to?\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH. Just have a calm buisness discussion with your siblings. If you think you're not able to afford it, approach it like this: \"Hey, I'm looking for ways to save money because of the new job, do you think we can split the Nintendo bill for January? I might have to cancel something.\" I would not recommend threatening keep the service and cut them off, though, because it sounds like you really enjoy playing with your siblings so that wouldn't really be very above board since you actually get value for money out of that.",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "Okay that seems like a good way to approach it. I honestly wasn't sure because I felt like a hypocrite in a sense for even thinking of asking if they'd be willing to help even when I said \"Nah fam, I got this\" basically. I guess I never thought my department would be shut down and I'd have to move somewhere else\n\nOh my gosh I would never threaten to cut them off while I kept the service active only for myself!! I honestly think that that would be an incredibly terrible thing to do to my sisters and definitely WOULD make me an a\\*\\*hole if I did that!\n\nYes, I enjoy playing video games with my little sisters since I'm close to them and love them dearly. We actually all have similar interests. (anime, Marvel/DC, comics, video games, drawing etc ...)",
          "id": 8,
          "comments": [
            {
              "score": 1,
              "content": "That's a really solid chance that they wouldn't think twice about helping a bit.",
              "id": 9,
              "comments": [
                {
                  "score": 1,
                  "content": "That is very well possible. I'm just hoping that I do well enough in my new department that I don't have to ask my sisters to help out. But I have no clue what the future holds. Unfortunately, I'm not psychic.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "It's okay to ask.\n\nNTA",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}