{
  "post content": "\nI f26 was invited to my sister's (18th) birthday few days ago at a restaurant. My husband didn't come because he said he had a meeting dinner with some clients. This made my family feel let down especially my sister who wanted him there and also her 18th birthday was a big deal to her obviously.\n\n\n\nTo my surprise, When I arrived I noticed that my husband was having his meeting at the same place, his table was right in the corner and he had about 4 men sitting with him. My parents and the guests saw him as well. I waved for him and he saw me but ignored me. He obviously was as much as surprised as I was.\n\n\n\nMy parents asked why he didn't even come to the table to acknowledge them after the cake arrived. I got up and walked up to his table. I stood there and said excuse me, my husband was silent when I asked (after I introduced myself to the clients) if he'd take few minutes to join me and the family in candle blowing and say happy birthday but he barely let out a phrase and said \"I don't think so, I'm busy right now\". I insisted saying it'd just take a couple of minutes and that it'd mean so much to my sister. He stared at me then stared awkwardly back at his clients. They said nothing and he got up after my parents were motionning for me to hurry up.\n\n\nHe sat with us while my sister blew the candles and cut the cake. My parents insisted he takes a piece and join us in the selfie but he got up and walked back to his table looking pissed. We haven't talked til we met later at home.\n\n\nHe was upset and starred scolding me infront of my parents saying I embarrassed him and made him look unprofessional and ruined his business meeting. I told him he overreacted since it only took few minutes and it was my sister's birthday and my family wanted him to join since he was literally in the same restaurant. He called me ignorant and accused me of tampering with his work but I responded that ignoring mine and my family's presence was unacceptable.\n\n\nWe argued then he started stone walling me and refusing to talk to me at all.\n\n\nFYI) I didn't have an issue with him missing the event, but after seeing that he was already there then it become a different story.\n\nAlso it literally took 5-7 minutes. He didn't even eat nor drink. Just sat down and watched.",
  "id": 1,
  "comments": [
    {
      "score": 58399,
      "content": "YTA\n\n>My husband didn't come because he said he had a meeting dinner with some clients. This made my family feel let down especially my sister who wanted him there and also her 18th birthday was a big deal to her obviously.\n\nCongratulations to your sister but work meetings trumps SIL's birthday.  If you wanted him there then you should have moved the date of the celebration. \n\n>My parents asked why he didn't even come to the table to acknowledge them after the cake arrived. \n\nBecause he was working. \n\n>I asked (after I introduced myself to the clients) if he'd take few minutes to join me and the family in candle blowing but he barely let out a phrase and said \"I don't think so, I'm busy right now\". I insisted saying it'd just take a couple of minutes and that it'd mean so much to my sister. He stared at me then stared awkwardly back at his clients.\n\nYou asked,  he answered.  You should have left it alone.  You embarrassed him in a professional setting.  Also,  he is allowed to have boundaries. No is a complete sentence. \n\n>My parents insisted he takes a piece and join us in the selifie but he got up and walked back to his table looking pissed.\n\nBecause he didn't want to be there.  He had a prior commitment. He TOLD you he didn't want to be there.  \n\n>He was upset and starred scolding me infront of my parents saying I embarrassed him and made him look unprofessional and ruined his business meeting.\n\nYou absolutely did.\n\n>He called me ignorant and accused me of tampering with his work but I responded that ignoring mine and my family's presence was unacceptable.\n\nYou are and you did.  You and your family's response and lack of support is what is unacceptable. You and your parents are adults, it is your jobs to manage your feelings.  Your sister is 18 not 6. She should understand although you typed all this out and still has to ask if you are the asshole so....",
      "id": 2,
      "comments": [
        {
          "score": 13961,
          "content": "Yeah. “No” is a full sentence. When he told her no, that should’ve been the end of it.",
          "id": 3,
          "comments": [
            {
              "score": 4512,
              "content": "My thoughts exactly. How I effing hate it when I say NO and people insist. YTA.",
              "id": 4,
              "comments": [
                {
                  "score": 1867,
                  "content": "THIS.  Arguing after someone says no is a bit of a passive aggressive power move, often it puts the person who said no in an uncomfortable position of having to say NO again and more strongly, which causes the other party to claim they are overreacting and being harsh for no reason. Its quite manipulative. No wonder you hubby was pissed off. YTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 805,
                      "content": "It front of business clients no less.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 236,
                      "content": "Especially in front of clients! That was a big dick move to even put the guy in that position!",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 43,
                      "content": "It’s aggressive aggressive",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "She could have just sent him a text and asked if he could spare five when he was one? Yikes",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 422,
                  "content": "It infuriates me too. My mother has done that my entire life and it just tells me that she doesn't give a fuck about me or what I want and only cares about herself or others' feelings.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 192,
                      "content": "This exactly. Complete disregard for what the other person wants or feels comfortable doing. And then they act all offended when you snap at them after politely declining several times.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "I mean why does she bother asking? Why doesn't she just give you her orders? She could at least be honest about it and not pretend she's giving you any choice.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Same! It’s so disrespectful.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I wish y’all were in my AITA post because I told my sister no when she asked if I wanted to go to the movies with her and everyone said I was the asshole for not giving her a reason why.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1271,
              "content": "OP shouldn't even have GONE TO THE TABLE and asked... So awkward. If I had unexpectedly seen my partner where he's in a professional setting, I'd subtly wink at him and save him a slice of cake for later at home. We'd later laugh about seeing each other and nobody else noticing haha! Going *to the table* was horrible judgment on OP's part.",
              "id": 15,
              "comments": [
                {
                  "score": 126,
                  "content": "Plus there was a line of sight between the tables. And when he went to watch the candles being blown out all he did was sit there and watch. WHICH MEANS HE COULD HAVE DONE THE EXACT SAME THING FROM HIS SEAT IN THE BUSINESS MEETING! Why would he need to be at the same table for it to count as him seeing the candles blown out? Why would the family try to convince him to eat and drink *knowing he stepped away from a business meeting for this??* It sounds like an entire family of self-centered AHs who've never had jobs before",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "This is a total YTA move from the wife in this situation, she should have treated her husband like he doesn't exist so that he could conduct the business dinner as he said he was going to do.  When your personal actions could directly impact the career or job of another family member, you need to step the hell back and let them work uninterrupted. She could well be the cause of a stain on his reputation with those or other clients, a formal complaint made against her husband through no fault of his own, or possibly something as extreme as cost him some benefit in the future, or maybe even his job.\n\nWhen we were in lockdown last year I ended up working from home for a solid 8 to 9 months straight. I had to set up a make-shift office in the garage that was attached to the house to do so as there wasn't space I could take up within the living space of the house.\n\nMy wife would occasionally (once every few hours) check in to see if i was in the middle of something, and if not, would briefly bring the kids by to say hi while they were on a break from the temporary home schooling, or get me something to eat or drink, etc. But for the most part she would leave me alone and was actively making sure the kids were reminded extremely regularly that although I was home, I was actually working and couldn't be disturbed.\n\nEven now when back at the office, I will barely hear from her in the day unless there is some urgent thing she needs me to do that cannot wait until I get home afterwards.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Oh yeah I feel you on that. My partner and I both work from home. He's in our living room, I'm in the guest bedroom, and our code is \"closed door\" = \"do not disturb\". So if we need something from those rooms or from one another, unless it URGENT, we just wait until the person opens their door. It's so important as a couple to support each other's careers!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This 💯. What kind of fool does this in front of husbands clients. I’m embarrassed for OP.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 515,
              "content": "[removed]",
              "id": 20,
              "comments": [
                {
                  "score": 47,
                  "content": "Have none of these people ever had jobs?? I can't fathom an entire family thinking this was at all appropriate to do to someone who is having a fucking work meeting. That is beyond embarrassing and makes him look super unprofessional.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Was this written by a 13yo? I can’t believe it",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 514,
              "content": "[removed]",
              "id": 23,
              "comments": [
                {
                  "score": 207,
                  "content": "They did!! I would be so effing pissed if I was him. This would be a point of resentment for me until the end of the relationship. It would never be the same.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Imagine if he was discussing a bug multimillion doller deal. Would OP think it's appropriate to randomly take her husband away and leave the clients alone like that? Leaving a business meeting for a personal thing at the restaurant is so awkward and looks unprofessional on his part. \n\nTake a slice of cake back to the table with the clients? No, save me the piece of cake and I'll eat it when I get home.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 335,
              "content": "Yup you should have taken the hint when he didn’t come over that he was busy and didn’t want to be disturbed. But you went over and disturbed him anyway. Perhaps he would have stopped by when his meeting concluded but you didn’t give him that chance. Instead you made him look unprofessional and may have jeopardized his deal or whatever he was working on.",
              "id": 26,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 326,
              "content": "[removed]",
              "id": 27,
              "comments": [
                {
                  "score": 104,
                  "content": "I've never had a professional job and I know enough to not interrupt a meeting... YTA",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 311,
              "content": "I would not approach my husband when he meets with clients just because I saw him sitting there. A wave and a nod and he can explain to his clients: My wife is meeting her family.\n\nDone deal. No crisis. No divine intervention required.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "But you don't understand, no isn't what she wanted to hear and what she wants is more important than anything else.",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 51,
              "content": "And her sister could give a rats ass if her bil showed up to her 18th birthday.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "It should have been the end before it started. OP should never have approached the table at all.  What is with all these stories of grown ass adults mot understanding the need for professionalism.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5678,
          "content": "Yep. Now the clients will think he had them come to the same restaurant and had arranged to interrupt the meeting. Very unprofessional",
          "id": 33,
          "comments": [
            {
              "score": 4694,
              "content": "I think it can be perceived in a few ways that would have been bad and unprofessional.\n\n\"His wife and family are having a bday party at this restaurant and he didn't know\" = he is disengaged from his wifes life...is he of good character??\n\n\"His wife intentionally set this up, but why?\" = he married a person that  has no issue interfering with her husband business going forward. Do they have a bad relationship, and will she be a liability to business?\n\nEdit:\nROFL, I just realised it must have been really weird/ unsettling to have a stranger waving on your table. Or have the other people at a table constantly be looking over at your table. Then realising it's the odudes wife and in-laws.",
              "id": 34,
              "comments": [
                {
                  "score": 2749,
                  "content": "[deleted]",
                  "id": 35,
                  "comments": [
                    {
                      "score": 1998,
                      "content": "Yeah, or he doesn't care about family. And if he's not loyal to family then that is not a far leap to being of questionable moral character.  \n\n\nEither OP should've flat out ignored husband, or husband should've told his clients early on that he's terribly sorry, but his wife's family apparently decided to throw a birthday at the same restaurant and he may have to go over there for a few minutes to congratulate sister in law.  \n\n\nImo being pro-active in such a situation is a better look than a passive ignore and hope it goes away.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "He really couldn't win, in this one! OP messed it up for him",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "The thing they should have done was just ignore him and celebrated.  Having been married to a C level executive who entertained often, I cringe for her husband.  :/ Please apologize and don’t don’t do that again.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2944,
              "content": "Honestly, I disagree. If I were one of those clients I wouldn't think it was a setup but I would think it was extremely weird that he didn't acknowledge the wife until that point.\n\n> I stood there and said excuse me, my husband was silent\n\nImagine you were at a dinner with someone and they just silently ignored their wife who came over. I would think they were an absolute weirdo and wouldn't want to work with them in the future. Clients are humans, they're not business robots.\n\nThe whole thing could have been avoided by him going \"oh gee, my wife is here to celebrate her sister's birthday. I didn't realise it was the same place! I'm just going to go over and say hello.\" Then the meal would be interrupted for 2 minutes, he could head off any further interruptions, and they could carry on. No bigger an interruption that someone using the bathroom.\n\nThe wife shouldn't have pushed it once it became clear he wasn't able to talk, but the husband acted very oddly. ESH.",
              "id": 39,
              "comments": [
                {
                  "score": 2823,
                  "content": "problem is that in a buisness setting there really is no safe way to handle the situation OP put him in \n\nhe responds and goes over for the cake cutting, he risks losing respect because his clients think he's not dedicated enough to the job/ his home life will interfere when they need him most \n\nHe ignores her and tries to carry on business as usual, he risks being seen as cold or even abusive \n\nOP and her family put him in a no win situation, and now he'll more than likely face repercussions over something that was no fault of his own and completely out of his control",
                  "id": 40,
                  "comments": [
                    {
                      "score": 825,
                      "content": "I get the feeling the husband knew it wouldn't be a quick, \"Hello, funny we picked the same restaurant, anyways happy birthday!\" He tried to convey to her not to bother him because he knew she would derail the whole evening as much as possible.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1624,
                  "content": "It really depends on the client.  I've had some that would have been fine with it and would probably have joined in on the singing.   \n\nOthers think they are the center of the universe and should be made to feel like they are VIPs at all times.  They generally don't take well to interruptions. \n\n I do think OP's husband could have briefly acknowledged the party, but her walking over to the table was even more  thoughtless.  I would have taken it up with him in the privacy of our own home.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 1460,
                      "content": "For me, the fact that he didn’t get up on his own should have sent the message that these aren’t clients to interrupt. I’m also wondering how nervous the husband gets for meetings, or for meal meetings over regular business meetings. Dinner meetings can require a little more schmoozing, small talk or charm and you can’t rely on a power point or even printed materials that much.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 387,
                      "content": "He may have acknowledged them after the meeting but right in the middle of a professional meeting is not the time for that. He was working and ditching your job to play kissy face with the wife is not a good look.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Even if the clients somehow thought absolutely nothing of the whole incident, dude was thrown off his game. It’s a terrible feeling to be in top professional mode and get distracted and taken out of it and not be able to find your way back. The anger and embarrassment alone would have been extremely distracting. \n\nIf husband had the skills or presence of mind to handle this more suavely, he would have. He can’t be very senior or very experienced at his age. He was giving a clear signal that his wife ignored. \n\nMy ex did something like this to me once and we almost broke up over it. Looking back, I wish I’d seen it for the red flag that it was. YTA",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "When she came over and introduced herself, the fact that the clients didn't say anything should have given her a clue that she misstepped. If they were the kind of clients who didn't mind, they would have said \"Go on ahead!\" But they didn't which in my world would have meant they were irritated at being interrupted.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I think the thing is though, where there is any kind of “Elephant in the room” scenario, it’s better to acknowledge it and smooth it out of you can than to ignore it. It’s about damage limitation.\n\nSo it would have been better to own up immediately to the unusual circumstances as soon as they become apparent and go quickly say hello to the family to get it dealt with in the least intrusive way. Most clients would probably understand, some won’t but there isn’t a perfect solution here. \n\nI doubt though, that any client is going to be especially impressed that he ignored his own family, and especially ignored his own wife when she came to speak to him. There’s no way of viewing that which makes him look good.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "And if they're a new client you are courting, you don't really know them yet and are kind of walking on eggshells.\n\n\"This guy cares more about business than his close family?\" can be taken either positively or negatively depending on the client, and it's best not to go down that road until you have a better relationship with the client.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "Here's a thought. OP's husband was just trying to get through the business* dinner and now he has to deal with a wife and in laws that obviously don't respect his need to finish work and join up with them later.\n\nThe sense of urgency and entitlement to come over to force herself into the dinner (and repeatedly at that) is why OP is the Asshole and her husband shouldn't have to dignify that disrespect with even acknowledging what she was doing.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "I work a highly professional job. Some clients are extremely stiff and their professional life doesn’t at all mix in with their personal life. The fact the husband didn’t acknowledge the family immediately when they started waving should signal that those clients aren’t the type to be okay with it. If the husband knew the clients well enough to know they wouldn’t care, I don’t see this as being an issue.\n\nThis whole situation from the clients perspective definitely could look like a complete set up just so the husband could make the client meeting and the birthday. Very unprofessional. And to argue in front of the client over watching her 18 yr old sister blow out bday candles…\n\nIf I were the husband, I could have potentially lost my job over something like this. And if he’s the only one with a job, that wouldn’t make life so easy on them.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "That's really more support for OP's husband. She knowingly put him in a terrible situation. \n\nI would have nodded to my husband and ignored him after that, to respect ... him and *his job*",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "The problem is both you and she had no clue what that meeting was about, or what was interrupted.\n\nNot all meetings are pleasant as clients sometimes have issues with their service and/or products.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I totally agree - simply acknowledging his family was the best solution. However, OP comes around as a self absorbed border pusher. The husband may had a very valid reason to freeze and hope she would ignore him, instead of causing a scene. Poor man.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Acknowledging his family would be best but the time table definitely depends on the husband. We don't know the nature of the meeting or where in the meeting they were when this all happened. There can be a big difference between \"So I think Bill's a great guy and we should definitely bring him up into management if everyone is in agreement\" and \"Sales continue to fall so we're going to have to make considerable cuts across the board\" when you get interrupted for a birthday party. Or, since they're clients \"You guys are doing great, thanks for getting those files to us so fast you saved us\" vs \"Your incompetence almost ruined everything, can you promise us that you can maintain a professional atmosphere and keep things moving going forward?\"",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1172,
          "content": "[deleted]",
          "id": 55,
          "comments": [
            {
              "score": 30,
              "content": "Yep. Hope OP is prepared for any possible consequences from this. We don't know anything about his meeting, but if it was a big deal and the clients complain, husband may find himself out of a job all because OP and her family *needed* him to join them for 5 miserable minutes",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "This.\n\nThe level of self-absorbtion here is off the freaking charts",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "It’s so childish.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 592,
          "content": "[removed]",
          "id": 59,
          "comments": [
            {
              "score": 58,
              "content": "I don't think her SO will have enough time, patience, or crayons.   \nAnd frankly, I don't blame him.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": ">Great breakdown!\n\n>OP clearly needs everything explained to her, slowly, over and over again, and with diagrams. Maybe a flash card or two.\n\n\nThey can sit with the YTA group ,cause let's face it OP you are TA in a major way.\n\nYou may not care now , but I bet you will start caring if this cost him his job or a potential client . You embarrassed him in  front of clients or coworkers. \n\nWhat you did was completely out of line and highly disrespectful..",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "This might be one of the very rare occasions where interpretive dance is the answer.\n\nOk maybe not lol",
              "id": 62,
              "comments": [
                {
                  "score": 9,
                  "content": "Do you think she'd get it if her husband got up from his table and waved her away? With grand gestures and such...?\n\nHmmm, you're right, probably not, no.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "He also sat in the corner, presumably a quieter placer in the restaurant, avoid getting disturbed.\n\nIts YOUR sister’s birthday, not his, why does it matter if he comes to say hi or not?  He wasn’t ignoring your family, he was trying to finish his important meeting!  It’s not all about YOU or what you want. \n\nHe probably was in he middle of an important meeting, and had he had the time, he would come and say hi and happy birthday…but you going over there is not professional AT ALL. \n\nThe message he was sending by not acknowledge you, “this meeting is important to me.  I want to do better for my family.”\n\nThe message you sent?  “What I WANT trumps your NEED.  ME! ME! ME!  Its ALL about what I want and what my family want.”  Oh, and also, a good partner would have said “sorry mom, dads, sis, husband is in an important meeting that cannot go interrupted. He will swing by if and when he has a chance.”  ANYONE who has worked in the professional world should understand this.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 31401,
      "content": "#**YOU & YOUR FAMILY DELIBERATELY SABOTAGED HIS CAREER**\n\nI'm a big birthday person and I'm disgusted by your ignorance and selfishness. \n\nDo you have any idea how professional business works? What you did was disrespectful to your husband and his clients and may have caused him to lose his job, especially if those clients are major ones. \n\nHow will you behave when your husband interrupts you during your business meeting that you already informed him of and drags you to another table to watch his brother blow the candles and have a piece of cake? Do you even work at all if you're this clueless?\n\n#**YTA, YTA, & YTA**",
      "id": 65,
      "comments": [
        {
          "score": 9848,
          "content": "She probably doesnt work, it’s pretty obvious",
          "id": 66,
          "comments": [
            {
              "score": 5613,
              "content": "[removed]",
              "id": 67,
              "comments": [
                {
                  "score": 5147,
                  "content": "Oh hell no. This has entitled wife written all over it. No way would a good wife, working or stay-at-home, ever jeopardize her working husband's career.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 793,
                      "content": "It sounded like the old \"enlisted vs officer wife\" to me.  They may have updated the phrase to \"spouse\" since I was in school with the ROTC group.  Married young, and not able to grow up or realize that their spouse is growing up.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 35,
                      "content": "As a stay at home wife/mom there is 0% change I would ever pull what OP did. If I randomly walked into the same place as my husband while he was working, 1 of 2 things would happen. Either I would completely ignore him or if it was a table of his colleagues who knew me and I knew they saw me, I would go over say hello quickly and then make sure to excuse myself quickly and letting them know I would not interrupt more. No way I would expect him to leave that table.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1569,
                  "content": "Lets non insult stay at home wives in general. She is a particularly ignorant and self-centered person, who is also a  stay at home wife.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 12,
                      "content": "And an asshole",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 430,
                  "content": "100% Op is the type of person who kept interrupting their SO when they were working from home",
                  "id": 73,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 417,
                  "content": "I'm a stay at home wife, and even I would NEVER DREAM of interrupting my husband while he's at work, whether it's in his place of work, or in a restaurant.  \n\n\nThis woman is completely self-absorbed, and cares more about her family than caring about any chance of her husband keeping a roof over her head.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I think a lot of us SAHW are vey aware and in tune with our spouse's careers. We appreciate their contribution to the family and would not want to see that jeopardized.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Agreed.\n\nI've only interrupted my husband's business meetings/travel/dinners a hand full of times in his entire 2.5 decade career - all because of family emergencies. Never because of something stupid like this.\n\nOP, get a grip. Work is work. Its unfortunate that you both ended up at the same restaurant but seeing they were engaged in business, you simply nod your head at him, instruct your family to leave him alone and move on.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "my mom is a SAHM and she wouldn’t ever dream of doing this to my dad. most SAHM or SAHW would understand that sometimes business does come first, because that’s literally what their livelihoods depend on.  this isn’t because she doesn’t work (if that’s the case), it’s just OP being immature and selfish.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "*Spoiled* stay-at-home wife at that.  A good stay-at-home partner understands the needs of their partner's work and at a minimum doesn't interfere.  It's part of the teamwork that comes with having a single-income household.",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Which makes her an even bigger ding dong considering she's impacting her household's livelihood with her banshee behavior.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1210,
          "content": "OP is completely ignorant to the fact that she not only potentially lost clients for OP, his career itself could now be in jeopardy and those above him will likely put him under a microscope looking for any reason to fire him if they don't just fire him for this restaurant bs.",
          "id": 80,
          "comments": [
            {
              "score": 129,
              "content": "If she got him fired for her sister's uwu birthday party uwu and her inability to comprehend \"no\", then she can go work at McDonald's and fund the next one",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 853,
          "content": "And then expect him to take a piece of cake back to his meeting with him?!? I would've lost my mind at the mention of a group selfie! I can only imagine a couple of annoyed looking people sitting impatiently at a table watching a colleague across the room taking group pics, wearing a birthday hat with a balloon tied to his wrist!  What the hell is wrong with these people?",
          "id": 82,
          "comments": [
            {
              "score": 41,
              "content": "Did they even provide cake for his colleagues?",
              "id": 83,
              "comments": [
                {
                  "score": 20,
                  "content": "Nope! Just adding to the list of things she did wrong lol",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "OP has probably never had a job in her life.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 672,
          "content": "Can we all take a moment a be grateful that the important client was NOT a lone female?? Can you imagine the public freakout that OP and family would have had if they saw him at a business meeting with a WOMAN??",
          "id": 86,
          "comments": [
            {
              "score": 62,
              "content": "I can see this happening",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I sort of had this happen.  I am a woman, and I had a business meeting with a guy.  Ran into my Uncle and his new girlfriend-- Uncle who doesn't even live in my state and I didn't know was here-- anyhow..... Uncle would NOT stop coming over and being all \"wink wink nudge nudge\" and \"what does X (my husband) think about this\".  Completely and totally mortifying!",
              "id": 88,
              "comments": [
                {
                  "score": 16,
                  "content": "When I regularly had meetings like this, I had a favorite spot. Food was good, service was amazing. Restaurant was just noisy enough that not everyone could hear your conversation but not so noisy that you had to scream. Big bonus was I got to know the waitstaff. They would go heavy on the ice in MY drink so it appeared I was \"keeping up,\" but no chance of me becoming tipsy. They also treated the client like royalty.  These were usually one on one meetings with opposite gender...and it was kind of a small town. So many rumors about my dinner \"dates.\" Whatever. My partner and I laughed about it all of the time. \n\nFortunately, even the nosy neighbors had the sense to leave me alone, unlike OP. \n\nA part of me hated that COVID put a halt to those dinners. I feasted!! And I genuinely liked the clients. Even though I have since changed jobs completely,  a couple of my old clients have reached out when in town so we can catch up.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "The audacity for her to behave in such a way where she knows her husband has an IMPORTANT business meeting and she runs over to beg him to watch her EIGHTEEN YEAR OLD sister blow out birthday candles… \n\nMy job is extremely professional and if I were the husband, my company would have me in so much trouble. The worst part is what if his bonus or wages are somehow commission/performance based? If the wife doesn’t work, she really just fudged that up for their family.\n\nHe obviously ignored them for a good reason. If the clients didn’t care his family would end up there, he definitely would have said hi. There’s a reason he didn’t.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 20624,
      "content": "YTA….you have never had a professional job have you?\n\nIt was so important for him to be there, why didn’t you guys move the dinner celebration to another date? \n\nUpon seeing him at the same restaurant, you should’ve acted like you didn’t even know him  since this was a business meeting with clients",
      "id": 91,
      "comments": [
        {
          "score": 3328,
          "content": "She absolutely hasn’t and either has her family. Can you imagine the horror?!",
          "id": 92,
          "comments": [
            {
              "score": 918,
              "content": "It should have been a comedy (*Afterwards* \"What were the odds we'd all be at the same restaurant?  Haha!\"), but turned into a cringe horror, and should he face repercussions a work, finally morph into a tragedy.",
              "id": 93,
              "comments": [
                {
                  "score": 47,
                  "content": "If this were a Seinfeld episode, this would be hilarious.   \n\n\nSadly, it isn't, so it's not. And the wife is certainly an AH.",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 41,
                  "content": "fr i cringed so hard when i read how she made him leave the clients' table and go watch her sis blow candles, wtf was that",
                  "id": 95,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I'm glad I wasn't alone with the cringe, this was hard to read. I can only imagine the clients face when the husband sat down at a difeent table and (as I imagine) stonefaced look at the birthday celebration for 5 minutes.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I can just imagine the other 3 dudes like sooooo….. this isn’t awkward at allllll.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "I'm thinking the odds were near 100% as this was a setup.",
                  "id": 98,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "I just posted the same thing. Why couldn't this wait until after work? The birthday party being at the same restaurant is not something that her husband needed to know *immediately*. Heck, he could have gone his whole life never knowing of this coincidence and it wouldn' matter.\n\nIt's like she didn't consider his point of view at all. It's only about what she wanted. And what she wanted was to steamroll her own husband in front of the clients, apparently.",
                  "id": 99,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 568,
              "content": "I practice medicine. It’s out of control hectic and busy every minute. One day out of nowhere a manager tells me people are there to see me. I’m thinking a patient wanted to ask a question. It was TWO of my random cousins wanting to chit chat, go to lunch, shoot the breeze. I was astounded. I had many patients to see. I said IM AT WORK. I was so embarrassed in front of management.",
              "id": 100,
              "comments": [
                {
                  "score": 342,
                  "content": "Omg you just reminded me of when I was so embarrassed at work in front of my bosses.\n\nIt was an accounting firm that didn’t work with the public and a friend of mine turned up one afternoon and came in with a bouquet of red roses for me and then stood there chitchatting for a solid hour. \n\nShe came back the next day with another bouquet and did the same thing. \n\nMy boss said if it happened again I’d be fired even though they knew I was mortified and they heard me repeatedly say thank you but I really have a lot of work to get done.\n\nSo other people’s actions really can have a terrible effect on your job and livelihood.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 52,
                      "content": "I had a drunk boyfriend show up at my work, once. Hotel front desk, evening shift. \n\nI had moved apartments that morning. He declined to help me even though he promised (\"you've got this, babe! you can do it!\"), then called in the afternoon to see if I wanted to go to a wedding with him pretty much right then (No.), then went to the wedding on his own and got schnockered, and then showed up at my work. Luckily the bosses weren't around, and I was just mortified in front of a line of tourists waiting to check in.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Omg! That’s terrible. 😮",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I need to know why she brought you a bouquet of flowers two days in a row. Why would this ever be necessary? Why does she have so much time for flower shopping and unexpected work visits for a friend?",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "Many moons ago I was a commis (i.e. lowest ranking) chef in a Michelin starred restaurant. This was a role that so many young chefs fight for - the opportunity to learn so much, to work with the industry's best, make connections. If you get it right it can set you up for a great career.\n\nOne night my parent's next door neighbours come in for dinner, and have a great experience. They then get up from their table and without any hesitation just waltz into the kitchen to come and say 'hi'. The dining room's packed, I've got 5 different tickets on the go, the sous chef barking instructions at me, and they expected me to stop everything to chat.\n\nThankfully the executive chef/owner/media darling came over and introduced himself, explained that we were in the middle of service and that their presence was a health code violation and thus had to return to the dining room, and then offered to comp their desserts.\n\nThe next morning I get a call from my mum asking why I'd been so rude to Mr. and Mrs. Next Door, and 'what was so important that you couldn't be pleasant for 5 minutes?' FFS",
                  "id": 105,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Ugh to your parents too.",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "God I used to hate when friends called in at my retail job when I was 16 lol. SO embarrassing and weird, I’m there to work not talk to you piss off! Can’t believe a full grown adult seriously thought to behave like this and then ask if they’re an asshole, no duhhh I could have told them that when I was a teen.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "She doesn’t even understand the concept of professionalism. And bringing up it being her sister’s 18th birthday as though that’s some kind of mitigating factor, if I was her husband I’d be having second thoughts about being in a relationship with someone so clueless.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 910,
          "content": "I think he could have given a quick smile and head nod or something upon seeing her while still appearing professional, but everything else from OP was just…wow.",
          "id": 109,
          "comments": [
            {
              "score": 863,
              "content": "Yeah.  But based on this post and the fact that she can’t understand why she’s in the wrong and had to have a bunch of strangers tell her she’s wrong…\n\nI suspect that any acknowledgement would’ve been enough of an open door for her to walk over and interrupt their meeting, and he knew that.",
              "id": 110,
              "comments": [
                {
                  "score": 107,
                  "content": "Yup, the poor dude was damned if he did and damned if he didn't. YTA...",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Perceptive take, I hadn't thought of it that way.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 56,
                      "content": "Lol I mean if she went and interrupted the meeting anyway without acknowledgment…imagine what would’ve happened had he smiled and waved.  She would’ve brought the entire party along with her lol!\n\nI personally would’ve excused myself, gone to the restroom, then swung by the party said a quick hello to everyone and promise to join them when I’m done, and then gone back to my meeting.  But that’s me.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 209,
              "content": "I mean, yeah, a polite smile and nod would have  been acceptable but I'm wondering if  the husband *knew* that any sort of acknowledgement would be taken as an invitation to come over to his table and that's why he ignored her, hoping she'd get the clue that this was not a good time.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "[deleted]",
              "id": 115,
              "comments": [
                {
                  "score": 45,
                  "content": "No, shit. He was probably scared if he waved she would see that as a sign to come over. He ignored her and she did it anyway.🤣 OP is clueless",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Judging from the attitude of the post, the family would’ve taken that as an invitation to join the business meeting. Lol.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "He probably figured if he did that she would have thought it was ok to engage with him.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I'm getting the feeling this isn't the first time and likely has a habit of interrupting. I'm also going to throw in that I feel there's an age gap with these two",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It's also possible the meeting was contentious or not going well in some way, which might have colored his response (or lack thereof).",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Maybe he knew that even a smile or head nod would set her up as invitation. But, yeah, little did he know that OP would screw up anyway.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 513,
          "content": "I am an executive and i would find it very weird to ignore people i know, especially family. I would go say hi at least. But cultural might be the difference here.",
          "id": 122,
          "comments": [
            {
              "score": 891,
              "content": "I don’t disagree, and that’s actually the biggest problem with what OP did. By approaching and asking him to join, in front of the clients, he has to make a quick decision as to how his clients are going to react: \n\nWill they be offended if he leaves their table for a teenager’s birthday cake? (Which also might make it look to them like this whole thing was orchestrated so he could do both?)\n\nOr would they be more offended if they see him blowing off his family for their work meeting? Some people might think, wow this guy is a jerk, I don’t want to do business with him. \n\nAnd the clients will likely feel awkward no matter what he decides, either sitting around wasting time while he’s eating cake… or sitting there with him trying to have a meeting but knowing he’s ignoring his wife and his in-laws just across the room, and assuming his attention is divided anyway. \n\nMeanwhile, he has to run through all these scenarios in a matter of seconds while his wife and his clients are sitting there waiting to see how he responds. What a nightmare.",
              "id": 123,
              "comments": [
                {
                  "score": 283,
                  "content": "Right. Not every client is the same and would react the same way. If they are newer clients to the company he might not know how they would react.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 45,
          "content": "I’ll admit to being the conspiracy theorist - Part of me wonders if she knew where her husband was having his meeting. Being so self-centered, I also wonder how much influence OP had on the birthday venue. \n\n\nIDK, how could the husband not know the location of her sister’s party if OP was so insistent he be there? I’m guessing the location was supposed to be a “surprise” to her that OP arranged in advance. Large parties usually need a reservation, unless this all went down at a Denny’s.",
          "id": 125,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "Not even a another date. Just an hour later. He could've finished his meeting and then joined the family when they arrived afterward.",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": ">you have never had a professional job have you?\n\nor Iike, an important conversation in general? \n\n\nit's like going to the doctor to discuss important test results or something and watching the doc get a phone call, answer it, and then have a full conversation about how surprisingly good dinner at mom's was the other night.",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "also if they were still there when the meeting was over, he probably would’ve went over to them and hung out for a bit if he had the time. yta and you shouldn’t have even given him a second glance",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "The part about not knowing the restaurant made me wonder if it was true - If she'd wanted him to go so badly, it's weird that she didn't say which restaurant.  I thought it possible she knew where he was taking clients and urged her family to do dinner there, thinking she could just get him to join.  But it seemed like bad communication on a lot of levels so probably not a surprise location wasn't discussed.",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Yeah, it wasn't even a business meeting with his colleagues who already know him and who would probably tell him to go and be fine with it. Those were CLIENTS. I don't understand what's wrong with this woman.",
          "id": 130,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10967,
      "content": "YTA—he was working, you knew from the START he was working, you could’ve told your parents and guests he was working. Instead, you went over and interrupted an important dinner. It’s fine to make your sisters birthday about her, but it’s not okay to make your husbands meeting about her",
      "id": 131,
      "comments": [
        {
          "score": 3668,
          "content": "YTA I have such intense secondhand embarrassment for OPs husband, what she did was absolutely *mortifying*!\n\nYou also need to work on your communication, how did neither of you clock that you’d be at the same place at the same time??? Do you guys not talk?",
          "id": 132,
          "comments": [
            {
              "score": 607,
              "content": "I am thinking the same thing.  I’m so uncomfortably embarrassed for her, but she can use this to learn from.  But I’m getting the vibe that she just doesn’t understand the problem and the dynamic.  This may also, this may have F-cked up her husbands career, but she doesn’t seem to understand this.",
              "id": 133,
              "comments": [
                {
                  "score": 54,
                  "content": "When I go out for a business dinner, either my SO is invited so i tell him where it is, or he isn't so I don't. I just say \"Eat without me on Tuesday, hon, I have a dinner, should be back by 10. If I'm not back until after 11, please pour me a drink because it either went really well, or really poorly.\" And if able, i order him a separate meal to go that he can eat later. When he goes for a business dinner, we do the same only roles reversed.\n\nEdit: meant to reply to lipstick",
                  "id": 134,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yea my husband's job requires alot of dinners. Sometimes he days the place mostly just the general part of the city bc honestly I don't care as long as he gives me ETAs",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "The simple fact she made that post shows she doesn’t understand the problem and the dynamic, or that she might have fucked up her husband’s career.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 428,
              "content": "YTA “intense secondhand embarrassment for OP’s husband” is the perfect phrase of what I felt reading this post. I was so mortified for him I wanted to dig a hole and bury myself in it for solidarity. If I ever saw my spouse at a business meeting in a restaurant I would never go up to the table uninvited OMG. My spouse also has the common sense not to do this.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I suspect the restaurant in question is a bit upscale so it would be a prime location for business dinners/celebrations/so forth and not necessarily casual dining. It's possible OP and her family are first timers and/or the clients picked the locale so her husband was a first timer as well.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 65,
          "content": "[removed]",
          "id": 139,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "u/altythrow449 is the type of wife who constantly interrupts her WFH spouse to do things that \"will only take 5 minutes\" (which always end up taking 20).  The kind who also interrupt ZOOM meetings to ask if they are going to lunch, etc.    \n\nThey have no sense of the importance of maintaining focus and momentum.   Husband is in the middle of a sales pitch to clients and she walks up to change the entire dynamic because she and her family want \"5 minutes\" (they actually wanted more).   And here in her post she's doubling down on the same appalling behavior calling his trying to deflect the situation as \"unacceptable\".    There are thousands of messages here and she still wants to talk about how \"It was my sister's birthday, my parents said, and it was just a few minuted\"",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7886,
      "content": "Business meetings are not the same thing as dinner with friends where you can just excuse yourself for a moment to chat with your family. When you attend a meeting, it is expected that the people in it have cleared up their schedules so the appointment won't be interrupted.YOU know it was a coincidence, but your husband's business partners might be thinking you guys arranged the dinners to be in the same restaurant and that would damage his professionalism in their eyes. \n\nAlso, you husband said he didn't want to attend the celebration, he said he had a business meeting, that sounds REALLY important, BTW,  and what do you do? You coerce him to participate anyway. I get why he blew up with you, OP, whether you realized it or not, you acted disrespectfully, unprofessionally and you may have jeopardized his career.\n\n\nYTA.",
      "id": 141,
      "comments": [
        {
          "score": 1906,
          "content": "Does she know it was a coincidence? Because I have a strong suspicion she knew where he was having this meeting and decided to have the celebration there so this exact situation would play out. YTA",
          "id": 142,
          "comments": [
            {
              "score": 691,
              "content": "Yeah I was wondering the same thing and I bet hubby was too. How many fancy enough restaurants for clients are there around where they live. When she told hubby before he said he had that meeting did she say the restaurant or did hubby go cant I have a client dinner X restaurant and then all of a sudden bday dinner is at X restaurant.",
              "id": 143,
              "comments": [
                {
                  "score": 161,
                  "content": "I think Michael Scott would argue that Chiles is perfect for both birthdays and business meetings.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Here’s the thing. Chili’s is the new golf course. It’s where business happens.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "> How many fancy enough restaurants for clients are there around where they live.\n\n...that are also appropriate for an 18 year old's birthday dinner",
                  "id": 146,
                  "comments": [
                    {
                      "score": 27,
                      "content": "To be fair, I went to the fanciest restaurant in town on my 18th birthday.",
                      "id": 147,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "on everything i'm telling myself they went somewhere fancy cuz turning 18 IS a big thing but i'm also scared that's just an excuse🥲",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 49,
              "content": "Surprised I had to scroll down this far to see someone pointing this out…I don’t believe for a minute it was a coincidence. She knew where he was going for dinner and they intentionally planned the birthday gathering at the same place. This makes OP an AHx2 because this seems premeditated. Does OP not understand that this is the equivalent of her showing up at his office and barging into a conference room where her husband was in a meeting demanding he watch an 18 year old blow out candles on a cake? You just don’t do that.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "ROFL. This is crazy theory and kindda a joke in my head but...\n\nMaybe she thought husband was having an affair/date...so let's bring the family as witnesses or they can be used as an alibi for being there.",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 947,
          "content": "And the whole thing only took \"5 to 7 minutes.\"  That's actually a LONG time to leave the clients sitting alone, for what they know was a personal reason.  Way to make them think the husband has NO respect for their time.  Blowing out the candles should take 1 or 2 minutes tops.  Making him come over at all was unprofessional, but making him stay that long is incredibly rude!\n\nThis whole thing feels like an episode of Modern Family, honestly.",
          "id": 151,
          "comments": [
            {
              "score": 265,
              "content": "I also do not believe it was  \"5 to 7 minutes\" and closer to 15 if not more.\n\nIt started as an \"acknowledgement\" then happy birthday song, candle blowing, photos and fecking selfies...\n\nAll this on top of getting his attention from the other table, \"instructions\" to the client and anything else OP is leaving out.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 147,
              "content": "That's definitely enough time for clients to decide to take their business elsewhere.",
              "id": 153,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 68,
              "content": "Chances are these clients are taking time away from their family as well to conduct this dinner, why drag out their dinner and possibly feel guilty that they've deprived the husband of his SILs celebration at best. At worst they look at him as disrespectful and manipulative and will have nothing to do with him which directly hurts the livelihood of op and husband.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I'd be hecking annoyed if I was a client. Time is money and 5 minutes is a pretty long time especially when you generally plan out 1-2 hours for a business meal.",
              "id": 155,
              "comments": [
                {
                  "score": 16,
                  "content": "\"only 5-7 minutes\" lol, I'd get up and leave.",
                  "id": 156,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 273,
          "content": ">Business meetings are not the same thing as dinner with friends where you can just excuse yourself for a moment to chat with your family. \n\nEspecially if you're the host. \n\nLast month I was at a confrence where I was both the host of a few business dinners and a guest at some. As a guest, there were times where I needed to excuse myself for a moment, but as the guest, that is fine. As the host, there was a time where I probably would have excused myself (and these excusings were all business related, taking calls mostly) but I didn't because the people at the table were MY guests and that would have been rude to leave them when we were talking business.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 264,
          "content": "Complete lack of respect for boundaries, big YTA.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "I can't believe anyone, in the year of our goddess 2022, needs to have it explained to them that WORK THAT HAPPENS OUTSIDE AN OFFICE IS STILL WORK. \n\nOP, would you barge into this office and drag him away for a \"quick\" personal matter? I'm guessing (hoping?) you have enough sense to understand how fucked up that would be. THIS WAS JUST AS BAD. \n\nYTA.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Yea if this were a highly competitive industry situation like: consulting, asset management, bidding for supplies/construction she might cost his company millions and potentially poisoned the well for his career. \n\nIf this happened at my job I would be reprimanded 100%",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "YTA\n\nIf I was your husband I would reconsider my marriage.",
          "id": 161,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Yeah could you imagine the perspective from these clients? They took time out of their evenings, from being with their families and the guy hosting the meeting excuses himself to hang out with his family. Even for 10 minutes?? That would not for in most professional settings.",
          "id": 162,
          "comments": [
            {
              "score": 7,
              "content": "Ouch, yeah. From the client's perspective, there really isn't a good outcome from the whole of the interaction. The moment he left the table with his clients, he knew that the meeting was blown and that he would have a sh?tstorm of issues the next day.  \n\n\nBusiness meetings in a diner, restraunt, fast foot joint, or even a winery... are all still business meetings. :/ How you act, conduct yourself, interact with others and situations... is being evaluated.. whether consciously or not.  \n\n\nBeen on both ends of the table during a lunch meeting and yeah... very different responsibilities.. and different actions are taken positively or negatively depending on the role/responsibility/reason for the meeting.\n\n10 minutes? LOL. I wouldn't be surprised if the lunch business meeting's whole length was less than 45 minutes. Enough time for a quick meal and to talk over a few things while getting a feel/sense of the other person. For that, even 5-7 minutes is a significant cut into the business/work meeting... for personal matters.  \n\n\nI'm suspicious as to whether or not the \"clients\" weren't say... his boss and some folks from another department... and he was being assessed... either way, this makes him look pretty bad.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Yes exactly and I don’t understand the people blaming the husband equally or saying if it was that serious they would be in an office.\n\nIf you see 5 men seated at the corner table in a higher end restaurant in business attire and a serious demeanour? Nobody is going to think it’s a boy’s night out at the bar and that it’s remotely appropriate to behave like OP did.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Yeah I'm surprised how many people don't understand how \"the client might see that he is booking the same restaurant on purpose.\"\n\nThis is huge, you can't walk back the perception, it's a huge trust thing with the client.\n\nBased on his reaction it's either a new client or it's a client who doesn't do the buddy-buddy relationship. \n\nI have clients that would encourage me to go to the table and take photos, but even those would look at me and have a hard time believing in that level of a coincidence.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6337,
      "content": "YTA the second hand embarassment I felt because of this is insane. It seems like nobody in your family knows how business dinners and meetings work. What a bunch of childish individuals.",
      "id": 166,
      "comments": [
        {
          "score": 782,
          "content": "This. The second hand embarrasment on the part of the other people at the table is painful. Though I think once she approached, he really should have excused himself immediately  for the 3 minutes to wish the sister a happy birthday just to save the painful back and forth.\n\nTo be clear, the OP should have never approached the table, but once she did that he should have taken her back to the table just to end everything sooner. YTA",
          "id": 167,
          "comments": [
            {
              "score": 244,
              "content": "I think he can be forgiven that because he was probably in shock trying to process that this even needed to be a situation. Up until now, I would imagine he had considered his wife to be someone who knows what the words \"I can't, I'm working\" mean and figured that his not joining them the second OP waved for him would cement that this was a working meal, not an interruptable jolly.\n\nI also feel like he if had taken her back to the table, there would have been more excuses to keep him there longer and longer - funny how \"just come over for the song\" grew to 5+ minutes grew to \"just a bit longer for selfies and cake\" before he finally shut it down.\n\nWhat I hope he's learned for next time (assuming there is one) is he needs to learn to become a broken record. \"I can't, I'm working\" on loop and nothing else until OP gets it through her head that the world doesn't revolve around her family and their wants. Which might take some doing, but if she can't respect his time then he owes her nothing more than the same words on loop until she goes the heck away.",
              "id": 168,
              "comments": [
                {
                  "score": 45,
                  "content": "“Up until now, I would imagine he had considered his wife to be someone who knows what the words \"I can't, I'm working\" mean and figured that his not joining them the second OP waved for him would cement that this was a working meal, not an interruptable jolly.”\n\nNot just his wife but her whole family. They knew he had a business meeting because OP said they were let down when they heard, especially the 8 y.o. SIL. Oh sorry 18 y.o.\n\n\n“…until OP gets it through her head that the world doesn't revolve around her family and their wants.”\n\nI agree with all your points but again I think he has a problem with her AND her family thinking the world revolves around them.\n\nUgh I’m so embarrassed for that poor man 🤦🏼‍♀️",
                  "id": 169,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Oh absolutely it's a problem the whole family suffers from and it's pretty clear to see where OP got the idea that this sort of behaviour is at all acceptable. Though it does make me wonder how much of a social circle OP has outside of her family because I feel 26 is a little old to have not realised that sometimes we have to sacrifice the fun stuff so that we can do the serious adulty stuff that makes future fun stuff possible (along with, oh, a roof and food and all those things that have to be funded through the serious adult stuff)",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Yea, but he was also caught off guard. Like, I don't know about other people, but work brain and social brain aren't always immediate switches in my brain. The collision of both worlds would be enough to grind anyone's gears! I think he handled it as best as he could given the intrusion.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 233,
          "content": "I died a lil bit inside. I felt like the Homer Simpson gif where he retreats into the bushes🤦🏾‍♀️.... so cringey😮‍💨",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Omg, I was dying in my chair reading this! Girl, what are you doing approaching them at the table?? 🫣 18 is one of the young adult milestone birthdays but, my god, so inconsequential to interrupt a work meeting! If it was so important for him to be included, OP should have said that and the rest of them should have accommodated his work schedule. The clients could have been relaxed and casual but as we saw, they were not pleased at the interruption. If they aren’t long time clients you as a wife have heard about, you need to act conservatively and imagine the worst case scenario. Meal meetings are still meetings and closing a deal may hinge on how well things go. YTA OP.",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "Cringey, for sure.\n\nPicturing her standing at the table trying to convince her husband to leave his meeting while he clearly doesn't want to is soooo painful.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Not only that but they have zero respect for boundaries.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Right?!",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Exactly! I had the whole shitshow pictured in my mind and I was second hand embarrassed AF! All the ranting about how her parents think this and said that… for real? Who the fuck cares what they think? He was in a business meeting and OP was totally out of line. YTA majorly",
          "id": 177,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4882,
      "content": "Info: do you earn enough to support both you and your husband if he were to lose his job?",
      "id": 178,
      "comments": [
        {
          "score": 2051,
          "content": "Considering how dumb OP has acted in this instance I would be surprised.",
          "id": 179,
          "comments": [
            {
              "score": 815,
              "content": "I had to ask because she's acting like she can afford to support them if she gets him fired for being unprofessional. I would be furious if my partner did this to me.",
              "id": 180,
              "comments": [
                {
                  "score": 327,
                  "content": "I would divorce somebody over this tbh",
                  "id": 181,
                  "comments": [
                    {
                      "score": 208,
                      "content": "As you should in case the husband does lose his job. Getting fired after being humiliated in front of clients because your spouse and in laws are selfish thoughtless Assholes....Marriages have been annulled for less than that.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 59,
                      "content": "yeah this would make me fall out of love immediately. imagine being married to someone so entitled and childish.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "agreed, even if my spouse would acknowledge and do better, i would think about it every single time i would have to have meetings or do something similar. on a basic level it's an immediate turn off cuz of how disrespectful it is.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 538,
          "content": "OP and her parents have zero respect for OP's husband's job. \n\nEveryone there was old enough to understand \"I'm working\" \"I can't right now\" \"NO\" but OP decided to make her husband look unprofessional in the middle of a meeting.\r  \nI hope OP and her parents enjoyed that celebration, that was importat for OP sister just like the meeting was importat for OP husband, not that husband job or feelings matter. Unsupportive selfish AH.",
          "id": 185,
          "comments": [
            {
              "score": 29,
              "content": "OP has the same energy as the wife of that guy who kept bursting into his home office when he was on conference calls. Just complete refusal to accept that her immediate wants aren’t actually needs a d disrespect for her husband’s boundaries. OP’s husband should think twice about having kids with this woman at this point in their life.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Don’t think OP has ever worked because OP doesn’t seem to understand what professionalism is.",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2731,
      "content": "YTA. BIG time. Your husband wasn't there with friends. He was there for a BUSINESS meeting. One which relates to his job. which presumably helps to support both of you. You were way out of line forcing him to come over and join in the party, esp. since your family KNEW that he was not able to come because of his meeting.\n\nso they were in the same restaurant. Big deal. that doesn't give you the right to interrupt his meeting and insisted he do what you want. You and your family seem very immature if you can't recognize that sometimes people are not able to participate in events if they have other commitments, just because you think they should.",
      "id": 188,
      "comments": [
        {
          "score": 225,
          "content": "Agreed. I fully expected, based on the title, that maybe he wasn't actually at a business meeting and instead maybe just having after-work drinks with some colleagues or something.\n\nBut, no.\n\nHe was clearly at a business meeting. He was working. He could've come to see your sister after the meeting, before he left, or met you back home to wish her a Happy Birthday. The two of you could've taken her out separately to make up for missing it -- literally anything but what you just did would've been a better option, OP. This was so immature and selfish, I'm surprised that you still wrote this out. YTA",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "[deleted]",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Exactly. He was not at a social gathering. He was at work. He even tried to politely decline when OP came up, but OP insisted. The clients said nothing to encourage OP, so it sounds like they didn't like this intrusion. \n\nVery immature. I would have also been pissed in his shoes.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2562,
      "content": "YES OMG. YTA. wtf ? You have to ask???  He was in a business meeting. That was so cringe to even read I feel so bad for him ommgggg",
      "id": 192,
      "comments": [
        {
          "score": 254,
          "content": "Literally!! He was probably internally screaming when she said excuse me lmao. Like no EXCUSE ME! I’m in a meeting. \nIf it was a virtual meeting would she have interrupted him the same way as she did? I don’t think so",
          "id": 193,
          "comments": [
            {
              "score": 38,
              "content": "She probably would tbh. If she’s gonna do that in front of clients I assume she’d do it everywhere tbh.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 210,
          "content": "They \"only\" kept him away from the meeting for 5-7 minutes after he said no in front of the clients \n\n\ngah I want to dig a hole and die in it from the second hand embarrassment",
          "id": 195,
          "comments": [
            {
              "score": 23,
              "content": "OP should consider that the “only 5 minutes” argument is a bit like throwing a brick through the window of the room a meeting is occurring in. The act itself only takes a couple of seconds but the effects are longer lasting. And not necessarily fixable.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Right? I was reading this thinking “this person cannot be serious”. Biggest, most obvious YTA ever.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1908,
      "content": "YTA. \n\nHow are you 26? That was childish behavior I’d expect from a 6 year old who didn’t understand daddy was working and shouldn’t be interrupted. \n\nNo, you very much should not have interrupted his business meeting and then made him watch your sister blow out candles.\n\nNothing says I’m an adult now like putting a birthday cake above work responsibilities.",
      "id": 198,
      "comments": [
        {
          "score": 498,
          "content": "The worst part is that even my six year old understands when I say “mom is in an important meeting right now”. Usually I’m met with “okay sorry I’ll be quiet mom” and she leaves and closes the door behind her. \nI cannot understand how this woman is 26.",
          "id": 199,
          "comments": [
            {
              "score": 24,
              "content": "I think the key difference is your 6 year old is raised by someone with a brain, and OP by spoiled brats who think the world revolves around them. Considering her entire family was acting like spoiled children, demanding his presence. \n\nAlso what is this weird obsession OPs sister has with her BIL. She was “super disappointed he couldn’t be there”. Who cares that deeply about their BIL, jeez.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "My 6 year old understands that i work and he cant bother me right now!",
          "id": 201,
          "comments": [
            {
              "score": 22,
              "content": "Oh I bet we all taught our kids to be good when mom and dad are working during the pandemic! My daughter clearly knows that when her parents are talking on the phone or on a teleconference, she needs to go do her thing in her room and not interrupt unless it’s the apocalypse",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 28,
          "content": "The first thought I had was my 4 year old wouldn't do this! She understands business meetings are important and she goes to another room or stays quietly out of line of sight when one of us is on a video call. She is capable of respecting the jobs of family members who support her. A literal 4 year old behaves better (and is less ignorant tbh) than OP.",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}