{
  "post content": "(Sorry for formatting, I’m on the phone)\nI (F16) live in Europe, and recently we’ve been getting snow where I live. Currently, I’m with my dad (45) and little brother (14) in a beach house (we are able to do so because of distance learning and my dad WFH), and when we woke up this morning, there were snow! We were so excited about it and made a deal to go out and play after school/work. \n\nHere’s the deal tho; around 11:15am the neighbours kids were out playing with the snow they had on their ground. After 11:45am ish I couldnt see them, and they probably went inside again. After school, we went out to play in the snow and discovered a snowman on the neighbours ground... made with our snow. We didnt have much snow because they had taken quite a lot of ours. \nWe had the snow on the roof, which was low, so we could reach maybe 30-40 cm up. That was it. It was a very quick snowball fight and we managed to build a snowman the size of 30 cm and VERY thin. \nWe havent had any contact with the neighbours and didnt want to interrupt their vacation. But when we went out and grapped some snow from the public playground, they were there and reprimanded me and my brother for taking it all. I asked them where they got enough snow to build their snowman, since our snow had suddenly dissapeared. The mother looked at her kids and scolded them, but didnt apologize to us. I didnt want her kids to feel bad, i just wanted an apology or at least some snow to play with my brother. \nAITA here?\n\nEDIT: they went in to our property to take it. We have a little porch thing and some chairs with lots of snow, and they took it from there too. I do understand that I don’t own the snow, and I just suck it up that I can’t play with my brother in the snow, but I wanted an apology for going onto our property while we were in our rooms working/in school, which I made clear to the mother.\n\nEDIT 2: bad idea to call the kids, these people were about the same age as me and my brother, i would guess 13 at youngest and 16 at oldest.",
  "id": 1,
  "comments": [
    {
      "score": 44,
      "content": "ESH. First world problems.",
      "id": 2,
      "comments": [
        {
          "score": 7,
          "content": "A lot of AITA are first world problems...",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "Yup, pretty much every one.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Yes totally",
          "id": 5,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Best answer.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 35,
      "content": "NTA. It's not about who owns what. It's the principal. They don't see a lot of snow. They wanted to play in it. Doesn’t matter the age. It is technically their snow. And believe me - in the US if those same neighbor kids would have slipped in the snow no one owns and broke their arm it would have become someone’s snow pretty quickly. It's also a homeowners job to keep the public sidewalks (that aren't theirs) clear of snow. So if I'm shoveling snow or financially responsible for someone who gets hurt in snow on my property - you can believe it's my snow.",
      "id": 7,
      "comments": [
        {
          "score": 4,
          "content": "Thank you! Really thank you for the judgement, and I know it could come off bratty, but I am so glad you get it. The thing you mentiones about the sidewalk is the same here! Unless it melts during the day, we have to clear the sidewalk, so thank you for understanding!",
          "id": 8,
          "comments": [
            {
              "score": 2,
              "content": "You're welcome!",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 17,
      "content": "NTA, it's snow. Unless they broke into your property to take it, it doesn't belong to you any more than it belongs to them. You can't expect an apology here. However, the reason I went with NTA is because they equally can't start complaining about you taking snow from a playground.",
      "id": 10,
      "comments": [
        {
          "score": 6,
          "content": "Yeah, it sounds like the neighbours went onto their property to take it.",
          "id": 11,
          "comments": [
            {
              "score": 2,
              "content": "They did, thats what I mean with the apology. I’m gonna edit it in for clafirication!",
              "id": 12,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "[deleted]",
      "id": 13,
      "comments": [
        {
          "score": 6,
          "content": "I know that, and thats the generel rule for public space. But its the fact that they went a long way into our ground, they took snow off our chairs and stuff.",
          "id": 14,
          "comments": [
            {
              "score": 9,
              "content": "Yeah, that's weird, I would be annoyed too.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Yeah this whole thing is kinda nuts. I've got lots of snow on my driveway that's green for the taking.",
          "id": 16,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "[deleted]",
      "id": 17,
      "comments": [
        {
          "score": 11,
          "content": "Sorry, i’ve gotta edit that. I meant that they went on to our property and took it. Not like a few inches in, but all the way into our little porch thing and our chairs",
          "id": 18,
          "comments": [
            {
              "score": -19,
              "content": "Yeah, same. It's snow. Nobody owns it.",
              "id": 19,
              "comments": [
                {
                  "score": 34,
                  "content": "To be fair they went on their property to take it. Which I think is quite rude. You don't just go on someone else's property and take stuff off it, no matter what it is. That's like saying you don't own apples so it's okay to take an apple from someone's apple tree on their yard.",
                  "id": 20,
                  "comments": [
                    {
                      "score": -19,
                      "content": "> That's like saying you don't own apples so it's okay to take an apple from someone's apple tree on their yard.\n\nThat's not the same at all.\n\nWould you be upset if someone took a raindrop from your garden? Or breathed the air at your house?",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "[deleted]",
          "id": 22,
          "comments": [
            {
              "score": 5,
              "content": "Collected rainwater was what my mind went to first. Stealing someone's rainwater from their property is illegal in many places. Just because it fell from the sky, doesnt mean property lines magically disappear.",
              "id": 23,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "Low stakes but NTA. It's snow, it doesn't beling to anyone, but they reprimanded you for taking \"their\" snow from a public playground after going on your porch and taking all the snow there.",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "Thank you for the judgement!",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "INFO\n\nHow do you define \"your snow\"? Did they enter your property to do so?",
      "id": 26,
      "comments": [
        {
          "score": 7,
          "content": "Yes, thats what I mean. They took it off our chairs to make their snowman.",
          "id": 27,
          "comments": [
            {
              "score": 9,
              "content": "NTA, they didn’t just steal your snow, they stole your fun!!\n\nI’d be pissed and I’m nearly 30!",
              "id": 28,
              "comments": [
                {
                  "score": 3,
                  "content": "You gave me a smile on my face, thank you!",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "If its on your property they have no right to be there in the first place. NTA.",
      "id": 30,
      "comments": [
        {
          "score": 2,
          "content": "Thank you very much for the judgement!",
          "id": 31,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA, it's not your snow, but it is your property. She could've apologized for the circumstance, but I don't think her not apologizing is inappropriate either. Might just want to chalk this one up as a loss.",
      "id": 32,
      "comments": [
        {
          "score": 1,
          "content": "Thank you for your judgement (:",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "To be pedantic, it's their dad's property. Did he have an issue with it? Are the kids normally allowed to play on the property? If so, then there's really no grounds to complain about them taking the snow.",
          "id": 34,
          "comments": [
            {
              "score": 3,
              "content": "These people were strangers, and my dad didnt like them on the property. He is also the one who said that it was a shame, but at least we could go to the playground (where we had the encounter with the neighbours). When we got home again without a snowman or having had a snowball fight, he was annoyed/mad by them but said he didnt want to interrupt their vacation. He said to hope there comes more snow tomorrow or next year.",
              "id": 35,
              "comments": [
                {
                  "score": 3,
                  "content": "Then this is more about the trespassing than \"stealing snow\", IMO. And, yes, you're right to be annoyed about it. Your dad should have a talk with the parents. Screw \"interrupting their vacation\". Don't know about the laws there, but in the US if your dad isn't taking measures to discourage trespassing ( signs, etc ) and they get hurt on your property, he could be held accountable. You're obviously not in the US, so the law there may not be as stupid, but it's still worth considering. They're trespassing, and that's worth \"interrupting their vacation\" to have a polite chat with their parents about it ( assuming they haven't been spoken with before about it. Otherwise it can be less polite... ).",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I think I might be the AH because her kids starting to get really sad and pulled away like they were scared after their mom scolded them. I just wanted snow or an apology after the kids took our snow, but didnt want them to feel bad\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 37,
      "comments": [],
      "relation": "No"
    }
  ]
}