{
  "post content": "My family is on a big divide about this so I was hoping I could get an unbiased perspective. I am the youngest of four siblings, by far. I am 22F and my husband is 26M. \n\nMy siblings are 30F, 32M, 33M. Between the three of them they have a combined 14 children. They all have multiple children. None of them went to college, and they all work lower paying entry level jobs. I graduated last year (I started college in highschool) and I work as a nurse. My husband works on planes but I don’t want to say what he does specifically. Our household income is about 200k, and average where we live is about 80k I think. This is all relevant. \n\nMy parents like to host big family functions for every holiday and they bring the whole family together. Ever since I was a teenage my siblings have always asked me for favors, mostly to babysit. I did it for a while when I was around 16, but quickly realized they didn’t appreciate anything and there was nothing in it for me so I stopped. For the past 6 years I’ve had the “don’t ask me for anything” stance, since my siblings are the type to ask for favors but never offer to help you need it. They always borrow money from our parents but never pay it back. \n\nMy oldest brother is getting evicted, and asked if him and his girlfriend and their four kids could stay with me and my husband. My husband and I own a 4 bed 2 bath home. I told them no because they have a habit of settling in somewhere and not paying rent and refusing to leave. They also let their four kids absolutely destroy every rental they live in, coloring on the walls, holes in the walls, etc. \n\nMy brother and his girlfriend are pissed at me, and they blew up at us at my mothers birthday party last week. They’re going to have to stay at a shelter and they’re saying it’s my fault, but I think it’s their own lack of responsibility. My other two siblings chimed in agreeing with my brother, and they think I’m a sucky asshole. I think that my siblings suck and I don’t want my house getting torn up by their heathens. I know that if I let them move in I’d end up having the evict them, and they wouldn’t pay for anything at all. \n\nI think it’s not fair that they always ask me for money because I make more money than they do, and they treat my husband and I like we’re some kind of upper class snobs because we worked hard and made good choices in life to be able to buy a house early. \n\nAITA for not helping my siblings? Specifically my brother I guess\n\n\n\n\nUpdate: \nI’m offering to pay for everyone to get a vasectomy/ tubes tied this Christmas and giving my brother enough money to cover the red roof inn for a week. That’s it. All  I’m doing for anyone and they better not call me ever because I’m not answering.",
  "id": 1,
  "comments": [
    {
      "score": 9126,
      "content": "NTA - why can't your other brothers or sister take them in?  Why is this your responsibility?",
      "id": 2,
      "comments": [
        {
          "score": 5591,
          "content": "All my siblings stance on this is because my husband and I are the only ones with room. We use one bedroom to sleep in, one as a home gym, and two as home offices. My other two siblings are stuffing up to four kids a room, and have no way of making it work. I still don’t think it’s my responsibility though.",
          "id": 3,
          "comments": [
            {
              "score": 4525,
              "content": "It's *NOT* your responsibility.  Your brother made the choices he did and made himself homeless.  That's not on you.",
              "id": 4,
              "comments": [
                {
                  "score": 1172,
                  "content": "[removed]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 223,
                      "content": "Or the parents.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 245,
                  "content": "THIS!! \n\nOP NTA\n\nEdit: OP LOL ..I'm picturing the next 'family' dinner \"and you get a vasectomy and you get a vasectomy\". Your family/siblings need a reminder that your relationship with your husband carries a lot more weight than housing your brothers'-girlfriends kids, no matter the situation. \nI will always choose my partner, he's my ride and die. 💜",
                  "id": 7,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Best update from an OP ever!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Same brother same",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 175,
                  "content": "This is 100% your brother and sister in laws fault.  NTA",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "[removed]",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 758,
              "content": "The only feasible way to help is to gift them a used camper that can be parked on some other family members property. A few thousand to keep them out of the shelter, give them some privacy and a place to keep their stuff and wash your hands of their drama. Only if you want to continue to have a relationship . It definitely would be cheaper than letting them move in with you. When your brother and his partner have a little money, they can pay the lot rent to move the camper to their own space with proper hookups. If you go that route, tell them this is the only help you will be giving.",
              "id": 12,
              "comments": [
                {
                  "score": 1861,
                  "content": "Funny you mention that, I actually looked. All the used campers I saw on marketplace and Craigslist that could fit them are all like 8k+, and while I could afford it I really don’t want to drop that kind of money since I know they wouldn’t appreciate it and would only complain about it not being good enough",
                  "id": 13,
                  "comments": [
                    {
                      "score": 1006,
                      "content": "I sounds like you know you're doing the right thing, you just need a reddit push to go low contact \n\nNTA",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 548,
                      "content": "$8k is a lot!  You have no obligation to help them, especially if they don’t help you.  4 kids are expensive, but it should be possible to feed and house them if both brother and gf work.  If they live in a very expensive area, they need to think about a less expensive one.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "If I had the money, I would offer it for the kids and my own peace of mind. I would not care about appreciation and complaints because then I would be done with them. Choosing beggars who would prefer a shelter to their own roof are not worth my time. \n\nNursing is a profession that can take you anywhere, and there are airports in most of those places. If the only reason you stay where you are is to see family, it might be time to look at other options. My hospital system is offering 15-20,000 sign on bonuses for nurses. The airline industry is also hurting for employees, so I would bet there are sign on perks there too.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "Plus, given this: \n\n>*They also let their four kids absolutely destroy every rental they live in, coloring on the walls, holes in the walls, etc.*\n\n...it would be a really bad idea.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "My aunt budgeted my mom into giving her camper to my cousin. The cousin's husband said it wasn't good enough and they never used it. Mom was upset because auntie just won't quit when she wants something. She regretted giving the camper away because she still used it.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "They want to take over your house, which is exactly what they will do. You will be forced to hide away in your room while they run roughshod all over your house. They have no intention of supporting themselves or moving out. They count on the threat of a shelter making you feel guilty enough to save them from themselves but their behavior proves they have no intention of leaving. They just use and abuse a place until they are forced to move on. It's not your fault how their lives turned out. They've also had many more years to get their crap together but want to rely on baby sister to bail them out instead. NTA",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "Why not get **literally everyone else** to chip in on buying a camper for them?? Then move them onto property that’s not yours? Lol Why is it all on YOU to bail these irresponsible people out? They chose to have kids they can’t afford. They made the decisions that led them to homelessness. They refuse to help themselves! \n\nNone of this is your responsibility. Especially considering that they will never appreciate what you have done or will do for them. And *especially* considering that they will just take advantage of your generosity. Their kids will 100% destroy your home, and your brother won’t give you a penny. He feels and sees himself entitled to your help (really just your money). It’s why no one else wants to help. It’s YOUR responsibility, not theirs. It’s YOUR money, not theirs. \n\nSee the pattern? \n\n**NTA**",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "They would ask you to move into the camper while they took your 4 bedroom house.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "Basically it's a lose-lose situation for you\n\nBut in case you eventually feel generous and buy the camper, buy it in your name and arrange an usufruct contract, you said they won't appreciate it anyway but they won't be able to sell to spend the money on other stuff\n\nIf not, go LC and block anyone who insist\n\nGrammar edit",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "It would likely be trashed, too.    \n\n\nI feel for you, you want to be kind but know it will only bring drama and more work to *your* door...",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": ">The only feasible way to help is to gift them a used camper\n\nABSOLUTELY NOT. She and her husband should NOT be spending ANY of their finances for her brother and gfs bad choices. She and husband are neither a bank nor atm to be shelling out money.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Plus, if OP would do that for this brother, what would stop the others siblings from pestering her with \"hey, you have money to spare, why won't you cover for my kid's school expenses / sports equipments / whatever ?\"",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Just feasible in the sense of putting a roof over their head without putting them in her house. Only if she Wanted to find a way that would keep them out of the shelter as well as out of her shelter. She doesn't owe them anything. Best to just block their numbers and prepare to file a restraining order for when they show up in person to harass her.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "More enablement.  Don't give them anything.  They can work for something but no handouts.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I've worked with campers since I was basically out of the womb. And this is a terrible idea. Campers aren't meant to live in, especially if you live somewhere with cold weather. Things break down constantly. They'll need full electricity, water and sewer hookups too.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Excellent idea.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Have you seen the price of used campers since covid started?",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "If OP did this it would just keep the door open for them to keep milking her generosity. If the rest of the family wants Tom help they can set up a go fund me or something of the sorts. OP you’re not obligated to do anything for them. It sounds like they aren’t even considering any other routes. They just assumed you’d let them live with you which just solid their entitlement.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "Do Not tell them the details of what you use your house for! Information diet - any single detail you speak of will be thrown back at you. You owe them nothing- try and see the parents when none of your leech siblings are around. I’d skip the family get togethers - pick up a shift at work and tell them nope, I’ll see parents another day. NTA obviously",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "Dude, those rooms could all be empty but for a single dandelion in a vase, and you still get to say no.  \nWhich you seem to have well in hand.  \nNTA. \nThere are some people, family and not, who cannot be helped. It sucks, especially when kids are involved.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Moving forward, I’d advise attending family functions exclusively in fur coats. Also, consider printing fake $100 bills and lighting cigars with them \n\nNTA.",
              "id": 34,
              "comments": [
                {
                  "score": 3,
                  "content": "Lol",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I feel like this is a Bender from Futurama reply",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "NTA not your responsibility!\n\nMy brother moved into a rental property. My mom had when he got a job in a different town where the property was. She didn't make him pay rent because she wanted him to be able to get ahead financially. He never dead, and in fact after six years got married , then there was the divorce. It took well over two years to evict his ex-wife because every time it was time, that she could legally be evicted, she would pretend to get back together with my brother so he would beg my mom to cancel the eviction. \n\nMy mom lost tens of thousands of dollars in rent since the two never paid for living there all those years. Nor did my brother save up any money he during those years.  All he did was buy stuff filling the house, garage and basement with tools and snowmobile's and guns etc.\n\nYour brother has no plan and will only be mooching off you until you've had enough and then it'll be several months for an eviction to play out!",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Home offices are tax write-offs. Were they going to pay the difference?",
              "id": 38,
              "comments": [
                {
                  "score": 77,
                  "content": "I’d be shocked if they’d pay for a loaf of bread",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Only for the self-employeed.  If they are regular employees that just happen to work at home, there is no deduction for that.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah, regular employees can claim some work related expenses at least.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "Your siblings are selfish & greedt af. They're lacking of planning/parenting isn't your problem. They clearly need this dose of a reality check they're about to get. If any other family like aunts, uncles, etc. say anything just straight up ask them why they aren't taking them in if they're so concerned? That will shut them up real quick",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "You are NOT responsible for ANYONE but yourself (and sometimes your husband). Your brother chose his lot in life and has to live with any consequences that come from bad choices. It's sucks to be them, but still not your responsibility. And don't let them play the \"but it's faaaaamilyyyy\" card to try to guilt trip you. You didn't choose his wife and you didn't impregnate her 4 times. You didn't choose their jobs or where they live or anything about their life. They chose it, it's all on them.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "At least you won't ever see them again",
              "id": 44,
              "comments": [
                {
                  "score": 24,
                  "content": "It would be nice",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Because she's the youngest and they have *CHILDREN!!!* Speaking as youngest who had family responsibilities foisted on me because I \"didn't have kids, so obviously I had lots of spare time and no responsibilities of my own\".",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I was going to ask this as well lol\n\nNTA\n\nDepending on where you live, there is rental aid, SNAP (for food), extra income for families that have young kids, they even have 'low-income housing' for those at poverty-line levels. And a lot more if you find the right person to talk to. If they aren't trying to get all the resources they can, then that's their own problem.\n\nSometimes tough love means you have to let them hit rock bottom so they realize that THEY need to fix things. It's not your responsibility to babysit their kids or your siblings.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2708,
      "content": "NTA. \n\n\\- The don't pay money owed \n\n\\- They destroy other peoples property \n\n\\- They also have parents and multiple other siblings \n\n\\- They have a history of not paying rent and having to be evicted. \n\nAt this point, start asking why they're in a shelter, and no one else is helping. Combined, with all the siblings and parents, they can hustle and pay their rent on a new place.",
      "id": 48,
      "comments": [
        {
          "score": 503,
          "content": "Since they're so invested and concerned, Mom and Dad can take them in. NTA.",
          "id": 49,
          "comments": [
            {
              "score": 450,
              "content": "OP has said [here](https://www.reddit.com/r/AmItheAsshole/comments/13dt0tt/comment/jjmfwxd/?utm_source=share&utm_medium=web2x&context=3) that her parents actually don't like her siblings, they only stay in contact with them for the grandkids. So I doubt they'll take them in.",
              "id": 50,
              "comments": [
                {
                  "score": 145,
                  "content": "Then they need to shut up and butt out.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 101,
                      "content": "Maybe I missed it but from the post it doesn’t seem like the parents had any input",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "Parents are quietly on OPs side and not piling on with the siblings.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Maybe the parents could just take in the grandkids.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "It’s also really clear there’s a gender dynamic!\n\n3 brothers and the youngest baby sister is the one expected to clean up messes? Swoop in and save the day? Hell no. \n\nNTA",
          "id": 55,
          "comments": [
            {
              "score": 53,
              "content": "I don’t see a gender dynamic here. She’s the “rich” sibling so she is expected to swoop in with her money bags and bail her family out as needed. I doubt their feelings of entitlement surrounding her money and assistance would be any different if she were a man.\n\nAlso OP has a sister 30F.",
              "id": 56,
              "comments": [
                {
                  "score": 2,
                  "content": "Ah thank you! I missed that!\n\nI thought it was 3 bro’s who had had the 14 kids, unable to provide for them, and relying on lil sis to step in and help with childcare when OP was young and then money when OP was older. Also sounded like the parents were either okay with or encouraging of both. If that was the case, it felt super gendered to me. Much less so with that info!",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1354,
      "content": ">My oldest brother is getting evicted\n\n>they have a habit of settling in somewhere and not paying rent and refusing to leave. They also let their four kids absolutely destroy every rental they live in, coloring on the walls, holes in the walls, etc.\n\nI wonder why they are being evicted?\n\nNTA",
      "id": 58,
      "comments": [
        {
          "score": 185,
          "content": ">they have a habit of settling in somewhere and not paying rent and refusing to leave. They also let their four kids absolutely destroy every rental they live in, coloring on the walls, holes in the walls, etc.\n\nSounds like the prime example of the worst section 8 tenants ever.",
          "id": 59,
          "comments": [
            {
              "score": 294,
              "content": "Most Section 8 recipients I've known were grateful to make it off the waitlist and took pride in caring for their new apartments or houses because, in many cases, it was the nicest home they'd had up to that point.\n\nLetting your kids put holes in the wall, that isn't a money thing, that's just bad parenting.",
              "id": 60,
              "comments": [
                {
                  "score": 51,
                  "content": "I'm having a hell of a time even getting ON the waitlist! It's open for like one random week every year and always different. You just have to check your email constantly and hope you see it at the right time",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 45,
                  "content": "I've seen both sides of Section 8. Some are beyond grateful to have a warm apartment, a fridge, and a mattress on the floor. Others open their windows and throw trash, bottles, or diapers into the courtyard, and the landlords frequently get fined. They then complain that they shouldn't have to pay rent because there is urine in the elevator or their stove caught fire because they forgot to turn it off.\n\nI have seen some who feared they would never have a home again, only to be stuck next to some people who blast music all night while all sorts of smoke fills the hall or is blown out the window. I wish that they would have a one year grace period for all tenants.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My neighbor owed a house in CA that he turned into Section 8 housing.  The tenant left food and dirty dishes all over the place, attracting rodents and roaches, as well as trashing the place.  Section 8 came and inspected.  Forced the landlord to renovate the property up to their specs, made him pay for housing for the tenant elsewhere while he repaired the property, and then made him let the tenant MOVE BACK IN!",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 901,
      "content": "again with the: I'm poor but have 157 children.. come on, if you are low on money just have 1 or 2 kids so nobody will starve or live in shelters. why do people put themselves in this position? so that others in the family can pay for their family?\n\nthese are not your children, your siblings are not your responsability. they are adults and should take care of themselves. \n\nIf they were sick, of had an accident and it was a one time thing? ok.... but no, they just dont pay rent for a habit...\n\nNTA",
      "id": 64,
      "comments": [
        {
          "score": 1085,
          "content": "My brothers don’t seem to know what condoms are. And my sister had her first at 16 and kept them coming after that. She has six kids with six different men, and she’s always convinced every guy she meets is “the one”. I don’t understand them tbh, we grew up in a normal middle class household and our parents taught us proper sex ed. I really wish they’d all get it together tbh, but none of them want to go to college or anything",
          "id": 65,
          "comments": [
            {
              "score": 436,
              "content": "dont help them, they will just spend all the money and try to \"suck\" more out of you",
              "id": 66,
              "comments": [
                {
                  "score": 439,
                  "content": "They have definitely done that to multiple relatives lol",
                  "id": 67,
                  "comments": [
                    {
                      "score": 180,
                      "content": "What I want to know is how the hell did you turn out so...well, responsible and normal? I mean, it's a great thing, you should be very proud, it's just different that the older three are shit shows and the youngest has it together. Of maybe it's because you watched their lives turn into dumpster fires and knew you didn't want that so made different choices?",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Run away from them. They all should be deprived of parental rights",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 300,
              "content": "6 kids with 6 diff men? \n\nTo quote Chris Rock, \"B**ch stop f***king! Put the dick down. And get a job.\"",
              "id": 70,
              "comments": [
                {
                  "score": 259,
                  "content": "Funny because she doesn’t have a job.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 156,
                      "content": "i for one am shocked to hear that",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 96,
                      "content": "Well in fairness, day care for 6 children would cost more than it sounds like she (or honestly most Americans) earns.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Of course she doesn't.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Another gem from his latest special... \"Don't let broke dick cum inside you!\"",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 55,
              "content": "Since you're like 8 years young than your sister, I wonder how different your childhoods' were. Plus don't you have different fathers? It sounds like she had a mother who worked a lot, an absent biological father and (what sounds like) an indifferent step-father, so I'm not surprised she started having kids in high school.",
              "id": 76,
              "comments": [
                {
                  "score": 166,
                  "content": "You’re pretty accurate. Although I wouldnt say my father was indifferent towards them. He worked pretty hard to buy them nice things to try to make up for their absent father. My dads just a quiet and socially awkward guy, I’ve actually suspected he might have autism tbh. But tbh my sister was provided birth control she just chose not to use it, everything that had happened was her choice",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 42,
                  "content": "This is exactly where my brain was headed while reading OP’s additional comments and context. They did make their own choices but there’s something to be said for those formative years and how different they can be between siblings. And how that plays into how they show up as adults (and their relationships with their parents). There are large age gaps here and a new parent in their 20s is very different from a settled, more experienced parent in their 30s. Younger siblings tend to have a very different viewpoint of how childhood was. \n\nThis isn’t to place blame anywhere, just thinking about the fuller picture and what got all 3 of them here. And also, NTA. As parents, it’s time for them to get their shit together.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Honestly this is why I believe that some people shouldn’t have a choice and sterilization is needed. One accident baby I could excuse, maybe two if it’s spaced or something but 6??? If you can’t afford to even house them, stop having them.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "🤣 yeah. only help I would give that sister is paying for her to get her tubes tied or a birth control implant.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "NTA. They've made their choices, and you've made yours. Just because they're finding out that they don't like the results of their choices and prefer the results of yours, it doesn't mean they're ever going to change what they do. \n\nAt 32, he does actually have time to change and make better choices!  If he really wanted to, he could turn himself around. But no, he wants to leech, and let his kids destroy your house.  I doubt the shelter will let them away with that behaviour any more than the landlord did so he might find himself in a worse position before long - again, through choice.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Holy hell.  \nAnd NTA.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 415,
      "content": "Reddit's using all our posts and data to train AI's, so, I just deleted mine.",
      "id": 83,
      "comments": [
        {
          "score": 563,
          "content": "None of our relatives have the room to take them in, that or they aren’t willing to. They used to stay with his girlfriends parents but she had to change the locks while they were gone to get them out. They actually will be going to a shelter, and I do feel bad. But I hope my brother takes this as a lesson to pay the bills instead of blowing his money on stupid shit like vapes and tattoos.",
          "id": 84,
          "comments": [
            {
              "score": 252,
              "content": "When no one else will take them in even temporarily, there’s probably a reason for that. I’d hazard a guess that no one wants their house damaged and/or to have to go through the eviction process. Tell your brother that the people complaining about you and your husband sound sympathetic to his situation so he should go see them about a place to live. NTA",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "those arethe first things to cut when shelter is looming above ones head. but sadly noone does that. most ppl get even pets on top of xthousand children. i dont get those mental gymnastics. you are NTA\n\nit sucks to be their children. but tough luck i guess.",
              "id": 86,
              "comments": [
                {
                  "score": 33,
                  "content": "I had to cut tattoos years ago (and I only mainly got flash event tattoos that were $30ish) and I don't even have kids. I can't imagine going to get a tattoo when there's multiple mini humans around me that still need basics like shelter.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 3,
                      "content": "100%",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "The more I learn about your family, the more I want to beg you to stick to your guns on this. You may lose some family members, but you will save the peace of your home. Stay strong, good luck.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "The shelter may be the best place because they may get CPS or other oversight and/or conditions forgetting help.  Don’t come in to the shelter 2 weeks in with a fresh tattoo",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Don't feel bad, going to a shelter is their own choice. They could have chosen long ago - or anytime, really - to hold down jobs, pay back money owed, treat family and home with respect. I daresay should they be a kind, respectful and fun family unit, you would have let them stay?\n\nDon't feel guilty for other people's life choices. You have no control over that.",
              "id": 91,
              "comments": [
                {
                  "score": 16,
                  "content": "They also could have chosen to not have four children that they don't want to look after.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "TBH it sounds like the shelter might be a good thing for their kids.  What you're describing doesn't sound like a good environment for them.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Don’t feel bad if their parents had to do that then clearly they destroyed th e plsce",
              "id": 94,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 318,
      "content": "NTA\n\n>They also let their four kids absolutely destroy every rental they live in, coloring on the walls, holes in the walls, etc. \n\nThat's all you need to stay. You are not responsible for their *lack* of responsibility. They bred like rabbits, and they don't respect property or respect you.\n\nWhy won't your parents take them in?",
      "id": 95,
      "comments": [
        {
          "score": 296,
          "content": "Our parents recently downsized to a two bedroom with a big outdoor space, and their second bedroom is used to keep my mothers African grey parrot.",
          "id": 96,
          "comments": [
            {
              "score": 150,
              "content": "It's not fair for them to judge how you use your space when your parents dedicate an entire room to their parrot. The double standard isn't right. Not that either of you need to justify what you do in your own houses.\n\nDon't let them use and abuse you.",
              "id": 97,
              "comments": [
                {
                  "score": 162,
                  "content": "Honestly I'd prefer an African Grey to unruly toddlers.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I would too and I am legitimate scared to death of parrots. (Got bit by one as a kid)",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "The biggest difference between those two things is one has feathers",
                      "id": 100,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Beats a Norwegian Blue",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "In my state, there are legal space requirements if you want to keep certain birds.  A local falconer commented that one of \"her\" birds (the bird is technically owned by the state) has a bigger room than her son, lol.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "I'm betting that part of the reason they decided to downsize was to keep those chickens from coming home to roost! 😂",
              "id": 103,
              "comments": [
                {
                  "score": 162,
                  "content": "You are absolutely correct. My dad said they downsize so no one visits or they’re getting a divorce. My sister stayed with them for years and it drove my parents crazy. My mom would let her come back while my dad was at work and she’d stay for a few months and then leave and then it would happen again.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 72,
                      "content": "I suspect that is a large part of the popularity of senior housing. Nobody's got to worry about housing kids and grandkids for longer than a typical vacation, because it's forbidden. 👍🏻",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "NTA. Wow. It sound like your Mom may have had a big hand as to how your half siblings ended up... considering how she allowed your sister back into their house numerous times. \n She clearly is seeing the consequences of it now. I can understand trauma connected to not having a relationship with their biological father, yet at some point, we all need to heal,  grow up and do right by our children. You are not responsible for or to your siblings. Your brother needs to learn his life lessons. He should not be coddled. It blows my mind how some people continue to blame others and never take responsibility for their choices.  Your brother can better his and his family's life if he just grows the heck up.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "you and the bird are NTA",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Can they camp in your parent's garden? /s",
              "id": 108,
              "comments": [
                {
                  "score": 107,
                  "content": "Mom would have to evict them via garden hose so probably not a good idea",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "[deleted]",
              "id": 110,
              "comments": [
                {
                  "score": 81,
                  "content": "I have a total of 14 nieces and nephews. If I pay for something for one of them I’ll be expected to do for them all. Don’t really want to drop that kind of money on kids I didn’t make",
                  "id": 111,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Ngl but buying them all sexual education and personal finance books would still worth it.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Don't blame you",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Stick to this.",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "School meals can be money directly paid to the school to the child's lunch account. Things like summer camp can be paid directly via a credit card so any 'refunds' goes back to the payee, not the parent. Suggest clothes be secondhand or tags removed first, else they might try to return them for cash.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "That sounds like a good idea. It's not the kids' fault that the parents are irresponsible deadbeats.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Ahhhh parrot tax! And that little guy deserve its own room - probably smarter than your brother",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This made me laugh",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Big outdoor? 2 tents and a porta potti. Problem solved. They have a place and no destroying the house.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 204,
      "content": "NTA. \n\n>My other two siblings chimed in agreeing with my brother, and they think I’m a sucky asshole\n\nAre they jumping to help? No? Then their opinion is irrelevant.  \n\nYour older siblings are a joke. I have siblings 11 and 13 years younger. I would be embarrassed and ashamed if I had to ask my baby sister to help keep a roof over me and my kids' heads. You are absolutely right that if you entertain this bullshit, they're going to trash your house and make your life hell. \n\nIf they are homeless, that isn't your fault. You had nothing to do with their choices or circumstances that led to that.",
      "id": 120,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA-If your parents and/or siblings think they need help, then they can take in your brother, gf & kids. Not your circus and you & your husband don’t want to be apart of their circus.",
      "id": 121,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 92,
      "content": "NTA.\n\n>my siblings are the type to ask for favors but never offer to help you need it. They always borrow money from our parents but never pay it back. \n\nThese people would bleed you dry if you gave them the chance.\n\n>They have a habit of settling in somewhere and not paying rent and refusing to leave. They also let their four kids absolutely destroy every rental they live in, coloring on the walls, holes in the walls, etc. \n\nAbsolutely right. Do not give in.",
      "id": 122,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 90,
      "content": "NTA you aren’t an ATM nor are you a free hotel.",
      "id": 123,
      "comments": [
        {
          "score": 22,
          "content": "OP needs a t-shirt that says \"Not an ATM\" to wear to family functions!",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}