{
  "post content": "AITA For unpacking my girlfriend’s towel. \n\nI (31M) and my gf (25F) have been dating for about 2 years. \n\nMy GF has beautiful hair that seems a lot more low maintenance than most women I know. She doesn’t use all a hundred different hair products, nor does she blow dry it. It honestly doesn’t take her long to style her hair or anything. However, she always insist on using this special towel to dry her hair. \n\nShe insists that she can’t use any regular towel for her hair. She gets mad if I use her hair towel as a regular towel too. She says that the towel should only be used for hair. She even bought an extra one of these towels that she keeps in her drawer at my place. She also takes the towel with her when she goes on vacation. \n\nI usually don’t mind it, since the towel doesn’t take up much space, and it better than listening to a hair dryer all the time. But it’s a bit weird because I don’t know anyone else who has a towel just for their hair. \n\nFor Thanksgiving, we travelled to see my family. Before the trip, I asked my GF to leave her towel at home since we’ll be staying at my parents’ house. I didn’t want my family to think she was weird or make fun of her. \n\nSince we planned to leave early in the morning, GF spent the night at my place. I noticed that she packed the towel she kept at my place in her suitcase. When she was asleep, I took the towel out. She didn’t notice the towel was gone until after we got to my parent’s house. \n\nI thought it was okay, and my GF didn’t seem mad at all during the whole trip. However, when we got back at my place, my GF got into her car and drove off without saying goodbye. She texted me later saying she’s mad at me because of that stupid towel and she needs some space. I keep calling and texting her, but she won’t respond. \n\nMy friends think she’s being overly dramatic, but my GF isn’t that type of person. Now I’m wondering if I messed up. AITA",
  "id": 1,
  "comments": [
    {
      "score": 59933,
      "content": "YTA…and Douglas Adam’s can explain why better than I…\n“A towel, [The Hitchhiker's Guide to the Galaxy] says, is about the most massively useful thing an interstellar hitchhiker can have. Partly it has great practical value. You can wrap it around you for warmth as you bound across the cold moons of Jaglan Beta; you can lie on it on the brilliant marble-sanded beaches of Santraginus V, inhaling the heady sea vapors; you can sleep under it beneath the stars which shine so redly on the desert world of Kakrafoon; use it to sail a miniraft down the slow heavy River Moth; wet it for use in hand-to-hand-combat; wrap it round your head to ward off noxious fumes or avoid the gaze of the Ravenous Bugblatter Beast of Traal (such a mind-boggingly stupid animal, it assumes that if you can't see it, it can't see you); you can wave your towel in emergencies as a distress signal, and of course dry yourself off with it if it still seems to be clean enough.”\n\nEdit:  WOW! Was not expecting this much love. So many awards! Thank you!! \nSpecial thanks to the OP for being such an AH and inspiring this outstanding thread.  \nLesson learned: Don’t fuck with someone else’s towel.",
      "id": 2,
      "comments": [
        {
          "score": 19239,
          "content": "If I could, I would give this 42 upvotes...",
          "id": 3,
          "comments": [
            {
              "score": 4652,
              "content": "The only truly understood and appreciated amount. Thank you.",
              "id": 4,
              "comments": [
                {
                  "score": 66,
                  "content": "42k, close enough",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1565,
              "content": "What a Deep Thought!",
              "id": 6,
              "comments": [
                {
                  "score": 457,
                  "content": "SMACK TO THE FACE!",
                  "id": 7,
                  "comments": [
                    {
                      "score": 401,
                      "content": "No a smack to the earth,  poor whale :(",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 696,
              "content": "As of this comment, it has 4.2k upvotes so….close enough.\n\nEDIT: 420k, here we gooooooo",
              "id": 9,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 179,
              "content": "As of my vote it currently has 4.2k lol",
              "id": 10,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 79,
              "content": "Ditto.",
              "id": 11,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3927,
          "content": "Yep, YTA. Let me count the ways\n\n1. Freaking about a towel.\n2. Prioritizing your family of origin's weird towel obsession (or even weirder, your imagined worry about their towel obsession) over your significant other's towel obsession.\n3. Going behind your SO's back to get rid of the towel.\n4. And let's just throw some potential cultural/race angle just for fun - curly/wavy-haired people more likely to have a specialized towel, so maybe there's some fun race-shaming involved as well.\n\nI feel I need to go buy me a special towel now to wipe off the icky feeling.",
          "id": 12,
          "comments": [
            {
              "score": 1901,
              "content": "i immediately thought of point 4 - not only might that towel help her hair dry faster, it’s likely better than regular towels at not breaking her hair and helping it be less frizzy when it does dry. i have three of those towels and they’re EXPENSIVE. thankfully mine are all shaped specially so it’s obvious they’re not normal towels.\n\nif i realized that my SO deliberately snuck something private of mine away from me despite my explanations of why it was important, especially for something so minor, i’d feel belittled and disrespected, too. and concerned - instead of talking through it, they just…went behind my back and assumed i’d be too dumb to figure it out? just accept being treated like that? it’s not about the towel.",
              "id": 13,
              "comments": [
                {
                  "score": 1918,
                  "content": "I also didn't like the \"not like most other women\"... the way OP talks about it, he just never respected the towel for what it was, something she uses in her everyday life that makes her feel good. \n\nUgh, I just hate the \"not like most other women\"... misogynistic vibes... who cares what or how much product people put in their hair? it's their hair!\n\nYTA.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 1094,
                      "content": "And that the OP goes on quite a bit about how it's so great that she doesn't spend a lot of time or effort or tools... yeah, because she found one simple thing that works! You take away the one thing that works, you've broken the system you were just admiring.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 773,
                      "content": "I found that part unsettling, too. How using different products, using a hair dryer, and needing time to style hair are all just too much to bear.  He talks about women's self-maintenance like it's  just *one more thing* that women do specifically to inconvenience him.\n\nIt's impossible that this is the first time he has minimalized her.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Can we find out who this girlfriend is so we can warn her at about HTA?",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "I've allwase wondered who these \"other women\" were and what they were like cuz man If they dident like him either I may wanna be there friend ya know",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 417,
                  "content": ">it’s not about the towel.\n\n100% it's about him not seeing her as an equal. Even if there is no real reason for her to need a special towel besides that she likes it, his behavior is breakup worthy to me. If he'll do this over a towel that he thinks she doesn't need, what else will he take away from her?",
                  "id": 19,
                  "comments": [
                    {
                      "score": 43,
                      "content": "The next thing he'll sabotage is her birth control, on some pretext that his family believes in natural planning, or \"oops, you'd make a wonderful mother and aren't I grand for standing by you.\"\n\nOr perhaps he'll sabotage her career or her friendships at some gathering, with the goal of keeping her only to himself.\n\nYTA op. Please let us talk to your gf if she ever thinks about getting back with you.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "I was thinking about that too, maybe he THINKS it's low maintenance and it's only because she has to use this for his hair, but he doesn't understand how her hair works, and thus doesn't get it. Also blowdrying your hair doesn't mean your high maintenance, but if she has a nice blowdryer that she wanted to bring with her, would your family judge her for that?\n\nIf anyone WENT INTO MY SUITCASE AND UNPACKED IT WITHOUT ASKING I would be furious.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "OP even mentioned that he’s used her towels repeatedly in the past, to her irritation.\n\nHe repeatedly violates her boundaries because he can’t be bothered to just STFU about something that doesn’t concern him, and can’t be bothered to treat her with respect.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "She doesn't even need to explain. If a SO messed around with any of my personal items behind my back, I'd see red flags. That's strange, controlling behavior. The kind that doesn't stop with just one incident. The kind that gets worse with time.\n\nThe GF going LC is her having healthy boundaries, and enforcing them.\n\nWhat if one day he decides it's time to have children, and messes around with her BC? Where does \"Daddy knows best!\" end? It's fucking weird.\n\nEdit: YTA",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "YES. I have like 5 of those motherfuckers and they're 30 bucks each for a bit larger than size of a hand tower but thinner and lighter. They take no room in your suitcase! And they dry your hair so much more quickly and with less breakage. If my husband pulled this shit it wouldn't just be about him fucking with my haircare, it's about RESPECT. OP behaved utterly without respect for his gf, thinks he knows better and shows so much contempt for her and I hope she sees that while she's away from him.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I have really fine hair and also have the specifically hair towel  shaped ones.  I do not know how this guy thinks it's not a normal thing.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Yah for real. I have a hair towel. Why? Curly hair! It is a different material than regular towels because curly hair tends to break more easily and helps with frizz. Husband has never questioned the towel going wherever we go lol. OP, YTA",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 902,
              "content": "5. The way he talks down about products and hair dryers and OMG listening to the awful sound of hair dryers. Thank GOD she isn't high maintenance. /s\n\nI do not use products or blow dryers, but I do occasionally use a special towel for my curly hair.",
              "id": 27,
              "comments": [
                {
                  "score": 409,
                  "content": "there seem to be a lot of posts on here about men undermining women because of their hair routine, especially curly haired women with a different routine. It's so gross. Different hair has different maintenance needs.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 68,
                      "content": "The same men who \"prefer\" women with long hair. Gag.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "I honestly think it’s a lot of men who have had things done for them their entire lives. I’m a white girl with long blonde (dyed) hair. I spend a lot of time and money on my hair, and I use many products and yes, special drying towels to help keep it healthy. I like to take care of my things that I’ve had to spend effort on. No one else is going to do it for me. I don’t think a lot of men have had to really take care of their own things (including themselves!) before cause they go from mom, gross early twenties, to wives that take care of their things for them.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "And the different ways it's worn!\n\nI could keep my hair healthy and beautiful on the cheap if I kept it in a bun all the time. It's low maintenance and my hair would be naturally at it's most healthy looking.\n\nBut I cannot stand the look on me. I like my hair down and I like to run my fingers through it. I scratch and massage my scalp a lot as a nervous habit. But I have wavy thick hair. I mean, like  a lot of hair but my strands are pretty fine.  I hate haircuts so my hair goes forever between cuts. My last one was before covid.\n\nI blow out my roots and over condition my ends. It's what works for my aesthetic and my habits. Anyone who says my hair has to be different or I can't maintain it how I like can fuck right off. The only thing that'll limit my hair style is what I can personally maintain.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I occasionally use a hair dryer and I will take it when we travel because I just don’t like most hotel dryers.  Never once in 9 years has my partner said, “omg, you are SO HIGH MAINTENANCE AND ANNOYING WITH YOUR HAIR DRYER.”\n\nIf anything he probably just thinks I’m high maintenance because of my expensive skin care.  But y’know what?  He keeps his mouth shut about it - it’s my face and my money.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "It's like he's... jealous of a towel 🤦🤣\n\nAside from the towel, it's about him going through her things. He ran his own experiment on his girlfriend to measure whether or not she would be aware of the towel's absence. Well shit, he may as well have removed her toothbrush along with it!\n\nI own two towels just like what was described ([here](https://volobeauty.com/products/volo-quick-dry-towel) ). Why a separate towel for my hair than my body? The reason being is that regular towels are too rough on the hair surface and texture. This results in hair frizzing and causing breakage. \n\nAnyone who goes so far as to shame another person for how they care about their appearance is stooping pretty low.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Amen! I'm white and straighted haired female and I even have a preferred towel wrap thing for my hair. And let's face it I have easy hair.  I hate blow drying and doing anything else with it. On the one hand if she is over-blowing the towels abilities, it's still part of her routine and you removing it without her knowledge is a breaking of boundaries and trust!",
              "id": 34,
              "comments": [
                {
                  "score": 16,
                  "content": "I have straight baby fine hair, and use a swimmer’s towel because it speeds up the drying process. I also sleep on a silk pillowcase. Normal behavior. OP acted toxic.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Absolutely!\nI think we live in a time where we know that different hair types need different care routines and products.\n\nIgnoring his idiotic “not like other girls” comment, that towel is probably a key tool in her not needing a lot of other products. Instead of having to pack dryers/curlers/straighteners/mouses/gels/multiple brushes/combs/sprays/spritzes/oils or etcetera, the only thing she wanted was that towel…\nAnd he hid it from her.\n\nOP, YTA.\nIf you don’t know why that towel is so important to her you could’ve tried asking her and trying to understand her instead of just judging her. Or you could’ve googled it. There are A LOT OF PEOPLE who use not only specific towels but specific any of the products I mentioned above for their hair. Even pillowcases…\n\nIf your family freaked out at the sight of a foreign towel inside their house you could’ve just told them: “it’s to dry her hair” and that would’ve been enough. There’s nothing weird about it.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I also think number 4. is in play here. I think thats maybe why he would be embarrassed, be cause their family would see it as a dumb/funny cultural habit. And possibly also why his friends think she is overdramatic.\n\n5. 5. Why would you be embarrassed of your own girlfriend? That's YTA too.\n\nI admire her reaction though. She stayed polite the whole trip and didn't make a scene (perhaps while feeling extremely uncomfortable the whole time). Sat out her time. And then just left right after the trip. Didn't even feel the need to waste words cause it's obvious he disrespected her BIG TIME. And he knows already.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I have wavy hair that if I put in a regular towel, I end up with frizz for days.  I still have frizz cuz Florida but it would be so much worse",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3024,
          "content": "[removed]",
          "id": 39,
          "comments": [
            {
              "score": 4849,
              "content": ">OP is a massive ass. You think your family is going to judge a towel? Really?? Or are you just a controlling jerk and this offends your view of the world?\n\nI mean, just for the sake of argument I will say that it is *possible* OP is a rational person who happens to come from the shittiest meanest most childish judgmental terrible horrible awful family of assholes, and his family was legitimately going to judge her for her towel. \n\n*However*, if that were the case OP would absolutely still be the asshole, because no one should subject their significant other to the kind of family that will judge the shit out of you for bringing your own towel.",
              "id": 40,
              "comments": [
                {
                  "score": 2237,
                  "content": "Or, more likely, both OP AND his family are massive assholes. This kind of entitlement OP displays does not appear out of the blue. He doesn’t think twice about his familys behavior towards his gf, he just doesn’t want his gf to embarass him in front of his family. Because he actually think ridiculing her for that towel is legitimate.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 2916,
                      "content": "Yes, he spends two paragraphs explaining why her use of the towel is weird. He is the one who finds it weird and he is the one who thinks his family will find it weird.\n\nAnd btw, I knows lots of curly hair people who have special towels for their hair and special pillowcases. Not that I need to know them in order to respect his girlfriend's choice of drying her hair in a specific way, I'm just saying it's definitely not weird.\n\nEdit: also as someone with a specific hair routine, I would feel very uncomfortable if I went somewhere where I wanted to look my best (as she did presumably) and I didn't have the means cause someone else unpacked them. She is right not to talk to him.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 458,
                      "content": "I am sad that he exposed her to this level of entitlement and that he tried to trick her into not doing something that he doesn't understand. Instead of addressing his family's shitty attitude, he tried to force her into being something he knew his family would accept.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Wait, he ran and told all his friends too! He made sure that they all think she’s an asshole now also! This woman should just dump OP.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1336,
                  "content": "And at the end of the day, would the family even see the towel? Even if she was wearing it on her head, would it really be so strange to them that they would comment on it? You're right, this is more an example of OP needing to police her behavior than anything else. It starts with making her second guess herself over a towel...",
                  "id": 45,
                  "comments": [
                    {
                      "score": 1106,
                      "content": "Which she didn't! She peaced the fuck out! I'm so,so proud of her!!!",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "I like to bring my own towel if I'm only staying for one night. It feels like such an imposition to make my host(s) wash a whole towel because I used it *once*. (Of course when I'm a host, I don't expect my guests to bring their own towel). Also, isn't it a common understanding nowadays that women typically have all sorts of beauty rituals requiring specific products? That's exactly what that towel is. It's not a towel, it's her hair ritual. OP is both the AH and an idiot.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 712,
                  "content": "[deleted]",
                  "id": 48,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Exactly, people who throw things out that belongs to others annoy me. Even my boyfriend's mom threw out some sauce and food I had that I got mere hours before, why can't people respect boundaries and autonomy and privacy? :/",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "Not only without permission but he sneaked it out of the suitcase when she was asleep at night! So he KNEW EXACTLY it was wrong. Otherwise he could have asked her or discussed it with her.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 621,
                  "content": "If she has curly hair, even more of an asshole.  Curly hair can't be treated the same way as straight hair, and if she has kinkier curls, that towel is a necessary part of her hair care.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Yeah I was gonna say this! If it's the kind of towel I'm thinking of it's made of a specific fabric like cotton or microfiber to prevent frizz/curl damage. It's not weird at all either!",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "[deleted]",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "I have curly hair and I have become insanely particular about the towels that touch my hair.  I either use a plain cotton t-shirt or a super soft turban style towel for air drying and yes, I bring both when I travel.  There could be violence if someone effed with my air drying technique.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This idiot doesn't realize that the reason she's so low maintenance with her hair is because of that damn towel.",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "And if the family does indeed tend to make fun of things like this, I hope she thinks twice about investing much more time with them!\nYTA, in case I wasn't clear.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "That the towel is even an issue says it all.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1614,
              "content": "I agree. Douglas Adams is great, just not useful. OP is YTA because it's the GF's freaking towel which they have expressed that they need, and packed themselves. Personal grooming gear is *personal* and the OP's prejudices are their problem. They actively interfered with their GF's packing - this isn't neglect, it's impediment. \n\nWhere does it stop? No, you don't need your own makeup sponge because my dog will think you're weird. No, you don't need pads, because no normal animal bleeds for three days without dying.",
              "id": 58,
              "comments": [
                {
                  "score": 1556,
                  "content": "YTA OP.\nI would also like to point out certain hair types need certain towels (like microfiber) to dry off “correctly” if you use other towels it can leave a frizzy knotted mess and can take forever to straighten out…. (I know from experience)\n\nBut still he did it so sneakily while she was asleep after she packed it…. That shows controlling red flag behavior… like dude, leave the stupid towel alone. Even if it’s not one of the frizz control towels, she obviously needs/wants it in her routine\n\nEdited to add the type of towel cause I forgot the word microfiber lol",
                  "id": 59,
                  "comments": [
                    {
                      "score": 1470,
                      "content": "Ya massive YTA especially after the first part about how nice her hair is despite being so low maintenance. The towel IS THE MAINTENANCE. I do the same thing, I use a microfiber towel to dry my hair and sleep in a satin lined beanie thing and my fiance absolutely makes fun of me, but he would never in a million years remove those things from my suitcase because he knows they're important for my hair care routine.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 534,
                      "content": "Microfiber was my first thought, too. My hair routine (when not dyed) would seem low maintenance to anyone who doesn't understand how to care for my hair. I condition once a week, wash every other week, use leave-in conditioner and cream when I get it wet, and *dry with a specific towel.* My hair looks great because I follow this specific routine. If I used a regular towel even once, it could damage my hair to the point I would need to get it cut. \n\nAnd you're absolutely right that even if it doesn't make a difference to her hair what towel she uses, SO WHAT???? This is some bizarre controlling behavior on his part.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I appreciate this comment. I thought it must be like microfiber or something— you confirmed my inference. I don’t have personal experience but OP explained the towel pretty well— small, replaces a hair drier (pure magic), and replaces the need for a lot of product. His understanding makes his action all the more offensive. \n\nOP, YTA. Your girlfriend likely went through the whole visit feeling a little embarrassed and not at her best. You grin and deal with it when you think it was an error; but you feel sabotaged when you find out someone did it too you on purpose.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 540,
              "content": "If she has curly hair and it's the t shirt towel, she should leave you immediately. Regardless it not about the space in your suitcase which you tried to use as an excuse. You e got some hangup on her being herself around your fam. So YTA. It's a towel. Unless it's made of dead kittens, get over it.",
              "id": 63,
              "comments": [
                {
                  "score": 58,
                  "content": "I think it's about the control for him.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "[deleted]",
                  "id": 65,
                  "comments": [
                    {
                      "score": 37,
                      "content": "But still, why? My wife is a curly, has I believe 4 towels in total (2 standard for wrapping just sown differently and 2 \"silk\" ones or some such). We spent 5 months trying to get proper travel hair dryer with diffuser for travelling and there's a LOT of products/care and stuff she's taking with her.\n\nNo matter where we go we take half a suitcase of that stuff and usually another half a suitcase of shoes that might come handy \"just in case\".\n\nI'd never dreamed of limiting her packing because it might look weird.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 122,
              "content": "It's the answer that had to be written, though. Someone had to do it. It's in the constitution or something.",
              "id": 67,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "Giving you a standing ovation for \"not a 31 year old adult sized moron.\"\n\nWho must be part of a family of AHs if they are paying attention to how she is trying her hair.\n\nYTA OP, she's a freaking adult who can pack her own bags.\n\nYTA for judging how other women take care of their hair.\n\nWhat the hell is wrong with you OP?",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Came to ask what the big deal about a freakin' towel was and why someone is being overly dramatic about it. HINT: That \"someone\" is not who the OP thinks it is. No, it's the person who deliberately removed the towel and to deliberately undermine someone else's hair care regimen.\n\nHe will realize that he was a moron when the revolution comes and he looks back and sees that making a big ordeal out of a towel is precisely why he lost the best thing to ever happen to him. OP is YTA easy.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 665,
          "content": "OP is not a hoopy frood, at all.",
          "id": 70,
          "comments": [
            {
              "score": 333,
              "content": "He definitely doesn't know where his towel is, and I wouldn't give him a toothbrush on my spaceship",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Drifting top comment to say..  DUDE!!   WTF?   Your GF has a magic towel that means she doesn’t use a hundred hair care products, doesn’t need 30 minutes blow drying, let’s her prep her hair without spending an hour on it, her hair looks great, and you have a problem with the magic towel??!!   C’mon man… nobody is this dense.  It’s a magic towel.  They can be folded and take up very little space.  If you still have a GF, be thankful for the towel.  If this is even real, YTA.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "A few days ago, OP stole a towel out of his GF's luggage. This has made a lot of people very angry and been widely regarded as a bad move.",
          "id": 73,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "reminds me of that dude who threw out his gfs extensive collection of skincare products, saying that she has beautiful skin and doesn’t need it. like ya dumb shit how do you think she GETS her skin so nice??",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I own one of those towels. They absorb a higher amount of water and are made in a way that wraps correctly and attaches so it doesn’t fall off. They are small lightweight and not remotely embarrassing. Just because OP doesn’t know what they are doesn’t mean no one else does.",
          "id": 75,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "100% she has curly hair and it’s a special microfiber towel that you don’t even wash in the washing machine.\n\nI have one, I wouldn’t let anyone tell me I can’t use it. My hair is a mess with regular towels, a frizz ball mess that takes a week or two to get back to normal. Curly hair well managed is a bitch and those towels are such a great discovery for people with hair like ours. OP is a fucking asshole to think they should control their partner’s hygiene habits.\n\nGod I want this woman to leave this fucking controlling OP so fast their head spins.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 37269,
      "content": "YTA\n\n She packed that towel because she needed that towel.\n\nIt's probably a microfiber towel.  Then tend to help dry hair quickly, without blow-drying (which can be damaging, especially if her hair is long or curly).  It also helps reduce frizz, and if her hair is curly, to keep it in defined curls.\n\nDo some research on natural curly hair care.  Many people with straighter hair also find these techniques work well.\n\nIf you don't know why someone is doing something, ask.  Or just let them do what they want.  Don't mess up their routine just because you don't understand it.",
      "id": 77,
      "comments": [
        {
          "score": 22560,
          "content": "Or just let your girlfriend have a damn towel, geez louise",
          "id": 78,
          "comments": [
            {
              "score": 12891,
              "content": "Seriously. A towel. Keep your micromanaging hands to yourself. Do you honestly believe that your family would look down on her for a TOWEL?",
              "id": 79,
              "comments": [
                {
                  "score": 4861,
                  "content": "If so then she’s smart to stay away.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 1853,
                      "content": "Hope she ditch him",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1049,
                  "content": "How would they even know she brought it? Like she’s gonna get out the shower and get ready near anyone besides op? And even if they did, I don’t think most people would question anyone else’s toiletries if they’re just, like, soap/shampoo/razor or a towel. Also very weird that he took it out secretly as if to trick her into admitting she didn’t ‘need’ it or something.  After saying how low maintenance she is with her hair wtf does he care about a towel. I think they are a writer trying to get responses for how this would play out in a screenplay or book. I kind of hope that at least.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 275,
                      "content": "Honestly if I was hosting her and noted lovely hair with minimal effort, I'd ask what her secret is.  I have very dense but fine hair, it never stays in a hairband, always slips out.  Really annoying and takes forever to blow dry properly.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "In another comment he said it would be obvious she brought her own towel as it wouldn't match his mommy's",
                      "id": 84,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "OP confirmed she's biracial.  \n\nHis friends are also mostly white.  He was worried they'd make funnof her for her towel.  \n\nTranslated - his family is racist and makes fun of anything not strictly white-centric.",
                  "id": 85,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "If it was my family:\n\nMe (a single guy): You know we had no problem with her using our towels right?\n\nBrother's GF: Yea but this is better for my hair \n\nMe: Oh, ok.\n\nAnd then given it absolutely no thought after that, possibly asked what makes that towel better for hair but that's it.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "And how would his family even know? Are they going to watch her get ready after she showers? He's an ass, and he thinks if he doesn't understand something it doesn't have merit.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4679,
              "content": "This isn't just about a towel. OP did not listen to her. He didn't respect that she knows how to care for her own hair. He went behind her back to ensure she had no choice but to follow his uninformed idea he just pulled out of your ass.\n\nYTA, OP. What did you think would happen? That afterwards she'd say, \"Well gosh, clearly you clearly know far more about my own hair than I do! Clearly, my hair is beautiful and low maintenance out of sheer luck, and not because I know what I'm doing and the towel actually works! I was so silly to follow my established routine instead of immediately obeying your dipshit idea!\"\n\nI have curly hair, use a microfiber towel, and don't use many other products because of the towel. Here's some info for those who don't understand why it matters. https://www.naturallycurly.com/curlreading/curls/top-tips-for-using-a-microfiber-towel-on-curly-hair",
              "id": 88,
              "comments": [
                {
                  "score": 1760,
                  "content": "This actually isn't about the towel at all.  Sure, she needed it and preferred to use it specifically, but the real issue here is the complete lack of respect and consideration that was shown.  If my significant other removed ANYTHING that I had packed for myself, regardless of how magnanimous or thoughtful they thought they were being, I would flip my lid.  She is an adult who can take care of herself.  She knows what she needs.  She is not a child.  She is not YOUR child.  You treated her like one, thinking what you were doing was for the best.  That was demeaning and disrespectful.\n\nA word of advice; apologize like hell and think really hard about how you treat her from now on.  \n\nYTA",
                  "id": 89,
                  "comments": [
                    {
                      "score": 399,
                      "content": ">A word of advice; apologize like hell and think really hard about how you treat her from now on.\n\nIf OP were a 'thinking man', this would have never happened in the first place.\n\nI'd almost pay money to read any post made by the GF about her experiences during this trip.  I'm sure we'd get the full story from that post, and the fact she did not fight about this while on the trip was an act of self preservation until she could get back home to her car and safety of her familiar surroundings.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "And why was he going through her suitcase to see what she packed anyway?!  The only time I have ever removed something from my husbands bag is when he leaves his toiletry bag on the bathroom counter and I notice he has full size bottles of contact solution in his bag when we are going on a two day trip.  I take out the big bottle and swap in the travel size bottle (mostly because he forgets we have stuff in travel size). Also, If it weren’t sitting out on the counter I would never go digging around to see what he packed.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 589,
                  "content": "Oh YTA Why would anyone think it weird that you have a special towel for your hair? Grow up dude.\n\nEdit: I’d just like to say with age comes clarity. And being able to see mistakes like these come easily. So along with my stinging criticism I’d like to add some life lessons. \n\n1. Your s/o isn’t your child or a pet. They’re functioning people just like you and me, and you are never going to be in the right by treating them as if they’re stupid idiots that would die if it weren’t for you. You aren’t that important especially if you act as if. \n\n2. Respect boundaries and autonomy you did neither and that’s very controlling and very likely to make someone an ex s/o especially when it comes to their own body. You had no right. \n\n3. Learn from your mistakes and this is a learning moment and I hope you do learn and grow from this.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 549,
                  "content": "That reminds me of the guy who threw out all his girlfriends skin care products, because he didn't think she needed them because her skin was so good.  Why the F do you think her skin is so good dude???",
                  "id": 93,
                  "comments": [
                    {
                      "score": 229,
                      "content": "Or the guy who threw out all his gf's mason jars because it was weird she drank out of them. Or the guy who threw away all his wife's yarn, because... I actually can't remember why. Or the one where he corrected his gf when she said her curls were natural because she used products and stuff!",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 200,
                      "content": "OMG I remember that one! She had spent a bunch on stuff over the years too! I couldn't imagine starting from scratch for make-up or hair products.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "...I never saw that one. I would lose my shit if I came home and my skin care stuff was gone.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 123,
                  "content": "This!! She knows how to care for her own hair. Period.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I wonder how weird he'd think I am, plopping my hair in an old tee-shirt.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Same. And it's a t-shirt I use JUST for my hair, too. Nothing else.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "Totally unrelated but I didn't even know there were special towels for curly hair and this is going next on my list of things to buy!",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I have straight hair with just the tiniest bit of wave. However my hair is super thick. If I use a blow dryer, well, my hair will feel like a horse’s tail. If I use just any old towel, my hair gets rough and dried out looking. I, too, need to use a microfiber towel. And I am old enough to know what works for my hair. The OP is a huge AH and he deserves to be dumped just because he’s so controlling.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "So i hope I'm wrong but I'm actually terrified this could be a racial thing?  I.e. OP and his family are white and gf is a POC and he didn't want her making her \"non-white hair\" into \"a thing\" in front of his family. I mean, historically, white ppl have loved to police the hair of ppl of color...",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "This thread has convinced me to look into these magical towels.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I love how this thread backfired on the controlling, emotionally stunted scrote who wrote it, and has inspired a whole legion of women, myself included, to go buy our own special hair towels 😍 OP YTA",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 700,
              "content": "Right? And also this whole \"I was afraid they'd make fun of her\" BS. 1) how many people here pay special attention to the towels house guests use? Possibly logging the details in the family Towel Log for future humiliation purposes. 2) how many people would give a second thought to someone bringing their own towel for their hair? Seriously who would actually care??? 3) which of us are so insecure that we're feeling fragile about our SO's towel AND also so arrogant as to make unilateral decisions about our SO's personal care? Just OP?\n\nWhat a putz. YTA.",
              "id": 105,
              "comments": [
                {
                  "score": 212,
                  "content": "Exactly \n\nI use a couple of old cotton men’s shirts for my hair. There’s usually one hanging up in my bathroom. I only have one bathroom, so when guests come over, that’s the bathroom they use. I also take it with me when I’m travelling \n\nNo-one cares. Occasionally if I bring guys round they’ll ask (why is there a man’s business shirt in your bathroom?), which seems reasonable, but otherwise absolutely no-one cares. And it’s way weirder than a special towel.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 68,
                      "content": "Thank you for making me realize that I will, probably, start dating again and will probably have to explain to a future partner \"oh don't worry about my small stack of men's t-shirts in my bathrooms, they're my ex-boyfriend's but I exclusively use them to dry my curly hair.\"\n\nI, uh, might need to invest in a microfiber towel.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "1. Malignant narcissists absolutely do those kinds of things. Seriously.\n2. Malignant narcissists would take it as an insult, a coded message about her thinking she’s to good for their simple towels. \n3. OP and his family is probably narcisstistic, delusional and projective enough to percieve such an act as using a “special towel” as pure narcissism. OP states he’s even used her towel for other things. He simply can not stand the fact that the special item is not for him, because HE is the only special boy here!",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I totally lost it at “family Towel Log” lmao! I wish I had an award to give you.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 313,
              "content": "Yeah, Jesus. Like he is so obsessed with this towel. How weird.",
              "id": 110,
              "comments": [
                {
                  "score": 23,
                  "content": "IKR. He keeps saying how she's weird for having a hair towel but goes out of his way to take out the towel. Why tf does it bother him? Who was it hurting? I have certain specific toiletries I like using because of my specific hair and skin type. I'd be annoyed and feeling disrespected if someone removed those products and forced me to use something I didn't like or didn't suit just because they didn't see the need. It's not your place, and you're the one with the weird hang up OP, not your gf. YTA.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1690,
          "content": "YTA.\n\nIt doesn't matter even a little bit how much \"she needed that towel.\" She packed it. It's her business. If OP doesn't like it, OP should TALK TO HER, not sneak and try to make her do what they want.\n\nGF was right to be upset. This is controlling behavior regardless his reasons or hers. Had she packed an assault rifle to visit his family that was traumatized by a mass shooting, OP would still be T A for removing it from her bag without her knowledge. He would not be TA for setting a boundary and saying it has to go, but he doesn't get to just remove it secretly.\n\nOP took away her choice. OP must at least give her the option of not going or even breaking up over this towel, but instead OP decided she shouldn't have it.\n\nEdit: Silly me, thinking I could mention guns on the internet as part of a reasonable discussion. The whole point I was trying to make was to pose a situation where almost anyone would agree that taking some object is a bad idea. However bad that idea is, you can't just unilaterally make that decision for a partner. That's the point. Whether the object is legal or should be legal has nothing to do with it. If you want it gone, you talk to your partner about it.",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 851,
          "content": "Immediately I thought she’s probably doing the Curly Girl method and it’s a microfibre. Agree 100%.",
          "id": 113,
          "comments": [
            {
              "score": 288,
              "content": "Maybe, but like even if she has straight low-maintenance hair and it's a normal towel and she just likes having a designated hair towel for no strictly logical reason, does it make a difference? It isn't actually causing any problems, so why not let her have her quirks?",
              "id": 114,
              "comments": [
                {
                  "score": 41,
                  "content": "I almost feel the sub is giving OP the wrong message by how much emphasis is put on explaining the perfectly good reason she'd want that towel.\n\nYou don't override the decisions of another adult you respect. You shouldn't assume you know better than them about something that doesn't affect you.\n\nThat's the reason OP is the asshole",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "All my life I've had a big towel for my body and a smaller one for my hair. When ladies stay at my house I also give them two towels and they use the small one for their hair. \n\nI don't even consider it a quirk, where I'm from it's totally normal for people with long hair?",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "Definitely learned this myself from the curly sub. Hope she sees this and knows we support her.",
              "id": 117,
              "comments": [
                {
                  "score": 282,
                  "content": "3c curls here—100%. This reminds me of the satin pillowcase episode on This is Us. Kevin teased Zoe bc he assumed she needed to pack her satin pillowcase for a trip bc she’s fancy or high-maintenance. It was for her curly hair. My partner was like “oooh you fucked up dude”.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Yes!  Exactly what I thought of too!",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "OMG I love your partners response!",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 658,
          "content": "As a guy with long naturally healthy hair, I have 1 towel I use to dry my hair and I take with me when I travel because I like how it dries my hair... The way my hair dries dictates how it falls and looks the entire day. That's like saying a particular type of comb or brush is a ridiculous thing to have. Ridiculous. Just ridiculous.",
          "id": 121,
          "comments": [
            {
              "score": 140,
              "content": "I have three of these special towels so there is always at least one in the closet if I need it. I have thick hair, and hate to blow dry it, so towel drying is the next best thing. OP sounds immature and as a result, has created a rift over a towel. That seems weird to me, not needing a special towel to dry your hair.",
              "id": 122,
              "comments": [
                {
                  "score": 180,
                  "content": "I have 2 microfiber turbans I use. My husband knows not to touch unless he's doing the laundry and then he knows to not use fabric softener. My husband is bald. He actually cares about me and takes an interest in what I do for my hair because it makes me happy and HE doesn't want to mess it up. OP is probably going to be an ex soon.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 423,
          "content": "Curly hair here, instantly knew it was a microfiber towel in the first couple paragraphs. Other towels can do damage or dry it out loads; OP is a dumbass who doesn't know what he's talking about. Even if it was ridiculous, why fuck with someone else's packing? Weird behaviour. YTA",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 400,
          "content": "FYI OP, having a towel designated for hair only is actually very very normal.",
          "id": 125,
          "comments": [
            {
              "score": 34,
              "content": "I try to keep designated hair towels because I have brightly colored hair and don’t want to ruin every towel we own. It’s really not a big deal, OP is acting controlling",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "So much this! Those weirdly lengthed towels that aren’t large enough for a school-aged child but too large to be a hand towel? Those are for hair.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 356,
          "content": "why do I have the feeling OP's gf probably explained the actual practical reason for her hair towel and he just never listened",
          "id": 128,
          "comments": [
            {
              "score": 41,
              "content": "Because like all clueless dudes, if it's not something THEY have experience with it doesn't exist. So she could have given him a dissertation, with a slide show and props and he'd still be thinking 'But I/my mom/my ex don't do this thing, so you're weird for doing it and anything you say is irrelevant' although, I think him using 'irrelevant' might be giving too much credit....",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I am doing for OP's GF to find this post and lay out the times he didn't listen AND how this is the cherry on his foolishness sundae.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 348,
          "content": "He doesn’t have to do research into hair care!  The point is that GF has a personal care item that she likes to use and makes sure she has on hand. She isn’t asking OP to touch the towel, buy it for her, launder it (as far as we know) or interact with it in any way. And it doesn’t take up much space! Why on earth does this matter to OP? Why is this a big deal to him that he would deliberately create a situation where she doesn’t have her preferred personal care items? OP just sounds like an idiot and a malicious one at that. This is a stupid hill to die on. YTA big time, and bonus points for being such a big one that you had to ask.",
          "id": 131,
          "comments": [
            {
              "score": 35,
              "content": "Yeah, she didn't try to pack an emotional support camel or something ... it's a fucking towel. How controlling and micromanaging must be be if he can't leave a towel that he knows is important to her alone? He doesn't have to understand the towel, he just had to respect the fact that his gf gets to decide how to dry her own hair. \n\nOP, YTA big time.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 235,
          "content": "Yeah, I was wondering if maybe she was black. I got my bestie a satin pillowcase for her birthday one year because black hair needs that extra love, you know?",
          "id": 133,
          "comments": [
            {
              "score": 377,
              "content": "I'm going to interrupt this thread with a genuine question: satin pillowcases are good for Black hair? I'm a foster parent who may have placements of any race, and as a white woman, I'm always looking out for ways to make my home more welcoming to non-white kids. Special pillowcases (besides soft ones) never occured to me. I'll add a set of satin sheets & cases to my wish list right away!",
              "id": 134,
              "comments": [
                {
                  "score": 231,
                  "content": "They help keep the breakage and frizz under control! Super good for all hair, but African American coils need extra love.\n\n\nEDIT: !!DISCLAIMER!! \n\nI am not African American, I just spend a buttload of time on r/curlygirl and r/wavy",
                  "id": 135,
                  "comments": [
                    {
                      "score": 60,
                      "content": "Thanks!! I really appreciate it.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "You are a very lovely person. These things could be the only self care type items the young ladies have experienced. If you can share your wish list mentioned, I’d like to donate a few of these things. Cheers",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 186,
                  "content": "Yeah, the hair is really fragile (hence why black women wrap their hair for sleeping), and she told me that satin is great because her hair doesn’t get caught and broken in the weave like it would with a cotton pillowcase. Note that I’m a white chick with, like, apocalypse-proof hair, but if my bestie makes enthusiastic noises about satin for her hair, I’m taking notes.   \nAnd you sound like a GREAT foster mom. Go you! And along with the pillowcases, keep some coconut oil/lotion or similar for hair and skin (the Body Shop has some nice stuff that I’ve gotten her as presents also) and scarves for wrapping their hair.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 44,
                      "content": "If your bestie doesn't have one, there are a couple of black owned business that sell winter hats with satin linings. My relatives loved them!",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Yeah they cause far less breakage and tangling. I’m white and noticed a huge difference when I switched to satin pillowcases.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Sheets are unnecessary. It's the pillowcase that matters. And satin =/= silk. Silk is a fiber, satin is a weave. Synthetic satin pillowcases can still be used for haircare, and are easier to wash, but aren't going to have the same affect as real silk (which is probably too $$). So if you go synthetic, at least make sure it's good synthetic specifically aimed at hair maintenance.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "That’s awesome you are even thinking about this! Maybe add satin lined bonnets, edge control, and a good shampoo, conditioner, leave-in made for black hair to keep in the cabinet.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "Even if it isn’t a special towel or micro fibre, she expressed she wanted it and needed it, OP had no right to take it out and not tell her about it, girlfriend has every right to be mad",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 20569,
      "content": "YTA,you said it didn't bother you and yet it does,why are you embarrassed of her using a towel??grow up dude🤦‍♂️",
      "id": 144,
      "comments": [
        {
          "score": 2901,
          "content": ">grow up dude",
          "id": 145,
          "comments": [
            {
              "score": 2757,
              "content": "He's 31... Not looking good.",
              "id": 146,
              "comments": [
                {
                  "score": 2573,
                  "content": "I swear like 90% of AITA features creepy, controlling dudes dating women who are way younger yet way more mature than them.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 915,
                      "content": "Coz the creepy controlling dudes can't get any their age.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 818,
          "content": "This is Seinfeld-level pettiness, like what the fu-",
          "id": 149,
          "comments": [
            {
              "score": 826,
              "content": "She uses a SPECIAL TOWEL, JERRY!\n\nSo what?\n\nSo what?! Why is it just for her hair? What's the importance of it? Why can't I use it?\n\nJust let her use the towel!\n\nI can't, Jerry. The towel needs to go!\n\nEdit: Thanks guys. I could just see this exchange between Jerry and George!",
              "id": 150,
              "comments": [
                {
                  "score": 121,
                  "content": "I heard this.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I heard this play out too 🤪",
                      "id": 152,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 63,
                  "content": "Omg. I heard George loud and clear as I read this!",
                  "id": 153,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I came to comment the same 🤣🤣",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Exactly xD",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "This is one of the best posts I’ve ever seen on Reddit",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 679,
          "content": "Imagine worrying about your girlfriend embarrassing you over a towel?\n\nI wouldn’t even think twice about it.  \n\nA good boyfriend would actually check before you leave the house to MAKE SURE she HAS the towel.   This asshole did the opposite.  \n\nWhat a douche.  Grow up",
          "id": 157,
          "comments": [
            {
              "score": 90,
              "content": "This is why she left. This wasn’t the first instance but it was symbolic of a pattern and this was her wake up call. If she’s wise, she’ll move on.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I sleep with a hair scarf and my bf 100% makes sure I have it before I go to bed even on nights where I'm too tired and lazy to get it myself.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "But also…. One has to SERIOUSLY question it when OP is saying his parents will judge her for the TOWEL she uses. Uhm, sir I’m sorry, do your parents walk into the bathroom when people are in it? Either your parents are creeps who invade privacy or this is such a non-issue.",
          "id": 160,
          "comments": [
            {
              "score": 23,
              "content": "I don’t think he genuinely believed that but made it up as an excuse in retrospect…? Idk YTA no doubt.\n\nI feel like he saw her hair routine as a level of self care that’s foreign & threatening to him, so he lashed out.\n\n- She’s low maintenance\n\n- But she’s nailing her routine right now\n\n- But she’s 6 years younger than me & supposed to be low maintenance!\n\n“I usually don’t mind it” why you gotta mind it in the first place mind your business",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "Grow up is right. I had to go look at the ages again because I thought for sure he was like 19 *at most.*",
          "id": 162,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "I thought the same thing, really weird that he’s so embarrassed of her towel for her hair he got up after she had fallen asleep to remove it. Don’t think OP is embarrassed of the towel. Think he’s embarrassed of the GF.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I was about to say. Clearly this *does* bother him if he went to the trouble of actually finding it in her suitcase, unpacking it, and likely hiding it so she wouldn't know it was missing from her things until after they got to his parents' place.\n\nSpeaking of, OP, there is no doubt that YTA here.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I think, in truth, he doesn't understand anything about feminine beauty or self care regimens and finds what he doesn't understand to be potentially embarrassing because he assumes that his family will also not understand.  He has made the very normal mistake of assuming that he is normal and that the majority of the world acts like him and knows just what he knows.  \n\nAdvice, never assume that you are normal.  Assume that people will act differently than you would.\n\nOP YTA",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15491,
      "content": "YTA. First of all, it's really not that unusual for a woman to have a hair-drying towel. Regular towels are heavy and can be rough, and using them to dry hair can cause the strands of hair to break. If you have long hair and want to keep it healthy, using a smaller microfiber or cotton towel makes a big difference! I'm sure the women in your family have at least heard of this and wouldn't find it odd.\n\nBut even it if was a super weird thing, like a plush octopus that she feels the need to take with her wherever she goes, or whatever, it would have been shitty of you to take it out of the suitcase without telling her. That's just not an appropriate way to behave in a relationship.",
      "id": 166,
      "comments": [
        {
          "score": 3304,
          "content": "Now I want a plush octopus to carry around.",
          "id": 167,
          "comments": [
            {
              "score": 1041,
              "content": "I have a stuffy I travel with, because it hurts my wrist for some reason if my arm lays flat on the bed. He ticks under my arm and is cuter than a pillow.",
              "id": 168,
              "comments": [
                {
                  "score": 679,
                  "content": "I used to use stuffies to wrap my arms around while I sleep on trips, but now I just bring my pillow for that.\n\n...But I still bring travel stuffies because, IDK, sometimes you just need that little piece of home with a cute smile, y'know? The one time I didn't bring a stuffed animal on a trip, I had a terrible day, and had to go buy one because I needed something nice to hug. I'm nearly thirty but I've done this since I was a kid and am not giving it up (though I no longer pack them their own suitcases).",
                  "id": 169,
                  "comments": [
                    {
                      "score": 202,
                      "content": "I’m nearly 28 and I definitely still have stuffies I sleep with. It’s half comfort, half practical. I’m a side sleeper and as soon as I hit puberty I realize it made my boobs hurt unless I was hugging a pillow or stuffed animal. And all my current rotation of animals are gifts from my partner so obviously he doesn’t have an issue with it",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": ">(though I no longer pack them their own suitcases).\n\nBut what if they have a bad day and need to bring *their* stuffie?",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "I still sleep with one (39) and I drag it everywhere (over night stays). I sometimes have night terrors and hugging something just makes me feel better. I had to stay over at a friend's house before we left together for a vacation. I forgot my plushie, had a night terror and was really upset. I had to quickly drive back to my house, grab it and take it with me. If anyone touched my plushie I would be pissed.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "One of my teachers had a little penguin that travelled with her and her husband. They would take his picture at all the landmarks.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 190,
              "content": "I have a plush octopus, his name is Bob. He travels with me everywhere",
              "id": 174,
              "comments": [
                {
                  "score": 19,
                  "content": "Give Bob eight high-fives for me!",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Mine is named Jaspy! 🐙",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "Might I suggest a jellycat octopus. It is my dream plush octopus.",
              "id": 177,
              "comments": [
                {
                  "score": 20,
                  "content": "Jellycat makes the BEST stuffed animals. I don't have the octopus yet! I get infusions for my bone disorder every 4 months and my husband buys me a stuffed animal before each one, I'll have to hint to that one next time! He usually gets me obscure animals. Which is the greatest thing ever. He just got me a vulture, once he gave me 2 (an anteater and an ant!), I got a buffalo once, a pangolin, the list goes on. 😊",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 637,
          "content": "I brought a microfiber towel AND wore a t-shirt on my head at my husband's dad's house over the holiday to dry my hair and keep my curls nicer. You know what my husband did? Kissed me, giggled because I wasn't using my regular hair drying shirt and had to use a pony tail so I looked like a unicorn, and told me I looked cute. Then went on with what he was doing.",
          "id": 179,
          "comments": [
            {
              "score": 45,
              "content": "This made me smile. ♥️ \nI have 3C curls and I want this one day.",
              "id": 180,
              "comments": [
                {
                  "score": 41,
                  "content": "He's a wonderful man. He thinks it's a little silly (I just started doing it), but says \"whatever makes you happy and you're hair healthier!\"  I have 2C/3A hair and I've been trying to get the curls to stay better, instead of it going to a frizzy poof within 24 hours.. literally Hermione in the first movie is what my hair ends up looking like (and he still thinks I'm beautiful).",
                  "id": 181,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Haha aww. I’ve definitely been insecure about my hair in relationships before and the methods I have to use to have nice hair. (Specifically overnight or on wash days.) But you just made me realize there are men who aren’t going to judge me for it and might even find it cute and that made my day! 🤍 I’m never going to sacrifice my hair for a guy again so I don’t feel embarrassed. I hope your new methods work!",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yeah, this is how to support a partner. Rather than being worried about what other people are gonna think as “weird” you act like it’s perfectly normal —cuz it is for the two of you, it hurts nobody, and everyone else can just get in line about it. Own it. Don’t make it weird, man. You’re the only one makin it weird. \n\nLet your girlfriend have her damn ~~stuffed octopus~~ hair towel and stand up for her about it by pretending (until you fully work through that insecurity and can just fully embrace that) it ain’t no thang. \n\nSo: Apologize and promise to support rather than shame her. \n\nYTA",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 226,
          "content": "I bought my niece a plush octopus and she takes its everywhere.  I wish I was joking!!! Your comment just made it the perfect time to share this.  \n\nAlso, my family is known to be full of weird people.  I mean, personally I would take my hair towel too.  I have taken it to my bfs house.",
          "id": 184,
          "comments": [
            {
              "score": 101,
              "content": "Lol, that reminds me of going to the zoo with some family friends and their toddler daughter. We went to buy a stuffed animal and her parents were showing her all the cute teddy bears and tiger cubs, and what does she want? The $90 hyper realistic California Condor. They let her hold it for a second and she SCREAMED when they tried to take it away so guess who went home with an expensive condor. I don't think she took it everywhere after that, but she did dance with it in the parking lot.\n\nI had a lot of respect for that kid after that (and I still do, she's grown into an awesome person).",
              "id": 185,
              "comments": [
                {
                  "score": 45,
                  "content": "[deleted]",
                  "id": 186,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "When we took my son to the zoo for the first time, of all the stuffed animals in the gift shop, he decided he needed the crocodile. It’s name is “Om Nom” and it eats bad dreams (and my arm on occasion).",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "My oldest did something like this with a hyper realistic sea snail plushie at the zoo. My ex was desperately trying to get her to focus on the red panda plush, but she had her heart set on that snail. If they could have put goo in it she probably would've lost her damn mind lol. Kids are awesome like that sometimes.",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "My niece wanted the $40 stuffed snake. Guess what she got for her birthday",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "> like a plush octopus that she feels the need to take with her wherever she goes,\n\nI have a multicoloured plush octopus who comes with me everywhere (like when I go away, not to work or anything).",
          "id": 190,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 69,
          "content": "I literally have one myself. This guy is a grade a moron.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Agreed. I have a hair drying towel myself for this reason. Really helps me cut back on the friz.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11587,
      "content": "Why would your family see her after a shower? Do you all shower together? Who cares if she has a hair towel? \n\nYTA because you decided you knew better and took her property out of her suitcase. She was mature enough not to freak out during the trip. You should do a full on Say Anything to apologize.",
      "id": 193,
      "comments": [
        {
          "score": 5224,
          "content": "[deleted]",
          "id": 194,
          "comments": [
            {
              "score": 1297,
              "content": "That's why she drove away, to gather her thoughts.  She will probably come to this exact conclusion.  Any sane person would.",
              "id": 195,
              "comments": [
                {
                  "score": 269,
                  "content": "I love that the gf did not address it during the vacation but it clearly was not ok with her. Rooting for her to continue that path of mature common sense and keep going and never look back.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 65,
                      "content": "Yes, that's Grace under fire.  She mad as hell, but you can't tell. That, OP, is maturity.  Take notes.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Not just that. But she’s a boss for not saying anything during the trip. What self control!",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 151,
              "content": "yeah, the towel is definitely Iranian yogurt",
              "id": 199,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 41,
              "content": "I really hope she doesn't go back to him, he crossed a line.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "DING DING DING!!  This is it OP.\n\nFix this and LEARN FROM IT or she seems like she has her head on her shoulders enough to realize you're not going to learn.  You dropped a lot of red flags here.\n\nEasy to recover from if you apologize and show that you understand how shite you were.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 820,
          "content": "And he really thought his family....might make fun of her because of the towel?    \nA) They wouldn't have  \nB) If they are some kind of freakish assholes that would tease her, it's ok...because he'd be there to have her back. Right, op? RIGHT?  \nYta",
          "id": 202,
          "comments": [
            {
              "score": 193,
              "content": "If he was worried his family would make fun of her for having an incredibly simple hair routine then he needs to reexamine the type of people he is related to. And also reexamine himself.\n\nYTA",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Idk how you'd bully someone about this even",
              "id": 204,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "Even if they saw a towel on her head, it’s such a mundane thing - would it even register in their minds that she brought it from home? They’ll probably just casually glance at it and forget about it, going about their own work.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "We visited my father-in-law and sister-in-law months back. I left my hair towel in the bathroom to let it dry when we went there. That could have been a possible scenario he was worried about.  I brought mine specifically because I had just dyed my hair and didn't want to ruin any of their towels. But it also made me realize that microfiber towels are the shit. I'll always have one with me when traveling from now on.\n\nBack off OP. These bitches are magical.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6217,
      "content": "YTA - You don’t know anyone who has a towel for their hair? Really?\n\nIt’s… it’s really not unusual.\n\nIf your family make fun of her because of that then they’re the weirdos, TBH.",
      "id": 207,
      "comments": [
        {
          "score": 1884,
          "content": "I’m just confused about how OPs family would know about the towel - are they unpacking the luggage for her? It’s a towel, how would anyone notice? I would have just assumed she was trying to be a thoughtful guest  bringing her own work - I mean that’s what I’d think of I somehow discovered the towel…\n\nYTa",
          "id": 208,
          "comments": [
            {
              "score": 456,
              "content": "I am imagining a weird suitcase-based ritual of some sort.",
              "id": 209,
              "comments": [
                {
                  "score": 309,
                  "content": "Me too. Like everyone who comes in their home has to unpack their luggage in front of them and explain what each thing is for and why they brought it.",
                  "id": 210,
                  "comments": [
                    {
                      "score": 196,
                      "content": "I wonder what else they think is weird?\n\n“OMG - Why did you bring shampoo AND shower gel?! Oooh, we’ve got a live one here! What are you like?” Etc etc",
                      "id": 211,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Join us now for the unpacking of the suitcases. We have arranged a special area in the living room for the momentous occasion.",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "I’m thinking she might walk around at home in her clothes with the towel in her hair- my sister does this in a tshirt… but like dude- is that the hill you really felt the need to die on? Amd so what? She’s getting ready. Her hair will look nice.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "Ooh look at this bitch bringing her own towel! Who does she think she is?! WTF? Why on earth would they care about a stupid towel?! IF they even see it!",
              "id": 214,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 355,
          "content": "Lmao I don’t know a single woman who doesn’t have a towel for their hair…but I will admit most of the women I know have thick curly hair.",
          "id": 215,
          "comments": [
            {
              "score": 292,
              "content": "I have dead straight, fine hair and I have a hair towel.",
              "id": 216,
              "comments": [
                {
                  "score": 195,
                  "content": "Every women I know uses one of these towels. And a hair towel takes up a hell of a lot less space than a blow dryer, straightener, heat protection sprays, and styling gels. Op needs to let her use the damn towel. Going into her packed bag was also incredibly intrusive.",
                  "id": 217,
                  "comments": [
                    {
                      "score": 146,
                      "content": "tbh this entire comment section has me thinking I need a hair towel!  am I missing out?",
                      "id": 218,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Hopefully OP sees your comment and realizes hair towels are commonly used for all hair types",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "They stop your hair from being damaged. It doesn’t matter what type of hair you have. It’s a everyone thing, not a curly hair thing.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "Exactly. I have several twist-bun microfibre towels for my hair, won’t use anything else. My hair is down to my waist, and blow drying or just plain air drying would be extremely time consuming.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4343,
      "content": "Yeah, YTA. Hair can be damaged by terry cloth which is what towels are usually made out of. She probably had a microfiber or silk wrap. Why is this such a big deal to you that she uses a different kind of towel for her hair?? your family is not gonna care, lol, would they even see her use it?? in most cases using a hair drying towel is something that happens in the bathroom or in the bedroom before changing.  \n\nyou took it out in the dead of night, secretly, because you knew that she wouldn’t like it and you didn’t stop to think that that was an asshole move. \n\nPro tip if you have to do something in secrecy because you know it’ll hurt or annoy the person you’re doing it to—you’re being an asshole and it’s a bad idea\n\nOmg my first reddit silver 🥺",
      "id": 222,
      "comments": [
        {
          "score": 1310,
          "content": "He's so hung up on this towel when he also seems to think it's the only part of her hair care routine. If it's the one thing she insists on doing for her hair, leave the poor woman alone! From the title I thought they'd be like, sharing a bag and all her hair products took up so much space he couldn't bring things he needed.",
          "id": 223,
          "comments": [
            {
              "score": 144,
              "content": "I thought so too, and even then they'd still be an asshole for not having a conversation about it",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "I’m totally behind this.  Why aren’t more people calling him out for the trickery as well?  He intentionally did it when she was asleep. \n\nTotal asshole.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Edit: After reading OP's comments, it was revealed that his GF is biracial. He is horribly ignorant and his comments about his family possibly being judgemental now have racial undertones that are gross. I am a black woman and regular towels can be very damaging to our hair. Obviously, you nor your non black friends care nor are you willing to take a moment to comprehend why what you did was wrong. End edit.\n\nI love how OP calls his GF \"weird\", but he is the one sneaking into someone's suitcase to steal a towel. Proper obsessive and **\"weird\"** behaviour if you ask me.\n\nOP made this into an issue. I agree that his family wouldnt have cared or noticed. BUT, if his adult family members would make fun of someone's SO because they use a hair drying towel, then they are horribly immature, rude, tactless, and bullies.\n\nHis GF sounds way too mature for him. She didnt ruin his weekend with his family, and waited until the trip was over to quietly tell OP that she needed to rethink the relationship because of his oddly controlling & immature behaviour.... Now he is running to tell his friends that she is being a big ole meanie....",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This is it. He knew he was being shady because he did it while she was asleep and waited for a reaction the whole time they were there but she \"seemed fine.\" \n\nShe's not being irrational. I'd be so angry if someone took items out of my case instead of talking the to me about it. Such an immature approach to just remove it.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4008,
      "content": "You are an AH and you know it.  Otherwise you wouldn't have waited till the dead of night to unpack something that your girlfriend had specifically packed because..... You're so desperate for mommy and daddy's approval I guess. You owe her an apology and she probably shouldn't trust you again.\nYTA",
      "id": 228,
      "comments": [
        {
          "score": 764,
          "content": "Yeah, that is so strange. What else is he going to decide that he knows best about and go behind her back? Start of a nasty pattern, i think.",
          "id": 229,
          "comments": [
            {
              "score": 97,
              "content": "Yes, so controlling!",
              "id": 230,
              "comments": [
                {
                  "score": 72,
                  "content": "I hope she stays gone.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 473,
          "content": "Towel is irrelevant. It could have been a keychain, a pair of slippers, etc. He's undermining her basic autonomy as a human being. No one should ever do that.",
          "id": 232,
          "comments": [
            {
              "score": 100,
              "content": "My wife won't stay overnight anywhere unless she has her own pillow. I asked her why once. \"Because if the pillow isn't comfortable I don't sleep well, and I have no way if knowing if somebody else's pillow will be comfortable.\"\n\nWe now both take our own pillows if we're staying overnight somewhere.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3584,
      "content": "YTA. Your girlfriend is super chill so she didn't bring it up and ruin the whole weekend. However she knows a red flag when she sees one, and her peacing out, asking for space, and then not texting you back is her way of letting you know she's about to dump you.",
      "id": 234,
      "comments": [
        {
          "score": 2261,
          "content": "She is the coolest girl in the world. She let the weekend go by, then iced the guy who can’t be trusted not to go through her suitcase and pilfer her things. I hope she’ll be very happy with her next bf.",
          "id": 235,
          "comments": [
            {
              "score": 1300,
              "content": "Exactly. She was probably like \"well, no reason to let all this stuffing, sweet potatoes, and pie go to waste. I'll dump him when we get home.\"",
              "id": 236,
              "comments": [
                {
                  "score": 206,
                  "content": "I laughed AUDIBLY at your dialogue when I enacted it in my head! Haha",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "100% didn’t want drama as a side for Thanksgiving. Smart Lady.",
                  "id": 238,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "I will subscribe to her YT channel about haircare.",
              "id": 239,
              "comments": [
                {
                  "score": 48,
                  "content": "And recommend it for anyone who needs dating advice.",
                  "id": 240,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "We’re all rooting for OP’s girlfriend",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This girl is my hero and I need someone like her in my friend circle, tbh. I want to be like her when I grow up (and I'm in my thirties)",
              "id": 242,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Exactly this. YTA",
          "id": 243,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "She doesn't. She put up with two years of his constant towel negging. Thank God she saw the sense here.",
          "id": 244,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2610,
      "content": "INFO: what is wrong with you?",
      "id": 245,
      "comments": [
        {
          "score": 1218,
          "content": "Why on earth would you ask that of a guy who was 29 when he started dating a 23 y/o woman? A guy who is apparently so terrified of his family full of bullies that he has to sneak his (hopefully ex) GF's towel out of her suitcase, in the middle of the night like some reverse drug mule, and then **legitimately believes** she didn't notice/doesn't care because she didn't say anything while at his family's house?\n\nWhat could possibly make you think OP isn't a mature, insightful, self-aware, well-balanced, emotionally intelligent individual?  As opposed to something that would make even Oscar the Grouch would turn up his nose?\n\n/s - in case that's necessary.\n\nEdited some grammar/punctuation because it was making me angry.",
          "id": 246,
          "comments": [
            {
              "score": 194,
              "content": "[deleted]",
              "id": 247,
              "comments": [
                {
                  "score": 71,
                  "content": "Let’s just breathe a sigh of relief it wasn’t that time of the month. OP would have removed a cup and tampons and maybe shinx.",
                  "id": 248,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I thoroughly **CANNOT**... no, nope, no way. I won't even think about it because I hate accepting that people can be that horrid. \n\nOP's out here making Dolores Umbridge look sympathetic.",
                      "id": 249,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "[deleted]",
                      "id": 250,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "I’m dead 😂",
              "id": 251,
              "comments": [
                {
                  "score": 14,
                  "content": "If you find OP's relationship in the afterlife, give it a good swift kick **towards** the light.",
                  "id": 252,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 208,
          "content": "Seriously, what's with men being so embarassed by the stupidest things? Like the husband who got upset with his wife for taking home leftovers from a restaurant? Some of these dudes seriously need to get some hobbies if such silly things make them this upset.",
          "id": 253,
          "comments": [
            {
              "score": 41,
              "content": "insecurity",
              "id": 254,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "I haven't seen that one and need to look for it now - my ex boyfriend was always so embarrassed when I took leftovers home, he once offered me money for leaving half a pizza in a restaurant instead of taking it with me!",
              "id": 255,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 175,
          "content": "Lmaooooo",
          "id": 256,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "This is excellent use of \"info\" lol!",
          "id": 257,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "INFO: how dare you?",
          "id": 258,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}