{
  "post content": "Hi this is my first time posting here and I'm on mobile so excuse any typos. So the other night I was with my mom watching pirates of the caribbean on a rainy night. When it rains hard it floods our backyard so after watching the movie we got up to look at how flooded the yard was. My mom then fainted and fell on the ground and we weren't sure if she hit her head (it was just me and her in the house). So I called the ambulance and she was took to the hospital. I was pretty shook up at this point and I wanted to talk to somone so I texted my freind and told her what happened. All she said back to my text was \"shit\" and didn't respond for 15 min. At that point I had gotten pretty worked up because our freind ship is bassicaly just me helping her threw her problems while she does nothing at all to help me. So I ended up going off on her and told her it was fucked up that I told her my mom fainted and hit her head and she  asked absolutely no questions. And her only excuse was she was with her bf. I think I'm overreacting and I shouldn't depend on other people to support me at all but am I the ass hole. And yea my mom's fine.",
  "id": 1,
  "comments": [
    {
      "score": 15,
      "content": "NAH. Sometimes people aren't able to drop everything for you. And really, what did you want her to say? To me \"shit\" pretty much sums that up.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "[deleted]",
      "id": 3,
      "comments": [
        {
          "score": 2,
          "content": "Yea. I'll edit that in lol.",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi this is my first time posting here and I'm on mobile so excuse any typos. So the other night I was with my mom watching pirates of the caribbean on a rainy night. When it rains hard it floods our backyard so after watching the movie we got up to look at how flooded the yard was. My mom then fainted and fell on the ground and we weren't sure if she hit her head (it was just me and her in the house). So I called the ambulance and she was took to the hospital. I was pretty shook up at this point and I wanted to talk to somone so I texted my freind and told her what happened. All she said back to my text was \"shit\" and didn't respond for 15 min. At that point I had gotten pretty worked up because our freind ship is bassicaly just me helping her threw her problems while she does nothing at all to help me. So I ended up going off on her and told her it was fucked up that I told her my mom fainted and hit her head and she  asked absolutely no questions. And her only excuse was she was with her bf. I think I'm overreacting and I shouldn't depend on other people to support me at all but am I the ass hole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    }
  ]
}