{
  "post content": "My partner (M27) and I (F31) finally got married after years together. \n\nIt was supposed to be this huge amazing expensive wedding but then COVID hit. Sucks but we got most of our deposits back and refocused what we wanted. \n\nWe ended up having a small wedding of only the most important people (less than 50) which actually went really well. It was lovely. Until the cake cutting. \n\nMy husband’s 4-year-old daughter from a previous relationship had cut the cake. My husband’s mother had encouraged her/allowed it. They tried to cover it up with decoration but I could tell and I was upset. I held it together for a while, but after a couple of drinks I yelled at my mother-in-law, then my husband, and then unfortunately the child. \n\nTo be fair to her, the girl had helped choose the cake and so she wanted to try it before it got too late (because she’d fall asleep apparently). \n\nAITA?\n\nEDIT: Everyones saying I’m TA but shouldn’t they be teaching the kid some manners? Who cuts someone else’s wedding cake first?\n\nEDIT: I defy all of you to have a four year old for several days an not yell at them. I love this girl, but really. Come on, Reddit.",
  "id": 1,
  "comments": [
    {
      "score": 1817,
      "content": "ESH except the 4-year-old. Your husband is an asshole for handing his kid off to a craptastic adult who wanted to pull a dirty stunt and blame it on a child. Obviously your MIL is hugely an asshole too. Your husband is also questionable for having his mother there at all, since with something like this, there is no way this is her first infraction.\n\nYou're an asshole for yelling at a 4-year-old when you know perfectly well your husband's choice not to keep a leash on his mother is the problem.\n\nSeriously, how the hell is the kid supposed to feel about you now when you yelled at her like that for something her Grandma told her to do? How do you see that making your relationship with her work? The kid is the victim of choices made by adults here. You had no business yelling at her. But you sure played into MIL's game, because now she gets to distract people by flouncing around posturing about how you acted every time someone points out that this was obviously a deliberate dirty and mean stunt on her part.",
      "id": 2,
      "comments": [
        {
          "score": 722,
          "content": "You are actually right that this isn’t grandmother’s first infraction. I’m not going to list everything she’s done but just to give an idea - she refused to attend the wedding at all unless she was able to make a speech about her son. I vetted the speech and it was incredibly long winded, inappropriate, and made favourable references/risqué jokes involving his ex partner.",
          "id": 3,
          "comments": [
            {
              "score": 566,
              "content": "Okay, that informs the situation a bit. Your husband is a complete asshole. So much that you should have postponed the wedding indefinitely until he got himself sorted out so that he's not pushing Creepy Mommy on you or his daughter.\n\nLetting her choose not to attend the wedding was the perfect out here. He should have been man enough to jump on it and protect his family from her.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 415,
              "content": "I'm probably in the minority here...you weren't ready to get married.   You have a major MIL problem that you've kicked down the road and allowed it to corrode your relationship with both your husband and your step-daughter.  She held you hostage regarding the wedding?   Fine, you should have let her sit home.  If you did deeply enough, you will probably find that his mother played a role in the dissolution of his previous relationship.\n\nStop dwelling on this wedding cake fiasco and deal with the toxic MIL    The reading list in r/JustNoMil can help you there.   Personally, it sounds like your now husband needs to read *Toxic Parents* and get out from under the FOG he's accepted with his mother.\n\n>To be fair to her,\n\nThe appropriate action in that case would have been to have saved a piece for her to have in a special meal with the two of you the next day.    But none of this was about the child, it was about your MIL and that's what you should deal with.",
              "id": 5,
              "comments": [
                {
                  "score": 11,
                  "content": "Additionally she ought not to be the step mother of this little girl since she can’t be trusted not to loose her head with her. This marriage was a huge mistake.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -29,
                  "content": "[removed]",
                  "id": 7,
                  "comments": [
                    {
                      "score": 36,
                      "content": "No, my advice is for the OP to do what she should have done before the wedding and get her MIL in line.   That will probably take some serious couples counseling for her husband to understand how he's enabled his mother's unacceptable behavior.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -15,
                      "content": "I'm on board for the first part but definitely not the second",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "AITA? - yes, yes you are.\n\nYTA\n\n>Who cuts someone else’s wedding cake first?\n\nApparently, a four year old, who is also the daughter of the groom, who also had permission from an adult to do so.\n\n>Everyones saying I’m TA but shouldn’t they be teaching the kid some manners?\n\nYes, \"they\" should be - presumably her father and her grandmother, as her new stepmother apparently believes teaching children manners happens by magic or by yelling at them.\n\nYou know, people often say it's the small imperfections that actually personalize things and give them true memorability. Bow ties are not meant to look perfect when hand tied - it makes them look like they are pre-tied clip ons that lack character - it's the imperfection that makes hand tied bow ties special.\n\nYou had a choice to embrace that small imperfection as an opportunity for a truly unique moment with your new stepdaughter or have a tantrum that spoiled a part of the wedding for the groom, his daughter, and you.\n\nTHAT is what makes you the AH. You had a choice and made the wrong one. You spoiled your own wedding and blamed a four year old then and the MIL now.\n\nThat your MIL is a justnomil does not change how you acted in that moment.",
              "id": 10,
              "comments": [
                {
                  "score": 181,
                  "content": "Is she wrong for yelling at a kid? Definitely. However she's not wrong for being upset that she had a special moment in life stolen from her and she'll never be able to have that moment back. The mil is the biggest ah here. Just because the kid had permission from _an adult_ doesn't mean they're aloud to do something. That reminds me of all the entitled parent stories where the kid trust to take someone's switch under the reasoning that \"their mom said they could play on it\" and while this situation isn't as bad as that the mil is still just as bad as those parents.\nAs for the \"parent your step child\" part, it's normal for most step parents to leave the \"parenting\"(ie disciplining) to the ACTUAL parent of the kid. A lot of people would see her disciplining the kid as overstepping. I'm not sure if I'm misinterpreting what you said but it sounds like your saying she(the STEPparent) should be parenting and disciplining the kid more than the kids ACTUAL parent and grandparent.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Have you spent any significant amount of time with a four-year-old lately? My kids are 5, 4, and 6 months old, and I have taught preschool for 12 years. Kids that age do not have the cognitive ability to resist the impulse to try a cake when given permission by a trusted adult, nor the context to understand the difference between someone's wedding cake and any other random cake. I think this bride acted like a child herself when she threw a fit at her own wedding, and yelling at a very young child over it is appalling. The adult response would have been to swallow her disappointment in the moment, continue to enjoy her wedding, and then afterwards or the next day address the cake cutting with her husband first, and then (hopefully) as a team united against the boundary-stomping MIL. It didn't even need to be addressed with the stepdaughter, other than a gentle reminder before the next occasion involving cake that we don't touch someone else's cake. We wait to be given a piece and then we say \"thank you.\" \n\nAngry bride, YTA and an evil stepmother in-the-making. Do better by this child going forward.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "So, it's not about the cake.  You scapegoated the 4yr old.  ESH.  Get some therapy and examine your life choices, because this is a mess.  It's clearly not only you, but you are part of the dynamic and you are not helping. \n\nPlease get some help.",
              "id": 13,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Yet you married him, knowing he seems unable to manage his mother.",
              "id": 14,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Yeah well you fell into her trap by being stupid enough to get drunk and scream at your step daughter. Bravo, every complaint she makes about you is going to look very reasonable to everyone who saw that little performance.",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "I mean, yelling at a 4 year old didn’t really surprise me after seeing “magabride”",
          "id": 16,
          "comments": [
            {
              "score": 3,
              "content": "Oof, I never noticed that. I’m very sad for that 4yo.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -12,
          "content": "Totally agree OP and the MIL are TA.  But is it really the husband’s job to police everything his mother does?  What was he supposed to do, follow her around at - his own wedding - and tell her not to do this?  How could he possibly anticipate this?\n\nI’m sure there will be a ton of people here who say the MIL shouldn’t have been invited or something, but that’s not how life - or weddings - work.  Sometimes your relatives just suck, and you need to keep perspective on what does and doesn’t matter to get through life.",
          "id": 18,
          "comments": [
            {
              "score": 12,
              "content": "If someone has a relative with a history of being shitty to their spouse/fiance, they should not bring that relative around until the relative shapes up. You're right, keeping priorities straight is what matters here. OP and his daughter are this man's family. They come first. His other relatives are extended family and not the priority. \n\nThe stunt of using the child to sabotage the wedding cake is something that almost no one but someone with a history of spiteful behavior would do, so it wasn't hard to guess what OP confirmed, that MIL has a history of targeting OP. \n\nMIL is not creating the problem. OP's husband is, by insisting on dragging someone in he knows will be nasty to his wife.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 590,
      "content": "ESH\n\nThe Everyone being you and MIL. You because, dude, it's your wedding, but it's also your now step daughter's dad's wedding. She was probably having the time of her life, got to play flower girl, and just having fun...then she sees this *impossibly* big cake. Bigger than her. So she goes and finds An Adult She Knows. Grandma. Grandma says I can and can't do things all the time, \"grandma can I help cut the really big cake cake\" she asks. Grandma, being one of the two assholes, says yes. The little kid cuts the cake then goes about the rest of the party, blowing bubbles from the little things on the tables or whatever and \"oh no why does Mommy MagaBride (gag btw) look upset?\" \"Why is Mommy MagaBride (still gross) yelling at daddy?\" \"Why is she yelling at me! At a party!\"",
      "id": 20,
      "comments": [
        {
          "score": 59,
          "content": "hahahaha",
          "id": 21,
          "comments": [
            {
              "score": 192,
              "content": "I really don't pay attention to handles unless I have to reference them in my post, which rarely happens so I was all the way through this one and was like \"oh what's OP's--oh. Gross.\"",
              "id": 22,
              "comments": [
                {
                  "score": 75,
                  "content": "Oh. Oh, wow.  This explains so much.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 16,
                      "content": "What’s does OPs username mean? I’m confused could someone explain it to me?",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I only just realized the Maga reference. The kid should have pooped in the wedding cake.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Ok this made me laugh even though I have a completely different opinion. Good job",
          "id": 26,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 347,
      "content": ">Everyones saying I’m TA but shouldn’t they be teaching the kid some manners? Who cuts someone else’s wedding cake first?\n\nFour year olds who's grandmothers' tell them it's okay do. That's why ESH. You yelled at a four year old kid who was told by an adult that she could do it. Had you just yelled at your MIL it'd be quite different.",
      "id": 27,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 228,
      "content": "ESH but honestly it’s your behavior that everyone is going to remember.  The child merely did what a trusted adult told her she could and you drunkenly yelled at her for it when you should have taken it up quietly with the adults if you absolutely had to.  Really showed your ass here...\n\nEdit: read OP’s notes - I don’t think anyone is saying they’ve absolutely never yelled at a child or lost their temper, but I doubt many consider drunkenly yelling at a child a typical or acceptable behavior, especially when the child didn’t realize they’d done anything wrong",
      "id": 28,
      "comments": [
        {
          "score": 14,
          "content": "Exactly, this was the weirdest hill to be mad about, because yeah it's your wedding but she acted like there was no more cake or that it had all been ruined. A slice was nothing and she has the right to tell her step-kid and mil not to do that, but like drunkenly shouting over cake you got to eat that most people from the crowd wouldn't have even noticed was cut, yup bad look on her.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 216,
      "content": "YTA for ‘MagaBride’\nBarf",
      "id": 30,
      "comments": [
        {
          "score": 71,
          "content": "it’s fitting for her having a wedding during a pandemic",
          "id": 31,
          "comments": [
            {
              "score": 29,
              "content": "But you don’t understaaaand it’s less than 50 people/s",
              "id": 32,
              "comments": [
                {
                  "score": -4,
                  "content": "still quite a few people? exposes them to risk of getting Covid...",
                  "id": 33,
                  "comments": [
                    {
                      "score": 16,
                      "content": "That was very obviously sarcasm I even marked it sarcasm how did you miss that",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My idiot step cousin is getting married in two weeks and berated my younger sister (who was gangpressed into having to attend) for her plans to wear a mask. Fucking kill me",
              "id": 35,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "OP’s username sucks dead dog’s testicles.\n\nYours, however, absolutely \\*rocks\\*. \\[salutes the captain\\]",
          "id": 36,
          "comments": [
            {
              "score": 3,
              "content": "Thank you! Just your everyday genius quantum physicist and diplomat, with nerves of steel and a heart of gold, leading a brilliant crew through the wilds of the Delta Quadrant. As you were, Lieutenant 😘",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 132,
      "content": "> shouldn’t they be teaching the kid some manners\n\nYes, so why did you yell *at the child*? YTA",
      "id": 38,
      "comments": [
        {
          "score": 33,
          "content": "Cause OP was drunk",
          "id": 39,
          "comments": [
            {
              "score": 70,
              "content": "Ah yes. I missed the part in the parenting manual where it says anything I do while drunk is okay. It's a great loophole for abusers who get to lash out then say \"Well, I was drunk. Can't blame meeeee.\"\n\nFun fact: OP being drunk does not excuse this. In fact, it probably makes it worse. Most people who get drunk enough to think yelling at a small child is okay are also probably the kind of people who get very loud, very angry, and very scary to kids while drunk. OP is failing as a stepparent right now.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 100,
      "content": "I’d be pissed",
      "id": 41,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 84,
      "content": "ESH, everyone being you and mother inlaw. She obviously shouldn't have allowed that, but getting drunk and yelling at a child doesn't make you much better. You made a mildly inconvenient situation so much worse. You had a right to your feelings, and I'd be upset too. But you handled it badly.",
      "id": 42,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 82,
      "content": "ESH. You're not an A for getting upset over the cake, but you're an A for screaming at the child. Your MIL is the bigger A for allowing it. After the many horrible MIL stories I've read, I'm very suspicious that your MIL wanted you upset and to lash at your step daughter.",
      "id": 43,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 69,
      "content": "INFO: did grandma really encourage her? Or was grandma covering for her and taking some of the heat and trying to fix the situation? Was grandma supposed to be stuck babysitting all night? Or was someone else supposed to be watching her? \n\nYou’re NTA for being a little upset in general, but definitely YTA for yelling at a FOUR YEAR old child over it. I’m not sure who else is an asshole based on the info given.",
      "id": 44,
      "comments": [
        {
          "score": 5,
          "content": "Even if grandma was only taking the heat, how did this 4 year old end up with a knife and access to the cake? Someone involved with the 4 year old was an AH no matter how you spin it, and it wasn’t the 4 year old. And while it’s fine to be upset at things, getting upset for the duration of your wedding that a child did (and they tried to cover up/fix) solves nothing. Instead of taking what happened and moving forward, something that is required in both a marriage and having a child now, OP let that fester to the point where she yelled at not one, not two, but three people during a time that was supposed to be a celebration.",
          "id": 45,
          "comments": [
            {
              "score": 1,
              "content": "That’s why I was asking who was watching the 4 yr old and who was SUPPOSED to be watching her. Ie. If they just figured “ah, shes at a family wedding, she’s fine, everyone is keeping an eye out, it takes a village,” or “I’ll hand her to my u suspecting mom who is trying to enjoy her evening and force her to watch after a 4 yr old all night...” then obviously I have no sympathy for the couple and a lot more for the mom. They should’ve hired a nanny to watch her for the evening or paid a cousin or something. \n \nI can’t tell if this was a case of kid left to wander around the reception hall helped herself to cake and grandma noticed, tried to fix, and deflect. Or if this is an evil mil who got a knife out and went to cut the wedding cake with a 4 yr old. (Which seems less likely to me, tbh)",
              "id": 46,
              "comments": [
                {
                  "score": 4,
                  "content": "I see what you’re saying. I think you’re trying to look for malice/no malice, where I’m saying (even though 4 year olds are wiley) leaving a 4 year old unattended long enough to cut a cake, usually a centerpiece, by herself makes someone an AH. I was 4 at my dad’s wedding and it was understood that he wasn’t going to be my primary caregiver for the evening, but the village took turns keeping an eye (with the exception of the boring speeches, where I instead laid in the bathroom with my arms and legs in the air and whispered “I’m a dead bug” to anyone that entered)",
                  "id": 47,
                  "comments": [
                    {
                      "score": 3,
                      "content": "See, I’m not cool with that. Someone is an AH but my guess is on the OP’s husband. You know, the kid’s FATHER who should be responsible for watching HIS kid or making SUITABLE arrangements for her to be watched after. And no, I don’t think “handing her off” to her unsuspecting Grandma, who is trying to enjoy the event, too, is suitable. (Unless this was agreed to in advance of the wedding, but doesn’t sound like it.) \n\nNothing more annoying than “it takes a village” parents at an event, in my experience. Mainly because it really just forces other people to be responsible.\n\nETA: okok. The I’m a dead bug thing is hilarious and adorable. So I’m cool with that! Lol. But had you stuck your finger in the cake, I wouldn’t blame your grandma or you.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}