{
  "post content": "I've literally never made a reddit post today so here we go, no idea where else to ask for advice for this lmao\n\nAnyways! My s/o has been asking since yesterday if I want to go to a restaurant or someplace else for valentine's day. unfortunately, I'm extremely drained from my work and my studies, and my social battery has been very depleted lately because of extracurricular things, which I've told them, but I keep getting asked, to which I keep telling them the same thing: that I've got to finish up my work and am unable to go out anywhere at the moment (I have a very big project due this evening that I have to get done).\n\nI feel really bad that I keep declining to go places, because I know that me telling them no is probably hurting their feelings. I've been told no to hanging out on holidays too, and I know it hurt my feelings when that happened, so it probably hurts theirs that I'm basically doing the same thing now. I'm also very much so an introvert, and after spending most of the day working and being around people, I just need that time to myself and to rest for the rest of the day. \n\nI'm not mad at my s/o at all for inviting me. I simply can't bring myself to go hang out with them today. Though I feel as if I might be the a-hole for repeatedly declining to hang out with them, especially because it's Valentine's day.\n\nSo, AITA for saying no to the date invitation?",
  "id": 1,
  "comments": [
    {
      "score": 3,
      "content": "NTA, but if you can't go out or do something special for your SO *today* you should come up with something to let them know you care about them.  They should already know, but some people take VD as a special day to *proclaim your love from the hilltops*.\n\nMaybe make up a cheesy voucher for a night out in the next week, when you'll have time and VD stuff will have died down a bit.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I want to know if me declining my s/o's date invitation was an a-hole move, and if me repeatedly saying no to hanging out with them despite being mentally and socially drained makes me TAH.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. \n\nIf your SO can't understand/appreciate what you have bandwidth for in stressful times what's the point? \n\nWe couldn't plan to do anything in the evening due to some issues, and I'm working today (he's not.) and like, you I'm drowning in deadlines. So he just brought over a quick takeout and flowers, came ate with me and left me to my work to go about the rest of his day. It wasn't anything fancy, but I really appreciated that he didn't make a fuss and I dindn't need to do anything. Celebrations like these shouldn't be about creating more stress for people!",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. It sucks that work and studies are draining you and stealing precious life moments from you. Your partner isn't an asshole really, but it is rude to *keep* asking after you said no once. That's called pressuring someone, and can produce coerced results. You wouldn't be asking yourself if you're an asshole if they did the right thing and accepted your answer.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI've literally never made a reddit post today so here we go, no idea where else to ask for advice for this lmao  \nAnyways! My s/o has been asking since yesterday if I want to go to a restaurant or someplace else for valentine's day. unfortunately, I'm extremely drained from my work and my studies, and my social battery has been very depleted lately because of extracurricular things, which I've told them, but I keep getting asked, to which I keep telling them the same thing: that I've got to finish up my work and am unable to go out anywhere at the moment (I have a very big project due this evening that I have to get done).  \nI feel really bad that I keep declining to go places, because I know that me telling them no is probably hurting their feelings. I've been told no to hanging out on holidays too, and I know it hurt my feelings when that happened, so it probably hurts theirs that I'm basically doing the same thing now. I'm also very much so an introvert, and after spending most of the day working and being around people, I just need that time to myself and to rest for the rest of the day.   \nI'm not mad at my s/o at all for inviting me. I simply can't bring myself to go hang out with them today.  \nSo, AITA for saying no to the date invitation?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    }
  ]
}