{
  "post content": "I (f20) have been living at my parents’ home since January after deciding to take a year off of university. Initially, it was to recover from a concussion (oof didn’t know how hard uni was when your brain isn’t working), but I would like to work so that I can actually pay for my last semester of uni myself, instead of relying on my parents. I truly appreciate that they have supported me financially throughout my university years. I’ve worked every semester/summer except when I was abroad, but it definitely did not cover all of my costs. \n\nSo, my parents both work in juvenile rehabilitations (colloquially known as juvie). My father has worked in the field all my life, and my mother started working in it when I was finishing high school. Their facility has three lodges, and they are both supervisors, but in different lodges. \n\nWhen I was younger I had always talked about wanting to work in the same field. When I moved back in, I joked about applying to be an “on call” security officer there. My mother told me it would be a bad idea, as well as my brother in law (who also lives here part of the time and works as an adult on call). My brother’s primary reasoning is that I am a young women, and that I am too nice. My mother’s reasoning is that it would be difficult for her and my father to supervise me because I am their daughter (my counter is that they already supervise their son in law), and that the negative/sexist comments from the boys (it is a male only facility) would get to her too much. My father, while not necessarily supportive of me applying, helped me with my application, pro/conned the position, and has been generally level headed about the situation. \n\nI had mostly forgotten about applying because it’s been a few weeks. I’ll be honest, I was pretty butthurt about my mom’s reaction. I’ve heard the complaints from her about stupid coworkers who don’t know how to work with youth and I HAVE EXPERIENCE WORKING WITH AT RISK YOUTH. I understand that she has a point, but I don’t think these boys will ever improve if the tactic for making them treat younger women like humans instead of objects is isolation from said women. I understand that it’s gonna be hecka hard for me to make them me respect me (is respect “earned” in this circumstance?) but I sure would like to try.\n\nSo here’s my combined a-hole question, I think I may have been one for not getting over her not supporting me applying (that’s her prerogative), but WIBTA if I accept the job offer (I’m interviewing this Wednesday)?",
  "id": 1,
  "comments": [
    {
      "score": 29,
      "content": "NAH\n\nI'm a counselor at an RTC, a lot of my clients come from \"juvie.\" Despite the stereotypes, being a small female (like I am) and nice (like I feel I am) are not automatically barriers to doing the job well. Most JD youth I've worked with would never dare fight a female anyway, it makes them look bad.\n\nThat said, I see where your mom is coming from, at least in terms of being in the same workplace. It's a whole other thing to have to see and hear the comments and behavior towards you, and try to supervise you as your mother. That could be a difficult conflict for her professionally.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "NAH--you need the work and if the job fits your skillset, then you should go for it if it's offered. *But* your mom's concerns about supervising you are legit.\n\nIt's really hard completely separating your family relationship from your work relationship such that neither affects the other in any way (I have been there). At work, your mom isn't your mom, she's your supervisor--given you've said that you had a hard time getting over her not supporting your application, how would you react if she criticized your job performance? Would you evaluate the criticism honestly and improve or assume your mom was just trying to undermine you? Would you spend weeks dwelling on how unfair it is? It is *really hard* to have family stay at home and work stay at work--inevitably \"your mom\" and \"your supervisor\" are going to start bleeding together. And your mom's already indicated that she might have a hard time separating \"her daughter\" from \"her staff member.\"",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NAH. You said your dad went through the pro/cons with you so you hopefully know what you’re getting into. Your mom sounds like she’s trying to be protective., and understandably so.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f20) have been living at my parents’ home since January after deciding to take a year off of university. Initially, it was to recover from a concussion (oof didn’t know how hard uni was when your brain isn’t working), but I would like to work so that I can actually pay for my last semester of uni myself, instead of relying on my parents. I truly appreciate that they have supported me financially throughout my university years. I’ve worked every semester/summer except when I was abroad, but it definitely did not cover all of my costs. \n\nSo, my parents both work in juvenile rehabilitations (colloquially known as juvie). My father has worked in the field all my life, and my mother started working in it when I was finishing high school. Their facility has three lodges, and they are both supervisors, but in different lodges. \n\nWhen I was younger I had always talked about wanting to work in the same field. When I moved back in, I joked about applying to be an “on call” security officer there. My mother told me it would be a bad idea, as well as my brother in law (who also lives here part of the time and works as an adult on call). My brother’s primary reasoning is that I am a young women, and that I am too nice. My mother’s reasoning is that it would be difficult for her and my father to supervise me because I am their daughter (my counter is that they already supervise their son in law), and that the negative/sexist comments from the boys (it is a male only facility) would get to her too much. My father, while not necessarily supportive of me applying, helped me with my application, pro/conned the position, and has been generally level headed about the situation. \n\nI had mostly forgotten about applying because it’s been a few weeks. I’ll be honest, I was pretty butthurt about my mom’s reaction. I’ve heard the complaints from her about stupid coworkers who don’t know how to work with youth and I HAVE EXPERIENCE WORKING WITH AT RISK YOUTH. I understand that she has a point, but I don’t think these boys will ever improve if the tactic for making them treat younger women like humans instead of objects is isolation from said women. I understand that it’s gonna be hecka hard for me to make them me respect me (is respect “earned” in this circumstance?) but I sure would like to try.\n\nSo here’s my combined a-hole question, I think I may have been one for not getting over her not supporting me applying (that’s her prerogative), but WIBTA if I accept the job offer (I’m interviewing this Wednesday)?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": -1,
      "content": "I sort of think YTA... but lightly. This is your parents place of work and they should be allowed to set boundaries between work life and home life.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": -1,
      "content": "NTA. You can apply to any job you want, no matter what your parents say. Though their concerns are very reasonable in their eyes, and rightfully so. Your their only daughter, and they worry about you. They love you and want to make sure that you don't apply for a job that you will regret, but that doesn't mean they can forcefully make you do what they want.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    }
  ]
}