{
  "post content": "I (27F) have two close long-distance friends, R and S. Almost a year ago I escaped an apartment fire, but I lost everything, including my cat. I struggle with moderate depression and he wasn't registered as an emotional support animal but he pretty much fit the bill. My mental health has been a roller coaster since then with a big increase in depressive spirals.\n\n4 months ago R told us her dad, with whom she already has a strained relationship, was diagnosed with prostate cancer, that she was seeing a therapist, and may be distant for awhile. From previous discussions I know that R, unlike me, does *not* like to talk about her feelings. She's complained about her husband, in-laws, and other friends trying to pressure her into talking when she'd rather be left alone, so I sent her a message that said \"I won't call because I know you need space, but I want you to know that you can call me anytime.\" A month later she let us know that they were able to contain and start treating her dad's cancer, and that therapy was going well.\n\nCut to now, R and I had been working on a pro-bono project together, but I’d been falling behind trying to keep up with my full-time, pretty high-stress job in between depressive episodes. I finally sent her a text explaining that I dropped the ball, apologized, and asked if she wanted to schedule a call about it. No response. I later sent a text in our group chat asking if they'd like to get together. I got a nasty text back from R saying that she wasn't interested in seeing me because she'd been depressed for awhile and I would know this if I ever bothered to reach out. Quiet stretches are normal for our group so I was pretty shocked. I went back through my messages and it seemed typical for us, a few spurts of conversation every month or so, and one prior attempt from me to get together.\n\nI texted R privately to apologize for not reaching out. I said that I had been trying to give her space and hadn't realized she had been feeling ignored (true, but it's not like I was righteously considering her needs the whole time, I was also busy being in my depressed hole). I said I would check in more regularly if she needed. I got an immediate text back saying things like \"I took your silence as a sign\" and \"It doesn't really seem like you care unless the situation revolves around you. I was there for your crisis, but you weren't there for mine\".\n\nI called S, worried that maybe she was feeling neglected too. I did my best not to divulge R’s private texts, but she had obviously seen the first text in the group chat. She also let slip that at some point R and S got together, the subject of me came up, and \"R was feeling a certain way\". I feel like there's a bit of a double standard here. Maybe I didn’t reach out enough, but I can't know what R needs if she doesn't tell me. And R *was* there for me after the fire, but my trauma doesn't just go away because she’s hurting too. AITA for not reaching out to R enough?",
  "id": 1,
  "comments": [
    {
      "score": 7,
      "content": "NAH - Seems like you all are stuck your own bubbles. You all are busy with trying to get your life together you don't realize how other people are faring.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA.\n\nAssume you have given the whole picture here, and I don't necessarily see why you would want to do otherwise, I think both you and your friend were just caught up in your own major life challenges. Sure, you can have done more here and there but given your situation, I think you have done your part and tried your best. I would say it is your friend's problem for not having communicated clearly what she needs as you have offered them both space and help but she decided against it. However, I also think since she's suffering, it's understandable why she might react this way. It's not fair for you but people sometimes can't help it.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Assuming this is the truth, the whole truth, and nothing but the truth...I'm gonna say NTA. You expressed your desire to respect her space while making yourself available from the beginning. Presumably she's a big girl and could have reached out to you at any time for support.",
      "id": 4,
      "comments": [
        {
          "score": 2,
          "content": "and even if she was too depressed to reach out, it's not fair to blame you for not reading her mind on that. you specifically told her in advance that you were giving her space.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Did my best to say it like it was given the character limit, that's why I included the part about me dropping the ball on project responsibilities.  I realized I messed up but tried to get in front of it before it snowballed",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA. Like the other commenter said, y’all are in you own lives dealing with major issues. While you could’ve reached out a bit more it’s R fault for not communicating you efficiently about their feelings. Y’all are all adults, communicate like so. While I think you definitely did most on your part.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. you can't take care of other people until you have taken care of yourself. I've had friends that wanted to make their depression my problem regardless of how I was doing at the time. I don't play that game anymore. You told them you were giving them space, and that they could reach out. They decided not to take that offer. The lack of communication is on them.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. You expressed your reasons for not reaching out and gave R reassurance that she could get in touch at any time. If she had wanted to, she could have messaged you something like 'I'm feeling a little lonely and would love to hear from you'. Your group of friends sounds fairly mental health literate, and this type of support seeking without taking negative emotions out on others is one of the most fundamental steps in promoting recovery. Instead, R chose 'I took your silence as a sign' - a guilt-trippy, buck-passing comment that implies you were expected to read her mind. No doubt her words came from her worst moments, not her true self, and you're right to recognise that she's in a tough place. But it's still not on you to anticipate her needs when she doesn't communicate them to you.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because apart from participating in group texts I didn't reach out privately to ask how my friend was doing\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. Sometimes we try to do what we think is right, and we make a mistake. That’s ok. I would just reiterate that you thought she wanted space, and offer a sincere apology. Ideally she will consider the length and depth of your friendship and acknowledge that sometimes we do the wrong thing when trying to do the right thing.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (27F) have two close long-distance friends, R and S. Almost a year ago I escaped an apartment fire, but I lost everything, including my cat. I struggle with moderate depression and he wasn't registered as an emotional support animal but he pretty much fit the bill. My mental health has been a roller coaster since then with a big increase in depressive spirals.\n\n4 months ago R told us her dad, with whom she already has a strained relationship, was diagnosed with prostate cancer, that she was seeing a therapist, and may be distant for awhile. From previous discussions I know that R, unlike me, does *not* like to talk about her feelings. She's complained about her husband, in-laws, and other friends trying to pressure her into talking when she'd rather be left alone, so I sent her a message that said \"I won't call because I know you need space, but I want you to know that you can call me anytime.\" A month later she let us know that they were able to contain and start treating her dad's cancer, and that therapy was going well.\n\nCut to now, R and I had been working on a pro-bono project together, but I’d been falling behind trying to keep up with my full-time, pretty high-stress job in between depressive episodes. I finally sent her a text explaining that I dropped the ball, apologized, and asked if she wanted to schedule a call about it. No response. I later sent a text in our group chat asking if they'd like to get together. I got a nasty text back from R saying that she wasn't interested in seeing me because she'd been depressed for awhile and I would know this if I ever bothered to reach out. Quiet stretches are normal for our group so I was pretty shocked. I went back through my messages and it seemed typical for us, a few spurts of conversation every month or so, and one prior attempt from me to get together.\n\nI texted R privately to apologize for not reaching out. I said that I had been trying to give her space and hadn't realized she had been feeling ignored (true, but it's not like I was righteously considering her needs the whole time, I was also busy being in my depressed hole). I said I would check in more regularly if she needed. I got an immediate text back saying things like \"I took your silence as a sign\" and \"It doesn't really seem like you care unless the situation revolves around you. I was there for your crisis, but you weren't there for mine\".\n\nI called S, worried that maybe she was feeling neglected too. I did my best not to divulge R’s private texts, but she had obviously seen the first text in the group chat. She also let slip that at some point R and S got together, the subject of me came up, and \"R was feeling a certain way\". I feel like there's a bit of a double standard here. Maybe I didn’t reach out enough, but I can't know what R needs if she doesn't tell me. And R *was* there for me after the fire, but my trauma doesn't just go away because she’s hurting too. AITA for not reaching out to R enough?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "[deleted]",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "uh, you might want to delete some of your duplicates, lol.",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "😂 that tracks for my internet, thanks!",
              "id": 15,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}