{
  "post content": "My mom is fighting with Lymphoma, and asked me to go be her care taker for 4 months. I live 2 hrs away with my fiance and his family and our 8yo, who is autisitc. My son just started school and is in a program to help with his socialization skills that's been helping him tremendously. The entirety of my immediate family live within 45 min of my mother plus her boyfriend lives with her and only works 1-2 days a week right now. My fiance and I decided that I can't exactly drop everything I'm doing to go out of state for 4 months considering our son would have to go with me, which means pulling him from his program and limiting his school since its online and my mom would need to be driven to the hospital everyday(an hour long drive to and from). My moms family practically lynched me when I said I didn't have the flexibility right now...am I the A-hole here...?",
  "id": 1,
  "comments": [
    {
      "score": 10,
      "content": "NAH, your mom asked you if you could be caretaker but you have an autistic son. the only a--holes are your moms family for getting angry because of the current situation.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA. Four months is unreasonable especially considering she lives with her boyfriend and has family close by. It is reasonable for you to help a weekend or two over the the next few months if it's needed. \n\nYour family members who are giving you a hard time are pushing boundaries. Tell them once, what you're capable of doing to help out, and then stop all conversations with them about this issue. Set the boundary. Tell people. Stick to the boundary.",
      "id": 3,
      "comments": [
        {
          "score": 2,
          "content": "My fiance and I both agreed and told my mother that I would be available on weekends and would be more then willing to go help. I have, on multiple occasions for various periods of time and more often then not short notice. My aunt not only openly mocked my weekend offer but later told my brother personally that I was simply making excuses. My brother was the only one who sided with me.",
          "id": 4,
          "comments": [
            {
              "score": 2,
              "content": "Your aunt sounds toxic. I wouldn't interact with her if you can avoid it. Being an adult is setting and keeping healthy boundaries. There's absolutely nothing wrong with that, so don't let them try to convince you otherwise. Only you know how to best prioritize your life so you're taking care of yourself and your family. It's not up to interpretation from the peanut gallery.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Nah. And if your such an ass what does that make her family? They live closer by. Why aren’t they volunteering to help out?",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mom is fighting with Lymphoma, and asked me to go be her care taker for 4 months. I live 2 hrs away with my fiance and his family and our 8yo, who is autisitc. My son just started school and is in a program to help with his socialization skills that's been helping him tremendously. The entirety of my immediate family live within 45 min of my mother plus her boyfriend lives with her and only works 1-2 days a week right now. My fiance and I decided that I can't exactly drop everything I'm doing to go out of state for 4 months considering our son would have to go with me, which means pulling him from his program and limiting his school since its online and my mom would need to be driven to the hospital everyday(an hour long drive to and from). My moms family practically lynched me when I said I didn't have the flexibility right now...am I the A-hole here...?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH \n\nShes good to ask. You're good to say no.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA - Your Mom's family however is. Its funny how they would love for you to be flexible, but can't bend themselves.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA - Though they are more than capable of volunteering their time. They want you to do it so they don't have to.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}