{
  "post content": "Long time lurker, first time poster. I'm using a throwaway account because my username is one I use on different platforms.\n\nI know this sounds like a really weird question but it is honestly keeping me up. I'm a college student and I moved into a different, on-campus apartment this year. Everything's going really well but this one thing came up earlier. Our shared toilet doesn't entirely flush, but it's only just strands of paper come back up and nothing else. (Nothing else is being thrown in). I was talking to some of my roommates and the toilet was brought up. They mentioned how it's an \"older toilet\" (but the building was built in the 80s) and doesn't flush toilet paper well, so they all throw their used toilet paper into the bin. To my knowledge, half of my roommates already do this and I haven't asked/heard from the others. This might just be a culture thing for me or something I just have never heard of before but I find this pretty gross.\n\nI feel like the toilet should be working fine- I lived in a different building last year that was built around the same time as my current one and this was never an issue. But I have been told that this is an older building but I can't find anything on it. The campus also has maintenance people we can call and I feel like ringing them up would fix the issue. I'm mainly worried because we cycle out who throws out the trash cans and I don't really don't want to throw out other peoples used paper and today is the first day the can has really smelled, but I've only been here two weeks. Also, we're still in a panini so there's that too. I'm mainly worried if I would be the a-hole to be the one clogging the toilet or disagreeing with what my roommates think is best. They seem pretty set on just throwing them in the bin. WIBTA to continue flushing my toilet paper?",
  "id": 1,
  "comments": [
    {
      "score": 28,
      "content": "1. Call the maintenance person yesterday\n2. Keep flushing your TP. If you have an extra messy load, flush only a little bit of TP at a time to prevent clogging.\n3. When it's your turn to toss the trash, double-glove and triple-bag that mess up and hold your breath as long as possible.\n4. Pray the maintenance person has fixed the clearly broken/clogged toilet. Celebrate the news by letting your roommates know that the toilet is now a TP-friendly zone.\n\nNAH",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NTA. \nCall the maintenance people and let them fix it.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "INFO what country are you in?  Some countries plumbing can't cope with loo roll being flushed.",
      "id": 4,
      "comments": [
        {
          "score": 6,
          "content": "I'm in the united states. But if it makes any difference, the roommates I was talking to all lived in different countries then moved to the US.",
          "id": 5,
          "comments": [
            {
              "score": 11,
              "content": "NAH.\n\nIt's possible that this is what they are used to doing then. Unless it's a macerator type loo, I'd keep flushing and chase maintenance to repair it properly.\n\nIf it is a macerator type then learn to throw and get a good bin emptying schedule between you",
              "id": 6,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -1,
              "content": "Is anybody you're living with from China?  In older buildings there, it's risky to flush toilet paper, so instead people usually put it in the trash.  If they are Chinese, tell them that even in older American houses (and I mean any from 1900 on), there should be no problem flushing paper.  \n\nIf it weirds them out to put paper in the toilet, maybe they can have a small, special covered bin next to the toilet they can put it in, and they can be in charge of emptying just that one. \n\nMeanwhile, get some toilet unclogging stuff from the supermarket and use that, just to check if that makes flushing more complete and get rid of any gunk that might be in the pipes.",
              "id": 7,
              "comments": [
                {
                  "score": 7,
                  "content": "It would be an AH move from the maintenance perspective to have to deal with a cornucopia of chemicals dumped down the drain. They just need to call maintenance and let them handle.",
                  "id": 8,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA. Step 1 is call maintenance to find out what's going on. You don't have to jump straight to using a bin.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA - Something in the plumbing isnt working correctly, call maintenance.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA\n\nIf you live in the US the toilet and sewer system should be able to handle the paper. Call the maintenance people for your apartment and report the issue and if you can ask them about it. It's their job it's fine to call them.\n\nIt's not a big deal to throw used tp in the trash though, I've had to do that in other countries where the system can't handle the paper.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I continued to ignore what they want all of us to do and I think I am the a**hole because I am not following their rules. I also feel like I would be the a**hole for causing the custodial staff to constantly have to fix our toilet and cause more problems for them.\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLong time lurker, first time poster. I'm using a throwaway account because my username is one I use on different platforms.\n\nI know this sounds like a really weird question but it is honestly keeping me up. I'm a college student and I moved into a different, on-campus apartment this year. Everything's going really well but this one thing came up earlier. Our shared toilet doesn't entirely flush, but it's only just strands of paper come back up and nothing else. (Nothing else is being thrown in). I was talking to some of my roommates and the toilet was brought up. They mentioned how it's an \"older toilet\" (but the building was built in the 80s) and doesn't flush toilet paper well, so they all throw their used toilet paper into the bin. To my knowledge, half of my roommates already do this and I haven't asked/heard from the others. This might just be a culture thing for me or something I just have never heard of before but I find this pretty gross.\n\nI feel like the toilet should be working fine- I lived in a different building last year that was built around the same time as my current one and this was never an issue. But I have been told that this is an older building but I can't find anything on it. The campus also has maintenance people we can call and I feel like ringing them up would fix the issue. I'm mainly worried because we cycle out who throws out the trash cans and I don't really don't want to throw out other peoples used paper and today is the first day the can has really smelled, but I've only been here two weeks. Also, we're still in a panini so there's that too. I'm mainly worried if I would be the a-hole to be the one clogging the toilet or disagreeing with what my roommates think is best. They seem pretty set on just throwing them in the bin. WIBTA to continue flushing my toilet paper?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Nah, but they don't mean paper after a no.2 surely. They just mean paper if you've had a wipe after a no.1, don't they? A little bit of pee on a tissue in a bin is not that big a deal, poo in the bin would be a very strange, and wrong, scenario.\n\nEdit: grammar.",
      "id": 14,
      "comments": [
        {
          "score": 1,
          "content": "Pretty sure they mean both",
          "id": 15,
          "comments": [
            {
              "score": 2,
              "content": "If you're right, and on rereading, you might be, that's just not right. Hygienically, just no!",
              "id": 16,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "In some countries (Greece for instance) their plumbing system cannot handle toilet paper being flushed and so throwing it in the bin is the norm. They usually use a bidet to clean themselves with water before wiping So it’s not strange or even unhygienic , just different and the housemates may be from countries where this is what’s done. Though OP is in the USA so they aren’t the AH and as previously suggested should contact maintenance.",
          "id": 17,
          "comments": [
            {
              "score": 2,
              "content": " I appreciate different cultures do things differently, and maybe it's just me, but a bin like that still seems unhygienic.",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. If you’re putting the paper in a normal bin (even one with a lid) you’re going to be literally breathing in s#!t every time you go in there. Which I’m sure isn’t good for you. Plus if it’s a toilet/bathroom combo I would never feel clean showering or cleaning myself in that room. Definitely call your maintenance people because it’s likely been caused by people putting things down the toilet that aren’t meant to go there. \nThis is something that should be looked at\nAnd if you still want to put the paper in the toilet in the meantime you can use a plunger to unclog it a bit and that’ll hopefully help short term",
      "id": 19,
      "comments": [],
      "relation": "Support"
    }
  ]
}