{
  "post content": "MY (32F) grandmother recently decided to gift me and my husband a screen door for the house. We have a one year old, so she said this will add a sense of security. I am very appreciative. I see this as a really sweet gesture. \n\nSo my grandmother paid for the screen door and she hired her neighbor/friend to install it. I think he works for construction or something. All was fine until it was time to install the door. He took over 4 hours and eventually my family and I had to go to sleep because it was getting too late and we had work in the morning. \n\nI appreciated the fact that he didn't want to give up on the project, but it was an obvious struggle for him. (I think I read online when ordering that the door should take about 30 mins to install.) I kept offering him help and asking if he needed anything but he refused. \n\nIn the morning, we saw that the door was only partially installed. There was no handle from the inside, and it was locked, so we literally couldn't exit the front door. My husband had to go outside through the back and install the front handle so that we could simply open the front door. There were also visible holes where there shouldn't have been and it was not completely aligned. \n\nSo here is the issue. My grandma asked how it looked and I told her the truth. It isn't finished. She is insisting that he come and finish the job since she already paid him. I am pretty adamant about just hiring someone else (and I'll pay for that with my own money of course). I don't see the point in her neighbor coming back if he is incapable of doing the job. It will just prolong the process and likely be frustrating for everyone involved. \n\nAITA for telling my grandma that I'll just hire someone myself to finish the job? Thanks for any advice. My grandma is the sweetest in the world and I don't want to hurt her feelings. But I also think she was trying to be sweet to this guy by hiring him and encouraging him to take on a job that he may not be comfortable with. She's the type of person it can be hard to say no to.",
  "id": 1,
  "comments": [
    {
      "score": 20,
      "content": "Tell your grandma the door looks just great and thank her. She will be happy and drop the subject.\n\nThen hire a competent person to finish up. Don’t let your grandmothers friend back in your property. NTA",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NAH  It might have been easier to answer the first question with \"Great!\" and then just hire someone competent, but whatever.  If the dude comes back, he could be there another 4 hours and F it up worse.\n\nEdit: Changed N T A to N A H.  I don't think working dude was an AH, just incompetent.  Grandma  is obviously not AH, either.  So, N A H.",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NTA It's unfortunate this guy was paid beforehand, but it's clear he can't do the job. Your grandma needs to understand that you don't want someone who is incapable of doing the job coming back a second time. Hire someone who knows what they're doing.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. I think nobody is the asshole here, everyone's intentions are good so it's just a matter of perspective on who should repair/complete the work. Both you and your grandma are right in your own places!",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "The man needs to give back the money she paid for. He didn’t finish the job.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA.  It's your house.  Your grandmother obviously feels embarrassed, and is insisting on fixing it herself to \"clean up her own mess\".  In doing that, she's adding to your stress, not removing it.  This is maybe a good time to deploy a little lie, something like \"we just needed to fix it, so we took care of it.  Neighbor guy would have come over, but it was hard to get the scheduling to work out.  Thanks for the door, we love it!\"",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH.  Just hire someone and tell grandma when it's been taken care of. If her neighbor returns to finish the job, thank him and send him on his way. Be sure to thank your Nan, profusely, for the gift.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA, he’s been paid already. Yeah, maybe you shouldn’t have been honest with your grandma, but no point in the guy coming back to potentially make things worse.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "30 minutes if everything is perfect. There’s a reason good door & window professionals send someone out to take measurements. Hard for us to tell why this has taken 4+ hours so far. Maybe he’s just incompetent, or maybe the measurements are less than perfect.  If you ordered the door a little too big, or a little too small it would be kind of an AH move to blame him.   Take a bunch of pictures and post over in r/homeimprovement",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH. Sounds like she hired an incompetent person for the job. She should get her money back. Thank her for the gift and thought behind it.",
      "id": 11,
      "comments": [],
      "relation": "No"
    }
  ]
}