{
  "post content": "I sell Pokémon cards on eBay as a side job. I have been doing it way before; the rush on Pokémon cards was a big thing. When I mail out my cards, I like to send them in different colored envelopes to stand out. The colors are red, blue, pink, green, and yellow. They are randomly picked and using different colors helps me remember who has what order. I have never gotten a complaint before and thought it was a great idea. So, when your letter arrives it’s a fun experience instead of just getting a PWE. ( Plain White Envelope)   \n\n\nI had an order for a card that was randomly put in a pink envelope and mailed off to the buyer. About a week or so later I get a message on eBay from the buyer asking me not to send him pink envelopes because pink is for girls, and he doesn’t want his neighbors to see him carry in a pink letter. About a week goes by and I add more items to my eBay and this person bought more things from me. About ten different cards. I don’t remember him from all the other orders, so one of his packages gets sent in a pink envelope. I had a lot of orders that week and a lot of people got pink envelopes along with different colors. I’m also sure another one of his orders was sent in a blue one.  \n\n\nHe messages me again, furious that I have sent him another pink envelope. He informed me that he would not buy from me again if the next envelope was pink. His message also included “I don’t want another pink letter only sending me color associated with the American flag, so only red and blues. If it’s on the gay flag, I don’t want it.” Weird because the pride flag is a rainbow, but I digress. He sent other things that he felt were associated with pink that he didn’t want to be associated with, but I think we all get the point.  \n\n\nSo about two weeks later he orders about twenty cards, which is over the weight limit for eBay standard card shipping, so I broke his order down into separate orders. Cards were bought in different orders of five, so it was easy to do. I had a buy three get two free.   \n\n\nI decided I didn’t want this person to go without his pink envelopes any longer, so I sent him five separate pink letters for his cards. Now, where I think I was being the A-hole was while talking to my girlfriend, she defended him, saying “he could have been in the closet, and you exposed him to his family.” I tried to show her the messages where I don’t think that is the case. So she changed it to \" He doesn't want to be made fun of by his neighbors and now he will.\" But now I feel bad that he did ask to not get them sent anymore, but I decided to be petty.   \n\n\nSo reddit AITA?  ",
  "id": 1,
  "comments": [
    {
      "score": 9116,
      "content": "NTA. This is hilarious. Your gf is wrong...even if he is closeted, nobody in their right mind is going to assume that because somebody mailed him a pink envelope that he's secretly gay. You have not outed him by sending him pink envelopes lmao",
      "id": 2,
      "comments": [
        {
          "score": 2298,
          "content": "Nah, the lgbt card comes in a pink envelope, isn't it obvious?",
          "id": 3,
          "comments": [
            {
              "score": 1510,
              "content": "Mine came in a sparkly holographic envelope, but maybe that was coz it was sent out during Pride month...",
              "id": 4,
              "comments": [
                {
                  "score": 972,
                  "content": "You got the Limited Edition packaging?? Ugh, so jealous!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 387,
                      "content": "Well, now I'm upset :/ maybe once I renew it I'll get the limited edition one 😔",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Dude, I had to spend over $700 on the limited edition holographic EX card. Are you kidding me with this shit?",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "It's the chase variant packaging lmao",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 344,
                  "content": "You guys are getting cards? All I got was crippling anxiety and depression.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 131,
                      "content": "Kitties and Pupper https://imgur.com/gallery/mygdlRQ\n\nhttps://imgur.com/a/Ma8J1Hs\n\nPlease accept kitty and pupper pics in consolation.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "You had to send in your info before the deadline \n\nBut seriously, hope your life gets better",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "*hugs*",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I got both of those things but they forgot to send my gay card! 🎭",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "Op should have sent them in a rainbow envelope 😂",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I think that's an NFT.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Ugh, lucky! I came out during the supply chain issues part of COVID, so mine just came in an old Madonna CD case.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Did it still have the CD at least?",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Damn, the Collector's Edition.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "sadly, mine came in an ordinary looking skin coloured package. All good though",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 171,
              "content": "That's the pre LGBTQ card. The official card is delivered by singing drag queens on a pride float. It's like hogwarts but for gay people.",
              "id": 20,
              "comments": [
                {
                  "score": 35,
                  "content": "Singing drag queens? I'm so jealous.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I know! Maybe I'll become gay, like the conservatives are always saying is going to happen. (Being gay looks like too much fun so we ALL try it!)  I'd totally do it out to get the singing drag queens come to my house.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Aw, was it Asexual erasure that got me just a barbershop quartet? A very well groomed barbershop quartet who definitely had their moves down, so I wouldn’t have noticed if you hadn’t mentioned the drag queens and their float, but…",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 55,
              "content": "If the envelope is pink you’re getting the gay. If it’s delivered by an owl you’re also going to Hogwarts.",
              "id": 24,
              "comments": [
                {
                  "score": 19,
                  "content": "Not going to Hogwarts if you're queer lol",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "\"You're a homosexual Harry!\"",
              "id": 26,
              "comments": [
                {
                  "score": 12,
                  "content": "I just had a vision of a flamboyant homosexual Hagrid. Now that would be awesome.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "[removed]",
              "id": 28,
              "comments": [
                {
                  "score": 3,
                  "content": "That menas bisexual people get both? \n\nI should complain and demand my vagina and dick shaped confetti...",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "They used to arrive in a plain brown wrapper, but then society adjusted, and yeah, the envelopes are pink now.",
              "id": 30,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 336,
          "content": "[deleted]",
          "id": 31,
          "comments": [
            {
              "score": 60,
              "content": "I think you can also block buyers on eBay, but it is probably a huge PITA (like many things on eBay).",
              "id": 32,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 48,
              "content": "Why wouldn't people want safe packaging? Whenever I leave an eBay review I always mention the packaging. Unless they think they're going to save huge amounts if you only use a PWE.",
              "id": 33,
              "comments": [
                {
                  "score": 13,
                  "content": "Do they think it will make shipping cheaper? (I'm in Australia, and the price of postage here is ruinous.)",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "not pokemon cards, but i buy kpop photocards which usually don't run me more than like $15-20 (though there are more expensive ones, i just don't buy those) and the shipping is a little extra than just sending a plain envelope because they come in a protective case to stop them from getting bent. the packaging is honestly a comfort to me because i've received regular envelopes with weirdly placed creases before and it's great to know that i'm going to receive something in good condition!",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "Send a white envelope next time but cover it in heart and unicorn stickers and big bold hearts drawn all over it and maybe some red smoochy lips but \\*gasp\\* there's a mustache above those lips and they're saying \"open me\" and beneath them \"...my manly man...\" saliva from a half-hidden tongue dripping over the bottom lip onto the words",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "When I buy cards from game stores they get sent in a little hard plastic case only slightly bigger than the size of the cards. The case is in a bubble wrap envelope. Getting them in a DVD box wouldn't seem like a waste? Its just cardboard right? If anything its less wasteful",
              "id": 37,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Imagine being angry about thoughtful packaging. People will throw a fuss over anything, won't they?",
              "id": 38,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "idk but OP is \\*SO\\* NTA.  I trade pokemon cards with people in the mail and literally draw cute doodles inside (I put the card/toploader inside a greeting card to keep it stiffened, so I decorate the greeting card for fun) and often write my addresses in colorful (purple, for example) pen and even have sealed them with \\*rainbow tape\\* at times, and I've gotten nothing but compliments on it - and I'm pretty sure about 80% of the people I trade with are dudes.  \n\n\nFor the record, if I'm paying for tracking anyways, I don't care what kind of packaging people use as long as it's secure... and I don't really see why anybody would!  People can be so strange.  The only trading card packaging I've ever gotten upset about was when someone sent it PWE but like. LITERALLY just the card in the envelope.  Not even a toploader.  I think it was their first time mailing them, so I just politely told them they might want to change that for next time (the card was actually okay by some miracle, considering the envelope was pretty chewed up)",
              "id": 39,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "That's amazing. Most of the ones I buy, I am thinking they're under packaged. I got one recently that was well packaged and didn't charge extra (stayed under package limit but strong plastic used rather than some cardboard) and I was so damn happy.",
              "id": 40,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -2,
              "content": "YTA for using the word hubby",
              "id": 41,
              "comments": [
                {
                  "score": 4,
                  "content": "[deleted]",
                  "id": 42,
                  "comments": [
                    {
                      "score": 0,
                      "content": "It's called \"husband\".  Not \"SO\", not \"partner\" (howdy partner?), and certainly not \"hubby\".  It's emasculating.",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -1,
                      "content": "Also, it's just married.  You don't have to say legally married.  Do you think there's such a thing as illegally married?  Wtf is that?",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "chill",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 169,
          "content": "This. NTA. That guy is a sexist, homophobic asshole who got what he deserves. We should not be catering to assholes like this. Especially over something that he is blowing way out of proportion.\n\nAnd we need to stop associating colors to genders other than those of pride flags. Because I hate the color pink and do not want to be associated with it just because I'm a woman.",
          "id": 46,
          "comments": [
            {
              "score": 85,
              "content": "Fun fact: in the past pink was the color for boys and blue for girls. \n\nwww.thevintagenews.com/2019/05/01/pink-blue/amp/%3fcsplit=header&cmp_ab=quantcast",
              "id": 47,
              "comments": [
                {
                  "score": 53,
                  "content": "There was this show I watched where a side character who is immortal sees a dead villain's pink car and claims it. The protagonist comments that it's a little girly, and he tells her that in his time, pink was a manly color.\n\nI forgot the title, sadly. It featured cowboys and supernatural creatures, though. Not Supernatural.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Wynonna Earp.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "So true. It was pink for boys, blue for girls up till about WW2. Thank Hitler for that.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "(Spoiler) Those characters end up having a baby girl and she has a blue blanket and it's a very bittersweet scene and now I'm crying so thanks for that.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yes! Watch Disney's Lady and the Tramp. Lady, the girl dog, has blue bow/collar, etc; while the human baby is a boy but has pink ribbons etc. in his blankets/crib and appears in a pink romper at the end.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 2,
                      "content": "And by the time the 90s live action remake was released, it had flipped.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My daughter calls this \"the olden days\" and in her mind it's the same time frame as horse/buggy and one room school houses.  I love hearing what she learns about the olden days.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Lmao. I'm reminded of when my ex-SIL told me about my niece coming home from preschool or kindergarten with a picture of a rotary phone to learn to dial 911...in 2013ish. I said I'm barely old enough to remember those, and I was 21 or so at the time.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I used to hate the color pink because I hated everything that reminded me of my inability to perform a traditional variant of femininity. Also with a side note of internalized misogyny (thinking I was better because I wasn't \"like other girls\", because being a girl felt like something bad). But since I became an adult and realized I get to decide what being a woman means to me, I've made peace with it, and with the people who enjoy performing femininity in a different way than me. I find it a fun color that makes me happy, these days.\n\nWhich is not to say I expect others to take that exact journey, just that I want to point out that pink gets more than its fair share of hate because it's a color commonly loved by little girls, and the patriarchy says being a little girl is the worst thing possible.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "The irony here is that red and blue are both on the rainbow flag. Pink is not, unless you count the original 8-colour flag made by Gilbert Baker—but that's almost never used anymore.\n\nNTA, and if he holds up to his threat, good riddance.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Yeah if I had seen him walking around with a pink envelope I would have thought 1) love letter or 2) letter from Grandma.  Why would anyone assume the envelopes SOMEONE ELSE SENDS TO YOU are color coated to your sexuality?",
          "id": 58,
          "comments": [
            {
              "score": 14,
              "content": "I have no idea what color the mail my neighbors are getting is because i'm just minding my own damn business.  Except for like 2 weeks when we didn't have our regular driver and we got the packages for the house across the street.  They buy from Chewy and Walmart, just FYI.  Top secret info going out here.  \n\nI ship things for my craft business and use bubble-padded envelopes most of the time.  Print out an address label and then put a fun sticker or two on the package.  I get a lot of great responses on that.  My customers get super excited seeing the envelopes when they check their mail.  \n\nSometimes i use other mailers with fancy prints if it doesn't need the bubble wrap.  The boxes get a sticker on the address label too usually.   ProTip:  Put the address label and sticker on, then tape over with a piece of clear packing tape so the edges don't get caught and peeled off",
              "id": 59,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I personally wouldn't even give it a second thought assuming I would even notice the envelope/its color in the first place",
              "id": 60,
              "comments": [
                {
                  "score": 3,
                  "content": "In my house, the only envelopes that aren't white are handwritten letters (as opposed to bills and whatnot) which are fairly rare.  For this reason a colored envelope (usually pastel yellow for us) would stand out to me a bit.  My first though would be that someone got something good.  (Again, as opposed to bills and what have you)",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "if i see something thats not a plain white envelope i just assume it's a handwritten letter instead of a phone bill or something. i've never known people who send letters to use the plain white envelopes - people like using colourful ones and usually they have a signature style of envelope that they always use (in my experience)",
              "id": 62,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Red + white = pink.  You sent an envelope that was 2/3 his request.  Red + white, just no blue.\n\nNTA what an unbelievable douchecanoe",
          "id": 63,
          "comments": [
            {
              "score": 16,
              "content": "I suggest a light purple envelope — that way you’d hit red, white, and blue!\n\nSeriously though, NTA by far.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "OP should source some nice lavender envelopes just for this guy, and thus provide all his acceptable colors at once.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "OP's gf didn't meant OP was outing him. She meant it as that \"What if his parents see the pink envelope and think he's gay and he's not ready to come out?\"\n\n\nIk it seems far fetched, but trust me, parents like these exist.",
          "id": 66,
          "comments": [
            {
              "score": 74,
              "content": "I don't need to trust a random stranger online to know that bad and homophobic parents exist....\n\nAnd either way, not OP's problem. It's just an assumption that the purchaser is closeted and even if he is, doesn't excuse his toxicity and insecurity about the color of an envelope of all things.",
              "id": 67,
              "comments": [
                {
                  "score": 0,
                  "content": "Never said that it should. I just wanted to clarify of what, imo, went through gf's head when she said that.",
                  "id": 68,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I love genuine crack-up stories like this on here. It's a nice break from the usual bummers",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "OP is definitely NTA, but I still wanna give the buyer a little credit...\n\nI mean, this is obviously some kid buying off their parent's card/account. No freaking way a grown man who still likes pokemon cards complains about getting a pink envelope.\n\nBesides, if I saw a guy getting regular pink envelopes the first assumption is a secret admirer or long distance relationship. It would take the mind of a 8-15 year old kid (read: dumbass) to say something so ludicrous \n\nCan't blame the kid too much they're a kid, even if I don't respect kids I gotta admit they're just not developed enough to know better.",
          "id": 70,
          "comments": [
            {
              "score": 2,
              "content": "Maybe he's sneak buying the cards off his parents account and he's worried his parents will see the pink envelope, their curiosity will be piqued, they open it, and find out that he's been stealing from them. Cuz a pink envelope may very well be a love letter and mom is nosey. Then he'll get grounded and the pokemon cards will be taken away. The end.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Imagine masculinity so fragile that it’s shattered by a paper envelope.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2145,
      "content": "NTA The guy sounds like a mess of bigoted fragile masculinity if the color pink (or anything from the \"gay flag\") offends him.  Even if (big if) he's in the closet, how is a pink envelope to a stranger you outing him?  And why would his neighbors be paying attention to his mail like that?  Your gf's scenario seems pretty far fetched. \nLet's not forget,  he could have stopped ordering and didn't.\n\nEdited to fix typo.",
      "id": 73,
      "comments": [
        {
          "score": 387,
          "content": "It’s going to be really awkward for him if he ever gets a past due notice in the mail. At least where I am, the government ones are still pink.",
          "id": 74,
          "comments": [
            {
              "score": 91,
              "content": "I missed a car insurance payment once, and GEICO sent me a past due notice in a pink envelope.",
              "id": 75,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I thought of pink slip for getting laid off, maybe OP's customer is economically anxious but expressing it in sexuality anxious language",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 319,
          "content": "For real it’s time to retire the “all homophobes are secretly gay” line of thinking. Actually an incredibly offensive thing to say.",
          "id": 77,
          "comments": [
            {
              "score": 67,
              "content": "> For real it’s time to retire the “all homophobes are secretly gay” line of thinking. Actually an incredibly offensive thing to say.\n\nHomophobes are incredibly offensive.",
              "id": 78,
              "comments": [
                {
                  "score": 128,
                  "content": "Yeah no kidding so why are people trying to lump them into the LGBTQIA+ community? It’s like saying all racists are secretly minorities.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Some of the worst racists aren't as white as they'd want to be. Overcompensating is a thing.\n\nAnd there's been a few public cases of people spouting very anti LGBT shit in public (elected officials for example) and caught having gay sex. It's not based on nothing.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "Yeah. To me, it seems to have an implication that being gay is a bad thing.",
              "id": 81,
              "comments": [
                {
                  "score": 10,
                  "content": "There seems to be a trend nowadays of calling someone a homophobe, saying that homophobia is bad, and then implying that said homophobe is actually gay (and implying that it's a bad thing). It does nothing but further stigmatize both open and closeted homosexuals.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Right? No different than \"he's being mean because he likes you\".",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -23,
              "content": "[deleted]",
              "id": 84,
              "comments": [
                {
                  "score": 48,
                  "content": "You're absolutely right, being gay isn't offensive, whether they're out or not.  But I think what they're saying is it's not appropriate to say that everyone who's outwardly homophobic is actually secretly gay. Because it ignores the danger to and mistreatment of the LGBTQ+ community by truly homophobic people. \n\nCorrect me if I'm wrong on this.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 21,
                      "content": "What it also does is absolve heterosexuals from responsibility. If every homophobe is secretly gay, then no straight person is a homophobe and it's not our problem. It's also extremely lazy, since there is no need to examine how these biases persist and fester.\n\nThe problem is that it also works really well as an insult because homophobes are incredibly insecure in their gender and sexuality. Otherwise they wouldn't have a perpetual need to avoid anything even remotely gay or outside their gender norms. So it persists.\n\nIt also persists because there there definitely are the people in power who wield institutionalized phobia to hide their orientation (or actual criminal sexual behaviors) from their supporters.\n\nIt does need to go away as a blanket argument tactic.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "You nailed it friend.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "You missed the point entirely. Being gay isn’t the offensive part, Genius. \n\nFlip it around. If you were to find out someone was secretly gay, would you think assuming they’re publicly hateful, and possibly violent is appropriate?",
                  "id": 88,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "That's not what's offensive here. It's the implication that straight people aren't homophobic that's the issue. It both diminishes the problem of homophobia in society and loads the blame onto the victims.",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "> anything from the \"gay flag\"\n\nThat rules out black, white, and brown with the new inclusive pride flag.  Sorrynotsorry, friend, invisible envelopes for you from now on!",
          "id": 90,
          "comments": [
            {
              "score": 20,
              "content": "Also red and blue, which were specifically requested!",
              "id": 91,
              "comments": [
                {
                  "score": 7,
                  "content": "Well, i mean, yes, hence the invisible envelopes, since all colours, including the red and blue originally mentioned by OP, are verboten by our tightpantied friend.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Honestly, out of all the ridiculous stuff in this post, I am most concerned with the GF's attitude.\n\nWhy is she so bent on defending this guy? Seems like there's some question to be asked there.",
          "id": 93,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Pink isn’t even on the gay pride flag. Unless he means the more recently updated one that includes the trans colors? Pretty up on the queer trends for somebody so homophobic lol",
          "id": 94,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1343,
      "content": "NTA. Masculinity so fragile that he cannot carry a pink envelope from his mailbox to his door. Yeah you were a little petty but it's such a nothing burger that it's difficult to care about something like that. \n\n**Red and blue are on the Pride Flag. Pink is** ***not,*** **so you were literally doing what he asked.**\n\nYour friend is also being silly; when I was in the closet I could carry a pink envelope.",
      "id": 95,
      "comments": [
        {
          "score": 222,
          "content": "OP please respond with this commenters excellent observation in bold and a labelled diagram of the “gay flag”.",
          "id": 96,
          "comments": [
            {
              "score": 17,
              "content": "Make sure it’s the anatomically correct version!",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "He was petty, but not as much as me: I would have put glitter inside all the envelopes. Ooops.",
          "id": 98,
          "comments": [
            {
              "score": 51,
              "content": "I would have bought rainbow envelopes specifically for his orders.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "[deleted]",
          "id": 100,
          "comments": [
            {
              "score": 14,
              "content": "I say take it a step further and do glittery rainbow envelopes",
              "id": 101,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "I am 100% certain the buyer is like 12-15 buying with mommy's card/permission. \n\nNo fucking way an adult who's into pokemon cards complains about envelope color because it's girly or gay.",
          "id": 102,
          "comments": [
            {
              "score": 37,
              "content": "Lol I take it you’ve never been to r/conservative.",
              "id": 103,
              "comments": [
                {
                  "score": -15,
                  "content": "You mean the subreddit that is largely populated by people posting fake nonsense reflecting how they think conservatives/Republicans act/think as opposed to talking to one to know? No, not in a few years. \n\nAs a conservative from a rural area who's experienced a wide breadth of different areas and people, can confirm that grown adults don't act this way in general. The miniscule percentage that do is no more reflective of the whole than the miniscule percentage of the left that do the same. Kids are way, WAY more likely to be. Ehind this one.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "When I worked in a shop, my toolbox was pink and I dipped/painted my tool handles pink.  Had a few guys complain that it ruined what was a ‘manly’ shop but a huge plus was that my tools NEVER went missing and my toolbox never got touched or moved.  The guys were so terrified of using a tool with pink on it that it actually saved me a lot of potential money loss and aggravation.  Win-win honestly.  So I’m obviously +1 on the petty side.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 684,
      "content": "NTA - guess he doesn’t use any fairy type Pokémon either? It’s a fucking envelope",
      "id": 106,
      "comments": [
        {
          "score": 287,
          "content": "Of course not. The fairy pokemon are for girls. He only has ‘Merica pokemons. Reds and blues only. /s",
          "id": 107,
          "comments": [
            {
              "score": 117,
              "content": "Does he know he's supporting a Japanese company by being into Pokemon? That's sooo very unamerican. /s",
              "id": 108,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "As an American, fuck America. It's one of the worst countries ever. Mostly because of the over-blown nationalism people have.\n\nAlso, NTA, OP. This guy is the worst in every way.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "And definitely doesn't use Sylveon, because you can't possibly use a Pokemon the colors of the trans flag.",
          "id": 110,
          "comments": [
            {
              "score": -1,
              "content": "more of an umbreon and jolteon fan myself. only use sylveon for competitive battles cuz pixilate hyper voice and its tankyness is good. but not in a playthrough",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "frickin hate fairy types\n\n\n\n\n\n\n they curbstomp my  dragons and dark types man. thank god for poison jab. also like its the current best type",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 377,
      "content": "NTA. This person obviously has issues. As an eBay seller myself, I would actually block him from buying from you again.",
      "id": 113,
      "comments": [
        {
          "score": 81,
          "content": "Yup, this is the way forward. Dude is making complaints over shipping material aesthetics. I wouldn't want to deal with that headache.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah, ignoring his request gives him, in his own mind at least, the moral high ground. But telling him that he isn't welcome as a customer unless he fixes his heart at least gives him something to think about and forces him to weigh his desire for pokemons against the slim chance his neighbours or loved ones might see him holding a pink envelope for the few seconds every couple of months he carries one from his postbox to his front door.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "block? Hell nah I'll make my pricing super competitive so I'll become the default for the items, which forces him to buy from me, for which ill make SURE I get him a pink envelope, together with penpal enthusiast level of girly sticker decorations",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 214,
      "content": "NTA, how fragile is this muppet’s masculinity?! 😂",
      "id": 117,
      "comments": [
        {
          "score": 29,
          "content": "Don't insult the Muppets like that 😂 they're way more chill than this guy.",
          "id": 118,
          "comments": [
            {
              "score": 11,
              "content": "I've heard of 'muppet' as a generic insult in British English, whereas in American English it just means the Jim Henson puppets",
              "id": 119,
              "comments": [
                {
                  "score": 4,
                  "content": "Ya I'm aware was just funny. I believe using Muppet as an insult still originated from Jim Henson puppets and at first meant more an enthusiastic but incompetent person like some of the puppets are lol but for sure the word use has changed over time.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Dude there is not a straight Muppet.",
          "id": 121,
          "comments": [
            {
              "score": 3,
              "content": "In Supernatural s5 \"Free to Be You and Me,\" Dean Winchester tells Castiel, \"there are two things I know for certain. One, Bert and Ernie are gay.\"\n\nAlso Statler and Waldorf though perhaps that assumption relies on gays and theatre stereotypes",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 200,
      "content": "NTA\n\nWhat does this guy plop down in the front yard, blow and airhorn so all his neighbors come outside...and then proceed to open all his mail in front of them?",
      "id": 123,
      "comments": [
        {
          "score": 96,
          "content": "\"I present to you... *Today's mail*\" \n\n\n*people gasp. Ladies and gentlemen faint. Whisper. Mouth: PINK. — suddenly silence.",
          "id": 124,
          "comments": [
            {
              "score": 14,
              "content": "This is basically how I see HOAs tbh",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "[Video of OP going to get his mail.](https://www.youtube.com/watch?v=EKYz2M6zoII)",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 133,
      "content": "NTA\n\nHonestly I would have done the same thing. I'm kind of laughing thinking about his raging over a stupid pink envelope.",
      "id": 127,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 102,
      "content": "NTA. He should have taken his business elsewhere in the first place if he was sooo upset. I'll bet he's like some other guys I know, who won't even buy pamprin when their GFs are on their period.",
      "id": 128,
      "comments": [
        {
          "score": 37,
          "content": "This anti-pink enveloper has never had a gf. Come on! That would be too feminine.",
          "id": 129,
          "comments": [
            {
              "score": 11,
              "content": "[removed]",
              "id": 130,
              "comments": [
                {
                  "score": -2,
                  "content": "And if the guy doesn't have a girlfriend or tries flirting with you, what do you think  then?\n\nMen with a fragile sense of self commonly concern themselves with whether an outfit makes them manly enough, and it really doesn't matter if you think k they're taken or not, as it means your interpretation is that they aren't available as a dating option (be it for them having a girl already or them seeming overly feminine), which just reinforces the idea that pink makes them feminine/gay/etc because they can't read your mind to know it's because you think they're taken instead of because they're \"fruity\".\n\nSimply put, your assumption demonstrates that wearing that kind of thing affects perceptions of them, which is ultimately the thing they worry about, even though it really shouldn't matter if a dud wears pink or not.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Here's a secret: a random man on the street is not going to be interpreted as a dating option by a woman, period. Strange men that randomly talk to you on the street are threats, not potential partners. If you're close enough with a man to date him, you're close enough to know if he's gay or taken.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Pamprin might be ok because it comes in a blue package. Midol comes in a pink one, though, so he can’t buy that one. Also he can’t buy Benadryl or Pepto Bismol.",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Wtf is pamprin?",
          "id": 134,
          "comments": [
            {
              "score": 2,
              "content": "Personal out of context guess: \"something period related\".",
              "id": 135,
              "comments": [
                {
                  "score": 3,
                  "content": "Well obvs but my wife has issues with her periods so if theres something that helps id love to know about it ya know?",
                  "id": 136,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Pamprin is comparable to Midol. Helps with cramps and bloating.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "It's an anti-inflammatory medication (it's Midol, legit it's just a different name, same active ingredients) marketed for the use of pain relief and symptom easing medication to reduce discomfort from a menstrual cycle. \n\nIt's absolutely garbage. Take a shot of alcohol, it works better. \n\nNow Pamabron is the actual ingredient which is an NSAID like ibuprofen or aspirin. It is combined with acetaminophen so it's similar to an  Excedrin. \n\nMidol/Pamprin also has a diuretic and an antihistamine while Excedrin has caffeine combined with the NSAID and acetaminophen.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "+1 This dude can stop buying from you at any point in time. Keep taking his money until he does. NTA.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA\nSend an apology letter….in a pink envelope.",
      "id": 140,
      "comments": [
        {
          "score": 6,
          "content": "And flowers. Praline box — pink, too.\n\n\n\n\n..Maybe balloons displaying some uterus.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}