{
  "post content": "My (26F) sister Anna (24F) married my friend Lance (27M), he was the cool guy in our friend group, handsome, misterious, smart, quiet. I don't know how he ended up with my sister, she's the total opposite, loud, funny, outgoing. She's beautiful tho, really beautiful, and when they got together everyone said how good they looked.\n\nAnna seemed to be really in love with him ALL THE TIME, she used to say how dreamy he was, how good he treated her and how spoiled she felt, but Lance was always so stern and quiet, she would revolve around him at family gatherings but he wouldn't engage that much with everyone but me and her. I was surprised when he asked her to marry him.My sister never took the wifey role too serious, she had a non-traditional wedding and Lance when along with it, she made a bunch of rules that he agreed to and then they moved to his house. Anna banned house utensils from the wedding gift list, she doesn't work, didn't finish her studies and they don't plan on having kids.\n\nMy sister is pretty much only into her looks (And I didn't think Lance cared for that before), she's always on Snapchat or Instagram, I thought that after getting married she would dress more appropriate since she used to use crop tops, blouses, dresses and shirts that showed her cleavage, short skirts or tight jean, but she says that Lance likes her just fine.\n\nLast week was my dad's birthday and we had a party, my sister and Lance came and she was wearing a pretty short floral dress, nonetheless most of the men were looking at her including my dad's friends, Lance was as stoic as always and my sister came to my mom and I and saying that she didn't know why he was so quiet since he's not like that (HE is like that wtf) so I told her that if she didn't dressed like that he might take her more seriously.\n\nShe got sad and sat quietly the rest of the night and I didn't think much of that, but a few days ago Lance texted me and said that he would appreciate if I didn't comment on her wife's way of dressing again. ??? Did I miss something?\n\nIM NOT IN LOVE WITH HIM",
  "id": 1,
  "comments": [
    {
      "score": 55206,
      "content": "The misogyny is coming from within the house.\n\nDo them all a favour and leave them both alone. YTA, oh my god are YTA.",
      "id": 2,
      "comments": [
        {
          "score": 28694,
          "content": "Older sister watches younger sister nab the hot guy friend and then SO COINCIDENTALLY decides that there is a frumpy wife dress code her sister should adhere to.\n\n\nMisogynistic AND insecure, what a combo!",
          "id": 3,
          "comments": [
            {
              "score": 6642,
              "content": "Right. This sounds like it was written by the woman in 27 Dresses.",
              "id": 4,
              "comments": [
                {
                  "score": 5341,
                  "content": "Yes!\n\n\"She's beautiful tho. Really beautiful...\" I could hear that in my head like a voiceover in a terrible movie.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3540,
                      "content": "100%. Then I made up this whole montage in my head of OP watching from the sidelines as her crush falls in love with her beautiful sister.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2425,
                      "content": "After she said her sister is funny and outgoing like those are horrible traits and her beauty was her only redeeming quality. 🥴",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 262,
                      "content": "Like in the mean girls movie voice! Your pick of anyone of them.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 762,
                  "content": "Nah, because in 27 dresses the sister completely lied about who she was. OPs sister is just being herself and got the man, and OP is still upset by it.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 533,
                      "content": "Yes.  OP is genuinely baffled by how her hot, good-for-nothing, rules wielding sister could get this smart, mysterious, handsome man. \n\nMarcia Marcia Marcia.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 251,
                      "content": "Valid point. I just think that OP’s perception differs from reality. She seems to think that her sister somehow tricked the guy into marrying her.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "I was thinking the exact same thing!",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "The sister might be into Lance. And by might I mean is.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1525,
              "content": "Despite saying she’s not, OP clearly has a thing for the husband and is jealous of her sister.",
              "id": 14,
              "comments": [
                {
                  "score": 1302,
                  "content": "She may be telling the truth when she says she doesn't have a thing for the husband, but she certainly seems envious of her sister's situation.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 176,
                      "content": "Love the username!",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "She definitely feels she’s more deserving of what her sister has, since she’s less attractive and wears potato sacks.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "It's a sweet deal, no job or kids. I'm jealous haha",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 918,
                  "content": "Oh totally. She puts her sister down at every point she can. She knows little about their lives and makes assumptions. \n\nMaybe Lance was just having a bad fucking day or sick and tired of how OP stares at him.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 222,
                      "content": "Lance probably suspects OP has a thing for him and might even being quiet to avoid engaging with OP as much as possible w/o being rude.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 54,
                      "content": "Or maybe he thinks OP is annoying. I have been quiet around people who won’t shut up and it’s mostly because I know if I open my mouth it will go something like “oh my god SHUT UP ALREADY.”",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "Or just isn't as comfortable in large social situations?",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "[deleted]",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Right?? When OP said \"HE is like that wtf\" like....sorry love, but Anna probably knows Lance a little better, considering she is the one married to him.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 218,
                  "content": "Marcia, Marcia Marica... YTA.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Hahaha I was totally thinking, \"OK, Jan....\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "I'd also argue that OP doesn't really _know_ her BIL. I'm married to a dude who, in social situations where he isn't close to the people or isn't very comfortable, could be described as stoic, or even cold. This is not who he is when we're alone or among friends, but around my family? He's definitely The Masked Version of The Husband, and BIL here reads like that to me. (Seems weird that his wife thinks this is weird, but maybe I'm projecting too far. ¯\\_(ツ)_/¯)",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1492,
              "content": "OP is soooo convinced she knows Lance better than her sister, his actual wife does. \n\n\"(HE is like that wtf)\" OP consider, even though, you were his friend, he might share more of himself with his wife. \n\nYou act like your sister steamrolls everything, like he doesn't have a say. You can write in all caps that you are not in love with Lance, but the rest of your post shows otherwise. It reeks of jealousy. And your jealousy is nasty and misogynist.\n\nYTA OP.",
              "id": 28,
              "comments": [
                {
                  "score": 535,
                  "content": "Also, Lance was definitely giving sis the lance in that sexy sundress when they got home. YTA.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 274,
                      "content": "I was thinking that to. What if it's their thing? He wants her to dress how she wants, he loves when others look at her. Its a I have a hot wife you dont *don't know how else to phrase it*",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 411,
                  "content": "The (HE is like that wtf) got me too.\n\nInsider secret: mysterious, quiet guys are not mysterious and quiet when you're the one in a relationship with them. They can actually be quite talkative once they know you are interested in what they have to say and supportive enough not to judge them.\n\nPlus, you know, body language can say a lot when you know them well enough. Even when he looks like he's quiet, I can see a whole conversation happening.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 199,
                      "content": "As someone with a quiet spouse I can confidently confirm that even after 8 years together I would not say any of my family actually know the 'real' personality of my wife. She's reasonably sociable with them and obviously they know various details about her, but she acts almost completely different when it's just me and her.\n\nIf her personality was only what my family witnessed we most likely wouldn't be together, but she's so funny and charming when it's just us and her personality with just me is what I fell in love with.\n\n100% guarantee that OP has no idea what either her sister or her husband is like behind closed doors. It's highly likely that the sister isn't all about looks like she thinks she is, OP just doesn't get to see that side while the husband does.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Exactly. Everyone said my husband was this serious quiet guy… and I thought so too when we first met since he was actually trying to play it cool with me. Turns out he’s the biggest goofball. I imagine Lance might be more playful in private and adores his wife’s energy.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Maybe Lance just doesn't like talking to OP?  \n\nI could write a whole speculative story about how Lance tolerated OP in the friend group because he had a crush on her sister and OP was how he got to know the sister and ask her out and they fell madly in love.  But Lance is still uncomfortable around OP (who is now his SIL) so he is very quiet as he doesn't want to interact with her.  And none of it would contradict any of the actual facts in the OP.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 18,
                      "content": "The simpler narrative I’m running with (based on ages) is “Lance is an introvert. Sister is an extrovert. It can take a realllllllly long time for extroverts to *get* that introverts are often nervous/shy at parties.”\n\nSome people *never* get it. My folks had a couple friend who, in their damn 60’s, one of them still didn’t get why their spouse didn’t want to go to social events all the time.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": ">You act like your sister steamrolls everything, like he doesn't have a say. You can write in all caps that you are not in love with Lance, but the rest of your post shows otherwise. It reeks of jealousy. And your jealousy is nasty and misogynist.\n\nThis is why I'm SO glad Lance himself put her in his place. He's perfectly able to air any concerns he has with his actual wife - no need for OP to read into his actions or take it upon herself to lambast his wife on his behalf. She's not his guard dog.   \n\n\nUgh it's PAINFUL when friends or family get posessive like this. Like, no matter how long you know someone,you don't necessarily know them better than their life partner. FFS",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "they *might* not be in love with lance, but they're 100% jealous of their sister's marriage to him if that's the case. guessing lil sis got married first and its a thorn in her side, especially when she's still showing up as the hottest women in the room and getting all the looks even while taken.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1263,
              "content": "\"She's funny, outgoing and beautiful, really beautiful.  I don't know what he sees in her.\"",
              "id": 38,
              "comments": [
                {
                  "score": 497,
                  "content": "Yeah, those are all positive qualities, so why is OP so confused why her friend ended up with her?",
                  "id": 39,
                  "comments": [
                    {
                      "score": 345,
                      "content": "Because he’s mysterious.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Because OP is \"not like other girls\"",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "He's quiet and serious and she's outgoing, how can that possibly work???? Opposites can't possibly attract!! \n\nA quiet guy would obviously want to be with another quiet boring person in his life so they can sit around and not say anything to each other! \n\nAnd why would a guy want a woman that every other guy looks at and finds attractive???\n\n/end sarcasm",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "“she doesn’t work, didn’t finish her studies, and doesn’t want kids.” like ??? so irrelevant? i think lance knew all that going in ?",
                  "id": 43,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Translation: \"She doesn't live her life the way I think she should live it.  She's not as worthy of Lance as I am.\"",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 909,
              "content": "Absolutely this. YTA. Don't obsess over her husband. Get a man for your own.",
              "id": 45,
              "comments": [
                {
                  "score": 23,
                  "content": "And some therapy. Yikes.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 643,
              "content": "There was another one like this a few days ago, family was concerned new daughter in law dressed too sexy to be a proper new mom/wife. Like, once you snag a man, put those b**bies away! Your body is only for him now!",
              "id": 47,
              "comments": [
                {
                  "score": 418,
                  "content": "Right! She got him like that so why must she cover up? He knows how she dresses. I hate that WOMEN have to tell other women that they have to dress frumpy when they get married. \n\nHow did the OP think she was NOT the AH here?",
                  "id": 48,
                  "comments": [
                    {
                      "score": 12,
                      "content": "She's already got one man, she doesn't need to advertise and tempt other men! \n\n/s",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 141,
                  "content": "I thought this, this is the second \"you're a wife, you can only dress a certain way now\" in the last few days. Unless this is the same person doing research for a novel or something.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 30,
                      "content": "It’s apparently a pretty common idea. My little sister just told me on Monday that I can’t wear miniskirts anymore because I’m “old and married.” And I was like, excuse me, my husband happens to like when I wear miniskirts, thank you very much. \n\n\nAnd the skirt wasn’t even that mini! It’s just a mid thigh denim skirt! I could understand, maybe, if I was wearing the one I used to wear as a teenager where the pockets were longer than the skirt, but geez. \n\nAlso, mid thirties is not old. Rant over.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "Yeah. And it’s almost implicitly saying, it’s like they’re almost meant to snag him, but once that job is done they serve no other purpose. So fucked up.",
                  "id": 52,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "Trifecta- also jealousy!!!",
              "id": 53,
              "comments": [
                {
                  "score": 11,
                  "content": "Envy, actually. Envy is where a person wants what another person has for themselves. Jealousy is when a person is afraid someone will take what they already have.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Hm, as long as we’re nitpicking, I would argue that she’s both envious and jealous. OP perceives herself as having some ownership or connection to Lance—she’s afraid Sis will take it away. Now, she never had it—you know it, and I know it but she doesn’t—so in reality she’s envious but in her warped mind she’s jealous.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "It’s so strange, my mysterious husband gets quiet at parties when I wear jeans…",
              "id": 56,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Yeah I don’t understand why some women think that the girl we fell in love with should change who she is after we get married. Doesn’t that sound odd?\n\nTbh, shit doesn’t really change until kids.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "All i could think reading this was.\n\nOP wants sisters husband.\n\nOP wants sisters husband.\n\nOP wants sisters husband.\n\nMisogyny, Jealousy and Insecurity. What a dream combo.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1259,
          "content": "[removed]",
          "id": 59,
          "comments": [
            {
              "score": 1184,
              "content": "OP cannot stand that her sister is beautiful and gets attention and found a husband that is confident and comfortable with their relationship and how she dresses. OP wishes she was her sister and is becoming a bully because of it instead of being an adult and getting over it.\n\nOP, he chose her for a reason, not you. it's not personal. get therapy and grow up and stop trying to bully other women out of being confident and happy.",
              "id": 60,
              "comments": [
                {
                  "score": 689,
                  "content": "And gasp, no kitchen stuff at their wedding. She won't cook for her man! \n\nI'm clutching my pearls. Somebody bring me a church fan and water!\n\nEdit to say I just watched the OG Julia Roberts Sweet Magnolias and the Queen Latifah Shell Magnolias last night and it may have just shown in the comments. Lol",
                  "id": 61,
                  "comments": [
                    {
                      "score": 351,
                      "content": "I love how OP keeps saying \"He's not like that /he's like this /he doesn't think like that\" statements like she knows his mind better than he does. No OP, you're just PROJECTING your own opinions on someone. Someone you don't know. Seems like she's saying stuff based on how she's 'idealised' him in her own mind. She's totally into him.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Honestly,  I'd might say no kitchen stuff if we were getting married and not because we don't both love cooking but we are lucky enough to have a full kitchen already. Most of our utensils and equipment are either good quality and or sentimental so I wouldn't want to replace them and there just aren't any gaps!",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "I absolutely love to cook.  But I would not want my wedding registry to be filled with fish spatulas and pizza cutters (and as a guest, I hate when I am late to the registry and that’s all that is left).",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 338,
              "content": "OP wants it to be a Taylor Swift video where he belongs with her because he's the cute guy she's friends with and she's the girl who understands him more than anyone. He belongs with her in the end, can't you see?! \n\nYou don't know what people are like within the context of their individual relationship. You don't know him like his *wife* knows him.\n\nHe chose her, OP needs to get over it.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1215,
          "content": "Totally. This whole post is judgey and OP was obviously lying in wait for the first opportunity to tell her sister exactly how she felt about her. Keep your nasty thoughts to yourself, OP, JFC.",
          "id": 66,
          "comments": [
            {
              "score": 1094,
              "content": "[deleted]",
              "id": 67,
              "comments": [
                {
                  "score": 839,
                  "content": "LOL I thought that was so random too. Ok… maybe they already have enough utensils, so what!?",
                  "id": 68,
                  "comments": [
                    {
                      "score": 596,
                      "content": "I’m getting married in July and we’ve said we don’t want wedding presents because they’re traditionally household items. We both moved out of parents houses at 18 (we’re now 37) so we’ve got everything we need. \n\nTotally understand the no utensils rule.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 163,
                      "content": "Or they really don't want multiple mismatched sets, and frankly there's nothing wrong with that either.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 181,
                  "content": "Yeah, fork her!",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 100,
                  "content": "Lol, I don't even have a wedding registry. We have a list of charities we are asking people to donate to cause we already have enough crap.",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 843,
              "content": "Also the fact that OP thinks she knows lance better than his wife???\n\nLike Anna saying “he’s not like this” and OP saying he is. Like girl you are NOT married to him! You don’t know how he is all the time. I imagine his wife does….",
              "id": 73,
              "comments": [
                {
                  "score": 394,
                  "content": "This is what I was hooked on too. OP should realize that maybe she’s never really known Lance, and her sister knows him completely because they’re married. \n\nOP and Lance we’re probably not as good of friends as OP likes to think they were, and even if she isn’t in love with him (which I don’t believe) she’s mad that her sister is closer to her “friend” then she ever was.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Maybe Lance is always quiet at family gatherings because the family are misogynistic assholes. Note how judgy OP is over the *woman* setting household rules.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": ">This is what I was hooked on too. OP should realize that maybe she’s never really known Lance, and her sister knows him completely because they’re married.  \n>  \n>OP and Lance we’re probably not as good of friends as OP likes to think they were, and even if she isn’t in love with him (which I don’t believe) she’s mad that her sister is closer to her “friend” then she ever was.\n\nBut also, your relationship with friends is DIFFERENT - you've usually not lived together, and you certainly haven't spent every day together, planning a life together. A relationship involves a different intensity of finding out what someone is like, and often a different level of intimacy from many friendships.  \n\n\nI have friends I've known for like 20 years, some of them have been very honest/close friendships, but I would never presume to say that I know them better than their partner, even if their partner has known them for a much shorter time. Likewise, there are things I know about my partner that even his closest friends don't know. It's how life is.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 188,
                  "content": "Seriously. My boyfriend around me and my boyfriend around other people are like two totally different people. I'm pretty sure if I described how he is with me, no one would believe me.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 26,
                      "content": "This was my thought. Lance probably doesn't like crowds.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "When my grandma met my dad for the first time he was very quiet and standoffish. She asked my mom why she liked him and my mom told her that he was so fun and made her laugh all the time. My grandma had a very hard time believing that. Turns out he was just nervous because he and my mom were “living in sin” and he thought my grandma would be upset about it, she wasn’t. Even now if you aren’t his family he still seems very intimidating. \n\nOP YTA! I’ve been married for 10 years and have a kid, but still wear crop tops and like to have fun. Figure out how to unpack your massive jealousy and get your nose out of your sisters relationship.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "My husband is incredibly shy and quiet around others. Around me from the start he's sarcastic, funny, and yet no one would believe it.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I completely thought this...when you live with someone, are in love with each other etc you 'reveal' the real you to them. Lance has only ever shown op his public face, she has no idea what he's like behind the scenes.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "They sound like my husband and I. I'm very quiet usually. Introverted. My husband is the type of guy who's social, outgoing, and easy to like. I honestly get overwhelmed in a lot of social situations, usually I just follow his lead because it's so natural for him. \n\nAt home, I never stop talking. I'm comfortable and outgoing in my own space. \n\nOP seems to have romanticized her sister's husband into some Mr. Darcy character. Clearly she doesn't know him as much as as she thinks she does.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 572,
              "content": "Not only that, she's really reaching. So desperate to find anything to knock her sister down she's resorting to 1. Her clothes. Won't someone think of the poor menfolk - where shall they look?!? 2. She hasn't changed, or made herself smaller, upon marriage. Which is apparently what the wimmin are supposed to do. And, my personal favourite, 3. Banning kitchen utensils on a wedding registry. \n\nBurn the witch!",
              "id": 83,
              "comments": [
                {
                  "score": 128,
                  "content": "She just wanted a bunch of reasons to attack the sister she is CLEARLY jealous of.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "4. Establishing rules before moving in together, a totally normal and healthy thing everyone should do before moving in with someone",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 306,
          "content": "there was a post just like this not to long ago, with a jealous sister mad that her sister didn't start dressing more conservatively after getting married. she tried to argue she couldn't be misogynistic because she was a woman.",
          "id": 86,
          "comments": [
            {
              "score": 39,
              "content": "Damn. I think I became more confident in my marriage and dress way less conservative than I did before. It's almost like a healthy relationship can build you up and encourage you to be yourself",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 177,
          "content": "Wow, a women who hates on and shamed other women, how refreshing.\nYTA, find something else to occupy your time than your sisters marriage.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "Waves of jealousy a hundred metres high!",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": " Y U P",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "She was wearing a pretty short floral dress & men still payed attention to her 😱😱😱\nOP seriously needs to examine her internalized misogyny, & envy of her sister. I'm quite sure she is just as beautiful in her own way, but her poor self image, & taking on attributes that are not her own have allowed her to slip into a state that projects itself as less attractive, even tho that may not really be true, at all. OP needs to fix herself & stop focusing on what she *thinks* (has convinced herself) is wrong w/her sister. OP is TA.",
          "id": 91,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "EXACTLY! It is a HUGE logical leap to jump from “he’s quiet today” to “you dress inappropriately.” There’s literally no connection there. Since you were clearly wrong about your conclusion, it literally only came for a place of misogyny and THAT is what makes you the AH. Not you being in love her husband (though you clearly are in love with your BIL.)",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "There is this conservative belief in multiple societies that a woman's body should be used only to attract a mate, at which point that body is only for the eyes of her mate.\n\n This, of course, reduces a woman merely to her body, and a piece of property to be either desired or utilized by the man in her life. And it's perpetuated not just by men, but as we see here by the women who were held back too and don't want anyone else to have what they didn't.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23997,
      "content": "Does Lance know you have feelings for him? Cause it's either that or you're some 1950's housewife time traveling to the future. YTA",
      "id": 94,
      "comments": [
        {
          "score": 6481,
          "content": "I think OP is only just admitting to herself that they have feelings for Lance because of this post",
          "id": 95,
          "comments": [
            {
              "score": 5256,
              "content": "I legit thought this was a troll because this was written as so obviously in love with him and then at the end all caps IM NOT IN LOVE WITH HIM like honey if you’re being serious here please examine this post because I have never seen someone called “mysterious” outside of cheesy romance movies. Who tf calls a guy hot and mysterious?? Wtf does mysterious look like?",
              "id": 96,
              "comments": [
                {
                  "score": 1678,
                  "content": "Disturbingly possessive and unhappy any time a significant other shows signs of having an existence that doesn’t revolve fully around them, judging by OP’s interpretation of Lance’s secret inner thoughts.  Which tracks with Edward Cullen, Heathcliff, et al., so…yeah.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 521,
                      "content": "Don't forgot Christian Grey.😳",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I definitely had to go google Heathcliff because all I could think about was the cartoon cat and I was incredibly confused 😂",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 829,
                  "content": "[deleted]",
                  "id": 100,
                  "comments": [
                    {
                      "score": 578,
                      "content": "Mysterious also means she doesn't know him that well so she can project the perfect guy in her mind onto him because he doesn't do anything to break the fantasy. \n\nMy guy is probably an introvert and doesn't do much to stand out in uncomfortable situations and she's built up what he's 'really' like behind closed doors, which just happens to be someone whose personality is perfectly in line with hers.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 109,
                      "content": "......I hate how much sense this makes, but at the same time, that means that pretty much every celebrity is 'misterious'",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 641,
                  "content": "No, it’s worse. He’s “misterious.” That’s the term for when a man is mysterious. OP wanted to be Mrsterious, but it didn’t work out for her. Bummer.  \n\nEdit: Thanks for the award, kind stranger!",
                  "id": 103,
                  "comments": [
                    {
                      "score": 126,
                      "content": "That was awful but I liked it",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Dad?",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 196,
                  "content": "Stoic and grumpy according to OP - in which case my husband is the epitome of “mysterious”!",
                  "id": 106,
                  "comments": [
                    {
                      "score": 15,
                      "content": "TIL I'm mysterious.\n\nWoohoo go me",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I feel like my husband and the husbands of most of my friends are now getting rebranded to \"mysterious\". Spoiler alert- many many men (men who are happy in their marriages and their lives) are stoic and grumpy.  My husband has been joking that he is one week away from \"get off my lawn\" territory since we were in our late 20's.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Mysterious is a quality that indicates that you'd like to get to know someone much more closely- to solve the mystery.\n\nOtherwise it wouldn't be mysterious, they would just say \"hard-to-read\" or \"too quiet\" or something else.\n\nPeople also don't use 4 positive adjectives in a row to describe someone unless they have *some sort of feelings*.\n\nJust the language choice alone of the post indicates she has feelings for him. The problem is she may never have had strong enough feelings to act on them. But now her feelings of jealousy and inadequacy related to her sister are amplifying her perception of the guy. A sibling you're jealous of or have a complex about can trigger your FOMO really easily.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I've met quiet people, I've met surly people.\n\nIf one of my friends was quiet and restrained, I would have asked them if everything was okay. Obviously, OP's sister is worried about her husband, and sees him as more than his silence. OP has no such problems and couldn't be bothered.\n\nIf someone didn't care a whit about me as a person, I'd come across as quiet and mysterious to them too.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Mysterious looks like Robert Pattinson",
                  "id": 111,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Which just further cements the “OP has no idea what Lance is actually like in private” theory, because Robert Pattinson in private is apparently someone who will almost destroy his kitchen trying to microwave pasta.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": ">Who tf calls a guy hot and mysterious?? Wtf does mysterious look like? \n\nMy understanding is normal + quiet = boring. Hot + quiet = mysterious.\n\nEdit: oh, ugly + quiet = creepy",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I can accept she isn't in love with Lance, but it's only because I'm pretty sure she hates her sister. Like in the post she is very anti-sister way more than pro-Lance, almost like she is pulling him up just to highlight \"bad\" traits of her sister.",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17719,
      "content": "YTA, she likes how she dresses, her husband likes how she dresses, it’s their marriage and none of your business getting involved",
      "id": 115,
      "comments": [
        {
          "score": 3107,
          "content": "This! \n\nYTA op. \n\nI smell jealousy",
          "id": 116,
          "comments": [
            {
              "score": 552,
              "content": "Simply and beautifully put. This is exactly the point. OP YTA.",
              "id": 117,
              "comments": [
                {
                  "score": 45,
                  "content": "Sister: my husband is quieter than usual today\n\nOP:  No he's not! \n\nSister: I wonder if somethings wrong\n\nOP: well you're a slut \n\nOP's defines jealous",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2603,
          "content": "It’s so two utterly unrelated things as well.\n\n‘I don’t know why he’s so quiet at this party!’\n\nOp: ‘Maybe because you’re wearing a dress!’",
          "id": 119,
          "comments": [
            {
              "score": 994,
              "content": "I mean OP has a point. If her sister dressed like a nun I'm sure Lance would be talking a lot more and saying things like \"I love you, but why are you dressed like a nun?\" And \"seriously though, where did you get the nun costume it's the middle of march?\"",
              "id": 120,
              "comments": [
                {
                  "score": 1021,
                  "content": "Personally, I always keep a set of nun's clothes on me, just a habit.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 226,
                      "content": "Sounds like you're pretty religious about this!",
                      "id": 122,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "Get thee to a punnery!",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 193,
                  "content": "You had me in the first half.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 535,
              "content": "Yeah, why tf would it have anything to do with what sister was wearing? Apparently sister always dresses like that.",
              "id": 125,
              "comments": [
                {
                  "score": 343,
                  "content": "Also the talk about him not \"taking her seriously\", wtf? They're at a party, it's not like she's giving a presentation at a board meeting so how is that relevant? But in any case, if Lance doesn't respect her Anna should get out of her marriage. (Note that it doesn't sound to me like that is an issue here, I.e. it sounds like Lance does respect Anna and this is just OP's projection, but if that is seriously what OP thinks then why is she not telling Lance off).",
                  "id": 126,
                  "comments": [
                    {
                      "score": 145,
                      "content": "He IS taking her seriously. Seriously enough to marry her! \n\nJesus Christ OP.  YTA. Stop being so jealous and mind your own business.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 362,
              "content": "Also \nOP: there's definitely nothing wrong because he's always stoic. But instead of telling my sister that, I'm going to take this opportunity to shame her about something unrelated that I don't like, even though that's DEFINITELY not the problem. AITA?\n\nYTA",
              "id": 128,
              "comments": [
                {
                  "score": 70,
                  "content": "I got the vibe that Lance is always stoic around OP, and not in general based on his wife’s comments. I wonder if OP makes him uncomfortable.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 13,
                      "content": "He’s probably picked up on the obvious fact that she is into him and doesn’t want to fan the flame. The word for what he is is probably ‘reserved’.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "\"he's always stoic' OP is assuming she knows Lance better than her Sister, even if he's 'always' doesn't mean there isn't something off; his wife would notice this.   So maybe Lance is annoyed that his FIL's buddies are drooling over his wife but he's not going to ruin his in-laws party over it, or maybe he has a headache, or had a bad day at work.  None of that is 'your husband doesn't take you seriously!\" OP has a huge crush on her BIL",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 58,
              "content": "That made me laugh",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "“I’m tired of doing the emotional labor in this relationship and always keeping the conversation going.”\n\n“Have you thought about putting on pants, you slag?” \n\nOP: YTA",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "It sounds like he's just introverted. The sister spent the time to learn who he was while OP didn't so now OP is just in love from the sidelines. RIP",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">‘I don’t know why he’s so quiet at this party!’\n\nOP, staring and obsessing over him.\n\n>Op: ‘Maybe because you’re wearing a dress!’\n\nGee, maybe it's because he's uncomfortable? Just a wild fucking guess.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1112,
          "content": "Exactly. This post is brimming with jealousy. So, OP's sister is exceptionally beautiful, outgoing, funny friendly etc - but OP can't understand why someone they find attractive would want her? Sounds like they are a wonderful couple that balances each other.\n\nOP was clearly looking for a reason - any reason - to insult her sister since the sister's comment had zero to do with her marriage, relationship or attire. \n\nOP, you dont know Lance as well as his wife does (since you seem to think you do) Your sister is his wife, partner, confidant. As a casual \"friend\" you are just an outsider looking in - that's it.\n\nThey are married so he clearly loves her and takes her plenty serious. He has also clearly told you to back off and mind your business, so that should be a massive hint that your opinion on his marriage and wife's attire do not matter one bit.",
          "id": 136,
          "comments": [
            {
              "score": 490,
              "content": "Jumping off this to say Relationships where one is outgoing and the other is timid are truly the best types of relationships in my opinion. But maybe I'm biased. Im the token extrovert and half of my friends are introverts I've \"adopted\", my girlfriend and I share the same dynamic. \n\nI also noticed that OP believes that their sister was wrong when she said \"Lance is more quiet today\". Which is so damn weird to me. Who knows Lance more, the person who married him, or someone from a distance? To others, my girlfriend seems very very quiet all the time. And she is quite timid, but she TALKS! She socializes, she's not a rock! So I can tell when she's not talking to an abnormal amount.",
              "id": 137,
              "comments": [
                {
                  "score": 325,
                  "content": "My late husband was a quiet, stoic, studious thinker around all his friends and even his family - but when it was just me and him (or me him and the kids) he felt free to be playful, silly, boisterous, childlike and loud. \n\nAnd if I described him that way to most people who'd met him, they would call me crazy and insist I must be talking about someone else. It's actually very lonely that the loveable goofball I miss so much, is someone so few people got the opportunity to see.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I’m sorry for your loss. It sounds like you had some really wonderful times and it’s beautiful that he felt so comfortable with you.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "My older brother is like this. In the right mood or after a beer, he can relax and be droll and funny as fuck and I adore him, but I remember over the many years of his marriage feeling so happy that his default state around his wife and children was the sweet, silly, fully one we only saw when he was in the right mood.\n\nTo be able to relax and be yourself around your spouse & family is ideal, in my opinion. I suspect that's the kind of relationship most folks want.\n\nEdited: I'm really very sorry for your loss. I hope you're doing as well as possible, my friend.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I’m sorry, he sounds lovely. I’m sure you carry his memory around like a happy special secret no one else gets. \n\nI’m dating someone like that now. I sometimes try to get him to engage more for that very reason- it’s a bummer so many people who know him don’t get to see the funny person he is. But that’s him and how he feels safe so I don’t push it. As long as I get to go home and giggle with him it works for me.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": ">It's actually very lonely that the loveable goofball I miss so much, is someone so few people got the opportunity to see.\n\nI'm sorry for your loss. Please don't feel that you can't share that side of him. They may  not have seen it, but I am sure they have seen your love for each other.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": ">Exactly. This post is brimming with jealousy. So, OP's sister is   \nexceptionally beautiful, outgoing, funny friendly etc - but OP can't   \nunderstand why someone they find attractive would want her? Sounds like   \nthey are a wonderful couple that balances each other.\n\nThe old trope, \"Opposites attract\" is a trope because a lot of the time it's true. I'm the outgoing, friendly, charismatic person who is insanely attracted to men who are quiet, introverted, and stoic. It's like I'm a balloon ready to float away and they're the string keeping me tethered to this world.\n\nOP is absolutely jealous and needs to reexamine how she is allowing her jealousy to ruin her relationship with her sister.",
              "id": 143,
              "comments": [
                {
                  "score": 9,
                  "content": "The balloon and string example is how I’ve always thought of my husband and myself. Thanks for putting it into words!!",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "I had to reread it to try to figure out what the issue was. I still didn't find it.",
              "id": 145,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": ">OP was clearly looking for a reason - any reason - to insult her sister since the sister's comment had zero to do with her marriage, relationship or attire.\n\nTotally agree.  I also don't even get how him not socializing at a party means that he doesn't take her seriously?  What does that even mean?",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": ">she didn't know why he was so quiet since he's not like that (HE is like that wtf)\n\nThis part honestly confused him so much. Lady, you don't know him, you've only seen him at public events, what do you know about what he's like??",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 502,
          "content": "But WHY is a woman supposed to dress differently after she gets married? Like is she not allowed to like “pretty floral dresses” anymore because she is a wife? Marriage in US sounds like a hoot.",
          "id": 148,
          "comments": [
            {
              "score": 235,
              "content": "I think OP was angry that the old men present couldn't stop staring at her crush's wife's cleavage.",
              "id": 149,
              "comments": [
                {
                  "score": 126,
                  "content": "[deleted]",
                  "id": 150,
                  "comments": [
                    {
                      "score": 33,
                      "content": "And obviously the person at fault is her sister. \n\nWow. Just. Wow.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 47,
                  "content": "\"Even my dad's friends.\" Like damn OP if you want old men to stare at your cleavage also just put on a dress",
                  "id": 152,
                  "comments": [
                    {
                      "score": 42,
                      "content": "I'd bet money OP doesn't want to be stared at, and she doesn't want her sister to be stared at, but instead of being upset that her dad's friends are pervy f's she's blaming the woman like she was taught to. I'm not saying for sure, but she seems like that kinda misogynist",
                      "id": 153,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 189,
              "content": "Don’t you know literally the only reason to dress in anything other than a potato sack is to enslave a man in marriage? That’s our sole purpose in life, gotta get that dick. Doing it after marriage just means you still want dick and you’re a slut. \n\n/s obviously, but that’s how a lot of people actually feel.",
              "id": 154,
              "comments": [
                {
                  "score": 27,
                  "content": "Omg, that’s right! I completely forgot, how silly of me!\nI’m personally not married, but have been in a relationship for 7 years so I should probably find my potato sack out of respect, don’t you think?",
                  "id": 155,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Yes but you can compromise and put flowers on it.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I hate that you had to put /s there.  Because sadly, you are right.",
                  "id": 157,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I'm married and only wear turtle necks and ankle length skirts now.",
              "id": 158,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Yes, I hate this nonsensical belief that partners should stop dressing hot for each other (I’m including men here) just because of marriage vows! If anything, it’s more important to dress to impress your spouse. Does OP think a couple’s sex life has to die for marriage too??\n\nAnyway, OP is clearly just jealous of her sister’s beauty.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 166,
          "content": "Honestly, jealousy issues or sisterly envy or whatever aside, this is really what it comes down to. OP, you write as though your sister just drags her husband along in life and that he has no say and/or doesn't even really like her or her decisions. You may know them both very well, but you don't know their marriage. Stay out of it. YTA",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12369,
      "content": "YTA.\n\nI don't get how you went Lance being quiet to the way your sister dresses... He could just have had a long day or somehting on his mind.\n\nYou sound jealous of your sister and kind of in love with Lance.\n\nMaybe if you weren't so bitter, men would look at you too...",
      "id": 161,
      "comments": [
        {
          "score": 5999,
          "content": "Or he’s quiet bc he is uncomfortable around OP since she is in love with him",
          "id": 162,
          "comments": [
            {
              "score": 1630,
              "content": "Kinda felt that way too with the tone.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1140,
              "content": "He might've been quiet because he knew people would look at his amazingly beautiful wife and wanted to make sure nobody crossed the line so she could have fun. I don't think he cares about how she dresses, he clearly likes it",
              "id": 164,
              "comments": [
                {
                  "score": 650,
                  "content": "OP literally says that being quiet is his personality with family, so not sure why she feels an explanation is necessary (“He is like that wtf”).",
                  "id": 165,
                  "comments": [
                    {
                      "score": 817,
                      "content": "Because she wants to make sure that people know she thinks she knows him more than his wife does.",
                      "id": 166,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 644,
              "content": "That was my thought as well. Lance is quiet when he’s uncomfortable and isn’t that into group activities/uncomfortable around OP. He opens up when he’s with his wife cause he loves her/can relax around here. Every time OP tries to demonstrate how well she knows lance in this post it really backfires. \nBut him being quiet and respecting her clothing choices have nothing to do with each other, OPs just been waiting to get that dig in.",
              "id": 167,
              "comments": [
                {
                  "score": 281,
                  "content": "I was thinking that perhaps Anna brings out a more joyful,spontaneous side of Lance, while OP’s presence throws cold water on it. \nMy maternal uncle and his wife were married 52 years before he passed away. She was serious; he was jovial. He was a single Navy sailor; she a hard working divorced mom. He was mixed European heritage; she was of French Canadian descent and spoke no English until she was 7. He was Protestant; she was Catholic and he gave way to the kids being raised in her religion (they adopted one after they married). He fell in love with her on sight and couldn’t think of any other woman from that fateful evening on. They married four months later and he legally adopted her children. Their personality traits balanced each other beautifully.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 144,
                      "content": "He was a punk, she did ballet, what more can I say 😄\n\nJk, they sound like a lovely couple! And yes totally agree that Anna probably brings a lighter, freer air with her by the sounds of it",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yeah, it reminds me of my grandparents. My mom always said that her aunts and uncles loved my grandfather because he helped my clinically anxious grandmother relax. He made her feel comfortable and by extension made it easier for her to have fun. \n\nOP is describing Lance like he’s the man from a Jane Austen novel but forgetting that those men always end up falling in love with the free-spirited female protagonists, in spite of their differences.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "I thought about that too. Especially when OP sister inquired why he is quiet but OP tried to say “he is always like that” yeah i doubt it. Pretty sure your sister knows him in a way you don’t",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 602,
          "content": "YTA. \n\nMy fiance and I are the opposite, I'm quiet, I rarely* engage in conversations with his family unless they ask me something. I stay mostly with him and his nephew. He's outgoing and talks with everyone. \n\nJust because the husband in the post was quiet it doesn't mean he was jealous or annoyed with his wife's clothing choices? Some of us just don't like socializing too much. This was a party where op's family and her dad's friends were present, I would be quiet and reserved as well",
          "id": 172,
          "comments": [
            {
              "score": 203,
              "content": "It sounds like something might have at minimum stopped him feeling very social, since his wife noticed.\n\nBut like yeah wtf on jumping to the clothes?! Particularly if someone's not outgoing to begin with, it could be something as simple as being tired. I'm quite outgoing but if I get tired I just stop wanting to talk my vocabulary just crumbles.",
              "id": 173,
              "comments": [
                {
                  "score": 79,
                  "content": "To be honest I took her comment to mean that he was not quiet at home so she finds it kinda shocking he is in public.\n\nBut honestly there are a ton of ways to take that comment and him being mad at her dress was the last thing that came into my mind",
                  "id": 174,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I figured it could just be because he's at a party with a lot of people he doesn't know, whereas he's usually more social with those he does know. Pretty typical introvert.",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "Same here with my fiance, love his family but I'm pretty shy and will generally stick by him and his brother during family gatherings. To me it sounds like her \"revolving\" around him at family gatherings paired with him only engaging with his wife and OP is her actually being considerate and sticking with him during what could be an awkward situation for him.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Same here. I’m that way my husband is the louder attention one and I can tell when someone is feeling a little ✨fRiEndLy✨op yta",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 206,
          "content": "Yeah, I don't understand the correlation since Lance has apparently always been \"quiet and mysterious\" yet OP is now trying to blame that on how her sister dresses ... which it seems like Lance was familiar with, and was happy enough with it to marry her sister.",
          "id": 178,
          "comments": [
            {
              "score": 24,
              "content": "Maybe Lance just doesn't like OP. I mean, if she's confused that he's acting distant when OP has always thought he's distant... IDK maybe you think he's like that because you make him like that.",
              "id": 179,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "It doesn't even make sense. The sister says Lance is being quiet, OP tells us, the reader, that he's always quiet, but instead of saying \"he's always like that\" she decides to say maybe \"if she didn't dress like that he might take her more seriously.\" OP was clearly looking for any excuse to call out her sisters wardrobe, and Lance obviously took her seriously enough to marry and support. That's even ignoring the obvious that if Lance is being quieter than normal that could be caused by any number of things. OP is totally the asshole and probably seriously damaged her relationship with her sister over petty slut shaming, when in all likelihood her sister wasn't even wearing anything that outrageous, a \"short floral dress\" isn't exactly showing up in s&m gear.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "My guess is that OP thinks that Lance had a hard time with the dad’s friends ogling his wife (at her father’s birthday party, ick), and was extra-quiet as a result. However, even if that was so, it’s not the wife’s fault for her dress, and Lance isn’t blaming her though OP clearly is.\n\n“I didn’t see anything unusual but I’m sure what’s wrong with him is this thing about you I don’t like” — way to insert yourself, OP.",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 55,
          "content": "Sounds like the guy has hit the jack pot with her sister and is doing everything in his power not to say the wrong thing lol.",
          "id": 182,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I can’t help but feel like OP saying that he usually hangs out with her during family events really means she follows him around like a sad puppy begging to be noticed. Come on now OP, this post drips with your envy.\n\nShe’s obviously never heard opposites attract either, it’s very normal to have partners balance each other out by one being quiet and withdrawn and the other being loud and extroverted. \n\nThe only reason you think they’re so wrong for each other is because you have a crush on your brother in law. Knock it off.",
          "id": 183,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Imagine these old 50+ men staring at a 24 year old woman, and OP blames the woman for her clothing. Classic misogyny.",
          "id": 184,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "I don’t get how him being quiet = “doesn’t take his wife seriously”. I was expecting something like him ignoring her opinion or downplaying her job or something. Not “is quiet at a party”. \n\nThe fact that OP considers his silence normal while his wife does not says a lot on its own.",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8157,
      "content": "So how long have you been in love with your brother in law? YTA",
      "id": 186,
      "comments": [
        {
          "score": 1948,
          "content": "My first thought!! Such an elaborate description of him.\n\nEdit: not to mention you seem jealous of your sister!",
          "id": 187,
          "comments": [
            {
              "score": 893,
              "content": "It didn't hit my mind untill I read that \"I'M NOT IN LOVE WITH HIM\" at the end tbh.\nYou are in love with him. Why else would you add it so all of a sudden.\n\nAnd also YTA. I am an older sister too. I also don't always agree with what my sister is wearing. But it's her style and she likes it. It's not my place to be complaining about it.\n\nEdit: omg I woke up to so much more upvotes then I expected to get for this. Thanks guys :)",
              "id": 188,
              "comments": [
                {
                  "score": 213,
                  "content": "There was actually no need to add ‘I’m not in love with him’\nSounds like a guilty conscious to me",
                  "id": 189,
                  "comments": [
                    {
                      "score": 44,
                      "content": "I think she edited the post to add that part after getting lots of comments saying she was in love with him. She's totally in denial.",
                      "id": 190,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 61,
                  "content": ">he was the cool guy in our friend group, handsome, misterious, smart, quiet\n\nI got that far before I was thinking 'he's your sister's husband, not yours'.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 28,
                      "content": "The way she looks down on her sister for, among other things, not finishing her education…but OP herself can’t spell “mysterious” 💀",
                      "id": 192,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "I was thinking “ohhh she got it bad for Lance” then I got to that line. I then thought “ohhh she REALLY got it bad for Lance”.",
                  "id": 193,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "\"she married my friend\" \n\nRight off the bat, something's fucky with that description",
              "id": 194,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 898,
          "content": "Of course OP's not in love with Lance. It's just that he couldn't possibly be interested in OP's exceptionally beautiful, funny, outgoing, and friendly sister since he's also so good looking, smart and mysterious! I mean, it's not like he would ever genuinely marry her or anything since she dresses so not like a wife and uses social media. Don't let me get started on Crop Tops - everyone knows wives must wear mom jeans and sweaters. It's like a rule.... The marriage must be a farce. And, it's obvious the sister doesnt really know this guy, since OP knows him inside and out and the sister is just some rando that he lives with. /s",
          "id": 195,
          "comments": [
            {
              "score": 145,
              "content": "Don’t you know when they signed the marriage license it has a clause saying “only mom jeans and sweaters for you, hun!” /s",
              "id": 196,
              "comments": [
                {
                  "score": 26,
                  "content": "Obviously! I'm starting to think reddit doesn't respect the sanctity of marriage! #WivesWearMomJeans /s",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "Since becoming a wife I have exclusively worn my wedding dress because that’s what wives wear.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 103,
              "content": ">everyone knows wives must wear mom jeans and sweaters.\n\nIt's *especially* funny considering the sister is **24**.  Not that those of us in our 30's (or beyond) are obligated to wear a specific set of clothing either, but lol.\n\nThis post is, honestly, exactly why I come here.  RIGHT IN MY VEINS.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Not to mention the ban on cooking utensils from the wedding list. Tsk tsk.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 467,
          "content": "But he's so *mysterious*",
          "id": 201,
          "comments": [
            {
              "score": 300,
              "content": "mistirious*",
              "id": 202,
              "comments": [
                {
                  "score": 9,
                  "content": "Was going to say this, LOL",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "It also could be a \"jealous her sister is married and 'ahead' in life\" thing. It could be unrelated to the husband.  I have witnessed a friend have a really bad reaction to learning I was engaged.  She became aggressive with me and criticized almost everything I did.  It was early enough that no wedding planning had really begun so it wasn't a case of unreasonable bride syndrome. I ended up losing a friendship of 16 years because unbeknownst to me, part of her ego was attached to me being \"behind\" her in life and me getting married was leaping ahead. Fast forward to present day- she moved into the town where me and my family live now. She is still single and has a child. She is wayyy crazier than she used to be and it seems like that friendship would have ended sooner or later anyway.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Not as long as she’s hated her sister.",
          "id": 205,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "LOL FOR REAL! \n\n“I was shocked when he proposed” why?  Cuz you thought it would be you?\n\nShe also made it seem like her sister was obsessed with this dude, like some creepy childhood crush and she “wore him down”\n\nI also think OP didn’t expect him to defend her sister like that",
          "id": 206,
          "comments": [
            {
              "score": 8,
              "content": "The defense part is the wildest thing about this. \"Everyone involved in this situation says I'm wrong but I don't think so. Plus, I'll argue with everyone in the comments who doesn't just agree with me. AITA?\"",
              "id": 207,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7940,
      "content": "YTA- get over your jealousy",
      "id": 208,
      "comments": [
        {
          "score": 901,
          "content": "*envy",
          "id": 209,
          "comments": [
            {
              "score": 332,
              "content": "Could be both, but jealousy is also correct.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "In terms of the dictionary definition, both are correct. In terms of the definition in psychology then envy is correct. \n\nBut let's be honest, most people are not trying to distinguish between the two.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 223,
          "content": "The jealousy in this post is **intense**\n\n>Lance is handsome, mysterious and quiet. My sister is beautiful, funny and outgoing. I have no idea what he sees in her.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5522,
      "content": "She's a grown ass woman,  she can dress how she wants\nYTA\n\n(ALTHOUGH the men in the house need to show some respect and not perv on her)",
      "id": 213,
      "comments": [
        {
          "score": 2008,
          "content": "Exactly! Not to mention, she’s literally 24. Of course she’s dressing like a young woman, SHE IS! OP is weirdly outraged that getting married hasn’t changed her sister’s style from fun to unflattering. She sounds super jealous. YTA OP.",
          "id": 214,
          "comments": [
            {
              "score": 695,
              "content": "In particular, I don't know how people got it into their head that someone should change something fundamental about themselves the moment they get married. Didn't the other person choose to marry them because they are the way they are? What's the logic behind changing that the moment the knot is tied?!",
              "id": 215,
              "comments": [
                {
                  "score": 350,
                  "content": "She's now 'owned by a man' therefore should be in floor-length skirts and high-necked frilly blouses 🙄\n/s",
                  "id": 216,
                  "comments": [
                    {
                      "score": 35,
                      "content": "When he cheats it'll be because she didn't try enough and got so frumpy after marriage.",
                      "id": 217,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "I hate that i actually felt I needed at least one of the /s and emoji",
                      "id": 218,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 227,
                  "content": "I think it stems from the line of thinking that women who dress in skirts and crop tops are only doing it for male attention and not just because they enjoy the way they look in them",
                  "id": 219,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I’ll admit that I do it for myself *and* male attention. But the only male attention I care about is my boyfriend’s enjoyment. It’s not my concern or problem if other guys notice I look good too. \n\nAnd on the flip side, I love that my boyfriend dresses well for both himself and me. \n\nI expect us both to continue this after we marry someday, or it’d be a dull marriage I want no part of.",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "I’m not convinced they are.  I think OP’s jealous that her sister tends to fare better than her in social situations, and is desperate to twist that into something negative.  (But if they are being pervs, it’s not Sis’s fault, and certainly nothing to do with Lance.)",
          "id": 221,
          "comments": [
            {
              "score": 27,
              "content": "They're probably looking at her. A \"loud, outgoing, funny, beautiful, really beautiful\" woman wearing \"a short floral dress\" is gonna get looked at at a party. \n\nShe is, ostensibly, aware of this, and her husband, if he's a smart and secure fellow, is cool with this.  \n\nThe differences between looking/oogling/leering/perving/appreciating/noticing/glancing/staring is an interesting topic and one that changes over time and between cultures but the reduced version of \"people look at pretty people\" is a universal constant.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "They're probably not disrespecting her. This is in the OP's head. She is so jealous of her sister that she created a scenario where the sister is blamed for everything.",
          "id": 223,
          "comments": [
            {
              "score": 41,
              "content": "Yeah sexist leering totally happens but also sexist assumptions that people are leering also happens.",
              "id": 224,
              "comments": [
                {
                  "score": 7,
                  "content": "Yeah, leering is a real phenomenon that happens all too often. Intent changes a stare into a leer but it is almost unknowable from an observers vantage point. \n\nThe objective is to show respect with how we look at others. But the line is very mobile given a person's culture, sex, or outfit. \n\nIn regards to policing it I personally find there's just an area of discomfort in supposing whether I can dictate that another person may look at me based on what I wear. Freedoms ideally should not impose restrictions on others.",
                  "id": 225,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "I’m also a little bewildered why OP thinks her sister is in the wrong for dressing attractively, but doesn’t have a problem with men *her father’s age* openly checking out married sister at a family party?",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4549,
      "content": "Yes you did miss something. It's called \"mind your own business.\" You are way, way, way too involved in your sister and her husband's marriage dynamic and he told you so. YTA. \n\nI don't want to try to read too much into what you wrote but here I go anyway I guess. You sound kind of jealous like you think you know him better and that she isn't right for him.",
      "id": 227,
      "comments": [
        {
          "score": 1289,
          "content": "Agreed. Except she continually proves in just this post that she really doesn’t know him well at all, and most of her description of him (handsome, quiet, mysterious) sounds more like “he’s hot and doesn’t talk to me much beyond surface level.”",
          "id": 228,
          "comments": [
            {
              "score": 532,
              "content": "My partner was always described as quiet /even keeled - what it actually was?  Being paralyzed in anxiety. He was always worried about making the wrong decision,  so he'd rather just go along with what anyone else would want",
              "id": 229,
              "comments": [
                {
                  "score": 222,
                  "content": "This, my bf is like this unless he's in spaces he feels comfortable in, his personality does a 180° whenever we are able to be with less people",
                  "id": 230,
                  "comments": [
                    {
                      "score": 82,
                      "content": "My fiance is the same way. In public (for the most part) he's pretty quiet and recluse. At home? Sometimes I can't get him to shut up lol. He is completely different.",
                      "id": 231,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Same with my husband! He's very quiet and introverted when around people he isn't super comfortable with, but around me he is boisterous and chatty. It's cause he feels comfortable around me! It is absolutely bonkers to me that OP seems to think she knows her sister's husband better than her sister does (the person who literally lives with him and sees him every day in private).",
                      "id": 232,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yeah, mine is like this not based on number of people, but who they are. His old friend group from when we met thinks he's Silent Dude, and he is, whether 2 or 25 of them are around. Then we made a few new friend groups and he became the life of the party. It's remarkable to watch him switch on and off based on who we are around and his comfort level with them.",
                      "id": 233,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 238,
              "content": "\n> “he’s hot and doesn’t talk to much beyond surface level.”\n\nNot to OP anyway 😂",
              "id": 234,
              "comments": [
                {
                  "score": 23,
                  "content": "IKR. Deadass OP thinks he's like this with his wife. Bet she assumes that they just sit there silently every day because he's MYSTERIOUS and SILENT  and NEVER TALKS. lol  \n\n\nWait til she finds out they have sex. LOL",
                  "id": 235,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Yes! There was supposed to be a “me” in there. That’s what I get for typing while distracted.",
                  "id": 236,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Could you imagine someone describing their partner as “mysterious”. I may be quiet and mysterious to people I barely know, but my partner knows all the weird songs I sing to my dogs, the dances I do while doing chores, and how much I love being the little spoon. I’m not mysterious to her AT ALL",
              "id": 237,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "How can you claim to be on equal friendship levels with Lance and your sister and then also say you were surprised by Lance's proposal and not **see** that you are not on the same level?\n\nThis reads like a 16-year-old younger sister who is mad AF about her 20-something sister marrying a dreamy guy.",
              "id": 238,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "Everyone make note that in the very first damn line she says \"my friend Lance\" and not \"OUR friend Lance.\" So obvious... YTA",
          "id": 239,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "Right? Seems like OP just straight up doesn’t acknowledge the legitimacy of their relationship. He makes it out to be superficial and loveless but her husband standing up for her is a perfect example of a loving relationship so ???",
          "id": 240,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3269,
      "content": "You dont know the guy based on what you see at family functions. People are completely different around their inlaws than they are around their own friends or alone with their partner. He obviously isnt quiet around her, just her family.\n\nAlso, they probably know about your crush on him now and your jealousy towards your sister. \n\nIf this is real, you've f-ed up your relationship with them so well done. \n\nAlso, you're sexist.\n\n**YTA**",
      "id": 241,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2707,
      "content": "You’re making a lot of presumptions about their relationship, just myob clearly if there is an issue that wasn’t it.",
      "id": 242,
      "comments": [],
      "relation": "No"
    }
  ]
}