{
  "post content": "Non-native speaker here.\n\nThe title can be misleading but let me explain myself.\n\nMy gf (22F) an I (23F) have been together for 2 years. I have been dying my hair for 3 years now, and from the time we got together I always asked my gf, what color does she want for my hair. When I had ideas, that she didn't like, she always told me and I've never get them done, even tho, I wanted to. For some time now, I wanted to get a buzzcut, but she always told me in an insulting and really hurtful manner, that she wouldn't even hold my hands when we walk or she will walk beside me, because I'll look bad and she won't like my hair that way, etc. And she was dead serious about these comments. Her insults countinued, until I got rid of this idea all together, because she simply killed my joy and excitement.\n\nNow, she got this idea some months ago, that she wanted to dye her hair black and red. I honestly hated this from the get go, because I don't like red as a hair color, at all, and I told her in a respectfull manner, that I don't like this idea, and don't want her to have this type of colour. She told me, to suck it up, and that she will do it, no matter what I say. She knew, how my feelings were towards this topic, but she always brought it up at random points in our conversations, which escalated into arguments every time. At one time, she told me, she don't care, if I get a buzzcut, and she is sorry, but I think it's just a way to make me feel bad, for not liking her idea and asking her, not to do it, because she \"gave me permission.\"\n\nYesterday she got her hair done, and I feel really bad. I don't like how it looks, and frankly, she hurt my feeling as well, because If I respected her hurtful wishes, why couldn't she do the same thing?\n\nI told her, that after what she has done, she had no right, to be mad at me, and that I'm really angry, but she told me, that it's her hair, and she can do what she wants, despite her ongoing insulting.\n\nAITA for arguing with her on this topic?",
  "id": 1,
  "comments": [
    {
      "score": 435,
      "content": "ESH. Neither of you should be controlling the others appearance. You should be supportive of each others happiness.\n\nIt also sounds like your girlfriend is emotionally abusive and manipulative. Get the heck out of there.",
      "id": 2,
      "comments": [
        {
          "score": 36,
          "content": "Thank you for your reply.",
          "id": 3,
          "comments": [
            {
              "score": 67,
              "content": "I understand being frustrated with the hypocrisy, but do you really think it's healthy to be telling our partners what is or isn't okay to look like? Wouldn't you be concerned if a friend came to you saying they didn't do ___ because their partner said they couldn't and got angry/distant until it was agreed?",
              "id": 4,
              "comments": [
                {
                  "score": -39,
                  "content": "I never gave her an ultimatum, I told her my wishes, that as I respected her opinion, she should respect mine. As i mentioned in another comment, I think, I could let the red thing go, if she wouldn't have fucked with my hair things this way.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 27,
                      "content": "You decided to tell her that you didn't want her to dye her hair due to your personal preferences, which is basically what she is doing to you(granted, her abusive behavior paired with it makes her more of an AH here). Although its cool to have preferences, it's not really cool to push it onto our partners. You were both doing that here in some way. \n\nI don't fault you for getting angry. Nobody should deal with their partner telling them what to do with their bodies. But if there is an issue, it needs to be actually addressed. It sounds like the issue is her controlling and manipulative behavior towards you. What do you think will be a way to approach this situation where both parties can stay calm, and you both can walk out with some sort of compromise? Is that even possible with her? If not, you should be running. \n\nI should clarify, the majority of my previous response wasn't about you. Do you believe your girlfriends behavior towards you regarding this subject is in any way healthy? I am honestly very concerned reading about how she treats you.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "If you're gonna throw a temper tantrum when she doesn't do what you want, it's basically an ultimatum",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I’m sorry but you two really need to learn how to communicate and stop acting like teenagers! Both of you are to worried about your appearance! Life is to short to worry about petty shit like this! Also she sounds like she’s the boss because you do what she says and she does whatever the hell she wants!",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Also, get the buzzcut. Regain your independence",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 95,
      "content": "ESH. Stop trying to control each other. It’s toxic and pathological.",
      "id": 10,
      "comments": [
        {
          "score": 5,
          "content": "thanks for the comment.",
          "id": 11,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 41,
      "content": "ESH. All relationships require boundaries, even romantic relationships. No relationship should involve infringing upon bodily autonomy.\n\nI also like to dye my hair (and my husband has preferences) but he’s never ever told me not to get something or withholds affection from me if I choose a style he doesn’t like as much. Meanwhile, my husband likes to grow a full beard different periods of the year and I prefer him with a goatee. I’ve let him know that I prefer him with a goatee but I don’t withhold affection from him when he grows a full beard.\n\nI think your girlfriend is using a little bit of a historical double standard that men traditionally/historically have policed or been pretty controlling over women’s bodies. So there’s also that background dynamic. That could be why she sees it as different, but the truth of it is you both need to respect each other’s boundaries and preferences.",
      "id": 12,
      "comments": [
        {
          "score": 12,
          "content": "to be honest, I think I could suck up my hatred for red hair, if she didn't behave the ways she did. I want to like her hair, but all I can think of is her insults towards me. But thank you for telling me your story, I'll think about it.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 28,
      "content": "NTA, your gf is hypocritical and you should definetly get a buzz cut. You'll look amazing.",
      "id": 14,
      "comments": [
        {
          "score": 7,
          "content": "Thank you:)",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 21,
      "content": "ESH. She shouldn’t tell you what to do with your hair but neither should you tell her what to do with hers. Just let eachother do whatever you want with it and you will put an end to all the appearance related fights",
      "id": 16,
      "comments": [
        {
          "score": 3,
          "content": "thanks for your comment.",
          "id": 17,
          "comments": [
            {
              "score": 8,
              "content": "Like, it’s not forbidden to express your opinion but you(or her) cannot insist on it.For example, I like my husband with beird but if he shaves it all, I won’t be mad at him. He likes me more with blonde hair than with dark color but he isn’t angry with me when I change it",
              "id": 18,
              "comments": [
                {
                  "score": 7,
                  "content": "To be honest, I think my anger comes from the fact, that I did everything how she wanted and now she doesn't care about my opinion, at all.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I understand. If I were you I’d just forget all about it and make a deal with her to not fight ever again about physical appereance, I’d say ‘I’m ok with whatever you do with your hair, if you want my opinion you can always ask me, but please respect my choices as well’",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I'm odd I think. Granted I'm straight, but when it comes to hair? I've had loooonngg hair forever. I don't have a choice. I look like a bridge troll with short hair. Anyone ELSE?? You do you boo!!! It's YOUR HAIR!! We're a couple and you wanna Mohawk? I'll be the first one there!",
          "id": 21,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "NTA your'e girlfriend has double standards. If she is allowed to do with her hair as she pleases then so are you.\n\nIf I were you I would set her down to talk about your feelings once more because if she keeps insulting and disrespecting you , you need a better girlfriend",
      "id": 22,
      "comments": [
        {
          "score": 7,
          "content": "Thank you, maybe I'll try.",
          "id": 23,
          "comments": [
            {
              "score": 7,
              "content": "I don’t think you should MAYBE try, you need to do, why are you with someone who won’t be seen as your partner in public over a hairstyle? And who insults you constantly.",
              "id": 24,
              "comments": [
                {
                  "score": 1,
                  "content": "because I love her. I know, that her behaviour in these situations isn't the best, but it doesn't mean, that she is like this in every aspect of our love life.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Isn’t the best. I don’t think you see how abusive and controlling it is. And if your not seeing this abuse for what it is, I worry you are missing a lot of others.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 14,
      "content": "ESH. It’s effing hair. Get over yourselves please. You’re controlling each other and are not in a healthy relationship.",
      "id": 27,
      "comments": [
        {
          "score": -2,
          "content": "I understand that it's hair, but i am not afraid to admit, that looks matter in a relationship. She is beautiful as always, but I can't get over the fact, that she behaved this way with me, and then get her hair dyed.",
          "id": 28,
          "comments": [
            {
              "score": 7,
              "content": "Vapid and immature. If you truly loved your partner, it wouldn’t matter.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "Yes, it's her hair to do what she wants with. AND I hope you learned something and now realize that your hair has always been yours to do what you want with. Stop letting her boss you around. \n\nEnjoy your buzz-cut.",
      "id": 30,
      "comments": [
        {
          "score": 2,
          "content": "Thanks for the comment.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "mild ESH but your gf is much worse. if she really loves you, she would want you to do whatever makes you most happy and confident in your appearance. the same goes for you, but she took it much further with insulting you.\n\nplease stop letting your gf hurt you and control what you do with your body! the fact that you say she \"killed your joy and excitement\" about getting a haircut that would make you happy is really sad. that isn't normal or healthy. does she act like this about other things?",
      "id": 32,
      "comments": [
        {
          "score": 6,
          "content": "The problem is, she sometimes does. I have a more shy manner and like to chose my words carefully, to not hurt her in any kinda situations, but she usually  speaks before she thinks and can say really hurtful things, even though, later she regrets them.",
          "id": 33,
          "comments": [
            {
              "score": 3,
              "content": "She sounds abusive tbh. Saying sorry later doesn't doesn't help, if she keeps going like this.",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "yeah, that's really terrible :( i'm sorry she does that to you. you deserve someone who respects you and wants you to be happy, and you don't feel like you have to \"be careful\" around!",
              "id": 35,
              "comments": [
                {
                  "score": 6,
                  "content": "you are a really kind person, thank you.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA. \n\nIf it was me, I would not hold hands with her or be seen in public with her. But not because of her hair... Because she's a shitty partner for imposing double standards.",
      "id": 37,
      "comments": [
        {
          "score": 4,
          "content": "thank you for the comment.",
          "id": 38,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}