{
  "post content": "I(28m) have a sister (30f) who is marrying in 1 week and a half from now, she and my parents are kinda conservative but nothing too much,exept her fiance(33m) is evangelical and realy religious. We never got along well and had a lot of discussions, he realy disagree with a lot of me and try to change me, like for exemple my bissexuality, political views, lack of religion in my life etc.\n\nWell here's the problem, when my sister anounced her wdding i was happy for her despite my problems with her fiance, but when i received the invitation tô the cerimony came a lot of rules like no drinking, no drugs, and men should cut the hair short and have no facial hair, aparently this are evangelical rules her fiance imposed.\n\nWell i have a long hair for a men right now its on my shoulders lenght, and been letting it grow for almost four years now, i immediately contacted my sister and said that I could do the other rules but I wouldn't cut my hair I been styling for four years over one day for religious beliefs are not even mine.\n\nShe started to try to convince me to do it and that men shouldn't even care about their hair that much, she said that as her brother and a important person in the wedding i would be embarrassing them with my hair and that i should leave this rebellious fase behind especially if i wanted a better job(currently a school teacher and loving my job lmao).\n\nWe discussed and fought a lot over the week about it and I ended up saying that if she did not want me as myself I simply wouldn't go, she said she would take my invitation off if I could not do that.\n\nwell 4 days later she texted me saying I was still invited, apparently my parents pressured her to make an exception for me because she would regret not having me there(I never asked for that they did it on their own). But now both sides are calling me an asshole for creating all this drama and my inability for conceding especially my parents who agree with my sister and fiance but think me not going would be worse.\n\nSo aita ?\n\nUpdate:\n  \nSo a lot has happened between my post and now, I want to start thanking everyone for trying to help and giving suggestions, I never expected to get that much attention.\n  \nOn to the update, I have indirectly caused a lot of drama again, my aunt has two sons with longer hair who would not attend beacause of the rules, as soon as she heard of the hole situation with me and my exception, she got realy mad at my sister, calling her hypocrite, manipulated a lot of things, as she says if I can go she should just take off the hair rule and that her sons had the same rights,  now the family started to fight some supporting my aunt and me saying the rules and control are being to much.\n  \nHer family and some family members closer to her cut contact and will not attend anymore, this was a shock to my sister, as she already had lost two bridesmaids and 1 ring bearer beacause the rules for women.\n  \nWell my sister is realy depressed over all this and the hole cerymomy feels like it will be a fiasco. I also won't be able to go as I tested positive for covid yesterday.\n  \nSo that's it for now thanks for all the support",
  "id": 1,
  "comments": [
    {
      "score": 3079,
      "content": "Nope. Your future brother-in-law can impose whatever religious disciplines he likes on himself. He doesn't get to impose those on anyone else.\n\nIf they don't want some long-haired hippy socialist at their wedding, they don't have to invite you ;)\n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 2215,
          "content": "If they don’t want a hippie socialist at their wedding, then Jesus is right out.",
          "id": 3,
          "comments": [
            {
              "score": 317,
              "content": "Omg! Came here to say the same.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 227,
              "content": "A *long haired* hippy at that!",
              "id": 5,
              "comments": [
                {
                  "score": 465,
                  "content": "A middle-eastern, Jewish, long-haired hippy. What kind of a Jesus do your sister’s future ILs believe in, anyway?\n\nOh right, *American* Jesus.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 219,
                      "content": "Even American Jesus had long hair and a beard",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "Fun fact! Historically, Jesus would have had short hair and a beard. He likely would not have had long hair due to various Jewish laws ([this page](https://www.christianity.com/wiki/jesus-christ/did-jesus-have-long-hair.html) explains it well). The long-haired depiction of Jesus is a product of art, not fact. In other words, Christians just up and decided that Jesus, who was rather crucially a \"real man\", would be best depicted with long hair.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "Republican Jesus",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Ask if he takes usury.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Buddy Christ!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Long haired freaky people need not apply",
                  "id": 12,
                  "comments": [
                    {
                      "score": 16,
                      "content": "So i tucked my hair up under my hat, and I went in to ask him why",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "My hair like Jesus wore it,\nHallelujah, I adore it",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "IN A DRESS!!!",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "You forgot Brown there. Pointing that part out really grinds the evangelicals gears",
              "id": 16,
              "comments": [
                {
                  "score": 44,
                  "content": "I do love a good Evangelical gear grinding.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I’m so sad that I gave away my free award. Please accept my adoration!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "🤣🤣🤣",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I was going to suggest you dress as Jesus.",
              "id": 20,
              "comments": [
                {
                  "score": 7,
                  "content": "\\*OP enters men's clothing shop\\*\n\n\"I'm looking for your wedding robes and sandals...\"",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I have a Pentecostal friend with the same beliefs as OP's future BIL.\nHer church doesn't believe Jesus had long hair",
              "id": 22,
              "comments": [
                {
                  "score": 82,
                  "content": "But they can't deny him having a beard as Roman soldiers are described as pulling it out in the gospels during his torture before his execution.  Which makes the clean shaven reqirement hypocritical if they want to emulate Jesus.\n\nOf course if someone did start a religion based on the life and teachings of Jesus,  Christians wouldn't stand for it.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Someone did. My friend grew up in that cult. They tried to be Jewish AND Christian to honor Jesus \nShe'd never even seen Fern Gully until she was 25.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Ohhh! You are right!!!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Do they also refuse to wear pants (for women?) and keep women's hair long? 😁",
                  "id": 26,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yes. No jewelry except a wrist watch, some women wear a wedding ring. No makeup or hair dye but for some reason a perm is OK",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "A crew cut? A fade?",
                  "id": 28,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Above the ears and collar, not that Jesus wore collared shirts",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Best comment ever",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Maybe OP should ask if they will be removing any Jesus symbols cause you make a good point",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Was going to say the exact same thing",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Jesus should have cut his hair, he looks like a god damn commie!",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 236,
          "content": "My religion doesn't let me do that = Okay, fine.\n\nMy religion doesn't let you do that = Fuck off.",
          "id": 34,
          "comments": [
            {
              "score": 5,
              "content": "Chicken dinner!",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 217,
          "content": "Thank you I realy laughed at the hippy socialist coment lmao",
          "id": 36,
          "comments": [
            {
              "score": 92,
              "content": "Remember when people ask WWJD, the answer is flip tables and start riots. (And whip bankers)",
              "id": 37,
              "comments": [
                {
                  "score": 41,
                  "content": "And bring wine.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Chill with a retired hooker?",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Gotta give us the rules for the women,  please!\n\nNTA BTW.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "upvoted for \"long-haired hippy socialist\"  -  every wedding should have at least one.",
          "id": 41,
          "comments": [
            {
              "score": 63,
              "content": "And every wedding should have at least one convivial biker like the one who wandered into our sister's wedding. The wedding was in a national park, and as soon as the fellow saw it was a wedding, he was like \"So sorry! Didn't mean to intrude!\" And we were all \"Hey the more the merrier. Here, have a beer!\" It was a great wedding. And all the better for including a wandering biker.\n\nETA: He had long hair *and* a beard. And my conservative granny loved him.",
              "id": 42,
              "comments": [
                {
                  "score": 16,
                  "content": "Well you never know! Who was that mysterious stranger, that your family kindly accepted into the midst of your celebration? Jesus as a biker dude having a beer, hmmmm? Considering what I was reading  in the New Testament as a child, I always thought my stuffy Southern Baptist church would have thrown Jesus out on his ear if he walked in, on Sunday. With long hair, wearing a robe, no less. Accompanied by 11 also unmarried men....",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "💯",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 855,
      "content": "NTA\n\nThe idea that someone would expect guests at their wedding to cut Their hair differently or shave if they have a beard is nuts. \n\nClean?  Yes.  Styled?  Yes.  Cut and shaved is totally different.",
      "id": 45,
      "comments": [
        {
          "score": 277,
          "content": "The more radical evangelical churches are quite common on tmy region so this rules aren't that weird here",
          "id": 46,
          "comments": [
            {
              "score": 260,
              "content": "I’m curious as to what these people think Jesus looked like.",
              "id": 47,
              "comments": [
                {
                  "score": 284,
                  "content": "A white, Aryan, clean-shaven guy in a suit.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 143,
                      "content": "It’s so frustrating, if you believe in Jesus, you should understand who he was. A middle eastern jewish man who was not considered attractive but mostly average according to the Bible.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "He also drove a Mercedes and had a super low handicap.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "Yeah do they not remember Jesus had a beard and long hair?? Tell that to your FBIL and tell him and your sister to shove it. NTA OP don’t change your appearance based on someone’s religion that they’re trying to shove on everyone else.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This was my immediate thought. \n\nPeople don't always agree on much about Jesus, but it seems like pretty much everyone agrees he had long flowing locks.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "And Samson.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "We were always told Jesus had short hair. \n\n“Doth not even nature itself teach you, that, if a man have long hair, it is a shame unto him?”\n\n1 Corinthians 11:14\n\nOf course, we ignored the rest of the chapter that talked about women covering their hair.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Corinthians wasn’t written by Jesus. Those are are of Paul’s “letters”…",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Shame on Samson then 😂",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Thats why the bible cant be used as a rule book. One part says this, the other says \"SAMPSON DONT YOU DARE CUT YOUR HAIR!\"",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Like themselves of course, most of them are so ignorant they don't even realize he was Jewish. They believe that the portrait of Cesare Borgia is actually Jesus.",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Kinda chubby, with orange hair and skin. And they voted for him for president.",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "Trump",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "My friend is Oneness Pentecostal with strict dress and grooming rules for members.\nI (female) can visit her church in jeans with a buzz cut. \nThe rules are only for members",
              "id": 61,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Super curious what the fiancé's expectations were for the women",
              "id": 62,
              "comments": [
                {
                  "score": 26,
                  "content": "Conservative dresses that covered from shoulder to ankles, no boyish hair, hair should be straight and in locks and no makeup",
                  "id": 63,
                  "comments": [
                    {
                      "score": 30,
                      "content": ">hair should be straight \n\nI *wondered* when the racism would show up",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "Wow.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "\"no boyish hair\" By their rules, what would happen if a woman in their family maintained short, or even buzzed hair up until being invited? Would they be required to wear a wig or not attend? Just another way their rules are not only inconsiderate but also impractical.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "…. Hair has to be straight? So specific. The other shit is weird af too.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "What… kind of cult is that? Honestly curious.",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Well, I would be uninvited right along with you.  I have \"boyish hair.\"  Unreal.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I disagree, the wedding rules are weird. I go to a church where we believe in women having long hair and men keeping clean cut and shaven but we would never impose that one someone else. When we have events or anything like that even just normal church, we don't ask other people to conform in order to enter the church, that's just weird.",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "My husband's best man doesn't believe in shampoo and I had to request that he use it to wash his hair before the wedding. I don't feel bad about my request. But I wouldn't ask someone to cut or color their hair for a wedding.",
          "id": 71,
          "comments": [
            {
              "score": 12,
              "content": "Doesn’t believe in shampoo? \n\nThere is a “no ‘poo” thing where ppl don’t use shampoo but it’s very involved and has a lot of steps- and rules. It’s very good for curly hair, though. \n\nFor the first few weeks while your scalp adjusts, your hair can be really oily but it evens out. \n\nSince you asked him to wash it, though, I’m assuming this isn’t what he was doing. Was it just greasy and gross. \n\nIdk why I’m so intrigued but I most definitely am.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Not even in the wedding party",
          "id": 73,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 412,
      "content": "NTA, but be warned - this is only the beginning of occasions where they will try to impose their beliefs on your family. \n\nIf they're fundamentalist to the extent that they are even against facial hair, I *guarantee* you that there are even more rules and beliefs you'll find out about later. \n\nSo, best to set the tone now. You are who you are, and you're not changing it to adhere to beliefs that aren't even yours. Because I promise that if you cave on this, they won't stop - they may never actually stop trying to impose their beliefs on others, but at least if they know it won't work on you, that gives you an advantage for the future.",
      "id": 74,
      "comments": [
        {
          "score": 213,
          "content": "I don't realy think they can be more of a pain in the ass then they are now but setting the tone might help",
          "id": 75,
          "comments": [
            {
              "score": 123,
              "content": "Bride & groom get to set the dress code for the event (formal, cocktail, beach casual, farm-yard chic, etc.), they can even ask guests to avoid a certian color (white, for example). Once you start dictating more, you are into -zilla territory. The couple should NEVER dictate hair length or color on any part of their guests, nor do they get to dictate level of make-up, hight of heels or any other such silliness. They shouldn't even be dictating hair lenght/color for the bridal party, let alone guests.\n\nI wouldn't go to this wedding based on that invite - even if my hair was the correct length and my apparale conservative enough.\n\nHere is the deal though, your sister is marrying a control freak and unfortunately, at some point you may have to cut them out of your life, but in the meantime, keep pushing back to show both her and your family that this guy's will is not the will of God and he can (and should) be defied.",
              "id": 76,
              "comments": [
                {
                  "score": 47,
                  "content": "We suggested no high heels with stilettos or similar for safety because we got married outdoors in a state park in an amphitheater that had a steep grade and was mulch and mud. I think we actually said that about the venue and choose your footwear appropriately for safety and comfort though. Some still wore them and I was amazed at their abilities. I was more trying to warn about the conditions than ban them though and I hope that was clear. Also that I considered tennis shoes perfectly acceptable if they so desired.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 25,
                      "content": "That reminds me of the bbq where I had to take a few garden tiles out of the shed for the new gf of a mate. Her stilettos kept sinking in the ground otherwise.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "As a computer tech, my team lead only ever wore stilettos no matter what, even if she was climbing around pulling cable.\n\nA bit crazy, perhaps, but she was the best tech I ever worked with.\n\nSo I could picture her hiking through mud in them!",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Reccomending for conditions is fine. You may also have a venue that prohibits some types of heels, but you didn't say \"all shoes must be sensible and only heels under 1.5 inches are acceptable\" \n\nThere is just a huge difference.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeah. That's about 1. not damaging the venue 2. not damaging their shoes or having a trip hazard. It's practical/rational/safety issue. Not an arbitrary belief.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My bestie said I can request her to dye her hair any colour I want for my wedding but I have to pay for it and pay to turn it back to her usual style.... And I can decorate her wheelchair if it does no permanent damage\n\nThe folks in my wedding party have all agreed to wear the colours I assign them even my bro agreed on a pastel pink suit so long as I pay, he's like I look good in pink but is never wear a pink suit again so you better be paying.... My mum doesn't like dresses so agreed on a nice pantsuit in the assigned colour as long as I'm buying and don't expect her to show cleavage or wear eyeshadow\n\nI do plan on asking my guests to wear white but I'm not going to be big mad if someone wears black or whatever.... That being said I'm going to take my uncle shopping for the wedding because last family wedding he went to he wore a tracksuit.... So I think I'm justified in micromanaging his outfit choice lol",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Having been raised Independent Fundamental Baptist (and thankfully finally escaped), I assure you, they absolutely CAN and WILL be more of a PITA than you can possibly imagine 🤣 Set those boundaries now and hold firm!",
              "id": 83,
              "comments": [
                {
                  "score": 8,
                  "content": "Watching years later as some of their kids run like hell from them can be deeply entertaining, would 100% recommend trying to stay at least tangentially in their life to watch the show. (Some kids will sadly just fall in line, but there's almost always one rebel!)",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 168,
      "content": "NTA\n\nAccording to your sister \"men shouldn't care about their hair so much.\" So why is this such an issue for her and her husband. They just need to work on not caring about your hair.\n\nBTW One of my colleagues at my elementary school had hair down to his waist - he retired last year after 35 years in the job. Another one has dreads past his shoulders. Both of these men are grown, and certainly not rebelling or in some kind of \"phase.\" Hair length is not commensurate with maturity.",
      "id": 85,
      "comments": [
        {
          "score": 41,
          "content": "My husband teaches and has longish hair, another good male friend teaches and also has long hair. Perfectly possible to be a professional male teacher with long hair. NTA obviously.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Plus Jesus told his followers that when they fasted they should “wash their face and groom their hair “ to look good so no one but god knew they were fasting. So yes, it’s Christian to care about your hair.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "My primary school principal had longish hair and a massive beard, when he retired he grew it all out even more and looks like a homeless wizard.... He was a great principal\n\nI've known plenty of successful blokes with long hair or beards.... My bro has a beard and is very successful",
          "id": 88,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 125,
      "content": "NTA.\n\nYou are you and she knew that when she invited you.  The haircut request is not reasonable.  They have their religious beliefs and are trying to impose them on you and the guests.  That is not reasonable.  They are not practicing any tolerance for people beyond their strict beliefs.\n\nDo what you feel best but they are not entitled to expect you to cut your hair short for their wedding.",
      "id": 89,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 108,
      "content": "At your wedding are you going to require her fiance to grow out his hair to shoulder length?   You should probably let him know so he has time to work on it.\n\nNTA - religious rules apply to the believers, not the heathen.  \n\nIf your hair style was good enough for Jesus it should be good enough for them.",
      "id": 90,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 41,
      "content": "Nta- if men shouldn't care about hair much (according to the fiance), then why should anyone have a problem with your hair?",
      "id": 91,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "Absolutely NTA. That is a pretty ridiculous request imo. I can understand wardrobe requests, but a haircut like that is a long-lasting change that they have no right to dictate.",
      "id": 92,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 31,
      "content": "To be totally honest—I’d rather stay home and do something enjoyable with my time than to waste it being uncomfortable for several hours at a wedding with people forcing their religious beliefs down my throat and starting drama with me for not conforming to their “aesthetic.” NTA",
      "id": 93,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 30,
      "content": "NTA.  You did not create the drama.  Literally all you have done is be yourself.  Your sister is the one insisting you make changes to your appearance that will take months to undo, and everyone else is refusing to accept your offer to simply bow out if keeping your current hairstyle is unacceptable.  If they all want to continue fussing about it, let that be their problem, and remind them that you just not coming is always an option if it’s going to be too much trouble otherwise.",
      "id": 94,
      "comments": [],
      "relation": "Support"
    }
  ]
}