{
  "post content": "So, this girl, Nicole(16), started going to my (16f) school after winter break. She’s a little weird tbh. She doesn’t talk a lot and when she does talk, she’s so quiet that you can barely hear her. \n\nShe used to eat in her car but one of my friends felt bad for her and invited her to eat with us. I noticed that all of her lunches had a little piece of paper and she’d read it, smile for like 2 seconds, then fold it up and put it in a pocket in her lunchbox. Sometimes she’d take it out and read it a couple times during lunch.\n\nI eventually asked what it is and she said she has a nanny and she writes her notes every day. I asked if she thinks that’s a little embarrassing because I don’t know anyone who’s had notes in their lunches past 5th grade. \n\nShe got kinda defensive and said that her nanny does similar things for her siblings, who are all in preschool or elementary school so it kinda proved my point. \n\nShe started eating in her car again and one of my friends got mad at me because apparently she had a really bad home life before moving here and she’s never had anyone do that stuff for her. Idk how tf she expected me to know, considering she usually only talks about school but it’s starting some drama in my friend group so I wanted to know if I was the asshole.",
  "id": 1,
  "comments": [
    {
      "score": 67903,
      "content": "YTA. You bullied a girl over notes in her lunchbox and now she is eating by herself in a car. How could you not be the AH here? Jesus kids can be cruel.\n\nEdited to add: Thanks for all the awards y'all.",
      "id": 2,
      "comments": [
        {
          "score": 17272,
          "content": "I don't even know how it's a question if OP is TA, she was nasty and made the poor girl feel so uncomfortable she's back to eating in her car. Awful. If OP has a heart, she would apologize to this girl, without again going into how weird she finds the notes, and offer for her to sit at their table again.",
          "id": 3,
          "comments": [
            {
              "score": 15607,
              "content": "When OP said,\n\n>She’s kinda weird tbh.\n\nYou just knew she was gonna end up being the asshole after that.  “Weird” is high school girl code for the people they shun.  She probably thought she was helping her socially by ridiculing her notes.",
              "id": 4,
              "comments": [
                {
                  "score": 13209,
                  "content": ">Idk how tf she expected me to know\n\nLike OP isn't the one that's socially stunted. Like damn, OP saw that the notes were the ONLY THING that made her smile a little and OP's like nah let me make fun of the only thing that makes this girl happy. Get a clue OP.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7190,
                      "content": "Someone publicly shamed me in Jr. High for the way I smiled.  It got in to my head and 30 years later I still have the instinct to cover my mouth when I smile.  Embarrassing people for the things that make them happy like dancing, smiling, and laughing can make people feel ashamed to feel happy at all for a long time.\n\nIt’s really bad karma.  OP should feel ashamed.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Usually I’m not one to judge teenagers for a lack of social cues and being socially stunted. But man do I have to agree with you on this one, OP needs to get a clue. OP recognized the girl even READ IT a few times during lunch some days. I know what this girl is going through, I’m about to be 20 and god if someone put a kind note in my lunch now I would smile too. OP, not everyone has a nice home life and stops getting notes after 5th grade. Many people go through HORRIBLE home lives and those little things that are little to you, are bigger to someone else. YTA op.\n\nAlways be kind, because you never know what the “weird kid” as you put it go through. You never know what anyone around you is going through.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3048,
                  "content": "Honestly I feel sorry for the 'weird' girl. That note is probably her only connection to an actual caring person. The way she reads and saves it shows how desperate she is for attention.\n\nOP - you are definitely the Asshole. Can't say it enough. YTA. YTA. YTA.\n\nYou took a little  daily uplift for a girl who's apparently struggling socially and probably feels daily like an outsider and made everything worse for her by ridiculing her. For no reason but you think she's weird. You are a shitty person with awful ideas on how to treat people.\n\nYTA.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 697,
                      "content": "She's probably closer to the nanny than with her own parents, and I bet that note is something she cherishes every day.  My heart hurts that OP tarnished that.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 315,
                      "content": "Yeah, also it said that she had a rough home life and nobody had ever cared for her before, I feel like it may not be a nanny, but possibly some form of Foster carer or something along those lines.....",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 266,
                      "content": "I would have killed for something like this in junior high and high school.  My husband writes me little notes sometimes and I have them saved in a little box and still take them out and read them.  \n\nThis girl had one tiny thing that she enjoyed and was ridiculed by the one of her friend group...shame on her for doing this.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "She doesn't know what this girl's home life is like, and clearly those notes mean a lot to her.  \nMy father made my school lunches for me until I graduated, even though I told him I'd make them. He did it because he enjoyed it.  And sometimes he'd write little notes on the inside of the brown bags for me to find and it always made me really happy to see.  It made me feel loved, and I'm sure that's exactly how this girl feels too.\n\n  \nOP needs to learn to be a little more sympathetic to people.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Agree. The nanny may be the only friend that kid has.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 868,
                  "content": "I wish someone put notes in my lunch 😟\n\nEdit: these replies have made my day and all of you deserve sweet lunch notes!!!",
                  "id": 14,
                  "comments": [
                    {
                      "score": 675,
                      "content": "I hope you have a day as great as the color magenta!  We’re so proud of you.\n\nXOXO,\n\nu/analbox\n\nPS: I snuck a fruit roll up in your backpack.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Here’s a note: have a great day, hope you had fun today, if not there’s always tomorrow. Also, what kind of alligator wears a vest? YUP - an investigator !\nCheers 😊",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "My gf (34f) leaves notes for me (38m) all the time and it’s legit one of the best parts of my life.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Here's one for tomorrow:\n\nI'm proud of you for tackling the day and making it all the way to lunch <3 I hope the rest of your day is wonderful, and I hope tomorrow is even better still\n\nXOXOX,\n\nu/iamthenewt",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I made one for myself once. It actually worked!!! Give yourself some self love <3",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 409,
                  "content": "The “weird” kids are the best kids to be friends with. I was in high school in the 1980s and a lot of us “weirdos” became the best of friends. Wouldn’t change it for anything.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Same! My “weirdo” friends and I have all been close for going on 15 years now! The weirdos are always the coolest group of kids. OP sounds shallow af.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Me either. I was weird, my friends weird. Turns out I'm on the spectrum so I relate to her silence and quiet voice and wanting to be alone. Op is exactly how all the ableist bigots act. \"She's weird.\" \"I'm not wrong.\" \"That's for little kids.\" How about you stfu because not everyone experiences consciousness that same?",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Exactly! My mom put notes in my lunches in high school and my friends enjoyed them almost as much as I did.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I was \"weird\" in HS because I also didn't talk. The girls who called me weird are all now selling MLMs and not doing too good. \n\nI feel for this girl, I would've loved to be loved enough for daily notes at any point in life.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "It's also often code for \"queer, autistic/disabled, not white, fat, and/or poor\".",
                  "id": 25,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Just depends on what the majority is.  People are terrified to stand out at that age because their peers are relentless towards outliers.  Even the few “rich” kids at my working class elementary school were shunned and bullied simply because they were dropped off in a nicer car.  Many of the white kids at my cousin’s 85% Hispanic high school were beat up and bullied for being different.\n\nHumans universally just love to be tribal and shit on people who are different than them.  I worry that won’t ever change about us",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "My teenage daughter (13) is an eccentric introvert. She likes stuff slightly off mainstream. Luckily our surname rhymes with weird and has become a family nickname for all of us.\nI found a quote when she was younger, \"weird is a by-product of being awesome.\"\nShe now revels in her weirdness and is proud to a weirdo. Her best moment came when someone called her weird at school, in an attempt to bully her. She responded with thank you, apparently the wannabe bully's face dropped and was stunned into silence.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 15,
                      "content": "“Thank you” is an oddly disarming response to an insult.  I use it any time my kids say something insulting.  It takes all the satisfaction out of being a jerk.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Sounds like OP is salty that she's not loved or cared about in the same way. Her parents probably never even took the time to let her know they care about her so seeing someone else happy by being given a sweet note of encouragement makes OP super jealous.\n\nOP is such a bully AH but these types often always get a dose of their own once their prestigious high school reputations wear off after they leave",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Yep, as soon as I saw that I was like \"I know what's coming.\" Her friends were being nice to the icky weirdo so she decided to score points by mocking her.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Regina George",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1524,
              "content": "Op said it's starting drama in the friend group like she's surprised her friends are mad at her like wtf? If your mean and cruel to someone of course your friends are gonna be mad at you \n\nOp then said how tf was I supposed to know she had a bad home life as if that's an excuse weather or not someone has a good home life or bad home life shouldn't = how kind the person deserves to be treated it's also not a green card to b cruel \n\nYTA grow a heart and be kind",
              "id": 32,
              "comments": [
                {
                  "score": 632,
                  "content": "YTA. I hope the friend group invites the \"weird\" girl back and dumps OP if she doesn't apologize.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 95,
                      "content": "I hope OP's friend group sees this and dump her. Bullies don't deserve sympathy.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "100%",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Right, ok so maybe she didnt know the girl had a bad home life.\n\nBut she DID  know that this girl just moved, had no friends yet, was painfully shy, socially anxious and until recently had been eating alone on her car.\n\nOP 100% made her comment to be intentionally cruel and put new girl in her place. No one is that clueless.",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "“How was I supposed to know she had a bad home life, considering she usually only talks about school.”\n\nOP answered her own question there, too.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 25,
                      "content": "She's literally using that as an excuse to be mean there is no excuse to be mean to someone just because they're different from you",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Even if she had a great home life, OP's reaction to the notes was uncalled for.  The notes hurt literally no one and they made that girl happy.  And it's not like she was calling attention to them or bragging about them. She read them silently and only said anything about them when she was asked directly.\n\nOP just couldn't handle the idea of that girl being happy, so she found a way to make her feel bad about it.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "I'm glad her friends are standing up for the poor girl. Bullies suck and I'm glad that her friends seem to recognize that.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "The fact she feels the new girl started drama is unbelievable to me, TBH it’s narcissistic & cruel AF!",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1000,
              "content": "OP probably won’t apologize. She has obviously lost all of her childhood wonder and can’t fathom that anyone else would still have it. I feel bad for the girl, who may have lost some of her own wonder because of OP.",
              "id": 42,
              "comments": [
                {
                  "score": 629,
                  "content": "[deleted]",
                  "id": 43,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I love this so much",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "But they won’t. And this girl will go on alone because life isn’t a movie and bullies never learn.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "In THIS world OP should bring the girl a snack/lunch to her car with a note attached apologizing for spoiling something that made her happy, telling her she was wrong to be shitty and asking if she would like to keep eating lunch with them. Make it happen, OP!\n\nAlso, OP YTA for sure if you don't fix this.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This is perfect.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Honestly this is just pure jealousy on OPs part. I don’t know if she was jealous that the girl was getting notes that made her feel happy, or if she was jealous that there was another girl in her friend group maybe taking attention away from her. But it’s jealousy through and through. OP girls like you are the reason I dropped out and got my GED. Being a teenager is already so god damn hard, why add to it?",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1695,
          "content": "Honestly just say your jealous your mum doesn’t do notes for you and move on. How tf Op thinks it’s her business is beyond me. YTA",
          "id": 49,
          "comments": [
            {
              "score": 1727,
              "content": "Some little jerk on my kid's school bus started dishing out some nonsense of \"your MOMMY still waves BYE BYE to you\" when they saw me wave from the kitchen window, and my kid looked at the punk ass and said \"Yeah. Too bad your mom doesn't love you as much as my mom loves me.\"  \n\n\nSource: The bus driver, who thought it was hilarious.",
              "id": 50,
              "comments": [
                {
                  "score": 453,
                  "content": "\"I'm sorry your (insert person here) doesn't love you\" is the only correct response.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 186,
                      "content": "When I first started dating my fiancé I'd tell him to text me when he got to his destination if he was flying, or driving a long way. He laughed and rolled his eyes at me and I told him it was what my friends and I do. He told me \"None of my friends has EVER asked me to do that before\", so I said, \"I'm sorry none of your friends love you!\"\n\nIt's been almost four years and now him and his entire side of the friend group says \"text me when you get home\" whenever any of us part ways.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 144,
                  "content": "Your kid rocks, good on them for standing up to that bully!",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "This belongs in r/MurderedByWords.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Your kid is going places ❤️",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Man that brings back My memories . My mom would always walk me and sister to the bus stop , and wait until our bus left. Kids tried to pick on me but I told them exactly what you said .  You could tell that hit that dude at the heart .\n\nEven now my son is older and I give him a hug , a kiss , and a bendicion.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This. It’s jealousy that her friends like her. She set this whole thing up centered around how unappetizing this girl is to her",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Really.  At what age does being loved become uncool?  \n\nOP, YTA 100% here.  I'd use harsher words that you definitely deserve but you're just a kid and the internet looks down on bullying kids.  That doesn't change the fact that that you're an asshole.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1198,
          "content": "Dude, I’m almost 40 and I would LOVE a sweet little note in my lunchbox.",
          "id": 59,
          "comments": [
            {
              "score": 1793,
              "content": "I’m 42 my husband is 48 and I’ve put a different colored Post-It note in his lunch every day for almost 9 years. I thought it probably embarrassed him (he works in a large garage that services big trucks and fleets so he’s always surrounded by like, 20-30 mechanics).\n\nLast Christmas party we just ordered pizzas and set up some tables (Covid) and when he was showing me around, he showed me his locker…..\n\nThe inside of his locker was *completed covered* with almost a decades worth of Post-It’s (yes, some were taped on). Plain yellow, neon, pastel, the big ones, the tiny ones, even the ones that are long and skinny! \n\nI couldn’t believe it! But even more amazing than that was that every guy that walked by when he was showing me made a point to stop by and say some variation of “oh, your Mr Twinkle Tits wife? We love your notes!”\n\nWhich, ofc I cried because not only was my husband *not* embarrassed of his notes, he happily showed them off - and kept them!\n\nAnd to top it off, not only did those big, burly, testosterone-fueled grease monkeys NOT make fun of him, they all told him how much they loved it!\n\n\nJust…..made me really like humanity that day.",
              "id": 60,
              "comments": [
                {
                  "score": 389,
                  "content": "This made me tear up. Your husband is a gem.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 24,
                      "content": "That's amazing.  Ooh, to really top it off, you could send the occasional note to a fellow grease monkey if hubby thinks it would lift their day, be it a celebration, commiseration or just because.  You could be the TwinkleTits Fairy bringing joy to many :-)",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 83,
                  "content": "This is beautiful!",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "This is the best thing I have read in a long time. You and your husband are great!",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Very touching story, but I must say:\n\n>oh, your Mr Twinkle Tits wife?\n\nI've never done a double take so hard in my life. Unintended as it was I thank you for the laugh.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This is so sweet :’)",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Relationship goals, right here.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I do that for my fiancé sometimes. He’s an elementary school art teacher and the first time I did it, he posted a picture of it to Facebook to brag about it 😂 Who wouldn’t want a nice note?! I love that your husband appreciates them so much",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "I write my own, to remind myself ‘it’s just a job’ - I’m almost 40 too.  I have little positive post it’s everywhere.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "My parents would often include notes in my lunches all the way through high school! My mom’s would be sweet and loving, my dad liked to draw crude stick figures with buck teeth and stink lines and my name with an arrow pointing to it on my paper lunch bag. He thought he was wicked funny. Unfortunately my friends thought so too.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "don't all of us get a huge smile on our faces when someone does something nice for us like that?",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My wife leaves me notes when she makes my lunch for me on days I’m running behind! It’s adorable. My coworkers know better than to say anything disparaging about it though. \n\nMost wouldn’t either way because they’re not assholes, but the ones who would don’t because I’m not the type to let someone say negative shit about anyone, especially my wonderful wife!",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1109,
          "content": "I was bullied horribly in school up to 8th grade, so not 16 but still, my moms notes in my lunch were the only thing that kept me from jumping off a cliff. No wonder she eats in her car. OP doesn't know what this girl has been through. Maybe she has special needs, maybe she's been bullied, maybe there's been a death in the family, or she's been through a bad breakup...who knows? OP quit being a mean girl.",
          "id": 73,
          "comments": [
            {
              "score": 1296,
              "content": "Also OP saying “how was I expected to know?” You’re *not* expected to know what other people’s lives have been like. What you *are* expected to do is recognize the fact that you never know what people have been through, remind yourself that people don’t choose the lives they’re born into, and use those facts to extend kindness & decency to people whenever you can. OP, YTA\nEdit OMG WOW thank you guys for seeing this! I feel honored and wanna give everyone a hug ☺️☺️",
              "id": 74,
              "comments": [
                {
                  "score": 214,
                  "content": "And even if that girl had a perfect life, why comment negatively on something that obviously makes her happy? What was the motivation/what did OP hope to get out of making that remark? Because I can’t think of any positive reason for making such a statement",
                  "id": 75,
                  "comments": [
                    {
                      "score": 28,
                      "content": "There's not a positive reason, but I'd bet my own lunch that the reason is that OP's insecure and wants to point out how weird the other girl is to cement her own social status. She wants to bond with her friends over putting this other girl down. \n\nThings are going to get rough for her if she doesn't cut this out, because the only people who put up with it as adults are people who are equally immature, petty, and insecure.",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "This needs to be seen! This is exactly what I was thinking and the part of OPs post that pissed me off the most. Considering her attitude about it, she likely didn't possess the type of caring energy one would hope to see before opening up about something so personal. Maybe if OP had expressed some non-judgemental interest in the new girl she wouldn't have come off as \"weird\".\n\nI was the new girl halfway through 6th grade (12 years old) and I experienced culture shock moving from a small New England town to the suburbs of Philly. I was quiet and shy and I *knew* everyone thought I was weird. I also had a rough home life and severe social anxiety. I was bullied. It took several years after high school before I formed friendships with people that I felt I could actually trust and rely on. \n\nYTA.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "That makes me want to cry, that must have been so hard for you, and hard for your mom to see you suffer.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "That’s so sad, but I’m so happy u had a loving mom to help you get through. We all need someone to unapologetically love on us sometimes and it actually takes courage to admit that idk. And yeah op was just being nasty to this girl who did nothing to her",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 398,
          "content": "I'm just wondering if OP skipped the lesson in kindergarten to learn when to shut their mouth.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 221,
          "content": "[deleted]",
          "id": 81,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "This right here. \n\nThere is a shy insecure girl and OP tells her she should be embarrassed over something nice someone does for her, that makes her smile. \n\nI kinda feel sorry for OP, because apparently she can't even imagine that someone does something nice for her, that makes her feel loved.\n\nYTA and a Bully.",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "“Like, I told the shy, quiet girl that she should be embarrassed of herself and now everyone thinks I’m like mean or something. What did I do wrong?”",
          "id": 83,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "They really can. This just makes me so sad. I hope this girl knows that life won’t always be like the hell of high school. \n\nOP - Nobody “expected you to know”. They just expected you, as someone who’s almost an adult, to consider the possibility that this girl may have difficulties that you’re not aware of, and not to be a bully. \n\nSome peoples’ lives are awful. Some people have delayed social skills and emotional development. Some people have disabilities that affect the way they interact with other people. Some people have trauma, or mental health issues, or other problems you are unaware of. That’s why you’re supposed to avoid being an arsehole over something that doesn’t remotely negatively affect you in any way. \n\nThank goodness your friend seems more decent. Maybe pay attention to how they behave?\n\nYTA",
          "id": 84,
          "comments": [
            {
              "score": 11,
              "content": ">OP - Nobody “expected you to know”. They just expected you, as someone who’s almost an adult, to consider the possibility that this girl may have difficulties that you’re not aware of, and not to be a bully.\n\nTBH, I don't even think that much needed to be expected. Just the simple knowledge that \"if it isn't hurting anyone, there's nothing wrong with it\" should be enough in this situation.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "THIS\\^\\^ YTA do some self reflection and stop being a bully",
          "id": 86,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 30167,
      "content": "YTA, you made someone feel bad about something that brings them joy for a brief moment. She literally read a note for 2 seconds and put it away, mind your own business next time.",
      "id": 87,
      "comments": [
        {
          "score": 9788,
          "content": "Can you imagine not wanting someone to experience *two seconds* of joy every day? Makes me mad.",
          "id": 88,
          "comments": [
            {
              "score": 3407,
              "content": "On top of that imagine thinking joy is embarrassing. Luckily op is still young, I really hope she learns that caring about this stuff is what makes her a kid and not an adult. Op yta.",
              "id": 89,
              "comments": [
                {
                  "score": 749,
                  "content": "Now that just makes me feel bad for OP because if they think happy is embarassing, it could mean trouble at home.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 627,
                      "content": "I remember this being one of the worst parts of the high school experience. That notion that certain things that bring you joy were weird or embarrassing - like having parents (or a nanny) who cares about you.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I mean... maybe, but just as likely not. The whole \"striving to seem (what a teenager thinks is) grown up and mature\" thing hits HARD when you're that age. There's a reason one of the biggest cliches of teens in media is \"GOD MOM YOU'RE EMBARRASSING ME\" when a parent is affectionate or treats their kid like a kid.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 999,
          "content": "Here's a note for OP's lunch bag: \n\nYTA",
          "id": 93,
          "comments": [
            {
              "score": 16,
              "content": "It would be a nice lesson if she had someone do the same to her as she did to the poor girl. Just shit all over a happy moment so she can understand how it feels.",
              "id": 94,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 814,
          "content": "The fact that the girl would pull it out and read it multiple times suggests to me that it's not only a source of joy, but a source of *comfort*, too.\n\nI wouldn't be surprised if that girl asked her nanny to stop doing it from now on, even though it once made her feel happy and safe, because now she's going to feel bad about it every single time. Her source of joy and comfort has been tainted.\n\nPotentially more than that, this might reinforce an idea in her that someone showing her love, attention, and care is a *bad* thing. And that can have some *horrendous* consequences in her life down the line.\n\nI so badly wish I could magically become that girls dad or uncle or something and give her a hug and the comfort that she needs.",
          "id": 95,
          "comments": [
            {
              "score": 231,
              "content": "\"The fact that the girl would pull it out and read it multiple times suggests to me that it's not only a source of joy, but a source of comfort, too.\"\n\nThis.  When I was in university my mom would sometimes come for a quick visit and bring me a care package (home cooked meals, treats, stress relievers, fuzzy socks, whatever...just stuff to make me smile.). She would put a note on each item.  For example, a lavender room spray with a note that said \"to keep you calm. Ahhhh.\" I kept the note on the bottle, and it brought me comfort every time I saw it.  It reminded me that even if I was struggling, someone was in my corner, so I would be okay.",
              "id": 96,
              "comments": [
                {
                  "score": 14,
                  "content": "My bf threw out a note that a patient had written for me (okay the parents wrote the note and she colored it with beautiful scribbles). I started crying. At least that was an honest mistake, unlike what OP did. Also unlike OP, my bf apologized and got me my favorite flowers and a card the next day. I still have the card and read it sometimes when he is gone to cheer me up.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Aww I miss college care packages! My mom would usually include something for my roommate or a friend I had told her about! That resulted in every person I befriended in college absolutely loving my mom. And there were a lot. This weird girl made a lot of friends in college, because people in college don't give a shit about what you wear or what lunch table you sit at.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "This. She ridiculed her for love that this girl obviously needs. Reading this made my heart ache. I want to wrap that girl up in a hug and let her know no one in the real world would care about this and she will be fine later in life.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 561,
          "content": "I cannot fathom how someone having a moment of joy and a smile in their day is worth ridiculing to some people",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 240,
          "content": "Seriously. Mind your own business, OP. You have no reason telling another girl anything like that anyway. You could have asked, said oh okay, and went on with your life. Even if she didn't have a bad home life before going to your school, you have no reason to question someone else's guardian or nanny writing them something that gives them a moment of bliss. You're just being cruel to someone. YTA, and a bully.",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 155,
          "content": "I teach middle school. One day, I had some 8th grade boys up in my room for lunch as they worked through some missing assignments. One of those boys had a note from his mom and the response from his peers? “Man, your mom LOVES YOU loves you. I kind of wish my mom did that.”",
          "id": 102,
          "comments": [
            {
              "score": 29,
              "content": "Oh man. This makes me happy and makes me sad all at the same time. I don't want this to sound creepy, but I want to give the child (or children) that wished his mom LOVED HIM loved him a hug. If there's anything I hope my kiddos know deep in their souls it's that I super love them and that will never change.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Just a general tip, OP: be kind to people. \n\nEven people who don't have tragic backstories don't deserve to be ridiculed for the things that bring them joy.\n\nYou're an asshole, but you're young and don't have to be an asshole forever if you decide to improve yourself now.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "A note that brings a smile to someone and makes them feel good is amazing and what matters regardless of who is from. \n\nINFO: If the note were from a crush, would the story be totally different? I'm sure OP would be more interested. \nHas OP gotten any happy notes from loved ones in her life?",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "The poor girl *smiled* to herself over something and OP wanted to rip that away from her. How nasty. And clearly the girl is struggling with something so OP really had to go out of her way to be hurtful. Seriously mind your effing business and let her enjoy the notes. \n\nAnd I get you're all cool and tough and all \"that's stupid and for babies but I'm a big kid\" but I'm almost 30 and my mom leaves me notes on the kitchen counter when I visit and leaves notes in things she gives me before I head back to my own house. I'm not embarrassed in the slightest and you should be ashamed of yourself for trying to make someone feel bad about getting notes from someone who cares about them.",
          "id": 106,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Yup, OP is a HUGE AH.  Imagine bullying a girl for simply reading a little note that brings her happiness.  You should not only apologize, but be happy that she has someone who cares enough to write her a note.  \n\nYou should be ashamed of yourself.",
          "id": 107,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13047,
      "content": "YTA - there is no other way to spin it. Live and let live and don't be an AH. And you find out by not being an AH and talking to people and getting to know them.",
      "id": 108,
      "comments": [
        {
          "score": 2071,
          "content": "Hard agree. I'm 26 and when my mom visits my apartment she will leave a note somewhere telling me to have a good day. I love it. \n\nTo pretend that you hate \"cringy\" things might be cool to you now, but it results in a lot of burnt bridges and loneliness in the future. Take this opportunity to learn how to be a little less judgemental and cynical. \n\nOh and of course, for now, YTA. Hope you grow up OP",
          "id": 109,
          "comments": [
            {
              "score": 528,
              "content": "Honestly! I also have no idea why OP finds it embarrassing. I put notes in my fiances lunch, sisters lunch, even my own mama. If Im making you a gdarn LUNCH, ya gonna get a heartfelt note. And you can bet your ass Im doing that shit for my kids and nieces and nephews until they starts making their own lunch. And I STILL might sneak on in there. NO ONES SAFE",
              "id": 110,
              "comments": [
                {
                  "score": 87,
                  "content": "I'll take a lunch from you, please! Maybe OP needs a nice lunch note so they can see how awesome it is to get one.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Id love too! And until I can make it, here is your lunch note that you can do whatever you want with!\n\nYou are doing great today! Im really rooting for you and I hope the rest of the day is kind to you. If its not, be kind to yourself and remember theres always tomorrow!",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My mom used to open the peanut butter jar and draw a heart in it so whoever went to use it got a surprise. She still does it when she visits and I’m 40.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "Definite YTA here.\nI’m in my thirties and my friends and I leave each other notes at work to make each other smile. These are small, nice gestures that can mean the world to some people.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I am almost 40 and still get notes from my mum sometimes too, and it still never fails to make me smile! Those moments are the little things that make life bearable sometimes.\n\nI was also that weird kid people shunned in school, and though it still has a lasting effect on how I am around others, I can now rise above. I now realise that it is not my problem what others think - it always says a lot about them instead.  I just hope the poor bullied girl in OP's post can find her feet too and stand tall, and keep smiling at her notes.\n\nYTA, OP!",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 140,
          "content": "Exactly. Why does OP care so much? Do they not realize that no one gives a fuck after high school? Teenagers are dumb, cruel, and annoying. I highly doubt OP is the pinnacle of not cringe. People who do shit like this deserve to be bullied more. Jesus. YTA",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9014,
      "content": "YTA, what a petty thing to notice or comment on. Garden variety bullying. You should be ashamed of yourself for treating another person poorly.",
      "id": 117,
      "comments": [
        {
          "score": 1910,
          "content": "[removed]",
          "id": 118,
          "comments": [
            {
              "score": 969,
              "content": "Clearly seeing someone who is cared for and loved by others triggers some jealously for OP. I honestly feel bad for her knowing she not only lacks empathy but probably doesn’t have a good support system. \n\nOp, YTA. You probably also need some therapy to confront why someone else’s happiness bothers you so much.",
              "id": 119,
              "comments": [
                {
                  "score": 25,
                  "content": "🏆",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "You deserve an award for that one!!",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I misread this and thought there was a subreddit for sweet lunch notes. \n\nI think they’re adorable, but AH emo too cool for school teens gotta project their insecurities into the world. \n\nOP, YTA (for the bot)",
              "id": 122,
              "comments": [
                {
                  "score": 14,
                  "content": "OP you decided to mock someone for receiving love. How low is that?? \nThat is literally textbook high school mean girl shit.\nPlease grow from this and do better \nYTA\nAlso my mom and dad wrote me notes for my lunch until my senior year, they even wrote some for my friends. One should feel so lucky to know someone is thinking of them.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Shit I would’ve loved little notes from my parents. In fact I’d still like it as an adult.",
          "id": 124,
          "comments": [
            {
              "score": 12,
              "content": "I never got notes and had to make my own lunch since i was 12. Im an adult but i would like to have notes in my lunch\n\nHeck, i would put in notes in my potential future gf’s lunch package\n\n “last nights pizza for you. Threw the pineapple away, i love you not your tastebuds”",
              "id": 125,
              "comments": [
                {
                  "score": 12,
                  "content": "For a time my husband worked in an off-site location with no real options for buying lunch, so I volunteered to make them.  I often put little notes in them and he never said much about it but I liked doing it.  Years later when I went through his wallet after his death I found a bunch of them carefully folded up and stored away.  \n\nWho wouldn't want a little bit of light in their day - at any age?",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6776,
      "content": "YTA and kinda a bully. You belittled her for something that brings her joy in this mess we call life. I’m 27M and I’m ecstatic when my wife leaves me a note in my lunch at work. Let people enjoy the little things.",
      "id": 127,
      "comments": [
        {
          "score": 2192,
          "content": "Seems generous to say kinda a bully. She’s not even asking if she’s an AH because of how she hurt this girl or caused her to go back to secluding herself. She asking because it’s causing drama in her friend group, she’s asking only because it is effecting her life. She doesn’t seem to care one bit about the other person.",
          "id": 128,
          "comments": [
            {
              "score": 428,
              "content": "Agreed. I wasn’t sure how directly calling someone a bully would be received here but yeah definitely a bully",
              "id": 129,
              "comments": [
                {
                  "score": 20,
                  "content": "Call them as you see them. \n\nNot sure why this sub would be cool with calling people assholes if we weren't allowed to call them out as bullies as well.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Just joined the sub like 3 days ago so I was being a bit cautious",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "[removed]",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I hope someone in the friend group invites her back to sit with them again. And op absolutely needs to apologize.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "When she said \"how should I know?!\" That's the thing love, it's none of your fuckin business, you didn't need to know, you needed to be quiet. Now the girls back to eating in her car so she can enjoy her notes in peace. YTA for sure",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 235,
          "content": "Right?? I’m 31 and if my mom wanted to send me a little note, I’d think it was adorable. \n\nIt’s not embarrassing to have someone who cares about you.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Your wife makes you lunch for work? Shit be ecstatic over that too",
          "id": 136,
          "comments": [
            {
              "score": 14,
              "content": "It’s not all the time but I love it when she does it. I’m spoiled and I know it",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Right? I would love to have someone to write me such little notes, that sounds so sweet and joyful!\n\nIt must be hard to be the new girl, have no friends etc, so I can imagine how a little bit of love, couple of supportive words on the paper could lighten her day up... only for OP to bring her down again. How nice of her...",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4442,
      "content": "YTA. This girl is apparently shy and quiet, and she \\*gets joy\\* from these little notes and you deliberately and calculatingly \\*stole that joy\\* from her by making her feel like it was wrong to get joy from those notes. I hope you grow up to be someone who spends more time looking for ways to reinforce other peoples' little moments of happiness rather than stealing them, but judging from this you're off to a terrible start.",
      "id": 139,
      "comments": [
        {
          "score": 650,
          "content": "If anything it’s OP acting like a child.",
          "id": 140,
          "comments": [
            {
              "score": 508,
              "content": "Children are capable of empathy and understanding and kindness. OP did not display any of these.",
              "id": 141,
              "comments": [
                {
                  "score": 393,
                  "content": "my 3 year old cousin saw someone who was crying and immediately brought them a pack of cookies she had in her book bag to cheer them up. And hugged them. Total stranger (her mom was watching, don’t worry) and she felt the need to make someone’s day better.\n\nop is 16 and a total brat. hopefully she’ll come to realize she’s not as innocent as she thinks",
                  "id": 142,
                  "comments": [
                    {
                      "score": 81,
                      "content": "This is the sweetest story, and what the world needs more of right now. Thanks for sharing!",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "That’s so cute. My 4 year old son does the same, he hugs or asks if someone is ok if they’re crying. OP YTA, you don’t need to know the background of the girl all you need to know is this made her happy so just let it",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Well she is a child. But also, my ten year old would know that that’s not nice and what she’s doing is bullying.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3004,
      "content": "It obviously made her happy,  why did you need to be negative about it? YTA",
      "id": 146,
      "comments": [
        {
          "score": 624,
          "content": "because OP’s parents don’t love her enough and she does not know affection for she has never received one.",
          "id": 147,
          "comments": [
            {
              "score": 207,
              "content": "And OP doesn’t love herself either so projects.",
              "id": 148,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 94,
          "content": "lmao! someone loves you enough to write you cute little notes in your lunch!!! what an embarrassing loser!  (OP probably)\n\nYTA OP so much.",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2598,
      "content": "YTA. Shut your mouth next time. You're too old for this bratty shit, you're dangerously close to being a bully.",
      "id": 150,
      "comments": [
        {
          "score": 668,
          "content": "Mean girls never out grow that behavior...",
          "id": 151,
          "comments": [
            {
              "score": 229,
              "content": "I can't imagine being that sad that I can't bare to watch someone be happy for the little things.",
              "id": 152,
              "comments": [
                {
                  "score": 26,
                  "content": "Seriously! Shiting on the things that people love is not cool. How miserable must you be to project that onto others. \n\nWish the girl with the notes could see this thread and know about all the support she has.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Me too, she deserves to feel good about herself and if she saw this thread, I think it would be more than a two second smile. 🤗",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Sure they do, sometimes! My most terrifying tormentor in high school grew up to be a kind, lovely person. My sister had a chance encounter decades later with a guy who bullied her in high school, and he apologized for his rotten behavior back then.\n\nTry not to write people off when they're still dumb teenagers. LW has a long way to go in life, and may learn kindness and consideration yet.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 256,
          "content": "Not dangerously close, is.",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Not dangerously close, she IS a bully.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Not dangerously close. This WAS bullying.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2061,
      "content": "YTA\n\nSometimes my husband leaves little notes in my lunch. I’m passed thirty. Small things make people feel good. You knew this made her feel good and still went at it? There was no need for you to say anything at all.\n\nThink of the two of three rule;\n- Is it true?\n- Is it kind?\n- Is it necessary?\n\nIf you can’t meet at least two of those three criteria, you need to keep your mouth shut. This wasn’t kind. It wasn’t necessary. And personally? It wasn’t true. I find that kind of gesture sweet well into my adulthood.",
      "id": 159,
      "comments": [
        {
          "score": 330,
          "content": "It's a bummer that OP thinks she needs a reason to not judge people. Whether or not kiddo has a bad home life, there's just no reason to rain on somebody's parade like that.\n\n\nFrom the way OP talks about her she sounds a little annoyed by how quiet and shy she is, I'm wondering if she's jealous her friends are reaching out to this new girl or something?",
          "id": 160,
          "comments": [
            {
              "score": 75,
              "content": "From the way OP describes the girl, it sounds like OP has been judging this girl from afar for a while now and only interacted with her because OP's friend invited the girl to eat with them. The fact OP felt the need to introduce the girl as \"a little weird tbh\" is just. Wow. OP, are you going to run around judging every shy and quiet person, then bully them because you find the things they enjoy weird? You're so totally an AH it's incredible.",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Yep, she could see it made the girl smile and dumped on it anyway. That’s far more childish than having notes left in your lunch.\n\nAnd yeah. It suggests close/cliquey friend group and OP doesn’t want to make room for one more",
              "id": 162,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Yeah, I leave notes in my 30y husband's lunch sometimes too. Words of affirmation is his love language and it's such a small thing I can do that makes him really happy.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I love these little rules. In line with the “is it necessary” I always liked \n\nDoes this need to be said?\n\nDoes this need to be said BY ME? \n\nDoes this need to be said by me NOW?",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1468,
      "content": "Of course, YTA.  It costs nothing to be kind.",
      "id": 165,
      "comments": [
        {
          "score": 234,
          "content": "Say it louder for the people in the back! 👏",
          "id": 166,
          "comments": [
            {
              "score": 364,
              "content": "#it costs nothing to be kind!!!",
              "id": 167,
              "comments": [
                {
                  "score": 24,
                  "content": "# IT COSTS ABSOLUTELY NOTHING TO BE KIND!!!!!!",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "It’s not working. Even louder pls.",
                  "id": 169,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}