{
  "post content": "First off, I want to state I am expecting an everyone sucks, as what everyone did was a bit out there, but I was ruthless. Secondly, I am going to try and give as much as I know from her side too so as much from both sides I can give are on the table and can be better evaluated. Third, I do suffer from schizoeffective disorder so I am also not always in the right state in my life. This is going to be a long one.\n\nTo kind of get a hint of what kind of relationship we had, we had a long distance online relationship that started with us being friends for a couple years. When we started dating I was 18 and she was 16, her in California and me in Indiana, the Romeo and Juliet law in Indiana being within 4 years of the adults age the minor is allowed to be with them, but her its still the age of 18 so I knew there would be risk. We also kind of grew more towards each other as we shared similar traumas, we are both child abuse victims, and both rape victims and we kind of were able to help each other through our experiences as we knew what it was like.\n\nWe got together after I asked her out (not a catfish, we had video called before) in October of 2017. We kept things going until December of the same year, her getting into trouble and getting grounded from the internet, and I told her I would wait for her. I kind of kept in touch with her friend when she got back online and we didnt contact each other directly as her mom knew about me and didn't like me. Finally on my 19th birthday I had to get back in touch, and created a secondary account akd contacted her, and we reconnected and continued our relationship.\n\nWe kept a nice relationship going for a while, her having really picked up art in our time apart, her even offering to draw one of my characters (this comes up later). We kept talking and she eventually confessed that she suffered from depression and told me that she does edibles and takes hits from the weed vape thing ( I don't care to know what they are called) and she was scared to tell me as she knows I dont like it due to the connections of my abusive alcoholic parents also being drug dealers. I told her it was fine, she had a decent reason to use it, but one of my main goals is to get her happy enough that she doesn't need it anymore, and I succeeded eventually.\n\nAnother thing she suffered from was her mom's boyfriend, he was constantly when her mom wasnt home groping her and sneaking into her room at night and stripping her (he didn't rape her, that was about a year before we got together) and finally after he got arrested for paying for prostitution her mom finally decided to press charges as he was also found with stolen items and drugs. A detective came to her house and got her side of it, and asked if she told anyone and she mentioned me, in which turn they asked if I was willing to talk to them about what I know. I agreed to do it for her, even knowing I was at risk of legal trouble considering the ages, and I had also seen nudes of her. I luckily didn't get in any trouble and they never askes about that, but at home her mom accused her of seducing her boyfriend and that she wanted to fuck him and smack her around for it. I offered when she turned 18 I would go down there and pick her up, taking her to my place and she could be safe with me and she was happy too, so I spent some time saving up, asking her too as well to make things easier but she was addicted to buying art, which consisted mostly of my character and hers as a couple even though I asked her repeatedly not too.\n\nAfter sometime she grew a bit distant and then one day her mom called me talking about her and some other guys, one of which was her in a group chat with a bunch of gay guys who would send nudes to each other and stuff, I kind of let it slide. There was this other guy though, who in her contacts was known as E. I confronted her about it amd she confessed that when we were separated that she didnt know if I would wait for her, so she started looking and found him, apparently not telling him about me when I came back, not wanting to upset him. I also now regrettably let that slide as she came clean and stuff, sending me screen shots. I forgave her and we started to grow together a bit more. We had our 1 year anniversary, I bought her some gifts and stuff, and we spent the day together. Then we started to grow apart again and our relationship went on for another couple of months, of which we had a switch of me moving to her as she may have a job lined up at pixar with a friend she knows there, not that it mattered anymore.\n\nI tried my hardest to keep the relationship interesting as she said she was growing bored but everything I tried she shot down until eventually we split up and decided to be friends. She said I made her happy but she wasn't sure if I was something she wanted to spend there rest of her life with, I asked if there was any chance of us getting back together amd she said no, I later found out why.\n\nAfter a couple of weeks we were talking and she was upset at first, saying she finally worked up the courage to break things off with E, later turns out he was talking to other girls behind her back as she was talking to him behind my back. I talked her down until she wasnt sad and even happy. Then she randomly told me her parents weren't home, which confused me as she only told me that when she was horny and wanted to vid call or something, so I asked about it amd she said she had a secret to tell me and couldnt tell with her mom around and had to do it while actively deleting the post. What she told me was a fucking atomic bomb, but I wont say what it was until later.\n\nAnyway, she asked me if I would let her keep my character as she saw it as a power couple and wanted to keep them together. I told her no and that I was kind of hurt by her comment, then she continued to say she was sorry and that she was hoping I would say yes to make things easier. She planned on using them whatever my answer was so I got angry with her. The next day I said fuck it and that I didnt care but she could tell I was bitter and told me if I want him back that I would pay her the money she put into it without my permission and I got on her about blackmail and all that even though she argued it wasnt blackmail. Eventually I said fuck it and left it open and even more bitter.\n\nThen she had the dumbest idea in human fucking history. She wanted me to meet her new boyfriend, which I understood why we wouldnt get back together as she had moved on in less than a week. Me being upset and now depressed I didn't want to but she decided to put us in a group chat anyway. I tried being civil and kind of state stuff and when I mentioned being somewhat depressed he tried saying it was my fault that people treated me badly and yada yada. So I left the group chat and she got mad at me saying I am the asshole and I need to grow up and kept throwing me back in a group chat with him saying I needed to work out my problems with him as he kept actively calling me a pussy, bitch and that I wouldmt last a day where he was from typical tough guy shit. I kept leaving as they both attacked me and she told me I was being immature and I was attacking him and need to apologize yada yada.\n\nI finally asked her about him, she had KNOWN him for 3 weeks, he was the guy she went crying to about our relationship saying she wasnt happy without talking about it at all with me to try and help our relationship grow. He was the guy who said she should leave me and she got with him while still talking to E and before she left me. I also found out she was cheating on her old boyfriend with me before getting with me so she is in a vicious cycle. Then she told me he had the passwords to her accounts and hers to his (something she wouldnt do with me, now I get why) saying they dont lie to each other. I brought up the big secret she told me and she told me to not dare tell him so I already caught them in a lie. She had also already sent him nudes in the 3 weeks she known him, pretty much admitted to me that she cheated on me. I still decided to be the civil one but I refused to talk to him. I even tried telling her he was a fuck boy, I guess on Reddit it would be r/niceguy and she wouldnt have it.\n\nFor the next two days she kept throwing me in group chats that I kept ignoring, her pleading with me to make peace with him because I am one of the only two people in her life that truly make her happy, me and him, so at this point I knew she didn't give a fuck about me. So I told her no, and I suggest she stop because I am tired of her and her time with me she should know that what I have done to other people who crossed me I am not one to be fucked with.\n\nThey both kept fucking with me....and I snapped going to his direct message sending him a screenshot of her big secret without even saying a thing to her.\n\nShe had sex with her dog. I put on the screen shot saying when she cheated on me she had the decency to do it with another human.\n\nI followed up in her DM saying that I am not one to be fucked with and she gave a quick fuck you, then blocked me. He followed up messages to me saying she was crying, at this point I truly didn't care, I was on a warpath. I told that her future is in my hands, and that I still had the number of the detective I risked myself to talk to for her and he immediately broke down, telling me I win, don't tell him or her mother he said I hurt her enough and what else could I possibly want from her. I told him I don't really have a reason to not tell them, I didnt care anymore. He broke down, pleading with me, telling me I win, apologizing, asking me what I want to get this to stop. I said I want one thing, exactly that, I didn't even say what it was, nor did I really even think about what it was, but he had a hell of a guess. He said he would leave her for good, block her, remove anyway to contact her, I said fuck it and let it happen, he apparently didnt care enough if he would drop her that fast. He followed through, I wasn't done though.\n\nI got on a secondary account and followed up to her, she was broken, telling me she shouldn't have gave up on our relationship, she shouldnt have cheated on me, shouldn't have picked sides or treat me like shit, shouldn't have left me so on and so fourth. I said I didnt care, after how she ripped my heart out I was on a warpath, willing to ruin her life, saying that would pixar of all companies hire her if she had a record on her stating she had sex with her dog yada yada. She said she would do anything, I started by asking for an apology, she told me no, that I don't deserve one so I said fuck it and tried contacting her mom, who told her about me trying to contact her mom so my ex knew I was serious. Then bowed down, and apologized. I told her that she couldn't ever contact him again she agreed and that she can't ever use my character again, which she reluctantly agreed. I had spread out to her friends what she did and she got looked at like a freak by them amd ruined her social life as well, having to start fresh. I thought it was done.\n\nFast forward to the begin of the year and I was scrolling through my DM list and saw that he had changed his profile pic....to my character, she had turned around and got right back with him and gave her my character. I hunted her down which she avoided me knowing the fury I would unleash. I finally got back in contact with her and said I will let it slide of them getting back together, but she wasnt allowed to use my character, while at the same time contacting the artist she had draw it and telling them it was stolen, blacklisting her as an artist. She tried telling me its not my character because she put money into it which didnt go far, then tried saying its fine because she changed the design a bit, which was a flat out lie, she just renamed them. She also tried lying to me saying they werent together but I squeezed it out of her, her saying the time between what happened that she was suicidal and he cried any time she tried talking to him. I didnt care, and even found a bit funny about him (dark I know). She told me she grew bored and started to talk to other guys months before leaving me, never omce talking with me and she kept with me out of pity trying to say it was all about me, her staying to make me happy even though I told her I wanted her happy even if it meant leaving me while we were together, and I spent so much anf pointed out that she just shit on me for half the relationship. To shorten this bit she kept telling me our break up was my fault and I was a piece of shit to her yada yada.\n\nI finally said fuck it, and sent her a screen shot showing I still has the detective's number. She told me go ahead, I would get in trouble since she sent me nudes and she would be safe. I pointed out that I am protected by my laws and she sent them without me asking or anything consentually, that and I didn't give a shit what happened to me. That shut her up quickly. I told her she camt use my character and I would be watching, she gave a conceited fine whatever, I don't care. He bf changed his profile pic and she deleted the posts of my character.\n\nFlash forward to now, her bf now having my character back as his profile and me not having done anything yet.\n\nMy questions, am I the asshole? Should I still try to tell her mom or the police? Should I try to contact him and confront him? Should I leave it be and let her destroy her life with her cheating cycle? I know its long but if you read to this point thank you, I don't know what to do anymore.",
  "id": 1,
  "comments": [
    {
      "score": 58,
      "content": "ESH\n\nThe amount of mental illness in this post is outrageous. Everyone here needs to seek help and sunlight immediately.",
      "id": 2,
      "comments": [
        {
          "score": -11,
          "content": "I mean, in my defense I did point out a couple mental illnesses beforehand so I not entirely sure what you expected. Thanks for the feed back though",
          "id": 3,
          "comments": [
            {
              "score": 14,
              "content": "IDK what I expected when I started reading that story either, but it way exceeded anything I could have imagined.",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 44,
      "content": "That’s a lot to unpack. Just go to therapy and meet a girl who doesn’t fuck dogs.",
      "id": 5,
      "comments": [
        {
          "score": 9,
          "content": "When you put it that way it sounds so easy. lmao.",
          "id": 6,
          "comments": [
            {
              "score": -2,
              "content": "When you live most of your life with hallucinations from mild schizophrenia that causes major mood swings on top of being shit on by pretty much everyone you know you kind of grow to not really give a shit about anything. Life does have the ability to get so bad you loop back around from depression to flat out not giving a shit",
              "id": 7,
              "comments": [
                {
                  "score": 14,
                  "content": "Life is what you make of it buddy. We're all dealt different hands, but that doesn't mean you can't rise above expectations.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm schizo too, life sucks but there are good times. Keeping drama like this going is not productive to a good life, though.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "no tldr, scroll to the comments. \n\n...a girl who doesn't what now?\n\nScroll back up.",
          "id": 10,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Therapy isn't working out too much and the second one is going alright, thanks for the advice though",
          "id": 11,
          "comments": [
            {
              "score": 12,
              "content": "Therapy is a marathon not a sprint my friend. Stick with it. Trust me it will get better.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Don't stop therapy. Find a new one if you can and aren't clicking with this one, but don't stop going.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18,
      "content": "YTA\n\nStop caring about your “character”. You’re an adult, some kid stole your plaything, time to let it go and make a new one.\n\nStop going on the warpath. The relationship is over. Her social circle, parents, past, boyfriends, legal troubles, online accounts, all of that should be taken out of your life and forgotten about. It’s over. Move on.\n\nThis girl is mentally damaged. A grown man assaulted her and she is acting out by sleeping around, making criminal decisions, leveling threats, and being a bitch. The kid needs therapy, not an Internet boyfriend.\n\nYou are obsessing over this kid. She is an Internet girlfriend. I get it, my first relationship was online and fully half of my boyfriends (over a decade of dating) started that way. An Internet relationship with annual get-togethers is 99% in your heads. Move on, let it go. This kid is making bad decisions, You we never close in the traditional sense. You guys relied on each other in one way but when times were tough you lashed out at each other. It was never a healthy relationship. You’re both making stupid kid decisions, only you’re an adult now.\n\nForget this girl, forget the character, forget all this crap about her boyfriend and the law. It’s over. Asking for validation or advice about this is essentially creepy.\n\nPut you efforts into getting professional help about your volatile anger, passive aggression, lack of empathy (she is an assault victim and child who acted out with the dog, she is a victim who needs help - not shaming or derision), inability to choose the right romantic partners, and obsessiveness.\n\nStop dating teens. Stop dating long distance online. Stop acting like your characters have more value than anything else. Stan Lee wouldn’t give a character to a girlfriend. Either you respect your art and keep it on the up and up, or you act like a little kid with his favorite toy dinosaur. Stop acting like a child. Stop judging this abuse victim, and leave her behind you. Stop fixating.\n\nYou’re a man now. Take care of yourself and your mental illness. Make some IRL friends your own age. You can only do this if you clear your mind of this drama from your past, and really try to be present in your own skin.\n\nGood luck and next time don’t be the asshole even if you think it’s warranted.",
      "id": 14,
      "comments": [
        {
          "score": 4,
          "content": "Well, both of them are in the wrong, I get it, she is mentally ill, but that doesn't give an excuse to cheat on someone nor to steal a copyrighted material from him, and then blaming him for \"destroying\" the relationship, yes, his reaction was a bit much, but she shouldn't have gotten him in a group chat with the her new boyfriend just to make OP feel like a an asshole and a \"pussy\", it was a power move, she tried to tell him \" look, my boyfriend is way stronger than you\", while I agree that OP shouldn't have told all of these people about the dog thing, he should have just stop after showing her boyfriend the screenshot.\n\nBut when it comes to the character, yes he is an adult who shouldn't care about stuff like this, but he has every single goddamn right to ask her to not use, since he created it, it is his, and she has no right to steal it.\n\nYes, she is mentally damaged, yes OP overreacted, but you made it look like this girl is an angel.",
          "id": 15,
          "comments": [
            {
              "score": 6,
              "content": "The girl was making a lot of bad decisions but being in a house with a creepy stepdad is one decision she didn’t make. All her “boy drama” maybe stems from the sexual trauma. Having two guys fight it out over chat -ridiculous teenage move, can’t believe three people thought this was a reasonable way forward. So yes the teen drama is coming from all sides, but she’s not the one asking if she’s an asshole. From her point of view, maybe she isn’t, but yes you’re right maybe she is. I don’t think we have enough info to decide if she’s an asshole. Insofar as the character, maybe op has the right to it and can make demands about it, but I meant to suggest he be the bigger person and just let go. Obviously the girl is making a lot of reactionary decisions that make drama, so it’s time to disengage even if she owes him money. Lose the battle, win the war for dignity, you know?",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Fucking, touchè, I do see where you are coming from and in all honesty I never really cared about the character, for me is was just the premise, that I realised I stopped caring about after I vented most of this. I can see where you are coming from but I also failed to mention that there was about a 6 month gap between the assault and what she did with the dog, in which turn she had a few nights of drunken underage rants to me. Also, she was apparently sleeping around before hand, and had once told me before hand she was curious so this was less of an outlet from the assault, but I do get what your saying and I so appreciate the feed back. I do see many points where I should have just let go",
          "id": 17,
          "comments": [
            {
              "score": 8,
              "content": "You think 6 months washes away all that trauma? Also, chances are that wasn’t the only incident she had to endure at home. \n\nYTA x’s 1,000,000. ",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Is there a clock that ticks down fir when you get over trauma? Cause I'd like to know when my fucking timer goes off",
              "id": 19,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "SHP. What are you, 12? ",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH, holy toxic. YTA for constantly threatening to blackmail her with nudes she sent to you, and using that blackmail to try and control who she is seeing. The saying “two wrongs don’t make a right” fits here. \n\nShe left you.... given that she cheated and was screwing a dog, I’d argue her leaving was a blessing and you dodged a bullet.  You get to be angry and hurt, but actively seeking to ruin her life is over the top. Also sounds like you are playing with fire given the mental illness involved here, and mentions of suicide. Keep pushing, and you might help push her off a ledge. \n\nImagine if you devoted all this energy into something constructive or finding a new partner that is a better fit? \n\n",
      "id": 21,
      "comments": [
        {
          "score": 0,
          "content": "I never threatened her with the nudes, I never kept them, though admittedly I did blackmail her with the story, it wasnt my original plan and I should have just said something to her mom so she could be taught a proper lesson about it and be given the proper help she needs. But she pleaded and bribed which got me started on demands I shouldnt have made",
          "id": 22,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "You do too much man. This ain’t real life. ",
      "id": 23,
      "comments": [
        {
          "score": 1,
          "content": "If you are trying to say this is fake why the hell would anyone go into this much detail then ask for advice? I do also still have the screen shot story she sent me.\n\nIf you are trying to say this is batshit insane then yes, agreed",
          "id": 24,
          "comments": [
            {
              "score": 6,
              "content": "Nah I mean you’re too invested in nonsense, this ain’t real life man forget about it. ",
              "id": 25,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "This should be on a revenge sub...",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nFirst off, I want to state I am expecting an everyone sucks, as what everyone did was a bit out there, but I was ruthless. Secondly, I am going to try and give as much as I know from her side too so as much from both sides I can give are on the table and can be better evaluated. Third, I do suffer from schizoeffective disorder so I am also not always in the right state in my life. This is going to be a long one.\n\nTo kind of get a hint of what kind of relationship we had, we had a long distance online relationship that started with us being friends for a couple years. When we started dating I was 18 and she was 16, her in California and me in Indiana, the Romeo and Juliet law in Indiana being within 4 years of the adults age the minor is allowed to be with them, but her its still the age of 18 so I knew there would be risk. We also kind of grew more towards each other as we shared similar traumas, we are both child abuse victims, and both rape victims and we kind of were able to help each other through our experiences as we knew what it was like.\n\nWe got together after I asked her out (not a catfish, we had video called before) in October of 2017. We kept things going until December of the same year, her getting into trouble and getting grounded from the internet, and I told her I would wait for her. I kind of kept in touch with her friend when she got back online and we didnt contact each other directly as her mom knew about me and didn't like me. Finally on my 19th birthday I had to get back in touch, and created a secondary account akd contacted her, and we reconnected and continued our relationship.\n\nWe kept a nice relationship going for a while, her having really picked up art in our time apart, her even offering to draw one of my characters (this comes up later). We kept talking and she eventually confessed that she suffered from depression and told me that she does edibles and takes hits from the weed vape thing ( I don't care to know what they are called) and she was scared to tell me as she knows I dont like it due to the connections of my abusive alcoholic parents also being drug dealers. I told her it was fine, she had a decent reason to use it, but one of my main goals is to get her happy enough that she doesn't need it anymore, and I succeeded eventually.\n\nAnother thing she suffered from was her mom's boyfriend, he was constantly when her mom wasnt home groping her and sneaking into her room at night and stripping her (he didn't rape her, that was about a year before we got together) and finally after he got arrested for paying for prostitution her mom finally decided to press charges as he was also found with stolen items and drugs. A detective came to her house and got her side of it, and asked if she told anyone and she mentioned me, in which turn they asked if I was willing to talk to them about what I know. I agreed to do it for her, even knowing I was at risk of legal trouble considering the ages, and I had also seen nudes of her. I luckily didn't get in any trouble and they never askes about that, but at home her mom accused her of seducing her boyfriend and that she wanted to fuck him and smack her around for it. I offered when she turned 18 I would go down there and pick her up, taking her to my place and she could be safe with me and she was happy too, so I spent some time saving up, asking her too as well to make things easier but she was addicted to buying art, which consisted mostly of my character and hers as a couple even though I asked her repeatedly not too.\n\nAfter sometime she grew a bit distant and then one day her mom called me talking about her and some other guys, one of which was her in a group chat with a bunch of gay guys who would send nudes to each other and stuff, I kind of let it slide. There was this other guy though, who in her contacts was known as E. I confronted her about it amd she confessed that when we were separated that she didnt know if I would wait for her, so she started looking and found him, apparently not telling him about me when I came back, not wanting to upset him. I also now regrettably let that slide as she came clean and stuff, sending me screen shots. I forgave her and we started to grow together a bit more. We had our 1 year anniversary, I bought her some gifts and stuff, and we spent the day together. Then we started to grow apart again and our relationship went on for another couple of months, of which we had a switch of me moving to her as she may have a job lined up at pixar with a friend she knows there, not that it mattered anymore.\n\nI tried my hardest to keep the relationship interesting as she said she was growing bored but everything I tried she shot down until eventually we split up and decided to be friends. She said I made her happy but she wasn't sure if I was something she wanted to spend there rest of her life with, I asked if there was any chance of us getting back together amd she said no, I later found out why.\n\nAfter a couple of weeks we were talking and she was upset at first, saying she finally worked up the courage to break things off with E, later turns out he was talking to other girls behind her back as she was talking to him behind my back. I talked her down until she wasnt sad and even happy. Then she randomly told me her parents weren't home, which confused me as she only told me that when she was horny and wanted to vid call or something, so I asked about it amd she said she had a secret to tell me and couldnt tell with her mom around and had to do it while actively deleting the post. What she told me was a fucking atomic bomb, but I wont say what it was until later.\n\nAnyway, she asked me if I would let her keep my character as she saw it as a power couple and wanted to keep them together. I told her no and that I was kind of hurt by her comment, then she continued to say she was sorry and that she was hoping I would say yes to make things easier. She planned on using them whatever my answer was so I got angry with her. The next day I said fuck it and that I didnt care but she could tell I was bitter and told me if I want him back that I would pay her the money she put into it without my permission and I got on her about blackmail and all that even though she argued it wasnt blackmail. Eventually I said fuck it and left it open and even more bitter.\n\nThen she had the dumbest idea in human fucking history. She wanted me to meet her new boyfriend, which I understood why we wouldnt get back together as she had moved on in less than a week. Me being upset and now depressed I didn't want to but she decided to put us in a group chat anyway. I tried being civil and kind of state stuff and when I mentioned being somewhat depressed he tried saying it was my fault that people treated me badly and yada yada. So I left the group chat and she got mad at me saying I am the asshole and I need to grow up and kept throwing me back in a group chat with him saying I needed to work out my problems with him as he kept actively calling me a pussy, bitch and that I wouldmt last a day where he was from typical tough guy shit. I kept leaving as they both attacked me and she told me I was being immature and I was attacking him and need to apologize yada yada.\n\nI finally asked her about him, she had KNOWN him for 3 weeks, he was the guy she went crying to about our relationship saying she wasnt happy without talking about it at all with me to try and help our relationship grow. He was the guy who said she should leave me and she got with him while still talking to E and before she left me. I also found out she was cheating on her old boyfriend with me before getting with me so she is in a vicious cycle. Then she told me he had the passwords to her accounts and hers to his (something she wouldnt do with me, now I get why) saying they dont lie to each other. I brought up the big secret she told me and she told me to not dare tell him so I already caught them in a lie. She had also already sent him nudes in the 3 weeks she known him, pretty much admitted to me that she cheated on me. I still decided to be the civil one but I refused to talk to him. I even tried telling her he was a fuck boy, I guess on Reddit it would be r/niceguy and she wouldnt have it.\n\nFor the next two days she kept throwing me in group chats that I kept ignoring, her pleading with me to make peace with him because I am one of the only two people in her life that truly make her happy, me and him, so at this point I knew she didn't give a fuck about me. So I told her no, and I suggest she stop because I am tired of her and her time with me she should know that what I have done to other people who crossed me I am not one to be fucked with.\n\nThey both kept fucking with me....and I snapped going to his direct message sending him a screenshot of her big secret without even saying a thing to her.\n\nShe had sex with her dog. I put on the screen shot saying when she cheated on me she had the decency to do it with another human.\n\nI followed up in her DM saying that I am not one to be fucked with and she gave a quick fuck you, then blocked me. He followed up messages to me saying she was crying, at this point I truly didn't care, I was on a warpath. I told that her future is in my hands, and that I still had the number of the detective I risked myself to talk to for her and he immediately broke down, telling me I win, don't tell him or her mother he said I hurt her enough and what else could I possibly want from her. I told him I don't really have a reason to not tell them, I didnt care anymore. He broke down, pleading with me, telling me I win, apologizing, asking me what I want to get this to stop. I said I want one thing, exactly that, I didn't even say what it was, nor did I really even think about what it was, but he had a hell of a guess. ",
      "id": 27,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "#[State of the Subreddit](https://www.reddit.com/r/AmItheAsshole/comments/ahr1xg/state_of_the_subreddit/)\n\n\nIf you want your comment to count toward judgement, put one of the following abbreviations at the beginning of your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top comment.\n\n\nJudgement | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 28,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH - Now get over it, move the fuck on, and grow up.  She's a terrible girlfriend that's obvious, now stop trying to ruin her life....",
      "id": 29,
      "comments": [],
      "relation": "Attack"
    }
  ]
}