{
  "post content": "My (23f) parents have always told me I am welcome here and wouldn’t have to worry about paying rent to live at home, as I should be saving up for my own home while I’m here (up until a reasonable age of course.) \n\nRecently my mom has presented the idea of me paying rent because my parents are tight on bills, which I wholeheartedly understand but I do not agree with. I just got into a car accident, so I have no transportation and I’m saving for a new car. And I’m also going to finish school (which was interrupted due to covid.) I’m also desperately trying to move out, because quite frankly, my house is disgusting. I do my fair share of cleaning, but it’s beyond Dawn Powerwash. There’s been a hole in my bathroom ceiling for the past 2 years because my dad tried to “fix a leak” (yes it is still leaking), we have a mouse problem, it smells like dog pee all the time, and I just don’t want to pay rent to live someone where where the landlords can’t fix anything, even if they are my parents. Everything in the house is grimy, cluttered, and my mom refuses to actually start throwing stuff away that she doesn’t need. If I would have known they would start charging me this soon, I would have made my financial decisions much differently. But in my area, it’s nearly impossible to afford a place without a roommate or making 3x the rent. The conversation with my mom wasn’t heated, but I certainly did express my concerns. I don’t want to feel like the freeloading child (which I am not when I’m actively trying to get my life together and move out, but my brother (21m) has no plans or intentions on moving out) but i am not planning on staying here when I am financially in a place to leave. Am I in the wrong for thinking this way?\n\nEDIT: my parents are not poor. They will not lose the house or anything else. I pay ALL my own bills already. And they don’t want me to HAVE to pay rent, and they are not kicking me out because of that.\n\nEDIT#2: this was a PROMISE, and includes not paying utilities, trash, etc because I was expected to be saving. They were especially promising of this BECAUSE i was going to school full time and knew I would need time to pay off student loans, find a job, etc. I would have never came home or went to a 4 year university had I not had this option. Also, my parents are bringing up struggling AFTER my dad doubled his salary, DIRECTLY after my accident and DIRECTLY after I mentioned I am going back to finish school. I am grateful for my parents, but a promise that I made my life plans around was broken, and the timing of this seems really off to me.",
  "id": 1,
  "comments": [
    {
      "score": 28,
      "content": "NAH\n\nYour parents can't afford to support you completely. You don't want to pay rent to live in a crappy place.\n\n\nBut, ultimately, it's their house. So you need to pay rent or figure out a way to move out. Even if that's with 3 roommates. You aren't entitled to live there for free just because you want to save up.\n\n\nAlso, your brother is 2 years younger than you. You weren't paying your parents rent at 21.",
      "id": 2,
      "comments": [
        {
          "score": -14,
          "content": "And the point of rent free living was so I could save up so that makes no sense to meet. We are not going to lose the place if i can’t help paying rent. And my parents have even considered selling the house, buying a new one, and still letting me move in so it doesn’t make sense to me",
          "id": 3,
          "comments": [
            {
              "score": 6,
              "content": "You said they are having trouble paying bills.\n\nAre you contributing at all? Buying household supplies, any utilities, buying groceries? \n\nYou could still save up by paying way less than market rate at your parents', while making it easier on them to pay bills.",
              "id": 4,
              "comments": [
                {
                  "score": -6,
                  "content": "Yes I buy my own groceries, my own personal items, my own gas when I did have my car, my own clothes, I don’t ask them for help with anything",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -16,
          "content": "No because I was in school at 21, my brother was not.",
          "id": 6,
          "comments": [
            {
              "score": 7,
              "content": "You're not the asshole if you decide you don't want to pay out and move. You are the asshole if you insist on staying and not paying the rent they're asking.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 26,
      "content": "YTA. Until you move out, you should pay rent. End of story. Your excuses are weak",
      "id": 8,
      "comments": [
        {
          "score": -13,
          "content": "When I went to college I was told I would not have to pay rent if I came back home. And now that it’s being presented I am not in a place to financially afford rent, a new car, school AND still save up to move out.",
          "id": 9,
          "comments": [
            {
              "score": 19,
              "content": "Well they changed their mind. Your an adult. You need to act like it. I’m not saying you should pay them thousands of $$, but at least contribute something",
              "id": 10,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "YTA. You're 23 years old. Time to grow up, and start acting like an adult.",
      "id": 11,
      "comments": [
        {
          "score": -9,
          "content": "I AM acting like an adult. I Pay all my own bills. And I am keeping up my end of the bargain by cleaning, and saving up my money which was the point of me not paying rent",
          "id": 12,
          "comments": [
            {
              "score": 26,
              "content": "You’re not paying all your bills though. If you were, you’d be paying your share of the mortgage, taxes, insurance, electricity, water, sewer, and trash pickup.",
              "id": 13,
              "comments": [
                {
                  "score": -3,
                  "content": "And the reason I’m not is because they didn’t want me to. Because they wanted me to save while I’m at home.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 11,
                      "content": "You just said they asked you to because they’re short on money",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Like I said. Grow up. Your parents need help, and have asked you to pay rent. You need to suck it up, and pay rent.",
              "id": 16,
              "comments": [
                {
                  "score": -3,
                  "content": "I am grown I pay for all my own shit. Never asked them for a thing once I turned 18. THEY are the ones who promised no rent because they wanted me to save up to find my own place",
                  "id": 17,
                  "comments": [
                    {
                      "score": 5,
                      "content": "You don't pay for your own shit. Ask your parents to tell you how much all the household expenses are. Food, utilities, mortgage, internet etc. Then divide it by how many people are living in the home. If you aren't paying at least your portion of the household expenses, you aren't \"paying for all your own shit\". Your parents said they needed help. Step up and help them.\n\nYou seem to be mad that no one is taking your side. I'm sorry, but I won't be the one to agree with you.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "[deleted]",
      "id": 19,
      "comments": [
        {
          "score": 3,
          "content": "I live in their house. I have my own bills including school, groceries, credit cards, and phone to pay",
          "id": 20,
          "comments": [
            {
              "score": 9,
              "content": "Lol, everyone has their own bills to pay. Do you think people that pay rent/a mortgage don't pay for groceries, school, their phone, car etc?",
              "id": 21,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "[deleted]",
              "id": 22,
              "comments": [
                {
                  "score": 5,
                  "content": "This is my first year living here as an adult, as I was living in the dorms right after high school. And I would love to help them if I could, but I’m already strapped for money myself. I had a whole plan in tact which got derailed due to unfortunate circumstances like a pandemic and a car accident. It’s not my plan to stay forever and never was, but the plan wasn’t to have an extra bill while i was promised I could stay here and save up as much as I could",
                  "id": 23,
                  "comments": [
                    {
                      "score": 12,
                      "content": "[deleted]",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "You're making extra expenses by living there. You use water, gas and electric. Do you pay for your own food?",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "YTA Your not a freeloading child your currently a freeloading adult. If you live with your parents at 23 and they need help paying bills charging you rent seems like a reasonable idea even if it was not the original plan.",
      "id": 26,
      "comments": [
        {
          "score": 5,
          "content": "You’re ^2",
          "id": 27,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "YTA.  If you don’t like it, move out",
      "id": 28,
      "comments": [
        {
          "score": -6,
          "content": "I WANT TO. I WOULD LOVE TO LIVE SOMEWHERE WHERE MY CEILING DOESNT LEAK WHILE IM TAKING A LEAK. If they were actual landlords I would absolutely not be paying to live in such conditions.",
          "id": 29,
          "comments": [
            {
              "score": 11,
              "content": "So do it and stop complaining",
              "id": 30,
              "comments": [
                {
                  "score": -6,
                  "content": "I’ll complain if I want because I don’t want to pay to make sure I don’t have rat turds in my cereal.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Your replies to people’s suggestions to simply move out make me kinda think you’re not very mature and that YTA\n\nConsider yourself fortunate that you are allowed to live with your parents, I financed myself through college with loans, and was told I’m not allowed back once I graduated because at 22 I’m an adult. Not mad about it, and was happy to become self reliant. Built character.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "a spoiled, selfish YTA",
      "id": 33,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "Reading your replies, I don’t get the impression that you’re actually wanting the answer to AITA. I feel like you’re annoyed with your parents and looking for backup. \n\nWe all make agreements and have promises. Then the situation changes and we reevaluate and renegotiate. That’s just how life is, and it doesn’t always feel fair. Are you genuinely saying there is no amount you could be contributing right now? No number you can even start to negotiate with them just to make things a bit easier financially? Like $20-30 a week even?",
      "id": 34,
      "comments": [
        {
          "score": 1,
          "content": "After my own bills I have maybe $20-$40 left to put in my own savings. I need a new car and they know that. I am paying off student loans and they know that. I want to move out and they know that. That’s why they didn’t want me to pay bills. I would have never went to college in the first place or made any of the financial decisions that I did if I knew I was going to have to. They didn’t mention anything until after I lost my car and after my loan payments started kicking in which is why I’m pissed off. I’m literally in the worst place to start paying bills for them. Especially when I grocery shop and cook for them, and I’m the only one keeping the house somewhat clean.",
          "id": 35,
          "comments": [
            {
              "score": 1,
              "content": "I feel for you - the situation sucks - but the reality is that when you’re living alone stuff like this happens too. You have to have a car repair right after you had to pay an unexpected vet bill. You need to replace your laptop right before Christmas. You get laid off and then your fridge breaks. Times like that, you eat into your savings, or you eat into what you’d normally be putting into them. Learning how to navigate that in a scenario where your landlord isn’t just going to evict you isn’t the worst thing, to be honest. \n\nI don’t know if you’ve tried to negotiate this with your parents at all, but there has to be a compromise somewhere. They clearly have a reason for asking - if they’ve been accommodating so far, it seems unlikely they’d just do it out of spite. \n\nHave you tried asking if they can give you x amount of months to get on top of the car situation first? Or if there’s maybe a small household expenditure you could be responsible for instead? Or even just discussing ways as a household that you could save money? \n\nIf you just go into it with the mindset of “but you said [x] before so we can’t change the arrangement now” and being totally unwilling to compromise, why would you expect them to be willing to hear out your side of things? \n\nI’m genuinely trying to offer a solution. I know it sucks and I’m sorry for the timing of it, but if one of you isn’t willing to be a little bit more flexible, this situation isn’t going to change in any positive way for either of you.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "YTA. welcome to the real world.",
      "id": 37,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "OP having a literal tantrum in the comments speaks volumes on her entitlement and maturity. YTA",
      "id": 38,
      "comments": [],
      "relation": "Attack"
    }
  ]
}