{
  "post content": "There's is this huge bitch in a group chat I'm in. She is one of the popular girls and was picking on one of my friends. Now I'm a hockey player and quite popular myself so I decided to get into a argument. It went south and was full of personal attacks. Near the end I told her that she can suck my dick and she seemed to get very offended. She said she would report me to the teacher. \n\nAita?",
  "id": 1,
  "comments": [
    {
      "score": 48,
      "content": "ESH.\n\nMen insulting someone: \"Suck my dick!\"\n\nSomehow also men: \"Why does my gf find blowjobs demeaning?\"",
      "id": 2,
      "comments": [
        {
          "score": 7,
          "content": "Agreed. Shit like this can really fuck people up",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 21,
      "content": "YTA\n\nThere are a lot of ways to stand up for your friends without being a dick.",
      "id": 4,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 17,
      "content": "YTA - you intentionally got into an argument and crossed the line, you could’ve walked away at any point but you stooped to her level \n\nShe sounds like an asshole too tho",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "YTA, you said you wanted to get into an argument...so you were looking for a fight",
      "id": 6,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "ESH\n\nGranted, I'm taking your word that she is an asshole, and your word is suspect.\n\nNo, it is not okay to essentially threaten someone with sexual violence.\n\nAmong friends, who know each other well, it's okay. In the heat of an argument, out of anger? It makes you an asshole.",
      "id": 7,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "I feel like this is fake",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH. Not really different from any other insult, though I suggest going with the classic go fuck yourself in the future, to avoid potential issues.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "YTA. That’s a lame, sexually aggressive comeback. Also it sounds like you’ve been gearing up for this fight for a while. Maybe don’t interact with people you dislike so much?",
      "id": 10,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "YTA\n\nYou picked a fight and got sexually aggressive. Yes, you're the asshole.",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "[deleted]",
          "id": 12,
          "comments": [
            {
              "score": 2,
              "content": "Lots of posts may be fake. That doesn't preclude us from responding \"as if.\"",
              "id": 13,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Why does anyone comment on a stranger's situation online?",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "He's probably like 15. I went to school with hockey players who thought they were hot shit. Similar to how in the US guys would boast about being on the football team.",
              "id": 16,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "YTA and sexist",
      "id": 17,
      "comments": [
        {
          "score": -4,
          "content": "Its common insult",
          "id": 18,
          "comments": [
            {
              "score": 6,
              "content": "That doesn’t magically make it ok or not sexist",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Doesn’t make it any less sexist (or homophobic)",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}