{
  "post content": "My husband has been working really hard the last two years to advance at his company and he finally got the promotion he's been after. I'm really, really proud of him. His parents are too and wanted to take us all out to dinner to celebrate. My husband absolutely loves prime rib and there's only one place in our area that serves it so he picked that restaurant. Thing is- I'm not fond of steak. I'll eat it but very rarely. I prefer chicken or fish. I looked up the menu before leaving and right now they have a limited menu. The place had only one fish entree and two chicken entrees, and none of them sounded good for various reasons. I suggested that he pick someplace else so everyone can eat. He refused citing that we rarely get to go to this place but go to other places in our area regularly which is true, but those places have lots of variety so everyone can eat.\n\nHe suggested that I ask if they could prepare the fish or chicken without the marinades or sauces but I didn't want to be difficult for the kitchen staff. His next suggestion was that I order dessert while everyone else ate entrees and then when we were done, he would take me where I wanted so I could eat dinner while he and the kids ate dessert. So I opted to just not go because I didn't want to sit there not eating and not having a good time while everyone else was. My husband asked me to go so he could celebrate with the people most important to him. I told him no again and that he needed to get going before he was late. He did go but came back a little over an hour later with the kids and they all had to go boxes. He said he couldn't think of what to tell the kids about why I didn't go when they kept asking without lying or making me sound bad so he just got an order for them to go and let the kids spend some time with their grandparents talking in the parking lot. I told him he should had stayed but he said that I put him in a bad spot with the kids and that I knew he wanted everyone there and that I should've just gotten over my picky eating for one night. I maintain if he really wanted us to all eat dinner as a family then he should've picked a restaurant with a more accomodating menu.\n\nAITA?\n\nUpdate: Some of these comments were pretty harsh but a kick in the pants. I've apologized profusely to my husband and I am going to take him to that restaurant this weekend and buy him some camping gear he's been eying as a start to making it up to him and changing course.",
  "id": 1,
  "comments": [
    {
      "score": 96879,
      "content": ">My husband absolutely loves prime rib and there's only one place in our area that serves it so he picked that restaurant.\n\nSure! He's the man of the evening, makes perfect sense he gets to eat his favourite thingy. \n\n>Thing is- I'm not fond of steak. \n\nSo?\n\n>I'll eat it but very rarely. I prefer chicken or fish. \n\nAnd? \n\n>I looked up the menu before leaving and right now they have a limited menu\n\nOkay, that's a shame, but so what?\n\n>The place had only one fish entree and two chicken entrees, and none of them sounded good for various reasons\n\nThank you for listing some of those \"various reasons\" for us to consider. 'Preciate it. \n\n>I suggested that he pick someplace else so everyone can eat. He refused citing that we rarely get to go to this place but go to other places in our area regularly which is true\n\nOh, you suck so much. \n\n>He suggested that I ask if they could prepare the fish or chicken without the marinades or sauces but I didn't want to be difficult for the kitchen staff. \n\nWhy is it okay to be difficult for your husband - regarding a dinner that is happening for the sole purpose of *celebrating his achievement* \\- but *not* okay to be difficult for the kitchen staff, for whom making certain accommodations for guests is part of their job? \n\nWhy is your husband less worthy of that level of consideration and sacrifice? More to the point, why are you asking *him* to make that sacrifice? \n\n>His next suggestion was that I order dessert while everyone else ate entrees and then when we were done, he would take me where I wanted so I could eat dinner while he and the kids ate dessert.\n\nThis man is *bending over backwards* to appease you, just so he can do the one thing he wanted to do, that he never gets to do. Do you see the problem here?\n\n>So I opted to just not go because I didn't want to sit there not eating and not having a good time while everyone else was. \n\nI know I've said this before, but apparently it needs repeating. You see, a long time ago, we discovered that the Earth revolves around the sun, and not, in fact, around your silly ass.\n\n>My husband asked me to go so he could celebrate with the people most important to him. I told him no again and that he needed to get going before he was late.\n\nI'm sorry, something seems to be wrong with your post. I know there are actual words there, but all I seem to be able to read is \"ME ME ME ME, ME ME, ME ME ME, ME. MEEEEEEE. ME ME ME.\"\n\n>I maintain if he really wanted us to all eat dinner as a family then he should've picked a restaurant with a more accomodating menu.\n\nThat's nice. I maintain that if you don't understand why all of this makes you monstrously selfish, you have no business being married in the first place. Frankly, if you dislike your husband this much, so much that you can't even bear a single dinner of less-than-ideal choices for the sake of giving him a stress-free spotlight to celebrate under, well... I wonder why you're with him at all.\n\n**YTA**. So many times over.\n\n*EDIT*: I remain completely unable to predict which comments I make are going to strike the right nerve, but even so, this is a tad redonkulous.\n\nBut might as well make the most of it. I'm halfway through writing the second in a trans-positive fantasy novel series. If you like my style feel free to follow me, because I'll probably post news about that to my account page when I finally get through the damn thing. <3",
      "id": 2,
      "comments": [
        {
          "score": 31701,
          "content": "Yeah, OP’s post should have just ended with “I’m not fond of steak. I’ll eat it but very rarely.” Cool, STFU and eat it on this one rare occasion for your husband’s celebration. You don’t have a food allergy, you’re just picky and love making this all about you. What an AH. \n\nYTA, OP.",
          "id": 3,
          "comments": [
            {
              "score": 9328,
              "content": "It seems she dislikes a lot more than just the steak!!",
              "id": 4,
              "comments": [
                {
                  "score": 5348,
                  "content": "like her husband!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2909,
                      "content": "Something, something, not fond of meat...\n\nMaybe I'm being mean here, but odds on the husband posting in a dead bedroom sub if he's on Reddit?",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 694,
                      "content": "That's what I was going to say.  So, I assume she benefits from his promotion?  OP is definitely the AH.  She gaslighted him through the whole thing, ruined the celebration and then wanted to act like a martyr.  There is more wrong with this relationship and this is just an example of bigger issues.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 441,
                      "content": "Right, how could she NOT get over her bs for one night, a couple hours?!? \nFor her husband? Wow. \n\nYTA op, re-evaluate yourself.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 122,
                      "content": "[removed]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "I wonder what the rest of their relationship is like cuz she sounds like narcissist.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "\"OMG they cook the chicken in an oven at the SOUTH of the kitchen THE BARBARIANS!\"",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3273,
              "content": "What makes it worse is she flat out states she'll eat it on occasion - and yet apparently this important moment for her husband isn't a good enough reason to suck it up! They also had chicken and fish.. there is literally no reason not to go! Other than being cruel. Yta.",
              "id": 12,
              "comments": [
                {
                  "score": 2265,
                  "content": "I don’t eat seafood. At all. Like the smell makes me mildly nauseous. If there was some place that ONLY served seafood, that my husband was dying to go to (because he, on the other hand, LOVES it) I truly cannot see myself doing anything other than going with him. I’ll have some drinks and get happily buzzed and munch on some non seafood apps or sides. \n\nWhy? Because I love my husband, we’re a team, and I know he’d do the exact same for me (I mean the dude will eat absolutely anything but y’all know what I mean). \n\nI’m getting some major petty, contemptuous vibes coming from op so I think she’s got disdain for more than steak.\n\nETA: YTA op. Obv.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 517,
                      "content": "Same! I GAG if something even tastes fishy, I won't even touch seaweed. You know what? When my friends want to go to a seafood place (like, not even celebrating something... just on a normal night out) I get chicken. And if I'm worried it might be cooked on the same surface as the fish (has happened before), I just get a freakin salad. I went to a sushi restaurant for my friend's birthday, had a snack beforehand, and still managed to find something to eat.\n\nYTA",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "I love sushi and my boyfriend cannot stand seafood at all. Next week for my birthday we are going out for sushi and he's getting the one pork cutlet in the menu because he loves me and knows it's my favorite. I have food allergies and when my little brother and sister want to go to ihop I sit down and eat a couple strips of bacon and dry toast 🤷‍♀️ one mediocre meal is worth it for time with people you care about!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "My wifes allergic to shrimp. I love this fried shrimp place in the nearest city and that's what I wanted for my birthday. She's deathly allergic if she eats it but the smell makes her itchy. She took a Benadryl and we got my shrimp. \n\nI also hate edm music. We have seen every artist she likes and most multiple times.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1030,
                  "content": ">They also had chicken and fish..\n\nand i guarantee there's something else on that menu. A salad, for example. May not be her favorite, but better than telling her husband she'll stay home and skip his celebration dinner. \n\nOP is the AH. And probably didn't want to actually go out do dinner in the first place.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 739,
                      "content": "[deleted]",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Hurricane Ian basically made landfall in my front yard; restaurants had limited menus for a *while* and some places still do so fair, *maaaaaaybe* they didn't have much to offer.\n\n (dude, waffle house had no waffles - or coffee!!  x.x )\n\nFor whatever reason, that restaurant her husband wanted to go to had a limited menu at the time.  If she didn't want to eat there, she should've eaten before they went so she could still be present at her husband's celebration dinner.\n\nYou hear that OP!?!  Your ***HUSBANDS*** celebration, not yours!!\n\nRude af to try and ask him to pick somewhere else for his celebratory dinner.\n\nCan't wait to find out what happens when her kids graduate or get married.  She'll be screeching about her picky palette then too.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "Exactly! I’m a vegetarian and have never found zero options at a steak house. Pasta or even just a couple of sides.\n\nIt’s very weird that OP 1) admits she eats steak sometimes but just doesn’t want to on a special occasion for her husband \n\n2) deliberately left out what was wrong with the chicken and fish choices\n\n3) keeps saying “Oh we should go somewhere everyone can eat” when this restaurant does fit that, even for your children. It just doesn’t serve HER favourite meal. \n\nYTA",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "It's not only that she has to suck it up. She's choosing to be a brat. A place that serves fish, chicken, and steak most definitely has soups, sides, or salads that OP could put together to make a meal. Example: Side salad/baked potato/steamed asparagus. Ask for a plain piece of grilled chicken on a side ceasar salad. OP mentioned kids being there - order off the kid's menu!\n\nThis smells of OP not being happy about being the center of attention, so OP's creation the attention.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1533,
              "content": "I particularly love how “I’ll eat it [steak] but very rarely” and then “He refused, citing that we rarely get to go to this place”.\n\nGee, almost as if these 2 things can match up perfectly. OP, eat the fucking steak/ribs. \n\nA lot of posts like this appear in AITA and there’s always a response I keep coming back to: “If you truly loved this person, this minor inconveniences wouldn’t be an issue because your love for said person supersedes it”. Aka, Love > Semantics. \n\nYTA, ^ this is why.",
              "id": 22,
              "comments": [
                {
                  "score": 250,
                  "content": "Whenever I post something along the lines of “suck it up to be kind to someone you love” I get downvoted a lot and people start shouting",
                  "id": 23,
                  "comments": [
                    {
                      "score": 155,
                      "content": "I commented further up the thread about my husband loving seafood/it grossing me out, yet I STILL encourage him to buy and cook it for himself and our daughter at home. He loves it, just because I don’t doesn’t mean he should miss out. Plus I’ve been working on my reactions around our kid, so I don’t project and let her decide for herself 😅\n\nSucking it up and doing something you don’t like for your partner is NOT being a doormat.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1202,
              "content": "I can't even eat steak and I still would go to a steak restaurant for my spouse. They usually have banging sides anyway. OP is incredibly selfish and owes her husband a do-over celebration.\n\nETA: he tried so hard not to make OP look like an asshole in front of their family, if she only had a fraction of that consideration in return...",
              "id": 25,
              "comments": [
                {
                  "score": 339,
                  "content": "Exactly. I’m sure they have a side salad and some kind of potato dish. And they have chicken and fish, BOTH of which OP eats. Man, she is selfish. Way to ruin your husband’s special night!",
                  "id": 26,
                  "comments": [
                    {
                      "score": 173,
                      "content": "But, you know, they didn't \"sound good.\" OP is something else I tell you what.\n\nYTA",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Steakhouse mashed potatoes and KILLER gravy! Just give me a plate of that and I am a happy camper! Course, I also love steak, but yeah, with you on the sides!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "My sister is a goddamn vegetarian and will still go to a steakhouse with me on my birthday. I do usually try to find one that has some form of entree that she can have, but after the lockdown we tried going to a couple places that used to be good for her too only to find that they’d taken the vegetarian items off the menu. I felt horrible that the possibility hadn’t occurred to me, but she did throw a fit or demand we leave? No, she insisted we stay and that she’d be fine having some appetizers and would eat more later if she needed.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 544,
              "content": "Or order the freaking house salad! It isn’t a pain to accommodate their customers more often than not. Or just order a salad. Or do dessert like he suggested. You were just being stubborn for no real reason outside of your own selfishness. \n\nYTA so many times over and, imo, you owe your husband a new celebration WHERE HE WANTS TO GO! And suck it up because you’re happy for him and you supposedly love him.",
              "id": 30,
              "comments": [
                {
                  "score": 23,
                  "content": "House salad a baked potato.  Done.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 277,
              "content": "Yeah I have deadly food allergies so when I read, \"couldn't\" I thought that was what was happening. Or a restaurant that even cooks their veggies in butter so a vegan couldn't have anything. But no, she just decided nothing sounded super good and made it her hill to die on. I think anyone who's not selfish has eaten something they weren't totally fond of at least once to be polite. Or for me, if it's literally the only thing I can eat. My friends and family try to be accommodating but you never know for sure until you walk in. I've been to a few places where I just ate bread or tortilla chips until the mall was over, then grabbed something elsewhere because it wasn't about me.\n\nEdit: accidentally typed vegetarian instead of vegan. Don't post on no sleep 😂",
              "id": 32,
              "comments": [
                {
                  "score": 35,
                  "content": "I was totally expecting someone with severe multiple allergies like peanut/soy ect going to like an Asian place.  Maybe an ethical vegan going to a steak house... Nope this lady just wants to be a thorn in her husband's side for no reason.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 147,
              "content": "Yeah, OP is a huge AH. \n\nI've never been to a steakhouse that didn't have things like salads, bread, potato options (baked/mashed/fries), vegetables and sometimes a pasta or soup. \n\nOP could totally build a very enjoyable meal ordering two or three sides a la carte, and if the sides aren't available as individual purchases (which like...yes they are), I'd bet a shiny new dime that extra sides can be purchased with entrees. \n\nAlso, having a light snack at home and then enjoying a desert with a cocktail instead of an entree sounds fantastic. Why yes, I would like to eat that entire slice of cheesecake instead of splitting it, thank you very much. \n\nEven if the option was snacking before and after the meal, like...suck it up, OP. It's one night.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "This is what gets me. It’s not even that she’s a picky eater who hates steak and never eats it. She eats it, it’s just not her favorite and didn’t sound good to her. Like wow. Selfish much?",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "I was REALLY expecting this to be “wife with peanut allergy being forced to eat at peanut restaurant!”\n\nr/AmItheAsshole delivers once again",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3154,
          "content": "I’m vegan and have been to steak houses with my husband several times. He’s not a big steak eater either but every once in a while he wants to go to a nicer steak restaurant. I go and just find literally anything on the menu. The very few times we’ve gone somewhere where there was literally nothing I could eat, I just ordered cocktails instead. \n\nIn my experience at least, all the steak houses we’ve been are used to accommodating people. I don’t care if it is the saddest looking salad on the planet, I’ll order it just so there will be food in front of me and my husband can enjoy something he likes. He does the same thing for me when I want to go to some weird vegan restaurant.\n\nNow if it is a Tuesday night and he wants to pick up something from a pizza/chicken place on his way home from work, sure knock yourself out, go without me.",
          "id": 37,
          "comments": [
            {
              "score": 1492,
              "content": "When I was a vegetarian I’d go to a steak house and get a baked potato, spinach, and a glass of wine. And that shit was delicious.",
              "id": 38,
              "comments": [
                {
                  "score": 1151,
                  "content": "I’m a vegetarian. I went to the famous St Elmo’s in Indianapolis. Had a baked potato the size of my head, creamed spinach and dessert that was also the size of my head. And it was glorious. \n\nOP sounds like a petulant child. Wah wah wah. Me me me.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 281,
                      "content": "I live my life by one rule. If there’s creamed spinach on the menu then there’s creamed spinach on my plate.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 39,
                      "content": "I'm vegetarian and I'd happily go to a steak restaurant for a friend's celebration, leg alone a spouse. This is OP's husband and she does eat steak, which they serve, and prefers chicken and fish, which they also serve. It might not be prepared in her favourite way, but she can't suck it up for one night for her husband's celebration??? She sounds selfish and petulant, like she was trying to force her husband to go somewhere else.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 387,
                  "content": "I'm a vegetarian too, and steak house baked potatoes are next level 😂 They also usually have roasted asparagus.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 234,
                      "content": "Or Brussels sprouts... yum. Or buttery mushrooms. Or fancy Mac and cheese. \n\nI eat meat, but I could eat just steakhouse sides and be perfectly happy for a WHILE.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "I can't even count the amount of times I have gone places that I can't eat anything. I'm vegan as well. And it's not \"eehh not feeling the way the serve the fish and chicken and I only eat steak occasionally.\" It's \"they even fry their french fries in duck fat or lard\" type not being able to eat. Soooo I eat before or after, ask for a very plain salad with oil and vinegar, and enjoy the company.",
              "id": 44,
              "comments": [
                {
                  "score": 18,
                  "content": "Oh, I know that salad all too well my friend.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Vegan here also. I've been pleasantly surprised at the accommodations steak houses have made for me in the past.\n\nI wouldn't raise this much fuss over a celebration of someone I dislike,  let alone my partner. It doesn't sound like OP likes her husband much at all.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "When my roommates want Mexican, I have margaritas.",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "When I was going through a vegetarian phase - which I should get back to again - I landed up going to a steak house for my company's end year function, I didn't have much, but I just got a variety of different small things they did have along with drinks, I was accommodated, not perfectly, but I just wanted to be with my colleagues who I actually really liked. OP, YTA, you can't even make concessions for your husband but I can do it for colleagues at an event that wasn't even compulsory. Just because I cared and wanted to celebrate with everyone else. It's not always about ourselves, we make sacrifices for those we love, some of us do it for even just random strangers. I think you need to find some kindness in yourself and reflect on this.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 454,
          "content": ">He did go but came back a little over an hour later with the kids and they all had to go boxes. He said he couldn't think of what to tell the kids about why I didn't go when they kept asking without lying or making me sound bad so he just got an order for them to go and let the kids spend some time with their grandparents talking in the parking lot. I told him he should had stayed but he said that I put him in a bad spot with the kids\n\nHe is still caring about how the kids would look at it and doesn't want to make her look bad. YTA OP , relationships are not one way streets, effort needs to be done from both the sides, we have to put our partners preferences beyond ours sometimes, just to see that happy smile on their face.",
          "id": 49,
          "comments": [
            {
              "score": 24,
              "content": "How about he also KNEW that he was going to pay when he got home, if he didn't bend over backwards to please the Queen. All I know is that he is trying to keep family together, but bet his parents are so over her.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 368,
          "content": "I appreciate how thorough you were with your response.  Good job!",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 288,
          "content": ">Oh, you suck so much.\n\nI would bet $100 that she doesn't. Not even on birthdays.",
          "id": 52,
          "comments": [
            {
              "score": 88,
              "content": "*(Angry upvote)*",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 166,
          "content": "LoL I was genuinely stunned at her \"not wanting to be difficult for the kitchen staff\".  So you're just gonna be difficult for literally *everyone* else, then?  Jesus, OP you sound exhausting and obnoxious and I'm sensing some jealousy here.  Like...\"oh I'll eat steak rarely and have no real dietary restrictions, and this restaurant has various other options for me, but I can only not eat at the ONE place my husband really wants to, on a night celebrating his achievement.  Won't somebody please think of MY needs?!\"\n\nYTA.  And an annoying one at that.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "r/murderedbywords",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "Hit the nail on the head. No way around it OP just flat out sucks",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "The title is also sooooo misleading. She blatantly says she DOES eat steak, fish, chicken, which totals to just about all the dishes there. She’s not vegetarian, she’s not vegan, there’s no allergies. She’s just as AH who can’t put herself second for anything. A better title would be “AITA for disregarding my husband because I don’t want to eat at a restaurant for reasons.” And the answer is absolutely YTA.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "YTA - this post says it all in hilarious fashion.\n\nMarriage is about compromise. Your husband has worked hard to support his family and his family is proud of him and he wants to celebrate with them. That includes you.\n\nYou are essentially refusing to celebrate with him and the rest of his family because the restaurant he chose isn't your favorite, as if the restaurant not being YOUR favorite is a reason it should not be HIS favorite.\n\nThis man loves steak, and how many times does he not go to this steak place because of you? \n\nMy wife is a vegetarian. Vegan - the pickiest of all damn vegetarians. I am a steak eater. This Saturday is her birthday, and she asked me where we should go. I asked her where she would LIKE to go, and she mentioned this vegan place. That's where we are going. No discussion, I didn't look at the menu, and I'm certain they aren't serving chicken, steak, fish, or anything that used to have a pulse. Because it doesn't matter. If all there was for me to eat that I found palatable was a bag of croutons, I'd order the bag of croutons and focus on making sure that nothing distracted my wife from her enjoyment of her meal on her birthday.\n\nShe gets birthdays once a year, and I wouldn't want to piss on her party. I can ALWAYS go out and get a Big Mac or whatever LATER, by myself. I'm an adult, I have choices.\n\nYou have choices too, and it seems like you have chosen to put yourself before your spouse on a day that should be about them and not you.\n\n&#x200B;\n\nYTA.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 29899,
      "content": "YTA, selfish, and a poor partner. \n\nDon’t lie.  It wasn’t that there was nothing you could eat, there was nothing you WANTED. You also were too scared to ask the staff for a substitution.  It’s one dinner.  You won’t starve if you don’t eat everything on the plate, nor will it poison you.  Your husband doesn’t get to go to this restaurant he likes often because he is honoring your wishes most of the time, but you can’t deal with it for him one time.  \n\nYou basically told your family “My food preferences are more important than your feelings or supporting you”.\n\nTHEN you left your husband in the awkward spot of having to try and lie for you.  Because if he told everyone the real reason you missed the dinner they would be calling you an asshole like this entire thread is.\n\nApologize.  And learn that sometimes you don’t get everything exactly how you want it.",
      "id": 59,
      "comments": [
        {
          "score": 5540,
          "content": "Great response. \n\nIn my experience when someone ruins a moment (like this moment to celebrate), it doesn’t matter how much they apologize or try and make up with another event (like dinner or whatever), the whole thing just leaves a bad feeling and I don’t want to celebrate anymore. In fact, I just want to forget the whole thing and pretend I didn’t achieve anything. \n\nI might be a brat or have some personal issues but if this was my spouse, they would have to move heaven and earth to fix this.",
          "id": 60,
          "comments": [
            {
              "score": 1193,
              "content": "No, I feel you. It sours the whole thing. It wouldn't be unfixable, but I would definitely need some time to sulk and lick my wounds... but then again my wife and I are able to parse out when something is about us or not, so 🤷‍♀️ (eta: that last bit being about OP, not you, to be clear)",
              "id": 61,
              "comments": [
                {
                  "score": 185,
                  "content": "Thanx bro for the edit, I assumed you were referring to OPs relationship. \n\nHubby and I love celebrating each other and we’re pretty good at putting the other person first in their time to shine. I cannot imagine sending my husband off while sulking at home. Although he would probably call me out and tell me to stop being so dramatic and suck it up. 🤣🤣 and then he would buy me a really good dessert and tell me he loves me with lots of hugs and kisses to make sure I didn’t get hurt when he was being stern.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 379,
              "content": "[deleted]",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 365,
              "content": "Nah it’s a HUGE buzzkill. Just shows how important actually _celebrating you_ is compared to someone’s own selfish desires.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 308,
              "content": "My ex used to do this. He'd make a stink like OP until I was just exhausted and none of my proposed solutions to his supposed problem worked ('for various reasons'), and when I finally was totally bummed out and felt bad for wanting to celebrate something, he'd suddenly switch to suggesting something else (that he liked more). And would get mad when I didn't just pivot to being grateful.\n\nIt took me a long time to realize he was doing it on purpose. He wanted me bummed about my accomplishments and grateful to him he'd made anything happen at all. The sour taste was the point.\n\nI hope OP's husband doesn't let OP stand in their way.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 196,
              "content": "100% this. I had an (now ex)fiance that I refused to tell any of my achievements to, whether it was work or personal, because if my friends or parents wanted to celebrate it, she would do exactly what OP did. \n\nHappened a few times before I basically just kept everything to myself and never celebrated anything.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "They also hear the unspoken \"I neither love nor care about you enough to celebrate your accomplishments with you.\" and that shit hurts A LOT.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "I'm a picky eater, but I'll always find a dish I'm willing to eat in restaurants especially if we're there to celebrate something because I had to grow up with a grandmother who acted like OP, \"There's nothing here I want, can't we go somewhere else??\" and I never want to be known as the person who ruined everyone's mood. There's a difference between being picky, and being a selfish baby.",
              "id": 68,
              "comments": [
                {
                  "score": 21,
                  "content": "I’m extremely picky, but I don’t think I’ve ever sat in a restaurant without something in front of me.\n\nI’ve even eaten things that I’ve found awful because someone was excited to go to that place.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I'm so dead. This post can't be serious. \nSo here's the thing OP - I don't eat seafood and I am not fond of the smell, it actually makes me gag. \nBut guess what? My husband loves seafood and I frequently (not even for special occasions) go with him to seafood markets and sushi places and just watch him eat because 1. I won't starve without a meal. 2. I love him and seeing him happy makes me happy. \nI always thought it was that simple. But apparently to you, it's not?",
              "id": 70,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "It's very common for narcissists to ruin other people's celebrations. There is a video on YouTube by Dr. Ramani on YouTube about this and so many comments of people who had this happen. My guess is that's what this is with OP. She can't cope with not being center of attention.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "She's a lame excuse of a partner, absolutely self centered and inconsiderate, she needs to work on herself before committing to relationships because she expects people to cater to her and that's not sustainable for marriage in the long run.\n\nCongrats to the husband tho, maybe he can upgrade in the love field as well if this keeps going on.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1661,
          "content": "100%. I have celiac and there's lots of times places have nothing I can eat. Guess what I do? I eat beforehand. I sit and have a glass of wine and enjoy the company. Would it kill  you, OP, to go and celebrate your husband's achievement and be happy for him? It's not about dinner and it's definitely not about you.",
          "id": 73,
          "comments": [
            {
              "score": 351,
              "content": "This. I've learned the hard way to eat beforehand. It's not worth risking a week in bed over cross-contamination. Better that I eat beforehand so I'm not tempted to try anything at a restaurant where I'll more likely than not get something that touched a wheat product at some point.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 304,
              "content": "At my old job, management would choose an \"Employee of the Quarter\" and part of it was the entire office would go to that person's restaurant pick for lunch.  There was this Thai place everyone loved that we frequently went to.  I'm allergic to soy.  I would still go to the employee lunch and would chat with my co-workers and just order tea.  And I would eat a sandwich or something beforehand.\n\nIt's really not that hard to be considerate of others.\n\nBut to answer your question, Yes, it quite possible would kill OP to go and celebrate her husband's achievements.  And I'm not sure it's physically possible for her to be happy for him.",
              "id": 75,
              "comments": [
                {
                  "score": 24,
                  "content": "She isn't allergic though... She isn't \"fond\" of steak... doesn't hate it, doesn't even use strong language to disparage steak by using \"fond.\"\n\nI could have maybe been sympathetic if she was allergic. She's just a picky pants who was probably catered to too much in childhood regarding her food. \n\nBut I was, too, to the point my mom only made like, three things for dinner my ENTIRE childhood (way past the time it's ok to refuse to eat some soup I actually liked just because my mom added a 1/4 cup of rice in it... Which happened when I was 17). I can be downright bratty about food even now IN MY HEAD, but as a functioning adult in a society, I would never act this way with my hardworking husband I'm supposedly proud of!\n\nETA: I say \"soup\" but it was ramen. Not only am I insufferably picky, I also have terrible taste period.\n\nI'm a bit better as an adult, but I'm embarrassed by my food tastes as a 39-year-old.\n\nAnd my three kids are absolutely NOT picky because I don't want them to be like this when they're older lol.\n\nI know my mom gave in to my stubborn ass when it came to food and that wasn't great as far as developing me into someone that can eat like an adult. My dad died when I was two and she lost my half-brother bc he had to live far away with his mom after that, and she just chose not to fight that particular battle since she had to fight lots of others.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Yup! I cannot do Indian food - it hates my stomach. I can't even eat delicious naan bread. It's bad. My book club liked to rotate restaurants around town, including one couple's favorite Indian place. I cannot eat anything on the menu, and I was rightly laughed at the one time I inquired about plain steamed vegetables. But every time we met there (2-3 times in a year), I would show up, order a drink, and give a 200% tip on the beverage to effectively cover the meal a patron would have eaten. I'd eat something before and would enjoy my book club discussion with my drink.",
              "id": 77,
              "comments": [
                {
                  "score": 27,
                  "content": "It's almost like...you didn't let your individual limitations....impact the overall enjoyment of the group...\n\nWHAT. A. CONCEPT.\n\nAlso, solidarity on Indian food. I love it, my butthole does not. It ain't that complicated. Drink a drink, leave a fat tip, enjoy the meal next time when it's something you can enjoy. Also worth noting, OP isn't even a vegetarian or allergic to anything, they EAT STEAK, they just don't wanna eat it \\*this time\\* because they're...the worst. lol",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I’m a picky bitch and when I was breastfeeding I couldn’t have dairy or soy. I planned ahead if there was nothing I could eat and had something first. I had snacks in my bag like I was a toddler so I could always scarf something in the car before or after. I also have bad anxiety but I had to bother waiters and kitchen people all the time, asking what oil they cooked with, is there dairy in this, can I get it without cheese, all sorts of stuff I hate to do. But I did it so my kids wouldn’t be miserable. \n\nThis lady is so selfish I can’t even comprehend how her mind works.\n\nPlus she doesn’t mention how old the kids are. If I was at my own celebration dinner I don’t want to be entertaining and wrangling kids.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Celiac here as well and this is exactly it. Eat dinner at home, pack a snack just in case, have a drink and enjoy the company.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 472,
          "content": "Yup. I was expecting dietary restrictions of some sort whether ethical (vegan) or medical (allergies) but nope, she just doesn’t want what’s served lmao. What a spoiled brat.",
          "id": 81,
          "comments": [
            {
              "score": 43,
              "content": "Same! The post should be AITA for not attending my husband’s celebration dinner due to the restaurant not having anything I WANT to eat, rather than COULD. \nP.S. YTA.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 335,
          "content": "I like how the husband both refused to lie and refused to paint his wife in a bad light. He sounds like a great guy, but may have made a mistake on where to put the ring.",
          "id": 83,
          "comments": [
            {
              "score": 52,
              "content": "Definitely.  Hubby went above and beyond and it sucks that OP still wants to blame him and saying he was the one who left her out.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": ">The various reasons was one of the chicken dishes was chicken fried chicken, and I don't eat fried foods. The fish was snapper, which I don't like, and was stated as being marinated in bourbon sauce prior to cooking, and the chicken glazed with a bourbon sauce. I can't stand even the smallest hints of bourbon or its smell.\n\nFeels like there's a non-fried chicken dish right there. Tell them to leave off the bourbon sauce glaze. \n\n>Half the sides had bacon in them so those were out. One salad had peppered steak in it, their other salad option said they were temporarily out because they didn't have the mandarins, grapes, and cranberries for it.\n\nTell them not to put bacon on the sides you want or leave the steak off that salad. \n\nI definitely agree that there were things OP *could* eat, just nothing that she *wanted*. So yes, YTA. You're not paying so suck it up for one celebration dinner and eat something that's just okay.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": ">It wasn’t that there was nothing you could eat, there was nothing you WANTED.\n\nYeah, I was expecting this to be about allergies or other dietary limitations. Not OP being picky and difficult. She's definitely TA.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "What really got me was she couldn’t afford a fraction of the consideration to her husband that she’s giving to restaurant chefs she doesn’t know, whose job it is to make food as the customer orders it.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Exactly. OP is pouting because on night isn’t all about her. So she stayed home and sulked. Perfectly understandable. If you are 3. \nAlso, YTA.",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Perfect response.\n\nLook, I fucking hate hot dogs, and I hate driving in the city. But when my partner got depressed because he had to miss a weekend with his son, I sucked it up, took him to his favorite hot dog place downtown, got some tater tots and a beer and did what I could to help him feel better. Cause, ya know, it *wasn't about me.* I would jump through flaming hoops at a damn circus to celebrate an achievement!\n\nYTA OP. If you got promoted and your husband tried to guilt you out of your favorite restaurant and put you in an awkward position with your children and family, you'd react much worse than he did. If your child pulled a stunt like this, you'd probably call them spoiled. Think objectively about the situation, and start loving your family instead of just yourself.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I'm vegetarian and my wife is not. Her favourite food is a good steak. So on her birthday (etc) we go to a steak restaurant and I eat whatever sides, salads, or fucking kids menu option the place has suitable for vegetarians.\n\nI don't have the best meal but I don't care because she has her favourite.  This is how relationships are meant to work!",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15135,
      "content": "YTA.  \"I'm not fond of steak - I'll eat it but very rarely\".   This should have been one of those rare times.  Or you could have asked the kitchen staff to make chicken/fish without sauces but you couldn't even be bothered asking for that.   My read is you deliberately sabotaged your husband's celebration dinner using your food preferences as an excuse.",
      "id": 91,
      "comments": [
        {
          "score": 3489,
          "content": "I wonder how long before she deletes all this.....",
          "id": 92,
          "comments": [
            {
              "score": 2277,
              "content": "It’s coming. The overwhelmingly “YTA” ones always get deleted.",
              "id": 93,
              "comments": [
                {
                  "score": 374,
                  "content": "When I want to share these i find and save the automod copy.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 330,
                      "content": "Go check out r/amithedevil . The overwhelmingly YTA posts are cross posted there so if you're late to the party you can still read the original post. Just don't brigade--youll get banned.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 334,
                  "content": "I'm surprised there hasn't already been a \"No I'm right actually\" edit with something like \"also I'm umm..... deeply allergic to the air there\"",
                  "id": 96,
                  "comments": [
                    {
                      "score": 432,
                      "content": "“Edit: I didn’t feel like this was anyone’s business but if you must know, the maitre de is my ex-husband and the restaurant poisoned me with strychnine last time I was there and I got hives from the toilet paper but anyway if you need that additional information. And I’m allergic to chicken and fish.” 💅🏻",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "I can not imagine being so clueless (op) that you actually post this in this sub. I can see her reaction “well they are all wrong”.",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 232,
          "content": "I’m literally allergic to beef and went with my husband to a nice steakhouse for our anniversary a couple years ago. There wasn’t much there I could eat or liked, but I found something that would do. I was hugely pregnant and not really enjoying food much anyway so I figured he’d get the steak he’d been craving and I’d get the nice atmosphere. \n\nTurns out, I really liked what I ordered so OP could’ve at least tried! Also were there no sides she could’ve eaten? I’ve done that before entrees aren’t super appealing (I have a restrictive digestive disorder).",
          "id": 99,
          "comments": [
            {
              "score": 47,
              "content": "As a waiter, people who come in with allergies or restrictions don't bother me in the least, as long as you're trying to help figure out what you want. If you go \"I can't have dairy, what can I eat here?\" without even opening the menu and then scrunge your face like a child at everything I mention, yeah that shit's annoying. But if you're nice about it I'm always happy to work around or suggest alternatives or replacements for things. I guarantee her server would have been like \"No sauce? That's it? You don't need the fish steamed to exactly 147.8 degrees over water harvested from the snow of the Himalayas? Shit, coming right up\"",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "This feels 100% like a power play.\n\nRarely eats steak, and prefers fish or chicken, which is a fancy way of saying she'll eat all three, and just happens to pitch a fit about the one time her husband has a good reason to request the restaurant.",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8895,
      "content": "YTA\n\nDon’t want to be difficult by asking the restaurant to alter their meal, but will crap all over your husbands celebratory night?  It’s one meal Sis, get a plain salad, have some bread and water, get over yourself.",
      "id": 102,
      "comments": [
        {
          "score": 1289,
          "content": "This is it! There was not one or two apps she could have had? A salad? Pasta? And most restaurants (esp American ones imo) will make whatever substitutions. They deal with difficult customers all the time. \nYTA",
          "id": 103,
          "comments": [
            {
              "score": 684,
              "content": "Or even if she ate before she went then sat there and ate nothing, just to be supportive of her husband. Poor guy, she completely ruined the night for him. Giant YTA",
              "id": 104,
              "comments": [
                {
                  "score": 202,
                  "content": "She didn't just ruin the night. She stepped all over his achievement. Now it will forever linked to her childish little hissy tantrum.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 48,
                      "content": "That is really what she wanted. It had nothing to do with the food. She wanted to shit on his party because she’s a child.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Not just to hubby either. The kids & grandparents will always remember their weird parking lot visit because OP didn’t want to go *there* to eat. Wish hubby had went inside & had a really great time without OP. She’d be posting in the /divorce sub: \n\n*”My Husband Left Me Home For a Celebration Dinner. What do I DOOO?”*",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "And leaving a sauce off of a chicken breast is usually not that difficult to do anyway. YTA",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 472,
          "content": "He even offered to take her WHEREVER she wanted afterwards so she could eat. And she still shot him down. Ouch. YTA for sure.",
          "id": 109,
          "comments": [
            {
              "score": 126,
              "content": "The absolute coldness of him trying to convince her to come, and her just saying \"you should get going or you'll be late\", as well. Brutal.",
              "id": 110,
              "comments": [
                {
                  "score": 23,
                  "content": "I had the same thought. Poor husband.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5153,
      "content": "YTA. You couldn't eat something that didn't sound amazing to you to celebrate your husband's accomplishments?  You couldn't even settle on a drink and dessert?  I can't imagine not being able to sacrifice my total comfort for 90 minutes to celebrate the achievements of my husband. You could have eaten before, after, or just ordered the fucking chicken and dealt with it. You sound like veruca salt.",
      "id": 112,
      "comments": [
        {
          "score": 1260,
          "content": "I’m not sure how she typed this out and still had to ask if she was an AH.",
          "id": 113,
          "comments": [
            {
              "score": 317,
              "content": "Honestly, that's even more worrying. That she invented all these justifications for why she thinks she was reasonable, and has gotten herself to actually believe them.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 174,
              "content": ">I’m not sure how she typed this out and still had to ask if she was an AH.\n\nNot only that, but she tried as hard as she could, to be seen in the best possible light. I've dated difficult people before and the idea of \"order dessert and we'll swing by your restaurant after\" is absolutely something someone who is used to this horseshit would throw out there.\n\nIf these two get a divorce husband is going to feel so much relief on the other side",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Narcissists are like this though.",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 270,
          "content": "I agree. Order a fucking cocktail or mocktail or whatever floats your boat and just be happy being surrounded and engaging with people who you love. \n\nIf this were a usual occurrence but it’s once in a while where he gets to choose because it’s his celebration. YTA",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 187,
          "content": "Not even a Caesar salad (pretty standard fare for a  steak restaurant)? not a single appetizer? Not a grilled chicken with mashed potatoes?\nBeing this selfish sounds so miserable. \nI’m a picky picky eater and I can always find something even if it’s just an appetizer and a drink. \nYTA",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4763,
      "content": "YTA\n\nThey had at least 3 entree options for you (1 fish, 2 chicken), and surely a few appetizer options you could have doubled up on, but you couldn't deal with it for one night for HIM and HIS celebration?\n\nYou made it all about you. He made suggestions, wanted the kids there, you made this your hill to die on.\n\nIT WAS HIS EVENT! HIS CELEBRATION FOR A JOB WELL DONE!\n\nYTA. Did I mention that already?",
      "id": 119,
      "comments": [
        {
          "score": 948,
          "content": "I think it's safe to assume that the steakhouse will also have salads, as well as appetizers. And if they can adjust meals to serve to people with allergies, they can definitely alter a chicken or fish meal for a picky asshole. YTA.",
          "id": 120,
          "comments": [
            {
              "score": 380,
              "content": "She’s not even picky, just an asshole. They had things that she doesn’t mind eating, she just didn’t want to",
              "id": 121,
              "comments": [
                {
                  "score": 37,
                  "content": "Yeah, this sounds like she just wanted to make excuses for ruining her husbands accomplishments.",
                  "id": 122,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "Or even bread! Steakhouses have some of the best bread. I would've eaten bread and butter and would have been a-ok.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I’ve been a vegetarian for 30+ years  and steak houses have always been the one place i knew so wouldn’t leave hungry bc of all the sides and salads.",
              "id": 124,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "But all these had was steak. Which she eats *rarely*. And chicken and fish. Which she eats *often*. So, what’s a girl to do?",
          "id": 125,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4061,
      "content": "YTA - sounds like you’d ask for pizza and spaghetti at a friendsgiving",
      "id": 126,
      "comments": [
        {
          "score": 1186,
          "content": "Both, not just 1!",
          "id": 127,
          "comments": [
            {
              "score": 436,
              "content": "She deserved options too!",
              "id": 128,
              "comments": [
                {
                  "score": 118,
                  "content": "This definitely has strong \"I deserve options\"\" vibes",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 40,
                  "content": "Or else, she will feel bullied!",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "I mean, eating pizza without spaghetti doesn't sound good for various reasons.",
              "id": 131,
              "comments": [
                {
                  "score": 31,
                  "content": "Various reasons that I’m sure were very important",
                  "id": 132,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 47,
              "content": "\\+ hamburgers",
              "id": 133,
              "comments": [
                {
                  "score": 31,
                  "content": "And of course the return of the Apple Pie",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 712,
          "content": "Nice callback. That one was wild",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 279,
          "content": "I love this comment so much. \n\nAnd then OP would complain that only pizza is not a fair variety.",
          "id": 136,
          "comments": [
            {
              "score": 26,
              "content": "Oh my god my mom does shit like this. My sister made a taco bar for our family a couple years back and my mom said she's not eating meat right now. My sister said she'd make her a vegetarian option for the tacos. The day of the dinner, my mom calls my sister and says \"it would be nice if there was a fish option\". So my sister made some beer battered fish for the tacos. My mom ended up eating the carnitas. She just wanted my sister to put in a bunch of extra effort for her to have \"options\".",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "And take your pie back",
          "id": 138,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "YES I WANTED OPTIONS EVERYONE ELSE HAD OPTIONS!!!",
          "id": 139,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Don’t forget the burgers!",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2891,
      "content": "[deleted]",
      "id": 141,
      "comments": [
        {
          "score": 415,
          "content": "Yes. She didn’t have anything to eat on the menu, she didn’t find anything appetizing. Two drastically different things.  One implies dietary restrictions and you literally couldn’t eat it and the other is “meh it doesn’t sound good”.\n\nLike I don’t eat beef, it’s a full on dietary restriction for me. If I eat it, my stomach hurts within an hour and then bad things happen for 48 hours.  It’s miserable.  It’s like my body can’t break it down anymore.  My husband knows this but I still go with him to steak houses because I can always find something within my diet to eat. \n\nYTA",
          "id": 142,
          "comments": [
            {
              "score": 68,
              "content": "I HATE seafood!  Not dietary, just can’t stand it. Still end up at Ref Lobster several times a year for my husband. You know, they make a mean steak!",
              "id": 143,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "[removed]",
          "id": 144,
          "comments": [
            {
              "score": 53,
              "content": "\"Nothing is good\" was such a copout too.\n\nThey had steak, beef, chicken, and fish. That's just about every standard protein serving out there. Even if she didn't like how they prepared it, I guarantee they would have had zero problem throwing a plain chicken breast on the grill with some salt and pepper, but apparently everything has to be perfectly tailored to her tastes.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2493,
      "content": "YTA.   \nIt was his moment, he worked hard for it. It would've been nice to celebrate it. Your words: \"*I'm not fond of steak.* ***I'll eat it but very rarely****\"*. Isn't this an occasion to it? Couldn't you eat something at home and have the desserts?  \n*\"He suggested that I ask if they could prepare the fish or chicken without the marinades or sauces but I didn't want to be difficult for the kitchen staff.\"* You didn't want to be difficult for the kitchen staff but wanted it to be difficult to your husband.",
      "id": 146,
      "comments": [
        {
          "score": 736,
          "content": "Maybe she wants attention - he was getting all the accolades, here was a way that SHE would put the spotlight back on her. Even negative attention is better than no attention,  amirite OP?",
          "id": 147,
          "comments": [
            {
              "score": 190,
              "content": "OP's actions make a lot more sense if she's acting like this because she's jealous or resentful in some way. Is she jealous that her husband is having career success that she isn't? Is she resentful that she's put her career on the back burner to help take care of the family and now he's getting a promotion? Or is she really just that narcissistic and petty?\n\nShe's TA regardless. The answer to her motivations is something for her husband to consider in whether he should either insist on couples counseling or divorce.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 132,
          "content": "It might have been his moment, but seems she wanted to make it more about her choices than what he actually wanted",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2129,
      "content": "YTA.  You don’t have a food allergy, you’re just picky.  You absolutely ruined what was supposed to be a celebration.  You were incredibly selfish, and yet your husband still protected your image with the kids by not telling them the truth and making you look bad.",
      "id": 150,
      "comments": [
        {
          "score": 192,
          "content": "The kids will get to know her more as they get older.",
          "id": 151,
          "comments": [
            {
              "score": 34,
              "content": "Yeah. I feel bad for them.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 122,
          "content": "and the thing is she says that she eats steak on rare occasions why is this not one of the rare occasions where she ate steak is the daunting question here",
          "id": 153,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "This would have been terrible behaviour with most allergies as well. I've been invited to a party where I was allergic to everything other than the bread and salad, but since I'm not getting sick from being around people eating it I didn't complain.",
          "id": 154,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "I have food allergies and I usually have to eat before I go and bring along a tiny snack. Because I want to participate in the situation, I don't make it about me.",
          "id": 155,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}