{
  "post content": "So, I was going down a rabbit hole of boredom this evening and found a variety of personality quizzes. I stumbled across a kink/bdsm test and told my bf about it. He wanted to try it out try as well. \n\nHere's my trigger: I feel like my bf and I have a mutual understanding in those regards and know what  the other likes etc.  \n\nHe obviously did it on my computer and I wanted to watch. But ..... He apparently didn't like me looking at his answers because he didn't wanted \"that look\" from me. (Referring to the \"are you for real\" look, I assume)  I kind of got a little hurt. I thought we were able to talk openly about those things, but he wouldn't let me see. \n\nThe quiz ends up with telling you stuff like \"You're 90% most like likely to be a dom. Or you're 55% most likely to like pain.\" etc.  He did show me those results, but I don't know why he wouldn't let me see the answers. \n\nSo... Am I the A\\*\\*hole?",
  "id": 1,
  "comments": [
    {
      "score": 19,
      "content": "NAH. He didn’t feel like sharing, you did. If you’d like something similar in the future that still offers him privacy, while fulfilling your curiousity try mojoupgrade.",
      "id": 2,
      "comments": [
        {
          "score": 4,
          "content": "Oh, just looked it up. Thanks:)",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NAH, but if you’re bothered by the fact that your boyfriend is uncomfortable with something you don’t feel he should be shy about, that’s an opportunity to explore that aspect of your relationship and why it is the way it is, not get hurt feels.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NAH\n\nI don't like people watching me fill out surveys like that, but I don't mind showing results. Is it possible that's what was happening here? Regardless, NAH because he just wanted some privacy and you didn't go off on him about it.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "As I mentioned, most of the things on the quiz, were things we already have a mutual understanding about and some of the things I kind of want to know. \nBut he isn't a shy person, definitely not towards me, so I just didn't understand why he acted that way..",
          "id": 6,
          "comments": [
            {
              "score": 5,
              "content": "I think I was unclear, for which I apologize. Let me clarify:\n\nYou could hand me a survey about my favorite breeds of cat and I would still not want to be watched while taking it. I do not know why I'm like this, but I have some friends who are the same way. Perhaps this is what was happening with your BF?",
              "id": 7,
              "comments": [
                {
                  "score": 3,
                  "content": "Ooohhh okay.\nWell, I guess I can understand that.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "YTA, if hes not comfortable sharing that with you he doesnt have to. Partnership isnt about knowing absolutely everything about the other person. Its kinda controlling that you feel like you must know, that he should of shared it with you.",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "Fair enough. \nI know that it's impossible, and not a must, to know everything.. \nBut due to my anxiety, my brain sometimes needs to know a lot in order for me to be calm. \nThe thing is, I wanted to know just as much as to be able to talk about it. Find out what he wants to maybe try or something.",
          "id": 10,
          "comments": [
            {
              "score": 2,
              "content": "Hey, I have anxiety and used to be like this in relationships too. So I get it. You've been very open to our feedback and judgement and that's great! But as someone who has been in similar positions, you can't pressure someone into talking about things they're not comfortable with. It won't end well for either of you. \n\nIn this context, he might have some kinks he's ashamed of or isn't ready to try it IRL. Some people have kinks in fantasies only, and really do not want to actually do it. There's porn I'd watch, but if I actually did it, I'm sure it would make me cry (in a very bad way).\n\nKinks involves overcoming internal shame as well. Perhaps he's into something that's often made fun of like foot fetishes, or maybe it's something more extreme like cock and ball torture and doesn't know how you'll react. Maybe he's into something he knows you aren't into, and he's embarrassed or worried you'll feel pressured into trying for him. Regardless of the reason, he can keep as much of it to himself as he wants. You say you have an open dialogue about your kinks, so let that assure you that if and when he wants to try something, he will let you know. \n\nPlus I get anxious when people stand over me and watch me answer quizzes or surveys of basic things like what type of ant I am (bull ant btw).",
              "id": 11,
              "comments": [
                {
                  "score": 1,
                  "content": "First of all, thank you for this comment.\n\nI don't know if you read all my reply's, but I do have anxiety as well. And my reason for even posting and asking about this is, that I feel confused about the fact that he is a quite open person. He is often the one who initiates this kind of topic, so for him to not letting me see answers to something he kind of already has told me about, worries me a bit.\n\nI did talk to him and as I assumed, there were a few of the questions where he knew I'd be like \"Really, why that?\" I know it sounds like I'm judging, but I am generally just curious. Which I had hoped he understood. It apperantley just came out wrong.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "You got the results, why do you need the individual answers? YTA. If he’s not comfortable telling you yet that’s ok. Back off",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, I was going down a rabbit hole of boredom this evening and found a variety of personality quizzes. I stumbled across a kink/bdsm test and told my bf about it. He wanted to try it out try as well. \n\nHere's my trigger: I feel like my bf and I have a mutual understanding in those regards and know what  the other likes etc.  \n\nHe obviously did it on my computer and I wanted to watch. But ..... He apparently didn't like me looking at his answers because he didn't wanted \"that look\" from me. (Referring to the \"are you for real\" look, I assume)  I kind of got a little hurt. I thought we were able to talk openly about those things, but he wouldn't let me see. \n\nThe quiz ends up with telling you stuff like \"You're 90% most like likely to be a dom. Or you're 55% most likely to like pain.\" etc.  He did show me those results, but I don't know why he wouldn't let me see the answers. \n\nSo... Am I the A\\*\\*hole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA if you get mad at someone for not doing something that makes them feel uncomfortable.",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "But they shouldn’t feel uncomfortable. They’re in a relationship and can’t talk about sex",
          "id": 17,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Fair enough. \nI weren't intending to make him uncomfortable, but I'm just wondering why he's able to tell me about about that kind of stuff, but not show me answers to the same thing.",
          "id": 18,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Nah. Might be worth having a conversation though to check that he really, genuinely is comfortable sharing his desires with you. If he isn’t yet, that is ok as some things are deeply personal and can take years and years before the person is ready to share. That isn’t a reflection on you.\n\nCould also be that he just doesn’t like someone reading over his shoulder.",
      "id": 19,
      "comments": [
        {
          "score": 1,
          "content": "He's a lot more out-going than I am. \nIf we talk about anything deeply s*x related, he is most likely the one who initiated it. So I'm just wondering why he can't show me answers to the same topic..",
          "id": 20,
          "comments": [
            {
              "score": 2,
              "content": "Sounds like your reading too much into it then. Does it really matter?",
              "id": 21,
              "comments": [
                {
                  "score": 2,
                  "content": "I probably am. I'm very anxious about a lot of things and I guess my brain just went off on it..",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "I don’t think it’s an asshole move to want to know how your boyfriend is in bed but maybe he is embarrassed and needs time to open up",
      "id": 23,
      "comments": [],
      "relation": "Support"
    }
  ]
}