{
  "post content": "For context we are in a 6 year relationship, not married.\n\n\nMy wife is 8 months pregnant and driving me insane. Before she was pregnant we didn’t have many issues but now, anything I do isn’t good enough. My cooking is shit, I don’t do laundry correctly, I don’t clean well enough/miss too many spots. \n\n\nThe last straw was my wife saying my foot message wasn’t good enough. Since she told me that (9 days ago) I have been responding with ‘do it yourself’, after she tells me it isn’t good enough.\n\n\nYesterday the tire from our car needed to be replaced while we were at the side of the road. I admit it, I suck at changing tires. My wife told me I was going too slow, and I told her she could do it herself. She said no, and I refused to work on the tire again for 30 minutes. \n\n\nWhen we got home she was angry because she needed to go to toilet during those 30 minutes. She called me an asshole and inconsiderate and a bunch of other stuff. \nI just went to our bedroom to relax for a bit.\n\n\nIn defence of my wife, the pregnancy is difficult on her and she had quite a few problems.\n\n\nWhen we went to sleep, she wasn’t talking to me, saying that I am an asshole. \nI am kinda feeling bad now, AITA?\n\nEdit: Some people are confused about me referring to my wife throughout the post, even though we are not married. \n\nWe are not married and are not planning on getting married in the near future. This is a joint decision. \n\nWe do, however, have rings and call each other husband and wife. It is so automatic for me now that I didn't even realise I did it in the post without explaining. We tell people we are married because it is easier and don't want to explain not getting officially married.\n\n\nEdit2: I've decided to sincerely apologise to her and take her out to dinner tonight. And to stop saying do it yourself.",
  "id": 1,
  "comments": [
    {
      "score": 14288,
      "content": "You're both assholes.\n\nShe's incredibly tired, like nothing you can probably imagine - she's going to be affected heavily by this tiredness and there's not much you can do about it but try to be understanding.\n\nShe's acting like an asshole though. It wouldn't be hard for her to recognise that she's behaving poorly and at least talk to you about it at the end of each day to try and smooth things over.\n\nYou guys sound like you're in for a hell of a shit time with a newborn if you can't work this out.\n\nGood luck",
      "id": 2,
      "comments": [
        {
          "score": 3324,
          "content": "Yeah, I see posts like this and find myself wondering why neither person seems able to actually, y'know, talk to the other person about what's going on and how they're making each other feel.\n\nHonestly, she's being nasty and demeaning based on the post above, but \"Do it yourself\" is such a childish response instead of trying to have an adult discussion about what's going on.\n\nESH.",
          "id": 3,
          "comments": [
            {
              "score": 706,
              "content": "I think about this all the time. The emotional intelligence seems incredibly low. Why can’t people assume the best of their partners and talk to each other??",
              "id": 4,
              "comments": [
                {
                  "score": 643,
                  "content": "And why do I wonder if his idea of a foot massage is absentmindely grabbing and rubbing her feet?  Something tells me that Preggo usually sucks up half-assed behavior from OP, but she has no energy left to do so.\n\nAs to the changing the tire, Preggo is almost done baking the kid.  What if she went into labor during this time?   She would have had to call an Uber, because OP was having a time out.\n\nI think OP is in for a rude awakening once he isn't able to run away from his current reality.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 394,
                      "content": "Don’t kid yourself. He’ll run away.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 74,
                      "content": "So he should be berated if he is bad at foot rubs?",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "Really?  Because something tells me preggo is simply buying into \"being preggo means a free pass on bad behaviour\" cliche.\n\nI bet he gives awesome footrubs, but she is in a state where literally nothing would satisfy her.  I see \"I'm miserable, so everybody else gets to share my mood\" vibes.\n\nI suspect hubby usually puts up with how demanding she is, but he's reached the end of his ability to accept the abusive behaviour.\n\nAs to changing the tire - you're right.  Uber if need be.  Because raging he's not doing it fast enough for her is pretty shitty.  Like, he should have known with a pregnant wife he needed to up his tire changing game up to NASCAR pit crew speeds, right\n\nI think the wife is in for a rude awakening once hubby hits his limit for real.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "So its ok for him to be insulted bc hes not a professional foot massagist? She doesnt even seem to be giving any tips on how she wants it to be done, shes just telling him he sucks",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "You think that because you're biased. Not very complicated.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 140,
                  "content": "I had issues when younger where the initial reaction is to bottle up, assume a position, and then make myself angry and upset based on my own interpretation of things in my head.\n\nWe learned to talk, and, sometimes, some of the best things are, \"look, when you say that, it really hurts or affects me\", and \"I just need a bit of me time, you're trying to be attentive, but that just feels like it's intruding and wearing me down at the moment\"\n\nPeople aren't particularly rational all the time, so sometimes what a person is feeling doesn't particularly have a logical cause or make sense, but they're still feeling that way. So you learn to recognise, address, and find ways of managing.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 48,
                      "content": "I love this comment. I'm autistic, I have a hard time with feelings vs. rationality, especially when my own feelings are irrational and I know it. The dissonance bothers me. I'm upset with myself for feeling \"irrationally\" and I certainly can't EXPLAIN it because I know it makes no sense. So I tend to just try to force it down, discredit my own emotions, until I can forget or move on and it's no longer relevant (because emotions are fleeting...). I know that's not a healthy way to deal with it but I think that just honestly saying \"I don't really understand why this makes me feel this way, but it does and I need time to process it\" has worked really well for me and my partner. But I did get lucky with him. Most men ime wont accept that sort of honest explanation, they go straight to \"women are crazy\". But I have also dated a lot of real shitters.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I’ve tried both of those routes and neither seem to bare fruit - if I do 15 things in a day she will ask why I haven’t done 16, or pick holes in all the things I did do. Gets pretty exhausting especially as I’m not doing them to score points, I enjoy a clean and tidy house and enjoy doing things for other people especially my wife, but she thinks credit/thanks doesn’t need to be given but criticism can flow freely.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Emotional intelligence, like the other intelligences, is not exactly high for the average person.\n\nThink of some of the most emotionally intelligent, empathetic, and awesome communicator you know: then realize there has to be at least one total idiot to balance them out for the national average 😞",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Not to be that person but I think social media is training us to always assume the worst of each other and not give the benefit of doubt. Also, life is so much harder now that everyone's always overwhelmed and frustrated.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "As someone who was raised by emotionally immature parents and has a *slew* of issues as an adult because of it, this whole situation gets a Big ol' \"yikes\" from me.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "The thing is, how do you know he didn't have a reasonable discussion first. I have met people,  including my mother and mother in law, where a reasonable discussion just doesn't work because they are always right. Eventually do it yourself is the only possible approach before dropping contact completely.\n\nI've had a scenario where I was doing the cooking for the family and my mother was sitting in the kitchen watching me and criticising every bit I was doing, the pot was wrong, the vegetables were cut wrong, I should use more oil, more salt. It went on and on. For about 30 minutes. And she didn't lift a finger. I tried a normal conversation. Didn't work. Sometimes the arguement is the entire point.",
              "id": 17,
              "comments": [
                {
                  "score": 37,
                  "content": "I don't, I'm forming an opinion based on the information provided, had OP said they'd tried talking to their partner and been shot down every time, then my response would have been different.\n\nAnd, yeah, in your example, I would say you WNBTA, whereas your mother would be.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "OMG I think you are my sister. lol",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "I mean he didn’t start with that, it built up to it. Would be better to talk it out, of course",
              "id": 20,
              "comments": [
                {
                  "score": 21,
                  "content": "Oh yeah, he let his frustration build, instead of trying to talk it out, at least based on the post.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 53,
                      "content": "When was she supposed to act like an adult?",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I dunno, I think losing patience after months of being negged by your wife is pretty normal.\n\nIf the wife is being like this - she's not going to talk like an adult about it, no matter what the husband says.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly. Pregnant women are often tired, cranky for no discernible reason, and extra-sensitive  - but still shouldn't be abusive and nasty to those around them. And OP's new catchphrase response is escalatory and demeaning. Telling a preg woman to change a tire sounds both cruel and stupid, even if he's just fed up and doesn't truly mean it.\n\nTake it from someone who's been there, OP.....use this time before (and after) the baby comes to do some marriage counseling (we used online therapy for convenience) so you can BOTH improve your communication patterns NOW. Offhand, I'd say a better response might be: \"Wife, I can see you're unhappy with how I fold laundry and I know you might not be feeling great right now. I'm doing the best I can and want to help you, but we need to talk about how you're treating me because things can't continue this way.\"",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "it’d be one thing to say “do it yourself” and then do it anyway but OP straight up stops doing anything until he enthrall caves",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "\nThe “do it yourself“ doesn’t really bother me that much because I think that’s a perfectly normal response to when somebody’s constantly telling you that you aren’t doing shit right. But putting somebody in a position where they need to use the washroom, especially while they are pregnant, and then not working on fixing a tire because they are pouting —  that is some seriously next level AH shit right there. But she’s being utterly obnoxious. Insufferable. Definitely ESH. I don’t know why, but for me I kind of felt like the second OP qualified that they weren’t legally married, it really rubbed me the wrong way. As if that would make a difference somehow?",
              "id": 26,
              "comments": [
                {
                  "score": 9,
                  "content": "And, again, a bit open to interpretation, but the way it's written makes it seem like when they got home is when she said she needed to use the toilet...\n\nIt's a relationship that needs some communication help at least.\n\nThe \"do it yourself\" is an understandable reaction to a build up, but the situation and the refusal of either one to actually try anything other than sulk is worrying.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Lol how is it childish? So you're one of those types to ask your partner to clean but then complain that he/she isn't doing it right? Well guess what? DO IT YOUR FUCKING SELF THEN lol instead of complaining, how about being grateful that he/she is taking time of their day to try & do what you want, very very simple concept to understand.",
              "id": 28,
              "comments": [
                {
                  "score": 8,
                  "content": "“Not doing it right” in my experience is an exaggeration that some men (my husband) use to try to justify not being helpful. Let’s say he drops some food on the floor and I ask him to pick it up. He picks up two pieces but there are more. I say to him that he didn’t finish picking up the food. And he says “so my cleaning isn’t good enough?”. I mean, no. Not when it’s not actually done. It’s not a complaint. It’s just the truth. And it gets frustrating. So what do you suggest? Let the person do only half the job or do it myself?",
                  "id": 29,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I’d bet a dollar this weaponized incompetence shit is exactly what OP was doing all along, and no that wife/not wife is pregnant and cant just do it herself, she’s asking him to make changes to how he handles tasks.  And he is responding as men who pull this shit do.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I have a different possible theory. Cleaning was her job before pregnancy, and she probably insisted they needed to be done, he realized she was right or someone else told him so, and he decided to do them but hadn’t ever really done those chores before. She probably told him how she does them and I bet it’s a little bit of both: her really harping on him not doing it right, and him sulking like he did with the changing tire issue.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I think you've got it right, lol",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "No, I communicate with my partner. We can both have bad days where we are feeling cranky, snappy, and unreasonable. But we talk about things to the point where if one of us has one of those days, they can say \"Sorry, I'm feeling really cranky today\" and the other person can try and give them space and pick up slack.\n\nOf course, the scenario is different, but talking about things instead of letting them build like that is a much more healthy way, don't you agree?\n\nIf OP tries to talk to her, and she refuses to listen and keeps on without any consideration, then she's an AH. But there's no evidence of attempts to communicate about how either person is actually feeling and acting in the post.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 3,
                      "content": "He's also an AH for picking changing a tire to be the moment where he makes his final stand there. His pregnant wife, he told her to change the tire. I don't know about you, but I don't care how frustrated I am at somebody, I'm not going to make an 8 months pregnant person change a f****** tire just because I'm in a mood, whether it's at them or not. I'll just tell them to stop talking to me while I do this, or we're going to have to call a tow and we'll get them some more safe after that. But I'm not going to turn around and expect them to change a tire, that's just overkill.\n\nI'm not saying that she's not in the wrong at all either, but that doesn't excuse what he did.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Sure she cannot and will not have a adult conversation.",
              "id": 35,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 600,
          "content": "Also, the needing to pee thing is real.  Baby is smashing her bladder.\n\nI tried to be much more chill with my husband at that time, but I would get annoyed if he suddenly decided to “take the scenic route” without warning because it risked me wetting myself.  I would desperately google maps a business, any business that might be near and have a restroom.",
          "id": 36,
          "comments": [
            {
              "score": 316,
              "content": "yeah this is why i think he is the bigger AH. i dont think she should have told him he was going too slow but if youre pregnant and need to pee, youre gonna be impatient. all the other cases she was an AH as well, but not changing a tire for 30 minutes while your pregnant wife is about to wet herself? outshines all the other AH behaviour massively",
              "id": 37,
              "comments": [
                {
                  "score": 146,
                  "content": "But she didn't tell him she needed a bathroom until they got home. She could have said \"I really need to go and changing the tire is taking a lot of time\" but she didn't.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 5,
                      "content": "oh rly i didnt know that wow, i fogured she would have said something.. okay then theyre both equally bad lmao talk about communication issues",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "Her abusing the poor guy isn’t limited to that incident though.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 68,
                      "content": "Except this is his side of the story.  It could very well be the case that usually she does all of the chores and he is annoyed to have to do them because she literally can’t, so he’s not trying and purposefully doing a shitty job.  Weaponized incompetence is a common complaint amongst married women.  \n\nThe foot massage seems particularly bad unless you consider that it wasn’t something he was doing for her out of the goodness of his heart, but rather something she asked for (pregnancy really messes up your feet), and he didn’t want to do it so he intentionally did a terrible, half-hearted job.  \n\nIt’s very frustrating seeing someone who is supposed to be your supportive partner acting like a put-upon teenager.  \n\nOr maybe she’s just a nightmare, and he is actively trying.  The only clue we have is his little stunt with the tires.  I’m leaning towards petulance, though.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "no thats why shes also an AH, like i said. but i thought he was the bigger one cuz of the bathroom thing, except ive learned that she never told him she had to go. still i think his response is wrong, and if this behaciour is limited to her pregnancy i wouldnt call it abuse. i think they both just have massive communication issues, and the pregnant wife is taking out her exhaustion on him, which is wrong. they need to have a good talk, perhaps some counseling before the baby is here for sure",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "So abuse is okay because she's pregnant and theoretically needs to pee?",
                  "id": 43,
                  "comments": [
                    {
                      "score": 2,
                      "content": "telling someone they didnt do the laundry correctly and miss spots when they clean isnt abuse jesus fucking christ",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 242,
              "content": "Also, being on the side of the road is not safe. People on the side of the road get hit all the time. Why keep your pregnant wife in that situation longer than necessary? He had to know he was being an AH when he told a woman 8 months pregnant to change a tire. He wants her to squat for an extended period of time? Or is she supposed to get on her knees? They both need to learn to communicate now bc a newborn is only going to amplify their issues",
              "id": 45,
              "comments": [
                {
                  "score": 128,
                  "content": "It’s also an extra road hazard for every other driver. Really stupid place and time to make a stand.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "> Also, being on the side of the road is not safe.\n\nThis.  I used to be a volunteer fireman/EMT.  We would go to motor vehicle accidents on the interstate.  Our bunker gear would have reflective yellow all over it.  When I was walking on the side of the road, I swear asshats would see how close they could get to you for \"fun\".  The air whipping past me would almost pull me over from how close they would get to me.  On some calls, the State Police would park by us.  When that happened, people NEVER sideswiped us.  Stay the hell away from the edge of the road.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I’m a biker. I second the idea that cars play chicken with people on the side of the road for fun.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My husband’s uncle was a fireman who died when a car hit him in the side of the highway. Be safe out there!",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "I literally pee twice an hour in the last two months of pregnancy! I have had to use my toddlers training potty when my husband has been in our only bathroom lol",
              "id": 50,
              "comments": [
                {
                  "score": 12,
                  "content": "I did that when we moved cross country while I was hugely pregnant (thanks, military).",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 103,
              "content": "There is having to pee and then there is a baby jumping on your bladder as you said. The fact that he completely dismissed that and took more time to PUNISH her. because that's what it was, it was a punishment for her behavior. If people think that's actually okay, I'm starting to see how so many people have experience with DV relationships bc Jesus.",
              "id": 52,
              "comments": [
                {
                  "score": 77,
                  "content": "Yeah honestly I'm shocked by all the E S H verdicts and people saying the woman is abusive here when OP is the one using physical discomfort as a punishment?? She's 8 months into a difficult pregnancy and is frustrated about the housework etc not being done to her usual standard which is understandable, you have to have a bit of patience with pregnant women when they're feeling miserable and impatient and snappy bc it's not their fault especially bc OP says there were no issues before the pregnancy! To make this point in the last month when finishing off cooking the baby is using so much of her energy and it's moving around and pressing on her bladder and she really needs to be comfortable and near a bathroom is so messed up it's very much a physical punishment for her being rude to him and the people tryna justify his actions bc she didn't say she needed the loo until she got home must know literally nothing about pregnancy bc *obviously* she needed the loo this is a solid YTA for me",
                  "id": 53,
                  "comments": [
                    {
                      "score": 49,
                      "content": "I've come to realize that a lot of people on Reddit are very young. Like early 20s, and it absolutely terrifies me when it comes to abuse and relationships and what people clearly don't consider abuse. I guess wisdom comes with age, but putting anyone in physical pain or discomfort as a punishment is a pretty blaring red flag.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "It's ESH because she *is* being an asshole by constantly berating him. Millions of women (myself included) manage to go through pregnancy and all its irritations without berating our spouses over just about everything. It isn't fair to take out pregnancy gripes out on your partner. Pregnancy hormones and brain can excuse a lot of things but being an asshole to your partner isn't one of them. And not, not every time a pregnant woman needs to use the bathroom is obvious. \n\nWas he an asshole? Of course. Changing a tire on the side of the road is absolutely not the time for a power struggle. \n\nBoth of their communications prior to this moment were not mature.\n\nAlso, it's pretty insulting to pregnant women to excuse AH behavior because they are pregnant. Like pregnancy suddenly means they are incapable of being reasonable.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "You're taking one instance out of a litany of her abusing him. He only found out she had to pee *after* the fact.",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "From the post he didn't know she needed to pee at the time.  It just sounds like it was yet another time when she was berating him for doing something that wasn't perfect and instantaneous.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I refuse to believe that while he was sitting on his ass for 30 minutes and not changing a tire she didn't mention that she had to pee. But I'll play devil's advocate for you because people LOVE to give the devil an advocate, (Although he's never needed one) even after he found out he had punished her  with physical discomfort he didn't care and just walked away from her to go and relax when they got home. No apology.",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "she was 8 months pregnant. it should be common knowledge she has to pee constantly. doing the laundry correctly isnt demanding perfection",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Yeah. My SO was 20 during my first pregnancy, so still pretty young and dumb. But...He knew my bladder had a 30 minute clock. I did not have to tell him. We would drive to a store and he would drop me off at an entrance close to the restroom and then park.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "I user to refuse having hubby drive me to ultrasounds while pregnant cause it sucked having to drink 1L of water then drive with a full bladder cause hubby ALWAYS found every single pot hole.\n\nI do agree they are in for one hell of a time when that baby comes. They need to learn to rest when possible and communication is ESSENTIAL even when tired, angry, and frustrated.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I went apeshit at my husband when I was in labour with our daughter. We live 45 minutes from the hospital and the local roads are very narrow and covered in potholes, so, when I was making my birth plan, I specifically asked him to go along the main roads when I was in labour, because he prefers the country roads and they were very painful when I was heavily pregnant. He decided to do things his way, and I had to endure 45 minutes of having a 10lb 4oz baby try to bounce out of my person every time we went over a pothole while i was 8cm dilated. The crap a baby does to your body is insane.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "So what?\n\nThere's no reason for her to be a nasty asshole to someone trying to fix an accident.  Unless he was deliberately going slow, there's just no call for that.\n\nOP: mate, you know there's women in the world that won't use you as their personal punching bag?  You're about to have a baby with this one, but that doesn't mean you have to stay with her.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "I’m currently 6 months pregnant and a miserable person most days, which sucks for my husband. I’ve said many times that the hardest thing about pregnancy is the impact on my relationship. If we weren’t completely in love and had a solid foundation, I don’t know that our marriage would survive this.\n\nThat said, I am apologizing CONSTANTLY for taking my exhaustion and discomfort out on him. He knows I’m dealing with something near impossible but it doesn’t mean he doesn’t need to hear me acknowledge that I’m a batshit crazy bitch rn. In pregnancy, it’s hard to control your emotions but it’s still easy to recognize them and know right from wrong if you possessed the skill beforehand. \n\nESH",
          "id": 64,
          "comments": [
            {
              "score": 36,
              "content": "This. I wasn't horrible during my pregnancy but I was miserable and I definitely had my moments. I always always always apologized for overreacting (usually while crying bc hey hormones!) and luckily I have a very loving and understanding husband.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Was going to say. I’ve said some asshole things in my life either when stressed, over tired, cranky, whatever. But I’ve also been able to realize afterwards when calm that what I said or did was not called for and discuss and apologize. \n\nSome people way too stubborn though to ever admit they were wrong.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 81,
          "content": "It won’t be long until the baby is the most mature person in their household, it seems.",
          "id": 67,
          "comments": [
            {
              "score": 9,
              "content": "Arguably already is",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 54,
          "content": ">You guys sound like you're in for a hell of a shit time with a newborn if you can't work this out.\n\nI've seen a lot of comments like this and while I agree it might not bode well for the future sometimes it's just a really shit time that will pass. I just wanted to offer my personal perspective. \n\nI was insanely emotional when I was pregnant. Like good luck even telling me I was too emotional lol, I couldnt and wouldn't hear it. I was so far deep in my emotions and hormones it would have been impossible. But a few days after the baby came, the fog lifted and it felt like I came out of a coma lol. I did not recognize the person I was while pregnant at all.\n\nNow this is not an excuse for bad behaviour and I can totally understand how frustrating it can be for the pregnant persons partner, but sometimes it really is temporary and not indicative of the state of the entire relationship. Pregnancy hormones are fucking wild and they effect everyone differently. \n\nSo, just to give everyone the benefit of the doubt here, if the relationship was totally solid before the pregnancy, it's a good indication it might just be the pregnancy temporarily wrecking havoc.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Hormones and stuff. I know friends who turned into monsters while pregnant.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I agree. I'm not pregnant (and never will be...) but I do have anxiety issues which tend to make me snap at my husband a lot. He understands that I don't mean it when I do that, it's the anxiety making me react. And I always apologise once I'm back in control. \n\nI hate the fact that it will happen again and I will be apologising again. I love that my husband is so understanding about it.\n\nSo yeah. Both need to adjust their behaviour and also probably lower their expectations about a lot of things.",
          "id": 71,
          "comments": [
            {
              "score": 62,
              "content": "Maybe work on that anxiety.",
              "id": 72,
              "comments": [
                {
                  "score": 17,
                  "content": "It's a work in progress but there isn't an instacure to anxiety. Well, other than medication to the point of being unable to function.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 50,
                      "content": "[deleted]",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "You probably need to have someone else read your comment and help you realize that you just said “it’s okay that my mental health issues make me verbally abuse my husband, because I can’t help it. I’m so glad he doesn’t hold me accountable for it”\n\nYou might not think it’s verbally abusive to be snapping at someone all the time, but those of us who have been to therapists and sought treatment for our anxiety and depression realize that it is…",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "You need to work on that anxiety. It’s not okay to abuse your husband.",
              "id": 76,
              "comments": [
                {
                  "score": 11,
                  "content": "Abuse? There's no abuse going on. What are you talking about? Please don't assume on limited information.\n\nI verbally snap at him when I'm overwhelmed by either his actions or something else. He knows what's going on, that it's not directed towards him, that I don't mean to be that way. He knows how to de-escalate when it happens, he doesn't feel abused or threatened, and he always says that I don't need to say sorry even though I always do. He knows I do every thing I can to avoid it and support me in many ways to avoid situations like where it happens.\n\nWe've talked things out a lot. Our relationship is healthy and based on mutual trust and communication. I support him in other ways in return.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Abusing a husband is not okay. Saying that mere snapping is abuse is in itself very abusive behavior. Unfortunately some cultures see negative reply as abuse giving right to use violence. Yes, some cultures do have delusion they are not abusive when they pretend to be polite. \n\nI am the husband of u/livasj, and I cannot stand abusive behavior. I do often make stand to defend abused. If she would abuse me, I would have done something about it. Everyone makes mistakes. I do appreciate honesty over pretending. For me pretending to be positive is rude as I do have different cultural metrics of politeness. In some cultures, such as many of the English speaking ones, contradicting someone is seen as hostile or impolite. My culture does not follow that interpretation of the politeness. \n\nI do suggest you do not make assumptions by adding words like constantly when they are not written into comment as assumptions are mothers of all fuck-ups. Yes, you did fuck-up, and should apologize as your accusations due unfounded and unchecked assumptions does not justify your abusive attack.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'm 38weeks at the minute and a grumpy cow but I manage not to be a dickhead to my other half and if I get short I apologise. End of pregnancy sucks but it's not OK to be an ass about it.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I’m probably the example of the product of their stupidity - hey, don’t expect your child to like either of you. Love? Maybe, like? Absolutely not.",
          "id": 80,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "One thing I’m kinda wondering is: are those issues with how OP do chores things that arose with the pregnancy because he had to pick up more chores, or were they there before but haven’t been communicated about and are now bubbling over because of how tired his gf is?",
          "id": 81,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4516,
      "content": "ESH - These are the posts that make me appreciate being single.",
      "id": 82,
      "comments": [
        {
          "score": 835,
          "content": "Single and no uterus. Thank fuck I’ll stay that way the rest of my life. \n\nESH\n\nyou knocked her up OP, and that shit is beyond exhausting, just imagine how bad it’ll be if she has an emergency c-section and he needs to care for the bodily needs of both of them for a few weeks. Can’t tell a newborn “do it yourself” because they shat themselves. You also can’t tell your girlfriend that for the first few weeks either.",
          "id": 83,
          "comments": [
            {
              "score": 9,
              "content": "Being pregnant is not an excuse for being an AH",
              "id": 84,
              "comments": [
                {
                  "score": 13,
                  "content": "Which is why I voted E S H. They’re both assholes. Duh",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 243,
          "content": "ESH - These are the posts that make me appreciate the wonderful hubby I have and our relationship and our ability to communication and trust each other.",
          "id": 86,
          "comments": [
            {
              "score": 69,
              "content": "Post like this make me understand why the bar was so low when I met my wife.\n\n&#x200B;\n\n(She set the bar low, not me)",
              "id": 87,
              "comments": [
                {
                  "score": 24,
                  "content": "(She picked you anyway.  How low was that bar?  I digress, please be polite.)",
                  "id": 88,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Same. Some my wife and I see the wildest shit between couples and we always take the time to say we value each other for not acting crazy 🤣",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My favorite post from a friend about his wife's pregnancy was to the effect of: \"I don't mind driving to get salt and vinegar potato chips at 1am when she gets a craving. I run to store at annoying times; she's 3D printing a whole circulatory system and eyeballs and shit.\"\n\nTo be fair, they had a very chill relationship beforehand and a very smooth pregnancy. That's gotta help.",
              "id": 90,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "Me too",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Preach",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "So much truth here",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I'm not single but my husband and I go to therapy regularly and do a lot of work together to improve our relationship, so posts like this make me really appreciate that.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "And being childfree. I worry about the shitty parenting this child is going to receive.",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3264,
      "content": "EHS. She's exhausted from growing a baby and should be communicating better. You kept her waiting an extra 30 minutes on the side of the road because you were being a jerk. And seriously dude this isn't your wife. If you want a wife then you get married.",
      "id": 96,
      "comments": [
        {
          "score": 1425,
          "content": "Yeah why the hell say ‘6 year relationship, not married’ next sentence ‘mY WiFe’…um, NO.",
          "id": 97,
          "comments": [
            {
              "score": 290,
              "content": "Plenty of people say my wife/husband/spouse if they have been together long because bf/gf is too casual. Yes I know partner exists in English but a) not everyone likes that because it does make it sound like you're in business together and b) people might be from a non-English speaking part of the world and their language not have an equivalent.",
              "id": 98,
              "comments": [
                {
                  "score": 67,
                  "content": "Wife/husband/spouse indicates a particular legal relationship which OP does not have with their partner and does not intend to have.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 213,
                      "content": "Which is nobodies business but their own. They choose to call each other that. That’s their business.",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 117,
                      "content": "Depending on where they live, they may actually be common law married.",
                      "id": 101,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 117,
                      "content": "Stop being so pedantic, they're in a long term committed relationship, live together, and are having a kid. If the only reason you think they can't call each other that is because they haven't signed a stupid piece of paper then you have a very old fashioned world view. Get with the times, words change. Literally means figuratively in the dictionary now, so what's wrong with stretching the definition of spouse a little bit?",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Are you policing the words husband and wife usage by couples who may not want to get married but still view themselves as so?",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Read the post again, weirdo.",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "So? They are still together, their legal status is none of our business nor does it have to do with the problem in the post",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 188,
              "content": "Oh wow, I didn’t even catch that until you pointed it out",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 132,
              "content": "Where I live it's very normal to say wife/husband whether you're married or not. It's the life you build that creates the marriage, not the wedding.",
              "id": 107,
              "comments": [
                {
                  "score": 4,
                  "content": "What culture is that? Sounds interesting.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 23,
                      "content": "In my country (brazil) you don't need to marry to be legally married.  If you have a stable relationship, you pretty much have the same legal rights as a married couple.\n\nYou living with a gf for 6 years now? Congratulations, you are married.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Dutch.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "different countries and different cultures maybe? getting married is becoming more and more rare in my country (which is great) but it means there's a lack of a word to distinguish girlfriend from lifelong partner.\n\n6 years with a baby on the way definitely qualifies as \"wife\" in my country. it is incredibly silly to call them girlfriend at that point. other option would be partner but that's widely used to indicate a non-straight relationship which might cause more confusion. \n\nfurther reason why country and culture matters, the word for wife in my language is literally just the word \"woman\" as in \"my woman\" and \"my man\" there is no word for hushand or wife. Making translation difficult.",
              "id": 111,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I mean, I live in a country where marriage isn't really that important, and I'm not married. I just use \"the missus\" to indicate the way the status of our relationship is viewed here for an international audience.",
              "id": 112,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 170,
          "content": "I dunno, posts like this always make me wonder if OP takes any request for change as harsh criticism.  Like…bro told a pregnant woman to change a tire and went 30 minutes trying to force her to do it, and felt justified in the moment.  I am not giving him the benefit of the doubt about being a reliable narrator.\n\nEspecially with the whole wife/not wife thing.  Why go out of your way to say she’s not your wife and also ..repeatedly call her your wife…",
          "id": 113,
          "comments": [
            {
              "score": 40,
              "content": "What does telling OP he’s taking too long accomplish though.  Unless he’s being extraordinarily lackadaisical I’m assuming he’s just inexperienced and therefore it took him time to change the tire, complaining while he’s trying his best is not helping anyone.",
              "id": 114,
              "comments": [
                {
                  "score": 15,
                  "content": "OP mentioned that the wifey had to pee during the tire change though... maybe that's why she was telling him to hurry or something? The wife is still irritating in this situation. Being pregnant doesn't give you the right to be an AH.\n\nESH",
                  "id": 115,
                  "comments": [
                    {
                      "score": 37,
                      "content": "According to OPs story the wife didn’t mention that until they were already home.  Also, assuming OP was working as fast as possible his wife complaining is completely pointless.  Let him work, he’s doing his best, anything she says is just going to slow the process down.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Nothing better than someone telling you to work harder while you’re doing your best. Not even demoralising or frustrating, it’s uplifting and motivating.",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "He also glossed over the fact it's been a difficult pregnancy for her. He doesn't specify - this poor woman could've had medical complications or scares about the baby - that definitely lends more understanding to her behaviour, especially not wanting to be sitting on the side of the road desperate to pee and him faffing about!",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "\"get the government involved in your love life or it doesn't coooooount :((((((\"\n\npeople can do whatever weird shit they want, why do you give a shit.",
          "id": 119,
          "comments": [
            {
              "score": 12,
              "content": "Right, such a weird fucking take lol",
              "id": 120,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "It's a teenager with their stupid child opinions, that's like half of this subreddit, it's not surprising lol",
              "id": 121,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "lol what a weird thing to gate keep. You go take care of her then weirdo",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": ">And seriously dude this isn't your wife. If you want a wife then you get married.\n\nThats such a stupid take, ppl dont get married on paper for many different reasons, that doesnt mean they cant consider each other as such. My parents never married  due to a whole bunch of economic reasons and they have been together for far longer than most legally married couple.",
          "id": 123,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I'm just common law and I refer to my SO as my husband.  That's pretty normal.",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Weird fixation on the wife part. Some people don't want to married.",
          "id": 125,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "We have the marriage police here. I’ll assume you didn’t read their last part. Wtf does it matter if they were married “legally” or not. They’re both happy with that arrangement.\n\nYou’re right about the rest, though.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "Honestly, these days, why does marriage mean anything to you? Devotion is devotion. The only difference between divorce, and simply breaking up, is monetary penalty. If financial repercussions are the only thing keeping you from abandoning your family, you're no better a \"spouse\" than someone who never married the mother of their children in the first place, but *is still around*.",
          "id": 127,
          "comments": [
            {
              "score": 166,
              "content": "[deleted]",
              "id": 128,
              "comments": [
                {
                  "score": 12,
                  "content": "Of course. I'm just saying \"don't call her your wife if you're not married\" is drawing a distinction without a difference.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 93,
                      "content": "The OP is the one that went out of their way to say they weren’t married and then call her his wife.",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 79,
                      "content": "No, it’s not drawing a distinction without a difference. Marriage is a legal agreement, and the relationship which the OP has with his partner doesn’t have this legal status. That is NOT to say that OP’s relationship is “less valid” or “less important” than the relationship of a married couple. But there IS a legal difference between the two states.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Devotion isn't verbally abusing your partner and talking down on them either though, and then using pregnancy as an excuse. It's not an excuse to talk bad about someone who's trying for you in so many different ways",
                  "id": 132,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Growing a whole ass human being doesn't give you a free pass to be an asshole though.",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "There are legal and financial rights and responsibilities that come with marriage. Some of them can’t be replicated any other way, like tax breaks or inheriting someone’s pension payments. \n\nIt’s fine if you don’t want to get married. Just understand that factually, being married does mean something from a legal and financial standpoint.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Except her parents could choose to keep him away if she ends up in a coma or something while giving birth, her parents are the ones with the rights to make medical decisions if she can not. There are other benefits to marriage besides the monetary ties.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "You’re right, but so is the person you’re replying to",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Depending on where you live you dont even need to be married to have the financial penalty.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1888,
      "content": "ESH.\n\nY'all need counseling because life ain't gonna get easier when the baby comes. She's criticizing harshly and you're responding immaturely. This does not bode well for your future.",
      "id": 138,
      "comments": [
        {
          "score": 412,
          "content": "To be fair, we don't know if she's criticizing OP harshly, or if OP freaks out over *any* criticism, as some people do.  He might be getting his fee fees hurt by her saying something like, \"Please don't put the dark clothes in with the light clothes, it ruins them.\"",
          "id": 139,
          "comments": [
            {
              "score": 220,
              "content": "I’m sorry but every single post a woman posts y’all believe her without a doubt. Now this man posts that he feels invalidated by his wife who is being nasty to him and you cannot believe a woman would do that without a reason?",
              "id": 140,
              "comments": [
                {
                  "score": 324,
                  "content": "There’s always someone playing devils advocate don’t try to make this a gender war",
                  "id": 141,
                  "comments": [
                    {
                      "score": 52,
                      "content": "It is a very apparent trend, dont even deny it",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "It is, this sub will almost always side with the pregnant woman. They act like woman when pregnant can’t do anything wrong.",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "This sub is a cesspool of misandry, lmao.",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Dont be naive, thats literally in every post on this sub. So much you'll actually have posts that are the same but with genders reversed but this sub always gives different answers depending on wheater or not OP is a guy or a gal",
                      "id": 145,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 210,
                  "content": "Idk. As a woman I have experience having these same fights. Me: can you please pick up the food you dropped? Him: picks up two of five pieces. Me: there is still food on the flood. Him: so what, I’m not good enough? Me: I just asked you to pick up the food you dropped and you didn’t finish it. \n\nSo how am I supposed to dance around the ego and just get the person to finish the task",
                  "id": 146,
                  "comments": [
                    {
                      "score": 125,
                      "content": "This right here! Or he’ll clean up from dinner, but leave a pot or two unwashed until the next day. That task isn’t done and now I can’t use those pots! But if I point it out now I’m a nag because he already did some and was planning to finish it.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "My ex used to take out the trash but not put in a new bag. Drove me CRAZY. It’s a complete chore! Trash out, new bag replaces it. He would throw a fit acting like I was being picky when I was just asking him to complete the chore he started.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "100% my experience too. He starts shit and doesn't finish it. Then I'm the nag for having to get on his case. \n\nThough I do think a bit of this is normal in relationships. You're going to irk one another from time to time. \n\nOP should've just talked to her about how she was making him feel and given her a chance to recognize it and correct it. Being pregnant is hard, especially so close to the end. Those hormonal behaviours are real, man. \n\nYTA",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Please tell me this is a made up example. I cannot imagine having to tell an adult to pick up food they dropped and then *also* having to explain they need to pick up *all* of it. \n\nThat’s something you’d do with a five year old.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yeah like how does this man not know how to clean his own home?  Clearly he hasn't had enough practice lol. Maybe he had and she's just cranky who knows, but I tend to think she usually keeps the house, not him.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 68,
                  "content": "I’m not saying that it’s the case here, but he said she needed to pee for the entire 30 minutes he was boycotting changing the tire after she said he was going to slow. A pregnant woman’s baby is sitting *on* her bladder. Like, you just have to pee more and it’s more uncomfortable. He also said she’s had a lot of complications and who knows which of the many possibilities she’s gone through. It sounds plausible to me that she needed to pee, he was taking a while, and she told him he was too slow.. because she needed to pee, and he made her wait there in spite for an extra 30 minutes.\n\nNow even if this is what happened, it doesn’t say anything about the rest of the times she complained, but imo if you’re making yourself and your pregnant partner who needs to pee wait for an extra 30 minutes, when they physically cannot take over, out of petty spite, then you’re an asshole. Could be ESH, but just about the tire? He’s totally the asshole.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Honestly if I were the wife, I'd have just peed in the car at that point.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "No, there’s always someone to provide some consideration as to the other side. \n\nAnd let’s not pretend it’s not a huge trend in how men are socialized, to have lower standards for housework and other caretaking tasks.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yup. I’m a woman myself, and it irritates me to no end to see people on Reddit scrambling to make everything the man’s fault when the woman is being unfair. It’s very victim-blamey.\n\nI guarantee you this verdict would be NTA if she were posting instead of him.",
                  "id": 155,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Every single time a woman posts, if you sort by controversial there’s a bunch of men at the bottom saying it’s her fault no many what.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Difference is they are always downvoted. I've literally never seen anyone playing devil's advocate and not believing a woman about a man doing shitty things upvoted (please provide some examples if you can). However in every single thread in which a man is writing a post about a woman doing shitty things (even when it's so blatant that they are voted NTA overall) there are always multiple posts heavily upvoted of people just not believing them or just straight up making up some hypothetical scenario that somehow makes it the man's fault or makes their behaviour ok. There is a massive bias on this sub about this type of stuff.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I'm a woman and I hate this too. Everyone would be up in arms if it was a husband constantly telling his wife she wasn't good enough. Pregnancy is not an excuse. Yet he's an AH cos he made her wait? Nah, miss me with that. If she's like this now what's she gonna be like when they have a screaming newborn? \n\nOP is NTA.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Bc this is aita, every woman (especially pregnant) is a saint that needs to be put on a pedestal and every guy is a horrible toxic monster. \n\nIm saying this as a woman, stop using our gender to determine if we are right or wrong, men *and* women can be ah",
                  "id": 159,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 74,
              "content": "To add, we don’t know if it’s a “you missed this one crumb in the whole kitchen”/“you put the T-shirts in the same wash as the socks” type of nitpicking or a “you’re always forgetting to rince the sink after doing the dishes”/“you’ve left the wet laundry in the washer overnight, and put everything in the dryer without checking if some items can’t go in there for the nth time this month” type of being bad at doing chores. \n\nCus yeah it’s annoying when some tells you that you haven’t done your chore properly, especially if this means nitpicking at details. But we also need to consider that it can also be a case of OP half assing chores. OP, if you’re seeing this, could you give any more detail on what your gf is telling you about how you do chores?",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "My guess is she IS critizing him harshly, but it's because she's used to helping him do it or fixing the little things he misses herself. Now she can't do it, and she's feeling frustrated with her state and taking out on him. Maybe she's not mad at him, she's just mad that her normal has changed so much, and there's nothing she can do about it.\n\nTo be clear, she should still care about his feelings and try to communicate in another way, but I don't think this means a forever problem.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "[deleted]",
              "id": 162,
              "comments": [
                {
                  "score": 3,
                  "content": "Which is still not okay. People generally are changing tires as fast as they can. They aren't doing it leisurely. \n\nHow about you do something difficult and stressful and have someone tell you to go faster and see how much it helps.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "that is an extremely stupid conclusion to come to",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 31,
          "content": "As someone in a marriage who was like this unknowingly before having our first kid and are now trying to navigate it…can confirm it is very hard.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Meh, most people I know fought a lot in the last month of pregnancy. It's really really fucking hard on the wife. It's really hard to adapt to the constance physical and emotional changes so it makes sense why she acts like a jerk. Most people would need some time to find coping strategies and the changes happen too fast to find them.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 857,
      "content": "INFO: Who has been doing these tasks before she was heavily pregnant?",
      "id": 167,
      "comments": [
        {
          "score": 635,
          "content": "Yeah, I wonder if she wasn't complaining because she was the one doing most or all of it...",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 350,
          "content": "That’s what I was wondering. Him saying she thinks his cleaning “isn’t good enough” was trying off alarm bells in my head",
          "id": 169,
          "comments": [
            {
              "score": 106,
              "content": "It’s in the post. He points out she had no issue with his cooking etc pre-pregnancy.",
              "id": 170,
              "comments": [
                {
                  "score": 173,
                  "content": "I mean pregnancy can change your sense of taste and smell so drastically. My aunt loves eggs, but when she was pregnant, the smell and taste would make her sick. The same way, she started to hate spices like paprika or pepper, which she used to eat frequently. This came back to normal after she gave birth. But hormones influence sensory inputs so much, some people will smell things more intensely during their periods for that reason as well",
                  "id": 171,
                  "comments": [
                    {
                      "score": 36,
                      "content": "I couldn’t eat beef with my first, for basically the entire time. I couldn’t eat breakfast foods for breakfast in the beginning, and that was weird, but beef was like poison. The second I gave birth I was like “I want steak. I’m ready.”",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I could always choke down an egg salad sandwich if it was given to me, and I was hungry enough, but would have never chosen that for myself. When I was pregnant, I was obsessed with them and thought they were the greatest thing in the world. It was bizarre. And they needed caraway seeds, even when I caught Covid and couldn't taste anything for a week. After Covid, eggs/sulfur had an entirely different smell to me. I liked them the same, but the smell was completely different. I'll never know which version most other people are experiencing.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That's fine, but wife cannot take her anger out on the husband because pregnancy changed her appetite.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Nah it doesnt explicitly say that.  He might actually mean he never heard these complaints before possibly cause he never did them before.",
                  "id": 175,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "My apologies for the late answer. \n\nBefore she was pregnant, I did most of the cooking. She occasionally cooked (or for special occasions, like my birthday). \n\nShe did most of the laundry. I did it only occasionally, such as when she was away or worked late. Or in the weekends when she wanted to relax.\n\nCleaning, we both did a lot. We usually cleaned together or the same day. \n\nAs for foot messages (maybe not really important), I did them sparingly for her whenever her feet hurt. Even before she was pregnant, she sometimes had sore feet. \n\nThe list goes on, but you get the idea.",
          "id": 176,
          "comments": [
            {
              "score": 160,
              "content": "I’m going to give you some advice from someone who had a baby last year: in the big picture it doesn’t matter who’s the asshole in this situation, *y’all are about to be parents*. You both need to be doing better in how you treat each other- your wife shouldn’t be taking her frustrations with being pregnant out on you and you shouldn’t be retaliating by intentionally making an 8 mo pregnant woman wait to go to the bathroom (believe me, that could have *easily* turned into a humiliating situation for your wife as you physically cannot hold it for too long when you are *that* pregnant). \n\nYou guys have a relationship dynamic issue that you two need to at least start sorting out ***before*** the baby gets here. The stress from sleep deprivation and a crying newborn are just going to make this snipping at each other worse and your patience even more thin. Don’t make your lives with a newborn harder than it has to be. \n\nHonestly: book a couples counseling appointment for next week (if possible). If not possible then find some guided DIY counseling sessions/exercise online or in a book that you can do yourselves (like [this](https://blog.opencounseling.com/diy-marriage-counseling/) or [this](https://positivepsychology.com/couples-therapy-worksheets-activities/)). You guys probably have less than a month before the baby gets here, even *one* appointment to work on your communication and issues with each other would be helpful. \n\nBabies are hard enough as it is- make sure you guys are on the same team before they get here. (*Also- congrats on the baby. It’s hard at times but sooooo worth it once you start getting smiles and laughs!*).",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Then I'd say you're both kind of assholes. Her for not being able to communicate like an adult human being and letting you know what she needs, without being mean about it. You for being spiteful and keeping you both in a potentially dangerous situation, just to teach her a lesson. ESH.",
              "id": 178,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I am using reply in the hope you get to see this.\n\nNeither of you are assholes.\n\nBeing pregnant can be a shit show for the mother to be and a hugely confusing and difficult time for the father to be, but as the father to be you have to put on your big boy pants and step up, as your hormones are not going haywire, your body is not being invaded by another being for 9 months and you are not going to be pushing out something the size of a watermelon through a very narrow opening at the end of it all.\n\nThe first time for me the first 4 months were the worst.  I was constantly on the verge of throwing up, whilst having to work full time and not letting work know that I was pregnant.  Common practice in the UK is to not let anyone apart from your partner know for the first 3 months.\n\nI would get home from work, throw up in the loo and then demand (not ask) for my husband to get me cod roe, chips and mushy peas from the local chip shop.  Totally irrational, but vital to my sanity and wellbeing for the rest of the evening.\n\nThe middle bit (second trimester) I was a glowing, capable goddess. Full of energy and positivity.  The whole house got cleaned from top to bottom.\n\nThe end bit (third trimester) I was a big, fat, hot, uncomfortable mess who could not sleep on my back, constantly needed to pee and even sleeping on my side was difficult, even with a pillow between by legs.\n\nAll of this was combined with a full time stressful job.\n\nOnce the baby is born you are in a whole new way of life and in the first year, at least, or longer, you should really abandon all ideas of what was fair and equal beforehand.\n\nIt all depends on so many factors.  The baby being the most important.  My first clearly did not read the manual and so sleep deprivation was a big factor in my inability to do anything much other feed, change, rock him whilst he screamed his tits off for 15 hours a day for the first 3 months.\n\nDuring this time I did nothing except care for the baby, go to the loo and eat.  Husband did everything else, whilst holding down a full time job.\n\nLuckily baby no 2 had clearly read the manual and by week 12 was sleeping through the night, so I could help out around the house.\n\nWe are now into our 22nd year of parenthood and it continues to be a challenge.  We have had many, many joyful times, but as they grew older the challenges have changed.\n\nYou have to remain flexible and support each other and your children as you all grow and change.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 61,
          "content": "Yeah, right?  Like, is he ruining her clothes in the laundry?  Bleach stains, color stains on white, putting bras in the dryer?  Was he cleaning before at all?  Was she just cleaning up after him before but now can’t so it’s an issue now when he does it wrong?  We need more info on if her standards are high, higher than before, or he never really learned how to do chores properly.\n\nEdit:  cooking might ‘be shit’ because she has specific cravings and new difficulties with foods, or he might generally suck",
          "id": 180,
          "comments": [
            {
              "score": 13,
              "content": "Still not an excuse to be an an AH",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "Probably her and now she’s pissed she procreated with someone who can’t pull their weight",
          "id": 182,
          "comments": [
            {
              "score": 10,
              "content": "You should re-read the post.",
              "id": 183,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "It’s in the post - she had no issue with him doing that stuff pre-pregnancy.",
          "id": 184,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Read the post. He's been doing his share of the chores around the house if she never had a problem with his coming or cleaning before pregnancy. The \"now my food is shit\" thing implies it wasn't that before",
          "id": 185,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Op said they were splitting the chores, now its all him since she cant do much",
          "id": 186,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 494,
      "content": "ESH. You both need to grow up and work out your petty issues before your kid gets here.",
      "id": 187,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 473,
      "content": "YTA\n\nYou wasted 30 minutes while changing a tire just to prove a point?\n\nAnd don't call her wife if you don't even get married. \n\n>My cooking is shit, I don’t do laundry correctly, I don’t clean well enough/miss too many spots.\n\nHave you thought that maybe it is? Put more effort.",
      "id": 188,
      "comments": [
        {
          "score": 274,
          "content": "> You wasted 30 minutes while changing a tire just to prove a point?\n\nWhat point did he prove?  That he doesn't give a fuck about either her or his child.  If she's stressed, the baby is stressed too.",
          "id": 189,
          "comments": [
            {
              "score": 175,
              "content": "Okay and you’re mute about her behavior, why? Being pregnant doesn’t give you a pass to belittle people and lash out. Coming from someone who’s been pregnant before. And please, don’t twist my point. I’m not standing up for OP, not excusing his petty behavior. But I’m not about condemning one and commending the other when they’re both clearly wrong.",
              "id": 190,
              "comments": [
                {
                  "score": 62,
                  "content": "because this subreddit is incredibly sexist.",
                  "id": 191,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "So the mother is free to get stressed how she wants and it'll always be the husband fault ? Damn I don't want to have kids.",
              "id": 192,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "She was already stressed daily by constantly berating him",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "“If someone verbally abused you, have you considered that they might just be correct?”\n\nlol. lmao, even",
          "id": 194,
          "comments": [
            {
              "score": 4,
              "content": "How is “You don’t do laundry correctly” verbal abuse?",
              "id": 195,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Yeah OP needs to take a long hard look in the mirror and ask himself \"are my massages good enough?\"",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "100% you say the same shit if it was him suing it to her and that comment would be destroyed. \n\nJesus Christ what a garbage response by them",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 72,
          "content": "Pregnancy is a reason not an excuse. The pregnancy can explain her being an asshole but it doesn't make it ok. It's pretty fucking easy to not unload your stress on your SO. Both are assholes.",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "He mentioned in the post that she had no problem with it before. He even clarified in a comment that he did most of the cooking before and had no problem. He’s responding to her asshole behavior immaturely. But she was the asshole first and the catalyst for all the bullshit after.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">And don't call her wife if you don't even get married. \n\n  Thats irrelevant, ppl dont get married for plenty of reasons, if they want to be called husband and wife, why should we care?\n\n>Have you thought that maybe it is? Put more effort.\n\nDid you read the post? She never complained before pregnancy, and now hes doing everything around the house and she constantly insulting him",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 396,
      "content": "I have to say I had an abusive ex who, in part, would belittle me and constantly tell me I wasn’t enough and nothing I did was good enough.  It’s hard to say if this is your situation since pregnancy does inflate certain frustrations.  My ex was like that before, during and after her pregnancy.",
      "id": 201,
      "comments": [
        {
          "score": 209,
          "content": "It was kind of triggering reading it because I've been abused by someone who just constantly told me I wasn't doing this good enough. I'd try harder and harder, bend over backwards for them, but they'd still point out faults. I knew I needed out when I went to my room and just slammed my head into a wall because of how insane it was making me. The girlfriend might not be that bad, but it had similarities.",
          "id": 202,
          "comments": [
            {
              "score": 101,
              "content": "Reading this was absolutely triggering.  When it comes to mundane chores it’s easy to exercise patience and NOT scream at the top of your lungs how much of an idiot someone is for not doing something ‘correctly.’",
              "id": 203,
              "comments": [
                {
                  "score": 37,
                  "content": "Even if the job isn't done that will there are nice ways to go about saying it. But usually it's just not done to their preference or it's done great and it doesn't matter. They'll point out flaws that don't even exist. When they follow right behind you telling you all the things that are wrong with you... ugh. It's hell.",
                  "id": 204,
                  "comments": [
                    {
                      "score": 9,
                      "content": "yes. and also, if you are super nervous, you will end up making more mistakes. and then they can berate you more. it is a vicious cycle.\n\nI am going to cut the very pregnant woman some slack, but if this is a continuing pattern, it is a form of abuse",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Where does it say she screamed",
                  "id": 206,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It doesn’t.  My ex did.  I could have explained her off as ‘she’s just telling me’ like I did for seven years when it took my friends and family to tell me she’s tearing me apart.  Reading something like this is triggering and reminds me of my horrible situation I would make excuses for.",
                      "id": 207,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "AITA doesn't like it when men have a backbone against their pregnant partners. A woman could be abusive and somehow people are still saying he sucks for not accepting being abused anymore.",
          "id": 208,
          "comments": [
            {
              "score": 20,
              "content": "[removed]",
              "id": 209,
              "comments": [
                {
                  "score": 3,
                  "content": "I agree with everything you said but i would like to correct you on your point of female on male abuse being uncommon. I unfortunately don't have a link handy but please look up studies on abuse rates. I only remember a certain name associated with the first one i saw. I think her name was Erin Pizzey.  In those studies it said when abuse is only one person in a relationship being physically abusive it is actually about 70-80% the time women abusing men. This statistic is commonly hidden or outright omitted due to the unchecked misandry in feminist organizations and Academia.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "The fact that ppl here are defending her simply bc shes pregnant",
          "id": 211,
          "comments": [
            {
              "score": 5,
              "content": "Exactly.  Thank you.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "That's the question I have. I have an abusive mother and she criticises just for the fun of it and there is no way to have a reasonable conversation and find a compromise. \n\nThe question is is she one of those people or is it temporary and she's normally a good person and OP is actually doing a bad job. Some abusers only start properly once the other person is trapped with kids for example.",
          "id": 213,
          "comments": [
            {
              "score": 7,
              "content": "Various levels of abuse.  Constant nagging and belittling because the other person thinks it’s ‘fun’ is abuse.  The only time my ex laughed around me was when she was laughing at me for something.  I hated it.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 257,
      "content": "ESH. Pregnancy is definitely tough but it doesn't justify mistreating your SO. On the other hand, I don't think passive aggression/ sinking to her level is going to do a whole lot of good either. Definitely sit down and tell her how she's making you feel.",
      "id": 215,
      "comments": [
        {
          "score": 112,
          "content": "Exactly. “Do it yourself “ might work great for her complaining about his cooking, or missing spots cleaning, but what did sitting around for 30 min refusing to finish changing the tire accomplish?  \n\nIm not even sure I can get behind it on cooking and cleaning because then it feels a bit too weaponized incompetence-y.  We don’t know how bad the cooking and cleaning actually is here.  \n\nShe may be pissy but he’s petulant at best.",
          "id": 216,
          "comments": [
            {
              "score": 25,
              "content": "or he was driven over his limit. Dads are also allowed to feel stressed out. And with non-stop nagging and no gratification I can fully imagine someone snapping and lashing out irrationally. But yeah he really should have found a moment in the weeks leading up to this to talk to his SO and tell her what effect her behavior is having on him. And to figure out how to make it stop.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 223,
      "content": "NTA. Probably going to be an unpopular opinion. \n\nAnd I say this as someone who is nearly 8 months pregnant with a high risk difficult pregnancy. \n\nSometimes I think my partner doesn’t do things correctly but really, he’s just not doing it MY way, there’s nothing actually wrong with the way he does it. (Just for example, when hanging the washing on the airer I like to put the small bits at the bottom and big bits at the top and he puts it anywhere. It’s all going to dry so it doesn’t really matter). \n\nYou are helping out, sounds like you’re taking over a lot and it’s going to get anyone down being told you’re not good enough at something. I don’t blame you for telling her to do it herself and I would fully expect my partner to tell me the same if I was acting that way.",
      "id": 218,
      "comments": [
        {
          "score": 47,
          "content": "I’m 8 months myself with baby 4 due my 4th section soon, and the one part he is the AH on is making her wait half an hour cause he refused to change the tire. Yes she might have said somethings she shouldn’t of but to deliberately make her wait was awful, what if her waters broke in that half an hour? Mine did with my first early, he would of been panicking then May have botched the job. He should of just got on with that.\n\nThe rest yeah she’s got hormones flying everywhere so much she likely doesn’t mean but it’s frustration on her part with her hormones and tiredness etc. she should be more thoughtful before talking instead of letting her hormones constantly take over which is likely what’s happening",
          "id": 219,
          "comments": [
            {
              "score": 65,
              "content": "She's having a baby, she isn't one herself.\n\nShe's been a major AH for a long time now, and he doesn't like helping her when she decides it's acceptable for her to act like an AH.\n\nYou're all acting like she has no choice and cannot really be blamed for being an AH, while him not letting himself be abused makes him an AH.\n\nNot true. She could have stopped being an AH, apologized, and they'd have been on their way. Or she could have taken care of the tire without him. She decided to blame him instead because that's the game she wants to play.\n\nSo far he did the right thing: When abuse like this starts you try to stop it gracefully, by talking, for a couple of weeks. When that doesn't work, go zero tolerance - letting the partner's abuse continue unchecked will destroy the relationship, and yourself. Go zero tolerance and talk. If talk doesn't help after a week, get counseling.",
              "id": 220,
              "comments": [
                {
                  "score": 24,
                  "content": "She could of taken care of the tire without him? Are you delusional?! 8 months pregnant on your knees having to move around tires and manhandle bolts and all, fucking hell it’s hard enough getting up without having to re bend down to pick it all up to put away.",
                  "id": 221,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Learned helplessness. If the husband wasn't there she wouldn't have shrivelled and died. She'd either have called roadside assistance, or changed the tire herself. Not all women are completely immobilized by pregnancy, but that is a popular trope on reddit.",
                      "id": 222,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 33,
                      "content": "She presumably has a cellphone. She could take care of it. It doesn’t take a lot of work to call for help.",
                      "id": 223,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "You've never changed a tire have you? Manhandle bolts? lol",
                      "id": 224,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "Pregnancy is no excuse for abuse",
              "id": 225,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "It could be that after months of hearing it, he got tired (pun).",
              "id": 226,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I mean, thinking about possible reactions to being screamed at about not changing a tire fast enough, going tools down (on strike) is a pretty gentle response, versus, say, getting up in someone's face and relating at top volume how unhelpful it is to get yelled at.\n\nTelling someone they aren't working fast enough when they're already struggling is just about as low as you can go.  It ain't gonna get you good results, no matter how it works out.  Worst case, you wind up with an injured tire changer or broken car.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "She’s a grown adult who can her herself places (such as the toilet). I’m not sure why suddenly people (females, males, pregnant or not) think that everything needs doing for them once they’re carrying a child. If her waters broke, she could call a friend, family member, taxi, ambulance. Many resources available. \n\nThe hormone argument is none existent and we all need to stop allowing pregnant women to get away with what is becoming abuse just because they’re pregnant and may be sensitive. Quite frankly if it was me in the situation (me as OP), we would have sat there all day. Especially if my partner had been chipping away at my confidence for what seems like a while now.",
              "id": 228,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "She had to wait due to her behaviour.\n\nYeah, it was a petty act but it seems to be an expression of his frustration.",
              "id": 229,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Can’t believe I had to scroll this far to find someone that acknowledged that being pregnant doesn’t give you the right to just turn into a raging AH - and I say this as someone who’s about to have my 3rd baby in a couple of weeks! \n\nSure, it’s tiring, and you’re hormonal, but the guy seems to be trying his best, even down to giving her foot massages. Whether he did it before she got pregnant or not is irrelevant, he’s stepping up now, so cut him some slack. \n\nThere’s only so much nagging someone can take before it starts to wear you down, and OP has been taking months of this shit. It’s only going to get worse once the baby is here and sleep deprivation starts to take a toll on them. \n\nI don’t blame OP for his reaction, but logically, if they do want to successfully stay together, it’s high time they have a sit down and communicate with each other.\n\nNTA",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Took way too long to find this. Dude is getting abused, of course he’s fed up.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This is one Hell of a grown-up comment. Kudos for your maturity, your self-assurance, and your competency at partnership. I hope your pregnancy comes to term smoothly and you and your partner have the best experience raising your child.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}