{
  "post content": "My SIL and I do not get along. We actually used to be great friends in college and I in fact met my husband through her but she... changed. She’s now obsessed with being the “perfect” mom, sews all of her kids’ clothes, feeds them all organic vegan food, homeschools, etc. All of that is fine and I really don’t care what she chooses to do, but she is insanely judgmental. Constantly makes passive aggressive comments about the fact that I didn’t have a natural childbirth, that my kid has been in daycare since he was 12 weeks, that I work really long hours, that we feed our son fast food (he really likes chick fil a and I see no reason why he can’t have this occasionally), and so many other things. Needless to say, I generally choose not to spend time with her.\n\nMy in-laws have a lake house that is not very convenient to where we live so we don’t go there often. However, my MIL requested that we all go for her bday since we are all now vaccinated and she hasn’t had all of us together in over a year. My husband decided to rent a boat for one of the days so he could go fishing with my son. Of course my nieces wanted to go too and originally, we were fine with it. However, then my SIL said they weren’t allowed to go without her so she had  to come too. Well, I really didn’t want to spend like 8 straight hours with my SIL in the middle of a lake on a small boat so we just told her the boat couldn’t accommodate that many people (although it was kind of an obvious lie). My nieces had a meltdown bc they were missing out on a fun all-day boat trip. We ended up just going without them bc my SIL would not budge. \n\nWell, it’s been a few weeks now and pretty much my husband’s entire family is united in their belief that we are gigantic AHs. They said we obviously lied to keep SIL off the boat and that we purposefully deprived our nieces of a fun outing. Apparently our nieces have also been asking why we don’t like them anymore. I feel zero regret for excluding my SIL, but my nieces are good kids and we love them very much. Now I kind of feel like we were the AHs for making them feel like we didn’t want them to come along with us. \n\nTo be clear, I’m not judging my SIL at all for her decision not to allow her kids to spend all day on a boat without her. While I think personally it would have been safe (2 adults familiar with boat safety, 3 kids ages 5, 8, 9), I get why she wouldn’t be comfortable with that. My main issue was simply that I didn’t want to listen to her make jabs about my parenting and life choices all day.\n\nInfo: We didn’t tell our nieces that they could come, we told them that they had to get permission from their parents and then my SIL told us no, unless she also comes along. \n\nInfo 2: I have had many (many) talks with my SIL over the years about the way she talks to me and she always apologizes, claims she doesn’t realize she’s doing it, and tells me she will try to be more conscious. She’s usually good for a few weeks at best, but then will start in again with the passive aggressive remarks. None of what she says is straight up mean, it’s just a constant barrage of “well of course, I don’t judge you, but I’ve just read a lot about food dyes in those snacks and I’m just concerned about (my son). I would never dream of giving those to (her kids).”\n\nInfo 3: A lot of people have commented that it’s weird/inappropriate to rent a boat that isn’t intended for the whole family during a family vacation. My husband is a pretty quiet, introverted guy and spending a week straight with his (very loud and large) family is draining for him. It’s normal behavior for him to do his own thing during vacations with his family. His family knows this and doesn’t usually mind bc they are so used to it. As far as I know they aren’t upset that he rented a boat for the day, it’s bc we didn’t bring our nieces along.\n\nInfo 4: For those of you suggesting that I call her out on her behavior while on the boat, or that I turn the boat around bc of her behavior, I’m not going to be outright mean to her in front of her young kids. I get that being passive aggressive about not including her on the boat is not the most mature thing to do, but I was trying not to cause too much drama/conflict in front of our nieces (obviously didn’t work though). They love their mom, who is actually a very good and kind mother to them. Yes, she is super controlling of their lifestyle but honestly, they’ve never really known any differently. She is absolutely a judgmental nightmare to me, but I’m not trying to ruin their image of her. Maybe when they’re older they will pick up on her passive aggressive BS to others, but for now they’re still little and think mommy is the best. I’ve never confronted my SIL in front of our kids, and don’t ever plan to. That being said, I definitely could have talked to her more honestly about the boat in private and seeing how upset our nieces are now, I’m kind of wishing I had just sucked it up and let her go.\n\nUpdate: I showed this to my husband and we both decided that we are the AHs bc our love for our nieces is more important than the fact that my SIL is a judgmental jerk. Someone suggested that we plan a special outing with my nieces so we have decided to call my SIL, apologize for hurting our nieces, and discuss an outing for all of the kids. Thanks for the judgment all, it actually did help me reach my decision!",
  "id": 1,
  "comments": [
    {
      "score": 1994,
      "content": "I’ll prob get down voted but ESH \nShe is pushy and judgmental. So obviously not a saint here. \n\nYou told an obvious lie so you could get out of actually articulating your feelings like a grown up. Also if you told the girls that they could go this was probably a huge blow to their weekend. You shouldn’t tell kids yes to things if you can’t back it up, and if you have to cancel telling an obvious lie makes things 1000% worse.\n\nEdit: I am still sticking with ESH. You told your nieces to ask for permission, that implies that if their mom says yes they can go on the boat. Mom said yes, just with a qualifier you didn’t like but honestly it’s not that out of left field. \n\nYou then told a lie that was obviously a lie so you could get out of taking them. Yeah it sounds like this woman is annoying but I still think you did not handle this situation appropriately. At the end of the day though it’s a boat and not the end of the world.",
      "id": 2,
      "comments": [
        {
          "score": 886,
          "content": "Edited to include info above since I wasn’t clear in my original post, but we didn’t tell the kids they could come, we told them to ask their parents for permission. I have also previously confronted my SIL about the comments, but she never changes. I guess I could have been more straight up that day, I just didn’t want to deal with the additional drama of her crying, telling me I must hate her, then having to spend most of my day trying to reassure her that she’s not a terrible person who everyone hates. (Yes, this is an actual incident that has occurred when I’ve confronted her in the past... on more than one occasion.) Although, I can get why it was a pretty childish move not to be upfront with her about the boat.",
          "id": 3,
          "comments": [
            {
              "score": 814,
              "content": "You need to be straight up about not tolerating the way she speaks to you, and you need to not let it go. Enforce that boundary as she crosses it. When she starts her passive aggressiveness cut her off. Say “I’ve told you I will not tolerate your passive aggressive, judgmental comments. If you don’t stop speaking to me that way immediately I will leave this event/ask you to leave.” If she tries to make you comfort her with her “everyone hates me” BS do not respond or engage. If she does it in your home tell her to leave if she can’t drop the topic. \n\nEnforcing boundaries can make you feel like the AH. It can make you feel like you’re being a drama Queen.  It can involve making other people uncomfortable. But its necessary. And you will see improvement.",
              "id": 4,
              "comments": [
                {
                  "score": 543,
                  "content": "Bit hard to leave a boat when it's afloat \n especially when you've paid for it.\n\nAlso confrontation, tears and an argument may be what floats your boat (see what I did there?) But not everyone wants their trip spoiled before it even begins.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 283,
                      "content": "I mean, they could ditch SIL over the side?",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 46,
                      "content": "You could turn the boat around though, drop her off and head back out.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -24,
                      "content": "I didn’t mean in the boat. If SIL continually puts dune OP that boundary needs to be enforced and reinforced every time she crosses it. The boat ride is just one day in an ongoing problem",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 201,
                  "content": "How is OP supposed to leave a boat? The onus is not on OP to expend time and energy constantly banging her head against a brick wall to “enforce the boundary”. She’s tried to do that repeatedly to no effect and only caused more stress and drama. Some people simply cannot be reasoned with. OP is totally entitled to instead decide she’s simply going to disengage and minimise the amount of time she spends with SIL, especially in circumstances where she cannot easily leave. OP has done nothing wrong here and she doesn’t owe it to her SIL to keep giving her second fourth and 15th chances. If OP had never assertively articulated her boundary and tried to have a conversation and instead just avoided SIL, that would be passive aggressive and immature and a bit of an asshole way to behave. But she’s made the issue crystal clear to SIL. She’s not an AH for not wishing to engage in further pointless conflict on a relaxing family holiday.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Personally I would start making comments back to her in line with what she’s saying. And then when she complains, say something like “so are you saying that I shouldn’t make jabs at your parenting choices because it’s hurtful and rude?”  When sil says yes then say “sort of like you shouldn’t do that to me?”\n\nI’ve used this technique before on people that I either have to or want to maintain the relationship. It helps them see what they are doing. Sometimes. Other people I just say fuck it and push them out of my life.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "There’s a great class called Boundaries For Kind People that helps people learn good ways to execute boundaries in these kinds of situations that might be worth looking into to.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Through recent talks with my psychologist I realised I often tell white lies/small lies that don't really hurt anyone to avoid a bigger blow up (anxiety/stress issues) if I see that the result of the small lie would cause less hurt on both sides. I can see that being also the case here, if this has been going on for years, as a sort of coping mechanism with hard to handle people.\n\nThat, and some people don't take no for an answer even if you have a good honest one. \"I don't want you there as I wouldn't feel comfortable due to you repeatedly judging my life decisions and how I handle Son\" will not cut it with those sort of people. Then will come the emotional blackmail, manipulation, and if OP holds her ground, SIL will let the monkeys fly. (Well it happened anyway, true.) There was just no winning in this scenario.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Unfortunately people who push boundaries count on others to go along to get along. It’s why they’ve gotten away with it. And it’s unfortunate that that’s why enforcing boundaries can be so hard and stressful.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": ">Classic triangulation. SIL has insecurities showing.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "OP has. Read the edits.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "Stop reassuring her that she’s not hated. That’s classic manipulation on her part. “You must hate me” “no, just what you say to me.” “I’m a terrible person and everyone hates me” “so stop being terrible to people.”",
              "id": 16,
              "comments": [
                {
                  "score": 51,
                  "content": "Yeah, this was going to be my feedback. \"Everyone hates me\" is part of a game where *you* become the bad guy for calling *her* out on her bad behavior. You're not the bad guy,  [u/ThrowawayBoatIssue11](https://www.reddit.com/user/ThrowawayBoatIssue11/), so don't act like one. Don't apologize or console. Just give her the feedback you intend to give her, and when she goes on her little \"you hate me, everyone hates me\" rant, you just calmly say, \"That's not what I said and I'm sorry you feel that way, but I won't allow you to continue making these comments to me.\" And then, if she insists that you really *must* hate her, I would just follow up with bland, repeated, \"I'm sorry you feel that way\" statements. Not even slightly varied -- make it clear that these are her feelings, not something you said, but also that her tears don't inspire your guilt and you're not engaging with her nonsense.\n\nThen, if you're able, walk away. And next time she makes a comment, call her out again (and leave again, if she goes into her rant or doesn't immediately stop). The point is for you to stay calm and draw firm, explicit boundaries (adult communication, not letting her drag you down to her level) and enforce them, for your own sake and your family's sake.\n\nI know it's rough to stand up to this kind of person, but you should think about your son -- both the example you'll be setting to him about good conflict management and the impact on him if you don't (he's a kid, so he can't escape or stand up to her bad behavior as easily as you can).\n\nYou're not the AH for how you handled this one situation, but you are the AH if you continue to lie & dodge her or play her game going forward.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "> “You must hate me”\n\nI know someone that uses this, however I am ever so slowly edging towards \"yes\" as the answer whenever it is deployed lol!",
                  "id": 18,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I had a friend who used to say that as a manipulative tactic.  It got to the point where I’d be say, “I’m really starting to”.  We’re not friends anymore",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I have a parent who uses this. One time I did say yes. I was 12ish then. I'm 40 now. It still gets used against me.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My response to this is always, I don’t hate you but I hate your behavior.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Just once I want to say. 'keep crying I want you to feel this'. It's all so you can comfort their bullshit.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "You SIL isn't doing everything great either... you shouldn't feed kids a vegan diet without the input from a pediatrician who is knowledgeable about nutrition. A vegetarian diet is fine, if balanced properly, but a vegan diet increases the risk of deficiencies. Particularly iron and B12 which are both essential for our health. A vegan diet risks depriving children of essential vitamins and minerals. \n\nI don't know if it helps but it does provide you with some ammunition..",
              "id": 23,
              "comments": [
                {
                  "score": 11,
                  "content": "I just want to jump in here, because I get what you’re saying but it really depends on the SIL’s attitude to veganism rather than veganism itself. I’m vegetarian personally, and I used to believe years ago that veganism was too strict and that vegans have to take supplements, which isn’t natural. But I’ve gotten to know a fair few vegans, who make sure they and their kids are super healthy, have thoroughly researched how to get all their nutrition from food, and their kids are so disgustingly healthy and bright.\n\nHowever, I also know vegans (and vegetarians) who are basically carbotarians, and overweight and unhealthy. So yes, being a vegetarian or vegan does not necessarily equal healthy and of a good weight and fitness.\n\nI can understand your point, because you are not against veganism itself, but saying it has to be properly balanced, which is completely correct. Absolutely.\n\nThough it is something to bear in mind, that I have seen people who take their kids to MacDonalds every day, whose kids probably never have a sniff of a vegetable except the lettuce scraps that fall off a burger and the tomato sauce on a pizza, who will round on anyone who says they are vegetarian/vegan with a “bUt yOu CaNt gEt aLL yOur NutRitIon!” I’m not saying you’re like that, but I see it so bloody often.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 5,
                      "content": "My sister was vegetarian and then vegan for many years, so I have some insight into the whole thing. If you do research and talk to a professional you can eat a vegan diet. It is not recommended to feed kids vegan only but if you listen to a dietician it can work out.\n\nPersonally, I can't eat vegetarian. I can't handle most meat substitutes, they cause nausea, lintels won't go down and I'm very picky when it comes to fruits and vegetables. There are very few I'm able to make myself eat. I'm generally fine. Ironically I have currently an iron deficiency causing anemia but that's not uncommon in young women. A meat-free diet would make this a bigger issue though",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Notice how your comment is longer than the one you're responding to and still, you are saying less than them.\n\nHaving enough B12 is important. Having enough iron is important. Having complete protein is important.\n\nTalking to a nutrition specialist is a good way to go if considering a vegan diet for little kids.\n\nOr do you disagree?",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "AHH IDK ABOU THIS. you can def be on a vegan diet but of course you have to make modifications. And be very educated. I mean we don't be talking about how bad fast food is now do we or confront the vast downhill we are going down obesity. or how our \"normal diet\" is leading to this. I think it's good she feeds her child organic food, I would too. But I would def opt for insects (peopleee, be aware that it'll soon become the alternative for the meat we love so much). However, there is of course vitamins you can take for a reason and other foods you can substitute for the said vitamin.\n\nAll diets risk depriving children of essential vitamins and things they need to grow, you need to do a research either with a nutritionist or a pedatricion (like you said) to get educated on what you need. Not a lot of people are knowdlegable on plant based diet so you might need to do more research than others.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Children shouldn't have to take supplements just to get all the nutrition they need. An adult, over even an older teen, can make the choice for themselves and handle the outcome. A child can't. It is not recommended, by doctors, to feed kids a vegan diet. You can give them a reduced amount of meat instead or stick to vegetarian food since it includes milk and eggs. Both good sources of nutrients. Especially egg.\n\nAlso, obesity isn't caused by meat. It is caused by overeating and sugar. Protein is more filling than carbohydrates and reduce the urge for sugar.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "NTA  \nShe is what I call a sancto-mommy. A Sanctimonious mommy..I can't stand other women like this and refuse to be around most moms because of how they are. (my city is affluent and filled with women like this.",
              "id": 29,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "NTA   \n    \nThis was something your family was doing, and you were willing to take the nieces along, their mother said no.   \n    \n>  Apparently our nieces have also been asking why we don’t like them anymore.   \n    \nTell your nieces that you love them and would have been happy to have them come along on the boat, but their mother said no, and that you have to respect their parents decisions.    \n    \n>  Well, it’s been a few weeks now and pretty much my husband’s entire family is united in their belief that we are gigantic AHs.   \n    \nTell the rest of the family that the boat trip was a way to escape for a small amount of time the constant and never stopping criticisms of the SIL that cause your family no end of mental fatigue, and that yes, you told a white lie, but it was done to not be mean during a family vacation.  That if the SIL wishes to be invited on these types of outings, she will first need to learn to not be constantly overbearing to the point that you need to get away from her for a short period to recharge.   \n    \nThen I would have a talk with MIL and FIL with you and your husband.  Let them know that you love bringing the grandchildren to visit them, and want to continue, if they attack you for choices you make to protect your family, you will have to decline future invitations, and that if they want to \"keep the peace\" and make sure everyone has a good time, maybe they should talk to the SIL about her constant nitpicking and criticism of others.  That you expect an apology for being attacked over this, that you would have been glad to have the nieces come with you, but the SIL was not welcome.   \n     \nThen leave the ball in their court.  Go LC until you get an apology, and don't respond to any other communication until it comes.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You know you could have just not gone and made it your husband's problem to deal with his sister for a day.\n\nETA - I general don't like boats so this would have been a win for me if I were in your situation, but if you love them I suppose its not as fun.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Have you told her that it's not that everyone hates \\*her\\*, but peope do hate her judgmental comments?  If she was not be liked and included, don't insult people.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Kind of assholish, be straight up with her. When you do what you do it also negatively affects your nieces and of course they think their aunt doesn't like them. Have one final conversation with her, tell her how you're worried her negative attitude will makes thing bad for you and your family (which is reasonable) but tell her it is now causing you to reconsdier family events. Use this event to explain that. And if she doesn\\]'t listen then that's it. Talk to her husband and let him know (since it is known affecting his kids), I think since she constantly apologies, either she has gotten too comfortable with it or she doesn't see why she has to change.\n\nWhat you did was right, but I do feel for the kids and you have ever right to not do stuff that will also include her if it affects you negatively. But I hope she's just one of those people that has those natural nagtauve attitudes. other than  that you cant do anything, I know you said you talked to her many time before but I am just worried about your relationship with your necies and I dont think it can hurt to have one more conversation with her",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Your mistake during that incident was spending the day reassuring her.  One reassurance is enough that you don't hate her. After that you just do not entertain the nonsense because it us up to her to change her ways and up to her to believe you or not.  I would have ignored it all or taken my leave until she pulled herself together. She is an adult who should be able to deal with minor criticism.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": ">I just didn’t want to deal with the additional drama of her crying, telling me I must hate her, then having to spend most of my day trying to reassure her that she’s not a terrible person who everyone hates.\n\nI'm on the fence about whether the lie makes you an asshole, although telling such an obvious one defeats the purpose, but I think you felt cornered because you've set arbitrary limits on your choices. You've already decided if she throws a tantrum then you will spend the rest of the day consoling her. This doesn't have to be true. Look into the grey rock technique. I've found it very helpful in dealing with difficult family members.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "What a garbage take. OP has TRIED to tell her SIL to STFU. OP is not required to put up with an asshole because the asshole’s kids want to get on the boat, WHEN THE KIDS WEREN’T INVITED ON THE BOAT IN THE FIRST PLACE.",
          "id": 36,
          "comments": [
            {
              "score": 0,
              "content": "Where did I say OP has to let them on the boat? OP is well within their rights to say no. But when you tell an obvious lie to children so you can exclude them is an asshole move. These kids were told to ask mom, they did and then OP told an obvious lie about the size of the boat. The kids won’t know that that lie is because their mom is pushy, they just know that their aunt and uncle suddenly don’t want them on their trip. If OP had said they changed their mind, or that they didn’t want extra adult company that would have been fine. \n\nLike I said tho it’s literally just a boat. This is an opinion sub and this situation is hardly high stakes, certainly not worth yelling at strangers about......",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "You should read the edits. Also, why do you think it’s appropriate to have a heart to heart on a rented boat in front of the children?\n\nEdit: OP did not give the children permission. She told them to ask for their mother’s permission.",
          "id": 38,
          "comments": [
            {
              "score": 11,
              "content": "When did I say they should be talking on the boat? They never got on the boat",
              "id": 39,
              "comments": [
                {
                  "score": -5,
                  "content": "Ok, so you want them to have this heart to heart on the dock? Maybe in their parents’ house? What is the game plan here? OP has tried talking to her sister, but she hasn’t listened. Why should OP have to have ANOTHER conversation during their family get together? Also, even if OP did say the kids could come (which they didn’t), that doesn’t mean that the kids are entitled to the boat ride. At the end of the day, it’s OP and their husband’s rental and they can decide who can and can’t board it. To be honest, you kind of sound like someone from an /r/entitledparents story. It’s not set in stone, it wasn’t a contract signing. It’s kids who want to go on a boat.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 9,
                      "content": "1. I posted this comment last night pre-edit and haven’t been online since, and to be honest even though my reasons for my judgment have changed slightly because of new info, I still stand by ESH. \n\n2. A heart to heart is better then telling a lie a two year old could see through. Hell even just saying no we don’t want to spend time with you is better then trying to pretend the boat somehow couldn’t fit her. \n\n3. This sub isn’t about legal obligations. Legally of course they don’t have to share their boat. But sending their nieces to ask for permission does imply that if they get permission they can go on the boat. Mom said yes but with an honesty pretty predictable qualifier, and OP told a lie so flimsy it’s ridiculous.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Idk. Not being okay with uncle and aunt as supervision is extremely out of left field. At that age its really normal to spend a day with relatives sometimes. The \"qualifier\" as you named it, was inappropriate. Op and husband rented the boat. Sil doesn't get to freeload that, while the children obviously don't pay and were invited. If sil said anything like \"I want to be with my daughters so I pay 1/3 of the rental to come\", I would understand the qualifier.",
          "id": 42,
          "comments": [
            {
              "score": 6,
              "content": "If OP and there family weren’t on a family vacation yeah it would be out of left field. But it really isn’t surprising that SIL would want to accompany her children on a boat during family vacation. The whole point of the vacation was to spend time with family, so it really isn’t surprising that she wants to spend time with her kids. \n\nDoes OP owe her a boat ride? No. But if they didn’t want SIL around telling their nieces to ask if they could come was a bad plan. And it probably didn’t just hurt SIL when OP then told an obvious lie so they couldn’t come. OP didn’t just lie to a pushy SIL they lied to their nieces, and children are not completely oblivious to reality, so if the boat was obviously big enough they could possibly tell (depending on their age and a shit ton of other factors.)",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1575,
      "content": "NTA\nConfession time: I was once like your sister-in-law.\nI home schooled my kids, healthy food, brain charging outings, and I spent a lot of time explaining to other people why I thought my parenting choices were... This is where two paths diverge in a wood...\nI thought I was justifying my out of the norm parenting choices.\nPeople heard \"I'm a way better parent than you\" 🧐🧐\nOne of my sisters actually came right out and told me to shut up and quit it! If my parenting choices were so good, then I didn't need to shove stats and studies and everything else in other people's faces to prove it! If I was that insecure, I needed to either get my head on right or send my kids to public school and get over it, but quit looking for affirmation from everyone in the world. 😲😉\n\nSo I got my head on right and doubled down on my choices and quit bugging other people about it. It was a wonderful lesson in humility",
      "id": 44,
      "comments": [
        {
          "score": 300,
          "content": "Your sister sounds amazing, and so do you.",
          "id": 45,
          "comments": [
            {
              "score": 53,
              "content": "Your a peach! 😊",
              "id": 46,
              "comments": [
                {
                  "score": 11,
                  "content": "You're**",
                  "id": 47,
                  "comments": [
                    {
                      "score": 29,
                      "content": "You're absolutely correct 😁😁",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "Your right",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "Thanks for this perspective...It's actually very enlightening.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -43,
          "content": ">I spent a lot of time explaining to other people why I thought my parenting choices were... This is where two paths diverge in a wood... I thought I was justifying my out of the norm parenting choices. \n\nI think you missed a couple words in there. Your sentence trails off and I don't follow what you are saying.",
          "id": 51,
          "comments": [
            {
              "score": 19,
              "content": "Read it as “out-of-the-norm”. It’s a little bit of an awkward way to modify “parenting choices”, but English is a hella awkward language.",
              "id": 52,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -92,
          "content": "I think it’s all bit cultural. Where I come from, feeding your kids healthy food is not frowned upon. But when I go to the UK to my in laws (they’re all overweight) I get a lot of grief for ensuring they eat healthy. The accusations of “you’re not fun” and such are annoying and if I defend myself I am seen as the villain. Some people..",
          "id": 53,
          "comments": [
            {
              "score": 143,
              "content": "That's not a cultural thing, it's a shitty people thing. Good parents know that their kids should eat healthy. If they get on you for enforcing healthy eating habits then they're not good people, no matter the culture.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "I'm from the UK and that's not the attitude here at all. Yes it's the attitude of some people (like your in laws) but please don't say it's a cultural thing based on your experience with your in laws.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 60,
              "content": "That's rather insulting and generalising the topic. I think your in-laws are just shitty people because it is certainly not a cultural thing for feeding your kids healthy food to be frowned upon in the UK.",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "Not all of us in the UK are against healthy eating, so it’s nothing to do with culture. It’s more a people thing, some choose healthy, some choose heart failure 🤷🏻‍♀️",
              "id": 57,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 32,
              "content": "That’s quite rude and judgmental, and just wrong. There isn’t a culture, at least not a current one that I know, that judges you for feeding your kids healthy food. But to judge a whole country based on 2 people seriously? Not wonder they judge you and your parenting. \nThough you will get judged for that holier than thou attitude, that frowns on unhealthy food and acts like your better than everyone else for not feeding your kids junk food.\nAs a healthcare professional I can tell you, that there’s absolutely nothing wrong with feeding your kids unhealthy food occasional. It actually provides them with a better understanding of food and nutrition.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Yeahhh you’re being super rude and generalising based on your experience with one family. I’m in the uk too and very conscious of healthy eating and balanced diet - as are most people I know. No one in my extended family is over weight and we’re a pretty normal family. However there are obviously people who aren’t like that, like your in-laws.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Not it's not really cultural but healthy eating. I'm from South East Asia and my parents don't really care all that much what I feed my kids (western food, food from my country, fast food etc. They just want my kids to eat and grow up healthy.) but have asked me to feed them more vegetables and fruit because my kids just won't have it in their diet.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Lol that sounds like a your family issue. Everyone I know in the UK feeds their kids at least predominantly healthy food. Equally the odd treat is not the end of the world.",
              "id": 61,
              "comments": [
                {
                  "score": 1,
                  "content": "Yes that’s what’s cultural. How odd is the treat? Once a year/day? Is it ok to drink sodas/squash instead of water? Is that considered a treat? And yes, where my husband’s family comes from EVERYONE is overweight. Britain is one of the fattest nation in Europe (fact). I don’t have this problem in Denmark. Also I said my husband’s family, not the whole country.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Imagine trying to claim allowing treats isn’t a thing in Denmark. Utterly utterly delusional stuff.\nAnd btw a quick google brings up a WHO fat file on health in Denmark which says 51% of the adult population is overweight with 18% obese. Now it’s a bit old so maybe you’ve turned a corner with drastic action but you can 100% get off your sanctimonious, judgement, rude high horse. \n\nSource here: https://www.euro.who.int/__data/assets/pdf_file/0006/243294/Denmark-Who-Country-Profile.pdf",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Ohh and where exactly is your husband from in the UK where everyone’s obese. Because that sounds like a massive lie on your part.",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "‘I don’t agree with this whole “your husband needs to show his mum you’re his priority”. I think it’s mean and screams of insecurity and selfishness; he had a mother before he met his husband. And he certainly shouldn’t take her out of a pedestal to put his new love. No one is in no pedestal, you can love your mum and your partner to the moon and back and only mean-spirited people need to knock down other people to gauge their position in someone’s heart. He can set boundaries without assigning position levels to his heart. It is my belief that more often than not, husbands take their wife’s side to placate them and not having to deal with a temper tantrum from them and to keep the peace. And btw I’m not a mil, I don’t have children and I don’t have a relation with my mum.’\n\nThis you from another thread? I thought you didn’t have children?",
              "id": 65,
              "comments": [
                {
                  "score": 1,
                  "content": "Yes..it’s me. I didn’t mention I have kids?",
                  "id": 66,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 599,
      "content": "[deleted]",
      "id": 67,
      "comments": [
        {
          "score": -85,
          "content": "[deleted]",
          "id": 68,
          "comments": [
            {
              "score": 93,
              "content": "I gotta disagree. Being in a family vacation does not entitle you to 100 percent of everyone's time. If I want to branch off and do something solo with my people, I should be able to do so without everyone feeling like they're entitled to my time. \n\nThe hiccup was OP being dishonest, not them wanting some alone time.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "MIL: can’t wait to see everyone!\n\nOP husband: okay renting a boat to be gone all day",
              "id": 70,
              "comments": [
                {
                  "score": 38,
                  "content": "> MIL: can’t wait to see everyone!\n> \n> OP husband: okay renting a boat to be gone all day\n\nThats what its like to have a spine.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 376,
      "content": "NTA \n\nAs a vegan, don’t bring a vegan fishing! I can’t think of a worst set-up for a bad outcome.",
      "id": 72,
      "comments": [
        {
          "score": 73,
          "content": "Yay. Another vegan. I feel like this lady may be insecure about her choices. There’s nothing wrong with sending your infant to day care (I work at a day care), not so great to feed your children unhealthy food but I think mrs prissy pants’s comments make her feel guilty about choices she’s insecure about. She should make choices she is comfortable with; mums are viciously judgemental of each other and if it’s not sil’s comments, it’ll be someone else’s.",
          "id": 73,
          "comments": [
            {
              "score": 150,
              "content": "Not that I think it matters what people feed their own kids, but I do generally feed my kid pretty healthy food. Granted we aren’t vegan, but I do try to do mostly home cooked, balanced meals. He gets fast food/take out occasionally as a treat, I don’t feed him this on a daily or even weekly basis.",
              "id": 74,
              "comments": [
                {
                  "score": 89,
                  "content": "As a general rule I find that anyone who builds their children’s diet around “Instagramability” is probably cutting corners whenever and wherever they’re not being observed.\n\nI’d be entirely unsurprised to find your SIL quietly feeding them various things that are no better than your occasional Chick-Fil-A visits at home.\n\nEven if not, she needs to get over herself. Her parenting seems more designed to feed her ego than to nurture her children.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 60,
                      "content": "My aunt is a health nut. I fed my little cousins a small amount of cheetos before (no allergies or sensitivities) they loved it but she screamed at me. One time one of them grabbed a slice of pound cake and tried to hide it from her and she screamed at her for hiding food. Their doctors said they were very underweight so she stopped taking them. They never had fast food before or soda and they're 12 and 14. She's a helicopter mom to the extreme, never let her kids at sleep overs or friends house or to the mall. Im pretty sure they're depressed, they only seem happy when they get to visit me.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Nobody mentioned Instagram",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": ">, not so great to feed your children unhealthy food\n\nIt's an unhealthy mindset to get hung up on unhealthy *foods*. There are unhealthy lifestyles and unhealthy diets. Individual foods are **literally always** fine if the rest of your diet allows for it. If you're getting all your nutrition and not collecting a massive caloric surplus, then you're not eating poorly. And it's - frankly - *easy* to give your child Chic-Fil-A occasionally while maintaining a healthy diet.",
              "id": 78,
              "comments": [
                {
                  "score": 16,
                  "content": "This is why I  do “work” food and “fun” food with my 4 year old.  I’ve taught him that there’s food you eat that fuels your body and helps you grow. And  then there’s food that’s not so good for helping you grow, but it’s fun to eat! And it’s important to have a balance between the two. And now when he asks for snacks, he prefers to have “work” food so he can can have energy to play.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Exactly this. I downloaded this diet app to help lose my quarantine weight and there’s an emphasis on the idea that there’s no bad foods, only bad habits. It’s ok to eat anything in moderation. Getting fast food on occasion is fine!",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I would argue that some foods are unhealthy in all amounts, like trans fats or if you're allergic to something in particular. I'M LOOKING AT YOU, DAD, PUT DOWN THE FUCKING AVOCADO. Or at least pregame with some benadryl, dammit.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "The more I think about it, the less SIL's insistence on coming makes sense, for precisely that reason. She knows what fishing is, right? Did she plan on explaining to her kids that they couldn't eat anything they caught, or was she planning on sabotaging the entire \"fishing\" part of the expedition from the get-go?",
          "id": 82,
          "comments": [
            {
              "score": 8,
              "content": "I don’t know but I’m very sure whatever her plan was would have been really traumatic to the children. I remember fishing as a little kid long before my vegan days and crying at seeing the fish die. And I came from a house that ate meat and definitely understood the connection between animals, death and food. I can’t imagine the effect it would have had on me if I was completely unprepared to see it, and had my mom calling my cousins murderers or something.",
              "id": 83,
              "comments": [
                {
                  "score": 10,
                  "content": "I had a friend who went vegetarian at 5 or 6. Her class had recently gone to a farm/petting zoo, and then Thanksgiving rolled around. Her mom was getting the bird ready, and my friend asked what she was doing.   \n\n\n\"Putting the turkey in the oven,\" was her mom's answer.   \n\n\nMy friend, proud of her newfound knowledge of farm animals, insisted, \"*That's* not a turkey! A turkey is a *bird*!\"   \n\n\nTo which her mom responded, \"That's right, Sweetie!\"  \n\n\nWith dawning horror, my friend's young mind made the connection between living animals and the meat that graced the family table, and she immediately swore off meat forever.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 228,
      "content": "NTA.  You SIL sounds insufferable, it's completely  understandable that you did not want to be stuck on a boat with her all day.  There was nothing wrong with having the 1 day for just your nuclear family.  As for the nieces asking why you don't like them anymore, I wouldn't be surprised if they were prompted to ask by their mother.\n\nEDIT: typo",
      "id": 85,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 132,
      "content": "NTA\n\nAnd I’m honestly surprised that an 8 and 9 year old (?) would jump to the conclusion that Auntie doesn’t like them anymore? Sounds like when mum had to break the news to them that she might have embellished a bit. \n\nYou might want to find a way to make it up to the kids, a way that doesn’t involve an 8-hour boat ride with mum in tow. I would suggest ice cream or fro-yo but I doubt their mum would go for that.",
      "id": 86,
      "comments": [
        {
          "score": 24,
          "content": "I don't think so. I was the same way as a kid. I was used to being perfect and loved by everyone so any sign of dislike or punishment was really hard for me.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I'm confused on this point too. If you tell a kid there's not enough room on the boat for 6 people or whatever, why would they question that? I would have absolutely taken that answer at face value unless some other adult told me that there was actually room on the boat and that my aunt just didn't want my mom to go so I couldn't go.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah, sounds like their mom has been feeding them negativity and getting them to think Auntie is the bad person.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "It's exactly what their mom does - \"You must hate me\" and all that BS. It's pretty sad the kids are already picking that up.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 80,
      "content": "ESH\n\nYour SIL for her constant comments. She's being a bore. \n\nBut you as well, for two reasons. \n\nFirst, for jumping to the conclusion that every time SIL makes a comment about her parenting style, it 's a dig at you. There's more than one right way to parent. It's not a right/wrong decision. (For example, if my friend constantly extoles her use of cloth diapers, that doesn't mean she thinks less of me for using disposables. It simply means that she's proud of the extra effort she puts in to keep that going and can be a bore about it.) \n\nSecond, for lying about the boat capacity. You could've said a million different things, like \"that doesn't work for us\" or \"that's not what we offered\". That way, *SIL* is the one that is forced to tell the children no. She takes the blame. What you did made you the bad guys.\n\nTBH, I wouldn't have let my children go in your SIL's place either. Two adults with three small children on a boat all day is just not enough supervision. On a boat, you need a designated adult for each child, that will stick to their side like glue. But I wouldn't make anyone else the bad guy. I'd own my decision.",
      "id": 91,
      "comments": [
        {
          "score": 24,
          "content": ">That way, SIL is the one that is forced to tell the children no. She takes the blame. What you did made you the bad guys.\n\n>I wouldn't make anyone else the bad guy. I'd own my decision.\n\nI'm confused by your comment. Are you saying to make sil be the bad guy and tell her kids no or for OP to take the blame but own up on her reasoning? Honestly I'd be reluctant to make waves with a family member I see infrequently without good reason. Also for your first reasoning; it's pretty easy to pick up from tone of voice and nonverbal cues when someone is making a dig at your life style so if it happened more than once and on more than one topic, I doubt OP is reading too hard into it.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Mmmm. If SiL is  saying she's constantly worried about OP's children and that OP's choices are ones that she would never make then it's absolutely a dig.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "> TBH, I wouldn't have let my children go in your SIL's place either. Two adults with three small children on a boat all day is just not enough supervision\n\nDo you wrap your kids up in bubble wrap too?\n\nHonestly that's a bit ridiculous and parents with this sort of view lead to extremely repressed kids who are highly obnoxious due to a lack of socialisation.",
          "id": 94,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 72,
      "content": "NTA but it looks like it’s time for you to be honest and have the “talk” with your SIL. I don’t claim that will go smoothly or well at all. But being honest will clarify everything up. And since your husband’s fam already think you guys are AH’s, you got nothing to lose. You should be able to talk to your sil on some level since you guys used to be best friends. Don’t be passive aggressive be sincere.",
      "id": 95,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 63,
      "content": "NTA. Your perspective is completely valid, and you have every right to not spend 8 hours on a tiny boat with a big bully.\n\nIt is very unfortunate for your nieces to have such a mother, because I had a very similar problem with my cousin. She was my best friend in the family, but her mom and her older sister are both nightmares, which caused her to be excluded from things because my mom knew that her mom would insist that her older sister go with us, and we both hated having her tag along because she has some birth defects that are unclear to me but clearly cause her to act like the younger sister by a lot even though she is the older one. Her mom basically made my cousin the caretaker of her older sister. It sucked for her, but eventually she understood that it wasn't her that no one wanted to be around, it was her family that everyone hated. She didn't have a great childhood, but she also turned out okay because she had emotional support from me, my mom, and her friends. \n\nI think your SIL sounds just as painfully irritating as my aunt and her first daughter, so I think it is perfectly fair to avoid her. Also, as long as you can talk to the kids and don't exclude them ALL the time (which it doesn't sound like you do, it sounds like you hang with them enough), then you are not being an AH. \n\nAlso your in laws sound like my dad's family. its not just my aunt and her elder daughter. Its also my grandpa, my dad (my parents are divorced), my grandma a little, and all my aunt's friends. Be careful, bullies hang out with and associate with other bullies so it wouldn't be surprising if most of your in laws wont ever understand your perspective. My cousin was the exception in her family, your husband may have been the exception in his family.",
      "id": 96,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 57,
      "content": "Honestly speaking YTA. Don’t go on a vacation with people you don’t wanna spend time with if youre going to oh so obviously exclude them. \n\n\nYour SIL is cuckoo and an AH but not in this story, and well many parents would want to be there if their kids are in a situation that could turn dangerous, like if they’re on a boat surrounded by water.",
      "id": 97,
      "comments": [],
      "relation": "Attack"
    }
  ]
}