{
  "post content": "I (26M) had to move back in with my mom (55) and step dad (55) due to a variety or reasons. Whilst I appreciate the support theyve given me Ive had so many other things happen that just seem to make it worse.\n\nLast Nov. I basically had a seizure and my work took me entirely off the  schedule so ive been without a job in the diagnostic process to figure out whats wrong with me including also soon to be seeing a psychiartrist.  This has compounded the issues since the economy sucks and I cant seem to find a job to replace the one i lost. That and im suppposed to do chores as \"my rent\" to which i do and dont complain about it since its fairly easy.\n\nI sometimes have some issues remembering to do tasks or forget i was supposed to do something. To which my step dad seems to love calling me a lazy piece of shit. This kind of stuff has been building up over years since I was 11. Over and over again getting berated and told im just like my useless birth dad who went to prison. \n\nI am trying to find work, i am trying to stay on top of chores to balance this out with the stress of dealing with my medical BS. Tonight it was like a bottle exploded and I just lost it on my mom tellimg her that I dont care if my step dad gets hit by a truck, that i see him as a manipulatice abusive asshole. \n\nShe keeps trying to reassure me that hes helping me but I just dont see it. She told me he is trying to treat me like he did for his kids when they were younger, i told her that she actually taught me to love her and he taught his kids to fear him.\n\nI dont want to live here anymore, but i am stuck and each day the tension between my step dad and I keep getting worse. Ive lost all respect ive ever had for him after his comments tonight. He never says anything positive only trash talks me and tells me how useless I am. \n\n Theres so much context i cant quite put in due to restrictions but im more than willing to add information if asked. ",
  "id": 1,
  "comments": [
    {
      "score": 54,
      "content": "ESH. Just do the fucking chores. Your stepfather is an asshole, obviouisly, but you are 26 living at home and not doing your chores without being asked, so some of that is understandable.",
      "id": 2,
      "comments": [
        {
          "score": 28,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 13,
              "content": "There is also a lot of reasons why op might not be able to do the chores. Could be that he genuinely forgot",
              "id": 4,
              "comments": [
                {
                  "score": 8,
                  "content": "If op is having seizures this could be a reason for their forgetfulness. I hope can get this sorted out soon. It seems like they should’ve done a brain scan by now, of course if is in the US without insurance they may be screwed.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 6,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -7,
              "content": "[deleted]",
              "id": 7,
              "comments": [
                {
                  "score": 11,
                  "content": "He does.  Why are you pretending otherwise?  Because then you have nothing to be mad about?",
                  "id": 8,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I can read just fine, no one deserves to be berated and verbally abused. ",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "My boyfriend recently started having seizures and one of his biggest problems is getting brain fog \n\nOP needs support not abuse ",
          "id": 10,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -16,
          "content": "I do the chores, sometimes its just like something gives me a reminder, he never directly actually asks me to do something unless its not something I usually do. My issue isnt that, its just the constant berating, calling me useless etc no matter what I seem to be doing. Im just sadly stuck here due to circumstances, if i had a viable option elsewhere id be moving out",
          "id": 11,
          "comments": [
            {
              "score": 33,
              "content": "[deleted]",
              "id": 12,
              "comments": [
                {
                  "score": 5,
                  "content": "Getting better about using my phone calender, just havent quite fully built up the habit 100% for certain things, just like bigger stuff like doctors appointments or events.",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Perhaps you could try coming and going at times where you won't cross paths with him. That's what I did when I lived with a stepfather who acted literally the same way.",
              "id": 14,
              "comments": [
                {
                  "score": 13,
                  "content": "I do try and do that, its just not the easiest thing to do without money or an excuse to not be here. I often hide myself in my room like an angsty teenager not wanting to deal with the world.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 7,
                      "content": "You're going to have to figure out a way to change the dynamic with him.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 24,
      "content": "INFO: Have you made a list of all of your chores so that you don't forget them perhaps posting them on your bedroom wall within eyesight?\n\n\nWhenever your evil stepdad makes a negative remark, just reply \"Whatever.\"",
      "id": 17,
      "comments": [
        {
          "score": 9,
          "content": "I do have a list, mostly mental right, but some of its like trash, feed animals, vaccum. Besides feeding dogs its not really on a regular basis, mostly just like when i notice things. Like today for instance i took out the trash in the house after noticing one of the trashcans was getting pretty full, it being in their room so i dont really interact with it so i dont think about it actively. Since this was after he got home from work its what lead to him calling me lazy in this particular instance. \n\nAs for the whatever id rather not start a fight. Ive made comments and retorts before but it usually ends up in a yelling match and him threatening to kick me out of the house saying i have an attitude. I cant defend myself against him without it cause more problems",
          "id": 18,
          "comments": [
            {
              "score": 32,
              "content": "You need a system. Write it down on a calendar- do it in rotation. Check things off. Stay away from him. NTA for being upset about his abuse, but you need to protect yourself by documenting what you’re doing.",
              "id": 19,
              "comments": [
                {
                  "score": 5,
                  "content": "Working on finding a system that works, ive never been the most orgamized person, so I often lose track of physical things. Ive been using my phone calender more often and thats helped with other tasks for sure. Some of the stuff is just do it as i notice it, like trash or recycling. Feeding the animals is easy as I do that right after I wake up for breakfast then the dogs right as we make dinner. Some stuff is kinda \"out of sight out of mind\" and thats usually where I struggle more frequently. Its a fairly small house so its hard to stay away. I usually just end up chilling in my room trying to either clean it or work on stuff on my computer if i can.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Don't overthink things.  It's self-defeating.\n\n\nInstead, just grab a blank piece of paper and tape it to your wall near your light switch near your door.\n\n\nJust brainstorm.  Write down all the things you need to do.  No order.  Just as you think of things.  Chores for the house, yourself and so on.  Other items such as looking for work.  Everything goes on the list.\n\n\nAs you remember new things as time passes, add them to the list.\n\n\nEventually, you will have a long list.  Rewrite it all by hand if necessary, organizing things by daily tasks, weekly tasks and so on.  Make the list a single column.\n\n\nTape that on the wall, on top of the earlier page.  Take a photo of it, for safekeeping.\n\n\nNow constantly look at the list, and do what's listed.  **Each time you complete something, write date/time next to it on the list**.  If you think of a new task, write it in at the bottom.\n\n\nEach week, rewrite the list.\n\n\nIf you do this, you will never have to worry about remembering any of these details again.  You can be sure of yourself, and remove this particular source of anxiety from your life.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "He's not right for talking to you that way, but take a few minutes to write this all down on paper so you don't forget anymore. You're only \"trying\" if you actually make an effort to succeed.",
              "id": 22,
              "comments": [
                {
                  "score": 2,
                  "content": "No i do understand that, I am doing the chores, its just doesnt always happen before he gets home and that makes him mad for whatever reason and that leads to the degradation. Im working on getting better at remembering things, im going to seek therapy and a psychologist to help figure things out",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Understood.",
              "id": 24,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 18,
      "content": "NTA - but I hope you don't mind a bit of advice if you are in the US.  See an employment attorney.  Right now.  You may have an ADA claim and at the very least you should be getting disability.  I wish you well with your future (but protect yourself here!).",
      "id": 25,
      "comments": [
        {
          "score": 5,
          "content": "Im doing what I can, and I am US based. Cant really afford an attorney and others Ive talked doubt id have a successful case so i would just be wasting time and money.",
          "id": 26,
          "comments": [
            {
              "score": 3,
              "content": "Report them to the board of labor with evidence. You don't need an attorney or to spend money",
              "id": 27,
              "comments": [
                {
                  "score": 2,
                  "content": "Ill look and see what i can do to that end, i just dont know if i have enough or access to what i need",
                  "id": 28,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You have medical records of the seizure and can show that you were then removed from the schedule. Time frame will be proof enough and your job will be burdened with disproving the connection. \n\nBoard of labor deals with these things all the time.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Easy, clear NTA.  It would be impossible to have any respect for someone who treats you like that. \n\nUnfortunately, some people think that if you live in someone’s house, they have complete dominion over you.\n\n> She keeps trying to reassure me that hes helping me\n\nShe’s lying.",
      "id": 30,
      "comments": [
        {
          "score": 4,
          "content": "I wouldnt call my mom a.lier in this instance per se, however if he doesnt tell me directly ill never know. I dont like the dominian aspect at all and its been a sticking pount ever since he moved in with our family, weve always butted heads to varying levels",
          "id": 31,
          "comments": [
            {
              "score": 1,
              "content": "> however if he doesnt tell me directly ill never know\n\nWhat do you mean by this?",
              "id": 32,
              "comments": [
                {
                  "score": 3,
                  "content": "Like i cant read his mind, i dont know if hes actually saying anything positive about me unless he directly.tells it to me. I cant just go off third party talking when all he does is berate me to my face",
                  "id": 33,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It doesn’t matter if he’s saying anything positive about you.  He chooses to say hateful things, and therefore you’re firmly NTA.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "OP, may I ask some questions? \nHave you had a CT or an MRI?\nAre you taking an anti seizure medication? \nWhat type of seizure was it- grand mal, focal point? \nDo you have a treatment plan, a neurologist? (Trust me, I was at so many multi hour appointments with my son up until surgery. I know it’s a lot. I am curious where you are in getting information about the cause.\n\nMy son (16) had sudden seizures and after a CT we learned he had a huge cyst plus a tumor pushing on his skull. The anti-seizure meds cause him to rage. (“Kepprage”). It’s hard to have my son suddenly scream at me during brunch, get incredibly anxious or seem ambivalent. I have silently cried a lot. He was even fired from his job for fighting with another bus boy. \n\n I get it. My kid can’t continue drivers ed, He can’t ski or lift anything heavy. He had a craniotomy to have his tumor removed a couple weeks ago in the hopes it would stop the seizures. He is still on Keppra but he gets the tingling on his left side.",
      "id": 35,
      "comments": [
        {
          "score": 4,
          "content": "Ive had both tests done but they were in conclusive, im on meds as well. I hadnt even thought about it as a side effect, but I also cant use that as reason for this blowout since this isnt the first nor likely last time ill get this frustrated at my step dad. I have an appointment getting scheduled with a neuropsychologist and am trying to get back into therapy. Im not actually diagnosed with anything and have a feeling I should be but its gone untreated. \n\nOn the siezure itself im honestly not sure what type it was. I fell over off the toilet and my mom found me face first in a metal airvent. It last at least 10 minutes. I was still breathing normally almost like i was snoring. Mom tried to wake me up but couldnt, somehow i was moving and ended up walking staring at her like a posessed kid im a horror moving. I dont remember any of this except next thing i knew i was sitting in a chair screaming like i just woke up from a nightmare staring at my mom then felt like I was hungover for the rest of the day and even into the next day\n\nA different story from when I was around 16 was us moving in a new water heater into our old house and he just kept yelling at me for not doing it correctly. Some details are fuzzy but I do remember some repeats of saying im useless. I got so mad that I picked the end of the water heater over my head and slammed it into tge ground before going off for a walk for i dont know how many hours and ended up just staring over a bridge wondering if i should jump or not. So this is a build up or the same BS since I was 11, with constant degradation, often over small things to larger issues.",
          "id": 36,
          "comments": [
            {
              "score": 2,
              "content": "The CT and MRI didn’t show anything? That’s a bummer. You could have a complex MRI where they ask questions during (what’s the opposite of this? Rhyme this word) to map out the areas of your brain that are having issues. My son got very anxious during it because who really wants to do that for hours even with breaks?\nI am not a Physician, it sounds like a focal point seizure. I have sadly witnessed three relatives  have seizures. A full grand Mal where there was loss of bowel control and 10 minutes where they moaned and were unresponsive. My son drools and goes “out”. I have also sat with him to help him through the feeling when he “may have one.” \n\nYou gotta ignore step dad. Do not think about past incidents and just get your body well. I am a step mom of ten years to four kids and my idea of parenting is nurturing. Your stepdad parents how he thinks is right, even if he is unkind. Push through and get the care you need. Get out as fast as you can. Do the chores. Your mom gave you a place to land. Unfortunately stepdad won’t have a come to Jesus moment.\n\nEdited to ask: do you feel like your anti seizure meds affect your reaction to people?",
              "id": 37,
              "comments": [
                {
                  "score": 2,
                  "content": "Im honestly not sure if they affect my reactions or not though i do  know i have less intense headaches when I remember to take them. I was also very fidgety dyring my MRI so idk if i screwed up the results. \n\nWorking on getting out of my living situation, just wish it were easier and I had other viable options lined up, but i really dont.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA he doesn't get to treat you like dog shit bc you didn't do the chores to his liking I don't give a fuck who's house you're living in\n\n\nIf he has a problem he can ask you to leave. He can't berate and verbally abuse you. ",
      "id": 39,
      "comments": [
        {
          "score": 2,
          "content": "Im thankfully working on leaving just dont have the means to do so currently",
          "id": 40,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26M) had to move back in with my mom (55) and step dad (55) due to a variety or reasons. Whilst I appreciate the support theyve given me Ive had so many other things happen that just seem to make it worse.\n\nLast Nov. I basically had a seizure and my work took me entirely off the  schedule so ive been without a job in the diagnostic process to figure out whats wrong with me including also soon to be seeing a psychiartrist.  This has compounded the issues since the economy sucks and I cant seem to find a job to replace the one i lost. That and im suppposed to do chores as \"my rent\" to which i do and dont complain about it since its fairly easy.\n\nI sometimes have some issues remembering to do tasks or forget i was supposed to do something. To which my step dad seems to love calling me a lazy piece of shit. This kind of stuff has been building up over years since I was 11. Over and over again getting berated and told im just like my useless birth dad who went to prison. \n\nI am trying to find work, i am trying to stay on top of chores to balance this out with the stress of dealing with my medical BS. Tonight it was like a bottle exploded and I just lost it on my mom tellimg her that I dont care if my step dad gets hit by a truck, that i see him as a manipulatice abusive asshole. \n\nShe keeps trying to reassure me that hes helping me but I just dont see it. She told me he is trying to treat me like he did for his kids when they were younger, i told her that she actually taught me to love her and he taught his kids to fear him.\n\nI dont want to live here anymore, but i am stuck and each day the tension between my step dad and I keep getting worse. Ive lost all respect ive ever had for him after his comments tonight. He never says anything positive only trash talks me and tells me how useless I am. \n\n Theres so much context i cant quite put in due to restrictions but im more than willing to add information if asked. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 41,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "ESH he shouldn’t be such an ass, but you are a grown ass man living in THEIR house so like; yeah do your chores LMFAO “forgetting” is a kind of pathetic excuse because again; you’re a grown man. Take some responsibility. This whole story just screams insufferable",
      "id": 42,
      "comments": [
        {
          "score": 7,
          "content": "There may be underlying issues and im seeking doctors to try and figure it out since its so common of an issue. Some days I remember without any issue other times something hits me like an \"oh yea I need to do that\" and I do it in that moment. And trust me i get the insufferable end of it 😅 trying to do what I can to get out of it and fix my own issues if theyre fixable",
          "id": 43,
          "comments": [
            {
              "score": 8,
              "content": "Yeah, I was going to say that if these memory issues are new and not typical for you, you definitely want to let your doctors know. There are a number of conditions that could cause both seizures and memory problems, so that can be very valuable info. \n\nIf it's just normal for you to kind of forget things like everyday chores though (which is super common and not a character flaw), then something as simple as a list could make things a whole lot easier for you. If writing it on paper doesn't work, there are a billion apps for this kind of thing. Yes it can be tedious, but it might get him off your back and reduce some of the stress you're dealing with.",
              "id": 44,
              "comments": [
                {
                  "score": 5,
                  "content": "Im just trying to figure out what works best for me. Ive had weird memory issues with tasks since I was a kid but can remember really dumb facts about stuff or certain memories i shared with people that somehow im the only one who seems to remember fairly vividly. Im trying to get better on doing the chores more consistently but sometimes i just dont notice when things out of sight need to get done until im staring right at it",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "> “forgetting” is a kind of pathetic excuse because again; you’re a grown man\n\nCould you please explain this part?  Why would his age make forgetting a task pathetic?",
          "id": 46,
          "comments": [
            {
              "score": -1,
              "content": "he moved back in w mom & stepdad, pays no rent, and is only expected to pick up a bit to keep from being homeless. to me it is kinda pathetic that this seems to be a big struggle at his big age lol",
              "id": 47,
              "comments": [
                {
                  "score": 0,
                  "content": "Back to my question please",
                  "id": 48,
                  "comments": [
                    {
                      "score": 1,
                      "content": "whole point is it’s pathetic he needs to be reminded to do the minuscule amount of things he needs to do to keep a roof over his head. A teenager I would maybe get, but this guy is jobless & pushing 30 so it’s not like he’s super caught up w other things. Not getting where I’m being confusing for you.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NTA.",
      "id": 50,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "ESH. Notepad and pen to write down tasks to do.",
      "id": 51,
      "comments": [
        {
          "score": 4,
          "content": "Working on a system that works for me, havent 100% figured it out quite yet for normal day to day chores other than do it when I see it needs to get done",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}