{
  "post content": "First, I have absolutely nothing against Korea. It's a wonderful country with a lot of great people. I have grown up in a rural area in the U.S. all my life with my (American) family, who adopted me when I was four months old. I consider them my true family, though I wouldn't mind meeting my biological family someday. Anyways, in my area there are no people of Asian or Korean heritage, which makes me feel out of place at times. I have taken to thinking of myself as American now, because this country is my home and it helps me feel like I belong. My father, however, likes to remind me that I'm actually Korean, not out of any attempt to make me feel alienated but because he wants me to be proud of my heritage and where I come from. I get that, but it still bothers me because it makes me feel somehow different and weird compared to everyone else around me. I have told him that I'd prefer he not mention it, but he still does it and doesn't see why it bothers me so much.\n\nI guess I'm wondering if maybe he's right and I'm being too petty about this. I want to feel that I actually belong somewhere and not feel like the weird one all the time, but maybe an outside opinion will help me put this issue in the proper perspective.\n\nP.S. I have absolutely no information or contact about my biological family, so unfortunately I can't connect to them and feel like a part of their family. I also have done some reading about Korea and I do know there is absolutely nothing wrong with being Korean, but like I said, I feel like the odd one because of it.\n\nEdit: I will try sitting down with my father and explaining my reasons, as you all have suggested. Thank you for the advise and support here. Perhaps he'll understand more with an actual conversation in contrast to just my telling him I don't like it.\n\nUpdate: I sat down with my father yesterday and talked to him about him referencing my being born in Korea so much. He explained that while he and my adoptive family were living in Korea they got to know many Koreans (they were there for several years before moving to the U.S. when I was around one), and they became good friends with several of them. And that Korea is a very fine country and that there's absolutely nothing wrong with being proud of where I come from. I do understand all of that, but still am not comfortable being reminded of it, so I told him I'd rather it not be mentioned. He agreed and apologized for not heeding my previous requests. So I believe I was able to resolve this situation in a way that satisfies both of us.\n\nAlso, I do appreciate everyone not seeing my father as an A-hole. Like I said, he's not trying to alienate me or be mean in any way, he just wants me to know that there's nothing to be ashamed of in regards to my heritage.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I feel like I might be the asshole for being upset whenever I'm reminded about my heritage, and for wanting to just be an American now.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH. You're not being petty. You're not Korean; you're American. If you've expressed your feelings about it, he should respect them. It's as simple as that.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH. as a fellow korean american, first generation, it's a little hard to feel a cultrual connection when you grow up in a very non-asian area. however instead of focusing on just being korean, focus on being *Korean-American*. there is a culture here if you look for it. although i never been to korea, speak korean, you can still make a connection. go to a local asian store, seek out asian celebrations (at the library or local areas)",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA: Have you tried talking to your dad and explaining the reason why you don't want it brought up? I understand how you feel it's very difficult when people make you feel like an outsider or less than others because of your heritage.\n\nI think you should be proud even though it's difficult right now.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH. Pretty sure this is something everybody goes through- especially first generation American folks.  \n\nThe way I've seen a LOT of people react is- you're likely gonna find your sweet spot (as a person) in the next few years. Once you're more confident and comfortable with yourself, you'll start exploring other aspects of your personality/heritage. Atleast that's the way it's been for a lot of the folks I've seen. \nEither way, NAH. Good luck!",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst, I have absolutely nothing against Korea. It's a wonderful country with a lot of great people. I have grown up in a rural area in the U.S. all my life with my (American) family, who adopted me when I was four months old. I consider them my true family, though I wouldn't mind meeting my biological family someday. Anyways, in my area there are no people of Asian or Korean heritage, which makes me feel out of place at times. I have taken to thinking of myself as American now, because this country is my home and it helps me feel like I belong. My father, however, likes to remind me that I'm actually Korean, not out of any attempt to make me feel alienated but because he wants me to be proud of my heritage and where I come from. I get that, but it still bothers me because it makes me feel somehow different and weird compared to everyone else around me. I have told him that I'd prefer he not mention it, but he still does it and doesn't see why it bothers me so much.\n\nI guess I'm wondering if maybe he's right and I'm being too petty about this. I want to feel that I actually belong somewhere and not feel like the weird one all the time, but maybe an outside opinion will help me put this issue in the proper perspective.\n\nP.S. I have absolutely no information or contact about my biological family, so unfortunately I can't connect to them and feel like a part of their family. I also have done some reading about Korea and I do know there is absolutely nothing wrong with being Korean, but like I said, I feel like the odd one because of it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "I just want to thank you all so much for the responses and upvotes. I never expected so much support and wonderful advice and shared experiences. I will add an update post to this in a few days once I've had my conversation with my father, but I did want to say that I had some exposure to my Korean heritage growing up; my parents would make a delicious Korean meal for my birthday and take me to the nearest Korean restaurant for meals on occasion, which is an hour away from us. I am more at ease with how I feel, and I appreciate the assurance that my feelings aren't petty. Once again, thank you!",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH\n\nWhat your dad is doing is frequently recommended to people who adopt internationally/transracially (I read a variety of things which is why I know). He may be a little ham handed in how he handles it, but it is considered best practices FYI.\nYou are also not the AH for feeling othered by this and not wanting those reminders. Probably the best thing to do would be tell your dad that while you know it's not his intent, the impact does not help you feel close to your biological heritage just as an outsider in your family and you'd prefer he stop for now. Maybe say if you ever feel differently you'd like his help in reading up on Korea and the culture.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH. You may change your mind as you age (I, a fellow adoptee, definitely did) or you may not. Either decision is fine and neither would make you an AH. It’s your life and if you’re more comfortable considering American as your culture, that’s what you will consider your culture. \n\nI also don’t think your father is an AH, from what was written. I can’t speak for your father but maybe he just wants the door to stay open for you to be curious about Korea if you want to be; either now or later. He may want you to know that he doesn’t want to further alienate you from where you came from, but you can gently just remind him that right now, you’re happy with where you are, which I think is what your update/edit says. I hope all ends well 😊",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. You're American. Of Korean decent. End of story. Your Dad is doing what he thinks you might need. It a \"Never forget where you come from\" thing. But if you have no memories of Korea then why bother?\n\nI would suggest watching the comedian Henry Cho. Great take on being Korean in the US.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}