{
  "post content": "I broke up with my ex 2 years ago when I caught her sucking my uncle's dick which was apparently my fault somehow. Fuck her and fuck my uncle, he's been disowned by the rest of the family.  I rarely use Facebook so i didn't notice or really care I was still friends with her on it and i guess she was the same.\n\nI decided to check it because someone told me they posted some cool pics of a place they recently went to so I checked it out and i saw of my ex's photos on my feed. After our break up my ex went into a depression and started binge eating and became severely obese, you wouldn't recognize the two as the same person. She apparently had gained around 170 pounds and now weighs 320 or so and is only 5'6.\n\nShe made a bunch of posts with unflattering pictures of Trump and pictures of Trump eating fast food and other stuff where she went off about how he's a disgusting fat pig and a slob and a bunch of other ways to basically describe that he's fat. This stuff was basically the pot calling the kettle African American so I responded back with on one of the posts \"those who live in glass houses should not throw stones, yes Trump isn't the healthiest but your obesity problem is far greater than his, don't make fun of other people's bodies when you lead way unhealthier life styles. Your BMI is undoubtedly bigger, sure you may not like Trump, i don't agree with everything he does either, but criticize his actions and policies, not call him fat, that's rude and distasteful\"\n\nShe immediately blocked me and made another post about how her evil ex broke up with her over a silly mistake and is now fat shaming her and i ruined her life just basically trying to get sympathy for herself. Her friends texted me saying I'm an asshole for fatshaming her and i shouldn't bring up such a sensitive topic.\n\nEDIT: I'm black and that joke wasn't racist, its funny af maybe you guys don't like my humor idk. Im over my ex, i don't give a shit about her, just thought that post was ridiculous, i made that comment and went about my day not thinking anything about it until the drama happened",
  "id": 1,
  "comments": [
    {
      "score": 38,
      "content": "Oh god. ESH, her for cheating on you and you for harassing your ex out of nowhere. Block her and move on from this petty shit.",
      "id": 2,
      "comments": [
        {
          "score": -37,
          "content": "Responding to a public post she made isn't harassing her anymore than she is harassing Donald Trump. This wasn't out of nowhere either, bullshit hypocrisy like that needs to be called out and yeah it was a bit funny too.",
          "id": 3,
          "comments": [
            {
              "score": 22,
              "content": "Who cares? Public figures like the president has to accept the fact they are going to be trashed from time to time. \n\nStop acting like anything she said directly effects you in any capacity.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "She isn't harassing trump. Was she saying those things directly to him? No. But you sought her out and forced your way in to speak to someone you don't need to speak to anymore. Get over it.",
              "id": 5,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Why can't you just think these thing in your own mind? Posting them is only going to cause drama and you know that",
              "id": 6,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 27,
      "content": "[removed]",
      "id": 7,
      "comments": [
        {
          "score": -13,
          "content": "why?",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 26,
      "content": "YTA So you corrected her for being rude and distasteful towards Trump (something you have no personal stake in by the way) by being rude and distasteful. If you wanted her out of your life, you shouldn’t have responded to her at all. You’re just being an ass.",
      "id": 9,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 22,
      "content": "ESH and I mean everyone. You, your uncle, your ex, Trump, everyone.",
      "id": 10,
      "comments": [
        {
          "score": -15,
          "content": "does my girlfriend, and the African American pot and kettle suck to?",
          "id": 11,
          "comments": [
            {
              "score": 5,
              "content": "Yes.",
              "id": 12,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "YTA - She cheated 2 years ago and your acting like you have the right to punish her forever. \n\n\n>This stuff was basically the pot calling the kettle African American \n\n\nAnd this makes me think your fatshaming and love of Trump does not exclude his racism and sexism.",
      "id": 13,
      "comments": [
        {
          "score": -7,
          "content": "I'm black, i thought that joke was funny but i guess not everyone enjoys my humor. No I'm not punishing her, i randomly saw this post and thought the hypocrisy should be called out. I don't even like Trump, i think he's meh but i prefer him over the democrat options, not that this is even relevant.",
          "id": 14,
          "comments": [
            {
              "score": 11,
              "content": "No, pointing out the hypocrisy would be just to say it was inappropriate to insult someone’s weight. You insulted and punished her by making comments about her body in a public forum. You’re the hypocrite.",
              "id": 15,
              "comments": [
                {
                  "score": -2,
                  "content": "how does this make me a hypocrite? that makes no sense. I can't point out the hypocrisy if i don't mention she's bigger than trump, if i did what you said it wouldn't be pointing out hypocrisy, just saying what she said was mean.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Insulting someone for their weight while telling them not to insult people for their weight. You can’t see it can you?",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15,
      "content": ">This stuff was basically the pot calling the kettle African American\n\nReally, dude? This is just not funny or clever in the least bit. Also, I doubt your ex gained 170 lbs in 2 years or cheated with your uncle. You need professional help to get over the fact ***she simply dumped you for another dude. Life goes on.*** \n\nStay off of her social media pages and TRY to get a life of your own that doesn't include making shit up on Reddit. YTA",
      "id": 18,
      "comments": [
        {
          "score": -7,
          "content": ">This stuff was basically the pot calling the kettle African American\n\ni already explained that this joke isn't offensive and I'm black so no I'm not racist. Yes everything i said is true, she gained weight, cheated on me with my uncle and no she didn't dump me. She tried getting back with me several times and blames all of her problems on me. I have a new girlfriend who's not crazy and doesn't fuck my family members or other dudes.",
          "id": 19,
          "comments": [
            {
              "score": 12,
              "content": "Sure Jan...\n\nYou're so happy in your new life but still find time to hit your exes FB page. And also make a WHOLE long ass reddit post about the ex. Uh huh. Makes sense. I hope you get the help you need.",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "YTA. Also frick trump.",
      "id": 21,
      "comments": [
        {
          "score": -2,
          "content": "sure i guess, I'm not the biggest fan of his either.",
          "id": 22,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": ">the pot calling the kettle African American \n\nYou're not funny, this is a shit thing to say.",
      "id": 23,
      "comments": [
        {
          "score": -4,
          "content": "I'm black myself, i don't understand why people are so offended by this, that's fucking hilarious. I've never heard anyone ever get offended by me saying that joke",
          "id": 24,
          "comments": [
            {
              "score": 5,
              "content": "Maybe you're used to saying it in front of other African Americans. If a non-black person said this to a black person it would result in some definite negative criticism.",
              "id": 25,
              "comments": [
                {
                  "score": 0,
                  "content": "[removed]",
                  "id": 26,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -2,
                  "content": "that's not true, us black Americans don't get easily triggered and w'ere not sensitive crybabies. A white guy actually said this joke to me and my sister and we thought it was fucking hilarious",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "yta for the last part. it was over and you shouldn’t have tried to mess with her after so long",
      "id": 29,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH",
      "id": 30,
      "comments": [],
      "relation": "No"
    }
  ]
}