{
  "post content": "I'm not looking for relationship advice, I literally can't tell what's normal reactions due to a stunted emotional upbringing from my fam. \n\nSo the husband doesn't like going places by himself, wants me to come along. Normally I drive and he often makes small comments that I've learned to ignore. Today he drove. He was grumpy the whole time. I had a headache, so I'm sure I wasn't a peach either. \n\nHe decided against turning the one way because there where other cars there. So I said,\"oh you aren't going that way, ok.\" He decides to pull into a stores parking lot to drive to a road he wanted, even though there was a turn further up. I commented on that, because I honestly didn't fucking know if he knew that it was there. He says he didn't want to take it, he couldn't see up there. I hate cutting thru parking lots. We get home and I hear a loud crunch of my wheel run hitting the curb so I say, \"well that's nice\" and he freaks the fuck out. He slams my gear shift so hard it breaks the top. He proceeds to rip a broken light off the door on his way in telling me that I don't need to go with him if I'm going to be a bitch the whole time. That I don't need to ignore him for 12 hours (I have no idea what he's talking about today-i did work 14 hours yesterday) and then only interact with him by being a bitch .\n\nI told him I didn't want to go to fucking errands. He's the one who wants me to go fucking with him. Do we both suck? Or am I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 30,
      "content": "ESH. Both of you need counseling.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "No arguments there and I appreciate your input",
          "id": 3,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Wait, he needs counseling for his anger, why does op need counseling?",
          "id": 4,
          "comments": [
            {
              "score": 14,
              "content": "Because neither of them are communicating effectively.",
              "id": 5,
              "comments": [
                {
                  "score": 4,
                  "content": "So, couples counseling or individualized counseling?",
                  "id": 6,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Both.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I actually have had counseling due to PTSD (patient hung themselves on my birthday, shitty childhood, etc) and some other things but I still have issues with communication in general, tbh",
              "id": 8,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "It sounds like they both make nagging comments and criticize each other when they drive (and very likely in many other areas too). There's more than one way to drive to a place, and there's absolutely no need to provide commentary on every turn they make. What does it matter, so long as you get there? They definitely *both* need counseling.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "ESH.\n\nSeems like he has some serious anger issues, and that definitely makes him an asshole, but your \"peanut gallery\" comments while sitting in the car don't help anything either.  If it helps any, I would say he's the *bigger* asshole, but that doesn't mean you shouldn't looking in the mirror for betterment yourself.\n\nAppears you both have some communication issues to work on, though you said you weren't looking for relationship advice, so not sure what to tell you.",
      "id": 10,
      "comments": [
        {
          "score": 3,
          "content": "Yes we do, but as stated, I have trouble knowing what's \"normal\" with my own reactions and have difficulty with my tone. I may think I'm being nice, others think I'm being sarcastic etc. So I just wanted an outside perspective, and I thank you. \n\nAnd yes, he does have anger management issues, which we know.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "NTA, your husband essentially damaged your car further because he can't handle life stresses? He's clearly the asshole here.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "ESH\n\nNo one like a back seat driver.  If you don't want to go, don't go. But his reaction seems a bit extreme.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH Either you are being too lenient with your side of the story (about your own actions) or he has some anger management issues. If it's simply the latter, then NTA.",
      "id": 14,
      "comments": [
        {
          "score": 2,
          "content": "He does have anger management issues, once he calmed down he admitted he's been upset over an incident that happened with the car yesterday (some dick heads ransacked the car the one time we left it unlocked and threw every thing on the car floor and stole some two dollar bills that were my dead dad's that I had foolishly left in the glove box)",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA. It sounds like your husband has anger issues. If this behavior isn't uncommon, I might consider some marriage therapy to address any issues before they grow.",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "It happens about once a year it so. He blows up, I blow up, we calm down about an hour later.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "INFO\n\nWhat lead up to this?  Did anything happen before? I’m confused.  How did it escalate?",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": "Now that we've both calmed down, he's admitted that he's still pissed at our car being ransacked yesterday (some assholes went thru everything and threw it on the car floor I guess looking for money? They stole some two dollar bills that were my dead father's that I had in the glove box) and that he's not sure why he snapped.",
          "id": 19,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH. You both sound like the worst backseat drivers. And he seems to have anger management issues.",
      "id": 20,
      "comments": [
        {
          "score": 1,
          "content": "Yeah, he'll grip the oh shit bar when I'm making turns and talk about how I'm not applying physics to my turns, etc.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "ESH",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "ESH - it seems there’s a lot more going on than this one incident. It seems you both tend to get angry and make remarks over trivial things which isn’t the best sign for your relationship.",
      "id": 23,
      "comments": [],
      "relation": "No"
    }
  ]
}