{
  "post content": "I work at a top European consulting firm that is known for working people hard and serving its clients well. On one project last year, my team members were being required to do a significant amount of work out of their job scope for several months. They were upset and overworked, so I raised the issue to my immediate bosses several times. They replaced me with someone else because they were tired of me complaining about the situation of my team members. \n\nI started wondering if consulting was right for me. I wondered if consulting itself, or maybe just my company, prioritized serving the client at the expense of a certain degree of team fairness/well-being. \n\nSo, after I was removed from the project, I spoke to one of the company leaders, who I had worked with before and had a pretty good relationship with. Here was the exchange I'm wondering if I was the ass hole for:\n\n**Me:** \"I accept my part in what happened and will continue to learn how to best navigate setting boundaries for my team. That said, I think the priorities shown by my immediate superiors prioritized client over our team. That's different from my personal values and priorities. I'm not saying one value/priority is better than the other, but mine is with the team first. In your experience, is that specific to my team, or common in consulting in general and/or this company? I guess I ask because I didn't hear from anyone from the company any acknowledgment of what I was trying to do to protect the team, even if I didn't do it in a way that was liked/effective.\"\n\n**Her:** (getting upset)  \"Ok...I can see why you think that...but you're flat wrong. Don't start judging a whole company everyone based on one thing. People take those accusations very seriously. It sounds like you're saying we don't give a fuck, and I'd be very careful talking like that if I were you.\"\n\n**Me:** \"Ok, thank you. I guess, if I slightly challenge that, I'm not sure what to do when I see something happening like that. I was confused why there weren't more alarms from leadership when the team was in that situation. I'm not sure how to, how would I bring this up in a way that's ok?\n\nShe stayed pretty stern and just told me to stick to facts, revert back to my immediate leadership, and be very careful talking about firm values. I felt really small and like I screwed up her support for me.\n\nPart of me thinks: \"Jeez, she's so great and respected, and I must be way out of line.\" The other part is more cynical.\n\nNot sure how I should have handled it. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 12,
      "content": "\" I'd be very careful talking like that if I were you.\" did that sound like a threat or is it just me? it's clear that she doesn't give a flying fuck about you or the employees. Her first instinct was to assert dominance instead of actually listening to you and giving you the respect that you deserve. You were very respectful.\n\nI recommend going to HR maybe or just looking for a different job at another firm. This one is not working out it seems. Also, are you the only one complaining? how about the other people who are overworked? are they speaking out too or is it just you?",
      "id": 2,
      "comments": [
        {
          "score": 6,
          "content": "It didn't sound full threat, but it did serve to not answer my question and tell me to be quiet at the same time. \n\nRegarding other people complaining, I mean, it's consulting so people complain about overwork, but people don't really speak directly to power like I did. When I asked another mentor for advice on how I should have handled the situation. She said \"You should have surrendered your fight earlier.\" \n\nMy concern is that I'm naturally anti-authority, so I don't know if my challenge to the boss was fair concern or my immature anti-authority side coming out",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "I'm all for being respectful to authority. But that respect is both ways. Obviously, your bosses aren't being respectful so you did nothing wrong. Your friend just doesn't want to cause any issues and is probably afraid of being fired. You know what they say, if you want change, you gotta stir the pot a little bit. You don't win by submissively saying yes to everything.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "sounds like they really don’t give a fuck about employees, it’s all about clients and profit. they just don’t want everyone knowing it\n\nyou were essentially told to shut up and accept the way things were",
      "id": 5,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NAH.\n\nWork relationships are a bit strange in that you are doing a job first a foremost. I lead a team and went through something similar last year when post CoVid production just ramped up into overdrive. There was a lot of head butting because I wasn’t letting other teams push mine around to puck up the slack they should have been. But honestly, sometimes you have to play the game just a little to get what you want. I found that a little charm and reframing goes over much better, with the same results. Instead of “We’re not doing another teams job, this is on them to manage and fix” I switched it to “Oh man, I really wish we could help but we can only do so much in 40 hours. Let’s have a meeting and see if we can postpone the deadline on tasks a, b, and c so we can help you with x, y, and z. I know you guys work so hard and we all appreciate you!” Same fucking thing. One just makes work relationships go smoothly, and gets you what you’re looking for: better time management and respect towards your team and you look like a team player.",
      "id": 6,
      "comments": [
        {
          "score": 3,
          "content": "[deleted]",
          "id": 7,
          "comments": [
            {
              "score": 2,
              "content": "I think it’s more just understanding your own clear goals. I’m at my job first and foremost to make myself money, and further my career in a monetary way. To do that, I need to make sure my team is getting their own monetary kick backs and personal goals met so they stick around and stay motivated to work hard for me. To do that, I have to play the game a little so that when I approach the higher ups for such things I can list off all the ways me and my team benefited them (and how keeping me happy with raises will continue to benefit them). \n\nIt’s a little cold to think of it that way, but honestly my goal is money. When I keep my team happy AND my boss happy, it helps me achieve my own goals. A lot of it is a means to an end, but as long as you’re being a decent person by achieving your goals with your team and not at the expense of them, it should manifest as charm and persuasion instead of slimy manipulation. \n\nI would think about what your own goals are. When you have a clear goal it’s easier to make yourself a clear path.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I questioned the boss on her value of the company's employees. That might make me the asshole because maybe its out of line\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "I don't think this is an AH situation.  Is she showing you how shady she is as a corporate overlord, yes.  Since this is on AITA, I'll go NAH, but you'll need to let it go at this point.",
      "id": 10,
      "comments": [
        {
          "score": 2,
          "content": "[deleted]",
          "id": 11,
          "comments": [
            {
              "score": 1,
              "content": "Oh, so do I!  Sometimes I need someone to let me know when to leave it.  I get really frustrated when actions don't match up with words.  I've had a VERY difficult time with it working in corporate America.  I have the benefit of a mentor who I could talk to about anything work related who has been able to gently, yet directly tell me when to let things go.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI work at a top European consulting firm that is known for working people hard and serving its clients well. On one project last year, my team members were being required to do a significant amount of work out of their job scope for several months. They were upset and overworked, so I raised the issue to my immediate bosses several times. They replaced me with someone else because they were tired of me complaining about the situation of my team members. \n\nI started wondering if consulting was right for me. I wondered if consulting itself, or maybe just my company, prioritized serving the client at the expense of a certain degree of team fairness/well-being. \n\nSo, after I was removed from the project, I spoke to one of the company leaders, who I had worked with before and had a pretty good relationship with. Here was the exchange I'm wondering if I was the ass hole for:\n\n**Me:** \"I accept my part in what happened and will continue to learn how to best navigate setting boundaries for my team. That said, I think the priorities shown by my immediate superiors prioritized client over our team. That's different from my personal values and priorities. I'm not saying one value/priority is better than the other, but mine is with the team first. In your experience, is that specific to my team, or common in consulting in general and/or this company? I guess I ask because I didn't hear from anyone from the company any acknowledgment of what I was trying to do to protect the team, even if I didn't do it in a way that was liked/effective.\"\n\n**Her:** (getting upset)  \"Ok...I can see why you think that...but you're flat wrong. Don't start judging a whole company everyone based on one thing. People take those accusations very seriously. It sounds like you're saying we don't give a fuck, and I'd be very careful talking like that if I were you.\"\n\n**Me:** \"Ok, thank you. I guess, if I slightly challenge that, I'm not sure what to do when I see something happening like that. I was confused why there weren't more alarms from leadership when the team was in that situation. I'm not sure how to, how would I bring this up in a way that's ok?\n\nShe stayed pretty stern and just told me to stick to facts, revert back to my immediate leadership, and be very careful talking about firm values. I felt really small and like I screwed up her support for me.\n\nPart of me thinks: \"Jeez, she's so great and respected, and I must be way out of line.\" The other part is more cynical.\n\nNot sure how I should have handled it. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA - it is time to look for a new company! Her response to you asking how the values align is very telling. You have your answer, now act on it.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA.  Her response shows that the company does not care about its people.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 0,
      "content": "NTA. She was highly unprofessional and taking your valid critique as a personal attack. That's her problem. She's made it clear that this company's values are profits over all (surprise, surprise).",
      "id": 16,
      "comments": [],
      "relation": "Support"
    }
  ]
}