{
  "post content": "So I (35M) was in a motorcycle accident earlier this week. My wife (35F) has 3 kids from a previous marriage (17F, 10M, 5M) and we have a 1 year old together. I had a collapsed lung and had a chest tube put in, a broken leg and arm and torn ligaments in my knee. I've been in the hospital since Monday. She came out the day of my accident and stayed until about 4 am. Was back that same morning but has gone home each night. Yesterday she only stayed until about 1 pm to prepare the house for the hurricane and didn't come at all today because the weather wasn't great and she said she didn't want to leave the kids. \n\nI told her I was upset that I basically went through everything alone. That I would've done anything to be with her. She told me she's been there as much as possible and it's not fair to dump all the kids on her daughter especially since I'll need a lot of help when I get home and her daughter will need to help with the kids when she works. I told her marriage means through thick and thin and I feel abandoned. Now I'm getting one word answers from her. AITA for feeling like an afterthought?",
  "id": 1,
  "comments": [
    {
      "score": 69760,
      "content": "Maybe you’re still on drugs and aren’t aware of how much of an AH you sound….?\n\nIt’s not as though she’s leaving you to go party, she has kids…including one of yours.",
      "id": 2,
      "comments": [
        {
          "score": 22461,
          "content": "Lol, this is the best theory tbh. Too high on painkillers to realize how wrong he is.",
          "id": 3,
          "comments": [
            {
              "score": 13648,
              "content": "A lot of people have a difficult time navigating complicated emotions and feel like they need to figure out Who Is Right and What Is The Correct, Singular Feeling To Have.\n\n\nIt's not crazy for OP to feel awful right now. But he can feel that awful, AND recognize that his wife has 4 kids to manage alone at the moment, AND notice there's a hurricane happening, AND that's making a hard situation harder.Edit: but right now he's straight up bending reality with his expectations \n\n\nMy guess is his logic and reasoning are a little offline rn between pain and painkillers,  though I'm also wondering if he's had a hard time with loneliness like this in the past. His wife sounds like a champion.\n\n\nEdit edit: should have clarified -- OP you are not the asshole for *feeling* abandoned! You're going through it, this shit is hard, I'm sorry it sucks! But that feeling is translating to some thoughts and expectations that are making things harder.",
              "id": 4,
              "comments": [
                {
                  "score": 3347,
                  "content": "Yeah, like I get feeling lonely and crappy and awful, but for me it's the expectation that his wife spends the night there that's the huge issue. Feeling bad is one thing, expecting her to stay because of it is another.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2480,
                      "content": "Oh don't get me wrong,  buddy is completely TA here,  and his stated expectations to his wife were bananas. I'm trying to give the dude some grace because we all kinda turn into vulnerable babies when we're in enough pain but yeah this is not an adult man's logic speaking right now",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1447,
                      "content": "Even if she didn't have a whole passel of children, and even if there wasn't a hurricane coming, expecting her to spend the nights is unreasonable. I just...what, does he want her to just sit there and entertain him? Stare at him adoringly? She's visiting as much as she reasonably can. \n\nYTA. Get better and do better.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 36,
                      "content": "I mean he's had wife there for full days in the beginning. That's a *lot* more than a lot of spouses do. (more than a lot *can* do.). Yes, it's best if people are there as much as possible to advocate for the patient. Especially when the patient is unable to do so themself.\n\nDoes he seriously expect a teenager to babysit 4 kids 24/7?  Shit, a lot of women find themselves *really* alone after a major medical calamity - even more so if found permanently disabled. \n\nI agree his brains are probably addled with meds, pain, and fear.  I hope he's able to admit wrongdoing post surgery & not double down on the belief. I also hope that wife isn't too hurt & angry to accept a sincere apology.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2192,
                  "content": "Can we also acknowledge that he got into a motorcycle accident. Don't get it twisted, I feel for everyone who goes through this. I've lost close family and had close friends lose fathers to riding but that is 100% a choice of \"I like doing this.\"  And it has always been a choice and risk that said biker has made. \n\nThis woman is trying to keep a family together and prepare for a freaking hurricane. That is more than enough to make any sane person lose it. \n\nHe's mad he's not getting enough attention at the hospital in the face of a hurricane and a family to keep afloat while dealing with the consequences of a something he chose to do, ultimately. \n\nYTA, dude. 100%",
                  "id": 9,
                  "comments": [
                    {
                      "score": 957,
                      "content": "Not to mention, the kids are likely concerned about both Dad in the hospital AND the hurricane, so Mom has to help them manage their emotions as well as her own concerns.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 580,
                      "content": "Yep. On a motorcycle with a 1 year old. I’m curious what OP’s wife thought of his hobby.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 443,
                      "content": "When you ride it’s not a matter of if, it is a matter of when the accident will happen. As a nurse I’ve taken care of these patients. Some people take it is stride and other people, well they are like OP. Like yeah that sucks, but you chose to get on that bike. OP knew the risk. There is a lot of entitlement here. Just flabbergasts me honestly.\n\nEdit: thanks for the award!! All nurses and healthcare workers are amazing. Everyday we see the worst of the worst. So please be kind, it is free.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Thats where I'm at. This was totally avoidable by not riding a motorcycle. Everyone knows motorcycle accidents are common and often very bad. Quite frankly I think a parent of a one year old is quite selfish to take that kind of risk, but if they are going to, they need to own it as wholly their own.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "This is the comment I was looking for! OP YTA, your wife now has to take care of you because you decided to take part in something dangerous. You added so much to her plate with your actions and now she not only has to take care of 4 kids including a 1 YEAR OLD, all while dealing with a hurricane, but also an irresponsible adult who is complaining about not getting enough attention. \n\nI'd be pissed at you if I were her. Grow up, take responsibility for the fact you made poor decisions and put yourself in this situation. You should be trying to be as easy to deal with as possible, to lessen her burden. I wouldn't be surprised if she doesn't resent you for this.  And sell the damn motorcycle!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Literally afloat based on some of the footage I've seen. Majorly TA",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yep, this ^ It's not like you are ill or got hit by a car, you chose to engage in an extremely dangerous activity. Prepping for a hurricane to keep the kids safe absolutely trumps staying with you 24/7. And it's not like she abandoned you, she's been there until late into the night most nights from what it sounds like by your own admission. You're absolutely NOT \"going through everything alone.\" Get over yourself, accept the consequences of the choice you made, and be glad you're not dead - if you're well enough to get on Reddit and whine about it you don't need her there 24/7. \n\nThere's a reason they're called donorcycles in the medical industry. YTA",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "I wasn't even able to achieve what he's expecting when my newborn baby was in hospital. I was bouncing between my other children, the hospital and trying to keep up with everything else. I highly doubt his wife is happy about the situation but responsibility doesn't disappear when someone is in the hospital. I was hardly sleeping and crying and feeling like I was failing everyone, to be so harsh to her is just unfair. \n\nExpecting to leave the children in a scary situation and risk her own life driving in bad weather is just absolutely AH behaviour but hopefully he'll see that yes it sucks but there's not a better solution. He needs to reach out to other people for support and just appreciate the fact his wife is handling so many people who need her.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Yeah it’s easy to judge when we aren’t in his shoes pain wise. I get also mentally feeling alone. However logically she has gone above and beyond. I hope this helps him realize that she does care even if he can’t feel it",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Also he may have a TBI. It can make people feel overly emotional or even combative.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1144,
              "content": "Nah, that’s giving him way too much credit.",
              "id": 20,
              "comments": [
                {
                  "score": 288,
                  "content": "Honestly. While accidents happen and I'm no way blaming him for being in an accident since we don't have any information on who was at fault, it is a well known fact that motorcycles are dangerous vehicles. I understand wanting sympathy from a partner with injuries and that it is tough. But when you get on a motorcycle you accept that you are not necessarily putting yourself in the safest situation. They are nicknamed donor-cycles for a reason. So he not only put himself in a position that was more dangerous, but now he wants his wife to put her and the kids lives on hold to baby him for the consequences of his choices.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Exactly. Donorcycles is an appropriate name.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 204,
                  "content": "[deleted]",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "All of this. I've had to deal with men that acted like OP with a damn head cold, so it's absolutely TOO much credit. OP is 100% TA on this. His wife is caring for FOUR kids, one of whom is a young toddler, AND doing hurricane prep on her own? He's lucky he even gets one word answers from her, because I might be inclined to tell him that I'm happy to show him what abandonment feels like and not respond at all for a day while I care for  the kids and the house and everything else.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 12,
                      "content": "And I'd be pissed and sell his dumb motorcycle if it's still intact. He has no business driving it.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 959,
              "content": "I kinda actually did this while coming out of anesthesia... I came to like an hour and a half before they expected me to, so there was no one there to greet me. It was only a very minor surgery, I know that my Dad was hungry and thought he had time to grab a bite. I was drugged up tho, and I teared up a bit and asked the nurse where dad was. I was a good patient and the nurses loved me, so they had the *whole hospital* keeping an eye out for him. When he got back, he told me he'd been stopped by 3 members of hospital staff (a janitor, a pharmacist, and someone in scrubs) who had been given his description and told him his daughter wanted him. He felt *so bad*, but he shouldn't've. My ego was asleep so the id ruled, lol.",
              "id": 26,
              "comments": [
                {
                  "score": 609,
                  "content": "God when I came out of anaesthetic the first time I insisted on calling my dad and I was so fucking stroppy when the nurses wouldn’t let me. I was unreasonably peeved. \n\nSecond time my mum was on pickup duty (another minor surgery) and when the nurses wouldn’t let me see her I almost threw a whole tantrum. One angel of a nurse convinced me that if my mum came in right then I’d need to share my chocolate mousse so I agreed to wait until I’d finished eating it to summon her. Genius.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 182,
                      "content": "You guys… when I came to and realized I was alone tried to escape the hospital bed by sticking my head through the side rails only to unlatch it and slam it down on my neck. This is the way the nurse found me.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 33,
                      "content": "When I came to in post op after having my gallbladder removed, I was apparently very pissed off at the nurses. \n\nMy surgery had been delayed so I hadn’t had anything to drink in nearly 24 hours and my throat was SO DRY, and I was desperate for a drink, and I kept coughing which made the brand new holes in my stomach hurt. And the nurses just told me to stop coughing. I managed to articulate that I wanted some fucking water, and was given… 1 ice chip. \n\nMy partner worked at the hospital at the time so she was able to pop in to see me before I was taken back to my room, and she said she’s never seen me look that angry, and that I was visibly wishing grievous harm to the nurses.\n\nAll I remember is that I was thirsty and in pain and they weren’t giving me a drink",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "This story is super cute, and I hope your Dad didn’t continue feel guilty about it for very long!",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "When I hear other people's stories of how they handled anesthesia I'm like \"damn, I do drugs well.\" I woke up early and basically tucked myself into bed, gave them a very emphatic thumbs up and after about 15 minutes I was right as rain....... Except for the freshly pinned broken leg.\n\nMy cousin called all the staff 'bitch' but really conversationally - \"thank you, bitch\" or \"that's okay, bitch\" kind of thing.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "I’m the person that cries coming out of anesthesia and I’m inconsolable. When I had a tooth extracted and I came to I cried because my boyfriend was sitting in the lobby waiting for me instead of holding my hand. The emotions were 100% uncontrollable and he completely understood that I couldn’t help it and just apologized and got me home. I’m hoping that OP is on a form of sedative/painkiller and not in his right mind. I know when my brother had his motorcycle accident and was on morphine in the ICU he was an AH but he has zero recollection of it.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "What amazing nurses and staff!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4273,
          "content": "This!! Your wife left to prepare for a hurricane! To take care of her children. 100% YTA",
          "id": 34,
          "comments": [
            {
              "score": 2065,
              "content": "The absurdity of him being pissed about her preparing for the hurricane made me laugh out loud!",
              "id": 35,
              "comments": [
                {
                  "score": 895,
                  "content": "What do you mean the 1 year old can prepare he needs her now. Dude YTA grow up she has responsibilities. You are not always number 1.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 873,
                      "content": "He should have stayed home and started hurricane preparation. Instead, he went out and wrecked his motorcycle. 🙄",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 41,
                      "content": "Why isn't he thinking about his 1yr old instead of acting like one?",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "Would he rather go home e to either major damage or no house?",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "To be fair, he is the *oldest* of her 5 children...",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "And the 5 year old is plenty old enough to boil water and man the candles if needed after the hurricane.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "This is like a new hybrid of Florida Man and toddler. The wife is an absolute 🌟 for managing him and the kids (including a biological child of yours, OP - not that it should matter, but you pointed out the difference) and preparing for a frigging natural disaster. OP, YTA. We wish you a speedy recovery, be kind to your wife and all the kids with whom you live under one roof.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Dad - recovering from accident in suitable medical facility.\n\nMum - providing emotional and physical support for Dad, caring for children, keeping real life ticking, working, preparing for natural disaster.\n\n……",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 967,
              "content": "Guy leaves his family at home to go ride his donor-cycle,  no problem, wife goes home to look after kids and prep for hurricane:\n\n\"Hey guys, I think she's being a bitch, amirite???\"\n\nNo OP, you're not, YTA.",
              "id": 44,
              "comments": [
                {
                  "score": 23,
                  "content": "Donor-cycle! Ha!\n\nAs a funeral director, this moniker checks out.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "You put this MUCH better than I would have.  This is perfect.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Also this is why I’d never ride a motorcycle… I have a family and they need me.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "THIS RIGHT HERE. OP, how would your wife take care of you if she'd stayed with you and your house was destroyed during the hurricane?  I know you are feeling crappy and in pain, but please try and think things through logically from her POV.  She's thinking long term. She's not abandoning you. YTA.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1625,
          "content": "Maybe undiagnosed brain damage from the accident too?",
          "id": 49,
          "comments": [
            {
              "score": 402,
              "content": "He rides motorcycles for fun, don’t think he was that smart to begin with. \n\nThere’s a reason doctors call them donor cycles.",
              "id": 50,
              "comments": [
                {
                  "score": 210,
                  "content": "One of out ER docs asked me one what the difference between a helmeted bike rider vs non was...open vs closed casket 😬",
                  "id": 51,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Donor vs not also. The helmet can keep you \"alive\" long enough for your organs to be potentially viable.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 173,
              "content": "No, he had a severe case of cranium insertusrectum well before the collision.",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 745,
          "content": "He even states that she had to prepare for the hurricane. Hurricane fucking Ian. Jesus christ",
          "id": 54,
          "comments": [
            {
              "score": 44,
              "content": "I literally just got internet back on my phone at 2AM, and I was about 60 miles from the direct impact. This is an absolutely insane take, the destruction in fort Myers I saw last night was crazy. I had to drive around stop lights hanging in the road. Some people were blowing through dead stop light intersections. I had to drive on the sidewalk to bring supplies to my friends.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Maybe he should turn on the TV & all the damage the hurricane did esp on the southwest coast of Fla.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 672,
          "content": "I really hope this is the case. \n\nWoman is staying till 4am. Goes home to take care of her kids, including a 5yr old and 1yr old. Presumably the older two are in school? And then gets upset because she went home to prep the house, for a HURRICANE!!  The one that’s been on the news as the “oh shit button down the hatches and stay off the roads” hurricane.  \n\nPlease please just be on some good pain killers.  Feelings are always valid but there’s a reason why she’s not their 24/7: the family and home you created with her.",
          "id": 57,
          "comments": [
            {
              "score": 194,
              "content": "Yes! And really -even if she didn’t have kids at home, why the fuck would she have to sleep at the hospital. She’s with him all day. What’s she gonna do hold his hand while he’s sleeping?",
              "id": 58,
              "comments": [
                {
                  "score": 34,
                  "content": "Hospital stays nearly always come with disrupted sleep, either from your condition, medications, or staff (rightfully) needing to check on you every few hours. This guy is completely unreasonable in his expectations, possibly due to the medications he's on, possibly because he's an AH in general, but having spent plenty of time in the hospital myself, night times are 100% the worst and when you feel most isolated from your support system. You know everyone deserves to rest and sleep, but that makes it especially hard when you feel like you need someone at that time. Nurses are angels and do everything they can, but they're there for medical support not emotional. They can't just keep you company because you can't sleep and don't want to be alone.\n\nI'm going with giving grace in this situation and hoping that it's meds/circumstances making OP feel unreasonable in his expectations. Especially with the hurricane comment, it doesn't read as someone being rational right now. NAH based on that assumption, but if this is his genuine, sober, rational feelings it's totally a Y T A instead.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I'd be more mad if my partner stayed with me during such circumstances! When I was getting sewn back together from emergency c section I saw them take our baby somewhere and I practically shouted at my husband to follow. (Totally trust the midwives but 16hrs of labour and then emergency surgery kinda puts you on edge) \n\nI would be more frantic for the kids. I'm safe in hospital so I want my partner to be putting the kids safety top priority.",
              "id": 60,
              "comments": [
                {
                  "score": 11,
                  "content": "This! I went through similar and had kids at home. Unfortunately my son didn't make it, but not for lack of the doctors and nurses trying. He needed emergency surgery. My biggest concern was my kids. I wanted my partner with them to comfort and protect. I couldn't imagine wanting my partner with me during a hurricane while I recovered in safety at a hospital.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 560,
          "content": "She's also been there *every day* except for the day when the weather prevented her from coming and because the children need her!",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 329,
          "content": "And is preparing for a hurricane! \n\nHe didn't \" basically go through everything alone\" - she was there *until 4 am the first night*, *came back that same morning*, and goes home each night *because she has 4 kids at home*. And then she had to **prepare the house for the hurricane**. He needs to stop acting like her 5th child.",
          "id": 63,
          "comments": [
            {
              "score": 45,
              "content": "Poor lady is probably stressed and exhausted, getting way too little sleep and her husband is upset she can't be with him 24 hours a day during a severe hurricane. \n\nTA says he feels abandoned? Well he has literally physically abandoned his wife due to his poor choices that led to his accident. \n\nShe is the one abandoned to face a natural disaster and take care if 4 kids, and OP has no gratitude towards her at all.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "SHE went through basically everything alone. Having to worry about a spouse in the hospital, while taking care of stressed out kids, and doing hurricane prep all at once. With nobody but a 17yo for help.",
              "id": 65,
              "comments": [
                {
                  "score": 13,
                  "content": "This.\n\nI can guarantee her stress levels are off the charts right now and this dude is just compounding things acting like a child, not even realizing the sacrifices she is making because of his own irresponsibility.\n\nI can't believe he thinks it is remotely appropriate to put all the childcare on a 17 year old!",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Seems telling that this guy has no friends or family visiting, and its her own sister helping with the kids. Is this woman the only person in the world who likes him? Where are his buddies?",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 291,
          "content": "Take everything else out of the picture.  Take out the hurricane and the children. OPs wife has still spent a significant time at the hospital and was there for major stretches during the early days. What is the expectation now that she fluffs his pillow and reads to him all day?  Even assuming she isn’t working it’s baffling to think she should be waiting on him and foot.  The fact that this was a motorcycle accident OP should be begging for forgiveness that he didn’t just widow her with three kids and a one year old.   Major YTA\n\nOP should spend his solo time in the hospital thinking of ways to make it up to his wife for the additional mountains of burden he is foisting upon her instead of whining that she isn’t doing enough for him. If I was married to him I would wheel his ass out to the parking lot and leave him there.",
          "id": 68,
          "comments": [
            {
              "score": 37,
              "content": "Can you imagine the shit he's going to put her through when he goes home?",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": ">  The fact that this was a motorcycle accident OP should be begging for forgiveness that he didn’t just widow her with three kids and a one year old.\n\nI just can't even say anything more than this. OP is the asshole.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 234,
          "content": "Meds can definitely do weird things to your thought process. I hope this is what is happening.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "There's a 10yo, 5yo, and 1yo at home to be cared. And there's a hurricane coming.\n\nYes, the 17yo can **help**. No, the 17yo can't be responsible for the younger kids 24/7, for several days, with a hurricane to prepare the house for and, being realistic, maybe evacuate. \n\nIf you think your wife could stay with you in the hospital 24/7 till you were ready for release, and the 17yo *dealt with everything else*, yes, YTA.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 28229,
      "content": "YTA for not understanding that a 17 year old shouldn't be responsible for 3 kids age 10 and under DURING A HURRICANE.\n\nThe situation isn't ideal, but it's obvious to me she's there as much as she can. Marriage means through thick and thin BUT SO DOES PARENTHOOD. The fact that you're not more understanding of her trying to balance all her responsibilities DURING A HURRICANE is bizarre.",
      "id": 73,
      "comments": [
        {
          "score": 5105,
          "content": "As someone who is almost 40 and from a place that gets hurricanes, I would NEVER leave them alone during one. So many things can happen during/after a hurricane, from trees falling to fires to flooding to roofs just leaving houses….it would be dangerous and neglectful to leave them without an adult during a hurricane that wasn’t the full blown catastrophe that is Ian.",
          "id": 74,
          "comments": [
            {
              "score": 2916,
              "content": "Not to mention 17 year olds aren't full blown adults yet. Even if nothing happened, there are grown ass adults that were scared during Ian, I can't imagine how a 17 year old would feel as the most responsible person in the house during one.\n\nWith a ONE YEAR OLD? During a HURRICANE? I'm really hoping this isn't real, but who the hell knows.",
              "id": 75,
              "comments": [
                {
                  "score": 1331,
                  "content": "When I was in grad school we had a tropical storm hit. My roommates were either helping parents or home from the summer, and I had work the next day and it was supposed to be fine. \n\nIt ramped up to a cat 1, still not too big of a deal, but I lived in a building that had this tiny alley a person could barely fit through between the next building. When I tell you 75 mph winds ripping through that alley were SO LOUD I was suddenly very aware I wouldn’t be able to hear the difference between that and a tornado coming - I’ve never been so scared. Me and my schnauzer slept in the tub. \n\nPeople LOVE to downplay tropical storms and hurricanes as “bad weather”. But they can be absolutely terrifying for grown adults. No 17 year old should be the responsible party during one.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 455,
                      "content": "I was 19 and living in Orlando when Irma hit. Thankfully Orlando wasn’t hit hard, but it was the most scared I’ve ever been in my entire life. I’m from the Midwest and had never experienced a storm like that. I stayed up the entire night and had my dad on the phone with me the whole time. I can’t IMAGINE a 17 year old being forced to deal with that, especially with two young children and a BABY. \n\nMajor AH, OP.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Hurricanes can wreak a lot of havoc, even the weaker ones. Experienced my first stronger one (mild Cat 3) in 2020 and we had 110mph gusts. I could literally hear the beams of my house creaking as the wind blew. We lost power for days and millions of pounds of debris were collected around the city for weeks afterward. It looked like a bomb went off outside, so many trees were defoliated, there were leaves and branches EVERYWHERE and it took two full days of working outside just to clean debris out of the yard. And that’s just the aftermath — making preparations to secure your property beforehand is also a lot of work.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "This is why I really hate that kids are encouraged to babysit. Yeah, it's usually fine, but if something bad happens that poor kid has to live with that weight eternally. Full adults can panic and fail to respond effectively in a crisis, yet we expect a kid to take the responsibility for a little life :/ \n\nThere's no simple solution I know, especially in todays work-to-death-to-live world, but I still hate it.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I mean, I know we also don't know everything from such a short post, but can the 17yr old drive in an emergency? Not just \"can she legally drive alone\" - would she be able to plan a safe route to higher ground and would she be adequately able to judge what type of obstacles are high risk?\n\nI'm not sure I would have felt safe having to pack 3 young kids into the car for a trip to the emergency room under normal conditions at that age, let alone during the most intense hurricane seen in this lifetime.\n\nCan you imagine if the worst did happen and one of the little kids got hurt or sick and the 17 yr old did try to drive to the hospital and they got caught in high water? Imagine losing all of your kids to a preventable accident because you really needed your wife to hold your hand.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Right??? My dad went out of state to a damn football game without doing ANY prep before hurricane Matthew (we had about 6” of rain the week leading up to it so a LOT of huge old trees came down and there was significant flooding; it took me over an hour to get to my mom to check on her and she only lives ten minutes away), and both my parents went out of town for I forget which tropical storm in 2019 when we lost power for 3 days and I had to do all the prep and take care of everything by myself again. In my 30s for both and it still sucked. And guess who’s out of state once more when Ian is fixing to come through tomorrow??? If they were work trips it would be one thing, but nope. Like, I guess OP isn’t quite as bad since he’s in the hospital, but it’s fucked up to leave your kids to deal with natural disasters by themselves, especially at OP’s kids’ ages.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "It’s crap to be stuck in the hospital by yourself feeling hurt and scared. I get that, I honestly do. \n\nI just can’t quite process wanting my kids to be cast aside so that I can have a hospital buddy, especially when there’s FaceTime. \n\nThere’s a difference between being abandoned and the other half of your team covering all of your other responsibilities so that you can heal. OP can be upset because the situation sucks, but I don’t get why he’s mad at his wife.",
          "id": 82,
          "comments": [
            {
              "score": 35,
              "content": "I have 0 sympathy for this dude. I had to remain hospitalized for 18 days after my son was born. 15 of those days I was in the hospital all alone except for when my husband could visit with my son which was only an hour. I absolutely wanted my husband with my son when I could not be.",
              "id": 83,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Also, OP rides a motorcycle which comes with huge risks, I think that’s a responsibility he needs to accept and take some accountability for (I also am curious about wifes feelings of him riding a motorcycle with 4 kids, not saying no one should ride but it is risky) and not make wife feel bad for staying with him until 4am while also having 4 kids, one of which is a fucking TODDLER and also one is a BABY.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Marriage is through thick and thin, wouldn't that also include not taking huge voluntary risks as a hobby? A hobby of which she is now a victim?\n\nOP, she ís taking care of you best she can. You just need to recognise that taking care of your children and your house is a better way of taking care of you than sitting next to you twiddling her thumbs.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15196,
      "content": "Bro she has to take care of 4 kids by herself, and is trying to visit you. Clearly she’s trying her best and she’s got a lot on her plate. Yta",
      "id": 86,
      "comments": [
        {
          "score": 3792,
          "content": "I really doubt he ever does anything for the kids, so as far as he’s concerned they don’t take any time at all. OP is definitely YTA.",
          "id": 87,
          "comments": [
            {
              "score": 3090,
              "content": "He didn't have any care for his family and infant child when he decided to take his donorcycle out for a spin. I wonder how much protective gear he opted to wear?\n\nHe really thinks that his partner ought to prioritize *keeping him company* (not even doing any actual care, he's admitted  in the fucking hospital) over making sure her numerous children (one of them his own infant child) are taken care of in the fucking hurricane?\n\nI *HOPE* he's fucking high, because otherwise that's a *real* nice personality coming through there, ugh",
              "id": 88,
              "comments": [
                {
                  "score": 1228,
                  "content": "I was thinking the same. I don’t want enthusiastic bikers to come for me, but I think it’s quite an irresponsible hobby to have when you have a young family - also pretty selfish when really a father to four kids needs to be driving a huge family sized vehicle.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 529,
                      "content": "One of my aunts was a complete pushover except for one time, after her husband crashed his motorcycle, she said she'd divorce him if he didn't sell it. She'd didn't like him riding when he first bought the bike but once they had two little kids, she didn't play around.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Not at all.\n\nI'm a rider, but I put my bike away after I went down hard.  Ended up with twenty stitches in my forehead.  I got back on and rode after that, but it got me thinking - what would happen to my then ten year old if I got killed on it?  People were getting more and more careless around bikes.  I had buried a few rider friends... it just wasn't worth it.  I get the itch to ride quite often during the summer - and my younger is now an adult, just barely, but he still needs me, as does my partner (who, ironically, has a TBI from a work accident).  I owe it to them to stay alive even if that means missing riding at times.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 210,
                  "content": " Motorcyclists are something like 50 times more likely to die in an accident than a car driver.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 28,
                      "content": "My husband was friends with a guy who had always wanted a motorcycle.  I don't know why he waited so long,  maybe kids, idk.  His first week with his motorcycle he was killed.\n\nOne of my son's classmates.  Graduated high school. Was doing great.  Bought a motorcycle. Dead from a motorcycle accident a year later. \n\nThe accident I witnessed - The guy lost control of his bike going around a surprisingly sharp downhill curve. He was the father of two. Was alert after the accident.  He died in the ambulance. \n\nOne of my neighbor growing up. Hit a deer with his bike. Dead instantly. \n\nMy nephew walked away from his accident but the pain from that accident helped lead to an addiction that put him in prison. \n\nAs far as car accidents go, my sister's best friend was killed when a drunk driver ran a light and hit the driver side door head on.  My father in the backseat of a car, would still be here if he had worn his seatbealt. Two car accidents in my whole life vs four in the last year.  Motorcycles are scary.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "And the people who don't likely wish they had at some point. I handle auto claims that result in catastrophic injuries, death, and litigation. I've seen severe fractures as the result of hitting a small rock at 25 mph, a guy who stopped all of his forward momentum with his softest bits and had irreversible damage, and so many gruesome deaths. \n\nI know people like the \"freedom\" and think they're only risking themselves, but that's simply not true. It may be for physical injuries, but I've had a teenager who was doing his first driving practice with his dad do absolutely nothing wrong only to be hit by a motorcyclist and watch his head crack open on the pavement. I've seen a dash cam video of a motorcyclist trying to pass at the wrong time and hitting the windshield head on. The 4 year old in the car screamed for the rest of the video. Other people may not be physically injured, but their lives can still be ruined from seeing things they'll never be able to forget. The guilt it causes is extreme, even if they did everything right.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Not all but some guys turn into needy, whinny lil babies when they get sick like with the flu so I wonder if this is that and that since he’s in the hospital after the accident he thinks he’s more entitled to op then her own kids where he’s like Don’t pay attention to them Pay ATTENTION TO ME!!! \n\nAnd it sounds really reckless to be riding a motorcycle during such a time in a area where a hurricane is coming. Even if they aren’t in the path it’s still really bad weather where the wind is strong (there’s been lil tornadoes that touchdown for a lil in Florida that’s not even where the hurricane is like one that went through a trailer park in Davie damaging homes and cutting off the electricity after the wind picked up something metal and threw it into power lines. There’s places or situations where u wouldn’t even be safe in a car so can’t imagine being in one on a motorcycle. There’s flooding issues where some places have it goes up to ur stomach. He could get hit by something that’s in the wind or something that falls down like tree for example\n\nYa in general just pretty reckless and not a good time to ride I mean obviously since he got in a accident and is in such bad shape, I wonder if it had anything to do with the weather. \n\nDude should be grateful his wife was even able to go and spend as much time with him as possible. And I can’t imagine leaving her kids all home alone with oldest in charge to sit and entertain op in the hospital as a fu#king hurricane is happening!!! Again even if the hurricane hasn’t gotten to them yet the tropical storms and currents around it can also be pretty ridiculous. There’s fires that’s been started by a accident because things blew into something electric. People’s windows have broken with glass going everywhere. And these things can happen out of nowhere and within like a half hour. \n\nCan’t believe him trying to guilt trip and manipulate her saying “marriage means through thick and thin” realllly? She’s doing everything and has to do it by herself because he got hurt. She can’t drop her duties as a mother because he wants her there just for company and entertainment. Thick and thin goes both ways and right now it’s all him just taking and taking and not being considerate about her. He’s not dying and like she said he will come back to the house and need to be cared for by her when he’s home which she will do. And her oldest will have to help with the kids during that but he wants her to watch them all all the time starting now? Gtfo",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 957,
          "content": "During. A. Hurricane. Ffs",
          "id": 96,
          "comments": [
            {
              "score": 208,
              "content": "This has to be fake. This has to be fake… I repeat to myself because Jesus H Christ on a unicycle, how could someone not realize their partner needs to go home and take care of their children as well.\nYTA",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10824,
      "content": "YTA- four kids and a hurricane?!! Plus you’ll be coming home at some point and then she’ll have to take care of your ass too!! You are being cared for nursing professionals and you are safe. Your wife isn’t a nurse! Please chill out and let her take care of business. You should probably increase your life insurance if you have a family and insist on riding a motorcycle .",
      "id": 98,
      "comments": [
        {
          "score": 2824,
          "content": "A fucking category 4, assuming that he’s in FL. YTA OP. A giant one. A 17 year old is not equipped to go through that with 3 children her own. You have professionals. Your wife is doing the right thing. Hopefully step 2 of doing the right thing is leaving your irresponsible ass- were you at least wearing a helmet? I know it’s optional in FL.",
          "id": 99,
          "comments": [
            {
              "score": 1692,
              "content": "And he wanted her to drive to come see him DURING A HURRICANE?! I guess her safety doesn't matter at all on top of everything else that's going on. Op, YTA.",
              "id": 100,
              "comments": [
                {
                  "score": 752,
                  "content": "If he cared about anyone but himself, he wouldn't own a motorcycle in the first place.  They're called \"donor cycles\" for a reason.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 193,
                      "content": "Exactly what I was thinking. I can't stand people like OP.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 109,
                      "content": "Yep. My cousins partner rides them for races on tracks, he's very good at driving, he races cars too, but he was on his motorcycle going the correct speed down a straight road in dry weather, high visibility weathr, a car that he saw but they didn't see him pulled out on him and he didnt have space to swerve or he would hit the car at an angle so he just breaked hard and hit it head on. T boned it.\n\nThankfully he was smart enough to go head on or he would of hit the door and died, as it is he flipped over the car and absolutely fucked up one of his arms. For a while it looked like he may never get his grip in that hand back and is still in recovery months later.\n\n#it doesn't matter how well YOU can drive on a motorcycle, you're on a road with hundreds of people and if one of them fucks up you're 30x more likely to die than them.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "I'm in the UK, but my Dad gave up motorcycling after I was born. He said the risk was no longer worth it.",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Kids need their parents, mom at least sounds sane and responsible.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "wasnt it upgraded to 5 right before landfall?\n\ni mightve just read a tweet or something. the internet all kinds of blends together these days",
              "id": 106,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 879,
          "content": "Yeah, now she’ll have a fifth child to take care of, because he had to “ play with his toy”.",
          "id": 107,
          "comments": [
            {
              "score": 338,
              "content": "This really makes OP the asshole. 1 year old baby, and off riding a motorcycle.",
              "id": 108,
              "comments": [
                {
                  "score": 22,
                  "content": "A 1 year old baby, and off riding a motorcycle RIGHT BEFORE A CAT 4 HURRICANE hits.  Everyone has seen that thing coming for days.  If he lives somewhere where his wife needs to prepare for it, then he should have been preparing right along with her, not out taking a recreational ride.",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "His deadly toy.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I mean…If you already have teens and toddlers, what’s the worry with taking on a 40 year old quadriplegic? \n\nYou already know about being yelled at, making baby food and changing diapers. \n\nHow dare she be selfish for not wanting to meet OPs yells of “Ma! Hot pocket!” And “ma! Bathroom!”\n\n/s (South Park reference).",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 550,
          "content": "AND she said the oldest will need to help while she WORKS! 4 kids (a 1yo!), hurricane, working mom, household to manage, visiting when she can. and he expects more! How dare she go home at night to get some (hopefully) decent sleep in a real bed, instead of a hospital recliner. I’m overwhelmed for her. YTA, OP!",
          "id": 112,
          "comments": [
            {
              "score": 181,
              "content": "And it's like...is she even *allowed* to visit him now that OP's (presumably) out of immediate danger of dying? Like, where I live the big, frequent natural disaster is wildfires, and our local hospitals straight up *ban visitors* to all but the most critical of patients when we're under a fire watch, because they want as few unnecessary bodies in the hospital as possible in case they either get a big influx of patients or need to evacuate.\n\nEDIT: And that's also assuming that they're not just straight up under \"stay at home\" orders. Because, you know, *fucking HURRICANE*.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "The last part of this comment 👏👏👏",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "During my appendectomy I told my husband to go home and take care of the kid. I have doctors, nurses, pain meds, a quiet room and food and tv. I'm good.",
          "id": 115,
          "comments": [
            {
              "score": 25,
              "content": "Personally I think women just tend to be able to handle/juggle things better than men. could u imagine if this was reversed ? Oh he'd be bitching up a storm",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "And buy a disability policy as well.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "And I'm sure he'll be an easy patient too....",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "It's one of the worst hurricanes to ever hit the US and the world's oldest baby is whining because his wife isn't there to spoon feed him and wipe his ass, the nerve of some people.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Call me a jerk, but I have a little less empathy for him being injured in a mortorcycle accident. No one with minor kids has any business riding motorcycles in traffic. They’re way too dangerous.",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Right?! Imagine how much pressure she’s under. Husband is severely injured, four kids to take care of alone, needing to make arrangements for husbands time off work, deal with insurance, working out arrangements at home to be ready to care for him once he gets back, emotionally dealing with the fact that she almost lost her husband, and then BAM! let’s add in a major hurricane event to make things more interesting. That woman hasn’t sat down or thought about herself in days.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8509,
      "content": "YTA\n\n1. motorcycles are inherently dangerous, you take this risk every time you ride.\n\n2. You know there are 4 kids at home, who is supposed to take care of them all day?\n\n3. By your post, sounds like you live in Florida or wherever the hurricane is hitting, someone needs to prepare.\n\n4. She has been there everyday, you didn't go through anything \"by yourself\" except sleeping.",
      "id": 122,
      "comments": [
        {
          "score": 2152,
          "content": "Motorcycles ... otherwise known as \"donorcycles\".",
          "id": 123,
          "comments": [
            {
              "score": 1726,
              "content": "With a 1 year old at home, OP is riding a motorcycle and then complaining that his (very busy) wife and mother of his child won’t drop everything to come see him more than she already has. I wouldn’t be surprised if she was upset that he’s riding a motorcycle with a baby at home. \n\nTalking about what he had to go through alone like he is the victim and the whole world is just punishing him for no reason SMH",
              "id": 124,
              "comments": [
                {
                  "score": 618,
                  "content": "Their kid is 1 year old, which means OP's wife likely gave birth a year ago. She's a superhuman for spending this much time caring for OP in the hospital while also taking care of 4 kids (including said 1yo) and preparing for a hurricane, *having birthed a child only one year ago*. OP's lack of empathy for his wife, kid, and step-kids is astounding.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 533,
                      "content": "My favorite is the “through thick and thin” line because it’s clearly a one-way expectation that she is there for him but god forbid he pulls his weight and understands that his contribution to his family preparing for a HURRICANE is to deal with his apparent abandonment since he decided to ride a motorcycle at a time that his family arguably needed his presence and support the most \n\nHis wife is a superhero and he’s acting like pregnancy and parenting are just not important as he is because she can’t abandon the kids to be with him in the hospital\n\nDo you know which one in the relationship is the spouse that’s shouldering an unfair burden and has been abandoned by their spouse? *hint: it’s not OP*",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "I'm willing to bet OP is barely involved in child rearing and house duties. A one year old! He sounds like he has no idea how much work a 1 year old still is. Definitely not something you can (or should) pass off to a 17 yr old.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 81,
                  "content": "Our kid was 6 weeks old when my husband had a motorcycle accident. I was less than sympathetic. We visited him in the hospital but with a newborn, a stroller, a diaper bag, and parking in downtown Oxford, visits were short. I had to get home and prepare the house for a person recovering from an accident rather than enjoying my newborn and getting used to breastfeeding and a baby schedule.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Holy cats, I am sorry. I had time to prepare and took a month of FMLA leave for a scheduled spinal cord surgery my husband had, and we have no kids, and it was still a fair amount - having the situation be unexpected and be juggling a newborn? Oooooof.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "I ride motorcycles. I love riding motorcycles. I also almost died riding a motorcycle, and that month I spent hospitalized and the year I spent in recovery was extremely difficult for me, physically and mentally. But even before that happened, I always knew that if I were ever to get married and have kids, I would have sold that bike in a heartbeat.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Yeah! I sold my motorcycle when I was pregnant with my kid. When you have kids they take priority over everything! Every damn thing!",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "Yeah, we have a 1yo and my bf stopped riding months before she was born.",
              "id": 132,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "We, in our riding gear, were in an elevator at the hospital when a doctor said to another “ oh look - temporary people” !",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Like for real if you have kids that rely on you and you CHOOSE to ride a motorcycle (not like... forced to because finances or something), you're a different kind of asshole.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "My state has a helmet law, but several nearby neighboring ones do not. It's common to see riders on the side of the road just over the border, pausing to take their helmets off. I used to call them organ donors, until my husband, who used to ride years ago, pointed out that no recipient was going to benefit from a donated bag of soup. At those speeds, he said, there's precious little left that's donatable.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 741,
          "content": "Glad someone brought up that a guy with 4 kids is still using the deadliest mode of travel available and he’s surprised to find that his wife must take care of the family and prepare for the impending natural disaster while he recovers in a hospital with doctors on staff. \n\nI can’t help but question his priorities in life",
          "id": 136,
          "comments": [
            {
              "score": 75,
              "content": "\"But only one of them is mine!\" \n- OP, probably",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 325,
          "content": "Probably rides the motorcycle like an asshole too.",
          "id": 138,
          "comments": [
            {
              "score": 43,
              "content": "Fun fact! Florida has no helmet law.",
              "id": 139,
              "comments": [
                {
                  "score": 41,
                  "content": "I wish this was a surprising fact but *gestures at florida*",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Neither does SC, which is also affected by the hurricane.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 48,
          "content": "5. You’re in the hospital. You’re receiving round-the-clock monitoring and care. Yes, it’s nice to have family there for social and emotional support, but they’re not *doing* anything. Your wife would just be sitting around while you lie in bed recovering. \n\nIs that *really* a more valuable use of her time than *caring for your children*?",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "5. Asking a 17-year-old to be an unpaid babysitter. Plus, he is going to have to mind both the kids AND him while her mom is at work. That is an insane amount to pile on someone not even legal age yet.\n\nHe is definitely the a.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Seriously. This guy doesn't know what it's like to be abandoned at the hospital. My ex husband left me alone in the ER after half an hour to go drinking with his friends and didn't come back until I was discharged.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "This. \n\nAlso, he rode a motorcycle 🏍 he’s lucky to be alive",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7321,
      "content": "If you’re okay enough to whine on Reddit I think you’re okay enough to not have your wife at your side 24/7",
      "id": 146,
      "comments": [
        {
          "score": 853,
          "content": "I was just thinking the same thing! Call the wife if you’re lonely. Text her. She has to take care of SO much and is probably in panic mode figuring things out the best she can",
          "id": 147,
          "comments": [
            {
              "score": 725,
              "content": "Better yet, leave her the hell alone.  She has enough to deal with thanks to his irresponsible actions, and the time she wasted at the hospital visiting his ungrateful ass.",
              "id": 148,
              "comments": [
                {
                  "score": 35,
                  "content": "Oh you’re not wrong at all. I’m from the Northwest, Illinois specifically. We don’t get hurricanes, and we don’t get effected by them either. HOWEVER, I just got a notification an hour ago about the weather going on in OPs area. If IM getting notifications and it doesn’t even effect me, I cannot even imagine how OPs wife is feeling",
                  "id": 149,
                  "comments": [
                    {
                      "score": 41,
                      "content": "The trajectory of Ian's path reaches all the way up into Kentucky. Hurricane Ian is the biggest storm system I have ever seen in my life (I lived in South Florida and went through Andrew). It dwarfs 2004's hurricane Charley to an insane degree. The footage of the storm from the international space station was astounding. Ft. Myers, Sanibel, and Captiva won't recover for years. The comments and stories in their respective subreddits are heartbreaking. Dozens of people asking for help to get in touch with family that may be missing or worse.\n\nOP is a really selfish, narcissistic  piece of work for this. Dude should have been telling his wife to stay safe with the kids and trying to stay in touch to make sure they're even alive. But no, he's sad because he doesn't feel \"supported\"? He's lucky his family isn't dead. I cannot comprehend how someone like this even has the fucking gall to think they're in the right for behaving this way. I hope his wife leaves him for this.",
                      "id": 150,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Or maybe call someone else. A relative. A friend. Literally anyone who isn’t single-handedly caring for 4 kids during a hurricane.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "also, video calling softwares exist if you're really that lonely yk",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4854,
      "content": "YTA- SHE WAS TAKING CARE OF UR MOTHERFUCKING KIDS AND PREPARING FOR A GODDAMN HURRICANE\n\n\n\nEdit: shit, thank y’all for the awards- literally just said the first thing on my mind",
      "id": 153,
      "comments": [
        {
          "score": 713,
          "content": "Exactly this. Probably also comforting the kids who would be worried. Did he expect the 17 yr old to manage 3 kids, one of which is a baby? or the 10 and 5 yr old to prep the house while the daughter looked after the baby?\n\nWhat an entitled brat attitude, dont kids always come first?\n\nRide stupid machines, you win stupid prizes. Did OP not know there are big risks when riding a motorcycle?",
          "id": 154,
          "comments": [
            {
              "score": 36,
              "content": "Some ppl do exactly that. My parents left me, at 13, with 4 younger siblings for ***WEEKS*** at a time. They left me to care for them with no electricity, no indoor running water, I had to hand pump from outside. Some ppl/parents just fucking suck.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Yeah the risky aspect was one of my first thoughts. How many anxious moments has wife spent worrying about husband getting home safe while he was riding the motorcycle while they have a 1 year old and she’s juggling 3 other kids.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "_\"I told her I was upset that I basically went through everything alone.\"_\n\nOP's wife stayed with him until 4am the first day, was back that same morning and stayed the entire day Tuesday until nightfall. She was there until 1pm on Wednesday. She also has four kids to take care of, had to prep alone for a hurricane, and the only reason she didn't come the last day was due to said hurricane.... Not to mention she has a 45 minute commute, each way, to the hospital.\n\nI don't get what more OP wants from this woman (or the oldest daughter since it is clear that he expects her to babysit while his wife keeps him company 24/7.)",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2279,
      "content": "Yeah, YTA man.  You’re in stable condition, she’s been there a lot earlier this week, she has a 5 yr old and you both have a 1 year old plus a hurricane that she has to worry about.  I’m sorry about your accident, but she didn’t cause it and it sounds like she’s doing the best she can - you’re being an AH dude.  You need to apologize to her.",
      "id": 158,
      "comments": [
        {
          "score": 506,
          "content": "For real. My brother died in the hospital this week. His wife was not there every day, there's no way she would have slept there.\n\nNewsflash: it wasn't for a lack of love, she was there as much as she could be. But she still had to *work*, and they had 2 children who still needed their mom.\n\nOP should allow himself to work through his feelings (the hospital is a lonely and traumatizing place!) but acknowledge how privileged he is to be able to type this and get to go home.",
          "id": 159,
          "comments": [
            {
              "score": 117,
              "content": "I'm so sorry for your loss.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "I am a total internet stranger but I am so sorry for your loss. ❤️ Thank you for still being able to make such a thoughtful and compassionate comment when it would have been so easy to just call OP something insulting and move on.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I’m so sorry for your loss. Thank you for being able and willing to use it as an example of realistic expectations for OP. I don’t know that I’d be able to.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I’m sorry for your loss ❤️",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I am so sorry for your loss",
              "id": 164,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2042,
      "content": "Are you freaking serious? You drive one of the most irresponsible vehicles and get in a wreck and you’re all over your wife who is now responsible for alllllll of the things single-handedly? No. You owe her a major apology. YTA. I hope you feel better but whining about her taking care of the family when there’s nothing helpful at the hospital she can do is wrong.",
      "id": 165,
      "comments": [
        {
          "score": 804,
          "content": "Why do I worry OP’s wife was doing all the things single-handedly before, too …?",
          "id": 166,
          "comments": [
            {
              "score": 589,
              "content": "Because op is basing his opinion of how easy it should be for his wife to hang with him at the hospital all day off of his own experience running the household. \n\n“What could she possibly need to be at home for? I barely do anything, and yet the kids are fine, diapers are changed, meals appear, and the house stays clean. It’s easy!”",
              "id": 167,
              "comments": [
                {
                  "score": 195,
                  "content": "The magic coffee table clears itself & the spot on the floor by his bed where he dumps his clothes always disappears them away",
                  "id": 168,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Bro thinks he lives in the Encanto house",
                      "id": 169,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Yeah, this is the inference I was getting as well... His world revolves around himself",
                  "id": 170,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Absolutely, when I delivered my 4th kid (with complications) I told my husband to go home so he could manage the other three. I felt that was more important and it gave me comfort knowing they at least had their dad to take care of them for part of the day. OP must think it’s more important for his wife to sit there at the hospital spoon feeding him than the one year old they have at home! OP YTA",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Because you just know he isn’t the type to pull his weight.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Honestly, she most likely was. If he’s going to complain about something like this on Reddit, God knows what else he bitches about and doesn’t help with in real life.",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1436,
      "content": "YTA.\n\nYour wife is currently trying to visit you, take care of four children, and prep the house for a hurricane. And you’re upset that she’s not visiting you for long enough, while also caring for FOUR CHILDREN and preparing for a literal HURRICANE? Yeah, it’s not ideal for you but unless you’ve managed to perfect human cloning, she’s doing all she can.",
      "id": 174,
      "comments": [
        {
          "score": 443,
          "content": "especially when one of the children is 1 YEAR OLD.",
          "id": 175,
          "comments": [
            {
              "score": 301,
              "content": "Exactly! Three kids ten years old and under, and he somehow expects her to…leave them with another minor child so she can watch him sleep all day?",
              "id": 176,
              "comments": [
                {
                  "score": 20,
                  "content": "Man some people are so blinded by their own selfishness it's sick! I hope this is a wake up call for him.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My husband and I can’t even take a dump without one of our 3 kids needing our attention in some way but OP has free time to ride his bike around before a hurricane, then still expects her to be at his beck and call. 1-5 year old are brutal when it comes to needs and supervision; my hobbies took a back seat for a while just trying to get though. And non of my hobbies carried a high risk of injury.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Which also means she only gave birth a year ago!! She must be so fucking exhausted.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": "Like what does he want? Her to die driving in a hurricane so she can be with him? No! \nYTA",
          "id": 180,
          "comments": [
            {
              "score": 166,
              "content": "Right? It’s like she has to prove her love for him by neglecting their children and endangering her life, when he’s the one riding a motorcycle with young kids at home.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "I say the wife has 5 children - one of whom is a whiny chronological adult getting cared for by a team of professionals in a medical facility during a hurricane.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}