{
  "post content": "My sister [F 13] wants to go with me [F 15] to the library every Monday. I don't want her to come with me or to be there at all. \n\nEvery Monday after school I walk 20 minutes to the library and stay there for 2 hours. I usually work on homework then I write a story I've been working on. It peaceful and quiet there and I love it. \n\nNow my sister says that it's unfair that I go to the library and she has to ride the bus home. She wants to come with me and hang out with me for the whole 2 hours until our girl scouts meeting across the street at 5:30. I really don't think it's a good idea nor do I actually want here there.\n\nMy argument: she goes to a different school on the other side of town. She'd have to walk to the library by herself which I don't think my mom would like. If for some reason my mother allows it then there's no reason that she couldn't walk to the library an other day of the week when I'm not there trying to finish my homework. \n\nI always have people around me all the time because I'm involved in so many activities. Marching band, the play, youth group, girl scouts, ect. Sometimes it's nice to go to the library and not have to talk to anyone or pay attention to what they're doing. The library is like an escape for me. That's why I don't want her there. I'd have to talk to her if she got bored and I'd have to keep an eye on her. \n\nSister's argument: I just want to spend more time with my sister. She's always gone and doing stuff so what'll it hurt if I see her for 2 more extra hours? She never wants to be around me and she's never at home anymore. All I want is to go there and spend some time with her. I already went with her once for the last hour she was there and I didn't talk to her or disrupt her and she still got mad. \n\nAnd if I want to go to the library then I should be allowed to. I hardly get any service at home and we don't have high speed internet like the library does. Without my sister there I get creeped out by everyone there so I don't want to go by myself. I want to go with someone I know so I don't feel uncomfortable. \n\nMe again: so I really don't want her to go with me but my mother is starting to think that it'd be a good idea. Am I just being an A-hole or am I right?",
  "id": 1,
  "comments": [
    {
      "score": 15,
      "content": "NAH.\n\nShe should be allowed to go to the library if she can do it without bothering you there. She should not be allowed to force you to hang out with her when you need alone time. If she doesn't want to go to the library and be by herself, she shouldn't go to the library. You're entitled to be alone when you need it.\n\nBut, you should also be considerate of the fact that she'd like to spend more time with you, and think about if there's a way to make that happen that'll make both of you happy. Because that's a nice thing. And maybe you'd be happier overall if you cut back a bit on all your activities that are filling your schedule so full. (Or you wouldn't be, I don't know, it's just a suggestion.)",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA You’re entitled to have your own activities, personal space, and quiet time.",
      "id": 3,
      "comments": [
        {
          "score": 4,
          "content": "[removed]",
          "id": 4,
          "comments": [
            {
              "score": 4,
              "content": "What about for not respecting her sisters space? Not an asshole, but not considerate either.",
              "id": 5,
              "comments": [
                {
                  "score": 2,
                  "content": "[removed]",
                  "id": 6,
                  "comments": [
                    {
                      "score": 1,
                      "content": "My rating is for the mother be TA. The mother is responsible for both her children and should recognise the older sister needs space.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "She was told no. Doesn’t matter that she’s thirteen, the fifteen year old has said no. That’s the bed that’s been made.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NAH. There is nothing wrong with wanting a little time to yourself. Nor is your sister wrong to want to spend time with you. You need to sit down privately with you mom and discuss this just like you did here: calmly and clearly, letting her know *why* you would like the time to yourself. Be prepared to compromise sometimes. The more mature you act about it, the more your mother will take your concerns seriously.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "Seems like your sister is willing to put all the extra effort just to spend more time with you, whereas you want some peace and quiet in order to avoid doing nearly as much.\n\nThis makes me inclined to say YTA, but I honestly don't know how much you need your library time for study, or how distracting your sister can be, so I might be wrong.\n\nIf it were me, I'd choose my sister: so many ugly AITA stories begin with family members being neglectful towards each other.",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "Op is not an asshole for wanting time away from her sister. They are both in the same girl-scout group. So the sister can wait two hours to see the sister.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "NTA but I found out that my sister was really lonely when I went out doing things as a teenager. Spend time with your sister. You’ll regret it most likely",
      "id": 12,
      "comments": [
        {
          "score": 1,
          "content": "I regret not doing more things in HS vs hanging out with my sister. Results may vary.",
          "id": 13,
          "comments": [
            {
              "score": 1,
              "content": "However if you didn’t do that you may have regretted it",
              "id": 14,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Have you explained all of this to your sister?",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "I tried but she just got upset because she thought I was trying to avoid her even more",
          "id": 16,
          "comments": [
            {
              "score": 1,
              "content": "Even more? Why not spend time with her sometime?",
              "id": 17,
              "comments": [
                {
                  "score": 0,
                  "content": "Well she's convinced that I hate her and that's why I joined so many thing when the truth is that they just seemed like fun things to do. I always talk with her during dinner and we play the xbox together quite often so I thought that that would help make up for all the time I wasn't spending with her. I guess that isn't the case but now she's even more convinced that I hate her. Between homework, practices and school I don't really have any more time to spend with her tho",
                  "id": 18,
                  "comments": [
                    {
                      "score": 1,
                      "content": "You need to talk to her.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Esh, why not pick a night, like Monday or something and have one night be sister time. Movies or facemasks or doing each others makeup. It could be fun and get her off your back the rest of the week.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy sister [F 13] wants to go with me [F 15] to the library every Monday. I don't want her to come with me or to be there at all. \n\nEvery Monday after school I walk 20 minutes to the library and stay there for 2 hours. I usually work on homework then I write a story I've been working on. It peaceful and quiet there and I love it. \n\nNow my sister says that it's unfair that I go to the library and she has to ride the bus home. She wants to come with me and hang out with me for the whole 2 hours until our girl scouts meeting across the street at 5:30. I really don't think it's a good idea nor do I actually want here there.\n\nMy argument: she goes to a different school on the other side of town. She'd have to walk to the library by herself which I don't think my mom would like. If for some reason my mother allows it then there's no reason that she couldn't walk to the library an other day of the week when I'm not there trying to finish my homework. \n\nI always have people around me all the time because I'm involved in so many activities. Marching band, the play, youth group, girl scouts, ect. Sometimes it's nice to go to the library and not have to talk to anyone or pay attention to what they're doing. The library is like an escape for me. That's why I don't want her there. I'd have to talk to her if she got bored and I'd have to keep an eye on her. \n\nSister's argument: I just want to spend more time with my sister. She's always gone and doing stuff so what'll it hurt if I see her for 2 more extra hours? She never wants to be around me and she's never at home anymore. All I want is to go there and spend some time with her. I already went with her once for the last hour she was there and I didn't talk to her or disrupt her and she still got mad. \n\nAnd if I want to go to the library then I should be allowed to. I hardly get any service at home and we don't have high speed internet like the library does. Without my sister there I get creeped out by everyone there so I don't want to go by myself. I want to go with someone I know so I don't feel uncomfortable. \n\nMe again: so I really don't want her to go with me but my mother is starting to think that it'd be a good idea. Am I just being an A-hole or am I right?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH everyone needs time to themselves but you should also try to spend more time with your sister. you'll regret it if you don't",
      "id": 23,
      "comments": [],
      "relation": "Support"
    }
  ]
}