{
  "post content": "Background: picture a long narrow townhome with a combined living / dining, then stairs and a doorway to a kitchen behind. I have a rectangular dining table that can seat 6, but in the space seats 4; 2 chairs on each long side. If any chair is moved to the ends / head of the table it either blocks the stairs or the doorway to the kitchen. \n\nFor whatever reason, even though it’s just myself (35F) and my children (13m “mike”) and (8f) mike always moves a chair to the end blocking the kitchen door. I have asked repeatedly he not do this. I can’t get dinner to the table (we use this table for all our meals) without squishing myself against a the wall like a contortionist or waiting for him to get up and move. Repeat this 3x a meal at least 3x a day and you get the point of how annoying this is. Note: for large meals, I turn the table and get the extra chairs from the attic and for the 2-3x a month this happens it’s no big deal. It’s the every day occurrence that’s an issue. \n\nWhat’s worse is my mother, grandma (old, F), does the Same. Exact. Thing. She comes over at least 4x a week for dinner. She is larger than mike, so squishing past is not an option, and I’m left to crawl through the pass through from the stair landing into the kitchen because that takes less time than asking her to move and waiting for her to dramatically grunt and get up and push her chair in. \n\nHere’s the question: last night, after taking care of 2 sick kids all week, I got their illness. But worse. I got hit with a 104.6 fever and fell asleep on the couch. At about 2am I woke up dying of thirst and while barely able to stand, I tried to make my way in the dark to the kitchen for water. I fell over the stupid chair, which was at the end of the table, again. I have literally begged every day for the past 3 years to stop putting the chair there. I had enough. \n\nI got out my screw gun. I screwed the legs of all 4 chairs to the coordinating legs of the table so they cannot be moved from the long sides of the table. It is now like a fixed fast food table with attached seats. Mike woke up and called grandma complaining and the two of them are telling me I’m crazy and this is uncalled for and I am overreacting because I’m sick. They are also mad that I hid the screw gun and mike can’t move “his chair where he wants” I responded that it’s my house, my table and chairs (which are old and since I’m in construction I could fix the holes easily if I so chose). AITA?\n\nETA: I keep being asked / told to get new furniture. 1. The table / chairs DO fit the space if the chairs stay on the long sides of the table. It’s a 6’ table. Each person gets 3’ of space if they just leave the chair alone. 2. Sitting in front of the door gives the worst “view” of all 4 sides, looking out the window at the roof of my 15 year old car and neighbors siding, so it’s not a preference of some gorgeous picturesque landscape either.\n\nEdit: the word “end” to “side” because maybe that’s why there was confusion over me needing a new table?",
  "id": 1,
  "comments": [
    {
      "score": 4577,
      "content": "NTA,\n\nIt’s a simple, pretty reasonable rule that you had to endure being breached for 3. Whole. Years. It’s actually incredibly rude to have your chair blocking the damn door. I would have been PISSED.",
      "id": 2,
      "comments": [
        {
          "score": 1753,
          "content": "The tripping over it and falling down while sick and in need of water was my tipping point. I always say to both of them “if you insist on sitting on the short side of the table, can you at least block the stairs and not the kitchen door?” So when grandma comes, Mike will sit on the long side, but neither will sit on the short side that doesn’t block the kitchen door. I don’t get it.",
          "id": 3,
          "comments": [
            {
              "score": 1288,
              "content": "This really sounds like a “head of the table/ assert dominance” kind of thing. If they move the chair insist on sitting there yourself. Stop letting they walk all over you.",
              "id": 4,
              "comments": [
                {
                  "score": 977,
                  "content": "And either one can to be “head of the table” on the other end of the table!!!!! It’s literally the fact that they insist on sitting in front of the kitchen door that really burns my toast.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 284,
                      "content": "Take the kitchen door off too.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Shoulda started kicking the door open into their backs. Stop opening the door and trying to be nice to the person sitting there",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "I'd have \"accidentally\" bumped into them and spilled hot food on them for being in the way. Nothing hot enough to blister but enough to be uncomfortable for a few hours. Maybe they'll learn to stay out of the way after a few times.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Well if you sit with your back towards the kitchen door and face in the other direction you won't see the person working in there to get your meals ready. And if you don't see them you won't feel any obligation to help. If you sit on the other side of the table you look directly into the kitchen and that would mean you have to have at least the decency to offer to help 😜",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "OP NTA but I also had an issue with my kids and chairs. You might like my solution. When I brought a new dining set I brought one with 2 benches instead, I also brought two normal dining chairs for the ends where hubby and I sit because I have the space but maybe this solution might work for you,.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 157,
                  "content": "Yep- this is a power move- even if unconscious. And one I find irritating. I am a single, middle aged woman who finally owns her own home.  AND NEARLY EVERY MAN that comes into my home, takes the \"head of the table\" chair. My dad when he is a guest, the dude that came over with my paperwork for my re-finance during COVID, whoever. I started putting the \"spare\" folding chair in that spot, it is smaller, does not \"go\" with the table, etc- and I FOLD IT UP and put it away when an unknown dude is coming into my home. I don't even prefer to sit in that spot now- after a few years.  But FFS, it is NOT YOUR HOUSE- do not assume just cause you are a man that it is your rightful spot. IDK why it bugs me- but it super does. SO...there is no chair there most of the time.\n\nOP- one of my sides has a BENCH- maybe if your son and mom cannot GROW UP and respect a very reasonable request- replace the chairs with long benches ;)!",
                  "id": 11,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Go to a garage sale and buy an old chair. Paint it bright pink and purple. Maybe some sparkles. Put it at the head of the table when a guy like that comes over. Watch him freeze, then his head explode.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I totally get this,  my BIL would always sit at the \"head\" of the table at MY house with my husband at the other end.    I had to finally forcefully say I sit there.    (MY house).\n\n&#x200B;\n\nNTA",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Benches are a great idea!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I think this is a great idea",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 297,
              "content": "[removed]",
              "id": 16,
              "comments": [
                {
                  "score": 211,
                  "content": "This is why I LOVE this forum. I’ve been told to buy new furniture, to not overreact at a 13 year olds absentmindedness, and many people saying I’m NTA. \n\nBut your description has me laughing so hard that if my fever hasn’t already liquified my internal organs, my laughter now has done so. \n\nI mean, I do think 3 years of asking and already refinishing the floor in that spot because of the wear pattern from one chair being moved from the side to the end and back approx 3,285 times was enough “asking nicely”",
                  "id": 17,
                  "comments": [
                    {
                      "score": 120,
                      "content": "There is such a thing as being too nice. You don't have to shout and rage and threaten, but you do need to put your foot down. Especially with teenagers, it seems they're a lot like some dog breeds where they like to see how far they can go.\n\n\"I asked you not to and you did it anyway\" isn't \"absentmindedness\". It is plain disrespectful, especially if happens daily for years. Absentmindedness you will have to live with, but disrespect needs to be ironed out immediately.\n\nDisrespectful teens grow up to be asshole adults. \n\nAnd doors are not that expensive and not that hard to install. A fire ax and a hockey mask are also not budget breakers. Just saying.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 73,
                      "content": "It's time to tell your mother you will block her number if she keeps calling to pester you about this subject. Also, tell her she's not welcome to your table until she learns some manners.\n\nRegarding your son, if someday you decide to sunscreen the chairs, maybe you should go back to old times and tell him he will have to write 100 times: \"I will not move the chair\" every time you have to ask permission to go to the kitchen. He losses his access to electronics until he writes it. I bet he will learn quickly.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "The problem is you kept asking and not following through, instead making yourself work around.\n\nFirst, I think your solution is brilliant and well-deserved, so NTA.\nBut I also think you should explore whether it's a trait in other areas of your life to make a request but then let whatever happen. \nHad it been me, son would have been SICK of me saying, every single time, \"the chair doesn't go there,\" anytime he moved it. I would have refused to serve dinner until people and chairs were back in appropriate places. I would have escalated to removing privileges if I got push back. 13 year olds aren't absentminded about things they want to remember, make the impact on him enough that it becomes important. \n\nSeeing as it let is slide and just brushed past him, or had him get up (but he sat down in same spot, right?), it's almost as if you trained them to ignore you. It's worth a look to see if you let other people walk on you in other areas too. \n\nYou're not overreacting, but you aren't giving yourself enough power from the start.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "They could sit on the floor! My Grandma wouldn't let anyone who disrespected her furniture  sit on it. You either followed her rules or sat on the floor.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Lol the imagery in this comment is great. \n\nI felt like I was there watching your fictional OP losing her shit. \n\n(I stayed off to the side and didn't block any doorways in my imagined scene out of respect for OP, btw)",
                  "id": 22,
                  "comments": [
                    {
                      "score": 38,
                      "content": "That’s why I was laughing so hard. I also do have a hockey mask! I’d have to substitute a chainsaw for an ax, because I don’t have an ax. I’d use my electric chainsaw instead of the gas powered one to not have fumes in the house for safety reasons. \n\nMeanwhile I just muttered some words to myself and got out the screw gun.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "🏆",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "\"and THAT'S why you don't leave the chair in front of the door\"",
                  "id": 25,
                  "comments": [
                    {
                      "score": 5,
                      "content": "\"this man would still have his arm, if only someone hadn't moved the chair!\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "This has to be the best comment I will see all day.  Thanks for the laugh",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 56,
              "content": "If for some reason they don't get the fucking idea and the chair gets moved back, I would serve dinner one more time and squeeze past them but a little less carefully than in the past. Perhaps drop some food on them. Perhaps a chilled liquid. Or a sticky sauce. And make them clean up too.",
              "id": 28,
              "comments": [
                {
                  "score": 64,
                  "content": "Gosh no. I can’t get them to move a chair back and grandmas still calling me on the phone telling me to give Mike the screw gun. \n\nObviously I’m such a doormat I don’t even want to think of what it will entail to have them clean up a mess I caused if I can’t get them to put back a chair I didn’t move. Grandma would probably endorse Mike going to school covered in BBQ sauce to teach me a lesson.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Perhaps a pitcher of ice water then? Easy to clean up, yet unpleasant to get spilled on them when they cause you to trip by being in the way. Also cheap and not wasteful. Like, it's the natural consequence of their actions. \n\nDoes anyone else help with dinner and find this problematic? I am really concerned for you that the family is so disregarding of your very reasonable request. Is this common in your house?",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "Grandma would be banned from my house at this point. Maybe a temporary ban, if she can pull her head out of her butt and apologize, but a ban nonetheless. What she's doing right now is teaching your son that it's ok to disrespect you, in your own home, about a perfectly reasonable request. She is actively undermining your parenting. This is absolutely unacceptable, especially because your son is at an age where he is already naturally prone to not wanting to listen to his parents anymore. And she's basically telling him that he doesn't have to listen to you. Grandma needs to be out of your son's life for a bit, because she is teaching him to be a rude and entitled AH and it is going to take some serious work to undo all the damage she's doing to his behavior. Grandma is not a good influence. You are the parent, put your foot down and don't let interfering relatives spoil your son.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Grandma needs to stop coming to dinner until she can respect your damn house rules.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Tell 'Grandma' that she is GUEST in your home, not a resident, who can be denied entrance at any given time if she doesn't straighten the hell up!!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Maybe Grandma can keep her mouth shut about how you run your household and parent your kids? Because you are, you know, the PARENT? And she's NOT?\n\nMike moves the food to the table from now on and not you and Grandma stops interfering with your business of parenting. And if she can't, put her in a time out. Those telephones can be put down you know. And front doors don't need to open.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "She’s making calls to have the chair unscrewed from the table??? I think Grandma has a few screws loose.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "I’m just astounded OP has been bothering to squeeze past. I’d be standing there loudly saying OKAY UP YA GET MOVE IT MOVE IT IF YOU DON’T WANT TO JUMP UP THEN SIT WHERE YOU SHOULD GREAT NOW YOU’RE FINALLY UP MOVE YOUR DAMN CHAIR TO WHERE IT SHOULD BE every. single. time. And grounding the kid from his devices for the night any time he doesn’t jump his ass out of the chair before I’ve had to even ask when I open the door. This whole situation is ridiculous, OP is putting up with way more rudeness than is acceptable.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Honey the issue is that you are not willing to control your mother and your 13yo imitates her. I think it is time to make some hard choices in your life. I read a lot of your comments. You said your mother's game is to step on your choices or guides. I would personally tell her \"you are not welcome in this house until you learn to respect me\". And if she get 2 penalties door would close again. And when she would back down (because you have her grand kids) I would say to her \"see this wasn't too hard\". You have a fear of conflict, you are afraid to yell or mess with the food because your mother will take over and would not clean? I would NEVER allow that person in my house. And it is not just about you. You are creating a man that no person would want as a partner that thinks it is his way or the highway",
              "id": 37,
              "comments": [
                {
                  "score": 2,
                  "content": "Extra points for \"see this wasn't too hard\".",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "After tripping over shoes for almost 10 years that my family dump in the hall instead of putting in the closet, I did something similar. Put them all in a garbage bag and hid them. Can’t put your damned shoes away? Leave them for me to trip over at 10 pm on the way to the bathroom? Easy fix. No shoes.",
              "id": 39,
              "comments": [
                {
                  "score": 5,
                  "content": "I bet you asked and asked and asked too…….\n\nDon’t post that question here. You might be told to buy a different house / build an addition with built in hallway shoe storage that meets the needs of your family. Lol.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yep! You’re right I asked and asked. And you’re right. The hate’s about to pile on, I’m sure!",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">The tripping over it and falling down while sick and in need of water was my tipping point.\n\nI felt the urge to smash your chair to pieces at this point in your story. Then I thought about being sick and weak, so screwing the chairs to the table became more reasonable lol.",
              "id": 42,
              "comments": [
                {
                  "score": 7,
                  "content": "When screwed to the table I can still use the chair to WFH. Smashed and I’d be sitting on splinters to work, so I am glad that even in my high fever stupor I solved the problem in a still functional fashion. Even though I might be the a word.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Imo, the only part in which you were the AH is by not setting your boundaries 3 years ago, before you snapped. By allowing yourself to be pushed around, no matter your reasoning, you allowed an unstable and unhealthy status-quo to be set.\n\nThe only reason you are getting flak now is due to you challenging the status-quo. Stand your ground.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If anyone complains further throw away the dining set and serve them on the floor, ungrateful brats should be thanking you for cooking and serving!",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Nta. I burned my kitchen table in the firepit because it ended up being a dumping place for everyone's crap.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "So out of curiosity, could this chair issue be a fire hazard?   Personally I would be accidently dropping food on the person in the offending chair ever meal and just act like, \"oh, no need to get mad, it was a tight squeeze\".",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I think your only mistake was trying to compromise. \n\nTell them they're inconsiderate because their behavior litrrally harmed you, and instead of taking responsibility, they complain. \n\nThey make/serve their own dinner if *anyone* is sitting there. Do not back down. Do not reneg if they move. Anyone sits there? Do it yourself. You give them a week of playing contortionist and theyll stop fuckin doing it. Icing on the cake? You sit in the seat blocking the door so they can deal with it like you had to.\n\nNTA, but stand up for yourself sooner rather than later going forward.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yeah, after a month of people not doing it ALL the chairs would have been in the attic and you can stand to eat for a month.  Chairs would be brought back with the rule that if they can't push their damn chair in, they're going back to the attic.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Benches along the long sides were an option, too.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1119,
      "content": "Hahaha so NTA; this kind of inventive passive-aggression is just amusing. Moving a chair around is not a human right. Sit in it.",
      "id": 51,
      "comments": [
        {
          "score": 696,
          "content": "Thank you for the laugh!!!!! I’m gonna go to grandmas house and push her couch in front of her bathroom door and assert my “human right” to seating location selecting.",
          "id": 52,
          "comments": [
            {
              "score": 135,
              "content": "Get a bunch of doll chairs and use the drill to attach them to places that would annoy your mom and son.\n\nOn the TV stand blocking the playstation on/off button, in front of son's phone charger when he leaves it plugged into the wall outlet, on son's desk right in front of the keyboard, a whole row of them on the part of the table that's usable when the chair is moved. \n\nActually, installing a curb on the ends of the table might help, too. Make the surface at the end impossible to use. Maybe build a small dish or glasses cupboard or a receptacle for storing salt and pepper or other seasonings, napkins, or something so that it serves a function and most importantly doesn't annoy YOU.",
              "id": 53,
              "comments": [
                {
                  "score": 116,
                  "content": "Can I screw chairs to he doorframes? Leave enough space that she can belly crawl under to get to her bedroom?",
                  "id": 54,
                  "comments": [
                    {
                      "score": 55,
                      "content": "You know a lot more about screwing chairs onto stuff than I do (nobody has ever accused me of being handy) so you're the expert here, not me :D\n\nIt sounds like you have a pretty good idea of *exactly* how to screw chairs onto your mom's doorframes and I sincerely hope that you do and update all of us after.\n\nAnd maybe publish a wikiHow article about screwing chairs onto other things because you will be the internet's foremost expert on the subject by that point.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Exactly this.    NTA \n\nThis is YOUR house.  Make it clear it’s not a democracy, it’s a dictatorship \n\nGrandma and 13 year old DON’T  GET A VOTE   Especially on a safety/access issue",
          "id": 56,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 694,
      "content": "NTA. They are just mad because you managed to screw them out of their annoying habit.",
      "id": 57,
      "comments": [
        {
          "score": 149,
          "content": "Great pun!",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "Nailed it!",
          "id": 59,
          "comments": [
            {
              "score": 25,
              "content": "nah man he used screws",
              "id": 60,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 570,
      "content": "NTA\n\nYour mom is bolstering your son's entitlement. I think you should have a talk with her. They are YOUR kids, in YOUR home, not hers. While it might seem trivial to some, it is disrespectful to you to treat you as if you're a guest in your own home. I noticed you didn't disclose her age, because you have some manners. I have no idea where you got them from, because your mother clearly has none.",
      "id": 61,
      "comments": [
        {
          "score": 431,
          "content": "I didn’t want to post too much to sway the vote, but you are 100% correct. I learned about the importance of boundaries after being raised by someone who makes it a sporting event to treat boundaries as obstacles to smash into obliteration for fun. \n\nIt is almost a game for the two of them in a “let’s see how mad she gets if we sit in the doorway again” kind of way.",
          "id": 62,
          "comments": [
            {
              "score": 206,
              "content": "In that case, let them play ther game. They can get their own food from the kitchen. No more serving, everyone helps themself. And I love the idea of another redditor to block the door yourself, when they are in the kitchen 😂",
              "id": 63,
              "comments": [
                {
                  "score": 116,
                  "content": "Or... carry big pitchers of nice icy cold drinks through from the kitchen, and whatever happens happens. I'm sure they'd understand the value of keeping that route clear quite easily after that!",
                  "id": 64,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I love this",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "At 13 OP’s son is old enough to be making and serving dinner once a week as a reasonable expectation.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "Can I ask why you subject yourself to having her over for dinner so often then?  Or at the very least advise you try to make some space between you if possible, she is clearly undermining your parenting.",
              "id": 67,
              "comments": [
                {
                  "score": 28,
                  "content": "The kids are really close to her. It would end up hurting them more to cut her out of their lives than for me to just screw the chairs to the table.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 136,
                      "content": "> I learned about the importance of boundaries after being raised by someone who makes it a sporting event to treat boundaries as obstacles to smash into obliteration for fun.\n\nI wasn't really referring to the table situation but this.  She is teaching your kids to act this way, is that what you want for them?  Part of being a parent is protecting kids from bad influences, even if the bad influence is grandma.  It doesn't sound like she respects you in your home and it sounds like she is teaching your kids to do the same, but I am only going off what you have written. \n OBVIOUSLY you know your situation better than I do, just my two cents.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "It's hurting them to be taught that they can disregard the needs and requests of those serving them if they feel entitled to do so. They're treating you like a server at a Waffle House. It's an alarming level of disrespect. It's not like it's a battle of preference, you're waiting on them and they're intentionally making it harder on you. They're treating you like Cinderella and it's unacceptable behavior. Your kids are learning to see those who serve them as beneath them, and learning to accept their needs being steamrolled by others too.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 42,
                      "content": "She's actually really hurting your kids by teaching them to disrespect you this way. I really think you're underestimating the negative impact this is going to have on your childrens' lives, being raised that they have to swallow being treated that way or that they can treat others that way with impunity. You might not realize how bad her behavior is because you're used to it, but it is not okay.",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 31,
                      "content": "She is currently hurting your kids. I'm not sure if you realize that long term effects of bad parenting, enabling and spoiling kids are adults who can't function in a job situation and won't have a happy healthy partnership and are more likely to get divorced which in turn will affect any possible grandchildren. \nPlease don't just go by the present, consider your children's future.\n\nAnd seeing a parent powerless against bullying will also increase the likelihood of anxiety in your kids because they think you are weak and they will feel unsafe.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "She's teaching your son to mess with you because she thinks it's funny. I don't know if I agree with you here.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "It will end up hurting them EVEN MORE all their life if granny continures to enable such shitty behavior....",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": ">The kids are really close to her. It would end up hurting them more to cut her out of their lives\n\nYour job as a parent is to protect them, not make them feel good.  Grandma (your mother?) is toxic and is teaching your children bad habits.  She is actively harming them and turning your son into an entitled little shit.  \n\nIt's better for your children top be sad now and grow up to be good, responsible adults than to keep seeing Grandma and grow up to be selfish, entitled assholes.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "My dad is like this. We strongly suspect it’s covert narcissism but we will never know because narcissism is rarely actually diagnosed, for obvious reasons. \n\nIf he told us to stop doing something, unquestioning obedience was expected. If we told him to stop doing something, he would make sure to do it every single day/time from that moment on, deliberately. Just because you told him not to. Even if it was actually more work for him. \n\nHe left the toilet seat up once, was told to remember to put it down, and from then on it was deliberately left up every time. He used to sometimes do a sharp turn into the driveway and leave the wheels cranked. I asked him to just pull up an additional two feet and a straighten them so the next person to drive doesn’t accidentally reverse wonky. From that point on, me made sure to crank it every time. I once witnessed him come in straight as an arrow, stop, and *then* crank them *just* to leave them that way.\n\nThat was the precise moment my exasperation and anger turned to pitying contempt. How much of his daily conscious thought is dedicated to maintaining *all* of these petty routines? How many of his waking hours does he spend ruminating on how to assert his perceived dominance? How much of his life’s energy does he spend guarding his delicate ego to try and maintain whatever uncontested alpha male perception he feels is expected of him?\n\nIt’s just… pathetic.",
              "id": 76,
              "comments": [
                {
                  "score": 36,
                  "content": "Wow. You put into words what I was struggling to describe perfectly. \n\nYes. This is they type of behavior I deal with all the time. Like the things are examples where it takes MORE effort to do them than to not, but probably to anyone you describe it to would think that you are complaining over nothing. \n\nKinda like this post. It’s not easier to buy a new table than to not move a chair, but the idea that they not move a chair (to some people) is silly.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 15,
                      "content": "> but probably to anyone you describe it to would think that you are complaining over nothing.\n\nThat’s why so many people in relationships with these individuals have such a tough time identifying it, talking about it, in some cases leaving a spouse or cutting off a parent, etc",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "That’s the vibe I got from your post- clearly they’re doing this to annoy you. Bad enough that your son does it, but your mom is just a total AH. Love the way you solved the problem. \n\nIf you son manages to unscrew the chairs you should serve your own plate and sit at the head of the table yourself and let them scramble to get their own food!\n\nNTA",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "YOU CAN DO THIS. You don't want to raise a man who disregards other people's wishes as a power move.\nI believe in you! (Also I personally would have just made the chairs disappear for awhile but I'm an ahole in general",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Honestly, I'm incredibly impressed with your restraint. I would've \"accidentally\" dropped food and drink on them over and over again any time they were in the way. \n\nNTA but I sure would've been.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My anger would have been no more chairs. Like you can sit on the floor or stand.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Why do you allow her over if she’s such an arsehole and causing your kid to disrespect you? NTA but granny needs a timeout.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 277,
      "content": "NTA. I'm honestly surprised at all the replies telling you to get rid of your table. The table isn't the problem. The problem is that a grown ass adult (grandmother) and a 13yo have been blatantly ignoring you for three years (gee, wonder where the teenager gets it from). If they can't respect a very simple request, especially while you're trying to do something for them (feed them) then they deserve what they get. They probably should be thankful they get to sit in a chair at all after three years.",
      "id": 84,
      "comments": [
        {
          "score": 178,
          "content": "I was thinking I was in the twilight zone for a minute. But the people who suggested new furniture were mostly doing is politely so????\n\nWas I not clear in my post? The table and chairs are not the issue if they are left where I put them. They are only an issue because two people, who are old enough to know better keep moving them. \n\nI can also go to someone’s house and move their chairs in the middle of doorways and insist they buy new furniture, but that really not the point or the question I was asking.",
          "id": 85,
          "comments": [
            {
              "score": 67,
              "content": "I 100% think it was pretty obvious from your post that the table does fit the space if it’s used in the way it’s set up to be used, so I also was not sure where those comments were coming from, lol. The only thing not clear in your post for me is what the chairs being screwed to the table means for getting in and out of seats. Is it just sliding in now? And if so, will they still accommodate your mother, who you said is bigger?\n\nYou’re significantly more patient than I am, though, that’s for sure. I probably would have bought heavy-ass benches 6 months into it, never mind 3 years!",
              "id": 86,
              "comments": [
                {
                  "score": 67,
                  "content": "Picture this: the table legs are on the outer 4 corners. I took the front legs of the chairs and screwed them to the appropriate corner legs. There is 25” if space between the two chairs to get in and out. It’s perhaps slightly uncomfortable because you can’t push the chairs in to lean on the back while eating, it’s more like a picnic bench at this point. And it’s more spacious than the commercial requirements for fast food bolted tables and chairs (I actually looked it up!!)\n\nGrandma is larger than Mike, but no so large she cannot get through to sit down. She’s not even of the size where anyone would say she’s “overweight” just larger in aspect of adult vs on-the-small side child who hasn’t hit puberty.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Get a sheet of plywood and screw it over the legs at the kitchen end of the table.  Probably easier to take on and off for when you do need it as well.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It's probably people projecting. I know my current house has a table that doesn't really fit the space it's in. It can happen. But honestly even if the table *was* a problem, a problem that can be fixed by people just not pulling around the chair to the one place there isn't room for a chair is a relatively minor problem to have.",
              "id": 89,
              "comments": [
                {
                  "score": 4,
                  "content": "I understand when this happens. My friend has a new sectional couch which is a bit smaller than her old one. And so her coffee table that used to fit in the middle nicely is now kinda tight, like shuffle awkwardly sideways tight. \n\nHer family and friends all awkwardly shuffle sideways. Or take off our shoes and kinda roll over the chaise seat side to the middle. \n\nNOT ONCE has anyone proceeded to move her coffee table in front of her hallway in protest and tell her to go buy a new one.\n\nETA: I’m in the US, the land of “we wear our dirty gross shoes at all times indoors no matter what” before there’s another location confusion. Today I learned kitchen doors are a thing throughout Europe.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Why do they keep insisting on doing so? Is there a reason they feel more comfortable at the end of the table? Have you asked them?",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 237,
      "content": "NTA. I may have taken the “guess you’re not getting food”’route.",
      "id": 92,
      "comments": [
        {
          "score": 130,
          "content": "Same. \"You're blocking the door again, leaving food in here, come serve yourself\" and just fix a plate for yourself and eat in the kitchen.\n\nRinse and repeat.",
          "id": 93,
          "comments": [
            {
              "score": 126,
              "content": "And when they get up to get food, sit down in that end chair & block the door.",
              "id": 94,
              "comments": [
                {
                  "score": 92,
                  "content": "Musical chairs - blocking the door edition? Hahahaha.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I’d have just gotten rid of the chairs lol",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 134,
      "content": "NTA .. what you screw and how you screw it is your own business 😎🍺",
      "id": 97,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 79,
      "content": "I feel like this should be on /r/pettyrevenge rather than AITA lol. Love it. Good for you.",
      "id": 98,
      "comments": [
        {
          "score": 3,
          "content": "[removed]",
          "id": 99,
          "comments": [
            {
              "score": 1,
              "content": "Necessity is mother of invention.\n\nMike's your kid, too.\n\nPlease update with his next move.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 57,
      "content": "NTA. Everything is yours and you were getting rid of a significant safety hazard. Maybe a compromise--not that you have to provide any--would be a hinge connecting a chair leg to a table leg so the chairs can pivot/swing for people to sit more easily without moving them to positions that would block the kitchen or stairs.",
      "id": 101,
      "comments": [
        {
          "score": 65,
          "content": "I missed the window of McDonald’s renovating their locations or at this point I’d go dumpster dive for that commercial welded swinging chair table thing.",
          "id": 102,
          "comments": [
            {
              "score": 19,
              "content": "Or get rid of the chairs and get benches instead!",
              "id": 103,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Or get a panel of plywood and attach it to the table end, so if someone does try to sit there, they cannot scoot the chair in.\n\nBonus idea that is probably completely off the rails... attach that panel via a hinge, so it can hang vertically or be brought out to the same level as the table, but would completely block the path to the kitchen, creating a \"bar\" like setting, where they are on the far side, and you, with no one else, is on the kitchen side. - Take that barrier idea to the extreme.",
              "id": 104,
              "comments": [
                {
                  "score": 33,
                  "content": "You are making me realize how ridiculous this situation is. \n\nPlywood on the ends would not solve the issue. \n\nIn my kitchen I have stools at the peninsula overhang. You know, the obvious space where stools go?\n\nGrandma takes a stool and sits on the END of the peninsula. Where the counter overhand is 1” past the cabinet. She sits sideways and leans on her elbow. And BLOCKS THE PATH between one end of the kitchen to the other. \n\nSo not only would a solid end table not solve the issue, but by default the kitchen has this fail safe measure to direct people where to sit and it has no impact on her whatsoever!",
                  "id": 105,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Do you see how much of a problem grandma is in your life? Do you see how much chaos, drama, and extra work she creates for you by simply stepping foot in your home. Do you find yourself thinking, wow I sure wish this woman behaved like a normal person so I don't have to deal with this shit all the time? Because if so I have good news for you: You can ban the betch from your house! This won't make her behave properly but you will not have to deal with it. Being a grandma is a privilege not a right. Having a relationship with grandma can happen at her house, no? Or the park? She can take the kids to Mackie ds like every grandma out there who does not have dinner with their grandkids 5 times a week. You in therapy? Not dissing you I love therapy.  You need it hard-core. You are ALLOWING these things to continue and therapy can show you how to stop doing that as much. NTA for this but you need to open your eyes to the situation and stop allowing this woman to step all over you. You have all the power here. Use it.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 43,
      "content": "Grandma is playing a nasty game of boundary stomping, and she's successfully taught your son how to do it too. Sorry, but you need to not have her in the house until they both drop it and get with the program. Do not engage with any reference to the table or screw gun, if they're engaging you in this mental warfare, they've already gotten the advantage.   \n\n\nNTA, but you're being an AH to yourself and your kids if you keep letting this kind of behaviour fly unchecked. 3 years is 3 years too many already.",
      "id": 107,
      "comments": [],
      "relation": "Support"
    }
  ]
}