{
  "post content": "Throwaway account since she uses Reddit. \n\nSo me (24M) and my girlfriend (23F) have been living together for almost 2 years. When we first moved out she bought us a brand new bed and bed frame because ours were both old. She also got us all this new expensive bedding which I admit is nice, but a little ridiculous she spent almost $700 on sheets, pillows and a duvet and stuff like that from a bedding store when you can get ones from Costco or Amazon for pretty cheap. But whatever it’s her money. Anyways, she bought us each 2 new pillows and I do use the memory foam one but I wanted to keep one of my old pillows from my parents place because it’s I really like it. My mom gave it to me when I was 10 and she had it in her bed for about 5 years before that. \n\nNow to the issue: \n\nMy girlfriend is really particular about the bed, she always has been. She likes it very clean and made a specific way every day. She changes the sheets twice a week and is always washing the mattress cover to make sure it’s as clean as can be. She also never lets either of us get into bed without a shower. I understand that though since I work in trades and get pretty dirty. So needless to say she thought my pillow was kind of gross. She likes to replace her pillows every few years and she can’t believe I have this pillow that’s 19 years old. She put up with it for a while but I came home from work on Friday and when I went to go to bed I noticed the pillow she got for me 2 years ago that I never opened was now on the bed in place of my old pillow. When I asked her about it she told me she got rid of it because she couldn’t handle sleeping next to my dirty pillow any more. I thought this was ridiculous and proceeded to yell at her for being childish. I do feel bad for yelling but I’m really upset she just threw away my pillow. I really don’t see the issue with my old pillow.\n\nSo AITA?\n\nEdit: grammar\n\nEDIT 2: I also want to say this item wasn’t sentimental to me or anything, my mother is still alive and well and I didn’t really tie the pillow to her in any way. It was just a comfortable pillow that I really liked and I haven’t been able to find anywhere that sells a pillow that has the same feel to it. Regardless of that though it was something I liked and I do t think it was right for her I just throw it away. I could have used it somewhere else…\n\nEdit 3: for those of you wondering, the pillow is not down, it’s some kind of fibre…. Not sure what kind\n\nEdit 4: so the comment section seems pretty torn about who is right or how we both suck. I still wasn’t sure what to do so I called my mom late last night and she reamed me out for owning a pillow that was so old. She’s backing up my girlfriend, I guess she feels the same way about pillows. She was under the impression I had gotten rid of it years ago when she got me new pillows to replace my old ones when I was 13. Here I thought I was just getting extra pillows all these years. She was pretty dumbfounded I still had this pillow and told me I shouldn’t have yelled at her or even made a big deal about any of this at all because my girlfriend is right. Even my mother knows how my girlfriend is about the bed since she noticed how clean my bed started to be when I started bringing my girlfriend around my parents house, and my mother noticed pretty quickly. She asked me why I care so much and I didn’t really have an answer other than “I liked it”. She, and the other YTA comments made me realize I was probably more in the wrong then my girlfriend. \n\nI can see now how she put up with it for an extended amount of time and I shouldn’t have been so stubborn. There was no real reason I wanted to keep this pillow. She would never throw away anything of mine with sentimental value, and I certainly wouldn’t compare this old pillow to my old favourite childhood stuffy I still have and very much treasure. There are reasons I’m not going to get into as to why she’s so particular and OCD about the bed. It doesn’t really extend to other areas of the house. She likes it clean obviously, but she’s not that particular about anything else but the bed so I don’t really think that calls for therapy or a professional. She’s made a lot of compromises for me so I can do this for her.",
  "id": 1,
  "comments": [
    {
      "score": 552,
      "content": "ESH. \n\n\nShe shouldn’t have thrown it out. \n\n\nBut, my dude, you should have. Pillows collect dead skin cells and oils, all sorts of bodily fluid, dust… yuck. Even if you cleaned it regularly, which I doubt, it would still need to be replaced after, let’s say four years.",
      "id": 2,
      "comments": [
        {
          "score": 108,
          "content": "That's what pillow cases are for..... Even then, we have stuff called washing machines.",
          "id": 3,
          "comments": [
            {
              "score": 125,
              "content": "I mean, I wash my pillows regularly but we replace them very three years because they do collect dust regardless. My husband has bad asthma so you can definitely tell after a while that they need to be replaced because it affects his breathing. I think people overestimate what a washing machine will do for a bag of fluff even if you run it on a sanitary cycle. Stuff gets stuck in there. The zipper covers help though. I guess I’m a little particular about dust and stuff but I think replacing pillows and washing them a lot seems to help. \n\nShe shouldn’t have thrown the pillow out but it’s pretty gross to hang on to a pillow for 20 years of you sleep on it every night.",
              "id": 4,
              "comments": [
                {
                  "score": 36,
                  "content": "I'm not even gonna lie, I've had one for over that. Lol, simply because i could mold it the way I wanted to sleep we'll. I actually just started using a new one about 9 months ago that I could get comfortable on and that's because I ordered it from Marriott. I LOVE their pillows. My old one would travel with me too, so I get OP. I do say it's kinda ESH, OP shouldn't have yelled but the GF shouldn't have thrown away his stuff either",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Do you not use allergy/dust covers underneath the pillow cases?",
                  "id": 6,
                  "comments": [
                    {
                      "score": 12,
                      "content": "We use the zipper covers and then a normal pillow case over that. The oils on your skin and scalp still go through the cotton even if you do this. Pillows are not meant to last forever.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -14,
          "content": "Ever heard of WASHING it? You do know that's a thing, right?",
          "id": 8,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -41,
          "content": "It's fine if you wash them, don't be all Howie Mandel about it.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 196,
      "content": "[deleted]",
      "id": 10,
      "comments": [
        {
          "score": 419,
          "content": "Throwing away your partner's possessions without asking is always a shitty thing to do.",
          "id": 11,
          "comments": [
            {
              "score": 23,
              "content": "Throwing something away that she knew he wanted to keep was a sign of lack of respect. Her wants and desires are way more important than this. This is a bad sign for a long term relationship.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -23,
              "content": "[deleted]",
              "id": 13,
              "comments": [
                {
                  "score": 55,
                  "content": "A comfortable pillow is not the same thing as rotten meat.",
                  "id": 14,
                  "comments": [
                    {
                      "score": -4,
                      "content": "[deleted]",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 82,
          "content": "Or simply wash it??",
          "id": 16,
          "comments": [
            {
              "score": 198,
              "content": "[deleted]",
              "id": 17,
              "comments": [
                {
                  "score": 85,
                  "content": "I have covers for my pillows that keep them clean.   They are rated to protect for even bed bugs.  Feather pillows can also be cleaned at some dry cleaners.  We do replace my husband's pillows because he kills them.  My pillows are feather pillows that came from my grandmother.  They are older than 19 years.  They are cleaned every year and are fine.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 71,
                      "content": "[deleted]",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "I'm still using bedclothes from 4 decades ago.\n\nCleaning regularly & gently does WONDERS.\n\nAND I *like* my stuff.  It's not ratty or tattered, either.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Bedclothes are not the same as pillows. They can be washed more effectively.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Hopefully you saw his update that he told his mom about it and she reamed him out once she realized she still had that old pillow she'd given him back then.  🤣",
                  "id": 22,
                  "comments": [
                    {
                      "score": 5,
                      "content": "[deleted]",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Yeah I'm confused do people not wash their pillows when they wash their sheets? I thought that was normal.",
              "id": 24,
              "comments": [
                {
                  "score": 17,
                  "content": "Pillow cases? Yes.\n\nActual pillow? No.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I got a new shredded foam pillow last year, and the instructions specifically say that you can’t wash the pillow with the filling in it. If you want to wash the pillow, you need to remove all the filling and just wash the cover.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I was wondering that  too...lol",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Wow, every other story on this sub of someone discarding someone else’s shit without permission goes the other way. It was his pillow. Gf seems a bit OCD about the bed.",
          "id": 28,
          "comments": [
            {
              "score": 6,
              "content": "i think there are better ways to phrase this than 'a bit OCD'",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "So throwing away something away of your partners without permission is now okay? He's an asshole because it may be dirty?",
          "id": 30,
          "comments": [
            {
              "score": 6,
              "content": "[deleted]",
              "id": 31,
              "comments": [
                {
                  "score": -5,
                  "content": "i agree... mostly. i think it would be better if the GF like could put it in a bag and they like places it in the Garage and them tell OP that she fells not confortable with it in the bedroom but the Pillow is in the Garage. Its not hers so she should not tossing things away from him.\n\nbut for the rest i Agree",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Switching every one to two years seems incredibly wasteful to me. You can easily take the cover off and inspect if it's molding or dirty.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Found the user that's cool with throwing away people's personal possessions.",
          "id": 34,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Yta. Every 2 years might be excessive until that are getting serious wear. I have have mold growing inside multiple pillows. If you regularly go to bed with wet hair or drool then you most definitely have mold in there. Especially since it's not a down pillow. \nEven though she wasn't laying her head on the pillow she was close enough that she was breathing in that almost 2 decades worth of mold, dead skin, and whatever else that science experiment contained",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I agree. This is pretty gross. We use zipper covers and wash regularly and still replace every 36 months. It doesn’t matter how much you wash or if you have covers the oils from your skin seep into them and mites cling to the oil snd they get gross even if you don’t see it. I don’t think she should have thrown it away without telling him but OP is the bigger asshole here.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -36,
          "content": "Yes but she didn’t have to throw it away. I could have used it somewhere else like when laying on the couch or something",
          "id": 37,
          "comments": [
            {
              "score": 63,
              "content": "[deleted]",
              "id": 38,
              "comments": [
                {
                  "score": -4,
                  "content": "Yep.full.of dust mites.",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "God thats so disgusting why would you ever keep it? Its the same issue even if you put it somewhere else. Its getting everything it touches dirty as well, and she deserves to live in a clean house",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Dog. It’s gross to keep a pillow for that long. It’s just hygiene.",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 143,
      "content": "YTA, a 19 year old pillow?? That is absolutely disgusting and unsanitary to keep sleeping on. There's drool, skin mites, dead skin cells and who knows what else on that thing.  \nYou're lucky she didn't throw it out sooner. Yuck",
      "id": 42,
      "comments": [
        {
          "score": 125,
          "content": "But if it was a teddy bear he slept with from childhood y’all wouldn’t be this out of sorts? It was his nighttime comfort object just like the expensive duvets and what not are hers 🤷🏿‍♀️ respect others property! NTA",
          "id": 43,
          "comments": [
            {
              "score": 26,
              "content": "But like it wasn’t a comfort object. A teddy bear has sentimental value it’s also not often something you sleep with your face in direct contact with. He already said that the pillow had no sentimental value and was turning Brown. You bet if the hypothetical teddy bear was becoming discoloured and frankly ruined over time to the point of being gross, I would throw it out.",
              "id": 44,
              "comments": [
                {
                  "score": 17,
                  "content": "I think that’s messed up 🤷🏿‍♀️",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I still sleep with my baby blanket and stuffy (I say stuffy when at this point it’s a rag and hasn’t had stuffing since I was 7. I’m 28). They are washed at LEAST once a week. Theyre old af but they’re clean. Pillows are not as easy to clean especially if they are filled with synthetic material. This guy is disgusting.",
              "id": 46,
              "comments": [
                {
                  "score": 6,
                  "content": "Both our washer and dryer have sanitize cycles. I think it is easy enough to wash a pillow.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That's rude.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "What about blankets that are passed down from generations? Think of all the shit inside those. But a pillow changes that? C'mon some people don't think. NTA",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It's lame that she threw it out but like... A teddy bear is different from something you have your face on 6-8hrs every single day.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "But I do wash it every few months to get all that stuff out so I think it’s clean, she disagrees.",
          "id": 51,
          "comments": [
            {
              "score": 15,
              "content": "My pillows aren't as old but I do wash them regularly.  I have a setting on my washer \"Sanitize\" dryer has the same.  I use that setting when I wash any of my linens.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Unless you wash it in super hot water(130°f +) it isn't really getting that clean.  Most residential water heaters are set to 120°. \nStill,  why wouldn't you use the new pillows if the old one wasn't sentimental??",
              "id": 53,
              "comments": [
                {
                  "score": 54,
                  "content": "My quick Google provided different information. The default for hot water heaters in the US is 140°F which is plenty hot to properly kill and clean a pillow.",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": ">Unless you wash it in super hot water(130°f +) it isn't really getting that clean\n\nSource? No hate, I just want to know why you are so specific about it.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 13,
                      "content": "They've done studies on dishes and laundry that show there's no discernible difference in cleanliness between using hot water and warm water.  It blew my mind when I read that years ago.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "The old one is more comfortable. He said that.",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -15,
                  "content": "I just liked it, it was very comfortable and I had it all throughout my teens, which somehow makes her think that’s even MORE disgusting.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 74,
                      "content": "it does make it more disgusting 🤢",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I have a 4 year old pillow that I've never been able to find another of. This pillow is not getting thrown away until I find one like it. I understand. You should throw away something of hers to see how she likes it.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Can't you just wash it?  Also, if the pillow was higher quality, it might be stuffed with goose down that will last a long time. If that still grosses you out, then just re-stuff it again.",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "Not even that but his gf is an over the top “bed clean” person. I have a couple of friends like that and I consciously won’t sit on their bed unless I’m directly invited to and I always try to remember to take my coat off bc they don’t like “outside” on their beds. For both of them it’s pretty important so I can’t imagine how much his gf has been suffering for the past TWO YEARS with this pillow. \n\nShe still shouldn’t have thrown it out without his permission but I think he should consider that his gf has probably over extended her patience more than he can possibly imagine.",
          "id": 62,
          "comments": [
            {
              "score": 13,
              "content": "Sounds like she should have talked to him",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I hope your family doesn't own any sentimental blankets or quilts. Better throw those away with that argument too",
          "id": 64,
          "comments": [
            {
              "score": -1,
              "content": "Blankets and quilts are not on the same level as a stuffed pillow.",
              "id": 65,
              "comments": [
                {
                  "score": 11,
                  "content": "How so? They get wet, sweaty, peed on, sex etc. Has fluff on the inside.",
                  "id": 66,
                  "comments": [
                    {
                      "score": -5,
                      "content": "What quilts have fluff on the inside?? \nI also don't have blankets that are stuffed....even comforters are barely stuffed. But I do replace my blankets every 3-4yrs ish, and we don't have any family heirlooms like that.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 93,
      "content": "I have an old ass pillow too. Suddenly my wife's opinion of it being gross doesn't seem unreasonable and am probably going to throw it away, just like you should have done when you moved out of your parents house. Keeping a hold of something just \"cause you like it\" but is highly unsanitary is hoarder behavior. My pillow is now on the way out too.",
      "id": 68,
      "comments": [
        {
          "score": 70,
          "content": "Dude you're misrepresenting what hoarding is, keeping one item isn't hoarding behavior. What kinda disingenuous bullshit is that?",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "Hmm it’s interesting hearing this opinion from someone who’s in almost the exact same situation. Thank you for your comment, truly. Maybe I really was in the wrong…",
          "id": 70,
          "comments": [
            {
              "score": 18,
              "content": "Throwing away your pillow when she knew that you wanted to keep it is a lack of respect. You get to decide which of your possessions are kept and which are gotten rid of. When you respect someone you respect their belongings. I've been married over 34 years. Respect is huge in a marriage. Respect is essential for a relationship to be successful. \n\nIt's okay to have a difference of opinion and to discuss that difference. It isn't okay to make a unilateral decision that you know your partner won't like when it concerns their things. \n\nAsk her what she would think or feel if you decided that you didn't like something of hers and threw it away when she wasn't home even though you knew she wanted to keep it.\n\nShe doesn't respect you.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Mine too! Along with my old mattress protectors :o/",
          "id": 72,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 63,
      "content": "NTA. She knew you would be mad, that’s why she did it when you were gone and didn’t say anything about it until you noticed. She should have had an adult conversation with you about it, since she knew it was important to you. Yelling isn’t helpful either but she is the actual AH in this situation. She owes you an apology.",
      "id": 73,
      "comments": [
        {
          "score": -19,
          "content": "She did apologize while I was yelling but I feel it was more of a defensive apology to get me to stop. We have had a few conversations in the last 2 years and she has expressed her disgust for my pillow on several occasions and had asked me to get rid of it but I just held my ground. But thank you for your insight, I feel she owes me a better apology.",
          "id": 74,
          "comments": [
            {
              "score": 39,
              "content": "She doesn't really. You owe her one for making her sleep next to that grotty old thing for two years though.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "You get that you were grossing her out every time she got into bed and had to look at it, right? Not just the “several” occasions she actually said something.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "[deleted]",
              "id": 77,
              "comments": [
                {
                  "score": 8,
                  "content": "Showering before bed isn’t common? I think it is. Or should be. You don’t realize how dirty you and your clothes get being out and about during the day. Me and my bf don’t even sit or lay on our bed wearing clothes we have been in all day or before a shower. That’s gross.",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "She sounds fucking exhausting tbh.",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "lol those things you just described are very common maybe you’re just a yucky person",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Probably just wanted to throw it out before it could get up and walk out of its own accord 🤢",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 57,
      "content": "NTA the gross disgusting bag of mite poop, was yours not hers to throw away, she knew you didn't want to throw it out she did anyway.  \n\nBut no, she's not crazy about getting new pillows. 20 year old pillow ewwww ewww eww your smelly teen pillow too, watch some ytube videos just eww.  You're wrong for not at least taking 20 minutes to see if she was right before digging in your heels.\ne\nedit to add recommendation from places other then companies that sell bedding\n\nhttps://www.menshealth.com/style/a19526669/when-to-replace-pillow/\n\nhttps://www.theguardian.com/lifeandstyle/2014/aug/10/should-throw-away-my-pillows\n\nhttps://www.cnet.com/health/sleep/when-to-replace-your-pillow/",
      "id": 82,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 57,
      "content": "You think that your GF should sleep in a bed with a 19+ year old secondhand pillow? She's told you many time by the sound of it, you did nothing so she did.",
      "id": 83,
      "comments": [
        {
          "score": 49,
          "content": "She could have put it in a closet as easily as thrown it away",
          "id": 84,
          "comments": [
            {
              "score": 26,
              "content": "So could he, and it sounds like she has asked many time.",
              "id": 85,
              "comments": [
                {
                  "score": 42,
                  "content": "Ok? But she still chose to throw it out. She is more in the wrong here than he is.",
                  "id": 86,
                  "comments": [
                    {
                      "score": -3,
                      "content": "She is 100% in the right, that health hazard needed to be thrown away. Dust mites and their droppings get in the air and everywhere. Even in the closet it would be disgusting",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -4,
                      "content": "OK but it was that or dump him. I find it odd that she did not.",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 35,
      "content": "YTA, 19 years old? My god dude one can only imagine how much shit was on that thing! It's no wonder she wants to clean the sheets so often with 19 years worth of sweat, skin cells and god knows what else on top of it.",
      "id": 89,
      "comments": [
        {
          "score": 12,
          "content": "You do know pillows can be washed right? Just like blankets and quilts that have been passed down from generations",
          "id": 90,
          "comments": [
            {
              "score": 3,
              "content": "Pillows aren’t normally passed down through generations, it just seems unsanitary and begging for skin and hair problems, especially considering how long they’ve had it.",
              "id": 91,
              "comments": [
                {
                  "score": 8,
                  "content": "He doesn't mention any skin or hair problems being caused by the pillow.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 1,
                      "content": "He did mention in a comment he has bad acne, and he even said GF has told him it’s probably from his gross pillow",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Blankets and quilts can easily be washed. And I’ve seen your other comments about this. If you’re pissing on or having sex on your family heirlooms that’s a you thing. Almost no one else is using great grandmas handmade quilt from 1910 as a sex mat or toilet….. this also was not an heirloom. A 19 year old pillow that only had its first wash 2 years ago is not the same as a quilt used occasionally on the couch that you take very good care of and have cleaned regularly. I have a quilt that has been passed down to me. It’s almost 70 years old. My great grandma made for my grandma, she gave it to my dad and I got it from him. It sits on my couch and barely gets used. There is not a single stain on it and the colours are still so vibrant. She made it out of old clothes from all the children in the family. She actually made 5 of them all by hand. \n\nThis man’s gross old pillow is in no way at the same level as an heirloom like that. Linens can be cleaned adequately and high quality ones can be used for years. Pillows can not. OP himself even said it was not down, it was probably just some cheap pillow from Walmart or something like that. \n\nIf OP really wanted to keep the pillow, he should have tried to come to a compromise sooner. OP even said himself in a comment his GF gave him suggestions like buying a pillow protector and OP shut her down. He wouldn’t budge at all, or in his words “stood his ground”.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "You know that you can wash things on a sanitize cycle and then dry them on a sanitize cycle? It's pretty easy to do.",
          "id": 95,
          "comments": [
            {
              "score": 1,
              "content": "Just bc it wasn’t mentioned doesn’t mean it’s not happening…weird hill to die on but different strokes for different folks I guess",
              "id": 96,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 29,
      "content": "YTA.\n\n1. For yelling over a pillow, it would be different if it was an heirloom or had sentimental value.\n\n2. You should change pillows every few years for sanitary reasons anyway.\n\n3. If you were truly concerned, you could have put it elsewhere instead of in your bed when you know your girlfriend has an issue with it.\n\nSoft YTA to your girlfriend for just tossing it out with the garbage. But again, it was a simple pillow, not a hand-sewn quilt made by a dead relative.",
      "id": 97,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "[deleted]",
      "id": 98,
      "comments": [
        {
          "score": 17,
          "content": "This is the the correct answer. So weird to me that this sub is suddenly cool with throwing people's things out without their knowledge",
          "id": 99,
          "comments": [
            {
              "score": 7,
              "content": "That’s because it’s a guy asking if it was a girl the answers would be different. I’ve noticed that a lot on this sub.",
              "id": 100,
              "comments": [
                {
                  "score": -2,
                  "content": "that’s not true. i’m on this sub constantly",
                  "id": 101,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Then you’re not reading a ton of post on here with that exact summary.",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "I agree!",
          "id": 103,
          "comments": [
            {
              "score": 9,
              "content": "She’s BEEN asking you move it",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}