{
  "post content": "My family and I got into a road accident a few weeks ago.  Everyone is fine, but I broke my leg in two places.  \n\nThe doctor gave me the ok to go back to school.  I’m (17F) am in a bunch of AP classes and have a lot of books I have to carry with me. It’s hard going between my locker to class because it’s hard to manage a heavy backpack with crutches and a bulky cast.\n\nLast Tuesday, one of my classes ran late.  I was with my boyfriend Josh, who shares both classes with me.  Josh is a heavy guy who prides himself on being in unathletic because why need sports when you have video games?\n\nWe’re running to the next class.  I can’t keep up because crutches and heavy backpack make it freaking hard. I asked Josh if he could help me carry some of my books.  He said he can’t because he can’t carry my books plus his. I end up late to class by ten minutes when Josh was on time.\n\nMs. Sanchez, my teacher, is chastising me for being late.  And I snapped, “well, if Josh wasn’t so out of shape and would help me, I wouldn’t be late!”\n\nI got detention for talking back to the teacher.  And my friends and classmates think try at I’m an asshole for fat shaming Josh.  Josh says I’m unfair to him because I know he’s out of shape, and can’t help me.  I’m just sick of being let down by him all the time! AITA?  Or should I try to be more understanding?\n\nEdit:  we don’t have any turtle patrol, so my teachers haven’t been all that accommodating.  My mom was pissed about the detention and has been hammering the principal and superintendents ear.  Until then, I’m learning go remotely.  She thinks the detention is bs.\n\nAs for my ex, I dumped him a few hours ago.  Then he blew up my phone to call me a fucking bitch.  Turns out word got around to his parents.  His parents are hardcore conservatives who think that guys have to help a lady no matter what.  His dad confiscated his Xbox until further notice.\n\nI blocked his number.  Good riddance.\n\nI’m just going to focus the rest of senior year getting use of my leg back and getting out of here.  Josh sucks and I can’t believe I dated that loser.\n\nEdit 2: Wow, the comments here.  I stand by my choice.  Fuck Josh.  Fuck my school.  I'm going to be graduating in eight months and moving onto better things.  He had it coming when his xbox got confiscated.  Maybe he'll learn to be a better boyfriend.  \n\nPeace out!!!  FrustratedBrokeLegg has left the building.",
  "id": 1,
  "comments": [
    {
      "score": 4025,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 1229,
          "content": "This, also the school sucks. I know when there were kids with crutches at my school they would have permission to leave class early to get to their next class on time/before the rest of the school got out, and if they needed help with books or something they’ll ask for a volunteer from each class, which no one had issues with because they got to leave early.",
          "id": 3,
          "comments": [
            {
              "score": 505,
              "content": "My nephew broke his arm last week. He gets to leave early from classes plus one volunteer gets to go with him to help. The nurse actually makes sure any kid who can’t carry their bags don’t carry them. You’re right this school sucks.",
              "id": 4,
              "comments": [
                {
                  "score": 169,
                  "content": "Right?!? When I broke my arm, I got assigned a buddy who helped me and would be my scribe. Can’t believe this school didn’t bother with helping this student at all!!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 84,
                      "content": "My friend broke her arm when we were in 2nd grade. I was assigned to help her pull her pants down so she could go to the bathroom…good times. 🤪",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "I broke my shoulder. I had a doctor's note I couldn't carry books. I ended up with two sets of books in 7th grade - one that my mom took home & another set that stayed at the school. If we needed the English textbook I was given the extra in the classroom, etc...",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "When I was in HS I had to be on crutches from a sports accident and the nurses office let me trade them for a wheelchair every morning and my friends got to push me around. The school should have definitely accommodated OP in some fashion",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "At the school I teach at kids get passes to leave early from classes. Maybe it’s because I teach at a large school with lots of kids, but the hallways get super crowded and honestly it’s not safe to be in them with crutches.",
              "id": 9,
              "comments": [
                {
                  "score": 15,
                  "content": "Yeah, I'm pretty sure my high school did something similar. Due to a design failure, the one hallway connecting two wings of the school was exactly wide enough for 2 lines of kids going each way. You couldn't take up too much space because it would cause a blockage/slowdown. And a different design flaw made the shortest way between two very long dead-end hallways a bathroom with the privacy wall design so you had to wind your way through. Got real crowded at class change time...even fully mobile you were bumping people.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "At my high school, I busted open my foot doing something stupid and was on crutches for like two weeks and I was given an elevator key for the one elevator not by the security desk and I got released from class early and was given a grace period of like a minute in the main building and like 3 minutes in the further out buildings that were attached by an glass enclosed bridge.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I had crutches for about 6 weeks, twice, during highschool. Both for knee surgery. I was allowed help from another student to carry my stuff and neither of us would be late. Having the help meant that I wasn't late anyway since you can move pretty fast on crutches when you're an idiot and aren't wearing a backpack. I did get in trouble because we started abusing it and I gave 1 person each a different item from my backpack. Apparently I didn't need help from 20 people, who knew. \n\nOP's school is ridiculously unfair to them especially since they have a giant cast. I can't imagine trying to get around with a cast, it probably hits the crutches a fair bit.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "The school should issue you a “class set” of books. Each teacher keeps the book in the teacher’s cabinet or desk for you. No need to struggle carrying books to each class.",
              "id": 13,
              "comments": [
                {
                  "score": 2,
                  "content": "That is a brilliant idea",
                  "id": 14,
                  "comments": [
                    {
                      "score": 2,
                      "content": "This is what my son’s high school did for him when he had an injury.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Seriously though. I messed up my knee in high school and was on crutches for a couple weeks. Our band director liked to let us out late…so everyone in band who was also in my Spanish class “helped” me with my books…it was a strange little processional 🤣",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "One of my friends got pregnant when we were in high school, and she got to leave early, use the elevator, and had one of us carry her books to her next class. She could have carried her stuff fine, but they wanted no chances of any issues.\n\nIf they aren't helping a kid on crutches, they're failing, hard.",
              "id": 17,
              "comments": [
                {
                  "score": 2,
                  "content": "Huh.\n\nWe went to very different high schools.\n\nMy high school had to stage an intervention because too many freshman girls got pregnant at the same time one year.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 2,
                      "content": "In the three years I spent at that school, we only had like, maybe four pregnancies? I think we had a total of like 3k students so that's not that crazy.\n\nFor some reason, it's much lower than the number of pregnancies in the junior high at the same time, which had half as many students and I think at least three pregnancies a year.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yes, my daughter was a 'buddy' for a girl who was on crutches.  They left each class a few minutes early and my daughter carried her bag for her.\n\nIt made the other girl's life so much easier.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Our school had an elevator that could only ever be used by kids on crutches or in wheelchairs. Even the teachers weren't allowed to use it. It was a very large campus built on a hill. So many steps.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "and some schools give out extra books, one to leave in the classroom, one at home.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Honestly my one addendum to this is the BF is an extra asshole as someone who takes that view of exercising and instead being proud of being out of shape and a \"gamer\". I say this as someone who was literally like that as a teenager and only now looking back am aware of how toxic that whole \"I don't exercise my body, I exercise my mind\" outlook is. So I simultaneously think he's an ass and just feel sorry for him.\n\nHope this acts as part of a wake-up call that being at least somewhat fit doesn't mean he's betraying his nerd roots.",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "You said everything I was going to say, and probably better.\n\nBravo, and I agree, ESH.\n\nAnd as the comment replying to yours just before mine, the school sucks for not making some help available to OP, or anyone else with mobility issues.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "ESH\n\nOP sounds insufferable. \n\nThe teacher is a crappy individual.\n\nThe school administration is dumber than a box of rocks and ruder than a smarmy politician. \n\nThe now-ex boyfriend is incredibly inconsiderate.",
          "id": 25,
          "comments": [
            {
              "score": -2,
              "content": "Well he is inconsiderate but he didn't have to help her. Now where it's written that he need to carry her books. She talked back to the teacher as well, do you really think a teacher would let that slide. She need to be made an example of that disrespectful behavior doesn't work even if you're injured.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "But was his words about not needing to be in shape cause he had video games. She didn’t even need to ask for help, if was my friend I would be telling her to let me help",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Exactly this, but my gosh your school/teacher sucks!!! Can you get a doctors note confirming that hey this student (you) needs someone/thing to help her with what she needs to carry and more time to get there between classes? It’s common sense but I know some teachers/schools operate on doctors notes only for stuff like this.",
          "id": 28,
          "comments": [
            {
              "score": 3,
              "content": "I had to get a Dr's note for my son in high school who had a cast and crutches. Seemed a tad overkill to me cause, I don't know, look at him.....",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I agree with the teacher for once because she talked back to the teacher. She clearly disrespected her classmate and teacher I think the teacher was right, she should just listen and know her place in the class.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Agreed, the biggest AH in this story is the teacher. A student drags herself in with crutches and heavy books and he chastises her? I hope OP's mother files an official complaint about him.",
          "id": 31,
          "comments": [
            {
              "score": 3,
              "content": "And the other teacher is also an A-hole - the teacher in the previous class session who let the class \"run late.\" As a teacher, you don't just let your class run late. It's disrespectful to the students and to the other teachers. If you let your class run late, you're stealing other teachers' and students' class time.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I agree but it's a softer AH for me on OP because it was literally her bf that brought up how he was too out of shape to help carry her backpack. I feel like she was more throwing his excuse back at him as lame than trying to fat shame him.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "How is it an AH move to state that someone who is out of shape, is indeed, out of shape? \n\nThat’s not “fat shaming” whatsoever. It’s commenting on someone’s activity level. \n\nIf I do nothing active for an extended period of time, I’m out of shape. That’s a fact and simply not offensive in any way.",
          "id": 34,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "[deleted]",
          "id": 35,
          "comments": [
            {
              "score": 5,
              "content": "might have something to do with the evil teachers with zero humanity lol. But yeah josh is not great. No one here is great.",
              "id": 36,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 903,
      "content": "ESH.\n\nYou shouldn't have fat shamed your bf. That was low.\n\nHe should have helped you and given the teacher a heads up about the previous class having run late and you being on the way.\n\nYour teacher is the biggest asshole because who TF gets angry at a student for being late while struggling with carrying books and using crutches at the same time??? Wth? You should go to the principal about that. That's horrible.",
      "id": 37,
      "comments": [
        {
          "score": -9,
          "content": "How is it an AH move to state that someone who is out of shape, is indeed, out of shape?\n\nThat’s not “fat shaming” whatsoever. It’s commenting on someone’s activity level.\n\nIf I do nothing active for an extended period of time, I’m out of shape. That’s a fact and simply not offensive in any way.",
          "id": 38,
          "comments": [
            {
              "score": 9,
              "content": "Because it's one thing to say it to someone out of concern. It's another to say it out of anger. While I agree he could've helped her and should have helped her, what she said wasn't out of concern it was an attack on him for not helping her.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yes but it was obviously meant as a dig towards him, which is why it was an AH move. Just because it’s true doesn’t dismiss the fact it was mean.",
              "id": 40,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm going to be honest though.  How hard is it really to carry someone's backpack for a short distance?  If you can't (or really as the situation presents itself is more likely won't) do that, you have a problem that seriously needs addressing, not one that should be ignored.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 683,
      "content": "YTA Jesus you bring up his weight so much, do you even like him.\n\nIm assuming you’re in Highschool carrying those books around is fucking hard, also why do you blame him and not your teacher who is acc the asshole here.",
      "id": 42,
      "comments": [
        {
          "score": -532,
          "content": "Not anymore!  I am so done with his inconsiderate ass!  This isn’t the first time Josh acted on his benefit.  Jesus.  I think this is the first time I’ve really seen how much of an ass Josh is.  I got to make a call.",
          "id": 43,
          "comments": [
            {
              "score": 313,
              "content": "You think josh is an ass my god, im wondering why he stuck around someone like you for so long. All you talked about was his weight, just leave him he’s better off without you.",
              "id": 44,
              "comments": [
                {
                  "score": 363,
                  "content": "I mean he \" prides himself on being in unathletic because why need sports when you have video games\"\n\nHe sounds like he can't take care of himself, let alone help out another person, not exactly great boyfriend material.  He also was \"in shape enough\" to get there on time while ditching his currently disabled girlfriend to be late on her own?\n\nYeah that's a shit friend, let alone boyfriend.\n\nI'm not saying what OP said was okay, by any means, but it's definitely ESH.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 74,
                      "content": ">I mean he \" prides himself on being in unathletic because why need sports when you have video games\"\n\nI kind of think OP is an unreliable narrator when she says this. Her post and comments are very clear in conveying how much hatred she has for this boy that I wouldn't be surprised that she embellished some details about his \"pridefulness\" of his lack of athleticism.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "Josh is an ass, doesn’t mean she’s not, but he is too.",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 64,
              "content": "Why aren't you leaving class early to get to your next class ? I knew so many students who had to do this and they were in AP courses if they had an injury requiring crutches / wheelchair. You are on crutches you're going to move slower.",
              "id": 48,
              "comments": [
                {
                  "score": 45,
                  "content": "I had a math teacher who literally said nothing to a student who bullied me and took away my crutches from me. I have had multiple students slam the door on my face. I’ve had friends not help me. Had a teacher take my crutch to kill a spider. I never once got much help.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "I'm curious of this too. Back in my sophomore year of high school, I injured my ankle badly enough that I had to wear a boot on it for two weeks. Had to avoid climbing up stairs and doing really excessive exercise with it for that reason, which sucked when most of my classes were on the 2nd and 3rd floors of the school and/or on total opposite sides of the building. I was given permission to leave 10 minutes early from my classes to allow me time to get where I needed to go. Hell, I was even allowed to pick someone in class to leave with me to help me with carrying my books and such. I thought it was awesome that the school allowed for it (with doctor's orders, of course), and made life so much easier for me during that time when I was already struggling. I wonder why the OP's doctor and school isn't allowing for such a thing for her? Or if they do, but she chooses not to use it.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Same experience here.  You can't be expected to maneuver effectively through the halls on crutches during class change.  And trying to take on stairs and adding books to the mix is darn right dangerous.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Mine usually didn’t bother. Even if they did it consisted of an email to the teachers that the teachers usually ignored",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "\nIn senior year I was supposed to be released from classes early because of issues with my concussion and the sound of lockers slamming making me disoriented more than the normal “I’m too short to see where I’m going.” Most of my teachers yelled at me the first few times I tried to leave class early even though an email had been sent to all my teachers about it and lightening my work load for the time being. I gave up fighting with them pretty soon. I remember after that noticing that most of the injured kids with crutches or wheelchairs didn’t get to leave classes early either. I’m graduated now but my niece is there and in the brand new building the elevators are bust and if a kid wants to leave class they have to take a classroom specific hall pass with a colored lanyard relating to which hallway they are allowed to be in with that pass. No exceptions",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Or talk to teachers/principal to find out what disability accommodations can be made. Potentially digital textbooks so she only has to carry a tablet, or printouts of the necessary pages provided each week by the teachers. If they can't/won't do that get photocopies of the chapters you're working on. I spent a lot of time on crutches in highschool and this was an accomodation my teachers made since my books were heavy. One of my classes was basically a trial run for the province, and no dedicated text had been written yet, so we had 7 books for one class. We would regularly use 2-3 a day. The teacher tried to only assign homework out of one at a time but sometimes the best info was in another. Those photocopies were a lifesaver.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah it's bad that the school isn't doing better disability accommodations for her, but what can we expect from schooling I guess",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Not just that, why hasn’t OP asked for a set of home books and a book to leave in each classroom.  Or digital access to the textbooks- which exists for pretty much every current AP book out there.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "You’re right! This is a normal school request- especially on a high school.  Much easier to maneuver on crutches in the hall without a whole bunch of other people around.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Publicly insulting someone's weight and fitness level when you're upset or done with the relationship is a really bad look and that behavior is a terrible road to embark on.\n\nOnce you start throwing insults you begin to lose credibility. I hope you realize that this could have been handled better and I hope this doesn't become the norm.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "Wow, glad he's dodging this bullet with you. Jesus.\n\nHopefully Josh is okay with the break up.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Unlike everyone roasting you here OP, I too knew a Josh. A lazy, do nothing but play video games, therefore unfit and overweight, wanted a mummy instead of a girlfriend Josh who when I was deathly ill with flu let my housemate care for me because he and I quote 'felt too stressed and couldn't be bothered'. Who was then quite shocked when I kicked him out.\n\nFuck Josh and he deserves your ire. NTA by the way, or justified AH. What this sub fails to recognise is the straw that breaks the camel's back isn't usually pretty.",
              "id": 60,
              "comments": [
                {
                  "score": 3,
                  "content": "Nice alt",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -3,
                  "content": "Good lord, so she can be ABUSIVE because he is not in good shape. UNBELIEVABLE.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Abusive?! Fucking please.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Hun... Stop dating someone you don't like either physically or as a person.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Man dodged a bullet, youre doing him a favor. YTA",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Okay, nvm. I’ve changed my mind after reading this response. You seriously think it’s okay to chastise him about his weight and are actually *justifying* your actions.\n\nNope, just no. 100% YTA.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I get your leg is broken and you need help but that doesn't give you power to bring someone's weight into it. I have a feeling no one else is willing to help you out because of your entitled attitude. Even your friends are telling you are an AH. Also for the way you spoke to the teacher was unexcusable. You could have said, \"I'm sorry so and so for being late. I am having trouble with mobility and holding my books.\" Then you go after class and make a phone call to your parents and have them come have a meeting about you needing extra time or help. Also, your ex boyfriend is not a pack mule or servant for you. If he wanted to help you out that's great but don't expect it because he was a boyfriend.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "You’re no winner here either. Whew",
              "id": 69,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 538,
      "content": "ESH\n\nYour boyfriend sucks for not helping. \n\nYou suck for dating someone you obviously don’t like or respect whatsoever, and for scapegoating him instead of being an adult (the reason you were late is because a class ran late and you’re having trouble carrying a bag - what would’ve been so difficult with just saying that?).",
      "id": 70,
      "comments": [
        {
          "score": 173,
          "content": "“Instead of being an adult” this is a 17 yo high school kid, literally NOT an adult lol",
          "id": 71,
          "comments": [
            {
              "score": 93,
              "content": "I mean, you are right. But it was not a proper behavior even for a 17yo. Change \"adult\" for \"mature\".",
              "id": 72,
              "comments": [
                {
                  "score": 36,
                  "content": "This. \n\nWe're talking about attitudes and behavior here, not registering to vote.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "It’s immature teenagers being immature. He was, she was…the only ahole is the ADULT teacher",
                  "id": 74,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I think ESH.\n\nThe teacher was wrong, of course. But Josh and OP also suck. They at the very least didn't like each other and were terrible for one another (not even trying to help your girlfriend who is injured is AH behavior, but so is OP's attitude for fat shaming him and throwing him under the bus). \n\nAnd sure, teenagers are oftenly immature... But sometimes they are in the wrong for being immature, even if they are teens. That's the case on this one, I think.",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "At what age should a teenager start learning about accountability for their actions/words, in that case? \n\nUnquestionably, they're immature teens doing immature teen crap. That doesn't change the fact that genuinely crappy behavior should be called out (in an AITA, of all places), at least in my opinion. \n\nFat shaming is bullying, and age of those involved doesn't really cut it in my head as a reason to gloss over it.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -2,
          "content": "YTA for fat shaming",
          "id": 77,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -330,
          "content": "Frustration and being pissed off doesn’t make for a Logical mind.",
          "id": 78,
          "comments": [
            {
              "score": 177,
              "content": "Frustration doesn’t give you the right to fat Shame your boyfriend in front of the whole class , your teacher is the asshole not your boyfriend. He deserves someone better",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "I get that, but it also doesn’t excuse the words that do actually come out, either. \n\nYour teacher sucks too, for what that’s worth. \n\nUltimately, you could’ve gone with something as simple as an “I’m sorry” - or even saying nothing at all (your post references being chastised for being late, not specifically being asked why you were late).",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That doesn't excuse it.",
              "id": 81,
              "comments": [
                {
                  "score": -15,
                  "content": "OPs frontal lobe isn’t even fully developed yet so like, I get it",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You are not going to make it far in the adult world.",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 285,
      "content": "YTA\n\n1. your BF didn't make you late.\n2. Your previous class's teachers let them late.\n\nYou chose to throw your BF under the bus, when you could have calm stated, \"I am sorry. [Previous teacher] let us out late and I am currently not capable of sprinting.\"",
      "id": 84,
      "comments": [
        {
          "score": 113,
          "content": "Her boyfriend could have helped her not to be late, though.  And chose not to.  Didn't even inconvenience himself enough to accompany her while she struggled with her books on those crutches.",
          "id": 85,
          "comments": [
            {
              "score": 78,
              "content": "Yeah this is it for me. He ran ahead and ditched her so he could be on time. Not down with the fat shaming, but that part is indeed loser-ish.",
              "id": 86,
              "comments": [
                {
                  "score": -19,
                  "content": "[deleted]",
                  "id": 87,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Ok yeah a partner doesn't HAVE to help their on crutches and having trouble carrying heavy loads and navigating walking partner, but it is definitely an AH move.  Partners help each other in vulnerable situations.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "What's the point of having a partner if they will make no effort whatsoever to help you when you are struggling with actual broken bones?\n\nSure, he doesn't haaave to, but is it really a horrible entitled bossy woman thing to ask?",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -9,
              "content": "So what? She can be abusive an humilliate him for his physical appearance? What she did is considered abuse. Good fo you for justifying an abuser.",
              "id": 90,
              "comments": [
                {
                  "score": 5,
                  "content": "OP’s comments were assholeish, but nowhere near “abusive”. She also didn’t humiliate him for his physical appearance, she shamed him for his actions, the only reason “fat shaming” is invoked is because she mentions him being out of shape, but that was literally his excuse for why he couldn’t carry the books. \n\nYou just don’t call someone out for letting you down like that in public, especially when the real ire should be cast at the teacher/school for not having accommodations. Not sure if this is a troll trend on this sub of calling things that clearly aren’t abuse abuse, but it’s asinine and unproductive.",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 137,
      "content": "YTA here.\n\nSo is the teacher for not being able to cut you some slack for being late.\n\nJust dump him if his weight is a problem for you, which it seems pretty clear that it is.",
      "id": 92,
      "comments": [
        {
          "score": 20,
          "content": "For sure the teacher.  C’mon now, I hardly believe it was that bad.  For gods sake she broke her leg and crutches are abominations.  I got a wheel chair for all of my many surgeries and didn’t need to worry about falling over.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 125,
      "content": "ESH. He was on time to the same class, but you weren’t. That’s unsupportive. Body shaming isn’t cool, but Josh isn’t in the clear here.",
      "id": 94,
      "comments": [
        {
          "score": -53,
          "content": "He didn’t even visit me in the hospital.  I know where living in p-word times, but the hospital allows visitors now.  He never visited me or gave me flowers and only called once to see if I wanted to game with him. \n\nI’m starting to see why my dad compares him to Buckley from KoTH.",
          "id": 95,
          "comments": [
            {
              "score": 54,
              "content": "Why are you still with him?",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "[deleted]",
              "id": 97,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Can’t imagine why he doesn’t want to actually see you or your family. You all seem so pleasant.",
              "id": 98,
              "comments": [
                {
                  "score": 41,
                  "content": "He called her an fing B because his dad took away his Xbox for not helping her when she was in need…he’s no prize either",
                  "id": 99,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah, they both sound like awful people.",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 89,
      "content": "ESH but the person who’s sucks most is the teacher who sees a student hobbling to class and still decides it’s a good idea to yell at them.",
      "id": 101,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 73,
      "content": "So this is one incident.  you need to give more detail about being let down all the time.  I do think that it is frustrating that he didn't try to help.  It would be one thing if he tried and failed because he was out of shape, but he didn't even try to help you.  NTA",
      "id": 102,
      "comments": [
        {
          "score": 125,
          "content": "No, there were more incidents.  Like not seeing how I was doing, never calling after the accident, only wanting to hang out because he wanted to game with me when I was in no mood for it. And a bunch others.",
          "id": 103,
          "comments": [
            {
              "score": 135,
              "content": "So he is just not that into you.  Set him free.  Take care of yourself.  You deserve someone that tries to help you.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "You do know you're supposed to like your boyfriend, right?  Also, tell your parents you can't maker it to your classes on time and you need medical accomidations from the school.  They're actually required to help you.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "You are 17 is this really the kind of future you want with a guy? Also have your parents talk to your teacher and or nurse they can find ways to help you.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "You deserve better. Drop him and go find it.",
              "id": 107,
              "comments": [
                {
                  "score": 1,
                  "content": "He also deserves better, someone who won't be abusive. Humilliation is a form of abuse.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It's really just a bad relationship on both sides.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "You are worth so much more than this.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": "YTA\n\nJust for throwing someone under the bus.\n\nBut more so the teacher, your leg is broken. Like what heck.",
      "id": 111,
      "comments": [
        {
          "score": -3,
          "content": "[removed]",
          "id": 112,
          "comments": [
            {
              "score": 36,
              "content": "i mean she’s a high schooler, they don’t have the freedom to come and go from class whenever they please, if one teacher was so pissed about her being late another will be pissed about her wanting to leave early. plus it literally says in the story that the previous class they were in ran over time, there’s not really much OP can do about that. a lot of high school teachers have the “i dismiss you, not the bell” rule so",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "That's very true \n\nI just don't see why anyone should have to care. It's silly to me. I get that there's bureaucracy, but LOL it's bureaucracy. And I no likey. \n\nAlso didn't she say another class made her late?",
              "id": 114,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}