{
  "post content": "Update:\nhttps://www.reddit.com/r/AmItheAsshole/comments/birzcc/update_aita_for_dismantling_the_bed_and_taking_it/\n\nThis happened over the past few hours. So my wife and I started bickering because I forgot to buy her favorite kind of ice cream both times I went grocery shopping this month. I told her I'd go out and get some but she started yelling at me. She works a really stressful job so I just figured it was that.\n\nShe didn't want me to go and make a trip to the store just for the ice cream where our local food store is about an hour and a half away (living in a rural place sucks). I insisted, she said no, I said I wouldn't worry about it then. She got mad and said she would go get it and that I could sleep on the couch. I told her \"I'll be godamned, I bought the bed and if you have a problem, you can sleep on the couch\". She countered with the fact that her name is on the lease so it's her roof and I wouldn't be sleeping on the bed under her roof.\n\nby this point it's escalated pretty bad just because of a childish quarrel. But I decided to take it a bit further. While she was gone, I took apart the entire bed and drove it to my friends house.\n\nI'm currently laying in it and I'm about to turn my phone off to avoid the oncoming storm.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 9733,
      "content": "ESH\n\nYou're both assholes for acting like children rather than having a productive discussion like adults\n\nBut you're the bigger asshole for LITERALLY taking the bed apart and bailing out to a buddy's house.  Your actions remind me of a kid that says \"You won't play fair in the sandbox! I'm taking my toys and going home!\"",
      "id": 2,
      "comments": [
        {
          "score": 1731,
          "content": "let me remind you that she started the whole ordeal because he forgot to get ice cream, and when he offered to go get it, she said no then freaked the fuck out when he became content.\n\n&#x200B;\n\nI do not disagree that ESH. However, the wife is the bigger asshole.",
          "id": 3,
          "comments": [
            {
              "score": 3408,
              "content": "Idk man, this says to me death by one thousand cuts, the ice cream being yet another thing in a long line of inconsiderate behavior. Sure this may specifically be \"freaking out about ice cream\", but is more representative of \"freaking out about a partner repeatedly not listening to you\".",
              "id": 4,
              "comments": [
                {
                  "score": 1587,
                  "content": "That's what it sounded like to me.  I'd guess - and I may be totally off - that forgetting the ice cream implies, to her, that he just doesn't care at all.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 733,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 297,
                      "content": "Not to mention OP forgot it *twice*.\n\nOne time I get... but twice dude? Do you not know the definition of a shopping list?",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 127,
                      "content": "That's it 100%.  An argument like this is always related to deeper issues - she could be holding onto lots of pent up feelings around the area of \"my husband doesn't care about me\". She doesn't want him to go get it after the fact, which indicates that she doesn't believe he would actually *want* to do this for her. Then finally, OP choosing to take it to the next level of childishness just to spite her is likely to make her feel totally hopeless.\n\nIn a healthy relationship, these are the most important moments to consider what people are really angry about, and usually just trying to show them that you love them will make the stupid stuff go away.\n\nIn conclusion, ESH, no one is behaving like an adult.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I agree. To a woman,  forgetting something Ive asked for TWICE feels like he doesn’t care and all that little stuff adds up. Once, ok, it was a mistake but twice? Ouch He’s not thinking about her when he goes grocery shopping? When I go grocery shopping I think about my boyfriend and  what he wants and pick things we will both like, I want him to have things he likes. I doubt shes getting pissed over icecream, theres more to the story.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 917,
                  "content": "He acknowledges that her job is stressful to the point that her getting upset with him is likely due to that.... But then forgets the specific comfort item she's requested *twice* while also knowing that the store is 90 minutes away. Yeah. That's massively inconsiderate behavior and sounds like it's a recurring problem that's been building up resentment on her end.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 287,
                      "content": "When the store is an hour and a half away, you make a fucking grocery list. Christ. If something ain’t on the list, it ain’t gonna be remembered.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 123,
                      "content": "Shit. Your comment just swayed me. I was thinking forgetting isn’t that big of a deal, but creating a three hour drive for one of the two of them because he forgot twice is pretty moronic. And you’re probably right, it’s a build up of other shit.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 231,
                  "content": "Especially if said partner is clearly as petty as this.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Eh, I mean they both sound petty.  He offered to fix things, and she'd rather drive 90 minutes herself so she can punish him on her own terms.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "Yeah, but also the wife pretends she doesnt want husband to go get it when really she does. The husband may very well not listen but the wife needs to reliably and honestly assert her needs. \n\nReconfirming that ESH.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 295,
                      "content": "Getting the ice cream does not ex post facto correct the larger underlying problem.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 95,
                      "content": "I don’t think she wanted her husband to go back and get the ice cream cos she knows driving that far just for ice cream is ridiculous. But she still wants the ice cream and she’s probably really frustrated that there aren’t any good options available. The fact that this is the second time this has happened this month plus her stressful job is probably why it’s blown up so much. She might have driven to get it herself to clear her head. \n\nI’m probably reading into that too much but I’ve been in similar situations myself in the past.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 59,
                      "content": "Depends on whether it's something he'll go on about, there are plenty of things my mother will offer to do, but then you'll hear about it for the next 3 weeks.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It might not be that shes intending to punish him but to not rely on him anymore. Maybe she is just done with him doing this. And him actually going to get the icecream because he messed up doesnt fix the original problem of he is not doing what she asked over long periods of time.  Sometimes people need to leave a situation or do something themselves to help make what's going on better for them. But he decided to take it further and start removing his things from the house when she left to go get something she wanted that he originally forgot.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "No, she wanted him to care enough to remember it the first, or second time. \n\nAnd she probably did assert her needs... for an entire month... and he still \"forgot\" twice.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 82,
                  "content": "And don't forget \"offering to get the ice-cream\" means \"I leave the house for 90 minutes\" which frequently means \"I will not be participating in tonight's chores/discussion/shared responsibilities\" e.g \"sure I'll go get the ice-cream I forgot but then I won't be cooking dinner cause I can't do both\"",
                  "id": 21,
                  "comments": [
                    {
                      "score": 66,
                      "content": "I understood it as 90 minutes one way, so he'd be gone for 3 hours. She'd be alone all night, and by the time he got back it'd be too late for ice cream.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "Completely agree. He forgot her favorite ice cream twice in a row when they live and hour and a half from civilization? No shit she’s upset! Sounds like this is the behavior she’s been dealing with for a long time. She was being childish about it but I 100000% get where she’s coming from.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 10,
                      "content": "And when you split the household chores... that's probably the 1 thing he does (for 3 hours) while she cooks/cleans/etc... and he fucked it up multiple times... \n\nWhat a douchebag. 😑",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Are we all psychologists now? Maybe she was just annoyed cause he forgot ice cream. Maybe he’s just naturally forgetful instead of inconsiderate?",
                  "id": 25,
                  "comments": [
                    {
                      "score": 178,
                      "content": "[removed]",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "then he could at least try to make a habit of making a grocery list",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My boyfriend and I both have memory issues and I honestly know that forgetfulness causes issues within a relationship.  If he is having memory issues that's fine but he should be taking steps to help him remember. Notepad, journal, planner, lists, or even just send a text with what he needs to do. He should be making sure his relationship is happy and healthy and it sounds like he doesnt care that he keeps forgetting these things for her. A relationship is work and he isn't putting very much in.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Exactly. We’re not getting the whole picture here. No sane person freaks the fuck out over ice cream. Either it’s your scenario, or things escalated during the argument and the ice cream is just what *started* it. Either way, OP and his wife are immature af. My husband and I have petty fights too, but 1) we don’t go to the internet for validation and 2) neither of us ever take it this far. They sound more like high schoolers than married adults.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Really? It feels like its just forgetfulness on the guys part. I forget things all the time even if i say i need to get \"A\" while im at the store. By the time I'm paying I would have forgotten.  And it happens all the time.\n\nI think there's more to it than the guy forgets to get ice cream. There's other problems here and the wife decided to lose it on the ice cream\n\nI think ESH.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 26,
                      "content": "[deleted]",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Why is it always this way around? And not the other? What if he had it, and actually went through with something after a bunch of empty threats like it’s here house and he won’t be sleeping under her roof with that behaviour",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 363,
              "content": "Yeah, because it would have taken him more then \\*3 hours\\* to go get it. (1.5 hour each way + 5 mins for running in, grabbing it, paying and coming back out.) That's effectively their entire evening done and gone. And this isn't the first time he's done it either. He could have actually apologised and said he'd go get it tomorrow, or showed some iota of remorse and sincerity but instead, he's gone \"Well, want me to go get it instead of whatever else we were supposed to be doing?! No? Then I'm not going to worry about it\" and been pissed she's still been upset.\n\nCongrats OP. If you've forgotten shit that's important to your wife so often she has this sort of end of the line reaction to it when you do, then this latest escapade pretty much guarantees that you're going to be presented with divorce papers as soon as she can get her hands on them.  \n\n\nAlso....why is it just her name on the lease if you two are married?",
              "id": 33,
              "comments": [
                {
                  "score": 302,
                  "content": "> He could have actually apologised and said he'd go get it tomorrow, or showed some iota of remorse and sincerity\n\nIm not sure that would work. I suspect this guy does this a lot and lost all credibility.\n\nHe might be a guy that gets asked to do something. Doesnt do it. Gets called on. Says sorry and shows remorse and promises to do it later. Then still doesnt do it. Says sorry and keeps repeating his behavior until he isnt trusted or expected to do anything. The messed up thing is when the straw finally breaks the cammels back and his wife freaks out over something he can call her crazy for being so upset about something simple like forgetting icecream and ignoring all the other times he broke his promise.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 298,
                      "content": "And suddenly she’s a “nag” because she expects him to do the thing he said he’d do multiple times.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 92,
                      "content": "[deleted]",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 49,
                      "content": "It starts slow and the first ten times you just let it go because hey everyone makes mistakes. Then you accept this task is just not for you.  So hey ok you can't do \"pick up milk\" I can pick up milk that's no big deal. Then you can't do laundry, get some of the Christmas gifts, or take the baby to the daycare. you start pushing a bit harder here but it takes 10 times the energy to cajole them into doing something right then it would for you to just do it deal with it and you're being a nag cause you go over the instruction \"how to load the washer\" 5 times cause they ruined 7 loads of clothes. And now you're dealing with the electrition, cooking, moping the floor, loading the dishwasher then one day you realize your partner is not a partner they do 3 things they like to do and you do the other 117 necessities every week.  And you're exhausted because you can't ever have a day off and oh shit I have the flu and spouse still needs dinner and WTF why do I have to worry about your dinner while I have the stomach flu.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "This so reminds me of “she divorced me because I left dishes by the sink”",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "THIS!",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "> keeps repeating his behavior until he isnt trusted or expected to do anything.\n\nWell, you basically just described half of my coworkers.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "This whole her name on the lease/I paid for the bed screams bigger issues that go way beyond ice cream. This cpl has never been a team or acted like a caring committed couple.\n\nESH",
                  "id": 41,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Not really the wife’s fault, IMO. Who brings up “I paid for that bed” in a marriage? She retaliated with a much fairer response, essentially invalidating his childish point. IMO, OP is the asshole here.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "100%",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "We don’t know the tone he used or the way he said it when he offered to go the ice cream, and depending on that the scale could be tipped either way (sill ESH)",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 73,
              "content": "I disagree, I don’t think she’s an asshole per se. If I were in her shoes, I’d decline the offer to go get the ice cream too. Because what kind of harpee would I be if I accepted and asked him to drive hours just so I have my favourite ice cream? By asking her the question he’s putting the decision about the remedy to the conflict in her hands, which is unfair because she didn’t do anything wrong and she shouldn’t be responsible for solving the thing. He should have told her: I’m sorry, I’ll go get it now. And then just go out and by the freaking ice cream (and if he really wanted to make amends, bring something extra like her favourite cheese as well).",
              "id": 46,
              "comments": [
                {
                  "score": 62,
                  "content": "> By asking her the question he’s putting the decision about the remedy to the conflict in her hands, which is unfair because she didn’t do anything wrong and she shouldn’t be responsible for solving the thing.\n\nYES. Thank you! He's created the problem by being irresponsible, or at the very least unreliable, and now he's putting the onus on her to solve the problem he created. Then saying \"you're overreacting to the problem\", when it never should have existed in the first place",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "And cheese? I like the way you think. :)",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "This situation is similar to this\n\nhttps://mustbethistalltoride.com/2016/01/14/she-divorced-me-because-i-left-dishes-by-the-sink/\n\nI would vote the wife is not the bigger asshole. It's not about the ice cream.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "No, dude. It doesn’t just matter who started it, it matters who finished it and how. People fight about dumb shit and those dumb fights get out of hand. He escalated a fight about ice cream into divorce-level territory. It’s one thing to sleep on the couch during a fight — leaving to go to a friend’s house is even bigger. Taking the bed? You’re approaching the point of now no return. He’s definitely the bigger asshole.",
              "id": 50,
              "comments": [
                {
                  "score": 19,
                  "content": "Approaching? I'd be surprised if she didn't tell him to keep it there and himself as well.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Omg that's what she's going to do.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I don’t think it matters who started it, they’re supposed to be adults. Thats like when you parent catches you hitting your sibling “she started it!” is a shit excuse. ESH for sure. They’re both being brats.",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Remember that we’re only getting one half of this story.",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Boo. Moving a bed bigger than a twin is cumbersome imo. A lot of time during the dismantling process for a mature epiphany to emerge.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Of course we only have one side of the story.  While OP may have said he would go get it we don't know what exactly he said or how he said it.  I suspect that he wasn't apologetic and patronizingly said he would go get it.\n\nOf course we don't really know and IDK if it really matter who is the bigger asshole.  Both of them need to change their behavior.",
              "id": 56,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "> Your actions remind me of a kid that says \"You won't play fair in the sandbox! I'm taking my toys and going home!\"\n\nI'm not sure that analogy really works. It's more like if one kid says \"I don't want you playing here. Leave your toys here for me to play with and go to some other sandbox!\"\n\nand the other kid says \"But they're my toys and I want to play with them\"\n\nand the first one says \"But it's my sandbox\"\n\nso the kid says \"Fine, I'll leave since it's your sandbox but if you're kicking me out, I'm not leaving my toys for you to play with. I still want to play with them, so I'll take them and play with them somewhere else.\"\n\nNot quite as simple. But even that analogy doesn't work, because a bed, and a place to live, are not toys in a sandbox.",
          "id": 57,
          "comments": [
            {
              "score": 33,
              "content": "They're married. It's not \"my house\" and \"your bed\", it's theirs together. They both fucking live there.",
              "id": 58,
              "comments": [
                {
                  "score": 3,
                  "content": "Yeah, which is why this analogy breaks down altogether, even if we try to adjust it. A bed and a place to live are not toys and a sandbox.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Just add in that they both own the sandbox and the toys, but wrote their names on the objects they consider theirs...",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I think you're missing the point. The analogy isn't about a literal comparison of situations; it was an attempt to compare the emotional reaction in both situations and illustrate how childish that reaction is.",
              "id": 61,
              "comments": [
                {
                  "score": 2,
                  "content": ">  it was an attempt to compare the emotional reaction in both situations\n\nThe situations are nothing alike, it's not an analogous comparison. It completely changed the situation to make a (bad) point. \n\nThis is nothing like one child taking his toys and going home because he's mad. That is not an analogous situation. This is more similar to one child getting *kicked out*\n\nand taking their toys with them when they do.\n\nIt doesn't have to be *literal* to be analogous, but the above poster's analogy is neither literal *nor* analogous.",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "“You won’t play fair in the sandbox! I’m taking my toys and going home!”\n\nExcept if the other kid is actually not playing fair, then the appropriate response would be to take your shit and leave.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "My kindergarten students don’t even act this childishly with one another. If one of them ever pulled something like this “bed move” (it’s mine and only I can have/use it - at any cost apparently) a privilege (one recess) would be taken away. The kid would do something with me during recess and we’d quickly talk about why the behavior was not kind and what we should do next time. Luckily my students are sponges when it comes to reasoning, they don’t understand pettiness, and they honestly don’t want to hurt anyone’s feelings and they feel extremely bad if they do......I don’t see any of that from OP. \n\nEnjoy the single life OP....I don’t see a huge possibility of coming back from this one.",
          "id": 64,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Throw in an asshole vote behind a friend that didn't tell you you're being crazier than a shithouse rat and let you set up a bed there. If one of my friends showed up with their fucking bed in tow, I would turn their ass around back home and then take them to the bar to chill out. Sleep in my guest room if you need to, but don't enable that level of crazy.",
          "id": 65,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "> Your actions remind me of a kid that says \"You won't play fair in the sandbox! I'm taking my toys and going home!\"\n\nOk, so if I'm at the park, playing in the sandbox, and some other kid comes up and starts pushing me around or taking my toys without asking permission first, you're telling me I should either A: leave my toys there and leave or B: stay and let this person bully me?\n\nOf course I'm going to take my fucking toys and leave because assholes don't deserve my time. So really, that is a very, very bad analogy you made.",
          "id": 66,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "ESH - This is one of the funniest stories I've seen on this sub. Y'all are a bunch of children.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I would say equally ESH she continued to escalate it even after he offered to make a return trip and she insisted he should not. When he agreed she escalated further. On one end he was ridiculously petty about it but, at the same time so was she and she would not stop escalating. I would say it is equal.",
          "id": 68,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6079,
      "content": "Info do y’all want your marriage to end?",
      "id": 69,
      "comments": [
        {
          "score": 2542,
          "content": "That's really the only explanation I can get to. OPs wife was an asshole, and OP reacted with one-upping to the point of 'let's divorce'\n\nIt's that or these people are 7 years old.\n\nCongrats OP, you 'won'. Was it really worth it?",
          "id": 70,
          "comments": [
            {
              "score": 572,
              "content": "Yeah this is some pretty impressive over reacting on both parts over such a minor thing. Not to mention, when you're married there is no \"this is MINE\", you legally share everything. Seems like both OP and the wife are gonna be looking into divorce as their next step instead of one of them just buying the damn ice cream. Curious if there are deeper issues that are at play here, like the wife is constantly flipping out over little shit and taking her stress out on OP and he never sleeps in the bed and is fed up, or he never does what he says he's going to and the ice cream was the straw that broke the camel's back, or what ever else.\nI'm gonna go with- INFO or ESH if the situation is literally just as he wrote it and they normally get along well.",
              "id": 71,
              "comments": [
                {
                  "score": 144,
                  "content": "Man think of all the ice cream they could have got for the price of 1 divorce.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 10,
                      "content": "They could probably afford weekly deliveries for a year",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Lol can you imagine 🍨🍨🍨🍨🍨🍨🍨🍨🍨",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My thoughts, exactly.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 354,
              "content": "This was never about ice cream. They have massive communication problems and probably are headed for divorce. In this case I think divorce is the only win here.",
              "id": 76,
              "comments": [
                {
                  "score": 32,
                  "content": "You are so right.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "They may be headed toward the divorce but there are so many things they can do to avoid it. OP, try taking the sage marital advice to say “yes” to your spouse as often as possible. \n\n“Yes. I am going to get your ice cream.”\n\n“Yes. I will sleep on the couch. “\n\n“Yes. I was thoughtless and I’m sorry.”\n\nMany people can save a marriage by changing themselves regardless of what their spouse does.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "They should end it anyway.  Both of them act like fucking children.  When not even one of them can be an adult,  that's a problem.",
              "id": 79,
              "comments": [
                {
                  "score": 39,
                  "content": "Honestly, I just can’t imagine caring this little about my spouse and caring so much about “winning” over the person I supposedly chose to spend my life with. What do you even get out of that??",
                  "id": 80,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Someone to repeatedly 'win' against, that you can learn how they work and what ticks them off most so you can argue that since they are so pissed, they're wrong, making you right?",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Or they could grow together by deciding to.",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I’d hate to unleash these two petty, childish people back into the dating world. They need to do some growing up first.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Exactly what I was thinking.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yea this was definitely not about the ice cream",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 169,
          "content": "Oh my god can you imagine being over the age of 12 and being this bratty, whiny, and dumb?",
          "id": 86,
          "comments": [
            {
              "score": 73,
              "content": "[deleted]",
              "id": 87,
              "comments": [
                {
                  "score": 11,
                  "content": "If you think this is just about ice cream you are clearly too young to understand. \n\nI’d bet he never forgets things he wants since the grocery store is 1.5 hours away. However, he forgot TWICE when he knows she wants ice cream. She has a stressful job, and he knows she’s stressed. How hard is it to write down the word ice-cream when you go to the store? \n\nAlso, there is no way this is the only thing he doesn’t remember. Ice cream was probably just the last straw...so what does he do? Takes the bed apart and turns his phone off.\n\nAnybody who thinks this is ESH either has no empathy, has never been in a relationship, or is 16.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Do we know if it's the last straw? How do you know she's not overreacting? What we have is what is written here. You can theorize all you want but that doesn't mean anything until OP gives more info.\n\nBesides, there are way more mature ways to deal with this issue for both parts. Even if OP is the bigger asshole their marriage still has clear communication problems.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "You've clearly never met my ex-husband.",
              "id": 90,
              "comments": [
                {
                  "score": 9,
                  "content": "Are you absolutely certain he wasn't two 12 year olds in a trenchcoat?",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "This made me laugh out loud.",
          "id": 92,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "Came here to say pretty much the same thing. Obviously ESH but the bigger concern should be a marriage ending, not who’s the bigger asshole. Keeping score does not fair well in relationships. It’s not a battle, it’s a partnership.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Seriously. I’m so confused by a married couple arguing over who bought the bed or whose name is on the lease. You’re married!",
          "id": 94,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "Yeah... This sounds like an end of the road scenario. How do you jump right to cussing at her and not only taking the bed apart but taking it OUT OF THE HOUSE? And he's turning his.phone off? JFC.",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Very simple to me too, do you want your marriage to succeed? Your actions in response to your wife are definitely, 100% counterproductive if you say yes. Communication is so crucial, especially when one is more annoyed and frustrated than the other. Things like this can be fixed, very easily too but escalating matters will only lead one way and it's sad to me when things could go a very different way, this is your marriage, your life, not a joke.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Over ice cream at that.",
          "id": 97,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4274,
      "content": "Going against the grain with YTA. I've seen it soo many times, not only in subs like these but also among friends, relatives, and my own relationships, where a \"fight over ice cream\" is not \"a fight over ice cream\". Oftentimes something small like forgetting to get ice cream twice from a store over an hour away is just the latest thing in a series of inconsiderate acts, all culminating in a mondo fight that's actually about being a responsive partner. Offering to fix it by going to the store again just shows ignorance of the actual underlying problem, and is just putting a bandaid on a broken arm. If you want to leave, leave, but don't act like being petty is some moral high ground.",
      "id": 98,
      "comments": [
        {
          "score": 1324,
          "content": "I think you're right. The extreme that he went to here is a pretty good indicator of his emotional immaturity. I doubt someone who would go to lengths like that is the most capable person at understanding what a fight was about.\n\nI would have arguments with my husband and insist over and over again \"it's not about x really; it's about y.\" And later he'd be like \"it's so stupid that we had a huge fight about x.\"\n\nAs I mentioned in another comment, OP's behavior reminds me of the times my (soon to be) ex did extreme things to keep me from sleeping in our bed (tipping the mattresses up and rolling me off). This guy sounds so much like him. It's definitely something my ex might have done if he had friends to go stay with.",
          "id": 99,
          "comments": [
            {
              "score": 507,
              "content": "> if he had friends to go stay with.\n\nBURN",
              "id": 100,
              "comments": [
                {
                  "score": 2,
                  "content": "https://youtu.be/mVgXGw_XhRQ",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 398,
              "content": "Yeah, I had a boyfriend once that would never listen to a thing I said unless I made a federal case out of it, and would then tell me I was a spoiled brat for making a case out of those issues.  Fuck that guy.",
              "id": 102,
              "comments": [
                {
                  "score": 109,
                  "content": "During marriage counseling with my now-ex, our therapist asked me why I had to keep setting myself on fire to get anyone to notice there was a problem. This guy reminds me of exactly that. And yeah, he thought I was a nagging harpy, too, and never understood what the problem was.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Reminds me a lot of this article:\nhttps://mustbethistalltoride.com/2016/01/14/she-divorced-me-because-i-left-dishes-by-the-sink/\n\nTl;dr - it’s not about the little things you don’t do, it’s about the accumulation of disrespect that those little things represent.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Yup.  This is something that I’m still working on getting my current fiancé to understand.  I’ll mention something casually 10 times and he’ll ignore it or forget and then finally I can’t take it anymore and lose my shit over it and he’s like “Damn why are you so upset about it.  You could have just told me” it’s infuriating",
                  "id": 105,
                  "comments": [
                    {
                      "score": 16,
                      "content": "[deleted]",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This will not magically get better after marriage. Think very carefully if this is the life you want.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 211,
              "content": "I totally agree. I don’t trust OP’s version of her reactions, because I feel like she probably said, “it’s not about x, it’s about y” and he’s over here on reddit posting about x.",
              "id": 108,
              "comments": [
                {
                  "score": 68,
                  "content": "I'm convinced he's looking for attention and validation here. He could have just gotten her some ice cream either of the two times he was at the store (according to him) and it would be fine. If it's such a small thing, he could have done it so easily. Way easier than dismantling a bed and moving it to a friend's house, if this is even a real post. No part of the process of taking apart his bed he thought \"Well this is fucking stupid of me.\"",
                  "id": 109,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Yeah, I feel like this is just more of AITA's favorite thing--anti-women fiction",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "My ex would insist that my side of the sleep number bed be the same number as his, change it and hide the remote; take my pillow out from under my head if he thought I had taken \"his\" pillow... while I was sleeping; not take clothes off the bed if they were on my side because \"they were my things and my responsibility\" but he would get into bed on his side and fall asleep, so that when I came to bed later I would get in thinking nothing of it only to discover there was still stuff on the bed, but only on my side",
              "id": 111,
              "comments": [
                {
                  "score": 35,
                  "content": "Ugh what an asshole",
                  "id": 112,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Major.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Almost wanted to downvote you cause I-was so pissed at your ex. Ugg. Ass.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Today’s edition of “people I’ve never met or spoken with but hate anyway” is your ex",
                  "id": 115,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh it gets worse... the stories I could tell",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Wtf",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "What? But isn't being able to have different numbers the *purpose* of a sleep number bed? Those things aren't cheap!",
                  "id": 118,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yep. He said he kept rolling down from my side and that it was interrupting his sleep.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": ">\tinsist that my side of the sleep number bed be the same number as his\n\nCould you explain what this means?",
                  "id": 120,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Sleep numbers can adjust mattress firmness. You can have different settings for either side.",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": ">tipping the mattresses up and rolling me off\n\nGood lord, that is psychotic. Glad to hear this person will soon be an ex.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "It sounds like the \"y\" might be that he's not being a very thoughtful partner. It's not about the ice-cream, it's about the fact that if you were being considerate you would get her ice-cream because she's been stressed at work. Just like if you were thoughtful, you wouldn't move the bed just to make a point- a petty one at that.",
              "id": 123,
              "comments": [
                {
                  "score": 5,
                  "content": "This is soo true.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "There’s the possibility he knows the fight is actually about y, but if he pretends/insists to you it’s really about x, eventually you might believe it— and then the tables get turned on you. Basically, instead of him being justifiably criticized over y, he gets to call you petty for fighting with him about x.\n\nLet’s take OP’s post as an example. If he makes it about his wife freaking out over ice cream, rather than him being a bad partner, she’s the unreasonable one and he doesn’t have to take responsibility or do self-reflection. \n\nSometimes it really is malice, not ignorance.",
              "id": 125,
              "comments": [
                {
                  "score": 2,
                  "content": "This sounds like gaslighting...",
                  "id": 126,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It is. Or if it technically isn’t, it is its incestuous cousin.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This is AITA in a nutshell. People post here 97% of the time seeking validation because they know they're skewing events and that they are, in fact, the asshole.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "When I was in marital therapy, regarding a fight the therapist would say, \"It's never about what it's about.\"",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 353,
          "content": "Yeah, I wonder if this is like that person yesterday (I can't remember if in /relationships or here) who had  a partner who insisted he'd do stuff if she didn't nag him. She'd given her partner 6 weeks so far to buy paper towels and he hadn't done it.",
          "id": 130,
          "comments": [
            {
              "score": 99,
              "content": "I think it's more similar to the one about the wife that went on vacation while the husband was ill in the hospital and now he wants to lie and pretend he went on vacation without her.",
              "id": 131,
              "comments": [
                {
                  "score": 24,
                  "content": "Yep read that one too.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Anybody have links these seem like fun reads",
                      "id": 133,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Or the guy who thought his foodie wife actually liked Olive Garden.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I read that too. I agree with you.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Working on 5 months for new toilet parts and longer screws to install the little plate thing for our deadbolt lock on the back door.  \n\n2 years for a lawn mower but I’ve given up on that one.  If he wants me to waste $100 a month paying for someone else to do it, so be it.  He can explain to the kids why their college fund in shrinking by the second.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 229,
          "content": "[deleted]",
          "id": 137,
          "comments": [
            {
              "score": 17,
              "content": "Well she did tell him to sleep on the sofa, clearly they’re not together. I’m not gonna sleep on the sofa because my gf is angry, if she wants to be alone she’s welcome to go there. But yeah he’s the asshole, even without the full story packing the bed up and going to a friends place is absurd",
              "id": 138,
              "comments": [
                {
                  "score": 59,
                  "content": "Dude, telling someone to sleep on the sofa is normal-fight stuff. Escalating it to an argument about who bought what is not.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Yeah it’s completely normal to tell someone to sleep on the sofa, but it doesn’t mean it’s ok. I wouldn’t sleep on the sofa either, it’s a shared bed, both get to sleep there or no one does.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Yeah exactly. So far with my guy the only time one of us slept on the couch was a night he was snoring REAL bad and I just moved to get some sleep. Didn’t wake him up to tell him to go, didn’t keep him awake since he accidentally kept me awake, and for sure didn’t dismantle the fucking bed. \n\nI still can’t get over OP’s reaction here. I’d leave and hope she does",
                  "id": 141,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Massive over reaction from OP, but as I said I’d have slept in the bed, angry wife or not. It’s a bed, it’s where I sleep.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "telling sombody \"i am mad at you so i am punishing you to sleep on the sofa\" is not a move i would agree with. if you are so mad at me that we can't sleep in the same bed that is your issue since i am not that mad at you. it is your choise.\n\nhowever taking the bed is super stuborn and childish but so is aruging over ice cream and who owns what. OP and his SO need a proper honest open talk over what is bother them with there relationship.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 189,
          "content": "THIS. And even if the fight genuinely was over ice cream, even if she was being irrational, OP’s reaction is just SO awful it obliterates that. He didn’t just fire shots, he nuked the whole relationship.\n\nAnd dismantling and moving a bed is hard and takes time. It takes a special kind of vindictive person to make a threat like that and then be angry for the hour+ it takes to follow through. It’s a controlling power move and it’s honestly manipulative and abusive.\n\nThis whole time, of course, his wife’s been driving three hours to get ice cream — and probably crying the entire way. Possibly having decided to apologize. And then she gets back to an empty house and no bed, utterly crushed. While OP’s sitting smug at his friend’s house, clearly remorseless, only avoiding turning on his phone because he doesn’t want to deal with the consequences of his actions. Dude can’t empathize at all. It’s borderline sociopathic.",
          "id": 144,
          "comments": [
            {
              "score": 62,
              "content": "I just cant imagine wanting to purposefully hurt my spouse. Even when I’m upset or hurt I just want to work things out or walk it off and cool out or at most make him know just how angry I am and just how much he upset me.... but I could never want to hurt him for more than a vindictive second and could never go through with doing something purposefully hurtful. I just don’t get it. I married my husband because I love him, and because I love him I want to protect him and see him happy. Having this much disrespect for someone I love is something I don’t think I’ll ever understand.",
              "id": 145,
              "comments": [
                {
                  "score": 44,
                  "content": "I think you nailed it. There’s a huge difference between how she acted and how OP acted. Purposefully hurting, disrespecting, and humiliating her (even though the humiliation is just between them two, sometimes that’s the worst kind). \n\nIf OP is that awful over a small thing, imagine when she is sick and needs something or a big stressor in the relationship comes up. His mindset shows the relationship won’t work and shouldn’t work",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 164,
          "content": "This is just it. These stories always seem to come to \"I made this ONE little tiny mistake and my spouse just FLIPPED OUT for no good reason, so I did this super petty thing to get revenge. AITA\"\n We're clearly missing half the story where OP leaves out 95% of the discussion and their own behaviours that may have led up to this point.",
          "id": 147,
          "comments": [
            {
              "score": 27,
              "content": "For sure, and a spouse who’s otherwise supportive and understanding and a healthy partner doesn’t suddenly turn petty when their SO is upset about something, even if it’s really something unreasonable.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "[deleted]",
          "id": 149,
          "comments": [
            {
              "score": 3,
              "content": "Yeah but I think some people are still jumping to the conclusion that it's not petty on the wife's part. We don't know how often he forgets to do things and on the surface it's just some fucking ice cream, not worth fighting about. I think people taking a side on that part of the issue are letting their biases from their personal relationships show (i.e. either \"my spouse nags me about small things all the time!\" or \"it's the straw that broke the camel's back!\"). \n\nI think the truth in these situations is usually somewhere in between. One spouse is a little forgetful or inconsiderate and the other is too critical and can make mountains out of molehills. Sounds to me like ESH, OP is def at least TA either way though for a complete overreaction regardless of his wife's actions.",
              "id": 150,
              "comments": [
                {
                  "score": 8,
                  "content": "What makes me suspect he's inconsiderate is that he's dismantling the bed. Forgot ice cream twice + no empathy when she's upset + dismantling the bed does sound like an inconsiderate jerk to me.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 93,
          "content": "This 100%. My husband and I have rocky patches sometimes and I wish he’d understand that the fight about him leaving his dirty socks all over the floor wasn’t about him leaving dirty socks all over the floor.",
          "id": 152,
          "comments": [
            {
              "score": 17,
              "content": "Tell him. Be the responsible communication you want to see in the world.",
              "id": 153,
              "comments": [
                {
                  "score": 127,
                  "content": "It usually goes “I’m mad that you keep leaving the dirty socks on the floor and leave them for me to pick up, because it feels like you don’t respect my time or energy and just treat me like a maid” and then you get the response of “I do respect you babe, I just don’t understand why socks make you so mad”",
                  "id": 154,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Hahahahaha, this is 100% fact!",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "This. My dad constantly does shit that undermines my agency, and when I get upset and spell out why I’m pissed, he always acts like I’m overreacting. He explicitly told me at one point that when I’m upset, he just shrugs it off because he knows I’ll be over it by the next day, and that the best solution is to just let things roll over.\n\nAnd alright, fine. But also— why the fuck do you not realize what the root problem is? I’ve told you so many times!\n\n“Be the responsible communication you want to see in the world” is, quite frankly, condescending and uncalled for. Why assume that the OP here hasn’t made an effort to initiate conversation? Communication is a two-way street, and it doesn’t work if the other person puts their foot down and chooses to remain ignorant. Solving the problem isn’t that simple.\n\nAnd at the end of the day, you still care about that person, and how long are you going to harbor your anger? Are you going to burn the entire relationship over this? It’s not as if being upset for a week (or to be more accurate, making the active effort to remain upset even when you’d like to move on) is effective either. And providing “consequences” just serves to amplify their righteous belief that you’re being surly for the sake of it, i.e., that you’re not capable of handling small conflicts with grace.\n\n(As in, if OP here threw out the socks to make a point, I doubt her husband would suddenly see the light and realize the mistake in his attitude.)\n\nIt’s such a shitty situation. As for the post, I’d say ESH/YTA, because OP is the bigger asshole for sure.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "That's when the socks go in the garbage. I'm an adult, you are an adult, we both know where the dirty socks go, if you can't take care of them, I will for you, they go right in the garbage.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "I’ve tried over and over and over. \n\nHe just doesn’t  understand. Or maybe he does and he’s just too stubborn to apologize or change his habits.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Nah, I have just come to the conclusion over years of being disrespected that this is his passive way of getting me to do everything.  If he does a shitty job of something or just doesn’t do it for weeks on end I will finally break down and do it.  I confronted him earlier this year and told him I saw through his bad behavior.  He just laughs and says passive aggressive thing like “I never told you to do laundry, or clean the bathroom, or cook my dinner”. Yeah stupid you get what you ask for.  So we went through a painful three weeks where I did nothing of his, no laundry(while doing my own), left his dry cleaning while picking up mine, went grocery shopping for food I was interested in and cooked meals for one.  Week one he was fine, but by week two he was annoyed, then week three he had friends over and I had intentionally not cleaned his man cave or the adjoining bathroom and someone commented on all the carry out food and overflowing trash. He finally came to talk to me about chores.  They are split a bit more fairly although I still have about 75% of everything on top of a full time job.  And yes we earn within $3k of each other so it’s not like I have some easy job.  It just sucks living with someone so centered on themselves and I honestly blame his parents for raising two men who both are so self centered.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "You know it's the second one.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Exactly, sounds like she’s overburdened with the cognitive load in the relationship",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "I’m so glad you said this.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "[Here's a good article about that.](https://mustbethistalltoride.com/2016/01/14/she-divorced-me-because-i-left-dishes-by-the-sink/)",
          "id": 163,
          "comments": [
            {
              "score": 6,
              "content": "Thanks for sharing this! I do this to my husband and it’s given me a better understanding of different views. It’s not about him getting upset that I haven’t done the dishes yet (because I was going to do it later, which I do) it’s about giving him more respect. Thanks again!",
              "id": 164,
              "comments": [
                {
                  "score": 2,
                  "content": "Im glad it was able to help give you some perspective! It's one of 2 articles that I share as often as possible because it's just so relevant to so many people.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Is this the other? https://english.emmaclit.com/2017/05/20/you-shouldve-asked/",
                      "id": 166,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2114,
      "content": "Uh, dude. You’re laying in a bed you disassembled and moved to another house to spite your wife (who, by your description, is a petty shrew). Do we really need to rule on this?  Clearly ESH, but you suck more.",
      "id": 167,
      "comments": [
        {
          "score": 242,
          "content": "[deleted]",
          "id": 168,
          "comments": [
            {
              "score": 29,
              "content": "3 minutes of life is worth the laugh , IMHO\n\nBut yup- enough Reddit. Heading back to M1finance advise - the reason I logged back to Reddit",
              "id": 169,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I’m pretty sure this dude posted his ice cream story on here under a different account and his wife is pregnant.  He seems like the asshole imo.\n\nFound [it](https://www.reddit.com/r/AmItheAsshole/comments/bgh3m9/wibta_if_i_tell_my_wife_that_i_will_no_longer_be/?utm_source=share&utm_medium=ios_app)",
          "id": 170,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1175,
      "content": "ESH, really. If you're getting this heated over ice cream, you've got larger issues that need to be addressed.",
      "id": 171,
      "comments": [
        {
          "score": 250,
          "content": "I mean tbh it's probably straw that broke camels back for her. Think about it twice he went to the store and she asked for ice cream and twice she wasnt important enough to remember that for. What else does he not bothering doing for her that she asks? Shes upset he doesnt think about her and consider her. \n\nYou and OP both need to read \"she divorced me because I left the dishes by the sink\". Its not the dishes itself, it's that it represents his lack of consideration for her needs and what she does.     \n\nIf he asked for ice cream at the store I'd bet shed remember because she prioritizes him. Sounds very much like he also prioritizes him, instead of her ever.",
          "id": 172,
          "comments": [
            {
              "score": 144,
              "content": "Ice cream sounds like a trivial thing to be so mad over but if their store is an hour and a half away (!!) she cant just be like \"oh shoot, alright I'll go run and get it.\" He really did need to get it for her. And he forgot *twice*! Honestly I'd be pretty peeved if i were her too",
              "id": 173,
              "comments": [
                {
                  "score": 89,
                  "content": "Yeah people arent gettjng it's not about the icecream it's about the lack of thinking of her. At the store even with a list and remembering everything I text my husband asking if theres anything else he wants, and he does the same. It's just loving and considering your partners wants.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Exactly! IMO OP is more the asshole than the wife",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Well also don't forget that if it's really that rural there might not be adequate cell service coverage to do something like that.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "At the same time... Why the fuck didn't they use a shopping list? \n\nLiving 1.5 hours away from store and not using a list is so stupid. I live 5 min from 3 different stores and a list is still vital. I can't go to the store every day just because I forgot half.",
              "id": 177,
              "comments": [
                {
                  "score": 21,
                  "content": "I forget my own groceries when I go to the store, never mind other people’s stuff. A list is definitely vital",
                  "id": 178,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Exactly!",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Right? Hell even with a list I'll double check with my spouse if theres anything else he wants while I'm at the store with a quick text or call. And he does the same. Cause we consider and prioritize each other. I'd bet checking to see if his partner needs or wants anything doesnt even occur to him.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Well... I would have let him go get it instead of storming off myself. That's just irrational.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "At that distance, its not a shopping run, its a damned supply run.  In fact, you could make a case that shopping when you need things is a bad idea in their situation.  Keep a stock of things in the house so that even if you are getting low, you still have alternatives.  Don't buy 1 bucket of ice cream, buy 2 or 3 and keep those in reserve.  \n\n&#x200B;\n\nMy supermarket (I can walk to it if I feel like it) has the nasty habit of bring products I like and discontinuing them, so instead of wasting my time arguing with them, I just buy a shitload of what I like.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">If he asked for ice cream at the store I'd bet shed remember because she prioritizes him. Sounds very much like he also prioritizes him, instead of her ever.\n\nHow do you know? Wild speculation. We literally know nothing about her other than she has a stressful job and likes ice cream. Anything else you are making assumptions based on what exactly? Sex? Your own experience? This sub needs to stop acting like redditors are detectives and take things as they are presented.\n\nIf op lies in the post, they are only fooling themselves and it will only backfire in the long run. As they get validation of how they act. \n\nBased on the info we have, ESH. Her for not communicating properly (if it wasn't about the ice cream) and for using sleeping on the couch as punishment and him for being a spiteful child and taking apart the bed. Either person could fix the situation by backing down but neither has, ESH.",
              "id": 183,
              "comments": [
                {
                  "score": 6,
                  "content": "I was going to post something similar, but you said much more elegantly. This response assumes everything about their relationship with minimal info.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The narratives people build up here are amazing and ridiculous.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Nah. If you want me to sleep on the couch because I forgot to get a totally non-essential item from the store, you've got issues.",
              "id": 186,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 226,
          "content": "yes but the issue of getting heated can actually be solved with ice cream.",
          "id": 187,
          "comments": [
            {
              "score": 104,
              "content": "If only instead of “Divorce! Lawyer! Leave him!” we saw real, empathetic humans asking, “Have you tried ice cream yet?”\n\nReally, we could change this world I think.",
              "id": 188,
              "comments": [
                {
                  "score": 40,
                  "content": "Maybe we need a new ruling. Perhaps CTFDAESIC - calm the fuck down and eat some ice cream?",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Ssssshhhhhh! I'm a divorce lawyer! You wanna put me out of business? How will I provide ice cream for my wife if I don't work!??",
                  "id": 190,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Become an ice creamer instead",
                      "id": 191,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Ice cream: just as much ice as cream.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Plus, I don't agree with kicking people out of their beds. If you don't want to sleep next to someone then you should find elsewhere to sleep. Her kicking him to the Couch is unneeded. \n\nESH",
          "id": 193,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 706,
      "content": "YTA. From what you've said, it sounds like your wife overreacted. However, based on your ridiculous childish behaviour, I'm guessing that forgetting ice cream isn't the only thing you've done. Seems more likely that you're pretty inconsiderate and forget of her needs and wants a lot, and the ice cream is just the straw that broke the camel's back. Why even get married if you're going to behave like this after an argument??",
      "id": 194,
      "comments": [
        {
          "score": 135,
          "content": "Exactly, if you know she is stressed at work and something as small as ice-cream can make her feel better then it's pretty darn inconsiderate to not think of these things while you're at the store, especially if the store is an hour and a half away.",
          "id": 195,
          "comments": [
            {
              "score": 68,
              "content": "Fucking *twice*.\n\nDefinitely not everyone sucking (edit for bot) either. He admits she is stressed and that he escalated instead of taking one second to think of her or checking in at the store two separate times. If there's any consideration whatsoever he'd just grab ice cream every or every other trip to the store. Or grab her something else she likes. Instead of stealing their bed voluntarily.",
              "id": 196,
              "comments": [
                {
                  "score": 17,
                  "content": "Right? You would think that since the store is that far away you would do a double and triple check that you aren't forgetting anything before leaving- up to and including texting your SO to make sure they don't need anything. But I suppose that is too much to ask of some people...",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I hope she realizes she deserves better. Last fall when I was very stressed, my SO went 30 min out of his way to get me a cozy blanket, candle, and stuff to make my favorite boozy drink. Didn’t ask him to, he just wanted to help me feel better. I used to be a badddd relationship and didn’t realize I deserved to be treated better. With my SO, I don’t have to ask him to care for me and I’ve never had to worry about him doing anything petty, especially disassembling the fucking bed. OP is ridiculous",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "[pretty sure this is op ](https://www.reddit.com/r/AmItheAsshole/comments/bgh3m9/wibta_if_i_tell_my_wife_that_i_will_no_longer_be/?utm_source=share&utm_medium=ios_app)",
          "id": 199,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 491,
      "content": "Woah, this is a special ring in the circle of petty-hell.\n\nNeither of you handled this situation like adults and both of you really need to take a long look at your communication skills and your relationship.\n\nThese are not mature responses to.... ice cream and signal a lot of red flags.\n\nESH.",
      "id": 200,
      "comments": [
        {
          "score": 62,
          "content": "It's most likely not just about ice cream. The fact he forgot it *twice* is a sign that he probably isn't as considerate or good a partner as he thinks he is, and this was the straw that broke the camel's back.",
          "id": 201,
          "comments": [
            {
              "score": 9,
              "content": "I'm curious to know if he's forgotten anything of his. \n\nBecause if he's just forgetting the wife's ice cream. He's just a dick.",
              "id": 202,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 332,
      "content": "How old are you guys?\n\nThis either didn't happen or you are super immature.",
      "id": 203,
      "comments": [
        {
          "score": 64,
          "content": "I don’t believe this happened at all",
          "id": 204,
          "comments": [
            {
              "score": 15,
              "content": "[deleted]",
              "id": 205,
              "comments": [
                {
                  "score": 13,
                  "content": "Well he said his wife left for the ice cream and he did this while she was on her three hour trek. Doesn't take three hours to move a bed.",
                  "id": 206,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "The round trip is 3 hours (1 1/2 hours each way) if the wife didn't make any stops. That's plenty of time to dismantle the bed and high tail it out of there with time to spare.",
                  "id": 207,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Taking apart a bed might take 10 minutes... Maybe 15 if you have a fancy headboard",
                  "id": 208,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "[deleted]",
          "id": 209,
          "comments": [
            {
              "score": 5,
              "content": "An extremely petty man... \nI wonder if we're seeing more of these because one dude posted his petty shit and everyone responded, so it set off a chain reaction.",
              "id": 210,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Maybe it’s one of those metal beds that are easy to take apart?\n\nBut yeah, not sure I buy it either. I think he WANTED to do this, or even THREATENED to do it, and now he wants to live out his revengeporn fantasy on the internet.",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I don't know dude... I'm typically super quick to call bullshit on Reddit, but this is fully feasible. I've seen some mad petty fights, been involved in some too. Disassembling a bed is not terribly difficult at all, like a 5-10 min job. Have you ever been in a relationship that's good and toxic? The absolute rage that can build up can be absolutely blinding. Rage like that mixed with affection can inside some pretty bonkers reactions.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 331,
      "content": "YTA. You escalated this beyond all reason.",
      "id": 213,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 298,
      "content": "[deleted]",
      "id": 214,
      "comments": [
        {
          "score": 319,
          "content": "It's really not hilarious when you're married to someone like this. It sounds so much like my soon to be ex. We had a huge screaming fight once. I went to bed first. He came in an hour later and tipped the mattress up on it's side and rolled me out of bed, stating that he wanted to sleep in his bed and didn't want to sleep next to me. I told him he could sleep here or on the couch, and I didn't care but I was sleeping there. So when he set the mattress down, I climbed into the bed and lay down again. He tilted the mattress up again, and I rolled off. I got back in bed. Hi did it again but this time basically crushed me into the floor (I was stuck between the bed and the wall) until I gave up and went and slept on the couch. It wasn't funny. It really made me feel how much he despised me.\n\nThis guy is a huge jackass.",
          "id": 215,
          "comments": [
            {
              "score": 107,
              "content": "Yeah, that’s pretty abusive. I’m glad you’re getting out.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "I would've broken his face, that's infuriating.",
              "id": 217,
              "comments": [
                {
                  "score": 10,
                  "content": "No you wouldn't.",
                  "id": 218,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Thats not an appropiate response, more of an asshole than OP.",
                  "id": 219,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Geez! Glad you're getting out! Shit like that NEVER  improves. I had an ex light my bed on fire with me in it once. (I was fine, my awesome flannel sheets and comforter were not.) Tipping the bed over (repeatedly) is pretty next level obnoxious though!\n\nYou deserve so much better, I hope you find it.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Idk, I personally would be pissed if my husband thought I deserved to sleep on the couch for forgetting his ice cream. That in itself is obnoxious... I wouldn’t have taken the bed bc I’m a small woman who can’t disassemble something like that, but I sure as hell wouldn’t let him hold the lease over my head and kick me to the couch.",
              "id": 221,
              "comments": [
                {
                  "score": 13,
                  "content": ">I personally would be pissed if my husband thought I deserved to sleep on the couch for forgetting his ice cream\n\nThat right there is what cements it as ESH to me. Yeah the guy probably isn't telling the whole story and it probably isn't about ice cream and he was for sure a petty asshole for taking the bed\n\nBUT\n\nI could never be that angry and think my wife deserves not to be in OUR bed in OUR house. If I am that angry where I don't want to sleep next to her then it's my choice for me move to the couch, if she is that angry at me then she can go to the couch...\n\nWife is also an asshole for trying to kick him out of the bed and then holding who's name is on the lease over his head.\n\nThey both sound like real gems.",
                  "id": 222,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "It’s not about the ice cream. It’s about the lack of consideration for her needs.",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "its not like he wanted her to sleep on the couch. She insisted on them sleeping apart. So if that is what she wants, then she should have to face the consequence of her wish and move out of the bedroom.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 112,
          "content": "NGL, I laughed at the idea of some righteously indignant man taking apart a bed, dragging it to his truck, calling a friend and asking if he can spend the night.",
          "id": 225,
          "comments": [
            {
              "score": 24,
              "content": "That is the most glorious part of this story",
              "id": 226,
              "comments": [
                {
                  "score": 95,
                  "content": "I also want to know how his friend had room for the bed and did friend know he was bringing it?\n\nAnd at no part of the process of disassembling, transporting, and reassembling did he stop and say \"you know, maybe this has gone too far\"",
                  "id": 227,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Imagine if he end up sleeping on his friend’s couch.",
                      "id": 228,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "That’s why I kinda think this dude is crazy. His wife’s gone, he’s had plenty of time to cool down, he KNOWS it’s a bad idea as evidenced by avoiding his phone... yet he never stops to go “maybe this is the wrong course.”\n\nHe’s more dedicated to revenge and “winning” than he is to their relationship.",
                      "id": 229,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "The important question, did his friend have ice cream for them, because damn I want ice cream after reading this story",
                      "id": 230,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I don't think he reassembled it, he just took it away to prove his point. ESH, but funny as hell, sounds like something from a TV show.",
                      "id": 231,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah...can you picture that carload of crazy driving down the street?",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yeah and how much work you need to put in to get disasmble the bed and deiving it to another house. Its not something you can do in just two seconds.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I mean this is ripped straight out of a sitcom. From my perspective this is funny. I agree with you. I should ad that I don’t have a partner",
          "id": 234,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}