{
  "post content": "I'll try to make this short because I hate reading long posts on here.\n\nMy wife and I went shopping at a mall today and decided to pick up some food at one of the restaurants attached to the mall (not food court, but sit down restaurant). It was around 5pm, so right at the start of dinner rush. Service was fine and our server was incredibly friendly.\n\nToward the end of our meal, a family (father, mother, and son probably around 8 years old) are seated in the booth behind us. By this time, it was getting a bit busier in the restaurant. It takes maybe 2-3 minutes before the server comes and takes their drink orders. She then went to tend to that and other tables. \n\nAbout 5 minutes pass and I hear the father start complaining. \"Why is everything taking so long?\" \"This server is lazy.\" \"It's been five minutes, why hasn't she taken our order?\" \"The service here is terrible, they deserve a 4/10 rating.\" \"Maybe I need to speak to the manager.\" \n\nIt was driving me crazy because it was fucking dinner time and they were busy. My wife and I finish our meal and pay. As we are leaving, I step over their booth and just very kindly address the father \"Excuse me, hi, so we were sitting at the booth behind you, and just so you know, you're a real prick.\" And then I walked out before he could respond.\n\nMy wife thinks I was totally justified because our server was super nice and kind, but I just wonder if I overstepped myself. So reddit, am I the asshole or does everyone suck (because seriously, fuck that guy)?",
  "id": 1,
  "comments": [
    {
      "score": 2412,
      "content": "Mild ESH. That guy is a royal prick, but it's not a super good look to go around insulting strangers either, even if they do deserve it.\n\nThough, tbh, If I'd been sitting nearby, I'd be glad you said something. You may be an asshole, but you're the asshole the rest of us sometimes hope for.",
      "id": 2,
      "comments": [
        {
          "score": 534,
          "content": "Only reason I'd argue full ESH; the guy is probably going to take it out on the server now.\n\nHe got called out in front of his family without an opportunity to \"prove himself\", so now he's going to be an even bigger prick in OP's absence.",
          "id": 3,
          "comments": [
            {
              "score": 289,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 71,
                  "content": "Yeah, I mean, sadly idk what the right answer is either. Some people are just needless dicks and if they are only around people they can bully they will.\n\nCalling out a bully and leaving is generally not the best, but what's a perfect way to handle it? I sure don't know.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Calling out a bully-explaining their behaviour and daring them to be better. Without swearing.\n\nIf you actually gently guilt someone in a ‘come on guy, you know you can do better than that-be an example of patience and honesty that you and  *everyone* watching would be proud of’ kind of way tends to work. Maybe it’s only worked cause I’m a woman, but several times when I’ve earnestly pulled up assholes for littering or acting a fool, I’ve gotten forlorn apologies after the fact which is amazing.\n\nI would also make a point to tip and warn the waitress and make mention to the host that a customer was being unreasonable so they can back their colleague/employee if need be.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "some of my fam are like that and I dont dine w them after giving up, but I would have loved someone to do this and just sit back smugly tbqh",
                  "id": 7,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 137,
          "content": "[deleted]",
          "id": 8,
          "comments": [
            {
              "score": 70,
              "content": ">\"give your server a break, it's the dinner rush\" \n\ncombined with taking a moment to let the manager know that the guy was complaining but that you'd noticed that the service his table was getting was actually very timely would probably have been the best bet to actually help out the server.  \n\n\nCalling names just means both of them behaved badly.",
              "id": 9,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "I agree.  The proper thing to do would be to tell The server LOUDLY   “HEY ITS REALLY BUSY AND YOUVE BEEN A GREAT ATTENTIVE SERVER.  THANK YOU AS I KNOW YOUR JOB IS TOUGH AND SOME CUSTOMERS CAN BE REALLY DIFFICULT”.",
          "id": 10,
          "comments": [
            {
              "score": 26,
              "content": "i’m a server and people do this to me from time to time, it’s wonderful. “it’s clearly super busy, you’re doing great and we’re super happy. SOME PEOPLE are just unreasonable.” is a more graceful way of doing what OP did. and i agree with telling a manager that you were happy with your service as someone else suggested, that also helps in case the prick of the story complains.\n\nnot to say i wouldn’t love to watch someone do what OP did to some of my worse tables.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah no need for name calling in this instance.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "[deleted]",
          "id": 13,
          "comments": [
            {
              "score": 13,
              "content": "why is that relevant? that's not what happened.",
              "id": 14,
              "comments": [
                {
                  "score": 21,
                  "content": "[deleted]",
                  "id": 15,
                  "comments": [
                    {
                      "score": 3,
                      "content": "according to the op the father was complaining about timely service.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "That could've been a result of poor zone management, just because two tables are next to each other doesn't necessarily mean they are zoned to the same server.",
              "id": 17,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": ">You may be an asshole, but you're the asshole the rest of us sometimes hope for.\n\nI've heard that be referred to as being the Batman of assholes.   He's not the person they want, but he's the person they deserve.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "[removed]",
          "id": 19,
          "comments": [
            {
              "score": 3,
              "content": "Yeah! Assault!",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 542,
      "content": "ESH. Yeah, I feel your frustration. But going up to him and calling him a prick and walking out before he can respond? Not even giving him any context or explanation as to why you decided to go up to him and say that. Not cool. He doesn't even know why you called him that, so it was kind of pointless",
      "id": 21,
      "comments": [
        {
          "score": 42,
          "content": "If he was complaining loud like that, he seems like the type of person who's looking for validation from others in his dining area. So I have no doubt that man knew why he was called a prick, haha. NTA, some people deserve to be told to shut the fuck up. It was short and sweet and didn't cause a scene.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 265,
      "content": "NTA. His kid and wife are probably sitting there, not thinking hateful shit, and deserve to know that yes, everyone else also thinks the father is an asshole. It is not hard to gather why someone approached him saying that. You have balls\n\nShow that kid that there's more out there than his dad's perspective, and show that husband and wife that other people can hear and do not like his shit-talking. Fuck that guy",
      "id": 23,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 219,
      "content": "ESH. We all know why he sucks. You suck for two reasons - you gave no context or reason for what you said so it won't do any good and you swore at him in front of his kid.",
      "id": 24,
      "comments": [
        {
          "score": 72,
          "content": "Is prick swearing? I always thought it was like crap where little old ladies might look disapproving, but hardly an actual swear",
          "id": 25,
          "comments": [
            {
              "score": 21,
              "content": "Eh, we've all got our own lines in the sand for these things. \n\nI'd put it as worse than crap, but not as bad as dick. About the same as jackass, maybe. \n\nIt's definitely not appropriate to say in front of a child and worse when you're directing it at the kid's dad.",
              "id": 26,
              "comments": [
                {
                  "score": 19,
                  "content": "What?? Like you said, we all have our own lines, but for me prick is not even remotely a swear word. Not even on the same level or crap or freak. \n\nTo mean it's on the level of like dork or punk.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 3,
                      "content": "\"prick\" is slang for penis. \n\n[https://en.wikipedia.org/wiki/Prick\\_(slang)](https://en.wikipedia.org/wiki/Prick_(slang))",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "UK?",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Depends on the person.  I once had an elderly guy try to get me fired (as in, hunted down a manager and insisted that they fire me) because I said “friggin’.”  Not loudly, not directed at him or any customer.",
              "id": 30,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Prick is not a swear word. At all.\n\nA bad word to some, maybe. But not a *swear word*.",
              "id": 31,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Does the other guy suck though? Yeah, he was being grumpy and poopy to his family. But did he do it to the server? Did he ruin anyone elses time? Was he loud enough to be overheard, or was OP listening in. I know I get hangry, and can be kind of childish and grumpy when I am. I also know that when people are having a hushed conversation, especially one with anger involved, I try to casually listen in. \n\nMaybe the other guy does suck. But there is only one indisputable fact, OP got in the guys face and called him a name in from of his child. OP also feels good about it and is seeking justification. Hes an asshole.",
          "id": 32,
          "comments": [
            {
              "score": 3,
              "content": "I get hangry, too.  Sometimes I get so hangry and bitchy that I suck.  In my opinion, the other guy sucks. I really feel for his family. It's exhausting when someone complains constantly.",
              "id": 33,
              "comments": [
                {
                  "score": 1,
                  "content": "So because he was complaining for anywhere from 1-10 minutes, now his family is exhausted with his constant complaining? I dont think there is enough info to really judge how this guys wife and kids feel about him.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I'm not judging how they feel about him. I'm expressing how I feel when I'm around people behaving in a similar fashion and feeling sorry for them.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Prick is 1000% not swearing",
          "id": 36,
          "comments": [
            {
              "score": 4,
              "content": "But aren’t there words that aren’t really curse words that we don’t say in front of children?  And doesn’t context count?  Not arguing, just thinking it through...",
              "id": 37,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 120,
      "content": "YTA. Unless the guy was actually being abusive to the server, you had no right to “call him out.” What the man says to his own family is none of your business.",
      "id": 38,
      "comments": [
        {
          "score": 40,
          "content": "Exactly my point... At no point in the story did he talk shit to the waitress, this guy just overheard him talking to his family.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "EXACTLY. He thinks he's a hero for verbally chastising this guy in front of his family.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "The guy crossed the asshole line when he said he was considering to speak to the manger, which an overreaction to having to wait for 5 minutes. That’s how restaurants work! and the dude *was* being an impatient prick. ESH",
          "id": 41,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Sounds like he was talking last enough for folks to hear it in a busy restaurant.",
          "id": 42,
          "comments": [
            {
              "score": 1,
              "content": "Um, most people sit close enough in restaurants to hear others conversations. They just don't listen or respond to them because it's none of their business.",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 116,
      "content": "YTA for just calling someone a name without context or anything. If you had a simple conversation it would be different but you are nothing more then a worthless bully at the moment.",
      "id": 44,
      "comments": [
        {
          "score": 13,
          "content": "exactly. his actions were completely self-serving.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "If you're acting like an asshole in public, don't be surprised when people react to it.",
          "id": 46,
          "comments": [
            {
              "score": 6,
              "content": "You've never been grumpy? Never been hungry and then a little unfair at a wait for food? \n\nIf you have experienced something like being hangry, how would you reacted to someone calling you a prick? Not calling you out, not saying  anything constructive about the service or restaurant. But just, \"you're a prick\".",
              "id": 47,
              "comments": [
                {
                  "score": 2,
                  "content": "Using hangry as an excuse is just as bad as blaming your astrological sign on your behavior. Whatever it is, it still comes down to the guy being a total prick.",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "Especially in front of your kid",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Well OP didn’t make it sound like he responded right away. Seems like the family were talking about something else or eating when OP said it which really just comes across as some random guy insulting him for no reason",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 58,
      "content": "ESH but only because you didn't actual address what he was doing. You should have said something along the lines of, \"It's dinner rush and everyone here is doing the best they can. If you can't be patient for a few minutes, you should eat at home.\"\n\nThanks for standing up for the servers, though. Servers get so much shit because people somehow think they're lesser/beneath them and it's fucking dumb. I think speaking up was the right thing to do.",
      "id": 51,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 54,
      "content": "ESH. While I get your frustration, you never actually explained why you thought he was a prick, and assuming he's not self aware enough he wouldn't get what needs to be improved upon!",
      "id": 52,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 52,
      "content": "YTA. OP didn’t defend the server, just satisfied himself by calling the other guy a prick",
      "id": 53,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 41,
      "content": "seriously?? YTA for the personal insult \n\nyou COULD have said \"cut her some slack, it is not her fault it is busy\" but a personal insult? Not necessary and not useful and pretty jerky.",
      "id": 54,
      "comments": [],
      "relation": "Attack"
    }
  ]
}