{
  "post content": "My family and I grew up very poor. From when I was old enough to legally work, I (19F) have had to take on multiple jobs while balancing school to help with my family and my younger sister. Growing up, I never had a lot and whatever money I earned I would spend on my sister (16F) and family. When I was 18 and had just been accepted into college, my dad's business that he'd worked on for the past couple of years finally took off. This also meant that my sister could now have a normal high school experience without worrying about money.\n\nWhile I was in college, I wasn't in contact with my sister that much since I was so busy with schoolwork. However, from our calls and her social media, I could tell she had changed completely and was involved with some bad people. She would post videos on her snapchat of her getting drunk, smoking weed, juuling, driving while most likely drunk/high, etc. I tried reaching out to her, but she would mostly deny the claims and told me to mind my own business. At some point, she justified her actions using the argument, \"This is what the cool kids do now, not everyone was a nerd like you in high school.\" One of my high school friends who also has a brother in the same grade reach out to me and said that she heard that my sister was seeing a sketchy guy from another school. Apparently he sells drugs and was expelled from my sister's high school. I asked my sister about this and she denied it. \n\nLast week I got a phone call from my mom who was sobbing. She tells me that my sister is pregnant. I was so shocked that I could not speak. Then I was angry. When I was her age and even younger, I gave her everything and so did my parents so she could have all the opportunities her peers had. Since my dad's business became lucrative, they've given her every opportunity to succeed (any extracurricular/sport she wants, academic tutoring, school activities, etc.). I never got any of those things. It angered me so much that she took all of this for granted and fucked up her life. The father? Her delinquent \"boyfriend\" who got expelled and sells drugs. \n\nShe blows up my phone but I don't respond. She then sends me a series of long text messages asking if she can crash at my place. She also asked me if I could make her an appointment to see a doctor. Lastly, she asked if it would be okay if her boyfriend comes and stays over sometimes. I shut her down. I told her that you dug this hole for yourself. If you allowed yourself to become pregnant, then you should be able to deal with the consequences. Also, I’m currently sharing a small apartment with two roommates! She begged some more and I denied her. In the past few days, she's still be texting me and calling me non-stop saying that she has nowhere to go and has been living in her boyfriend's car. I haven't responded to a single message of hers, but I feel my resolve wavering a bit. I fully don't support her, but maybe I'm being an asshole?\n\nEDIT: To clarify, I would still NEVER house her in my apartment. That would be extremely disrespectful towards my roommates and would get me kicked out due to the lease agreement. I meant I was considering giving in and sending her some money.\n\nEDIT 2: My parents have DISOWNED her, not kicked her out. They are refusing to acknowledge that she is their daughter, but she is still welcome to live in their house. She chose not to since my parents are absolutely fuming and probably will yell at her and criticize her, which she honestly needs.",
  "id": 1,
  "comments": [
    {
      "score": 8114,
      "content": "NTA. It hurts to watch family suffer consequences of their actions, but you aren’t refraining from helping to be vindictive or to get even. You aren’t helping her because the way she’s treated you and your family. It’s hard to do but you are NTA.",
      "id": 2,
      "comments": [
        {
          "score": 3008,
          "content": "Honestly, I think this is an important lesson that she needs to learn. Actions have consequences and you need to learn to deal with them like an adult.",
          "id": 3,
          "comments": [
            {
              "score": 1563,
              "content": "NTA.  Not just that, but you absolutely should not ride the roller coaster she's chosen for herself.  You say it all in your post: she had every advantage--first from YOUR hard work, then from your Dad's hard work.  And she CHOSE to fuck it up.   What's more, drugs are involved--and you never want to get involved with people who are druggies, let alone let them into your apartment.   They'll steal you blind.  This is her problem to solve, she can move back with your folks.    She has choices, she wont be on the street.  But even if she was on the street, not your problem.   If you're worried about the baby?  And she's still being irresponsible?  Then that's for CPS to deal with. \n\nThere are so many reasons for you to stand firm: \n\n1. She built this, she has to deal with it.\n2. She needs to learn that actions have consequences.   \n3. \"Helping her\" is not only enabling her bad behavior, it's also enabling drug use, with her AND her boyfriend.   Again, enabling = prolonging.   The BEST way you can help her is to cut her off. \n\nBut this doesn't count the most important reason of all.   YOU.   YOU have earned your decent life.  You've worked hard, you've helped your family, you've helped your wretched spoiled sister!    Now YOU get to live your life!   You get to put reasonable boundaries around your life -- and that's what this is, a reasonable boundary-- and not ruin your own life by being dragged into someone else's mire.    I know it's hard because you've spent so much of your life being so generous and so giving, but honestly OP, it's your turn to think of yourself and what YOU deserve.   And you deserve to live a good life.",
              "id": 4,
              "comments": [
                {
                  "score": 499,
                  "content": "You took the words out of my mouth. OP said she can still live at home, but isnt because the parentes are furios and will scold her. For me, that part speaks volumes. She's running from her problems, lookin for quick and easy ways out, instead of confroting it head on and solving the situation she has created. She's not taking responsibility at all.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 161,
                      "content": "Yes, and OP’s parents are still responsible for their 16 year old. They need to step it up and start giving their teen guidance. They don’t get to abdicate and hope you’ll parent your sister for them.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "Repeat after me OP- “I deserve better. I have worked hard to get where I am and I deserve to enjoy it”. Family will always be family, but the opportunities that have created for yourself will not always be there.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 68,
                  "content": "This! I used to be you, doing everything for everyone and I'm just learning to finally take care of myself. You deserve the life you've worked so hard to build. As hard as it is to watch others struggle, you do them no favors by pulling them out of their hole. They wont ever learn and grow. They are NOT entitled to the life you've worked hard to have.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "this deserves so many medals, take this fake one from me 🏅",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Couldn't have written it better. And always feel free to send PM if you need someone to talk to :)",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Best comment.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I don't think cutting her off completely is good because even if this shit is her fault that doesn't mean she doesn't need emotional support to pull herself out of it. Completely ignoring her could lead her further down the wrong path. I think if op wants to help her out he could put in place some rules, if she wants emotional or financial help she has to be drug free, be doing well in school, and no longer seeing the boyfriend except for him being able to see the kid if he really wants to. This or just providing resources where she can get help to clean up and encourage her to get back on the right path. But op is in no way obligated to do these things and he would be doing her a favor if he did",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": "You need to stop setting yourself on fire to keep her warm.",
              "id": 13,
              "comments": [
                {
                  "score": 63,
                  "content": "Don't laugh at me if that is an old well known saying but..........I've never heard it before and am immediately stealing it to use in the future because I love it!",
                  "id": 14,
                  "comments": [
                    {
                      "score": 33,
                      "content": "I would never laugh at you. <3\n\nIt's not original with me, this statement. I see it on reddit a lot. I take it as excellent advice, so share it when applicable.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is a great line!",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "100% agreement with this. NTA, living out of a car is going to get old real fast. Nothing like the hard smack of reality to sober a person up.    \n\nPlus, if things get really bad, she can always go home. Do not send her money. She needs to learn this lesson.   \n\nShe’ll either figure her shit out and step up to the responsibility, or she will fold and run back home to your parents after a large helping of humble pie.   \n\nEither way, she has to learn to help herself. Plus, this is the time to do this, before the baby comes. As a former single mom myself, she’s about to get a harsh reality check once that baby arrives.    \n\nIt’s better she goes through this now so that by the time that happens, hopefully she will have some kind of set up, whether it’s working her way into an apartment or moving back home.   \n\nYou have done enough for this girl. She obviously doesn’t appreciate now but she will.   \n\nA hungry belly is a huge motivator. Having to find a place to shower because you are living in a car is too. If you care about your sister, you must let her do this on her own.",
              "id": 17,
              "comments": [
                {
                  "score": 5,
                  "content": "Sister needs to move home and face her life. She's a pregnant 16 year old throwing a tantrum. Giving her money will only prolong and enable her. Hang in there you are doing the right thing.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "Sure, but has anyone been able to discuss the possibility of an abortion with her? You mentioned she’s trying to get a doctor’s appointment, but not what for, and because she’s a minor, the way your parents feel about this does play a role in the situation and your family’s dynamic here. Is she trying to keep it, expecting her family to continue to provide support? Or is she trying to abort, learn a lesson and move on? Because no matter how you feel, an accidental child is more than a basic consequence for having sex, and with modern medicine being what it is, an accident doesn’t have to be an 18 year life changing event. She made a mistake, but staying pregnant is a separate issue and a decision she should be allowed to make, with the consequences tied to that decision.",
              "id": 19,
              "comments": [
                {
                  "score": 69,
                  "content": "Came here to say this. Honestly this is the only thing for which I'd condone loaning her money or a spot on the couch. The drugs and stupid boyfriend are easy enough to outgrow (comparatively), but what kind of a life could she provide for a kid at this stage? She could learn her lesson without having to wreck her entire life.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 24,
                      "content": "And those decisions will likely ruin the potential child's life as well.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I think she is morally required to have an abortion because I wouldn't want to be the poor baby that will have many problems because of her drugs addictions (I doubt she is going to quit while pregnant).",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "This is really important. In terms of getting medical care, she *is* being an adult. She needs help getting an appointment and understanding how to do that, so she asked for help. In my view, OP you're the asshole for \"shutting her down\" on that front, and that front alone. *That* was about your anger and hurt, not about helping her \"learn\" how to do things for herself. Whatever her choice about seeing the pregnancy through will be, she needs to see a doctor. And it's far from absurd to think she'd need help setting up an appointment for herself, considering the way your parents have helped her out in the past.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I don't see why it's my responsibility to do all this for her when my parents are perfectly willing to help get her to the doctor so she can get an abortion? Furthermore, you do know it's not possible for me to book an appointment for her? I'm her sister, not her legal guardian.\n\nIt's seriously not that hard for a 16-year-old who lives in this day and age to do a quick google search about planned parenthoods nearby or just call the hospital that we literally live 10 minutes away from to make the appointment (if she even can since she's a minor). The thing she should be doing is taking the help that my parents are offering and getting that abortion.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "the internet can give prego 16 year all the info she needs. OP isn't responsible for that.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "No offense to your parents - you really did try to do more for her than they did. \n\nThey might not have listened but...it sounds like she did whatever the hell she wanted in HS\n\nAt a minimum someone should have grilled birth control into her head (but then of course, she might still have gotten knocked up by this loser)\n\nSorry for your troubles",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Yes, since you updated that she is technically allowed to live with your parents and is only staying in the car because she chooses to you definitely don't have any obligation here. You can just blame your roommates if she needs a reason why she can't move in. The only part I would encourage you to help her with is getting an appointment with a doctor. Either she wants to terminate the pregnancy or get prenatal care, both of which are better than doing nothing as the pregnancy progresses.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Let her think it over and learn. When you think it's too much for her, let her suffer some more and make her leave that guy. Then reach out to your parents and ask them to forgive her. And if anything like this happens again she lives on the curb forever. Might seem heartless but it's necessary for her own good.",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "If she doesn't learn this now, she'll also fuck up that kids life too",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "NTA. You're right that's an important lesson for her to learn. She has somewhere to live, it's just not as cushy as it used to be. Oh well, she'll just have to suck it up and deal with her consequences.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "NTA, and what u/ThaneOfCawdorrr said is completely correct. You don't want to get caught up trying to \"help\" since drugs are involved. I'll add though just one other part. Besides someone struggling with addiction stealing you blind, there's going to be an emotional toll on you by continuing to try to help them out. \n\nI watched a friend's family go through something similar when I was in college and it drained them not only financially at times but also emotionally going from hope that maybe this person is going to turn their life around, to devastation as that person took advantage of the family. Eventually they cut their family member out of their life after a couple of years and they said it was easier to accept that, even though it was painful, than to continue trying to \"help.\" Helping and offering support also burned bridges. The family member in question is still hanging out with the wrong crowd and has ended up in jail a couple of times, but even if they turned their life around the family has said that it would be difficult at this point to accept them again because of the damage done and the sense of being betrayed during the time they tried to prop their family member up. \n\nPoint is, if you offer help and your sister gets her act together then that would be awesome, but from the sound of it she isn't about to do that. Trying to help will put a burden on you and also your roommates. If your sister doesn't change it could cause possible legal trouble, will be an emotional drain, and if someday in the future she does try to get her act together and restore contact with her family, it will be that much more to work through and overlook on your part.",
              "id": 31,
              "comments": [
                {
                  "score": 2,
                  "content": "Yes, thank you, I was writing from bitter experience after trying for years to help our young adult son, who still doesn't seem to be \"ready\" to get clean.  That's so, so, SO right.  The emotional toll is absolutely devastating.   Heartbreaking, life-wreckingly devastating.   \n\nAnd it doesn't even help.   I always likened it to , you're trying to save someone from drowning, you're there with the lifeboat, but they're hacking at the lifeboat with an ax.   And you drowning still isn't going to save them.   Thank you for understanding that so well, and adding that.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Really sorry to hear that, it might just be from some stranger on the internet but hopefully there will be a change there someday.\n\nWhat you wrote made sense and seriously rung a bell. I was and still am close to my friend and his family and got a candid perspective into their struggle. After a point their was nothing they could do to help and continuing to try was doing more damage to any possible future reconciliation than it was worth.\n\nI like your boat analogy because it fits. You hang on too long trying to save them and they bring you down and deal that final blow, they might come to their senses someday but there won't be a boat left to turn to. \n\nHopefully things turn around for your son and OP's sister.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "“This is what the cool kids do now, not everyone was a nerd like you in high school “\n\nThis triggered me so much. I can’t believe she had the nerve to say that when OP sacrificed everything for her at that young age. And this is how she responds. And it’s not like she has been “kicked” out literally. She still can stay at her parents place despite all the criticism that comes with it which she deserves!\n\nNTA Op.\n\nYou don’t owe her anything more. Live your own life to the fullest, free of such bs.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Also because she needs to learn that life isn't going to always be as easy as it is for her now. That her actions have consequences that she can't just talk her way out. She didn't get kicked out. She left because she doesn't want to deal with the fallout and seeking a handout elsewhere.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "She's 16, probably an addict. That kind of thinking leads to homelessness and mental diseases. She's 16. She ain't responsible for herself, she must be treated. She is a kid",
          "id": 36,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3236,
      "content": "I have a feeling if you gave in, you’d just be taken advantage of by your sister and her deadbeat bf. NTA. If she is old enough to be a mommy, she needs to learn to care for herself and grow up. \n\nYou also have to consider your roommates. Im sure they’d love to have two more (and eventually three) people living there.",
      "id": 37,
      "comments": [
        {
          "score": 1110,
          "content": "Absolutely. I would never put this on my roommates. To clarify, I meant my resolve was wavering in that I might end up sending her some money, not offering to house her. That's still an absolute fucking no.",
          "id": 38,
          "comments": [
            {
              "score": 450,
              "content": "Gotcha. I have two sisters like this. Absolutely do not do it. You’ll give a little, but then, they need more and more, but won’t do a damn thing to change their circumstances. Just don’t let yourself get taken advantage of. I get how you feel and thar she is your sister, but at the same time, she did stuff thinking there were no consequences. She hasn’t been held responsible for her actions, so things will never change if she isn’t.",
              "id": 39,
              "comments": [
                {
                  "score": 45,
                  "content": "Everyone should read \"If you give a mouse a cookie.\" It's exactly this..you give a little, they'll just want more.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 11,
                      "content": "It’s not only that, but if they’re using, they’ll steal from you. The other issue is, if he’s dealing, you could be implicated.\n\nDo not let this into your home or you could lose everything. She doesn’t understand that, but police could confiscate everything in your apartment. Need to stand firm on this. Also, don’t give money to help. Could be aiding and abetting a drug dealer.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 182,
              "content": "IF she really needs your help, which I don't think she does (she can still live with your parents but chooses to live in a car), and you're willing and nice enough to (too nice I'd say), I'd suggest buying her groceries and the necessities she needs. NEVER give her money. She may not be using it to actually help herself. Or her POS bf may take it or make her spend it on drugs or other useless things. I wouldn't put it past those two immature kids to do something like that.",
              "id": 42,
              "comments": [
                {
                  "score": 82,
                  "content": "Boyfriend is probably a low tier dealer buying some small bulks and selling to users. That's high risk, semi-high return if successful (actual numbers vary so much). My bet is that she is sleeping in his car to get OPs sympathy, then maybe money to buy some bulk of drugs to resell. It won't help this situation in any way.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 84,
                      "content": "After adjusting for expenses; dealing with cops, getting mugged, etc., street level drug dealers don't normally make more than the fry cook at McDonald's. It's a career for people who can't deal with authority and want some imagined prestige, kinda like those suburban housewives who join Lularoe.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "My thoughts exactly. That's why I suggested of OP really wants to help, to buy the stuff she needs instead of outright giving her money. Because if she's that desperate for help, she'll take what OP offers.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 156,
              "content": "Don't send her any money.  For all you know that money could be spend on drugs, alcohol or juuls.\n\nAs harsh as it is, if I was in your position, the only instance I would send a sibling in your predicament money would be if that money is going towards an abortion and paying that money to a clinic directly.  \n\nYour sister is clearly not mature enough to handle having a baby and the added responsibility that caring for another person for a foreseeable 18 years.",
              "id": 46,
              "comments": [
                {
                  "score": 61,
                  "content": "Yeah OP please bring this up to your sister, sounds like she should get an abortion ASAP. She can’t even take care of herself, much less a newborn baby.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "100% this. I get you cannot ever force someone into an abortion but there is no reason to not acknowledge the usefulness in situations like this. If your sister chooses to bring that child into the world then any consequences/blood is on her hands. It is fairly simple logic to understand the fact that the job market sucks for uneducated folks, she isn't even an adult, the dad is a known drug dealer, and is fine with his pregnant GF living in his car, but not his house?, and more that all lead to this kid getting screwed before he even takes his first breath. It is really sad when people are selfish and bring children into this world unnecessarily.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "If she is against abortions, please consider putting the child up for adoption. I don't think your sister is ready to be a mother yet and it will help relieve the financial strain of raising a child.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "As an addict I can say that money doesn't solve much and usually is pretty destructive. I'm not saying your sister is an addict but she seems to be heading towards that path.\nSince she isn't homeless I don't really see that you need two help her. Giving a self destructive person money tends to go badly...",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "NTA however having been in your situation never give them money. Buy the thing they say they need. I've brought my niece clothes, food, diapers... Money feeds the habit. Make sure to remove labels so they can't be returned and never give them the receipt.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I wouldn't send her money, but I would offer to go with her to get an abortion and pay for it if she does.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Shouldn't she still be on your parents insurance? So she can make drs appointments herself. Don't give her money, she's chosing to have a child do it's time for her to understand HER childhood is over and she now has responsibilities.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "If you still want to help her, could you just help her with healthcare? I’m not sure if you live in a country with universal healthcare, but if there are expenses involved, putting your money into that directly will keep her from spending it in places she shouldn’t or coming to rely on cash from you.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Please do not send her money. That would be a huge mistake. If you are wavering offer to help her look for a job or talk through how to write her resume. Offer advice that will help her, not money that the bf will spend on drugs",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Pay for her abortion, or help her apply for WIC and food stamps and housing assistance, but don't send her money. If baby daddy is an addict, it's not going to help your sister anyway.\n\nThere is support you can offer here, if you want, but it's going to be a fine line between support and enabling.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1538,
      "content": "NTA.  \n\nThat said, she is still your sister, and you obviously still have a soft spot for her.\n\nHelping her access to Planned Parenthood would be good to do.  It seems as though she's in no position to manage a pregnancy or child.",
      "id": 57,
      "comments": [
        {
          "score": 632,
          "content": "Agreed. And for the record, Planned Parenthood is more than just abortions, they also provide affordable medical care, prenatal checkups if she chooses to keep the pregnancy.   \n\nThey charge based on a sliding scale of what you can afford. If sister is struggling to pay for doctor visits, PP can help her, regardless of income.   \n\nIf she continues the pregnancy, she should also look into social services in your state. Most states have benefits for low income mothers to be like healthcare coverage, food stamps, WIC, etc.    \n\nShe might qualify for government assistance and can apply for Section 8 housing.   \n\nI used to be a poor single mom. I ended up getting all my medical care covered pregnancy and post birth for me and baby. I also qualified for food stamps for those 4 months I was off work (I had complications and it took longer to recover).    \n\nSister absolutely has options here.",
          "id": 58,
          "comments": [
            {
              "score": 65,
              "content": "She would get govt. housing even if her parents allow her to live there? In the UK I think that would exclude you",
              "id": 59,
              "comments": [
                {
                  "score": 71,
                  "content": "OP is in California and being that the sister is a minor, that might change things. A quick google search shows that the State of California, as I expected, actually has tons of resources for pregnant teens.   \n\nAs far as Section 8 housing, there are actually wait lists normally, so she could apply now. Again, a quick google search shows that she could qualify once the baby is born. Technically, if she isn’t living with parents then she could receive government assistance. Otherwise her parents income would count against her.   \n\nCalifornia, along with the west coast in general, has a great social safety net. If she can’t qualify for one program, there are others resources she can get.   \n\nShe might not be able to get much before the baby is born, but a 18 year old with a toddler will, if she is still living on her own by then.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "And parents are legally obliged to provide medical care (though not an abortion). OP shouldn't cover the parents' responsibility, or encourage her to burden PP's resources (or even the government's) for anything parents are legally required to provide. If they refuse despite having the money, a CPS referral may change their tune.",
              "id": 61,
              "comments": [
                {
                  "score": 25,
                  "content": "True, but PP is there, regardless. I just wanted people to know that it’s a resource, even if she chooses to keep the baby.   \n\nEven though my parents covered my medical care, I still went there when I was a teen. My doctor was an old family friend and I needed a OBGYN that I didn’t go on family vacations with, lol.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "I wondered if the boyfriend wanted to keep it more than she did, and therefore she wanted you to take her. If nothing else I might offer to do that.",
          "id": 63,
          "comments": [
            {
              "score": 36,
              "content": "I’m wondering about this too. What if she doesn’t want to go through with pregnancy? Would that change OPs decision on helping her.",
              "id": 64,
              "comments": [
                {
                  "score": 16,
                  "content": "Not really. She has the option to stay at her parents house and do it, she just doesnt want to deal with them scolding her.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 861,
      "content": "NTA- She shouldn't have gotten knocked up and her bf should man up or she should find a better man.",
      "id": 66,
      "comments": [
        {
          "score": 507,
          "content": "I agree with the part about her boyfriend. Even though he's obviously a dick, he needs to take responsibility. He has a car, he can drive her to doctor's appointments.",
          "id": 67,
          "comments": [
            {
              "score": 599,
              "content": "Why can’t all of her cool kid friends help her out? Obviously they were all such good friends they should be able to take care of her. /s",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 278,
              "content": "In your shoes I would offer to pay for a termination, but nothing more. If she chooses to have it, it's on her. (And don't give her the money: it will go straight to druggy-baby-daddy: pay a clinic directly).\n\nIf her substance abuse is as bad as you describe, the chances are that this is all the more so a pregnancy that would be better off not brought into the world.",
              "id": 69,
              "comments": [
                {
                  "score": 67,
                  "content": "And once she’s had the abortion of that’s what she chooses make sure she knows about contraception and that condone aren’t very effective and she really should be using them with another form. It’s definitely not your job OP but someone needs to tell her and get her at least being responsible in sex",
                  "id": 70,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Condoms are actually extremely effective with proper use, and proper use simply isn't that hard.",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": ">Condoms aren't very effective  \n  \nSource?",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah this. She would still be kicked out of home and have to deal with those consequences, so it's not going to be an unpunished crime. But defintely help with terminating the pregnancy. Sister needs to learn a lesson, not ruin her life.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "I just had a beautiful baby boy on the 13th and I'll be damned if I don't fulfill my fatherly duties. I have no patience for guys who refuse to step up to the plate. Just be there and do your best.",
              "id": 74,
              "comments": [
                {
                  "score": 102,
                  "content": "Absolutely! The guy is just as responsible for the pregnancy and therefore should take on half of the responsibilities. And congratulations! :)",
                  "id": 75,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thank you",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "So, awkward question,  have you offered to pay for an abortion? \n\nThis may be the best thing for her, of course if that is still a viable option.",
              "id": 77,
              "comments": [
                {
                  "score": 39,
                  "content": "No, because my mom has already offered to take her to the doctor to get the abortion (and pay for it). I'm not sure what happened next.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Fair enough, unfortunately in these situations women don't want an abortion then expect family to take care of the baby after it's born.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "If you wanna see anything at all good come from this situation you and your family need to force her back to your parents house and get her away from dumbass.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": ">or she should find a better man.\n\n&#x200B;\n\nWhere might this lineup of men be that are looking to take responsibility for a pregnant teen that is clearly a hot mess?",
          "id": 81,
          "comments": [
            {
              "score": 3,
              "content": "[deleted]",
              "id": 82,
              "comments": [
                {
                  "score": 8,
                  "content": "Alright folks, we found our guy! Line up the baby momma's for his perusal.\n\nS/\n\n&#x200B;\n\nIn all seriousness, the advice of \"finding a better man\" in this context is absurd.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 6,
                      "content": "[deleted]",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "16 years old. Man?",
          "id": 85,
          "comments": [
            {
              "score": 2,
              "content": "Boy*",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 800,
      "content": "It’s a tough one, but I’m going to go with ESH except you. Your parents should have done something a long time ago to rein her in, rather than wondering why she’s wound up pregnant now, the school should have intervened a long time ago if she was seeing that guy because I’m sure they were at least somewhat aware of the students were, the boyfriend sucks for obvious reasons and the sister sucks too for obvious reasons.\n\nPersonally I’d offer her money for an abortion. And pay it directly to the clinic. And then pay the clinic to check her for STIs and install some kind of long acting contraception like an implant, a ring or an IUD. NOT getting her contraception pills because those are easy to forget or throw away, and NOT the Depo provera injection unless you’re 100% ok with taking her back to the clinic for another shot every three months without fail (although it could be a good option if you are). I’d also get her a bunch of condoms but don’t trust her to use them by themselves.\n\nIf she’s vehemently against abortion: I’d still try 100% and try and get your parents to get her to go after baby is born for said contraception. I personally wouldn’t trust her with lots of money unless she ditched bf and every last one of those ‘friends’. She’d just spend it on drugs. Maybe $20 here and there, but you could also ask what she wants it for and go buy her the stuff she needs instead. And if she keeps hanging out with that crowd, dear God, call CPS.",
      "id": 87,
      "comments": [
        {
          "score": 244,
          "content": "Finally a solid advice! I go with ESH except for op. Throwing money at a child does not equal parenting. Did the parents get her some therapy? What did they do in order to prevent her from hanging out with bad crowd? You can't just make a surprised pikachu face and disown your kid if you ignore his or her behaviour",
          "id": 88,
          "comments": [
            {
              "score": 87,
              "content": "Not to mention, of all the high value purchases they made for her— was birth control and proper sex education part of it?",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "This! Plus, when your teenager makes shitty decisions (because, go figure, most teens make shitty decisions because their brains aren't fully developed yet and they're shit at recognizing long term consequences), you don't just disown them. I'm a firm believer in tough love, but you still fucking love them.",
          "id": 90,
          "comments": [
            {
              "score": 108,
              "content": "Yea what the everloving fuck. \"Teenager gets knocked up, promptly disowned\" is some 50s era shit. These parents legitimately suck. Step up and help your child, they're a goddamn child. If she insists on staying with this dude and having this kid and everything,  then yea shes gonna have to figure out the world. But right now shes young and pregnant and terrified and everyone's like \"lmao sucks to be you\".\n\nAnd theres people posting here, \"maybe the *cool* kids will help her out, lol!\" \"Hurr hurr if shes old enough to be a mom shes old enough to figure it out\"\n\nLike what the shit? Now were revelling in a terrified pregnant teenager losing her family and living in a car because she...  did teen things? Wasn't always polite and responsible, sometimes made bad choices? THIS IS WHAT TEENS DO\n\nChrist its like some of these redditors are jacking off to the idea of their high school mean girl getting knocked up when, as adults, we should be able to recognize that teenagers are dumb children and they make mistakes. We've looped back to a 1950s \"shame the fallen woman\" circle jerk and its fucked right on up.",
              "id": 91,
              "comments": [
                {
                  "score": 68,
                  "content": "Especially the idea of, \"they're not kicking her out, just disowning her\", like... what a terrible way to treat your pregnant, scared child! She's SIXTEEN.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "I can't believe I had to scroll so far down this thread to finally see some shred of common sense. Yeah, OP's not the asshole, but her sister the TEENAGE GIRL, a CHILD, is certainly not either. She needs support, and OP is under no obligation to provide it, but this underaged minor should certainly be receiving support from her parents. OP's parents are garbage.\n\nThe commenters saying \"she was old enough to have sex and get pregnant, she's old enough to deal with this on her own\" have lost their minds. More like: OP's parents are the actual adults who were old enough to have two children, they're old enough to deal with their teenaged daughter getting pregnant without throwing this conditional love, you're disowned bullshit around.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The commentators saying that are likely very yong themselves.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I agree 100%.  And frankly, this sub is never very forgiving in the slightest.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "What could the school do about the sister seeing the guy?",
          "id": 96,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "My guess is that parents are large contributors to why she is like this. \n\nBut CPS won't and can't do nothing with teenager that picked wrong crowd.",
          "id": 97,
          "comments": [
            {
              "score": 11,
              "content": "It doesnt even have to be that big.\nA child who doesnt get much attention (real attention, not education and materials) can end up with the wrong crowed, because that is were they feel like they fit in.\nA child that is afraid to get reacted can do that too.\n\nThe worst thing you could posibly do is disown her. She will only get worse.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "100% agree. She is still a child and her having a child can screw up the rest of her life since she clearly doesnt have the responsibility and necesaities to take care of one.\nPlus she might screw up her childs life.\n\nIt is to late to chang that she has gotten pregnant now, but by not trying to get her on the right path this situation can go very wrong.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This should be top comment. OP, you’re NTA, but your sister fucked up. You can either help her get out of the situation before it’s too late or watch her whole life be different and harder. \n\nThis is not your responsibility at all. I know you struggled through adolescence and have watched your sister have life on a silver platter and that sucks and it’s not fair. But this is your chance to really make a difference and save her from this mistake. \n\nIf she has the kid and keeps the kid, she will forever be tied to this scumbag who fathered the kid. He will be a negative force in her life for the rest of her life. Not to mention the fact that having a child in teenage years will greatly limit potential unless she magically finds an amazing support system to watch the kid while she goes to school/work, which doesn’t sound likely. \n\nShe screwed up, it’s not your problem, but if you take the steps mentioned above and help her get out of this situation, then she will be free from this problem, and YOU will be free from this problem as well since she won’t be asking you for help every day for the next 18 years. \n\nI don’t think living with you is the right choice, but I think you have the ability to offer her options and I think that would be beneficial to your entire family if you did.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I'm pretty sure ESH without OP is NTA",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "The school wouldn't know shit about it if I'm being honest man. Teens are sneaky as hell. Back when I was in high school, 2 years ago, people sold weed on campus, met with others, and it was all sneak.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "“ESH except you” isn’t how this works at all. It’s NTA",
          "id": 103,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 680,
      "content": "NTA. Your sister kinda is, and your parents are kinda being assholes as well. I can COMPLETELY understand them being \"fed up\" or \"done\" or whatever with her behavior. Shit is insane..\n\nHowever..\n\nShe's 16 years old. She's not an adult, and her mind isn't even fully developed yet. Has she ever been to a psychiatrist? Psychologist? There is a reason why she is acting out, and being this way. Could it just be she's a dumbass? Absolutely. Could it be some mental disorder causing her pain every day? Very likely. \n\nShe needs HELP. And no, I don't mean help as in you taking her in and letting her continue her ways. Which you obviously aren't doing anyway, which is good. \n\nI mean even though your parents \"disowned\" her, I blame them too. You can't just throw money at a person and give them things you didn't have and expect them to just grow up normal because they had things. The fuck sense does that even make?? \n\nThink about this. You and your parents  both worked hard to have her grow up kinda spoiled. Then wonder why she grew the fuck up kinda spoiled..? \n\nI know I\"m just kinda venting here and I'm obviously sure you didn't tell the whole story, but because you didn't, my brain is trying to fill in the rest to make this story make some kind of sense.\n\nYour parents DISOWNED a SIXTEEN year old. Rather than go the extra step and try to get her SERIOUS help. And you can say \"SHE WON'T LET THEM!\" all you want. She's fucking SIXTEEN. She's still a child. Your parents can still take her to a therapist, or a psychiatrist. \n\nTL;DR: Tell your fucking parents to get her ***REAL*** help, instead of throwing her the fuck away.",
      "id": 104,
      "comments": [
        {
          "score": 155,
          "content": "Aren't her parents legally obligated to care for their 16 year old child until she's 18? It doesn't sound like she's emancipated.",
          "id": 105,
          "comments": [
            {
              "score": 161,
              "content": "Based on OPs comments it sounds like she is still allowed to live at home she just chose not too because the parents are constantly pissed at her",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "It might depend on the country, but in the US, yes. Because like you said, it does not sound like she was emancipated.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "they are and they offerd. she just left.",
              "id": 108,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "This comment isn't high enough.\n\nIt's not on OP to raise her sister, and of course people need to set boundaries and not be taken advantage of. However we are not talking about an adult here, we are talking about a SIXTEEN year old. She needs HELP, and not the financial kind, but the emotional and life coaching kind.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "My exact thoughts, she may have fucked up but she’s a victim in this situation too.",
          "id": 110,
          "comments": [
            {
              "score": 83,
              "content": "I know it's technically true, but I really don't like the word \"victim\" in this case. Think about it, if she went to a therapist and the first thing the therapist said is \"you're a victim too!\" she would probably take that and run with it for yeaaaaaaaars as a great excuse to keep doing what she's doing.\n\nShe needs help, I'll leave it at that.",
              "id": 111,
              "comments": [
                {
                  "score": 44,
                  "content": "A good therapist wouldn’t say that even if it’s true. Because you’re right, it gives the person a mental back door; there’s nothing to fix I’m just a victim here",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "nah yeah i see your point there",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Best comment I've seen so far",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "They didn’t kick her out. OP has clarified this numerous times. Her sister is acting like an entitled asshole, and her parents are pissed at her, but she still has a home. She chose to leave and sleep in her loser boyfriends car, rather than face her parents disappointment.",
          "id": 115,
          "comments": [
            {
              "score": 12,
              "content": "In a few more months they'll be raising the baby while she thinks she can go and do whatever.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "They didn't kick her out, but they DISOWNED her. How the fuck do you DISOWN your daughter just for being an asshole??? YOU GET HER FUCKING HELP!!",
              "id": 117,
              "comments": [
                {
                  "score": 7,
                  "content": "Obviously their idiot daughter doesn’t want their help. If she did, she wouldn’t have chose to go live in a car and be begging her sister for a place to crash with her dumbass boyfriend. No she doesn’t need help, she isn’t a fucking victim. She knowingly had unprotected sex, and now thinks that everyone should be kissing her ass because she’s pregnant. She doesn’t want to listen to anyone and live in her fantasy world, where she and her boyfriend will be like the parents on MTV. She needs to grow the fuck up and she definitely doesn’t need her parents coddling her. How exactly are they supposed to GET HER HELP? Have her committed to a mental institution? Call doctor Phil? Try to force her to get counseling? Are they supposed to kiss her ass for making shifty life choices when she doesn’t have the brain capacity to understand the consequences of? Give me a break. She’s a selfish idiot teen who can’t even comprehend that her feelings aren’t the center of the universe. No amount of HELP is going to change that. Let her live on her own for a while and see just how shitty it is. Maybe she’ll pull her head out of her ass.",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "This is the right answer. I’m sure there’s more than this one instance that led her parents to make this decision, but... she’s 16 and there were definitely many instances that led this girl down her path.\n\nNTA. There is not situation in which OP is the asshole because this isn’t her child or her decisions and she is literally not responsible. Both her parents and her sister are TA.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "My guess is there is a whole lot more she did that led to her parents decision.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I think OP is not at fault but the parents are more at fault.  However, we really don’t know the circumstances behind the situation at home.  We only see if from OP’s POV.\n\nIts possible the parents were too busy at the business to actually do any real parenting at home.  I’ve seen that on Super Nanny where the parents put in unrealistic hours at their business, come home to a few toddlers but are so exhausted they couldn’t parent and relied on the older children to do all the parenting.  \n\nIt could also be that the parents relied a lot on OP and enforced life discipline on her, but they forgot about the sister being involved with their lives or responsibilities.  I’m a perfect example of that.  Before I left for the military, I helped out my parents a lot at home: cooking, cleaning, grocery shopping, taking the trash out, etc.  When I asked for my siblings to help out with these things, my parents refused to let them help.  And when I left, the household went to shambles!  My parents then tried to get my siblings to do the things I did and they either refused or did it completely wrong that they stopped altogether, which led to my sister running crazy while in college.  When I questioned my mother why she is allowing this her response was “she’s living the life I didn’t have at her age, so I let it be.”",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 356,
      "content": "Some areas have shelters for young pregnant women and mothers. Is it possible to look into that for her?",
      "id": 122,
      "comments": [
        {
          "score": 252,
          "content": "Yes, we actually have one about 15 minutes away from our house. I'm pretty sure she can look into that herself though.",
          "id": 123,
          "comments": [
            {
              "score": 295,
              "content": "She's 16 and might not even know something like that exists to look for it.  It wouldn't hurt to tell her that it exists next time she brings up her boyfriend's car as her living situation.",
              "id": 124,
              "comments": [
                {
                  "score": 303,
                  "content": "Well, like I mentioned, I've already sent a plethora of links, forums, general information, videos to her containing advice on every aspect of her situation. Yes, I also included links to nearby women's clinics, shelters, doctors, etc. \n\nOn a side note, she went to a large public high school in a very liberal part of California. Trust me, she knows all of about sex ed, women's shelters, women's clinics, etc.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 80,
                      "content": "And you probably have a planned parenthood in the area for medical care, regardless of choice.   \n\nPlus, Cali probably has social services for low income pregnant women. I know WA state was pretty comprehensive.    \n\nYour sister needs to stand on her own two feet. She’s not going to do that if you, and your parents, carry her everywhere.    \n\nGood on you all for standing your ground.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 313,
      "content": "NTA. She asked you to mind your own business. That sounds like good advice.\n\nBesides, you can't give her what you don't have. There is zero chance your roommates would be okay with your sister and her BF moving in.\n\nI see no reason you can't offer advice. She needs to get aid and he needs to get a job. She can not live with you. You can not give them money.",
      "id": 127,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 193,
      "content": "ESH. And I'm truly shocked by all the replies that go \"let's teach her a lesson\"\n\nFor Christs sake, the girl is 16.  Yes, she was/is stupid. Yes she rejected all kind of advice beforehand.\n\nBut again: She is still a child and now is the point where she needs the help of her family more than ever. Parents  DISOWNING their child because of an unwanted pregnancy? Seriously? Do you and your parents want your sister to become a teenage single mom?\n\nI have kids, 18 and 21, a boy and a girl. Yes, biologically and from a legal point of view they are adults but emotionally and intellectually they are still kids. Teenagers are self-centred, their world revolves around themselves. In many, many cases they cannot anticipate the consequences of their actions. \n\nThis is is the time to forget past actions and forgive mistakes. Stick together as a family and try to straighten out things.",
      "id": 128,
      "comments": [
        {
          "score": 107,
          "content": "I agree with you. I think the parents and the pregnant teenage are TA and not OP, but the parents are the biggest.\n\nIt sounds like they put a lot of their own ideas over both of their children, needing their oldest to provide so much at a young age. They also chose to have a child 16 years ago and dont get to write her off because they dont like the poor decisions she made. She sounds like she is already at risk, and will even more so if she continues this path with no positive input  in her life. \n\nThis kind of negativity breeds more negativity and now a baby will suffer too. I really disagree with using another innocent human to “teach someone a lesson.”",
          "id": 129,
          "comments": [
            {
              "score": 65,
              "content": "Exactly. And I think there’s a layer here of OP feeling resentful that she had to work so hard from a young age, only it’s directed towards the sister who she had to provide for instead of the parents who put her in a position where she had to grow up so fast.\n\nIt’s totally natural for OP to feel frustrated/resentful/hurt/angry, but her sister didn’t have a say in any of the events that led to OP working so hard from such a young age.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "While the parents may be the biggest asshole for kicking out their fucking 16 year old daughter OP is not really much better turning her down and letting her live on the street if she has other options. I have lived in Shared Appartments and if my sister needed me I'd be damn sure she could crash at my place whatever it takes",
              "id": 131,
              "comments": [
                {
                  "score": 12,
                  "content": "No, OP isn't letting her live on the street. Sister chose to leave home, no one kicked her out. She needs to humble up and stay there.\n\nAnd at the end, no one knows how she is. Original poster lives with other people and is risking their wellbeing for the sister if she did move in. Boyfriend is gonna most likely be there all the time, probably leave drugs around, may steal and for all we know, sister could be doing the same thing. Sometimes it's not worth having your lifestyle at risk because someone else likes to be a rebel.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 8,
                      "content": "The alternatives to OP were her staying with her drug selling BF in his car or crashing at her place. How is denying her crashing at her place not making her live on the street? That is literally what is happening because of what OP did. \n\nOf course we don't know OP or her sister, but from my point of view a 16 year old child (which is essentially what OPs sister is here) should be given the benefit of the doubt and regardless how she is, she needs help right now. And from what I can read here her parents turned her away leaving her wiith her sister as her next closest relative to turn to. \n\nAnd you know there may be some more bullshit coming, like for example stealing, but that is in my opinion the risk you have to take for family. \n\nI really find it crazy how many people here just tell OP to give up on a sibling, without anything really meriting that having happened. It is not like she stole something from them or abused her family in some way. She is a rebellious teenager and honestly I pity her. \n\nMaybe she can't be helped, but I feel like neither OP nor her family have really tried",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I agree somewhat but it is no OP’s responsibility. Would helping her financially or letting her stay be a good person thing to do, yes. Because she didnt, does it make her TA, I dont think so. She could choose to help outside of her responsibility but just because she chooses not to doesnt make her TA.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 85,
          "content": "Because most of the people in here aren’t young themselves and think the approrite way to deal with things is black and white. Sister did bad thing. Sister be punished. \n\nIt’s appaling how many people think disowning a 16 year old is ever the appropriate action.",
          "id": 135,
          "comments": [
            {
              "score": 98,
              "content": "This is a pattern you can see all the time on r/AmItheAsshole : \n\nFar too many comments which focus on \"being right\" instead of trying to resolve conflict in a constructive way.",
              "id": 136,
              "comments": [
                {
                  "score": 45,
                  "content": "Exactly. The responses are often ‘NTA. It would be funny/petty/nasty to do this but they deserved it’\n\nYes. That makes you the asshole!",
                  "id": 137,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I would be suprised if most people on here weren't young (say <30). \n\nI mean OPs sister clearly fucked up, but she is a teenager and now you need to find a solution for the problem at hand and not hand out blame.",
              "id": 138,
              "comments": [
                {
                  "score": 5,
                  "content": "That’s it. The solution isn’t ‘I disown you’ which is what the parents have done.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I honestly think it's the other way around. Older people know how fucking dumb you could be at 16, maybe they werent that dumb themselves but they at least know of it and can have empathy about it.\n\n\nIf you're 16 yourself and you're in a good place of course you're gonna judge this girl who's managed to have a teen pregnancy.",
              "id": 140,
              "comments": [
                {
                  "score": 2,
                  "content": "I won’t edit but it was meant to be ARE young.",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "I disagree with this comment entirely.",
          "id": 142,
          "comments": [
            {
              "score": 19,
              "content": "feel free to explain why",
              "id": 143,
              "comments": [
                {
                  "score": 32,
                  "content": "She cannot be old enough to decide to give birth and raise a child with a drug dealer but at the same time be young enough where she needs her family to take the responsibilities for her decisions.",
                  "id": 144,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "It seems like people like to take a moral high ground in this situation and argue that \"tough love\" is necessary against teenage delinquency, but if people actually bother to read up on child development and child care they would realise how they exact opposite is true.\n\nThe girl is PREGNANT, would rather live in an alleged drug dealing boyfriend's car than with her parents (there's got to be more to this than just teenage hot-headedness) AND she has 0 family that are actually getting her the help she needs.\n\nOf course she's fucking up! She's 16! This is so so sad.\nP.s. for what it's worth, I think your attitude as a parent is much healthier than OP's parents.",
          "id": 145,
          "comments": [
            {
              "score": 45,
              "content": "This shit drives me bananas.  \n\nIf you angrily posted about your congressman trying to gut WIC or some other social service aimed at poor mothers you'd get a million gold accompanied by a million wordy rants on the topic of *A Human and Societal Obligation to Help Those in Need* / *It's Sad that in the Richest Country On Earth We Can't Even Do X* but yet for some damn reason whenever a *specific* person shows up with a pregnant daughter/sister everyone goes FUCK EM, THEY MADE THEIR CHOICES LET THEM PAY THE PRICE, YOU DON'T OWE THEM ANYTHING.\n\nThis is their daughter and soon to be grandchild/niece/nephew.  **Help Her**.",
              "id": 146,
              "comments": [
                {
                  "score": 30,
                  "content": "It might be because people fail to see that OP has only one side of the story.\n\nWhichever way you spin this post, OPs sister is 16 and her parents failed her, not the other way around.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 17,
                      "content": "They went from spoiling to disowning her. This family needs to understand middle ground.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Yes, THANK YOU! Teenagers need parental guidence! Yes they act out and rebel, but that's where parents should step up and discipline them, not kick them to the streets!! Kicking her out is a one way ticket to a very dangerous road (and \"letting her stay in the house but not acknowledging her as their daughter\" is basically kicking her out, because of course she doesn't feel wanted after that)",
          "id": 149,
          "comments": [
            {
              "score": 19,
              "content": "> Yes, THANK YOU! Teenagers need parental guidence!\n\nGood thing OP Isn't her parent.",
              "id": 150,
              "comments": [
                {
                  "score": 25,
                  "content": "I did not blame op. You can look for my judgment in my comment history and see that I said that \"esh except for op\". My comment has nothing to do with op, but with op's parents and their lack of parenting (imo)",
                  "id": 151,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "If she thinks she's old enough to drink, date criminals, smoke, and get pregnant she's old enough to learn that actions have consequences.",
          "id": 152,
          "comments": [
            {
              "score": 14,
              "content": "Yeah, let her suffer. And her soon-to-be-born child as well. That'll teach her.",
              "id": 153,
              "comments": [
                {
                  "score": 8,
                  "content": "Take the child away from her. Better for everyone involved. And maybe in the future she deserves to be a mother by maturing up and doing what is needed.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 4,
                      "content": "CPS exists for a reason, after all. \n\nSince we can't force adoptions or abortions on even the worst people.",
                      "id": 155,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Honestly, it just might.",
                  "id": 156,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Yeah, OP tried that. She tried talking with her sister before but sister is a cool kid. Do you really think that she's just gonna do 180 with her behavior and dump that drug dealer and get her life straight? Parents enabled her too much without proper parenting and now you want OP to waste her time on her sister (yes, after I read from the post, she's a waste of time)? The only solution is abortus and making her dump her bf and patroling her every move because it's obvious that she can't be trusted with.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Surprised I had to scroll this far down to find this. Seriously everyone here is talking like they’d be ready to handle the world at 16 PLUS A POSSIBLE BABY (if she doesn’t get steered towards a rational decision/help to find an abortion in one of those uber conservative states.) Totally abandoning a young pregnant girl is how we got all those ‘teenager accidentally kills self with coat hanger back alley abortion’ headlines from the past. Think of it from her side; if she somehow gets through most/all of this without your parents’ help, your help, or sperm donor’s help then she can write a post ‘WIBTA to never speak to my family again after they disowned me for getting pregnant?’  She would have good cause to never talk to any of you again because you abandoned her ‘to teach her a lesson.’ Also what ‘lesson’ are you even teaching? Don’t trust anyone ever because they’ll abandon you if you’re not a perfect saint all the time? Most functioning adults tried a combination of alcohol/drugs/sex for the first time from 14-19, it’s even in residency guidebooks to watch out for ‘straight edge’ kids who don’t know their limits by the time they get to college because they’re the demographic most likely to go overboard & actually hurt themselves. It’s been proven again and again that punishments for ‘morals’ doesn’t improve anyone psychologically, trauma just causes more trauma. Congrats assholes.",
          "id": 158,
          "comments": [
            {
              "score": 7,
              "content": "This is the comment I was looking for. Guys, she isn‘t a fully grown adult, she’s a teenager with a junkie Boyfriend and without any real friends. And Right now if you don‘t help her she‘s gonna fuck up big time. And think about the Baby too. He/She is innocent. I don’t get how people are being that mean",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Smoking weed as a teen is stupid\n\nUnderaged drinking is stupid\n\nGetting knocked up by a drug dealer and refusing all help from your family goes beyond stupid. What difference w would it made if she was 2 years older?",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I think one key piece of information we are all missing is the actual parenta, kid sisters point view. My guess is parents did not disown her but are verbally not happy with the choices and they probably do not want to let her boyfriend move in, as a result, she has actively chosen to leave.\n\n There is nothing any parent can do to stop her from leaving. \n\nMaybe she got pregnant on purpose. Based in his track record, it's possible he was kicked out of his house way before she got pregnant.  he lives out of his car, logically, a 16 yrs old might think, if he gets me pregnant, mom and dad would let him move in. Except, mom and dad said no, and a teen willing to get knocked up for her bf, is definitely going to stick with him over her family. You are 100% right, there is very little logic at that age. But, legally, at 16, no one can force her to do what she doesn't want to do.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 130,
      "content": "NTA: she has a place to stay, she just doesn't want to use it. You're in the clear here. Let her sink or swim if she wants to act like \"a cool kid\"",
      "id": 162,
      "comments": [],
      "relation": "Support"
    }
  ]
}