{
  "post content": "My wife (35F) and I (35M) have been together for 10 years, married 5. We grew up completely different. She's the only child of a surgeon father. Her mother died when she was 2 and it was her and her father for most of her life. He remarried when she was 17. He's wealthy, sent her to private school, paid for her college, and when we met a decade ago he was still paying her rent, even though she had a solid job. I come from a poor family. But we both have pretty good jobs and make around the same amount of money now.\n\nShe is such a daddy's girl and it's been affecting our relationship. Anytime she wants or needs something, she goes to her dad first. And sometimes it's about things I could help with. I work in tech and back when we started dating she was starting grad school and she asked her dad \"what laptop should I get\"  I told her I actually work in the field (which she already knew) and could easily answer that and get her what she needs and she just kind of shrugged. Okay fine. These little things have happened throughout the last decade. But, there have been bigger issues recently.\nLast year, she decided she needs a new car. I disagreed. Her car is fine and she works from home and barely drives. She was adamant, though. About a month later, she tells me she's getting a new car. I told her we need to make these decisions together and we share finances and this is a major purchase. She says, \"oh, my dad is buying it. He said we can just sell mine and get some extra money.\" I told her it's kind of ridiculous to ask her dad to buy her a brand new car when she has a perfectly good one and we don't need it anyways. She got upset and said it's not that big of a deal and her dad doesn't mind and that the car \"wasn't that expensive anyways.\" She said I'm overreacting and that it's okay for her dad to do nice things for her. She got a brand new 2022 car completely paid for by her dad. And we sold her old one. \nNow, we are buying a new house. We've finally narrowed it down to two options. We were discussing it last week and my wife says \"oh I don't think house A is good my dad said he think we could do a lot better in our budget.\" Before she talked to her dad, she LOVED House A. So, I got a bit frustrated and said it didn't matter what her dad thought because this is our family's home and he won't be living there. She got angry. We started arguing. We both said mean things. I called her a spoiled brat and said she needed to grow up and she got upset and slept in the guest room and has it's been a few days and we have barely spoken. She said I was \"so mean\" to her.\n\n\n\n\nUPDATE: wow did not expect this to get so much traction. This was mostly a late night stream of consciousness and I realize I left a lot out, of course. I DID apologize to my wife for the name calling and we both agreed we have some issues to work through. Here's some more info for context and to answer some questions I've seen asked: \n\n1. We could have afforded the car on our own. We do well for ourselves. I was not worried about not being able to afford it. I just did not understand the rationale of buying a brand new car when you have a perfectly good one. Her old car wasn't even that old. It was a 2019 and had pretty much all of the same features her new one has. It didn't make sense to me. Also, we have a toddler and it's actually harder for her to get him in the new car than the old one. She also barely drives. I mean, seriously, the car sits in the garage 90% of the time. She has even said before that she hates driving. Sure it was free but I guess it's more about the principle than the car itself. But, she got what she wanted so whatever. \n\n2. We've been together 10 years - has it always been this  way? Why did I stay? --- valid points. And something I could dig deeper on. No answer right now other than I just fell in love and didn't want to leave. \n\n3. Do I have my own daddy issues? No, not really. My dad and I are fine. My parents are still married. We were very poor growing up and my parents were undocumented, and that was a very stressful way to live but my family made it work. I live on the other side of the country now so I don't see them as much but we talk and visit regularly. \n\n4. My father in law is a nice enough guy and for what it's worth, he also says his daughter is spoiled and has made comments throughout the years about it. Obviously I didn't need to call her a spoiled brat and I recognize the difference in her dad saying it and me but I am not the first person to say it to her. I KNOW THAT DOESN'T MAKE IT RIGHT. \n\n5. I recognize I have my own issues due to poverty, trauma and all of that. I have been to individual therapy. That is a forever ongoing process. \n\n6. The house: All of the reasons my wife gave me are just matters of personal preference, like \"my dad says we need a bigger kitchen,\" \"my dad says we need a bigger backyard.\" He is also convinced we will have more children even though we said we so not want anymore so he also said we need \"more rooms for more kids.\" Nothing about safety of the house, the price, etc..just things he personally doesn't like or would have different in his home. Also we've been looking for over a year and he has given his thoughts many many times throughout the year. So, I'm not saying she shouldn't ask him for advice. Also, no, he would not be paying for any of the house. \n\n7. My wife has never been to any type of counseling in her life. When I suggested grief counseling for her after I started my own she looked at me like I said something ridiculous. Her family is very skeptical about therapy. So, I'm not sure if I will get her to do marriage counseling but we will talk about this further. \n\n8. Finally, my wife is a funny, creative, and beautiful woman. She's a great mom. She makes everyone laugh. I do love her despite what the post may make some of you believe.\n\nThanks to those who sent me thoughtful messages. They provided interesting perspectives. ALSO THIS NOT A FULL PICTURE OF EVERYTHING. I'M JUST NOT WILLING TO SPEND ANYMORE TIME WRITING IT. IT'S A LOT.",
  "id": 1,
  "comments": [
    {
      "score": 11072,
      "content": "YTA\n\nYou just sound super insecure about her Father. Take a moment to reflect you're on reddit complaining she asked her Dad for advice on a laptop.\n\nYou're jealous. That's all there is to it and it's pathetic. Instead of worrying about her realtionship with her Father and calling her names why aren't you using rich FIL to your advantage?\n\nLike you actually started a fight over her getting a new car neither of you had to pay for. Just insane.",
      "id": 2,
      "comments": [
        {
          "score": 5909,
          "content": "On reddit complaining that she asked her Dad for advice on a laptop 10 YEARS AGO, no less. Good grief.",
          "id": 3,
          "comments": [
            {
              "score": 2731,
              "content": "Ok, if he has to go back 10 years to name something that's bothersome, *OP* is the spoiled brat. My goodness",
              "id": 4,
              "comments": [
                {
                  "score": 330,
                  "content": "Ahhhh….hello people….what about getting his advice on which house to buy…which just happened?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2808,
                      "content": "It’s extremely normal to get parental advice on the largest purchase of your life",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 629,
                      "content": "I asked my parents for their advice when my partner and I bought our house because they'd bought way more houses than we had (i.e. a number greater than zero).\n\nThey talked us out of a house with a ton of original features that we both really wanted because, under the surface, it was a miniature version of the house in The Money Pit.\n\nWe were so taken with the Anderson shelter under the cellar stairs and the original stained glass in the windows that we'd glossed over the fact that slates were hanging off the roof leading to damp and the transom window above the front door was held in with sticky tape.\n\nTurns out that asking for advice from people with more experience and less emotional investment can be useful.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 366,
                      "content": "Ah yes, how spoiled of this woman to ask the opinion of someone who's bought houses before",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 209,
                      "content": "And?! Totally normal to solicit parental advice? I just don’t get why weirdo OP thinks he is supposed to replace Dad?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 155,
                      "content": "Wow getting advice from the parent who has owned a home before - so wild and shocking /s \n\nIt is literally absolutely normal to talk to your parents or older relatives about this stuff and get advice.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 127,
                      "content": "i think most everybody discusses major life decisions with more than their partner.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 80,
                      "content": "That’s a completely normal thing to ask your parent for advice on tho\n\nIn research parents are the number one trusted source for advice on housing decisions by a long shot",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "What about it? Of course people who have good relationships with their parents talk to them and ask opinions on stuff like that.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "I don't think it's uncommon at all to ask parents for advice on buying a home. She may have loved house A and after speaking to her father, maybe he pointed out some issues with it or recommended a different property that might be better? I don't think it's anything to get this upset over. \nThe car? It didn't even have anything to do with him! He isn't driving it. He isn't paying for it. They made money for Christ's sake lol Also not a reason to call her names. He sounds really insecure about her relationship with her dad. He's not going to be around forever and she grew up with just the two of them for 15 years. She's an only child and it isn't uncommon to be spoiled when you're the only child. It doesn't sound like she's lazy or entitled. Her dad had the money to send her to a private school and college! That's amazing. She got a great education and has a good job. She isn't just freeloading off her father which would make this a lot different. She still works and pays her bills. OP is TA here.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "me and my husband are looking to buy a house. I would never buy a house that my father (who knows much better what to look for regarding a actual good purchase that wont bring us serious trouble later) doesn't approve of. Our parents have life experience that both me and my husband lacks at this point of our life, why wouldnt we want to take advantage of that?",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I saw that example as showing how this has been going on throughout their relationship, like it started with the laptop, and has built over the years.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "NTA I guess I’m in the minority because I feel sorry for OP. He has a third wheel in his marriage.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 448,
              "content": "And calling her a “daddy’s girl” as if it was a bad thing. I mean, what, is she supposed to be a mommy’s girl???",
              "id": 18,
              "comments": [
                {
                  "score": 420,
                  "content": "He’s just insecure w a weirdo complex about being “the only man she needs.” Calling her daddy’s girl like it’s a bad thing. Like, “yes my dad loves me, cares for me, is there for me. I don’t need either of you, but keep pushing it and I’ll ONLY be daddy’s girl while I divorce your ass.” \n\nOP is about to FAFO if this thread doesn’t convince him to pull his head out of his ass.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 95,
                      "content": "Ahahaha you're right, I thought it was just normal jealousy but I wonder if it's his *wife* he's also jealous of",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": ">a weirdo complex about being “the only man she needs.”\n\nexactly. Ick.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "The lack of the OP’s responses in the comments make me think your take is spot on.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "You just know if she didn't have a close and happy relationship with her father he would say she has \"daddy issues\"!",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Good point. And there’s nothing inherently wrong about being a “daddy’s girl.”",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 134,
              "content": "YTA, The OP has been with her for 10 years and only now he is noticing that she is a brat. As long as she is not asking OP to pay for, what does it matter where the legal money comes from. Also it is important to get advice for important things like a house as some things are done once or twice in life. OP has an inferiority complex to her Father.",
              "id": 25,
              "comments": [
                {
                  "score": 270,
                  "content": "She’s not a brat tho^",
                  "id": 26,
                  "comments": [
                    {
                      "score": 307,
                      "content": "Yeah! She's spoiled for sure but nothing indicates she is bratty? Her mum died when she was young! Of course she is close to her dad and he spoils her!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Exactly. She just has a healthy relationship with her father and asks him for advice. I see. I issue with that. \n\nAs for helping her with her bills? I’m assuming she has no sibling and therefore why the heck can’t a family member help another one?",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 129,
              "content": "10 years ago AND when they had just begun dating so she didn't know him very well.",
              "id": 29,
              "comments": [
                {
                  "score": 18,
                  "content": "And, since her dad probably also paid for grad school, asking his opinion on the laptop…he’s about to pay for. \n\nMy kid is in college right now. Trust that if she called and wanted me to buy her a laptop I’m buying something that meets her school needs (internet access, write papers) not her wants (gaming).",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "lol🤣",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Not only that, but when they started dating. Not they've been together for a while. Makes me wonder how new of a relationship they were in when she asked her dad for a laptop. Bc I can understand asking for advice from your father instead of your new bf you've only been with for a couple of months.",
              "id": 32,
              "comments": [
                {
                  "score": 12,
                  "content": "But, uh, he WORKS in tech so she OBVIOUSLY should have reached out for his expertise above all others. 🙄\n\nTbh, after being this annoying for so long, I’m shocked she married him. OP has clearly gotten into a headspace where everything involving Dad makes him unreasonably furious without really stopping to consider if it’s something he needs to be mad about. Maybe if he were nicer to dad, he could ALSO have a new car, ha.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Also DIL is rich and willing to buy nice stuff that BOTH OF THEM will benefit from. I don't see the problem, most ppl are stumbling through life. Just set some healthy boundaries which doesn't even seem necessary since her dad don't barge in too much.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "When they had just started dating, too. It wasn't as if they had a years-long relationship at that point!",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "That’s some level of petty. I can’t even remember what I was mad at two months ago, never mind ten years ago.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": " I wonder who paid for their wedding... And not a single word of complaint from OP about this one: :D",
              "id": 37,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1270,
          "content": "If it was a guy running to his mama for everything, the answers would be different. It's baffling.",
          "id": 38,
          "comments": [
            {
              "score": 912,
              "content": "I was just gonna say this. I hate the whole “if the genders were reversed” thing but holy shit if a woman came here complaining that her husband’s mom had talked them out of getting the house they both wanted we’d be telling her she has a husband problem",
              "id": 39,
              "comments": [
                {
                  "score": 617,
                  "content": "The house thing is suspect but OP is being so weird about a free car that I doubt the accuracy of his reporting on the house issue.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 460,
                      "content": "Yeah, for all we know FIL pointed out something that they hadn’t even considered about the house.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 240,
                      "content": "It think it's the fact that the partners dad is involved in everything that's the problem,  I can only imagine how annoying that is ..to have whatever you say or do, daddy's opinion and money is always going to be top, 10years of this I'd be fed tf uppppp",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 196,
                      "content": "My parents were in this exact situation, we were poor and my moms parents were much more well off. It leads to never actually being treated like an adult or being able to make your own decisions. OP sounds like he’s taking it a bit too personally, but what happens when dad passes or can’t do everything for her. That’s what I’d be more concerned about personally.\n\nEdit: I should say *can* be an issue. It really depends on the exact details of how these “decisions” are being made. It seems like OP and his wife have different views and goals on money and rather than figuring out a compromise wife just lets dad pay for it. Which feels like just avoiding communication in a way, idk how I’d feel about it tbh.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 110,
                      "content": "My husband would have been the same about the car. Because it's not just the car it's the maintenance, taxes, and insurance that come with the free new car. Also the underlying that the old car isn't new and shiny still she needs the newest thing on  the shelf.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Yep and whining about a 10 year old lap top convo.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I'm suspicious there, yeah. There are so many things to check for when buying a house, it's entirely possible that OP + wife missed something major. It's in a flood-prone area, it has a bunch of old trees overhanging the roof, those huge bay windows have zero insulation and are going to suck for most of the year. There's PLENTY of reasons to check your choice with someone else and see what they can find to criticize about it.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Or laptop advice from a decade ago. Like sure he works in tech, I work in tech, but buying a laptop isn't really a technical question. Super reasonable to ask your parents for advice on buying a laptop.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 350,
                  "content": "Depending on the background, it's either N T - A or Y T - A.\n\nDoes wife run with anything to her dad first, circumventing her husband? To a degree where it feels either a relationship of three, with dad inserting himself or wife inserting dad into situations he should not be involved in? Or making OP feel more like an accessory than a partner in a relationship?\n\nOP would be not the A.\n\nIs wife just asking her dad's opinion and considers it when making a decision? Does she simply not turn down help offered, even if it is financial help? And these actions in turn make OP feel insecure, as in he starts to doubt his status as a man (or the man) and his ability to provide?\n\nIn this case OP should get over himself, as long as there are no strings attached.\n\n(Gonna go ahead and also assume that being a surgeon he couldn't spend as much time with his daughter as he'd have liked, so this is how he is trying to make up for the lost time?)",
                  "id": 48,
                  "comments": [
                    {
                      "score": 117,
                      "content": "This. This should be the top comment.\n\nThere's no doubt that OP is insecure about where he stands compared to his FIL. However, it's impossible to know how much of this post is opinion or hyperbole and how much is verbatim truth.\n\nThe car thing makes her sound childish and materialistic if true. But hey, some people are, and if dad's going to buy the car outright, then there are no lasting consequences - it does paint the wife as a bit of a spoiled brat though.\n\nThe laptop thing, again, whatever. I can see feeling hurt if OP works in the field and she didn't even ask his advice, instead going to her presumably elderly father who also presumably knows less about current laptops than someone who works in the industry.\n\nThe house thing is a big question mark. *Advice* is great.   One can probably assume that FIL has bought a couple of houses in his time and has a few tips. As first-time homebuyers several years ago, my partner and I were happy to have the advice of our parents in terms of things to watch out for, red flags, and desirable traits, as well as advice on lawyers and inspections. They were overbearing at times, but when we found a home we loved, even if it wasn't the one they would have chosen for us, they helped us instead of trying to talk us out of it.\n\nThe question is whether OP is interpreting FIL's good advice as interference, or whether the interference is actually happening. That's hard to judge because I think OP is so insecure about FIL in general that it's hard to trust his account of the events.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "OP doesn’t need to provide. He said they both earn around the same amount of money. So if that’s his hangup, he needs to have a seat because he’s not providing anything more than she is.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "I actually got that advice. I am a woman and I had exact same issue where in our house buying decision my husband was involving his parents. And i completely agree that my husband needs to grow up.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I value my in-laws opinions on building our future home. They've been through this before and can help prevent us making an annoying mistake that they made when building their home. However, my husband also doesn't let his parents take the reins on it and overall we make the main decisions.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "I’m actually in this exact situation with my husband’s family and we’ve had no problems. IF they were using their money as a means of controlling our decisions as a marital couple or were disrespectful to me then that’s a different situation but that’s not my experience and doesn’t seem to be OPs or he would’ve mentioned it.\n\nMy in-laws paid for our wedding, followed our wedding guidelines (let us plan everything, and followed dress code). It wasn’t over the top and they aren’t Bezos rich but they wanted to help us and did. We also have a newborn that they love to spoil and that includes giving us their car and buying a new one for themselves so we can visit more. \n\nLet people spoil their kids. If my parents had the money, they’d do the same. And even without the money, they’d did way more than I ever could’ve imagined. I’d only change my response if people were being blatantly disrespectful or mean or controlling etc. because I NEED anything from anyone but if family has the means to make your life easier then what’s the harm. But that’s just me.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I completely disagree, if only because the house thing is called into question by the way OP has told the rest of the story. He’s calling her a spoiled brat because her dad gave her laptop advice *ten years ago* and a free car. Neither of those comes off as bratty to me, and one was a decade ago. Other commenters, men and women, have talked about their parents giving them advice so that they don’t wind up with money pits — which is reasonable.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Not wrong, but more often than not, that stereotypical MIL is usually the controlling type and impose a lot. That doesn't seem to be the case here",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "We don't really have enough info to tell if he \"talked her out\" of a great house they loved or if he pointed out a valid concern they hadn't considered. One of these is problematic, the other is helpful.",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 352,
              "content": "But she doesn't run to him for everything right? OP didn't give 1 real example where she was really out of line.\nShe asked her father for advice on what laptop to buy when they were starting their relationship and he calls than an issue?? So she can't ask anything to her dad because it is an issue.\n\nThen he says he wants both of them having a discussion about the things but when she comes to him he shuts her down. She said she needs a car, and he said she doesn't. Where is the discussion there? If both are making good money I don't even understand what the problem is, but it seems she realized he wouldn't budge on the budget and she wanted a car, so she told her dad and basically she got a new car without spending anything. Why is that a problem? If the father had said he would loan them the money or something, but nope, he paid for the difference for the new car.\n\nThen they get to this house and she seems to like it, talks to her dad and he says they can do better. He didn't say the house is bad, he said they could do better, basically financial advice. It seems she respects her rich dad financial advice, what a shocker!  OP could have had a mature discussion with her, but instead he told her he doesn't care what her father thinks because he won't be living there. How is that mature? I don't know, but if I am making a big purchase i would actually appreciate advice from people that cares about me. Her father clearly cares about her. So instead of getting all mad he could have a discussion as to why he says that and together they could decide if they buy or not. But instead he called her a brat. I say he is the brat.\n\nUsually when people come here complaining about mommy's boys they are complaining about guys that basically insert their mom in every discussion and egg them against their wife's. She didn't do that. She told her father about a major life decision and she took the advice. She didn't call the dad to tell her husband he is an idiot for buying that house. He doesn't respect her because she relies on him, like she is not mature enough. And to me he is the one with issues. If you have a rich parent that likes to spoil you even though you make good money yourself, why wouldn't you let them? How is that financially sound? The father doesn't seem to have strings attached to the things he does for her, so what is the problem? I mean it be could OP forgot to mention all the times the father really but in, but it doesn't seem likely. For me the laptop \"issue\" says everything.",
              "id": 57,
              "comments": [
                {
                  "score": 46,
                  "content": "I totally agree with you. OP doesn't want a discussion, he wants final say. By his own words, every single time his wife has told him something, he has been irritated by her and shut her down.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "I want to argue with you but I can't. Well played.",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "My dad used to take care of me like that, now he spoils my (step)nephew. But he always said that I’m going to get it one way or another, so I might as well get it while he’s alive so he can see my joy. Maybe her dad feels the same way; why wait will to be read to gift your children with opportunity?",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 206,
              "content": "Imagine a woman in IT was complaining that ten years ago a guy had asked his surgeon mother advice about a laptop.\n\n&#x200B;\n\nthen wanted a new car and his surgeon mother had offered to buy one so the family had extra money.\n\n&#x200B;\n\nthen suggested she could help the couple do better for a house given their budget.\n\n&#x200B;\n\nI cannot imagine giving a different answer. The difference is you’re framing it as “running to mommy” as opposed to “having a supportive parent.”",
              "id": 61,
              "comments": [
                {
                  "score": 130,
                  "content": "Seriously. It’s 3 instances in 10 years! Like gtfo w your jealously and weirdo macho competition w dad. You don’t compare. You don’t replace. Stop trying to! It’s weird!",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "As a woman in IT, a little story, lol. When I was in uni, I was living with my then boyfriend. He's also in IT, we literally studied in the same group starting from college, and our neighbors knew that. Naturally, whenever someone needed tech help, they came to us, but kinda specifically to him. \n\nKnock-knock, if he gets the door, sure. I open the door, \"Oh, hey, can I talk to [him]?\", \"Yeah\", whatever. But even when he wasn't home or was away, they didn't say \"can I get your help, then?\", most of the time they asked when he will be back and said they'll come back later or for me to tell him to come by, even if that was next week.\n\nIt's worth noticing that half the time we ended up fixing the thing together, or even just me for whatever reason.\n\nCan't say I was mad mad about it, but definitely got more salty with each time after I first noticed it. I wasn't pissed that I was passed overs though, I was pissed about the reason why. More sexism, yay!",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 182,
              "content": "No actually I don’t think they would be because then the mom would be rich and everyone would still be (rightfully) calling out how stupid it is to turn  down a free car and also still be mad someone went to their parent for advice for something 10 years ago lmao",
              "id": 64,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 98,
              "content": "I always ask my Mother for advice. Frankly it's sad so many people feel like this, you *should* be able to go to your parents for advice or help.",
              "id": 65,
              "comments": [
                {
                  "score": 7,
                  "content": "I'm thinking these people defending OP have bad relationships with their parents if they think asking your parent for advice is childish.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 68,
              "content": "It’s not everything. It was a laptop 10 fucking years ago, a car dad fully paid for (your welcome husband who not only didn’t pay a cent but made money off the sale of the old), and a house buying convo. That’s normal af and if you think that’s some pathological amount of support, YOUre baffling!",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "My husband asks his mother for advice. Nothing g wrong with thst",
              "id": 68,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 42,
              "content": "He's got 3 examples in 10 years. It's not everything.",
              "id": 69,
              "comments": [
                {
                  "score": 6,
                  "content": "He gives 3 examples that doesn't mean there's not more.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "In the stories with the guy and his mom, the mom is usually being pretty awful to the woman. Implying she isn't good enough and trying to take her place in the guy's life. I don't see any of that here.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That's the difference. She isn't running to her father when it comes to him or the relationship. The father doesn't interfere in their relationshio. He just buys her things.\n\nThe reverse would be just that: a man's mother doesn't dictate the relationship, doesn't have any expectations on what the DIL should or shouldn't do, she just buys him things.\n\nNormally when women deal with a man who runs to his mither, the mother gets in the way and dictates how she should do things, how she should parent her children, blames her for fights etc. \n\nSome of you really struggle with logic and common sense.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 208,
          "content": "Yeah, it's jealous but also pride. He comes from a poor background and has a completely different understanding of money compared to him. The gifts and help he got from parents compared to her are worlds apart. It's definitely his issue tho. Even tho they are well off, as you said, he should take advantage of it because all in all, he is not losing out on anything. \n\nAnother point, her asking a dad about a laptop... It has nothing to do with him, it's about a chance for her to interact with the person she loves.\n\nFIL told them that they can do better with their budget, he gave a sound financial opinion. The wife did not stop loving the house, she just believes her father must have a good track record of giving sound advice compared to a husband who feels like he is in a competition.\n\nOP, just because you don't have such support and relationships from your family doesn't mean it's a wrong thing.\n\nAlso remember, she chose you to spend the rest of her life with you, don't mess it up over pride, it's not worth it if she is a keeper.\n\nYTA, get over yourself",
          "id": 73,
          "comments": [
            {
              "score": 7,
              "content": "Poor people's (and I say this as a former poor person) ridiculous sense of pride is part of what keeps you poor. \n\nI see it over and over again in my own family. They would rather watch their teeth rot out of their mouth than accept $300 to go to the dentist. \n\nNo one is up there keeping track of all the times you go hungry or go without to reward you later. Just accept whatever leg up life gives you (it doesn't happen often) and be a decent person and try to pay it forward when you can",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Yes! My reaction would be \"oh sweet, you dad got you a new car! May I buy that resin 12k 3d printer I wanted? I was going to put it towards your car but now I don't need to. Also let's send him some nice wine as a thanks\"",
          "id": 75,
          "comments": [
            {
              "score": 8,
              "content": "I suspect there’s some fear that when the father money tap runs dry that they won’t be able to keep up with the wife’s expensive taste. Also some people like to feel like their contributing to their families success.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You're a good in-law, I'd love to have one like you in the future who'd send me nice wine to thank me! :)",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "I know, I would free car. Yay",
          "id": 78,
          "comments": [
            {
              "score": 33,
              "content": "Seriously. He couldn’t have grown up that poor, bc who is pist not only at a free car but also they made money off the sale! That’s not even a gift horse! OP is just too dumb and angry to be grateful",
              "id": 79,
              "comments": [
                {
                  "score": 3,
                  "content": "Ehhh there’s a whole segment of population that’s pretty poor but grows up with some prideful sense of paying for things themselves. \n\nLike… my parents refused to apply for food stamps even though we qualified for a bit because they were proud. As a young adult, when my exes rich parents offered me a car I insisted on it being a loan and I’d pay them back (I did). \n\nI’m older now and see it as being dumb, but it’s how I grew up. It’s that “I want to feel like I got here on my own” thing.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Yeah, this sounds like it has way more to do with his own insecurities about his FIL's income level/willingness to help his kid than it does with what his wife is actually doing. Do I think it's *necessarily* a great thing that she's going to her dad for help buying a new car? No, but if Dad's not putting financial constraints on her/her husband, then I don't really see how it's for the husband to try and veto that. Like, it's a free car. What's the issue here outside of OP's ego?\n\nAs far as the house, I would talk to my mother if I were about to buy a house and get her thoughts. I might or might not agree, but I would want to hear what she said. I'd expect my partner to do the same and get her parents' advice. Did OP actually hear out what the dad said? Maybe he had a valid point. Or is OP's kneejerk reaction to disregard his FIL's input because of who it's coming from/he doesn't like his wife's relationship with her dad?\n\nI would be curious to know what OP's relationship is like with his parents, and whether this is also an issue. If he's not as close with his parents, that could explain why he's reacting this way, as well. Regardless, YTA.",
          "id": 81,
          "comments": [
            {
              "score": 10,
              "content": "In my experience, people who grew up poor and build a life with someone who grew up with money are often resentful that their partner’s parents are able or more willing to provide for their adult child. It’s projection. It’s totally normal to feel jealous or like it’s unfair, but it’s NOT ok to treat that person like it’s their fault their parents choose to support their kid with their extra money.",
              "id": 82,
              "comments": [
                {
                  "score": 3,
                  "content": "I completely agree, and that's the vibe I get from this post. I can understand OP feeling that way for a variety of reasons, but that's his problem to work out, not his wife's.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My brother and I were born poor but my dad was in the minority of small business owners who grew up dirt poor and actually DID “pull themselves up by the bootstraps” and make something for himself. So while our parents help us out a lot now, we have the perspective of being young children who had very little and never saw their dad because he was always working. His ex girlfriend was always poor and resented him for getting nice stuff or financial help, he didn’t blame her, but it ruined their relationship because she basically told him she didn’t want to be with a spoiled brat. Uhhh, the entire reason my brother graduated college debt free is because my parents dedicated their entire life savings/work to paying for our higher education. I fully understand the frustration of thinking someone has had something handed to them their entire lives, but for us we hadn’t even grown up wealthy, my parents had just lived in poverty in order to prioritize our higher education (neither of them went to college and their one goal in life was to see their children graduate debt free with a college education).\n\nAgain, I’m not trying to be like “poor people don’t know how hard it is to be privileged!” but also, it’s really hard not to get defensive when people project their insecurities onto you just because of your family. I recognize I was privileged to graduate college at all, especially debt free, but for some reason people hear that and assume I must be living off my parents money and always got what I wanted/needed. Money was a manipulation tool in my house, too. A lot of people forget financial abuse is extremely common in wealthy households. Just because someone’s parents are rich does NOT mean they had an easy, comfortable, or well-provided-for life. I know people literally on the brink of homelessness while their parents live in multi-million dollar homes. They can’t qualify for financial aid at school because their parents make too much money, but their parents don’t give them a penny towards tuition, rent, etc. \n\nI really wish we’d stop assuming rich kids are automatically well taken care of and better equipped for real life. Money does not equal good parents. Just like lack of money does not equal bad parents.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Yes, the jealousy is clear here. \n\nI experienced my ex being insanely jealous of my relationship with my Mum, and this is giving off the same vibes for me here.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Man, if my gf’s dad offered to buy her a brand new car I’d tell her take that offer to the bank before he changes his mind😂",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Right? Theyre (theyre a couple, im assuming both will drive the new car) getting a new car for free and all he can do is complain? He should be excited at least a little, or at least happy for her.\n\nHes definitely insecure. \n\nAnd to keep it really real, if he wants her to start going to him for this stuff them he needs to ACT LIKE A DADDY. Not like her dad, like a Daddy. She doesnt see him that way or go to him for those things because thats not the energy he's putting off. You cant just say it: \"come to me for stuff like that\" - you need to show her youre capable of filling that role.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Seriously. I wish my dad or either parent had done well in life and helped me along the way! Especially considering how many people are struggling these days! \n\nI get that he wants to feel like \"the man\" and provide (which is toxic that men don't feel like men unless they and only they are providing) but there's someone in their life that will never let them go without. I say enjoy it and appreciate it!",
          "id": 88,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3787,
      "content": "YTA. You need marriage counselling. To deal with both your issues. This is a great way to lose your marriage otherwise. \n\nDeal with your issues instead of hurting your wife. You show nothing but mild contempt for your wife here",
      "id": 89,
      "comments": [
        {
          "score": 1339,
          "content": "OP has been building resentment for 10 YEARS, over a dynamic he knew existed since the very beginning. It was never addressed, yet he's surprised it has remained the same. If this was a deal breaker for him, he needed to discuss it *before* they got married to see if they could work through it.\n\nWhen my now-husband and I started dating, I kept an eye on an empty energy drink can at his place. It was there for some time before I finally disposed of it. He wasn't really dirty, but he had a tendency to almost be blind to certain things (suspected adhd). I didn't track it to judge him. I wanted to know what I should expect so I could talk with him and see if he was open to improving something I knew could become a problem. I didn't want to clean up after him forever and eventually watch my resentment boil over. Turns out, he wanted to do better, and gladly learned whatever I showed him.\n\nSO MANY PROBLEMS CAN BE FIXED BY COMMUNICATING. If it ends up being something the other person can't -or won't- fix, then it's on you to decide if it's a deal breaker. Resentment erodes the foundation of a relationship, until it eventually crumbles. Couples counseling could make a massive difference.",
          "id": 90,
          "comments": [
            {
              "score": 150,
              "content": "Absolutely right! That’s exactly the dynamic I see here. Built up resentment and communication comes from a place of blame not a place of understanding.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yes! Fellow Adhd here and leave stuff around all the time. Didn’t realize it until wifey (then girlfriend) sat me down and talked about it. I didn’t even know I did that. Communication is key, especially with us Adhd folk.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "> OP has been building resentment for 10 YEARS, over a dynamic he knew existed since the very beginning. It was never addressed, yet he's surprised it has remained the same. If this was a deal breaker for him, he needed to discuss it before they got married to see if they could work through it.\n\nhonestly the computer thing is low key scary \n\nimagine that you've just started to date someone and you resent that they asked their parent for input on a personal purchase instead of asking you\n\nlike that's wild. it's her computer, her money, and he wants her either to rely entirely on him or not have support at all. they're not married and they're not even engaged and they don't have joint finances and he still expects that if anyone has any influence on how she spends her own money it should be him. that's so controlling\n\nand then he still resents her for that *a decade later*\n\nI don't know how much it is his desire to control her, and how much it is that he's simply jealous that she has a supportive family and one who can financially help her out, but either way this is not fucking good\n\nI'm not sure how this is an issue for couples counseling, and how much it is that OP needs personal therapy. communication can help, but he clearly has underlying issues here",
              "id": 93,
              "comments": [
                {
                  "score": 3,
                  "content": "[deleted]",
                  "id": 94,
                  "comments": [
                    {
                      "score": 3,
                      "content": "> He could focus on being and doing all the things for her that her dad can’t, but he’s rather be in competition with her ONLY living parent. \n\nI'm not sure the issue actually is the dad. he complains that she goes to her father first and foremost even if he can help. but the only example he has of that is when they had *just* started dating\n\nshe went to her husband about the car first. she only went to dad when husband shut her down\n\nshe and husband worked on finding a home together first, she only got her father's opinion after they had narrowed it down to final options\n\nand all the things he insults her with have to do with wealth, and most of the post is about money\n\nthe thing with the car especially seemed like he was angry that she didn't \"grow up\", get a taste of the \"real world\", and have to do without. he was furious that she simply side stepped arguing with him and got the car in a way he had no say over and no ability to control. he can't control how her father spends the money so he attacks their relationship and tries to make her feel guilty for wasting her father's money\n\nlike this seems very much about money and wealth and resenting her for her privilege, and that she doesn't have to do without, or struggle\n\nI don't even think her father dying would solve the problem, unless his daughter doesn't inherit anything",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "That ADHD thing resonates so much for me. I can walk by the same paper clip on the floor for weeks on end without the need to pick it up, but if someone commented about it, I’d probably pick it up in that moment.\n\nYou bet your ass I would finally need that paper clip the next day and not be able to find it anymore too.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 337,
          "content": "Also wife doesn’t have an issue here. She has a supportive father.",
          "id": 97,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 141,
          "content": "Marriage counseling won't fix this and would shine a bright light on his issues to their wife, without holding him accountable to go fix his shit. OP needs his own counseling, at least until he can own that he's uncomfortable about totally normal *positive* things in their wife's life.\n\nIt is really hard to process that what you came from was shitty, and shouldn't have happened. But he's gonna have to if he wants his situation to improve. Because right now he's taking supportive, beneficial, healthy behavior, and getting angry about it, instead of thankful.\n\nIe: Seeing his wife and father in law exercise supportive behavior is attacking his sense of self. Marriage counseling will double down on this, put the onus on his wife to accommodate his feelings/backlash, and not hold him fully responsible for processing that those feelings come from a place of unhealed hurt.\n\nYou gotta have two people actively trying to own their own shit in order for couples counseling to work. This ain't it.",
          "id": 98,
          "comments": [
            {
              "score": 7,
              "content": "They could do both.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "What issue does the wife have? Valuing her dads opinion?",
          "id": 100,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "I don't think marriage counseling is the top priority... OP needs therapy to resolve his feelings over his own parents and how they treated him. \n\nHe's resentful because his parents don't care for him in the same way his wife's father does. He may have grown up in poverty, but the bigger issue is that his parents don't provide the same kind of loving emotional support and guidance. Yes the financial aspect is a factor, but I think the root is resentment over the close relationship they have, that OP hasn't experienced from a caregiver.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2476,
      "content": "YTA\n\nIt sounds like you want her to take your advice on everything and not her dads.  It might be that she grew up not wanting for anything and seemingly still doesn't but you have been with her for a long time so its not as though you haven't been aware of it.\n\nIf he is willing to fund stuff then just enjoy it as most people would be quite happy with someone buying them a new car.",
      "id": 102,
      "comments": [
        {
          "score": 819,
          "content": "Yes, I was going to say most people would be thrilled if their partner had a rich parent who did stuff like that. The money from the old car can go into a college fund. \n\nI think he has \"some\" legitimate gripe about her allegedly  letting the dad impact her opinion on the house, but I honestly don't get why he's annoyed about the other stuff.",
          "id": 103,
          "comments": [
            {
              "score": 592,
              "content": "He also only really has a legitimate gripe if the dad's advice was bad. If the house is overpriced for it's value, that's a pretty good reason not to buy it.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Seems to me like he wants to be her dad, or at least the person in charge of her. I don't even think this guy sees her as a person or at least another adult. Just someone he feels entitled to have and lord over. And what bigger threat to that than a caring parent? No wonder he hates her father. What a major AH.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Also maybe her dad is a smart guy and his advice is is helpful? Sounds like OP has a chip on his shoulder",
          "id": 106,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "I feel like it’s the whole “manly” mentality. He wants his wife to need him now, not her dad. But like idk man, sounds like her dad is helping both of them.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This.  OP What do you want? What’s your goal? To not have him pay for things? To be included in conversations? If her dad is willing to continue to fund her life great, he’s funding yours too.  That said this isn’t new.  She’s not a spoiled brat, she’s living the lifestyle she can afford.  Is there jealousy or resentment on your end? If it’s a matter of your combined budget literally can’t afford more then talk about it.  But if she doesn’t want that house for whatever reason, then you don’t buy it.\n\nI do thin you need to realize you chose to marry this person and this is who she is. Calling her names isn’t going to change who you wanted to be married to, and if that’s a problem then just divorce.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1388,
      "content": "YTA. You got mad she asked her dad what kind of laptop to get? Ridiculous. Just because you got married doesn’t mean her dad isn’t part of her life anymore. I agree financial decisions should be made together. She wanted the car, you said no. There was no compromise on your part at all, no conversation just a no we don’t need it, so I see why she went to her dad. Now you have a new safe car that you didn’t have to pay for, plus extra cash from the sold car. Sounds like you might be jealous. \n\nRegarding the house, parents typically bring the reality to situations. Maybe she liked house A and was excited but couldn’t see the reality so her dads job was to make her see maybe it’s not worth the money. That maybe you could get a more move in ready home, or one with a better yard, or extra bathroom. It doesn’t mean she doesn’t love it anymore, just that maybe there’s something better for the budget you have. She wasn’t asking her dad for money or trying to get you to spend more, she was just listening to his advice. Her dad isn’t going anywhere, and just because you grew up differently doesn’t mean she’s a horrible a person just because her dad buys her things and she trusts his opinions. You were together for 5 years when you married, you knew who she was. Edit to add- my opinion would be the same if the roles were reversed.",
      "id": 109,
      "comments": [
        {
          "score": 931,
          "content": "He’s mad she got a free car because it was never about the money, it was about control",
          "id": 110,
          "comments": [
            {
              "score": 772,
              "content": "He said no and felt that's the end of it. No discussion or compromise, just \"no\", and that's final.\n\nHe doesn't like that she has external means of getting what she wnat/need which he can't steamroller over.\n\nIronically, he's acting exactly like a 1950s authoritarian father.",
              "id": 111,
              "comments": [
                {
                  "score": 367,
                  "content": "Yup, she said she needed a new car. He said no she doesn’t. That’s not a discussion. He didn’t seem to take his wife opinion into consideration at all about that. Just thinks that he knew better than her and she couldn’t possibly be right about that. \n\nSo she went to her dad to ask for advice or help. Dad said they could sell her current one and get some money from that and he would cover difference for the new car. No loan or anything that financially impacted their life as a couple.\n\nAnd OP STILL being salty about her asking her dad for advice on a new laptop as opposed to the guy she had just started dating. That’s just petty. It was 10 YEARS AGO! Get over it OP",
                  "id": 112,
                  "comments": [
                    {
                      "score": 76,
                      "content": ">Dad said they could sell her current one and get some money from that and he would cover difference for the new car\n\nDad bought the car, and selling her old car was just extra money (according to OP).",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Tbh it sounds like he's got a belief that you need to live within your means and learn to budget, and he's frustrated that she, actually, doesn't need to learn these things. I think that's the source of irritation - to him it feels like being irresponsible, even though its not.\n\nPlus, yeah, the 'need' to make her see that his way is right, lol - the blindness to his unnecessary rigidity. Probably through pride and shame about not being able to afford everything, and his way being 'the only way through' / 'what sensible people do', etc etc\n\nWhen really he just wasn't that fortunate 🤷🏼‍♀️",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "And, like, it's one thing to be a NO vote on *buying a car* but it's entirely different to be a NO vote on a FREE CAR from dad. Like what is even the issue here??",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 152,
              "content": "Yeah, that's the vibe I'm getting here. He sounds resentful of and condescending about his wife; it doesn't even seem like he likes her all that much. I could understand the frustration if Dad was offering his opinions unsolicited, or if he was loaning the wife money for a car, but that's not what happened. The wife is actively seeking out his advice, and he literally just gave them a free car. I think OP is insecure about his own earnings and frustrated that he can't control his wife/rule the roost with regard to their major life decisions.",
              "id": 116,
              "comments": [
                {
                  "score": 6,
                  "content": "YES \n\nHe’s just mad when his wife disagrees with him. She’s her own person with her own opinions! She doesn’t have to always agree! And he doesn’t like that she has a source of support that isn’t him, so she’s able to maintain that independence. He just wants to be in charge",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "This right here. 3 examples in 10 years, and all 3 are about OP \"losing control\" over his wife. I'm just glad the wife has someone outside the marriage to lean on.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "EXACTLY!! He's mad because he has no control over her!",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Not for rich families. For some families the price of that car is immaterial, they wouldn’t even register that it COULD be used to exert control. Now YOUR parents would use that as control, but given OPs lack of a single complaint about demands from the FIL, they are not using it for control. They simply have money and are helping.\n\nOtherwise he wouldn’t have listed 3 instances that hurt his feelings because his wife valued her father’s opinion over his… he would have listed the unreasonable sacrifices, compromises, and demands he was being subjected to.",
              "id": 120,
              "comments": [
                {
                  "score": 5,
                  "content": "Very true, if you’re earning 500k+ per year and have been for 25+ years, the cost of a $50k car is probably a rounding error on his finances. \n\nThe reality is: OPs wife probably asks dad for “advice” because she knows it will result in dad buying said item for her. And I don’t mean that negativity- her mom died, maybe they both benefit emotionally from this interaction (dad feels like he is taking care of his daughter who lost her mom and daughter fella like her dad is always looking out for her)",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Thank you for this. It’s exactly what I wanted to say, I’m just too tired.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Exactly. If you keep shutting down her requests, she’s going to stop going to you for support.\n\nAlso, if her dad is financially well off, you should be looking to him for advice. People (usually) don’t get rich my making stupid financial decision.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "He didn’t even say we don’t need it. He said she does not need it. Since when should he dictate what presents she can and cannot accept…",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I really wish my parents had shared some advice before buying a house.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1310,
      "content": "NTA,  if the rolls had be reserved and this was man who ran to mummy all the time, it wouldnt be single Y-T-A here.\n\nYes, being mean to you wife isnt nice, but this has been boiling for a while,  you are married to her  dad's opinion .  IF you want to keep this marriage, you need counselling.",
      "id": 126,
      "comments": [
        {
          "score": 568,
          "content": "Finally, common sense!!! Are all these redditors 15?",
          "id": 127,
          "comments": [
            {
              "score": 686,
              "content": "Nope, 50.  And life experience tells me that a caring dad likely does have been experience than a 22 year old jealous and bitter dude who resorts to name calling when his ego is a bit bruised.  \n\nMy husband would be ECSTATIC if my dad was still alive and helping us out.  I value my husbands opinion but it also got that way because HE valued my dads opinion.",
              "id": 128,
              "comments": [
                {
                  "score": 417,
                  "content": "I don’t agree either. I’ve had an ex girlfriend that always went to her mom on everything. It’s exhausting to have a conversation and agree on something only for her to go to her mom and make a different decision after talking with her even if it’s objectively wrong. \n\nIt’s not about getting support if they need it perhaps it’s about having a married relationship and feeling like they are both in this together, not them and her dad in the relationship too.\n\nIt’s all about communication, if they both agree on something and then everything changes because daddy’s girl now has different advice, this can’t be healthy. You need to grow up at some point and live your own life and not be dependent on someone else. \n\nGetting advice from someone more experienced can be good, but it seems from his story that it’s typically just about money like getting a new car when you don’t need it.\n\nEdit: okay this last one is kind of funny but frustrating at the same time. I’m re-living all the reasons why we broke up now. Sometimes I would give her advice but she would still go to her mom and get the same advice and give her mom the credit for the advice.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 161,
                      "content": "Exactly, so many of these comments are ridiculous.\n\nOPs relationship has 3 people in it: OP, his GF, and his GF's dad.\n\nIf I constantly asked my friend for advice every single time me and my GF had to make a decision - whether minor or major - I wouldn't have a GF for long.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "The gripe wasnt that dad was _wrong_. OP never disclosed that Dad gave bad advice.",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Literally I had a friend of some friends who were trying to organise stuff with her and she went to her mum FOR EVERYTHING! Like even accommodation when going on holiday, then she said it was over priced (it wasn’t) and then she secretly asked to stay with someone else so she didn’t have to pay (put said someone in a really tight spot). \n\nAlso everyone wants to be appreciated for the expertise they have, OP said tech/laptops were his and she still went to her dad rather than OP. I can completely see why he would be hurt and why it would feel like she’s being codependent on her dad. I just don’t see why they got married tbh 🤷‍♀️",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I agree with everything you said.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 170,
                  "content": "22? Did you read the post? They are in their thirties",
                  "id": 134,
                  "comments": [
                    {
                      "score": 144,
                      "content": "He was 25 during the laptop incident that he was so mad about that he's held onto it for TEN YEARS.",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "Right! Dood is 35!",
                      "id": 136,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "They started dating in their 20s. The laptop issue was when they were in their 20s since OP said it started when they were dating early on.\n\nSo, while not in their 20s now, OP was pissed early on in the relationship yet still stayed. He held resentment over a laptop for a decade. op clearly has issues.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 83,
                  "content": "Life experience tells me that a caring dad likely believes the real estate market still works the way it did in 1998, and OP is not 22.\n\nOP's wife needs to learn to trust her own opinion and not shape it based on the whims of her father.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 24,
                      "content": "But OP isn’t telling her to trust her own opinion. He’s telling her to only trust *his opinion*. And who better to trust than a man that calls you names when he’s unhappy, right? /s",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "My partner and I have never bought a house before. My dads bought 3 houses and a condo in his life, I would definitely ask for my dads opinion!",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The fact that the vast majority of people completely disagree with you means that this particular opinion you hold is -- *by definition* -- NOT common sense. \n\nYour opinion is in fact quite uncommon and according to the context presented here, it's uncommon because it's neither sensible nor right. \n\nCalling a clearly, vastly unpopular opinion \"common sense\" because you personally happen to agree with it is probably the most clear-cut, textbook example of confirmation bias I have ever seen lol",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "No, but most of them are women, and a lot of them are children. So anyone who suggests that it isn't normal for a mid 30yr old  to still be attached to her daddies apron strings gets crushed.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "Nah this take is a desperate attempt to say “if roles were reversed”. In the cases where roles are reversed it is always about the physical presence of the mom, its always about her forcing her way into things and crossing boundaries. There has never been a reverse post of this where the mom isnt trying to force her physically presence on the couple. There has never been a reverse post where the wife is upset his mom just gives him money but otherwise leaves them alone. The posts are about her being upset at things like mom wanting to move in or be apart of personal couple trips. Its just delusional to say “if roles were reversed” cause the reversal is a completely different problem. Ill say it again, there has never been a post about a wife mad her hubbys mom gives them moneyx The fact youre trying to turn this into a sexist thing when its not is well, sexist. You were so desperate to shift blame by pointing out if roles reversed that you forgot to use common sense and realize that the reverse is in fact is not what you want it to be. Youre so desperate to blame women you have to twist reality and make up bullshit just to fit your narrative. Well thank you for showing us all your sexist nature and inability to use common sense. Apples = oranges to you, get your damn head on straight.",
          "id": 143,
          "comments": [
            {
              "score": 65,
              "content": "People love to see a story where a woman has done nothing wrong, invent new characters and storylines and then use it as a way to blame women lmao",
              "id": 144,
              "comments": [
                {
                  "score": 28,
                  "content": "100%. And then still complain that this sub is misandrist.",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Hahah factsssss",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Similar vibe to how any time there's a post about what shirt or bra a woman is or isn't wearing and so many guys are like \"But what if I walked around with my dick out??? That's the same thing????? Misandryyyyy\". Actually when you change enough details it's a different situation that deserves a different judgment.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I mean, she didn’t grow up with a mother, so the bond she has with her father has to be incredible. OP is jealous and angry that she turned out okay even though she “didn’t have to work for it”, while he grew up poor. It’s a wonder they ever got together in the first place.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 102,
          "content": "A few days later we will see this exact same post with the roles reversed and it will be interesting to see what redditors say.",
          "id": 149,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 69,
          "content": "If a guy went to ask for a car to her mom, and I was the wife, I wouldn’t care.",
          "id": 150,
          "comments": [
            {
              "score": 50,
              "content": "Exactly. This whole \"but reverse the genders!\" Is bs. I would still say YTA If it was a woman freaking out over a mom gifting a car and laptop to her son. \n\nI would be happy if my boyfriend had a family that bought him a car and laptop. Its not my money, why should I have a say In it?\n\nLike I really don't get what people want here. They want the wife to only listen to OP instead? That's even more messed up.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Nah man. Because the things she's asking her father about are *super* normal things for a child and parent, who have a great relationship and happen to be wealthy, to talk about.  \n\nIt's not as if she's being waited on hand-and-foot by an overbearing father who comes over everytime she has the sniffles, to live with them for weeks and make her chicken soup. He's not shooting down decisions her husband has made, just for some kind of power trip. He's wanting to help with major life purchases and giving advice *that was asked for* about large life decisions. \n\nIt's about scope. It's not boolean true/false \"father is or isn't involved and therefore involvement = overbearing\".  She wants advice from her father, who is her *only parent*, by the way. Asking her to never take his advice, especially in big moments, where she's going to want family support, is so dismissive of her. \n\nI shouldn't have to add that my father died when I was little, and my well-off mother played both roles. My brother and I did occasionally go to her for advice. If we didn't, we'd be without family, without parental advice, and that's lonely and isolating. Sometimes she helped in making huge decisions she didn't contribute to financially, sometimes she insisted on pitching in and helping us out. And letting her was letting her help support her kids, so they could \"pay it forward\" and give the next generation a leg up. It's like, having a parent, or something.\n\nPerspective, folks.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "No I wouldn't? These days men need support too. Buying a car and house is a difficult decision. It's smart to ask your parents for advice. \n\nIf my boyfriends parents were rich and bought us things, I would be thrilled! As long as they dont dictate everything (OPs dad isnt) then it's fine.\n\nPeople call men \"mommy's boy\" when they don't clean up after themselves and care more about their moms feelings than their wives. The car and laptop is not OPs decision to make. It's her and her father's since he's buying it for her. It's not a shared car. They arent using shared expenses. I don't see why OP cares about this at all.\n\nAs for the house, she just asked for advice.. it would be stupid to not ask your parents for advice. And if they can find a better place for their budget, then the dads right and OPs wife was the smart one.\n\nThe fact that OP could only bring up 3 examples, one involved a laptop that was 10 years ago.. all this shows me is that while yes, she's spoiled, she still respects her father.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "He's still feeling petty about a laptop she bought A DECADE AGO. Y'all just love crying about made up reversed genders scenarios.",
          "id": 154,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Eh.... While I see what you're saying, I do think this one is a little bit different. If a man was an only child with a dead father, I would fully expect that his relationship with his mother is rock solid and that she would be more of a fixture in our lives. I also think that the examples that OP is citing, until he got to the house, have practically nothing to do with him. She asked her dad for advice on what laptop to buy 10 years ago. If my SO asked his mom on her opinion for what kind of garbage can he should get in his office, no well adjusted person would be bothered. \n\nI think the scenario we see on reddit a lot is mothers criticizing them or trying to get them to do things differently. I'm not sure if I see that here. I just see a dad giving his daughter a car for free when her partner didn't think she needed one. Now if the FIL was saying that OP is a bad husband for not getting her a car, then I'd agree that he's N T A. But it feels like among these 3 people, only 1 of them has any tension with anyone else.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "If their rolls switched they'd still be the AH though like?? OP doesn't own his wife. She's allowed to go to her father for advice. It was HER car what's the problem with her selling it and purchasing a new one? He is upset that she asked her dad for an opinion on a laptop like ???",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I don’t understand how he can be NTA for you, at least this is a ESH situation.\nHaving a father in law permanently (and we actually don’t know if he does this all the time) expressing an opinion on your projects as a couple sucks and I see how he can be frustrated but complaining about the fact that a father decided to gift a car to her daughter makes him the biggest asshole on earth, which is a jealous asshole",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 716,
      "content": "Lmao. If the roles were reversed people would call the husband a mommas boy.",
      "id": 158,
      "comments": [
        {
          "score": 380,
          "content": "Hardly.  A father giving advice on cars is NOT the same as having to open the door for a grown man’s mother to bring him soup when he’s sick.",
          "id": 159,
          "comments": [
            {
              "score": 292,
              "content": "There was no advice. She wanted a new shiny because the old pen wasn’t shiny anymore. OP reasonably said that this is a dumb move because the old car was just fine plus she barely drove it.  She didn’t like that and rant to daddy to buy her a new car. It is almost the definition of being spoiled.",
              "id": 160,
              "comments": [
                {
                  "score": 147,
                  "content": "Think you read it wrong , she didn’t ask ops advice on the vehicle bcz it wasn’t going to be an expense they took on. It was her want and Her father was going to get her what she wanted. ( honestly think op feels inadequate bcz he can’t do the same if he had the means and it caused no hardship pretty sure he’d say “sure hun, let’s go look for a new car for you ,without a second thought) \nCan op take the extra vehicle and benefit from the sale ? Yes, wife’s father double gifted them and they came out on the upside.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 125,
                      "content": "You are correct, I find everyone’s Hangup on the car thing so so weird. Must be jealousy based. So what she got a car she didn’t need? Again, it didn’t hurt them for her to obtain it. Life is too short, if you want the new shiny thing, and can afford to get it (whether through you or your parent) just get it. Trust me. They even profited off it!!! It’s such a non issue it’s ridiculous.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "She wants a new car and her father will give on to her, her spouse says no .... because she \"doesn't need a new one.\"\n\nSo yes she's spoiled but which would you choose? Free new car or keep old one you don't want?",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Wut. It’s a dumb move _unless_ someone else is paying for it. OP should’ve said “ask your dad” right away lol. \n\nThis situation gives OP so much wiggle room w finances he just can’t see it.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "But why would OP get the last word on that subject? The way your wording this makes him sound like her parent who tells her what decisions are best and what she should do. They're married, but they're both independent adults. It doesn't make sense to be mad that your wife decided she still wanted a new car even if you disagree because it doesn't affect you.",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "Thats 100% what happens in this sub.",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 91,
              "content": "This sub is wild today. 100% they’d be calling him a momma’s boy for running to your mom for a shiny new toy because his wife said it was a bad financial idea.",
              "id": 167,
              "comments": [
                {
                  "score": 73,
                  "content": "The amount of people calling OP an asshole who also post in r/justnomil is ironic and delicious.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 25,
                      "content": "It’s blowing my mind, because I know beyond a shadow of a doubt that these are people who have operated under the “two yeses, one no“ for financial decisions in the relationships before. And yet somehow that’s not right for OP?",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "How is receiving a car as a gift then selling the car you own for extra money a \"bad financial idea\". They ended up with a better car and more money towards them",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "> it was a bad financial idea.\n\nBecause it's NOT a bad financial decision. They end up with a new car AND the cash from selling the old one.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Her dad literally bought her a 2022 car at 37 and she didn’t even consult OP first. That’s just a sick move",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "bruh if my mil wants to buy my husband a car she can knock herself out. that would be awesome.",
          "id": 173,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Yup, there are entire subreddits for women dealing with men running to their moms for everything.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 592,
      "content": "NTA and I cannot fathom all the Y T A's.  She's married to you, things should be discussed between you two.  She doesn't get the answer so she runs to daddy to get what she wants.\n\nJust start doing the same in respect of opinions about things, ah well I spoke to my parents and they think this so we're not going to do that anymore.  Or I spoke to my parents and they think I should spend my money on this so that's what I'm going to do. Sometimes people need a mirror reflected on them.\n\nShe clearly does not respect you, your opinion or your marriage.\n\nI would suggest marriage counselling to work through both your issues.\n\nETA if you want to have kids with her you need to get this sorted out now.",
      "id": 175,
      "comments": [
        {
          "score": 316,
          "content": "He has 3 examples over 10 years, one of which was advice on a laptop.\n\nIs your solution that the daughter never ask her widowed single father for advice, who by all accounts seems to be emotionally and financially available to her and also the only parent she’s ever known?\n\nNGL, feel sorry for you if marriage meant your parents suddenly weren’t a resource for you anymore and their opinions suddenly became disregarded.",
          "id": 176,
          "comments": [
            {
              "score": 257,
              "content": "he brought up 3 examples. why would you think that is an exclusive list?",
              "id": 177,
              "comments": [
                {
                  "score": 105,
                  "content": "Maybe he should list more then, because those 3 examples don't make her sound like a brat. Spoiled? Yes. But a brat? No.\n\nPeople are judging based on the info OP Gave. Meanwhile you guys are judging based on what ifs.",
                  "id": 178,
                  "comments": [
                    {
                      "score": 106,
                      "content": "He brought up 3 examples - 2 of which were about a car and a HOUSE. The car is kinda whatever, but the house is a huge fricking deal. I can’t imagine my partner’s parents doing anything other than offer an opinion about a house that we’re trying to buy. \n\nIt’s also clear that OP doesn’t understand what his problem is. Maybe I’m way off base but this reads to me as resentment that his wife doesn’t look to him for support AND circumvents important decisions with her father. It’s not her being spoiled, it’s a lack of respect. A house purchase is a spouse purchase, not a ‘my daddy will make our decision for us.’\n\nI imagine so many decisions have been handled this way over the years and now it’s impacting EVERYTHING because this dude probably doesn’t feel like he has any say over anything he wants to do. \n\nESH - OP needs to have a very serious conversation with his wife. The wife needs to listen and the dad needs to butt out of their marriage.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Lmao ok sorry ms arbiter of lists, what is the acceptable number of examples? And how many is too many? How long must each example be?",
                      "id": 180,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Garbage. 3 examples seems to be plenty for people to judge on other topics",
                      "id": 181,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 117,
              "content": "did you seriously expect OP to list 10 years worth of examples? he mentioned the first one, and some of the most important expenses.\n\nnot even op said he expects that. but he expects her to make responsible financial choices, and to be included in the decision making when the family is affected. buying a new car when there's nothing wrong with the old one is not responsible. her overriding decisions they made together because her dad disagreed is too much.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "The problem isnt that shes asking her father for advice, its that her father’s opinions are overruling and making her own opinions completely irrelevant.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "One thing is an opinion and another is getting a new car for free.",
              "id": 184,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Some you lack reading comprehension skills. He gave the laptop example from 10 years ago to set the stage. Said that  things like that have happened consistently since then but he's ignored it. The car stuff happened last year and now the house stuff is happening",
              "id": 185,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Exactly how many examples would you require to consider his concerns/issue valid, 4, 5, 17?\n\nAlso I suspect the reason he is giving an example from 10 years ago is to demonstrate a persistent pattern of behaviour from the beginning of their relationship rather than him dwelling on it. Most stories start at the beginning.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "\"anytime she wants or needs something\" implies it's more than 3 times in the last decade though, just showing examples on 1) something he might know more about 2) big joint purchase (before the dad paid for it) and 3) an even bigger joint purchase that she changed her mind about because of her dad's opinion? He was a bit harsh in his wording sure but NTA",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">who by all accounts seems to be emotionally and financially available to her\n\nsounds like a good candidate to be her second husband",
              "id": 188,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": ">NTA and I cannot fathom all the Y T A's.  She's married to you, things should be discussed between you two.  She doesn't get the answer so she runs to daddy to get what she wants.\n\nYes, obviously. Because she brought up the issue of wanting a new car and OP just said \"no\". That's not a compromise, that's just him overruling his wife. If her dad has more than enough money and does not mind, there's literally no reason for her not to go to her dad if she really wants the damn car. Is it a bit shallow? Yes. I'd never buy a new car just bc I want one. But OP sounds like he's insecure and thinks that his opinion should be higher than his wife's opinions/wishes and certainly her dad's.",
          "id": 189,
          "comments": [
            {
              "score": 68,
              "content": "Are you married? If my wife wanted us to spend $30+ k on something we didn’t need I would also be resistant.  That’s our finances and irresponsible spending.  OP’s wife was able to circumvent that by asking her father for a free car, but aside of that there may have been no room to “compromise.”\n\nYou also don’t see the issue in her father overriding and interfering with extremely significant and personal decisions like buying a house? This is a huge red flag and is a big overreach.",
              "id": 190,
              "comments": [
                {
                  "score": 53,
                  "content": "So, no expenses happened, they actually they gained money ... and he still objects because it was not about money.\n\nAs far as houses, in my world multiple people normally express opinions about this or that. Sometimes they have good arguments. If dad had good arguments, it is reasonable to listen.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Wait like let me get this straight, you think it's okay for the husband to still say no to a situation that no longer involves him, because he already said no? Like he was valid in his saying no, sure. But after he said no, his wife is free to still be her own person and well, get stuff from her father.\n\nLike why does the husband get to just say no, and that's that? Why is she not free to gain her own money (by getting it from her father) and do it that way? \n\nIf my in-laws gave my husband a free car, I am grateful, not angry.  And more grateful that I'm keeping the money from selling my old car! \n\nHusbands don't get to say some final No, and that's the end of the topic. Dads are always allowed to give advice to their children. It doesn't even sound like the dad is interfering at all, it just sounds like she respects his opinion highly. \n\nI have conversations like that with my FIL, All the time where my husband and I will agree on a thing, but then FIL says some wise thing that makes me rethink my position, and it changes my mind. It doesn't mean I'm listening to him \"more than my husband\", it means I took other opinions into account.\n\nDads can be wise and have experience. And it sounds like wife will do just fine if mr insecure husband decides he'd rather financially control someone else.",
                  "id": 192,
                  "comments": [
                    {
                      "score": 3,
                      "content": "On your first point, no I’m not saying that (and I don’t think anybody is).  \n\nOn your advice point, advice is one thing. When the fatherly advice effectively controls one half of the marriage partnership (that’s how it’s painted here, we have no other facts to go by), then it is effectively controlling the financial decisions of the partnership.",
                      "id": 193,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Except she wasn’t spending 30k on something. Her father was buying the car. That wouldn’t be their expense. They weren’t paying for anything.",
                  "id": 194,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "If it was shared expenses, then that would be different. But it's not. The father is bought the car. op didn't have to pay a penny.",
                  "id": 195,
                  "comments": [
                    {
                      "score": 17,
                      "content": "We're also not hearing about all the times OP likely benefitted from the money. Did dad help with their wedding, take them on a family trip or pay when they go out for family meals? Probably. If dad just throws money at his daughter all willy nilly, op has definitely been hit by financial spatter at some point.",
                      "id": 196,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "She got a free car, a free laptop and probably a deposit on a lovely house because she asked his ‘opinion’.  She’s not stupid, she knows if she asks her dads advice then he buys her whatever she wants, tbh I’m not sure why OP is so upset.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "1st. The laptop happened before they were married. The car I'm not sure about. But since her father was buying it, I fail to see how OP should have a say in it. \n\nAs for the house, she went to him for advice. You know, a smart thing to do when making the biggest purchase of your life..",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I'm honestly not used to having the unpopular opinion on these things because they're usually quite obvious.\n\nI can see where the opinions that the husband is petty and jealous are coming from but there are legitimately plenty of relationships out there where the spouse feels like second fiddle to a parent.\n\nWhen my wife and I were house shopping, we valued her parents opinion a great deal. Seriously we listened to it all. Sometimes too much. But then we regrouped and discussed it just the two of us and made decisions together. I see none of that in this post happening.\n\nThe car situation is a little murky. But I can completely get feeling frustrated that her Dad just always seems to have an out for her instead of relying on their own financial abilities. If that convo had been more along the lines of... You're right, this doesn't make sense financially, however, my Dad is totally cool with buying it, maybe the convo goes differently. Sounds like instead, they talked over the practicality, he thought they came to a decision, she came back and made the choice anyways. I could be wrong, but I can see why that feels powerless and frustrating, even if the end result was fine.\n\nThese two people just flat out aren't on the same page, and this wife possibly does value her father's input in life decisions more than her husband, and I think that's a problem. The computer scenario is obviously a nothing burger, but if this is a pattern of behavior, I again can understand why a husband would feel a little slighted to not be the resource she went to first.\n\nEnd of the day, I'm just gonna say NTA. But there's not enough context for me to fully form my opinion. The house one, though, to me is extremely frustrating. Because it sounds like OP is not having his voice heard on the largest family decision they've made to date, because of a convo with her father that he wasn't a part of.",
          "id": 199,
          "comments": [
            {
              "score": 4,
              "content": ">>When my wife and I were house shopping, ... But then we regrouped and discussed it just the two of us and made decisions together. I see none of that in this post happening.\n\nThat is literally what OP says happened. She got advice from her dad and no longer liked the house. Maybe her dad pointed out some expensive problems. Maybe there was something she fully overlooked the first time. But suddenly on this area people are dropping their “if it’s not two yes’s it’s a no” discourse. \n\n> they talked over the practicality, he thought they came to a decision, she came back and made the choice anyways. I could be wrong, but I can see why that feels powerless and frustrating, even if the end result was fine.\n\nWhy does she need his approval for a gift from her dad? It has literally no financial impact other than them gaining financial freedom by being able to sell her old car.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yea…..it’s crazy the amount of people who are siding with the wife( I am going to assume they are not married or are spoiled brats themselves). It’s not just about her asking her dad for advice, her dad seems to be making all financial suggestions AND final decisions within their marriage .",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This needs to be the top comment. Exactly like you said, OP’s wife doesn’t respect him or his opinion. She runs to daddy to get what she wants and doesn’t seem to value the importance of making decisions together as a married couple. She is a spoiled brat and needed to hear the brutal truth. People won’t change their behavior until you call them out and start holding them accountable for it.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 316,
      "content": "Yeah, but you have been with her 10 years? You have had plenty of time to talk about this or get out, you've put up with her ways for 10 years so you must be okay with her.",
      "id": 203,
      "comments": [
        {
          "score": 84,
          "content": "I'm also thinking OP has benefited plenty from his wife's generous dad, but for some reason this material things that primarily benefit her and/or negate OP's \"expertise\" irk him enough to complain here.\n\nI'm laughing that he's bringing up a laptop from 10 years ago and that he's complaining about a \"2022\" car. If she's so spoiled, why isn't she getting a brand new 2023 car? \n\nAdditionally, when buying a house, it's a good idea to ask the advice of people who have gone through the process before, like (I'm assuming) OP's FIL, since they might be able to see pitfalls or issues that someone blinded by curb appeal might miss.\n\nHonestly, this all sounds like an ego thing for OP since none of his FIL's gifts are hurting him or his marriage, only hurting OP's pride for some reason.",
          "id": 204,
          "comments": [
            {
              "score": 15,
              "content": "> \"2022\" car. If she's so spoiled, why isn't she getting a brand new 2023 car?\n\nBecause the father \"spoiling\" his daughter here is a clever man. The house is a clue, \"better for your budget\", not, \"better because here's a load of money.\" I'd bet he bought a nearly new car so they didn't suffer the depreciation or any of the teething problems. It sounds like Dad has common sense.  \n\nOP is TA, so is his wife (for a few days of not talking, and for over involving her Dad for years it seems), Dad is NTA.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 280,
      "content": "[removed]",
      "id": 206,
      "comments": [
        {
          "score": 202,
          "content": "It’s not just valuing her dad’s opinion over her husband’s. It’s valuing his opinion over her own. Can’t she make a single big decision on her own?",
          "id": 207,
          "comments": [
            {
              "score": 272,
              "content": "My dad died a few years ago and I 100% valued his opinion while he was alive.  Am I surviving now that he’s gone? Sure. No problem.  But it’s always nice to have people who have life experience to chime in.",
              "id": 208,
              "comments": [
                {
                  "score": 11,
                  "content": "I’m so sorry for your loss",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I’m sorry. Same here. Dad died five years ago. \n\nI always had respected my dad’s opinion and learned a lot. \n\nHe built our house while having a different job (tailor). Taught me how to build and sew. He taught me about money. He paid for my college (state school/branch/commute) and let me live rent free, but I had to save.\n\n(Never bought me a car though. I was a wild child. He wasn’t stupid. Lol)\n\nMaybe I was a daddy’s girl and spoiled. \n\nOr maybe he just set me up for success.\n\nI guess it depends on what everyone’s experience with their dad was.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "What if dad brought up some good points and she saw a diff pov and took those opinions and re-adjusted her thoughts? for one dads been the constant her whole life ofcourse she would go to him for advice. Him buying her stuff does not have anything to do with op it’s the father money and he can spend it on whatever he wants be it his hobbies or gifting stuff to his child. op is fs the AH in the situation. Surely after 10 yrs there are some bigger issue than these things but op didn’t list anything of the sort but did show his jealousy and resentment. op YTA if she was a spoiled brat in your relationship and it was causing issues within the marriage what are they?",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "I’m confused, when we get married are we supposed to never go to our parents for advice any more? Are parents not allowed to splash out on their adult kids if they can afford it? This seems like such a none issue. OP basically got a free car. Buying a house is a huge decision and it’s never bad to get a second opinion. There’s 0 inappropriate behaviour being described here. I can’t imagine being married to someone jealous of a normal father daughter relationship. It’s pathetic. And yes I’d say the same if the genders were reversed.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 71,
          "content": "She likely asks for BOTH opinions.  \n\nWhy be married? Because you enjoy the other person and are attracted to them, not so they can replace your father, you sicko.",
          "id": 213,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 62,
          "content": "Totally. I mentioned it in another comment - guys who are mama's boy are frowned upon but a woman \"respects'' her father. JFC.\n\nOP may have some pride and wants to rely on himself and his wife to make their living, not mooching off the rich daddy. It's a very understandable thing to do.",
          "id": 214,
          "comments": [
            {
              "score": 8,
              "content": "If a mother buys her sons cars and laptops, there's zero problems with that. Most people wouldn't give a shit.\n\nIt's when men want mommy to clean up their mess and make doctors appointments for them is when they get called a \"mommas boy\"",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "It is normal to ask advice on a big ticket purchase like say a house.\n\nBoth OP and his hopefully stbex saw a house. She presented the house to her dad who had an adult conversation about the reality of her purchase.\n\nShe came back home and tried to tell OP what she discussed and he started flinging shit like a monkey.\n\nOne person in this situation acted like a normal adult, the other like a spoiled brat angry that they couldn't get their way.\n\nI leave it up to you to decide who is who.",
          "id": 216,
          "comments": [
            {
              "score": 5,
              "content": "Yeah, he had a fit because she didn't include him. She went to her dad then came home and said \"Daddy says...\"",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "You know marriage doesn't mean control right?",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "She's depending on him just because she asked for advice?  Does being married mean you only ever seek the opinion of your partner? That's absolutely ridiculous nonsense\n\nPeople can go to their family when they want to because they are close. I would imagine there's plenty she doesn't ask her dad about. \n\nAnd sorry, what should she consider for her spouse when they are offered a free, new car? What's the problem?",
          "id": 219,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": ">has no consideration for her spouse.\n\nYes she should just turn down free money for no reason lmao",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "[deleted]",
          "id": 221,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 256,
      "content": "I don't think you're the asshole for thinking as you do. If during the argument you were both calling each other names then thats clearly an ESH and the fact that she's pretty hurt by the spoiled brat remark is probably because you hit a sore spot with that one, it can be hard to hear you partner say he thinks about you in a way you don't want/like him to, especially if he kinda has a point to it. Go get counseling stuff like this can snowball into much bigger issues.",
      "id": 222,
      "comments": [],
      "relation": "Support"
    }
  ]
}