{
  "post content": "I'm a working student (27/M). I combine working FT with getting a uni-degree.\n\nA lot of my free time is consumed by going to classes and studying. I always have to find the right balance between time spend on working/studying and time spend with loved ones, most importantly my gf (26), who I have been living with for 2 years now in our small one bedroom apartment.\n\nMy gf has a hard time accepting I can't always spend as much time with her as she would like.\n\nSo in the beginning of this year I started getting up early (6 am) to be able to study for about 1h before having to go to work. This quickly became untenable for two reasons:\n\n1.\tMy gf is a big 'revenge bedtime procrastinator'. Which basically comes down to her wanting to stay up late during the week (until about 1am).\n\n2.\tI have sleeping issues. I have difficulties falling and staying asleep. This causes me to be unable to sleep before she's in the bed beside me. This sucks but I really can't help it. I just know that if I fall asleep, I'll wake right up the moment she enters the bedroom and then I won't be able to sleep for hours.\n\nGoing to bed at 1 AM and waking up at 6 AM results in about 5h of sleep. Exhausting and just plain unhealthy.\n\nA few weeks ago, I changed course and stopped the early morning studying. To compensate for that, I started studying at least one day of the weekend.\n\nThe first time I did this, I hadn't talked this through with my gf and she became upset when the weekend came and I told her I would be studying the entire day. So at that point I promised her I'd be more clear towards her about which day of the weekend would be spent on studying.\n\nLast week I told her I’d be studying on Sunday. She's cool with that. Then Sunday comes along and she starts asking me if I want to go to the park with her. At first I refuse but then she starts getting really upset and tearing up. I felt like a dick.\n\nSo I came up with the following deal. I’d stop studying, spend the day with her and spend more time with her during weekends. From her side, she had to promise me that we’d be going to bed earlier, so that I could start studying in the mornings again. My deal included going to bed at 11 PM.\n\nShe agreed.\n\nWe spent the rest of Sunday together. Because I didn't have to work on Monday we didn't go to sleep at 11 PM that day.\n\nBut then Monday night (yesterday) came along. At 9:30 PM she wants to put on a movie and I tell her \"fine, but you remember our deal right? We'll probably not be able to finish this movie if we want to go to bed at 11 PM...\" She puts on the movie anyway.\n\nWhen the clock reaches 11 PM we get into a huge fight. She starts complaining about the fact that I'm \"treating her like a child\", that she's a grown up who can go to bed whenever she wants, that I'm being super unreasonable, that she never thought I would actually ask for her to go to bed at 11 PM. I feel cheated.\n\nThis argument is still going. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 874,
      "content": "ESH. She shouldn't have agreed to a deal that she had no intention of keeping.\n\nHowever, you can't give your adult girlfriend a bedtime. I understand that it disturbs your sleep to not go to bed at the same time and that sucks but frankly this is your problem to figure out.\n\nETA: Overall your girlfriend sounds a little immature and unreasonable. However I'm not here to judge your entire relationship; I'm here to judge this one conflict, and in this one conflict you both suck for the reasons I've stated.",
      "id": 2,
      "comments": [
        {
          "score": 515,
          "content": "I don't think that OP should be setting a bedtime for his GF either but he did state in his post that he found a workaround to this problem. He no longer studies in the morning but then must study one day if the weekend, and his girlfriend didn't respect this either. I study full time and work full time as well, this is a huge load to take on and unfortunately not everyone can afford to study and not work. He needs to study at some point throughout the week/weekend and GF needs to respect this TIME. \n\nI honestly would say NTA.",
          "id": 3,
          "comments": [
            {
              "score": 188,
              "content": "You have a point; OP was trying to solve a problem, not be controlling. Still, his solution of a \"bedtime\" just was never going to work and he shouldn't have tried to enforce it, even if she agreed to it. Frankly I think a better solution would be to set a clear and firm boundary about his need to study and to not give into her manipulation tactics",
              "id": 4,
              "comments": [
                {
                  "score": 52,
                  "content": "I agree completely. I would feel extremely uncomfortable with my partner enforcing a bedtime with me and can understand why she felt like he was treating her like a child. There definitely needs to be some boundaries set for study time though.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 106,
                      "content": "Under normal circumstances I would agree with you, but we are talking about two adults in their mid twenties, if she cant respect his study time, offering a bedtime as a compromise is a reasonable thing to do, and by accepting that offer I believe OP has every right to state that they are going to bed at 11 pm. This isn't enforcing child measurements on his GF, this is trying to make her hold up to her part of a verbal agreement, which she should be capable of at the age of 26.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I don’t know, if my partner wakes up and is unable to sleep because of me and asked me to go to bed earlier, to solve not one, but two problems that I’m creating, I think being TA fall Las solely on me at that point...",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -9,
              "content": ">I study full time and work full time as well, this is a huge load to take on and unfortunately not everyone can afford to study and not work. \n\nthen maybe they shouldn't be dating. If you can't meet your partners emotional needs then maybe you shouldn't be together.",
              "id": 8,
              "comments": [
                {
                  "score": 8,
                  "content": "Or maybe, if a person can't handle that their partner needs to study they probably shouldn't date a student.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You just said the same thing I did. Some people shouldn't be dating each other. sometimes the timing is wrong. If the two have incompatible needs that can't be met then they should probably break up.\n\nBeing full time employed and full time student is hard and takes up a lot of time. Not everyone has the bandwidth to handle that and a full relationship at the same time.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Exactly.  I've seen many posts on here of people who 'need' their partner in bed with them in order to sleep, and overall this guy is one of the most minor assholes in that category- but you cannot depend on your partner (who is clearly a night owl) to sleep.  You just cannot put that on someone else.",
          "id": 11,
          "comments": [
            {
              "score": 38,
              "content": "He’s not depending on her to sleep, he’s depending on her not waking him up when she comes to bed and being unable to go back to sleep.",
              "id": 12,
              "comments": [
                {
                  "score": 19,
                  "content": "Nonetheless, they share a bed.  And sharing a bed with someone means you can't hold them to your own sleep schedule, someone will always be getting up first or going to bed last.  He didn't say a thing about her being loud or turning on lights or being unreasonable about how she came to bed.  If you are gonna share a bed (and plenty of people keep separate bedrooms with their partner for these kind of reasons) you can't hold them to your own sleep schedule, and you will make yourself miserable trying to keep to theirs, and end up blaming them for your own unhappiness.  He needs to get earplugs or wear a sleep mask or get a better mattress that doesn't move on his side when someone gets in on her side, or try one of dozens of other sleep solutions, but every adult person gets to decide for themselves when they are gonna sleep, and neither of these people are ever going to be happy if he puts all the weight of his sleep issues on her.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Or even separate rooms tbh",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "He isn’t putting his sleep issues on her. He tried to work around her schedule by sleeping in later and studying on the weekend instead, but then she got upset and cried that he didn’t have time to spend a whole weekend with her. \n\nIf I had a partner who had very little free time bc of work and studying, and who I actually wanted to see sometimes, I would help them prioritize getting as much sleep as possible. NTA",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -12,
                      "content": "If you are living with and sharing a bed with someone, it makes perfect sense to go to bed at the same time together. Seems really inconsiderate to do it any other way tbh. Why would anyone want to be woken up in the middle of the night every night? Sounds terrible.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I don't think it's like that, reading his post. He needs her in bed so he doesn't wake up when she comes in to go to bed. Or did I misunderstand?",
              "id": 17,
              "comments": [
                {
                  "score": 18,
                  "content": "He kind of said both, that he has difficulty falling asleep before she's beside him but also that if he *is* sleeping it wakes him up when she comes to bed.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Ohh, I thought i was like a \"i can't sleep yet because if she comes in it will wake me up\" kind of thing. Reading it over you're right, it's more likely to be a mix of both. It might also be a preference thing, I very much sleep better when next to my SO but it's not a requirement, rather than a \"need.\" No idea but I see it as more both now, so, thank you!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I don't think he needs her in bed to sleep. I think it just wakes him up when she gets into bed and then he can't go back to sleep. If they had separate beds that would not be an issue.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "He didn't give her a bedtime, she agreed to a deal where they would go to bed at 11, then she reneged on it and acted like a spoiled brat.  NTA.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Since the prescribed bedtime was an agreement between OP and GF, I would say NTA. Particularly since he kept his part of the deal.  GF is definitely not acting like an adult.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "He didn't give his GF a bedtime he made her a deal as one adult to another. If shes an adult and can go to bed whenever she wants then she's also an adult who when making a verbal contract should be expected to hold up her end!\nAt the end of the day she made the deal she should live up to it!",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "Perfect answer 😊",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 298,
      "content": "So, to be clear\n1. You work and attend school;\n2. Your success in your career pursuits ahead are directly tied to your success in the classroom\n3. You are very organized and diligent in your studies and the rigor that you employ to accomplish those studies\n4. You have a live-in partner who\n       A. Refuses to respect your academic commitments\n       B. Manipulates you on a regular basis because she can't find ways to occupy herself nor keep her fragile emotions in check\n        C. Gives zero sh!ts about your career trajectory and potential success, which are tied to your academic achievements\n\nBased on the foregoing, you are breaking up with her and telling her to move out in:\n\n1. 3 days\n2. 7 days\n3. End of month",
      "id": 25,
      "comments": [
        {
          "score": 114,
          "content": "While I do agree, I think it's important to understand that OPs gf sounds like she just wants to spend time with her partner and is not getting that need fulfilled. If she is unhappy and is not comfortable being by herself in the relationship 90% of the time, the relationship may not be tenable. I really think this is mostly NAH, their needs and lifestyles don't match.",
          "id": 26,
          "comments": [
            {
              "score": 38,
              "content": "Agreed. There's nothing particularly wrong with the gf. She just wants to spend time with her boyfriend. It's hard to be alone in a relationship.",
              "id": 27,
              "comments": [
                {
                  "score": 14,
                  "content": "It is definitely hard but he’s doing everything he can to balance school, work and his girlfriend. He’s super busy and I don’t think going to bed by 11 pm is unreasonable if they actually want to spend time together. There are only so many balls a person can juggle at the same time, and if she isn’t sufficiently supportive and flexible enough to change her sleep time, he is either going to lose sleep and suffer physically & mentally, or he won’t be able to spend time with her and their relationship will suffer.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "the gf is \"agreeing\" to comrpomises put forward by op and then goes back on her word whenever its her turn to make good on the compromise. Thats a major asshole move.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Reddit advice in a nutshell. Love it :D",
          "id": 30,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "This should be the top comment.",
          "id": 31,
          "comments": [
            {
              "score": -3,
              "content": "[deleted]",
              "id": 32,
              "comments": [
                {
                  "score": 1,
                  "content": "Are you also Boston? You're respinding like you are...",
                  "id": 33,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Sure am!",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": " 4.\nJust as soon as you finish your nap. After all, sleep is important.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Absolute class comment. If i had an award to give, I would give it.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 203,
      "content": "ESH.\n\nAlthough you're typing this as though you're 'communicating effectively' you're coming across (to me) as of you're trying to parent /control her as you do your time  - and as such she is rebelling against this. A bed time? Really? \n\nStop putting your sleep issues on her. She has sleep issues too where she can't sleep until later and thay suits her. She shouldn't lay in bed wide awake to appease you. Get some ear plugs, a white noise machine, melatonin, weighted blanket, or separate bedrooms. It's not her responsibility to make your sleep better as she's not purposely sabtogage it. She simply has a different sleep schedule.\n\nShe however needs to stop saying yes when she means no just to get what she wants in the moment. That's straight up bs.\n\nThe studying schooling is temporary and I may have missed where you said how much longer this will continue for? \n\nPerhaps you need to rethink your quality time evaluate when you you make the effort for some real quality time. A bigger dinner and date night every week or 2. A daily 1 minute hug. Coffee together uninterrupted. Cooking together. Put on song and invite her to dance with you, then go back to studying - small doses of connection. It's not sexy to schedule it in, but plan it be intentional, and be aware of all the times you turn her down vs tell her yes.",
      "id": 37,
      "comments": [
        {
          "score": 35,
          "content": "All he had to say was ‘ I have to study today’. \n\nYou don’t have to go to the park if you don’t want to. If you don’t have time for her or she doesn’t respect your need to study break up. \n\nThis bedtime stuff is not the way to handle it. Learn to sleep withour dictating to someone else",
          "id": 38,
          "comments": [
            {
              "score": 46,
              "content": "He did though???\n\nShe got upset because “weekends are we-kends” it’s less “you said no to the park” it’s the entire premise of choosing education over her (which fuck that get your education first)\n\nShe doesn’t want compromise. Be that on weekend studying, or sleeping 2 hours earlier. It also comes to respect when going to bed earlier when your partner has to wake up early. My boyfriend gets up at 5am when he works. I usually stay up until 1am. But because I know getting into bed and bed time rituals aren’t a quiet thing, I also get into bed at the time he does. Because I’m respecting his sleep schedule and I’m respecting his needs. He does the same for me. \n\nA relationship is a compromise and believe it or not, that includes when it comes to sleeping. It’s respect for your partner and their needs. Basic shit",
              "id": 39,
              "comments": [
                {
                  "score": 15,
                  "content": "You're right, a relationship is about compromise, it also takes time and effort. OP is very busy and is not meeting the girlfriends needs in the relationship. OP needs to sleep early and with the gf at his side, she needs to stay up late in order to sleep. I don't think either are the AH, they just may not be compatible.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "He said no but he didn’t hold firm, is what I’m saying. Hold firm.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 135,
      "content": "NTA\n\nYou both made a deal, and she broke it. You're not \"making\" her go to bed early. She AGREED to go to bed early.\n\nNow, there's no reasonable way to enforce this bedtime. She's an adult, but she's an irresponsible and childish adult. You have no power here. She likely will not go to bed early enough for you to study. \n\nHowever, she didn't uphold a bargain. So you will no longer be flexible on the weekends. You have your set study time, and she'll just have to schedule things around that. This will require more willpower on your part though. Don't let puppy-dog-eyes keep you from studying.",
      "id": 42,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 56,
      "content": "Clearly NTA, she is just selfish. She wants it all... Your time, her schedule for everything, doing what and when she likes it.... Without compromises to support you. That's really a red flag. If you love your partner than you support him and don't guilt trip him for studying etc. You should figure out if she is worth it if you fall behind your studying goals.",
      "id": 43,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 52,
      "content": "NAH I think. I see this from both sides. I have a very demanding job, and specialty exams at the moment and literally all of my free time is spent trying to hold my relationship together.\n\nI also have the same sleeping issues, like when my othe half first moved in I would literally jump out of the bed in shock everytime he came to bed as he stays up far later than me.\n\nI can see youe point and understand it because you're compromising already and you're trying your hardest to make this work. Your girlfriend seems like she doesn't understand the time and emotional pressures of everything you have on and is missing the time you used to be able to spend together. And honestly, I don't have the answer. My partner and I actually started on a break 2 days ago because of this exact thing. \n\nWith the sleeping thing, I'm sorry but I think it's unreasonable to make someone go to bed at the same time as you. I ended up buying sleeping headphones and the shock factor got better the move I got used to it and over a few months 8 barely noticed anymore. But, I also think she handled this really poorly, you had a deal and a compromise and she didn't stick to that. Albeit because she wants to spend more time with you, she's also not treating you like an adult and respecting your boundaries. \n\nI hope you work out a solution (please tell me what it is if you do 😂😭)",
      "id": 44,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 38,
      "content": "NAH- maybe you should not live together.  I’m not saying break up, if you really love each other, but it sounds like there are other issues here. If it’s financially unreasonable for you to live apart, find other room mates to live with or figure out another way where she can sleep in another space... fold out couch? Some type of hide away bed?\n\n\nJust because you are together doesn’t mean you need to sleep every night together.",
      "id": 45,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 37,
      "content": "ESH. You sound like a total AH to be honest. \" revenge bedtime procrastinator \" really? Or maybe she just doesn't like an early bedtime. I doubt this is the first time you have tried to push that. Your sleep difficulties are a YOU problem, not a her problem.\n\nShe obviously is an AH too. You don't lie to get what you want in the short term and you don't push for more than your partner is willing to give.\n\nThe pair of you need to start thinking less about ME and more about MY PARTNER.",
      "id": 46,
      "comments": [
        {
          "score": 19,
          "content": "Just dropping in to say Revenge Bedtime Procrastinator is a term used to describe people who stay up late to make up for lost time during the day.\n\nIf you already know that though, please feel free to disregard my comment.",
          "id": 47,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "THIS!!!",
          "id": 48,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "ESH. She's being inconsiderate, and you can't impose a bed time on your girlfriend. If she were being noisy and waking you up that would be one thing, but the way you describe it you just want her next to you to go to sleep. That's on you - not her fault you can't sleep.",
      "id": 49,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 19,
      "content": "You need a two bedroom apartment so you can go to bed early-and not be awakened whenever she decides to go to bed. You need your sleep. You need your study time. You need to spend time with your GF, *but not at the expense of sleep and study time*. If you both can’t work out something, you can free up a lot of time by her or you sleeping in an entirely different place. NTA",
      "id": 50,
      "comments": [],
      "relation": "Support"
    }
  ]
}