{
  "post content": "I'm feeling out of my Mind at this point. Everyone is telling me I'm an AH.\n\nMy dog has been my companion for 6 years. She slept in my bed, she had free rein of the house. But she's also well trained. Never has accidents in the house, never disobeys commands (she knows alot), and she's so friendly with all other dogs. \n\nMy (34M) GF (J, 32F) and I have been fighting about my dog for 2 weeks now. I'm confused because J and I have lived together for almost 2 years. So she has lived with the dog all this time. \n\nBut we're about to buy a house and I guess that's where the fight started. But I was shocked. She went from living with and loving our dog to suddenly saying she has to go. I've tried to talk to her about it and her main argument is that our dog's fur will be everywhere. I always thought we had a clean place but I said I'd still be responsible for any fur (I always have been the main person to clean anyway). She still said we should give my dog to her aunt. Her main concern is her parents, who are strongly Anti-Dog for reasons I don't know. (I asked once and then backed off)\n\nI am sympathetic but I absolutely refuse to rehome my dog that I love to HER aunt, who my dog does not know. Am I being ridiculous? I had no clue this would be a problem. J even seems dismayed by the idea of us parting from our dog, but she deems it necessary. \n\nHer 3 siblings are telling me I'm an A-hole for not understanding her situation. (Maybe I am, but I can't understand a situation when I'm not told?) My parents also say I'm in the wrong because our relationship should come before anything. My brother is on my side.\n\nEdit: WOW. I didn't expect this many comments! Sorry if I don't get back to every single one but I'll do my best a little later today. A few things though, since I've heard them a lot:\n\n1. A lot of people telling me to not give up my dog under any circumstances. So I just want to make it clear that that will never, ever happen. \n\n2. People also pointed out that GF's parents or someone else in their family planned on moving in. Reading that made me sick to my stomach because it rang so true, for a lot of reasons.\n\n3. No pet tax...I'm sorry! Some of GF's friends are on Reddit and I don't want them to find this.\n\nEdit #2: Just another thing I wanted to add as I've gone over the comments. I saw a lot of people saying not to buy a house with someone I'm not married to. But one of them also said not to do so with my \"girlfriend of 2 years.\" So I wanted to say we have actually been dating for closer to 5 years, living together almost 2. Don't know if that will change anyone's advice but I thought I would add it.\n\nEdit #3 and Final: THE AWARDS! I just want to say I'm blown away today. Thank You Everyone but your comments and support and upvotes are more than enough. I just needed for someone to tell me I wasn't being over the top when everyone around me is using that \"it's just a dog\" casualness without saying that directly.",
  "id": 1,
  "comments": [
    {
      "score": 4505,
      "content": "NTA\n\nI don't particularly care for dogs.  My wife really likes dogs.  When we got together, I knew that she's into dogs, and that's part of her deal.  By becoming a family together, I needed to accept that dogs will be a part of our family.\n\nYour girlfriend's demands are very unreasonable.  She seems like she should know that dogs are important to you, and that's a pretty major thing to hit you with unilaterally.\n\nBut really, this is bigger than the dog.  What do you see the future of this relationship being?  Marriage?  Kids?  If this is a preview of how she solves problems, then I think you need to give some serious consideration.\n\nIf your girlfriend determined that she didn't want to have a dog as part of her home life, and decided to end your relationship over it...   It might be a bit extreme, but it's understandable.  But, demanding you give up your dog is not okay.",
      "id": 2,
      "comments": [
        {
          "score": 2214,
          "content": "do not buy a house with this person. its an investment and its expensive.",
          "id": 3,
          "comments": [
            {
              "score": 739,
              "content": "Wish I could award you but frankly I don’t know how!!! Ditch the girlfriend she misrepresented herself until you where fully financially invested what else has been just a manipulation?? NTA and I’d also like to add please chip your dog and take good quality pictures of each angle, if someone can pretend to love a dog for years who knows what else they are capable of!!!",
              "id": 4,
              "comments": [
                {
                  "score": 229,
                  "content": "Underneath every comment is a little gift button with a plus sign in it. You click it and choose a rewards. \n\n\nYou can buy rewards or (as I only found out recently) get free rewards by using the reddit app. It is not always there, but it's a free symbol in the right top corner, where you would usually buy the rewards. \n\nAnd I agree with your other comment!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 69,
                      "content": "I only had a reward to give thanks to your comment, so here you go!",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 192,
                  "content": "Piggy backing on this cause my step mom had not indicated that she hated my cat until a year into marriage with my dad. I came home from school one day and my cat was gone. On her day off she took him down to the shelter and abandoned him there, I never got him back.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 78,
                      "content": "God I’m sorry that was done to you.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "Oh my gosh that’s absolutely horrible. I’m so sorry that happened to both you and your cat. That’s so cruel of her.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Like others said I'm so sorry that happened to you, IMO that's Unforgivable. Glad it sounds like nothing else bad happened to the cat but how terrible for you...but Thanks for sharing. I was telling myself that my GF's family would never do something like that but I'm not so sure now.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "My dog is chipped and I'll definitely be taking pictures, because your comment and alot of others have made me REALLY wary of J's family and even J herself a little. Thank You",
                  "id": 11,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Go ahead and call this out. One day he might \"run away\" when you are gone. I would go ahead and say this out loud so they know they can't get away. Let her no that would end the relationship and no house. People are messed up. Especially if they are pushing this hard.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "THIS x 1000!",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I would be scared of leaving the dog alone with her, I wouldn't put it past her to give the dog away while OP is at work and then say it is for the best. For me the dog would always come first, they can't make free choices like we can. NTA",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "[deleted]",
              "id": 15,
              "comments": [
                {
                  "score": 21,
                  "content": "Yeah...you're right. I'm frustrated because I put a lot of thought into it before we started looking for houses and Seriously thought I was being responsible about everything. But I'm glad we haven't closed on a house yet because I need this to get settled before I make any decisions.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 42,
              "content": " 🚩  🚩  🚩  🚩  🚩 🚩 RUN! OP RUN!  🚩  🚩  🚩  🚩  🚩 🚩",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "NTA \n\nDon’t get your life any further entangled with this person (I.e. don’t get married or buy a large shared asset like a house together).\n\nShe’s showing you who she really is.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "You're right...it felt like we were ready for that but I guess that's because I was overlooking the way her parents stick their nose into her life. I told myself that everything else was great so I could overlook this \"one issue\" but it's actually caused us alot of problems. Thanks",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 629,
          "content": "Adding to top comment. It feels like someone in her family who is allergic to dogs will be moving to your house soon. Do not buy a house together. Dave Ramsey made a great point, buying a house with your girlfriend gives you all the problems of partnerships without any benefits or protections unlike a marriage. Major red flag my friend.\n\n&#x200B;\n\nYou are NTA!!",
          "id": 20,
          "comments": [
            {
              "score": 207,
              "content": "I'd wager this is exactly what's going on. GF's parents being anti-dog isn't new so why the sudden need to dump the dog? What about buying a house makes the situation different? They intend to move into the house eventually.",
              "id": 21,
              "comments": [
                {
                  "score": 8,
                  "content": "That\\`s my idea too - why does the in-laws opinion about dogs matter?",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "I've seen other comments like this and you might be right...it didn't occur to me because the in laws had a lot of opinions about the apartment we moved into together (location, general quality), so I thought they were just being overbearing and not realizing...as usual. I never thought they'd make plans behind my back like that but now I'm not so sure.",
              "id": 23,
              "comments": [
                {
                  "score": 24,
                  "content": "Oh, honey are you in the wrong sub! Hop over to r/JustNoSO and r/JUSTNOMIL for pages upon pages of inlaws and partners doing just this kind of thing.\n\nDon't comingle finances at this point. In fact, you should never join finances with a significant other AND THEIR FAMILY. Your GF hasn't matured into an individual and continues to defer to her parents. \n\nThink about that.\n\nWhile YOU might not consider them when making plans, your wife will. She will consider them when making career choices, the home you live in, the location, the food you eat, how your children are raised...etc. Just because YOU don't include them doesn't mean she won't. Once your finances are joined......it's a nightmare. \n\nParents need money.....you are an asshole for saying no. YOU will ALWAYS be at fault if what you think/do is not in line with what her parents think should be happening. \n\nBelieve me, I've been there. My husband is a cat person. I like cats....but I'm a dog person. I married him because he may default to cats but he loved my dog. He took very good care of her when I was sick and couldn't. You know, like any loving and supportive partner. He never suggested I get rid of her and he cried as hard as I did when she finally died. A few weeks later, when he couldn't get me out of my depression, he got me another little dog. THAT'S how loving and supportive partners act. They DO NOT suggest rehoming a member of your family. EVER. \n\nKeep your dog safe. Get a new girlfriend.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thank you for the subreddit suggestions! AITA is honestly the only advice sub I really know about so this is helpful. And also, making sure my dog is safe is Definitely my top priority right now.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 309,
          "content": "The whole thing is fishy. Why does the dog have to go to her family and not the OP’s? Why are all of them pressuring him to buy this dog-free home? This just makes me think the end game will be screwing the OP out of his dog and his home.",
          "id": 26,
          "comments": [
            {
              "score": 153,
              "content": "And if they need to get rid of the dog because of her parents, why would it going to her aunt be okay?  This doesn't make sense.",
              "id": 27,
              "comments": [
                {
                  "score": 211,
                  "content": "My pet theory based on OP saying his GF’s family is conditioned to kowtow to their parents just because they are parents makes me think after they buy a house her parents are going to “visit” for a little bit then “extend the stay” then basically move in because “they have nowhere else to go” and since OP gave the dog to her family he won’t be able to get the dog back if he tries to bail on the situation.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Also why are they pressuring him to give the dog to her aunt. i think that gf talked about thee dog in front of aunt and now aunt wants dog",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "Agreed. The dog will accidentally run out if he tries to get him back.\n\nThe gf sounds majorly manipulative.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Everything now makes sense! Hope Op sees this",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah, the vibe I got off this was definitely \"Girlfriend is trying to steal my dog by sending to her aunt's place\".",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "It doesn't make sense but here's why I think it makes sense to them: the aunt has a couple dogs but they are strictly \"outside dogs.\" I absolutely Hate this but the in laws think this is the \"proper\" way to own dogs if you \"must\" own them. So I think they're really just trying to enforce their crappy beliefs about dogs by suggesting Aunt. Like I'm a bad dog owner or something.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Ew. Please don't let that person have your dog.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 44,
              "content": "I've been scared that we'd move in together and GF and in laws would keep pressuring me about the dog TBH. That's the main reason I hit the pause button on the house. I couldn't live like that. \n\nGF knows as of last night that I'm hesitating to close on the house we found because of this. Before that, her overall tone was more like \"this is a tough situation we're both in but there's nothing I can do.\" Obviously that made me angry. But now SHE'S super mad. She says we're going to lose the house if I do this, and she really loves this house. She might be right but I honestly don't care.",
              "id": 35,
              "comments": [
                {
                  "score": 28,
                  "content": "she's seeing her big plans to give her parents a place to live fall apart. extinction burst. keep dog, forgo scheming girlfriend.",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "DO NOT SIGN ON THIS HOUSE. Anything that gives you pause should put the breaks on this process IMMEDIATELY.\n\nThe sudden need to rehome your dog is upsetting enough, it’s like a bait and switch. You keep saying that your GF is being evasive about why the dog needs to go. You need to sit her down and get the answer out of her and if she refuses you need to move out and reconsider the relationship. Do NOT allow this woman to keep secrets from you, it’s a horrible precedent to set that she can “conspire” with her parents “against you.” \n\nYou need to consider an ultimatum. Either she levels with you or “fill in the blank.” With “blank” = “we are not buying a house together” / “I am moving out with my dog” / “this relationship is over.”",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I have been reading your posts and responses and I am really curious if your GF's Aunt is the only option she would accept for rehoming your dog. I do not think you should rehome your dog at all but I am curious if she only wants the dog to go to her Aunt. Like if you had a friend who could take the dog what would her response be?",
                  "id": 38,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Hi! Aunt is not the only option but it's the one they think is best. If I hypothetically found a different home for the dog I honestly think they wouldn't care, so long as it wasn't our house.",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "This is some real deal breaker shit for me. The overbearing parents, an adult woman catering to her over bearing parents, expecting you to cater to her overbearing parents and just discarding a companion you've had longer than your relationship, her disregard for what's best for your dog, her disregard for your own feelings, the skirting around the actual issue... Is it the dog hair or her parents? Her expecting it to be her way or the highway when it's your home too. Just no to all of it. So are you just never going to have dogs again for the rest of your life?? Fuck that",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "To add to this, when you're in a long-term relationship with someone you need to ensure your desired lifestyles are compatible together. OP wants a home with a dog, gf doesn't. Before buying the home, I highly recommend the two of you think deeply about what kind of life you each want and then discuss. What does your desired home/family/habits look like? What are your highest priorities that cannot be  compromised and what are things you absolutely do not want? If the relationship is meant to last then you'll be able to understand each others desires and combine them, but if you can't do that then it's time for a much more difficult discussion.\n\nNTA and if it helps, personally I would end a relationship if they expected me to get rid of my dog. I love my dog, he's my family and I expect to have a dog in my home for the rest  of my life. If my SO didn't want that then we're simply not meant to be cause they don't deserve to live in a place where they're not comfortable and I don't deserve to abandon my best bud.",
          "id": 41,
          "comments": [
            {
              "score": 51,
              "content": "I have four cats and a dog. Anyone who thinks I should get rid of them deserves to be forgotten forever.",
              "id": 42,
              "comments": [
                {
                  "score": 17,
                  "content": "\\*furrever",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "I agree so much, Thank You. This subject totally is a Deal Breaker for me but I haven't talked to GF about breaking up because I thought I could make her understand and we just needed to get on the same wavelength. Now I'm not so sure. I don't know if she secretly never liked my dog and is using her parents as an excuse, or if she's just willing to let her parents run her life to this level...but honestly either way it's an unlivable situation for me.",
              "id": 44,
              "comments": [
                {
                  "score": 16,
                  "content": "Don't give her a chance to backtrack or your dog may suddenly have \"gotten out\" or something",
                  "id": 45,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I would sit her down and tell her that if anything happens to your dog when you're not with him, you are holding her personally responsible and that will be the end of the relationship, immediately.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I wish you luck! I hope you guys come to an agreement, even if that means you go your seperate ways. It's hard now, but it'll be much better for both of you in the long run",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Preach. I'm animals over people every time. An animal depends on you in a way another functioning adult won't. If you're not compatible in that respect, just move on.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Agree 100%. And seriously, what kind of monster doesn't like dogs?! I can understand if she was scared of them or allergic, but she's lived with the dog all this time!",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My boyfriend moved in with me with his horrible Jack Russell terrier. She was the most hateful dog, with occasional glimpses of affection. I hated that dog but I always took care of her. She got poison oak on her belly and I soaked her in oatmeal baths. We took her camping and took turns carrying her when she got too tired (she was old) and when we had to cross a river we inflated a raft and made a bed to float her across. \n\nMy ex was an alcoholic and took off one day with the dog, holed up in a hotel suite and spent a week getting wasted. His ex wife picked him up and took him to rehab. They dropped the dog off at the pound on the way. He told me a month later. I told him I would have kept the dog, he said he knew but he fucking dropped her off anyways. I called the pound when I found out but she had already been euthanized. It still makes me cry thinking about how he just disposed of her, knowing she would never be adopted, and knowing I would have cared for her indefinitely. RIP Lulu.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Things you need to be in general agreement on with any longterm relationship:  \n1. Kids or not, and about how many, and general principles of discipline, religion and education  \n2. Money, how it is spent and saved  \n3. Sex  \n4. Pets in your life\n\nIt may be behind these other things, but your dog is a commitment for its life and if someone can't see that, you don't really match up on a key part of life.",
          "id": 51,
          "comments": [
            {
              "score": 23,
              "content": "I agree totally. I thought we were on the same page about my dog too! And on all the other topics we've agreed too but now I'm suddenly wondering...for example we both said we think two kids is a good number, but what if her parents wake up one day and decide they want us to have four or something? I'm seriously questioning everything.",
              "id": 52,
              "comments": [
                {
                  "score": 5,
                  "content": "It is possible that there is some other reason entirely but there is certainly some reason. And you really need to figure out what is going on before you buy a house!",
                  "id": 53,
                  "comments": [
                    {
                      "score": 4,
                      "content": "We'll be talking later today and I'm planning on being Extra clear about how I feel about this.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I find that your gut is never wrong when it comes to relationships. You know this person but you will try to rationalize away your gut. Silence your mind for a bit and listen to your gut. This is your life not her parents.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "And if she chooses pleasing her parents, who won’t even live there, over you and a family member who would live there (the dog), this is her telling you where her priorities are and will continue to be: with her parents. You are NOT her family and she will never see you as such. You are not and will never be her priority.\n\nNTA. Your long term girlfriend has messed up priorities and is deeply in the fog regarding her parents and their entitlement to YOUR home. This is just the beginning of a nightmare if you go ahead with buying this house with her and planning a life together.",
          "id": 56,
          "comments": [
            {
              "score": 16,
              "content": "Makes me so sad but I think you're right about GF's priorities. This is not the first time her parents have caused problems but it's Definitely the most major. I'd been really excited about taking the next big step in our life together but you all gave me perspective and now I don't think we should be making any big decisions. Thank You",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Ah.. but will they not live there - or is this the set up.. the inlaws moving in...",
              "id": 58,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Thanks for this perspective, I was really starting to wonder if I was being unreasonable for not \"compromising\" but I never gave her reason to think I'd agree to giving up my dog. If I didn't have any pets before we got together I might have agreed to a No-Pet house but wanting me to separate from my dog I already have and love? No way. And I feel less guilty about feeling that way after reading this so Thank You\n\nI don't even know about our future now though. Going to talk to her and bring up a lot of the points you guys here on AITA said. She's always been kind of bulldozed by her parents and it's caused us strain but this is by far the most extreme case I've seen.",
          "id": 59,
          "comments": [
            {
              "score": 6,
              "content": "NTA. I'm honestly trying to comprehend what kind of monster asks someone to get rid of a beloved pet and lived with said pet for years and still is willing to throw that innocent animal away... Heartless. Inconsiderate to you and your dog. Animals get attachments too. A dog is not a gold fish you can just give to someone and they'll just adapt. Wtf. Definitely a relationship deal breaker.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "THIS. Also, it doesn’t matter why her parents are anti-dog. You’re not living with her parents. You’re not buying a house with her parents. Reconsider her, and don’t buy a house with her ffs. NTA.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I don't even have a dog yet, but my boyfriend has always known there will be dogs in the future. It's non-negotiable. He will of course have a say in the size and training, but not on the if. It's like those men who were always agreeing to have children with their partner with child-dreams, and then backtracking at 34, because they never wanted them. It's a pretty big lie/omission and would shatter all my trust.\n\nBreaking up over this wouldn't be extreme to me so NTA",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "[removed]",
          "id": 63,
          "comments": [
            {
              "score": 2,
              "content": "I am sooooo in agreement with this!  The relationship is between 2 people. Not 2 people & then some others to act as agents for 1 of the members of the relationship. \n\nThis screams manipulation and soooooooo many 🚩 red flags 🚩🚩🚩🚩🚩🚩\n\nPlease, please take time to truly think about your future.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1174,
      "content": "NTA You can't be expected to give up a beloved pet without a very good reason and she has not provided you one.",
      "id": 65,
      "comments": [
        {
          "score": 774,
          "content": "I've really tried to talk with her about it too and she still Can't explain why she wants my dog to live somewhere else. I hope we can talk it out but I don't think we can. This feels like something she's been holding in for a long time.",
          "id": 66,
          "comments": [
            {
              "score": 1190,
              "content": "So which of her family member is going to move into your new house as soon as the dog is gone? If she hates the dog you should've been able to tell in the 2 years you've been together. I'm guessing the pressure is coming from her dog hating parents...like...\"we'll never come over and visit unless you get rid of the dog\" or \"you'll have so much room in your new house, you should let X come live with you, you know X is in a bad spot. But X doesn't like dogs so you need to get rid of it\"",
              "id": 67,
              "comments": [
                {
                  "score": 477,
                  "content": "Ahhh this. Somenthing smelled fishy here, but i didnt know what. I think you hit jackpot. She wants to move in the in-laws. Its the only explanation. \n\nI would run for the hills and be gratefull i didnt buy a house together.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Idk, I think it could also be that she never like dogs, and thought she'd find an excuse to get rid of it eventually. The move to a new house could be some sort of self-imposed deadline to make her move by. I knew this chick in one of my classes who did something similar to her bf's snakes.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 133,
                  "content": "This is exactly what I was thinking! Get rid of the dog, 6 months later oops! Her parents, or brother or aunt are all moving in, it’s an emergency and it’s only temporary! 5 years later they are still there! Don’t do it. She knew you and the dog were a package deal and chose to date you anyways.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 68,
                  "content": "This was my first thought, too.   \nOP, ask yourself: why is it so important to your partner that your home be compatible with her *parents'* lifestyles? I get the feeling the parents/another relative want to move into the house, and that's why this is suddenly coming out of nowhere.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "This is exactly what I'm thinking as well. The parents probably expect to live with them and don't want the dog around.\n\nDefinitely has a whiff of deception to it.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 309,
              "content": "It's bizarre that she won't tell you the real reason.  Tell her right now this secrecy is a big red flag and pump the brakes on buying a house together.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 208,
              "content": "I mean, alarm bells are going off in my head. \n1) you said you're about to buy a house\n2) girlfriend very suddenly says the dog has to go with no reason\n3) her parents hate dogs. \nMaybe I'm reading too much into but.... that stuck out to me. Either way, if this person starts making demands without trying to compromise before you've bought your house and you're not married, maybe rethink the relationship. Good luck to you in any case, OP.",
              "id": 74,
              "comments": [
                {
                  "score": 64,
                  "content": "Also she wants the dog that go to her aunt not the OP’s family. I wonder if she is getting ready to break up with him after he spends money on a house",
                  "id": 75,
                  "comments": [
                    {
                      "score": 64,
                      "content": "That also stuck out as suspicious! It wasn't \"bring the dog to the pound\" or \"find a friend to take the dog\"\nIt was very clearly put as \"give the dog to /my/ aunt\"\nWhy her aunt, specifically?",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 119,
              "content": "I'm seconding the person who figures her plan is to move a family member in. You mentioned 3 siblings and 2 parents who are invested in you not having a dog - are any of them down on their luck or anticipating moving soon? \n\nFrom what you've written it sounds like she's being asked to advocate for somebody else's campaign. Either that or somebody has talked her into thinking doggo is a problem, like parents who wage campaigns about pets being dangerous to babies, if that's something that was on your radar.",
              "id": 77,
              "comments": [
                {
                  "score": 19,
                  "content": "I never even thought about anyone thinking my dog could be a danger to a future baby. I might ask if that's a factor. Thank You \n\nThe siblings...well, personally I think they have no opinion on my dog, they just see the situation as me making things harder on their sister because I don't \"understand\" how their family works. I told them \"I understand perfectly how your family works, I just disagree\"",
                  "id": 78,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I know I am commenting up and down this post BUT, if you disagree about how this family works then do not become part of this family.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Huh, that sounds pretty power struggle-ey.\n\nI'm sure you're oversaturated with advice at this point but between this and the dessert story, I get the feeling that your girlfriend had some pretty intense elements to her childhood? \n\nLike, she and all her siblings take it as a given that when your parents say \"jump\", you ask how high. And with her being convinced that your stepmom intentionally and passive-aggressively hurt her feelings with dessert - I kind of wonder if that's the kind of thing her parents would pull? Withholding affection or deliberately giving her worse things to keep her in line?\n\nI almost wonder if her parents are threatening not to give their blessing for the marriage unless you can demonstrate that you do as you're told? \n\nIdk man, I'm just another armchair psychologist in a sea of Redditors, same as everyone else.\n\nBut it sounds like your girlfriend is in a hostage situation, and it sounds like she's used to hostage situations.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "Honestly, this is a hill I would die on.   I have a cat.   A beautiful black fur baby that is the most lovable,  grumpy bitch.   If my partner suggested I rehome her for the sake of... fur in the new house?   Really?   That's so weak.  In any case, said partner would be packing his bag.    Keep your dear pooch and ditch the gf if she continues to insist.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "NTA, I would sit down (by yourself first) and decide - do you want this relationship to continue or do you want your dog? If you're strongly on the dog side (or even just barely on the dog side) then sit down with her and tell her you are on the dog side unless she can give you a SOLID CONCRETE reason as to WHY you SUDDENLY need to give up your companion. It could be that she thinks she is pregnant and doesn't feel it is safe for the dog to be around a new baby, it could be she plans on moving her dog-hating parents in. Either way, you need to know before you invest anything more into the relationship.",
              "id": 82,
              "comments": [
                {
                  "score": 36,
                  "content": "Want to add onto this, even if the reason is because she could think she was pregnant, that is no reason to give up a pet. Plenty of pets adore kids!",
                  "id": 83,
                  "comments": [
                    {
                      "score": 9,
                      "content": "True, but if the \"family secret\" that no one talks about is a family member badly mauled (or killed) by a dog then the GF would definitely want to get rid of the dog prior to birth.",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Homie, it sounds like she wants to\nMove her parents in(who are scared of dogs if I remember correctly from your OP); bro, that’s fuckin wack if she’s trying to make decisions about the house like that without you being aware. NTA, update us when somethin happens",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Many people have given you good advice. \n\nThere are only two choices here, really. Either you give up your pet to placate your GF or you state clearly that the pet stays and GF can choose what she wants to do. \n\nEither way, your house purchasing plans should be put on hold until this is solved.\n\nIs it possible the GF associates buying a house with starting a family? Many people seemingly have hang-ups with babies and pets, but that should’ve been said from the get-go. Maybe she thought that the dog was like a replacement baby until a real baby comes along. OP, do you know for sure that she isn’t pregnant? Maybe that’s why she’s so adamant about it. Either way - OP, if you don’t want kids yet, make sure to cover that particular area of your back. Not to sound too alarming, but if the reason is kids, there could always be an ‘oops’ and then she could proclaim that giving your dog away has become a necessity. \n\nSecondly, get your dog chipped and if possible (not sure if there are such, but if they exist, get one) get the dog a collar tag that has a tracking device or something. Reason? There have been plenty of SO’s who think that if the pet ‘goes missing’ then the problem is solved. Make sure that you know the pounds and dog shelters in your area, because it is possible that in the event of your decision not being to her liking, she might take your pet to a pound when you are away at work or somewhere else. If you do end up breaking over this, make sure to change your locks and that she cannot have access to your dog, because snubbed SO’s have been known to steal or let loose their exes pets for punishment.\n\nThird, make sure to make your GF know that the house you will purchase is not a long-term hosting situation for any of her relatives (that means for you too, of course). It is possible that she could have an idea that someone who dislikes dogs will be moving in later. Do you happen to know if your in laws have plans to retire or sell their own accommodation? Maybe your SO’s siblings? \n\nYour GF has a reasoning as to why she is doing it and unless she can tell you exactly why, you’ve both come to a line in the sand. You’re a good pet owner for not giving your pet away! Do not buy the house until you have all the details hashed and hammered out - you may lose out on a ‘dream house’ but any ‘dream house’ you purchase with these kinds of strings will become an expensive ‘house of horrors’.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "There is way more to this. There's something she's not telling you. Don't go ahead with buying a house until you learn what it is.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Please do not buy a house with her. Not only will your dog likely “run away and not come back,” but there will be other control issues and orders you are going to have to deal with as far as she and her parents. Bills, kids, vacations, other major life decisions, she and her parents are going to try to order you to do it their way. This doesn’t look good for you OP. Keep the dog and ditch the GF.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Safeguard your dog!  For a person like this (hopefully soon to be ex) girlfriend, it would not be beyond her for the “dog to get out” never to be seen again.  She’s presented a false front to you all this time.  Count your blessings you’ve found this out before the house purchase, and especially before a wedding.  \n\nIf she suddenly reverts to the dog can stay, Don’t Believe It!\n\nNTA",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1161,
      "content": "NTA.  Rehome your GF to her Aunt.",
      "id": 90,
      "comments": [
        {
          "score": 65,
          "content": "This makes sense!",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Yup! Sounds like her aunt wants a pet! She can have the gf",
          "id": 92,
          "comments": [
            {
              "score": 18,
              "content": "The Aunt wants a well behaved pet, not an erratic beast. \n\nBut as they say beggars can’t be choosers who GF and Aunt are going to have to work together if they are to live under the Aunt’s roof.\n\nWhat a shame. \n\nAnyway looks like OP and his dog are going to have more room for activities.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Seriously. Your dog is better behaved and will always be more loyal. Also, remember the saying that your dog is a part of your life, but you are your dog’s whole life.",
          "id": 94,
          "comments": [
            {
              "score": 3,
              "content": "this 100% he doesnt know anyone else in a real way. You are his parent and his world. \n\nIf the excuse isnt good enough for you to give up your toddler it isnt good enough to get rid of a beloved family pet",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Perfect solution.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I shouldn't have laughed but I did. Haha Thank You",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "This needs to be top comment. Your dog loves you more than this chick ever will. People and their pets are package deals.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This is the way.",
          "id": 99,
          "comments": [
            {
              "score": 2,
              "content": "This is the way.",
              "id": 100,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "BEST REPLY! 🤣",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "The best response omg.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 632,
      "content": "NTA. This honestly seems like long term gaslighting if she has been *living with the dog* without problem for *years*.\n\nAlso pro-life tip. Never buy a house with someone you aren't married to.",
      "id": 103,
      "comments": [
        {
          "score": 130,
          "content": "I'm not going to say \"never\"...  But there should be understandings, and legally binding paperwork to back them up.",
          "id": 104,
          "comments": [
            {
              "score": 51,
              "content": "I second this. My boyfriend and I have bought a house together, but we drew out some very specific legal documents in case of a breakup. \n\nWe don’t plan to breakup but it gave us that piece of mind of knowing what would happen.",
              "id": 105,
              "comments": [
                {
                  "score": 20,
                  "content": "Bravo for coming up with a plan on this.\n\nMy experience has been that unmarried couples who buy a home together aren't \"planning to breakup\"...  But, if you check in the legal advice sub, you'll see a post about once a day from ones who did.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Considering around 50% of marriages end in divorce, marriage doesnt equate a long lasting relationship.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Legally binding paperwork to back them up. You mean like a marriage contract that would also protect you in other ways as well? Including tax benefits? \n\nI really hate how people crap on marriage overlooking all the benefits of it. Like the whole LGBT+ were only fighting for a piece of paper not all the other legal protections and benefits that go with it.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Pro-Life tip .....life begins at con....vincing your bf to dump his dog \n\nLife pro-tip.....life begins at dumping mean GF, getting more dogs.",
          "id": 109,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "1) I don't think you understand what gaslighting means. \n2) That's ridiculous advice. What about long term partners who don't believe in marriage? Should they just live apart, or rent for the rest of their lives, just because they don't want to get married?",
          "id": 110,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -8,
          "content": "Please look up the term \"gaslighting\". 🤦🏼‍♀️",
          "id": 111,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -9,
          "content": "Marriage is a pretty outdated concept. I'd say don't buy large expensive debt Laden assets with people you haven't lived with and have only been with a short period of time. But marriage is pretty optional for a lot of people these days.\n\nSource: 11 year relationship, living in our second house",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -24,
          "content": "lol life pro tip\n\nand I would not even use that phrase since that sub is mostly targeted at young teenagers who didnt have great parents :)\n\ne.g. life pro tip replace the soap dispenser in your bathroom when it is empty....  LPT the oil in your car needs to be changed once in a while....   LPT if you buy something expensive keep the box and receipt",
          "id": 113,
          "comments": [
            {
              "score": 10,
              "content": ">since that sub is mostly targeted at young teenagers who didnt have great parents :)\n\nNot really. Theres tips for absolutely every area of life, from keyboard shortcuts to how to skip phone automated menus to random dumb shit. Theres not a parent alive (or ever) that knows every single tip posted on that sub. Your comment is weird",
              "id": 114,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 386,
      "content": "[deleted]",
      "id": 115,
      "comments": [
        {
          "score": 136,
          "content": "She hasn't explained anything!!! What exactly does he understand to begin with? OP's dog predates the gf who has lived with said dog. This shouldn't even be a question. End of relationship, end of story",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I completely agree...GF sees it differently, she would never say out loud that my dog is \"just a dog\" but that's definitely the feeling I get when she tries to act like rehoming is not a big deal. \n\nBy \"her situation,\" I think she and all the sibs are trying to get me to accept that her parents will always have a say in her life because that's how it's always been. But I don't accept that. And they definitely don't get a say about My life or my dog.",
          "id": 117,
          "comments": [
            {
              "score": 9,
              "content": "Yeah. I read some of the comments & update. Definitely sounds like they wanted to move someone into your new house. Thinking about having kids? Maybe the parents wanted to move in and parent their grand kids. Or does she have an elderly grand parent that needs assistance? Injured or out of work sibling?\n\nDefinitely shouldn't sign anything to move forward with the house purchase (unless you're doing it completely in your name and can afford it) and you DEFINITELY should use condoms that you're sure aren't tampered with. Or maybe just don't have sex with her until you've resolved these issues.\n\nMaybe I'm reading into this too much. IDK.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "You do not want to get involved with anyone who is still under their parents/guardian's thumb. First they come for the dog, then it's a piece of furniture or pictures, then its your soul. Get out",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "It has to have something to do with the parents. Another comment mentioned it. She wants someone in family to move in once they have the house that doesnt like dogs or she wants the parents over all the time and they are pressuring her. \n\n\ndont give your dog up for anything less than something youd put a toddler up for adoption for .",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 251,
      "content": "I would be incredibly wary of her after this. If she cannot understand the commitment and love of a six year relationship with a beloved pet, then there is a part of her that is (or has recently become) very broken. Huge red flag here that she will have all kinds of other nasty surprises for you in the future. Pump the brakes, at the very least, and allow yourself some space to get some perspective.  Your level of hurt and discomfort is something to seriously listen to right now. You are NTA and it sounds like you are being gaslighted.",
      "id": 121,
      "comments": [
        {
          "score": 158,
          "content": "Also OP may want to make sure the dog is microchipped and such. It could just be paranoia induced by reading too many stories on Reddit but there is always a chance she will just decide to rehome the dog when OP isn't home.",
          "id": 122,
          "comments": [
            {
              "score": 50,
              "content": "Yes! Not only chipped but maybe not leaving dog alone with gf. She may give the dog away through fb or dump them. If no one scans the chip there is no way for op to know.",
              "id": 123,
              "comments": [
                {
                  "score": 8,
                  "content": "“Why did you paint the room red?”\n\n“Hmm? Oh, I just felt like it. By the way your dog ran away. Don’t touch the walls.”\n\nRUN",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is my fear too.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Also maybe OP should get one of those tracker things on the dog’s collar. You can check location on your phone through an app, and it can alert you if the dog leaves your yard. JUST an idea in case GF tries to rehome dog when he isn’t home.\n\nMinute dog leaves yard in GFs car you just call as say “Take my dog back to the house, I’ll be home in 10 & you better start packing.”",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "This is exactly what I was thinking. OP do not buy a house with this woman. It is completely unreasonable to ask you to re-home your dog. And IMO it makes no difference why her family is anti dog. If they don’t like it, they don’t have to go to your house. NTA",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "It makes me sad but this gives me a lot to think about...GF always loved my dog, happily takes her on walks and bathes her if I'm not around, knows my preferences about her food, snuggles with her all the time. But now she seems like she would be just kind of bummed to live without our dog and doesn't seem to understand that I'd be Crushed. (If that ever happened. Which it won't)",
          "id": 128,
          "comments": [
            {
              "score": 5,
              "content": "Don’t let her walk or care for your dog anymore.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 172,
      "content": "NTA. It is simply bizarre that her parent's opinion means that much to her.  And not a great sign.  You are both adults, I assume financially independent, and can make up your own mind as to having a dog in your home.",
      "id": 130,
      "comments": [
        {
          "score": 163,
          "content": "Financially independent, yes. She comes from a family where people are just expected to defer to their parents because they're parents. I wasn't raised like that. We've had minor Problems about this kind of thing before but nothing as major as this.",
          "id": 131,
          "comments": [
            {
              "score": 216,
              "content": "What's happening here is that she is showing you something VERY IMPORTANT. \n\nHer parents' views and opinions matter more to her than yours. \n\nHer parents' views and opinions are also more important than a companion that you've loved for years. \n\nThere is a clear conflict of interests here, and she's very clearly decided whose side she's on, and it isn't yours.\n\n**Her priority is her parents, not you**. \n\nThat's not someone I would want to buy a house with, or be in a relationship with. Her parents' views are already dictating how you are going to live, and that *will not stop*. It'll probably get worse, in fact, because if you give up the dog I bet her parents will be frequent visitors (or will end up moving in, who knows), and pleasing them is going to be her primary goal and that will dictate how you live. Imagine if you have kids one day - her parents' views on how to raise those kids are going to hold way more weight with her than yours. \n\nIt's not about the dog. It's about who your partner thinks matters, and it's not you.\n\n*When people show you who they are, believe them.*",
              "id": 132,
              "comments": [
                {
                  "score": 49,
                  "content": "Wish I could upvote this more than once! Lots of worrisome relationship signs here:\n\nShe's making unreasonable demands and refusing to compromise (no regard for her partner at all).\n\nShe's being dishonest with OP about the *real reason* she's making this demand (the dog fur excuse is so flimsy).\n\nShe's talked to her family *before* OP about this issue (that's how she knew her aunt would be willing take the dog in).\n\nThe *\"I always have been the main person to clean anyway\"* part buried in there is concerning too. What's the division of labor like at home? Is this a fair partnership?",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "I think you're right...I sort of thought (stupidly) that she'd \"grow out of\" being so scared of her parents all the time, but it feels like she's happy to let them make decisions for her...I don't want to answer to them for the rest of my life.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 16,
                      "content": "She's 32. If she hasn't grown out of it by now it's not going to happen.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Then it's time to have a sit down conversation with her. This isn't just about the dog. You have to ask her why her parents' opinions are more important than yours. You need to ask when you will become priority and why she's letting her parents influence this decision.\n\nTell her getting rid of your dog is not an option and that she knew your dog was always part of the deal.\n\nFinally, ask her if she's planning to move her parents in with you. Tell her that's not an option.\n\nUnfortunately this may be a breaking point in your relationship. She has to grow up and grow a spine fast.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Then don’t. You’re young and there’s plenty of life ahead of you.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This! If i could reward you, I would!",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 64,
              "content": "That’s bullcrap she can’t expect you to become a doormat like her for her parents !\n\nPlease keep your doggo and keep your foot down. If she can’t except this it’s all on her because she knew from the start you had a dog and even lived with the dog!",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "NTA. This is a deal breaker for me, my dog's are family and live for about 15 years (toy breed) No way in Hell I would give them up for anyone, I would live under a bridge with them before I gave them to a stranger!",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "So, if she wants to move in her parents, or another relative, wouldn't this be the first step?",
              "id": 141,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Do not allow her the opportunity to get rid of the dog",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I also come from a family where we're expected to defer to our parents, but a big part of that is my parents actually care about my best interest and don't meddle in things that shouldn't matter to them, like my partner's pets or hobbies or whatever.  The type of respect you're describing is either earned or unhealthy, and in your partner's case it doesn't sound particularly earned.\n\nAlso, I have two cats that my mom is really allergic to and a snake that neither of my parents care for, but I'm a grown adult so they can't, and wouldn't, tell me to get rid of any of them.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "If you choose her, you will be spending the rest of you life not being able to make any decisions unless approved her parents. First its the dog. Then the house. Then how you plan your wedding. How you raise your kids. And even if you put up a fight, it will be a never-ending battle for the rest of your life. That's not a healthy happy life  & no one should have to live like that. You deserve someone who will be on your side & back you up when you need them. That isn't her. She will always cave to the will of her parents.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "She's right, someone has to go here. It shouldn't be the dog but her.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Chiming in here to add: Dump this girl ASAP. \n\nKeep your dog, you can find a better girlfriend.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 164,
      "content": "NTA And I knew a family that did this (one in 15 years of selling real estate) and a couple who discussed it but ultimately did not do it. Honestly this is something I would have trouble forgiving. Have you signed a contract? If not, tap the brakes, anyone who puts dander and some fur here and there (with no allergies and cohabiting with that dog for two years) above everything else is perhaps someone you want to rethink.\nShe does not care about the dog’s trauma and she does not care about you.\n\n\nEdit typo",
      "id": 147,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 144,
      "content": "NTA. If the girlfriend is saying it is her or the dog, you choose the dog. What other out of line demands does your girlfriend have up her sleeve once she views you as more locked down? If she gets you to do this, she knows she can get you to do anything",
      "id": 148,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "I’m confused, if they’re so anti dogs why is it okay for the aunt to have her?\n\nNTA in any case!",
      "id": 149,
      "comments": [
        {
          "score": 14,
          "content": "wanna bet her aunt would have it put down?",
          "id": 150,
          "comments": [
            {
              "score": 13,
              "content": "“He just all of a sudden passed away. Don’t worry I already had the dog buried in an unmarked graves in the woods. Now what’s this I hear about GF’s [family member] moving in with you guys? Sounds pretty exciting!”",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "That's a good question🤔",
          "id": 152,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}