{
  "post content": "First time poster, so sorry for any mistakes. \n\nMy (24f) older sister Josie (29), is a vet and is still working through the current sitution. Several lambs were found to be super sick this morning at a farm.  My sister spent all day treating them and wasn’t going to be able to go back to the farm for a couple of days.  Based on their status at the end of the day, she was concerned the lambs would die if left at the farm.  So she ended up bringing them home to treat in our house to give them the best chance to survive. There was no cell service near the farm, so she couldn’t call to ask if this was okay.  Unfortunately, one of the three lambs was severely sick, was deteriorating rapidly, and passed away. \n\nSo, I was not told that Josie was bringing these lambs home. She just called me up and asked me to set up our puppy’s pen. I assumed she had found someone’s lost dog or something since she asked me to put our pups outside. When she came home, she brought in a tub of three lambs. I was pretty shocked, as she’s never done anything like this before. I started freaking out a bit since one already looked like it was dead and I do NOT deal well with death or dead things in general. I quickly excused myself and spent the next 2 hours or so crying and almost hyperventilating thinking about the lambs dying in our kitchen.\n\nI finally came out of my room for dinner and Josie casually mentioned that one of the lambs had died and her colleague had come by and picked it up. I basically shut down into a panic, asked for the keys to the car we share, and went for a drive. I was gone for about 20-30 minutes, just letting myself cry it all out, since I felt so bad for not wanting these animals in our small house, but I didn’t want them to die just because I was uncomfortable. So here’s where I may be the a-hole. When I left, I forgot my phone at home and didn’t say where I was going or when I’d be back. Josie freaked out because she was obviously worried and had my whole family calling to try and find me. So now I feel doubly bad because my sister was just trying to help these lambs and I bolted on her and worried everyone. AITA for freaking out over having dying lambs in the house?\n\nTL;DR: My sister is a vet and brought home 3 dying lambs to try to save them. I freaked out when one died in our kitchen and bolted without saying where I was going or when I’d be back, causing my whole family to worry about me. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 50,
      "content": "NAH she brought home lambs you didn't know about and you reacted but\n\n> spent the next 2 hours or so crying and almost hyperventilating thinking about the lambs dying in our kitchen\n\nYou know this is not normal right? I'm not trying to bash you, I'm just saying please get some help because this isn't healthy for you",
      "id": 2,
      "comments": [
        {
          "score": 26,
          "content": "This is the real answer. OP isn’t an asshole, but their behavior so far from the norm to mean that this problem is really above AITA level. Please seek some help.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 21,
      "content": "I’m going to say NAH, your sister did nothing wrong in helping animals, but it sounds like you have severe anxiety about death/animals dying.  I would suggest you might want to consider therapy though.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "NAH\nYou did what you needed to do to cope with the situation, and made a mistake. There’s nothing wrong with that.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "NAH. You didn't mean to make them worry. Your sister sounds like a great human who only wanted to save those animals. Maybe just have a talk with her about how their condition made you feel. It's ok to be freaked out about death, but your sister didn't do anything wrong so don't be angry with her.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NAH. She's doing her job as a caregiver. You attempted a known and usually healthy means of dealing with an intense emotional response, but forgot to make sure you can keep yourself safe while you do, understandable given the stress you were facing at the time. \n\nTalking to a professional about that extreme a response/fear of death might be a good thing for you, and a heart to heart with your sister about advance warning when she has to bring patients home would be good ideas moving forward.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "I'm gonna go against the grain here and if I get downvoted, then so be it. \n\nBut, YTA. \nYou are having a major reaction to something that sounds as though was an emergency on her part. You stated she's never done anything like this before which continues to point towards it being an emergency. \n\nTaking a ride is fine, good way to calm down. But in your reactive state you left your phone behind. She was understandably worried. \n\nYou need to get a better grasp on your emotions.",
      "id": 8,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "Very, very soft YTA.\n\nReason being, you don’t seem to be able to see the rationalization behind why your sister brought them home. In most scenarios, saving even one would be better than losing all three.\n\nIn reality though, the other posters are correct. Your response to death and loss is not healthy, and I hope for your sake that you can seek help now- if this is your reaction to a *lamb* dying out of sight/earshot/knowledge to you, I can’t imagine what the death of a family member or loved one would do.\n\nETA: spelling.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NAH - but please,  if you aren't already,  look for help, your reaction seems very unhealthy and even might be dangerous for your mental health",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH\n\nYour sister is doing her job and it sounds as though she's really going above and beyond the call of duty here. You're also within your rights to not want other people's animals in distressed states to actually be inside your house. \n\nHowever as other people have echoed, your response to the situation was a bit thoughtless if not erratic. I understand that you needed to get out of the house, but driving whilst in a panicked situation could put other people at risk. It might be worth just checking in with a doctor to see if there's something else at play when it comes to the hyperventilating and panic attack.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst time poster, so sorry for any mistakes. \n\nMy (24f) older sister Josie (29), is a vet and is still working through the current sitution. Several lambs were found to be super sick this morning at a farm.  My sister spent all day treating them and wasn’t going to be able to go back to the farm for a couple of days.  Based on their status at the end of the day, she was concerned the lambs would die if left at the farm.  So she ended up bringing them home to treat in our house to give them the best chance to survive. There was no cell service near the farm, so she couldn’t call to ask if this was okay.  Unfortunately, one of the three lambs was severely sick, was deteriorating rapidly, and passed away. \n\nSo, I was not told that Josie was bringing these lambs home. She just called me up and asked me to set up our puppy’s pen. I assumed she had found someone’s lost dog or something since she asked me to put our pups outside. When she came home, she brought in a tub of three lambs. I was pretty shocked, as she’s never done anything like this before. I started freaking out a bit since one already looked like it was dead and I do NOT deal well with death or dead things in general. I quickly excused myself and spent the next 2 hours or so crying and almost hyperventilating thinking about the lambs dying in our kitchen.\n\nI finally came out of my room for dinner and Josie casually mentioned that one of the lambs had died and her colleague had come by and picked it up. I basically shut down into a panic, asked for the keys to the car we share, and went for a drive. I was gone for about 20-30 minutes, just letting myself cry it all out, since I felt so bad for not wanting these animals in our small house, but I didn’t want them to die just because I was uncomfortable. So here’s where I may be the a-hole. When I left, I forgot my phone at home and didn’t say where I was going or when I’d be back. Josie freaked out because she was obviously worried and had my whole family calling to try and find me. So now I feel doubly bad because my sister was just trying to help these lambs and I bolted on her and worried everyone. AITA for freaking out over having dying lambs in the house?\n\nTL;DR: My sister is a vet and brought home 3 dying lambs to try to save them. I freaked out when one died in our kitchen and bolted without saying where I was going or when I’d be back, causing my whole family to worry about me. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    }
  ]
}