{
  "post content": "I (21f) has always had the T-phobia of being scared of holes/shapes. Just the name of the phobia gives me goosebumps. Fair warning, don't look it up if you don't know what it is because it's how mine started from a very young, stupid age of not heeding warnings. Curiosity did kill the cat in me and there's not resurrection back from it.\n\nMy ex-bestfriend knew this because she was the one who told me about it and 'encouraged' me to look it up. I don't blame her because we were young and she's not afraid of the phobia so I think she didn't know everyone was the same as her.\n\nMy anxiety doesn't get triggered when I look at honeycombs or the seeds on strawberries or lotus, but I did lose my appetite on those black little sesame-looking dots on king crab legs. Specific, I know. \n\nEx-bestfriend is getting married by the end of Nov despite the pandemic, but it's supposed to be a close-knitted, private wedding and everyone will follow guidelines. I was hesitant at first, but she was my BF so I did more research on how to be safer. \n\nWe've (bridesmaids, MOH, and bride)  been on vid-call a lot to fix some last-minute emergencies that were out of our control. Everyone's stressed, but because they're in a city with concerningly high positive test rates, they're extra stressed while I live in an okay city so there's not a lot of cases. So, technically, I'm not as stressed as the bride and MOH. \n\nI must've looked relaxed during the last vid call because the bride (ex-bf) was asking me to help out more and it's a mean thing to sit back relaxing while everyone's stress and anxiety level is really high. I told her that I literally can't be there to help because I'm in a different state. \n\nMaybe I was too snappy, so I apologized and offered to help with things that can be done over the net.  She was still silent and suddenly she just popped a T-phobia image in the vid call. I was taken aback and scream what the fuck is she doing! I ended the call, I couldn't scrub the goosebumps off my arms and I physically felt nauseous. I texted her why she did that and ex-bf said it's what I get for rubbing my 'relaxation' in her face.\n\nI don't take lightly of my fears, and she knows about this particular fear that I had to get therapy for and still in. I told her to apologize to me, she doesn't because 'I deserved it'. I felt disrespected and frankly, disgusted with the image and with her behavior. \n\nI said I'm not comfortable attending her wedding anymore, and now I got everyone blowing up my phone saying I can't do that when it's so close to the wedding. Changes can be expensive and possibly delay the wedding, but I feel that I deserve basic respect.\n\n*ESL*.",
  "id": 1,
  "comments": [
    {
      "score": 6802,
      "content": "NTA.\n\nBridezilla weaponized your phobia. She's a disgusting person and you're better off without her in your life.\n\nYou tell anyone who says anything that you have too much self-respect to allow anyone to treat you this way. If they disagree, then you know they are not a good person and not to bother about them any longer.",
      "id": 2,
      "comments": [
        {
          "score": 1231,
          "content": "NTA at all. I have the same phobia and reading this caused the hair on my neck to stand up and i am incredibly itchy now. I would have dropped out of the wedding AND cussed her out.",
          "id": 3,
          "comments": [
            {
              "score": 446,
              "content": "I also have this phobia and would like to recommend that people with this phobia not Google it because the first thing that comes up is a massive trigger picture embedded into the search!",
              "id": 4,
              "comments": [
                {
                  "score": 366,
                  "content": "Well, of course it is. I understand your frustration, but of course a picture will come up.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 263,
                      "content": "The mods on this sub are petulant children.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 93,
                      "content": "Of course! I'm just trying to make sure people aren't caught unaware when they look it up. When I did, it was so bad I could see it when I closed my eyes, and I'd rather people not be caught blind by it.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 218,
                  "content": "Just looked it up, honestly don't advise it, but curiosity got the best of me.\n\nPretty disgusting stuff. But I did learn that according to Wikipedia, it's a evolutionary response to a pattern that is commonly found on poisonous/venomous things.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 99,
                      "content": "[deleted]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 55,
                      "content": "It’s not quite that: it’s not recognised as a medical condition at all, but that’s because not enough study has been done. Would be interesting to see how that develops as I was amazed to read that around 1 in 16 have these reactions, and that’s a lot!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I'm the opposite and love those images, so evolution is telling me to be the last generation in my line I guess 😂",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Not for those with the phobia to read, but Reddit horror writer hyperobscura recently wrote an amazing very short story playing to this phobia \n\nhttps://www.reddit.com/r/shortscarystories/comments/i45af2/holes/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "My partner has the same phobia. He read it was also a response to diseased animals. His triggers massively when it's on an animal. Horrible :(",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "We are talking about shapes, right? Not some horror-movie or gory stuff? What's scary about the shapes? I'm very curious now but a bit hesitant after reading this thread.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "that's probably why I get in sticky situations often, I find these pictures very satisfying...",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I still don’t understand, but now I’m scared to google. Is it just weird shapes? Why is it so scary?",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 82,
                  "content": "I had to google this to see what it is. I can understand why this could be triggering for certain people. While it doesn't bother me, using that against someone would be an incredibly dickish thing to do. It's incredible that OP's BF felt this was an acceptable response.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah, why do they put the honeycomb pattern on faces and hands.  That would freak anyone out, phobia or not.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "I don't have this phobia and thought about looking it up but then thought \"no I have enough panic attacks in my daily life\" so I appreciate someone and all these people saying to NOT look it up",
                  "id": 19,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Don't do it.   I made it a lot of years without having an issue with those types of images until someone told me about it and I googled it.  Now certain images literally make me queasy and uneasy.  F-ing photoshop, man.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Same.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I knew I had the phobia but didn’t know what a lotus seed pod looked like, I DEEPLY regret it",
                  "id": 22,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Yeah...I'm lucky because I'm triggered mostly by fake images like the lotus seeds photoshoped on a person's hand. I want to throw up because it's so disgusting. The real images just make me slightly uncomfortable.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I don't know if it's google itself which is responsible but it's clearly a dick move.\n\nI have arachnophobia and the few times I googled methods and ways to fight it, the search results are associated with pictures containing huge spiders in them...\n\nI feel I cannot safely research this topic.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I had to look it up.\n\nI don’t have this phobia, but that google image isn’t exactly the most benign one out there.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "I wish I paid attention to your advice.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "I wouldn’t say I have this phobia but I understand because I weirdly can’t look at those dried flower heads you sometimes see in bouquets.\n\nAnyway my point is, I knew where this was going and even so when it happened I still felt physically sick when it did.\n\nThis is disgusting! You deserved it? What is OP, her disobedient puppy she gets to kick because she’s a trash person?\n\nOP you are NTA. This is why .....\n\nI have a very bad phobia of spiders. Pretty common but anyway I was on a road trip with friends and at a stop they were bent in the grass intently looking at something. I’m sat in the back of the car, doors open and one of my friends comes back messing on their phone, I am too, other friend comes back with something in his hands. I ask him what it is and he throws it at me. I didn’t know there wasn’t anything in his hands, I assumed it was a spider because well why would someone do that? My other friend videoed me freaking the the f*ck out trying to get out of the back of the car (I still had my seatbelt on) and I got out and was pretty much hyperventilating, screaming about if it was on me. They looked super uncomfortable and I was pissed to say the least. They said they hadn’t realised I was ‘that bad’ with it. Whatever I was too shocked. That night I cried and was visibly upset at breakfast. It was awkward, so I brought it up, explained that I was way past normal ‘I don’t like them’ response and I’m not angry at them as they didn’t know but practical jokes this like aren’t funny and said I wanted them to delete the video. They apologised again and deleted it immediately, showed me they had done. Forgotten and we carried on our trip having all the laughs we did.\n\nThing is friends get it, and yours used it against you OP.\n\nGirl can plan and attend her own wedding. Good luck to her.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "My scalp itches whenever I think about the phobia, it’s itching right now 😣 So gross, ew ew ew, OP is right for dropping out of the wedding of a person who weaponizes her phobia because she has the aUdAcitY to not be stressed over another person’s event.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I felt the goosebumps too.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Absolutely NTA! I have this phobia, I had no idea what it was for years, it was mostly triggered by biology text books so I would read with my hand over any pics, not one of my friends had ever or has ever deliberately triggered it! And if they did they would not be my friend any more either! You totally made the right call! Xxx",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 268,
          "content": "And I don't quite get the logic of being mad at somebody for not being stressed enough over your own wedding. It's a little bit sociopathic. \n\nNTA.",
          "id": 31,
          "comments": [
            {
              "score": 43,
              "content": "\"Misery loves company.\"",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 150,
          "content": "Also, it sounds like everyone's upset because \"changes are expensive\" (how is one bridesmaid dropping out so prohibitively expensive that it'd delay the wedding?), not because you'd actually be missed and they want you there.",
          "id": 33,
          "comments": [
            {
              "score": 47,
              "content": "The same bridesmaid who needs exactly the same number on both the bride and groom side .. so the photos are even\n\nSo proves your point of changes are expensive and they want someone there but not necessarily OP",
              "id": 34,
              "comments": [
                {
                  "score": 14,
                  "content": "If that is the case, then old Princess Bride needs to treat all parties with enough respect that they actually want to come. Bride honestly sounds like a person I'd cut out of my life in a hot second....\n\n.....even if I just witnessed that video call (but wasn't the one with a phobia)  I'd give her a bit of space and when she asked why would directly tell her to reconsider being a terrible person....\n\n....but then I went to an all-girls school for 11 years so I have plenty of experience with and little patience for entitled little bitches.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "NTA!!!! Jumping on to say that @IChooseYouSnorlax is probably the only comment you need to see.  \n\nWeaponizing someone’s phobia is the most disgustingly awful thing to do. \n\nDitch the wedding, ditch the bitch, and ditch everyone trying to say you’re the bad guy for doing so. You don’t need this shit in your life!\n\nETA: I’m broke or you’d get an award, IChooseYouSnorlax",
          "id": 36,
          "comments": [
            {
              "score": 29,
              "content": "Aw no need, thank you. I just hope OP knows *good-hearted people do not treat others this way.*\n\nIt’s abusive, and anyone who acts this way towards others is not a friend. Anyone who attempts to defend this is also not a friend, or a good person.",
              "id": 37,
              "comments": [
                {
                  "score": 1,
                  "content": "Especially since she refused to apologize. She obviously doesn't care about OP enough to understand that Wyatt she did was disgusting and wrong on several levels! \n\nAnd not wanting OP to pull out of the wedding for financial reasons is just next level shitty friend.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I always warn people about my emetophobia (phobia of vomit/vomiting) if I'm going to be drinking with them. \n\nI've never once had a person who was upset by that or tried to weaponize it. Everyone has been understanding and makes sure to reassure me they feel okay, or stop taking shots if I start having a panic attack over that (usually shots set me off in a way that mixed drinks or beer or wine don't). I feel bad that they modify their behavior to accommodate my phobia, but it's greatly appreciated. \n\nAfter breaking up with my ex I had a nightmare about him chasing me down and puking on me. I had a horrible panic attack over the dream. I can't imagine how bad OP must have felt about being triggered in real life. The fact that someone did it intentionally is horrifying to me.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "This and I would think about more why she had this so readily available",
          "id": 40,
          "comments": [
            {
              "score": 25,
              "content": "I'd guess that her silence in the chat was when she was grabbing the picture. You can find unsettling t-phobia pictures on Google in 30 seconds, especially when you know exactly what triggers someone.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This is a classic example of people not understanding the difference between a fear and a phobia. \n\nI'm afraid of or have a FEAR of most spiders. I find their movement very unsettling and would rather not see one. If I do see one though I can take action by killing it or catching it and letting it out or ignoring it until I can't see it anymore. I can hold and pet a tarantula fine.\n\nI have a PHOBIA of moths. I pass out if one touches me. I avoid lights at night and won't leave my porch light on for the same reason. I'll walk home in the dark. I get very panicky when I see one, have extreme panic attacks when near one or when one is trapped in a space with me. I'll avoid whole rooms if I saw a moth in there and won't enter them no matter what if I haven't seen evidence it's been caught or killed. I'll then be unsettled and jumpy for days afterwards from the experience. It's a phobia, it comes intense reactions to the stimulus that I can't control.\n\nPhobias are not jokes and shouldn't be taken lightly but sadly most people don't seem to understand that. NTA OP. You don't want to be attached to someone who would weaponize your phobia as the other redditor rightly pointed out.",
          "id": 42,
          "comments": [
            {
              "score": 1,
              "content": "Bruh. We should hang out-I’ll handle moths for you if you squish my spiders. \n\nMoths are an annoyance, but I’ve had to give away whole bedding sets for fear of it possibly maybe having a spider in it at one point.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Beautifully put!",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2000,
      "content": "NTA.\n\nYou do _not_ trigger a phobia, no matter how much of a \"grump\" the person with the phobia is being.\n\nIf she can't understand that, you are much better off without her.",
      "id": 45,
      "comments": [
        {
          "score": 516,
          "content": "It sounds like OP wasn't being a grump. She wasn't as stressed as the bride and for some reason that made the bride angry.",
          "id": 46,
          "comments": [
            {
              "score": 229,
              "content": "[deleted]",
              "id": 47,
              "comments": [
                {
                  "score": 121,
                  "content": "Which is just bonkers in general. When my sister got married I wasn't nearly as stressed - it wasn't my wedding! What tf did I have to be that stressed about?",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Tell her, next time you show me a phobia photo I'll show you a picture of your fiance having sex with one of the bridesmaids",
          "id": 49,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1156,
      "content": "NTA\n\nWHAT THE FRICK?!?!?!?!?!\n\nYou don't just casually trigger someone's phobia as retaliation.  You don't intentionally trigger someone's phobia - ever.  This was a direct attack against your mental health, and you are well within your rights to put your safety over any obligations you may have had to this hazardous, abusive \"friend\".  Especially if she doesn't get why her actions were so eggregious.",
      "id": 50,
      "comments": [
        {
          "score": 35,
          "content": "NTA \n\nExactly this! That’s definitely abusive and dangerous.If she’s willing to simply trigger your phobia because you are relaxed and she is stressed, then she’s honestly insane! \n\nWhat kind of person does that? Definitely time to drop her as well as block everyone who is blowing up your phone. Continue to relax. \n\nHonestly going to a wedding where most of the people there will be coming from a large Hot zone, is not advisable anyway. Especially considering you live somewhere that is not a hot zone. \n\nSo basically you dropped an abusive ‘friend’ and you won’t be going to a place that is filled with Covid. I’d say that’s a win all around.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yep, this. I have a friend with a phobia of dolls, it was mentioned once years back and never came up again. Not terribly long ago I shared something in our group chat that included a picture of dolls as part of a meme. Later, maybe an hour or two, I remembered and contacted my friend completely apologetic. I felt like shit. Friend laughed, said it was ok, bc of how the image and text were it wasn't bad. But you can bet that is burned in my mind and I won't forget again!",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 524,
      "content": "NTA at all!!! Shes sounds horrible, just because you're relatively relaxed doesn't mean she can do that to you when she knows the extent of your phobia. \n\nStay away from her until she can respect you",
      "id": 53,
      "comments": [
        {
          "score": 5,
          "content": "All of this. \n\nI don’t think she should give a rats behind about how close it is to the wedding. She purposefully caused emotional distress and there is literally NO excuse for this. None. I’d say”good riddance” and block them all.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 470,
      "content": "NTA. Firstly, whether or not you are stressed is irrelevant, your stress helps nobody. Whether you are HELPING is relevant. You offered to help, but that wasn't enough for this lady. Apparently nobody is allowed to be relaxed if she isn't, so she did something she knew would stress you out. What a disgusting toxic mindset.\n\nSecond, there are people in the world who enjoy power trips and your friends sounds like one of them. My sister is the same. She insists on \"selflessly\" organising all the family parties and the week running up to each event is always a screaming nightmare because she enjoys the opportunity to bully and insult everyone around her, knowing they will kowtow and not stand up to her because if they do, she will pull the \"WhY aRe YoU rUiNiNg NiCe UnClE fReD's BiRtHdAy, DoN't YoU lOvE aNyOnE eXcEpT yOuRsElF yOu SeLfIsH mOnStEr\" card. And everyone else in the family will either back her up or \"not get involved\" because they don't want her ragehose turned on them. These people can get in the sea.\n\nDefinitely ditch the wedding. Consider ditching the whole friend.",
      "id": 55,
      "comments": [
        {
          "score": 126,
          "content": "Ditching the \"friend\" shouldn't even be a question. She's not a friend and OP would be better off without her.",
          "id": 56,
          "comments": [
            {
              "score": 2,
              "content": "[removed]",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "\"I'm not. You are.\" is probably how I would respond to something like that. Lol. Ouch.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 439,
      "content": "[deleted]",
      "id": 59,
      "comments": [
        {
          "score": 139,
          "content": "Also, who the fuck does that??\n\n*Hey, you're not stressed...let's just cause you undue stress and anxiety in a matter of seconds!*\n\n??????????????????????????????????\n\nFuck that noise. \n\nNTA.",
          "id": 60,
          "comments": [
            {
              "score": 46,
              "content": "And in the middle of a pandemic where everyone's default state is stressed and anxious. Would be an aashole move at any time but right now it's double asshole. Ex besite is a deluxe douchenozzle and OP is definitely better off without her.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Why would anyone be stressed about their friend's wedding anyway? Is this more toxic bullshit from american wedding culture? I've been to friends' weddings before and no one ever expected me to be at all stressed, given that I wasn't the one having a wedding and all that.",
          "id": 62,
          "comments": [
            {
              "score": 3,
              "content": "No clue. I'm Canadian and I honestly haven't been to many weddings. I know I wasn't stressed when my cousin was getting married, I was just there for her if she needed someone to vent to if things were being stressful.",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "The toxic American wedding culture is totally bizarre, and I’m American! Fortunately, the type of people who buy into this are the same people who buy into drama in general and are easy to avoid. I wasn’t even stressed about my own wedding!",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "OP please please please cut this toxic person out from your life! Please!!!",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 231,
      "content": "1.\tNTA If bridezilla didn’t want the expensive hassle of rearranging her wedding, she should’ve thought about the consequences of her actions. \n2.\tI am very curious to know what happened on this thread.",
      "id": 66,
      "comments": [
        {
          "score": 58,
          "content": "I think a mod might be in a take-downy mood because the last couple threads I read were also half redacted. \n\nI am so curious!!",
          "id": 67,
          "comments": [
            {
              "score": 80,
              "content": "Someone created a spam bot, that’s probably what you’re seeing. This isn't us deleting comments!",
              "id": 68,
              "comments": [
                {
                  "score": 5,
                  "content": "Thanks for replying! That makes a lot more sense.",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "I second you second comment.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 117,
      "content": "NTA. \"Too relaxed\"?? What is that bullshit jealousy about? If she wants you to help, ask for help. If she thinks you're not putting the effort into the things she's asked you to do, she should say that. But if she hasn't ask you for help them why is she causing issues??? Even if you were being lazy in your duties, sending a picture just to upset you is such childish behaviour - way too childish for someone who is old enough to be getting married. End the friendship completely.",
      "id": 71,
      "comments": [
        {
          "score": 25,
          "content": "I thought this, what is Bride going to do when her husband isn't doing something she wants? Is she going to mentally abuse him too? \"He deserved it, he provoked me\". If she thinks this is acceptable behaviour then she's not mature enough to get married x\n\nEdit: Changed word 'old' to 'mature'",
          "id": 72,
          "comments": [
            {
              "score": 8,
              "content": "My parents are this toxic. When one is having a bad day they abuse the other until they too are having a bad day. They can't let their spouse just be happy if they're in a pissy mood.",
              "id": 73,
              "comments": [
                {
                  "score": 1,
                  "content": "That's crappy... When I'm having a bad day DH is the one that can make me feel better and vice versa. Its such a shame that people do this to each other x",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 76,
          "comments": [
            {
              "score": 1,
              "content": "[removed]",
              "id": 77,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 88,
      "content": "NTA. Everyone else has covered the why, so I just want to say that the idea that a bridesmaid dropping out would cost money or delay the wedding is laughable.",
      "id": 78,
      "comments": [
        {
          "score": 10,
          "content": "Dude what happened in this thread??",
          "id": 79,
          "comments": [
            {
              "score": 5,
              "content": "I want to know as well",
              "id": 80,
              "comments": [
                {
                  "score": 13,
                  "content": "Mods said there’s a new spam bot that popped up and they had to get rid of a ton of comments.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Ahhh that makes sense",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "This exactly. \n\nI had a bridesmaid drop out (she felt she should have been maid of honor.) It literally did not change one thing about my wedding except there was one less bridesmaid. No delay or extra expense. I doubt hardly anyone even noticed there was one more groomsmen. And if they did, so what?",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 84,
          "comments": [
            {
              "score": 1,
              "content": "[removed]",
              "id": 85,
              "comments": [
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 86,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 89,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 90,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "[removed]",
              "id": 92,
              "comments": [
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "[removed]",
              "id": 94,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "[removed]",
              "id": 95,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 72,
      "content": "> I said I'm not comfortable attending her wedding anymore, and now I got everyone blowing up my phone saying I can't do that when it's so close to the wedding. Changes can be expensive and possibly delay the wedding, but I feel that I deserve basic respect. \n\nNTA, now is actually the best time to do it. It'll ensure your ex-bf experiences some lasting memorable consequences for being a massive. Perhaps that's petty, but to be perfectly frank people don't exactly grow out of their consequence based learning routines, they just get pissy when it's employed. Your Ex-bf did something shitty because you looked \"relaxed\" and that was some how a slight against her, which is kind of very psychotic on her part.",
      "id": 96,
      "comments": [
        {
          "score": 1,
          "content": "[removed]",
          "id": 97,
          "comments": [
            {
              "score": 1,
              "content": "[removed]",
              "id": 98,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 99,
          "comments": [
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 100,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}