{
  "post content": "I (26F) have been with my boyfriend Sean (25M) for about a year and a half. It's been great, but I let him know from the outset that I was a recovering alcoholic. He had no problem with that, and he still drinks with his friends, but won't do that in my presence. It still bothers me that he drinks, but it's his life, I can't tell him what to do.\n\nFast forward to last Sunday, and we're at his apartment. I come in, and he's in the middle of making pasta sauce, and there's a large bottle of vodka on the counter. I didn't say anything about the bottle, but he saw me staring at it, and he told me it's for the sauce.\n\nPasta sauce he's made me at least twice a month for the entirety of our relationship.\n\nHe said he's told me from the beginning he does that, that it cooks away, but I think that would be something I would very much remember, and I got a little angry. I knocked the bottle off the counter and went to my mom's.\n\nHe's called and apologized for triggering me, and that he was being brainless, but he wants me to pay for the broken bottle, which he says was about an $80 brand. I told him that I wasn't under any circumstances going to pay for something he's been lacing my food with for years.\n\nWe haven't really talked since, and my mom wants me to just go ahead and buy the thing to make amends, and I'm still refusing. AITA?\n\nEdit: I didn't smash the bottle, I pushed it off the counter and it broke. I didn't throw it.  \nEdit2: alright, I get it. I'm going to get him $80 worth of stuff to make up for it. But I really don't appreciate being called violent or abusive. I've never hit him once, and I think that's a pretty rash assumption.  \n",
  "id": 1,
  "comments": [
    {
      "score": 41896,
      "content": "YTA. Adults use their mouths to communicate. “Hey I’m not comfortable with you cooking with alcohol and having alcohol in my presence at all. I thought you were aware of that and would like to respect my preference.”\n\nYou went “me no likey me go smash smash”.",
      "id": 2,
      "comments": [
        {
          "score": 14455,
          "content": "The edit lmao\n\nShe didn't smash it though, she just hit it off the counter, not her fault if the bottle breaks when falling from a height lolol",
          "id": 3,
          "comments": [
            {
              "score": 25984,
              "content": "It’s his fault he should have known he was dating a cat\n\nEdited to add: thank you for the awards :)",
              "id": 4,
              "comments": [
                {
                  "score": 3058,
                  "content": "This comment did me in. I can't stop laughing",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2550,
                      "content": "Me either! I’m picturing OP holding eye contact and pushing the bottle inch at a time and then flicking her tail at him as she stalks off!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "I'm rolling 😂😂 scared the shit out of my husband when I read \"me no likey me go smash smash\" and then the rest of em killed me over 😂😂",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Same. So\nMuch giggle",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1873,
                  "content": "All I can picture is that video of the lawyer who couldn't get the cat filter off when he had a zoom meeting with the court, lol.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 1051,
                      "content": "Ah, one of the few highlights of 2020! 'I promise I'm not a cat!' *cackles in the corner*",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 747,
                      "content": "That whole thing was funny but the best part was the distressed look that he had while trying to figure out how to fix it was coming through in the filter. So there was this stressed out cat claiming he wasn’t a cat. Lol. Hilarious.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 212,
                      "content": "I had no clue what this comment was about. I looked up the video just now and could not stop laughing! My husband had to ask me if I was okay!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 170,
                      "content": "My favorite lawyer!  I did appearances for most of 2020 remotely and the biggest problem we had was that people failed to mute or would call in and fail to mute their computer.  Sadly no cat filters.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Best pandemic moment for me.  Make me laugh every time I saw it.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I love the dude that is absolutely paying no attention at all.  Then he hears the words cat filter and opens his eyes leans forward and chuckles like welp I just won this case.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "That was hilarious 😂",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Oh please link",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Omg I haven’t seen it, would you mind linking it? Thanks!",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Thank you for that!! Somehow I missed that one altogether, and it gave me a wonderful giggle before work! :)",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 622,
                  "content": "Everybody wants a cat girl till they’re swiping your $80 bottle of vodka off the counter",
                  "id": 20,
                  "comments": [
                    {
                      "score": 468,
                      "content": "... Big Kitty Goth Girlfriend. \n\nSounded better in my head, but I felt like I should say it 😂😂",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 442,
                  "content": "Enjoy your kitty award! Also alcohol cooks off. I get it’s triggering in a recovering addict so I get it but yeah someone needs to use their words.  \n\nOP YTA",
                  "id": 22,
                  "comments": [
                    {
                      "score": 301,
                      "content": "OP is YTA but alcohol doesn't always cook off.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 152,
                      "content": "Not all recovering alcoholics want the exposure though. I went to a restaurant that has a great cake made w alcohol with a recovering alcoholic who announced they weren't having it. No idea why the announcement but it was clearly not an option for them.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 137,
                  "content": "Maureen Ponderosa?",
                  "id": 25,
                  "comments": [
                    {
                      "score": 7,
                      "content": "\"I shouldn't have to pay alimony...to a GOD DAMN CAT!!\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 102,
                  "content": "Haa haa haa good one! You are behaving like a child OP. YTA.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 86,
                  "content": "This was my first thought! \n\nBut even my cat is better at vocalizing her needs than this OP…\n\nYTA",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "I cackled at this, thank you.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1059,
              "content": "Right?! I didn’t throw my baby off the balcony Your Honor; I merely smacked him and he fell over the railing.",
              "id": 30,
              "comments": [
                {
                  "score": 328,
                  "content": "I'm going to hell for all the horrible things I laugh about on Reddit",
                  "id": 31,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Right there with you",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "It’s gonna be a hell of a party!  ;D",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 53,
                  "content": "You aggressively nudged him.",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 729,
              "content": "\"I didn't smash your vodka! *The floor* smashed your vodka!\"\n\nYTA.",
              "id": 35,
              "comments": [
                {
                  "score": 22,
                  "content": "Vodka smashes me all the time.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I get smashed while on Vodka",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Don’t forget about the floor’s accomplice, gravity.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "\"I didn't do anything it's all Gravity's Fault\" - OP Probably",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 349,
              "content": "Technically speaking it did not break when falling…was the landing that was the problem.  BF failed to catch it after all, so maybe he is just as guilty of the terminal event.",
              "id": 40,
              "comments": [
                {
                  "score": 267,
                  "content": "“The speed isn’t dangerous, it’s the suddenly becoming stationary that causes problems”",
                  "id": 41,
                  "comments": [
                    {
                      "score": 143,
                      "content": "Reminds me of a character in Terry Pratchett’s Discworld who was afraid of grounds, not heights as it’s the ground that does the damage.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 252,
              "content": "In college, one of my friends was leaning over the balcony in his room at the frat house, absolutely hammered and suddenly said “what do you think would happen if I dropped this beer bottle off the balcony right now?” And we were all like “what do you mean what would happen? It would break.” Then he did it anyways and it fell a story and shattered on the balcony below his, where a very confused frat brother immediately poked his head out and was like “wtf was that crash?”\n\nAnyways her edit reminds me of my hammered friend. “What do you think will happen if I swipe the whole glass bottle off the counter?” Girl! It breaks! Duh!",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 207,
              "content": "Yeah, cause yah know..vodka, like bumbles, bounce.",
              "id": 44,
              "comments": [
                {
                  "score": 15,
                  "content": "Yukon Cornelius is so proud of you.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I'm laughing at the vision of a claymation vodka bottle bouncing end over end on the floor",
                  "id": 46,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Then my work here is done ;)",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My family’s newest yearly tradition is watching Rudolph and commenting about the dickish behavior of most of the reindeer/Santa/the Head Elf, the blatant misogyny (why doesn’t Rudolph’s mom have a name?), and the blatant fact that Hermey is a human.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Spoiler alert, OP is a cat…tap, tap",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Damn gravity!",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Also her edit with her not being abusive because she never hit him.\n\nOP do you know what emotional abuse is. \n\nAnd giving him 80 dollars of stuff instead of giving him the 80 dollars is also immature. Judging him for drinking alcohol when you are not around is also immature, and sounds like you want to control him.",
              "id": 51,
              "comments": [
                {
                  "score": 9,
                  "content": "Facts! Abuse is past laying hands on someone!\n\nMental abuse\nPhysical abuse\nEmotional abuse\nAnd sexual abuse is all abuse.\n\nIt's abusive to break things that aren't yours, it's abusive to throw a pissy fit like this! If a man did this he'd absolutely get raw dogged for being a shit man and everyone would be talking the women into leaving.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "It's gravity's fault! Mean old Mr gravity is the clear AH here",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1684,
          "content": "I love how OP glides right past the fact she destroyed her BF's property too. 'I don't have to replace the thing I broke because you shouldn't have had it around me!'. \n\nI'm also in recovery, but who doesn't recognize a vodka sauce? 'Spiking her food for years' is a stretch to me. It gets to a point of willful ignorance. Or 'dipping the pasta in sauce then washing it off, so only the essence of the sauce is left'. 🙄\n\nIf I broke the bottle my friends or family was using I'd replace it immediately, or give them funds to do so if I wasn't comfortable getting it myself. All with sincere apologies. If someone broke the bottle I was using to cook them a meal, I'd demand an immediate replacement. \n\nI'd never push it off the counter like a cat and flounce off. YTA OP.",
          "id": 54,
          "comments": [
            {
              "score": 549,
              "content": "[deleted]",
              "id": 55,
              "comments": [
                {
                  "score": 1083,
                  "content": "For alcoholics, it's not just the alcohol. Coq au Vin and other, similar dishes smell heavily of wine or liquor. Even my borracho beans have a beer-like smell after simmering for an hour. The smell can trigger cravings almost more than the taste can. \n\nVodka sauce (to me) doesn't have that strong aroma you get from red wine, run, and brandy. So she may have not realized it due to brain farts or he might have said \"pink sauce.\" \n\nWhen you're in recovery, you're told not to consume any alcohol in any form. From a food preparation perspective, this can even extend to vanilla extract in some cases. A family member has been sober for 25+ years and still would not eat something cooked in alcohol. I doubt she and her wife ever have any alcohol in their house, even for guests, although she can be around people drinking. \n\nYou have to prepare the food as if they have a deadly allergy. Because they do.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 827,
                      "content": "Thank you! I can’t believe I had to go this far down to find this. Obviously OP was way out of line and is an A H. But part of the danger of cooking with alcohol is having it present and accessible, smelling and looking like booze. I’m in recovery and having anything nearby is a massive trigger. \n\nI also don’t buy for a second that this guy mentioned the vodka was in the sauce. Knowing he had vodka in his place? She would think of it every single time she visited. He either managed to forget over and over, to tell his gf about the sauce, or he doesn’t think it’s a big deal and decided, without her consent, that what she didn’t know wouldn’t hurt her. I’m honestly kind of horrified that people are letting him off the hook so thoroughly—OP deserves the chance to consent or not. \n\nESH",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "As sometime with an alcohol allergy. This right here.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Thank you for this information. My ex is an alcoholic and I never knew that he couldn't have food that was cooked with alcohol. I always assumed that since the alcohol burned off that it was okay. I didn't even think about the aroma and flavor that is left behind. Again, thank you.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Or she may have never eaten vodka sauce, like me. I wouldnt recognize the flavor of a vodka sauce and would have no clue what i was eating until my throat started closing...",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 383,
                  "content": "It may cook off but for an alcoholic, just knowing that you are eating food prepared with alcohol can be enough of a mental slip as to create a craving for real alcohol. The fact that her bf would expose her to this potentially life threatening temptation is beyond the pale. Alcohol can be the best food additive since salt but if an alcoholic doesn’t want to be exposed to it, that’s their prerogative. I personally think he should be so ashamed of betraying his gf’s trust that he begs for her forgivenesses.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 295,
                  "content": "It takes about 3 hours to cook off the alcohol. If he's making vodka sauce with the vodka right there, it's cooking 15 minutes max, so there is still about 40% of the alcohol remaining.\n\nhttps://www.isu.edu/news/2019-fall/no-worries-the-alcohol-burns-off-during-cookingbut-does-it-really.html",
                  "id": 62,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Everytime I make vodka sauce it takes abput 4 hours so...",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Since it became such a thing, alcohol-free vanilla extract does exist. The carrier is glycerin instead of alcohol.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 234,
                  "content": "Addiction is just as much a mental component as it is physical. He betrayed her trust by slipping it into her food.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 44,
                      "content": "\"Slipping it into her food\" makes it sound like he deliberately deceived her. He was under the impression she was fine with it, so it was a misunderstanding.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "He didn’t slip it into her food. The sauce is literally called vodka sauce. What did she think was in it?",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 148,
                  "content": "The alcohol lasts longer than you’d think. To get rid of all of it in vodka sauce, you’d have to simmer the sauce for a few hours.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 13,
                      "content": "So you're quite wrong to a degree, I've cooked in restaurants making vodka pene, how it works is it takes 15 minutes(per oz) for the alcohol to evaporate in a sauce if he made enough for 2 people that's 2 oz 30 to simmer and the startch from the vodka is In the sauce properly.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 84,
                  "content": "It doesn't matter that it burns off and we only have BF's word that he cooked it long enough, or at high enough temps to do that. People can be triggered by the taste, or even the idea that they just swallowed the drug to which they are addicted.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "while i don't agree with girlfriend [according to recent studies](https://culinarylore.com/food-science:alcohol-doesnt-completely-burn-off-in-cooking/#:~:text=It%20is%20common%20knowledge%2C%20for%20example%2C%20that%20when,1%20we%20know%20that%20this%20is%20not%20true) not all the alcohol burns off in cooking. not for your standard dish anyways. it depends on how long and how you cook it. from the source \n\n&#x200B;\n\n\"The idea that you will get intoxicated from alcohol used in say, a vodka sauce for pasta, or some dish with wine in it, is poppycock! Why? First of all, let’s look at what the research says. If you add wine, or any other source of alcohol to a boiling liquid, and then stop cooking it by removing it from the heat, 85% of the alcohol will remain. This is the point where most people seem to stop recounting the facts. However, if you continue simmering for 15 minutes, 40% of the alcohol will remain. That means that 60% of the alcohol is gone (this counts as most, in my book). After around half an hour, 35% will remain. After one hour, 25%. One and a half hours, 20%. Two hours, 10%. Two and a half, 5%. As you continue simmering, there are diminishing returns on the alcohol removal, but after 3 hours it is safe to say that most of the alcohol is gone. Different methods of cooking, and when, precisely, you add the alcohol, will change the amount lost and the time it takes.\"\n\n&#x200B;\n\naccording to the USDA you would need to bake or simmer a dish/sauce for up to 2.5 hours  to get rid of 95% of alcohol. \n\n&#x200B;\n\nnow, you Arnt going to get drunk, unless you're adding a ton, and eating a ton, but  in most dishes that are prepared with alcohol, you are going to consuming some actually alcohol, not just the flavor.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I think ur missing the point that alcoholism is also a mental problem. Even if she’s not getting drunk, a substance that clearly had a very negative impact has been put into her food without her knowledge. Ya she Shouldn’t of smashed the bottle necessarily but what idiot would think that serving your recovering alcoholic gf food w alcohol in it would be ok without asking them first..?",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 151,
              "content": "Ahhhh essence of tomato I understand that reference",
              "id": 73,
              "comments": [
                {
                  "score": 67,
                  "content": "Glad someone did. I'm having strong 'essence of tomato' feelings about this post!",
                  "id": 74,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I still think about that post sometimes lmao",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "My biggest problem is who cooks with $80 vodka?? You can cook with $5 vodka and you won’t taste the difference in a sauce",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I had forgotten about essence of the sauce omg",
              "id": 77,
              "comments": [
                {
                  "score": 14,
                  "content": "How could you forget the pinnacle of stupidity that was 'the essence of sauce'? It's a marvel!",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Not to mention he literally made no effort to hide it from her - which supports his story that they *did* have a conversation about this, and she was fine with it.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "> dipping the pasta in sauce then washing it off, so only the essence of the sauce is left'. \n\nOmg I remember that ridiculous post...",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1340,
          "content": "Breaking your partner's possessions can be a precursor to abuse or abuse itself (and yes, that includes pushing it off the counter instead of smashing it). It's not a healthy way to deal with disagreements.",
          "id": 81,
          "comments": [
            {
              "score": 428,
              "content": "[removed]",
              "id": 82,
              "comments": [
                {
                  "score": 196,
                  "content": "I know you know this but I need to remind you:none of that was your fault! Not even remotely.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 18,
                      "content": "💕",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Glad you ditched him, that guy is a MESS.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "It *often* is. Because it's a sign that you have anger problems, that you externalise your anger instead of internalising it, and that you have no concept of healthy problem solving, or no ability to enact it once your emotions are involved.\n\nSmashing your partner's possessions is a *massive* indicator of future abuse. Worse still, it's an indicator that it's probably not far away - because the abusive partner is *already* beginning to escalate. Any psychologist would be telling OP's partner to run right about now.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Someone who denies conversations ever happened when those conversations having happened would mean they were in the wrong is also a sign of an abusive relationship.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Her comment about being bothered by her boyfriend consuming alcohol when he's not with her was also a red flag to me. The comment added nothing to the story, there was no reason to include it other than to tell us she judges him for it and doesn't like that he hasn't taken on her entire lifestyle when she's not around.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Exactly. In fact, breaking things / throwing things etc., does constitute physical AND emotional violence. Not only because of the precursor factor, but also because it’s threatening behavior.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "But OP has never hit her boyfriend! She can’t possibly be violent or abusive! The bottle just…fell",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 260,
          "content": "Nah this made me laugh 💀",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "I'm so confused. The point of putting alcohol in is to enhance the taste (and smell) of the food, right? And as a recovering alcoholic, I imagine OP is at least somewhat familiar with the taste or smell of vodka.\n\nWas he just sneaky about cooking with alcohol? Like they've been together for a year and a half, is this the first time she's ever seen him cook? Or is he just strategic about when he cooks with alcohol?\n\nAssuming this isn't the first time he's cooked this vodka pasta for OP, surely she had to have noticed something was off. Vodka sauces (from what I can see) typically cook for 15-30 minutes, which means a little 40% of the alcohol remains. I would have thought she'd pick up on that, considering most recipes had 1/2-1/4 cup of vodka.",
          "id": 92,
          "comments": [
            {
              "score": 327,
              "content": "The best vodka sauce recipe I've ever had only uses 2 tablespoons of vodka and you cook it all off. Boyfriend could be using a similar recipe, as you can't really taste the vodka.",
              "id": 93,
              "comments": [
                {
                  "score": 26,
                  "content": "Mine takes 2 tablespoons to feed a ton of people.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yep I make a vodka pasta sauce it’s uses 30ml and cook it for a while to burn it off. Makes a beautiful sauce.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Sincere question bc I am a cooking novice.  What is the benefit of adding the vodka if you can't taste it?",
                  "id": 96,
                  "comments": [
                    {
                      "score": 60,
                      "content": "It's not the vodka's taste. Alcohol is a great solvent, it can help dissolve compounds like spices and make the dish more flavourful. In a sauce that uses both fat and water (most sauces) it can act as an emulsifier, as it dissolves in both fat and water, stabilising the sauce and making it less likely to split.\n\nIn this scenario, vodka is being used because of the neutral flavour. Its being used to enhance the flavours that are already there, not add more.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "It does change the flavor of.the sauce, but your sauce doesn't taste like vodka if that makes sense. Unless you do what I did and follow the first recipe I found that called for a cup of vodka. That was way too much and tasted like vodka.",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I'm VERY familiar with the taste of vodka because it's my favorite in mixed drinks, and I think it wasn't until I tried to make penna alla vodka myself and was tasting the sauce as it was cooking that I was ever able to taste any alcohol in it.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "[deleted]",
              "id": 100,
              "comments": [
                {
                  "score": 174,
                  "content": "This answers my question about why he was using $80 vodka to cook with.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 142,
                      "content": "As a rule, you should cook with the alcohol you would drink.  The whole myth of cooking with wine that's cheap is a terrible idea, because the *taste of the wine* is what you're adding to the dish.  You should add the alcohol you prefer to drink, so that you add the taste that you like.\n\nThat aside, probably just used the vodka he had on hand - most vodka sauces call for a few tablespoons at most, you're not going to buy a whole bottle of cheaper vodka for that.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 68,
                      "content": "Haha, I walked into a liquor store last week and asked for one of the small flask-sized bottles behind the counter - “the cheapest vodka you’ve got; it’s just for cooking”.\n\nThey handed me a brand I’d never heard of that was $5 - in New Jersey. The employee at the counter was an older lady and cracked up at my confusion looking at the bottle, especially when I was like, “hmmm… looks like something teenagers sneak to get drunk… ok, maybe I’m being a snob, but can I please have a *slightly* classier vodka for my sauce?” 😂😂",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "Both Serious Eats and America's Test Kitchen tested various vodka brands for penne Alla vodka and found premium brands made a noticeable difference. They also found filtering mid-level brands through a paper coffee filter several times improved their results.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I don't use cheap alcohol to cook. Even beer brats need a good beer.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I’ve never cooked with vodka specifically, but I was taught to cook with good wine/alcohol when cooking.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 125,
              "content": "Vodka sauce doesn't taste like vodka, that would be disgusting... it brings out the flavors of the other ingredients. 40% of the alcohol is left, but if you use a half cup of vodka (4 shots) for a recipe that serves 6, it will cook down to 1.6 shots. That's less than 1 tablespoon of alcohol per serving and the dish is like 90% pasta. Nobody's gonna get drunk, unless they're a total lightweight and drink ALL of the sauce by itself",
              "id": 107,
              "comments": [
                {
                  "score": 9,
                  "content": "Also most recipes ask for 2 tablespoons not half a cup so you couldn't even tell vodka had ever been in the sauce",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Can you ELI5 how the vodka works? I do love a good vodka sauce but don't understand as it is a neutral grain spirit",
                  "id": 109,
                  "comments": [
                    {
                      "score": 28,
                      "content": "[deleted]",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Not really. You shouldn't be able to taste vodka when eating the sauce or you made it wrong. It should be creamy and rich and a little sweet. You should not be able to tell there is vodka in it.\n\nYou only use a small amount of alcohol, and the vodka helps the sauce from becoming too watery. It's not so much to do with the flavor (though it does help) but the composition of the sauce itself. There's some weird science behind it, but it's more for stability and solubility.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I've never tasted vodka in vodka pasta sauce at home or in a restaurant (or wine, which I add it to my pasta sauce just like Clemenza in The Godfather)",
              "id": 112,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Also like\n\nI know several recovering alcoholics. A *big* part of the recovery process is learning to accept that you *can't* actually tell people not to have alcohol in your presence. That it's not your right to control what other people do, and it's not their responsibility to remove temptations from your life. It's *your* responsibility to not slip back into addictive behaviour.\n\nOP doesn't seem to be grasping this yet. They're actively upset that their partner still drinks, and they smashed a bottle because they found out there was alcohol in their presence.Methinks they are *not* as recovered as they think they are. This sounds like someone who is still very much in the throes of addiction, who is still trying to deflect and make it everyone else's responsibility to ensure they don't drink.  \n OP: It is *your* responsibility. No one else's. Your addiction is *your* problem, not your partner's. Until you get that through your head, you will never recover.",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "[removed]",
          "id": 114,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "What bothers me is how she said he's been \"lacing\" her food with vodka, as if he was sprinkling in some drug to rape her or something.\n\nVodka is used for sauces, and it doesn't have any negative impact on health, so calling it \"lacing\" is...",
          "id": 115,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "The edits. It doesn't sit right with me that now she's going to reinburse him she's saying \"$80 of stuff to make up for it\" instead of giving him the $80 so he can possibly purchase another bottle. You clearly do have a problem with him not having alcohol in his life so you both need to have a discussion about that.",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Agree YTA. Should have remained calm and used adult skills to manage this. It’s fine to get angry but we need to stop when it gets physical.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13347,
      "content": "YTA.  There is no alcohol remaining in the food so he was not \"lacing your food\".  Of course you can ask him not to make that dish in the future if it triggers you.  Still, you destroyed someone else's property and you need to make restitution.",
      "id": 118,
      "comments": [
        {
          "score": 6217,
          "content": "The whole “alcohol cooks away” thing is BS.  In a sauce like penne alla vodka where the alcohol spends little time in the pan, you can have up to 80% of the alcohol still present in the dish.  Alcohol cooks out MUCH less slowly than most people (especially home cooks) realize.  It takes 3 hours of cooking to really get rid of almost all of it.",
          "id": 119,
          "comments": [
            {
              "score": 3853,
              "content": "All of that is fine and you are right; however, what she did was act like a child. He says he communicated, she doesn't remember him saying it, but regardless, that doesn't mean she can just go around pushing stuff off the counter because she is upset.",
              "id": 120,
              "comments": [
                {
                  "score": 2204,
                  "content": "I mean... A recovering alcoholic would remember a mention of a vodka dish. Unless the discussion happened when they were still drinking, I don't think it could've slipped past them. Not that the response was reasonable; she needs therapy.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 978,
                      "content": "Alcoholism can result in permanent memory issues. But so can a bunch of other factors. I can have entire important conversations disappear from memory simply because I was emotional when they happened",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": ">A recovering alcoholic would remember a mention of a vodka dish\n\nI disagree. Just because you are in recovery doesn't make you hypersensitive to those words (it can, just not for everyone). If he said it 1x to her ages ago it's very likely she agreed/said it's fine a\nWhile doing something else similar to the stories others are saying.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1227,
              "content": "Usually anything that cooks for at least fifteen minutes will lose more than 50% of the alcohol content, and it’s also greatly diluted by the presence of all the other ingredients… so on a per serving basis, there’s only a very low presence of alcohol. It’s perfectly safe.\n\nPeople are wrong that the alcohol is *gone*, but its presence is *negligible*.",
              "id": 124,
              "comments": [
                {
                  "score": 492,
                  "content": "And clearly she’s been eating it for a year and a half without issue and only got upset when she realized it was there.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 378,
                      "content": "Edit: this following comment assumes the abstinence alcoholic recovery model\n\nIf she hadn’t immediately destroyed the bottle, I would have said N T A.. I think I would have said N A H if she just got super upset *without* destroying the bottle and just wasn’t sure if it was an overreaction.. alcoholism is a disease one has to deal with daily.. and  as an alcoholic, you might not know what your threshold for the start of the slippery slope is yet\n\nI, too, thought the alcohol totally cooked away (TIL) and he probably did, too.. however, if I was dating an alcoholic, I would be on my toes about anything regarding alcohol whatsoever\n\nShe probably felt very conflicted about herself and what this meant for her recovery now knowing she’s been ingesting alcohol twice a month.. Alcoholics can’t have a sip of alcohol or the days/months/years of being sober starts over.. those chips are a beacon for alcoholics\n\nYes, OP is the AH for destroying the bottle without a second thought and needs to work on the mental health side of alcoholism and not just the restraint side.. She’s also the AH for doubling down on her reaction and thinking it was still right even after the fact. Ultimately, it’s good for one’s SO to be accommodating to their problems, but at the end of the day, one shouldn’t feel entitled to someone else making sure that their problem is kept at bay.. it can only be them.. she should have apologized immediately and recognized she still had some work to do on the psyche side of the disease\n\nBUT ALL THAT SAID, I do also think the “she didn’t even notice” criticism is downplaying the psychological element of the disease a bit",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 193,
                  "content": "Safe doesn't mean she consents.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "It IS negligible, but only because it was negligible to start with. Reducing by 50% (or 60%) isn't really enough of a difference to affect how a recovering alcoholic will feel about it. I can't help but feel that a lot of people here would be reacting differently if he'd been adding a slug of alcohol to the food \\_after\\_ cooking it - even though the alcohol level would be in the same ballpark.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Can't argue her case but from living with a recovering addict, I can say it depends on a lot of factors.\n\nHe can cook with alcohol depending on the dish and he makes sure everything of the light alcoholic beverages is cooked off. His grandmother cooked heavy alcoholic sauses (port sause) and while I wouldn't feel it, my partner would get tipsy.\n\nAlso depending on state of mind, even low alcohol content is enough to push someone of a wagon. No one else except from the recovering person can determine what is safe even if the cook is trusted to prepare decently. If in low state of mind even the tought of the alcohol even if you don't feel or taste it, is enough.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 502,
              "content": "girl give it a rest! you’ve responded to every single person on this thread ffs",
              "id": 130,
              "comments": [
                {
                  "score": 400,
                  "content": "BUT DID YOU KNOW THE ALCOHOL DOESNT COOK OUT OF THE SAUCEEEEEEEEEE\n\n😂😂",
                  "id": 131,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Colteee?",
                      "id": 132,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "Seems reasonable if every single person in this thread spreads wrong information?",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 233,
              "content": "\" It takes 3 hours of cooking to really get rid of almost all of it.\"  That's  an ignorant statement.\n\n&#x200B;\n\nIt really ddepends on the form of the pan and what els is in there. And it tecnically is NEVER \"all of it\" ... but for 99% to be gone it is unlikely to need 3 hours.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 171,
              "content": "This is why ESH is my verdict. \n\nMy father was a recovering alcoholic and sober for the last 15 years of his life.  I'd be furious if someone fed him this without disclosing the alcohol involved, especially knowing his sobriety was so important to him.",
              "id": 135,
              "comments": [
                {
                  "score": 85,
                  "content": "Mine too.  Smashing the expensive bottle of booze was a childish response, but it’s just basic common sense that you shouldn’t be giving a recovering addict their substance of choice.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 163,
              "content": "Okay but let’s be generous and say he made enough for 4 servings- that requires 4tbsp of vodka, or 2 oz (or slightly over one shot of vodka). Standard vodka has alcohol percentage of 40% by volume, which leaves us with 0.8 oz of alcohol overall in this pasta before cooking. If he cooked it for half an hour we’re assuming 35% is left in the pasta, which gives us 0.28 oz of alcohol. In the entire pot of pasta. If you made about 2.5 cups of sauce (20oz), there’s an alcohol content by volume of 1.4%.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "There is also like literally 2 tablespoons of vodka in a recipe of penne alla vodka. It would be the same as eating a chocolate chip cookie with vanilla extract or swishing mouthwash with the amount of alcohol you would consume.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "> It takes 3 hours of cooking to really get rid of almost all of it.\n\nOut of what, a 10 liter pot of liquidey soup on the lowest heat setting? You might be technically correct in some very specific circumstances, but you'll cook out the majority of *all* liquids in a fraction of that time, under most other circumstances.",
              "id": 139,
              "comments": [
                {
                  "score": 13,
                  "content": "This is what's been driving me crazy about this \"3 hours\" statistic, nobody has bothered to cite pan dimensions or surface area or temperature. It's assinine.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Also completely ignored cooking style, and whether the pan is covered or uncovered",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Okay, but even if that's true, you just said that most home cooks don't realize that and he's probably not a professional chef. He made a mistake and apologized for it and promised not to do it again. She did something that I would consider violent in reaction, which is not okay whether you're a recovering alcoholic or not.",
              "id": 142,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "uhhh... food and human nutrition scientist here.\n\nim gonna need some links.\n\nlike this one!\n\n  \n[https://www.sciencedirect.com/science/article/pii/S1878450X16300427](https://www.sciencedirect.com/science/article/pii/S1878450X16300427)  \n\n\nbasically, for most things. 80% of the alcohol is gone within 11 minutes of reaching a boiling temperature.\n\nmost importantly, the MOST they found per serving across a large variety of foods was 1.5 grams of ethanol.\n\nthis is less than 2 ml. \n\nhow this has so many points... it makes me sad because people so clearly just believe a confident person on reddit without actually googling stuff themselves",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7023,
      "content": "YTA\n\nI understand how you feel about it, but breaking the bottle was an inappropriate action. You've obviously not been set back in your recovery by consuming a trace amount of alcohol in cooked food. If he really thought this was OK, he wasn't being malicious. You can set this as a boundary going ahead if you make it through this conflict, but you were out of line to break the bottle. \n\nAs a general rule, when loved ones upset us, breaking things, punching walls, or otherwise physically venting temper in destructive ways is not a good thing.",
      "id": 144,
      "comments": [
        {
          "score": 1781,
          "content": ">breaking things\n\nDidn't you hear?  She didn't break the bottle.  She just pushed it off the counter.  Not her fault gravity exists and the bottle then fell and broke from there.",
          "id": 145,
          "comments": [
            {
              "score": 938,
              "content": "Yeah, this was super amusing to wake up to that update.*eye roll* It's the gravity to blame, not the push.\n\nThat time, my dad rage threw a pan across a room so hard it broke. I didn't realize that he was entirely not responsible for the damage or the psychological effects of his anger. After all, he just hurled the pan. How could he possibly anticipate that an object in motion would stay in motion unless acted upon by an unbalanced force. Dad didn't behave inappropriately when angry. It was Newton's first law of motion all along.",
              "id": 146,
              "comments": [
                {
                  "score": 46,
                  "content": "I’m so sorry.\n\nI would also add that this is not just psychological—it’s physical abuse. \n\nThrowing objects out of rage when another person is present or the person is the cause of the rage, just in any circumstances where someone is going to witness that, is a threat of violence. It puts you in fear for your physical safety. It’s going to make you more likely to do what the person wants, in order to save yourself from being hit with a flying object. It’s going to make you develop a vigilance and watchfulness, make your muscles tense, and physically cause you to do things like recoil in fear or run and hide. \n\nSo IMHO this is both psychological and physical abuse. I say this because a lot of people tend to elevate physical abuse above other kinds of abuse, or tell themselves it wasn’t physical abuse if they weren’t hit, but that doesn’t follow with how we generally treat violence. One way I think of it is to think about how we define crimes. In criminal law generally, crimes often do not distinguish between actual physical violence used and a threat of violence. Like they tend to be written to say something like the crime was committed “by force or threat of force.” \n\nArmed robbery is a good example of a serious crime that often does not involve direct physical violence—holding a gun on someone might not result in any actual physical injuries, but the impact of that threat of physical violence is very real, both psychologically and physically. \n\nAnyway, I just wanted to say that what you described sounds terrifying and awful, and that I agree with your sarcasm about your dad’s gaslighting to minimize the seriousness of it that’s implied in your comment. Fuck that shit. He knew.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah people don’t get how scary the threat of someone throwing something or breaking something actually is. I’ve been in situations where things have been thrown and broken out of anger, and it’s fucking traumatic. You could be just having a general argument where both parties think they are right, but the second they start throwing things, you stop standing up for yourself and blindly agree with whatever they are saying because you are terrified that it will be you they throw something at next. Even if they’ve never done it before, or they’ve never actually thrown anything ‘at you’. You lose a part of yourself out of fear, it’s so messed up.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I know im not comment op but reading this was very validating so thank you",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "This is an argument my cat would make",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Honestly I blame the floor for getting in the way.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "It can in fact just traumatize someone else when you start breaking and hitting shit like OP did. Trauma doesn't excuse us from traumatizing others. OP sounds like they'd also be better off with someone who is also entirely alcohol free or is willing to be. Also therapy would be a good thing to control their trauma response.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This! Also, one does not need to hit someone to be abusive.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5878,
      "content": "INFO: So for the last 30 times hes made you the dish, youve never been in the kitchen?",
      "id": 154,
      "comments": [
        {
          "score": 6079,
          "content": "I really just wanna know who uses an $80 bottle of vodka for sauce though.",
          "id": 155,
          "comments": [
            {
              "score": 2160,
              "content": "Ugh, finally. The real questions being asked.",
              "id": 156,
              "comments": [
                {
                  "score": 331,
                  "content": "People with standards that who",
                  "id": 157,
                  "comments": [
                    {
                      "score": 271,
                      "content": "Literally though. If I'm using vodka for cooking, I don't want it tasting like hand sanitizer.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1240,
              "content": "I'm guessing he mainly bought it for making drinks and then used what he had on hand for cooking.",
              "id": 159,
              "comments": [
                {
                  "score": 248,
                  "content": "He makes it twice a month.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 703,
                      "content": "Vodka sauce usually uses 2 tablespoons of vodka. No need to buy a cheaper bottle for 4 tablespoons of vodka per month.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 427,
                      "content": "Then he clearly ran out of the cheap stuff before he went shopping, very simple.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 55,
                  "content": "One for the sauce, one for me...",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 575,
              "content": "Me. I don’t drink (at all; pancreatitis sucks) and I have a rule of “only cook with liquor you would be happy to drink or serve.” So I buy the good stuff, and it lasts forever - plus it’s nice for guests ☺️",
              "id": 164,
              "comments": [
                {
                  "score": 224,
                  "content": "Truth. I was once gifted a cheap homemade red wine and I’m a white drinker, so used it to make a moose bourguignon. I had a small glass of what was left and it was one of the best wines I ever had. I was distraught that I wasted it in food, until I tried the dish and it was phenomenal. I’ve lived by your rule ever since!",
                  "id": 165,
                  "comments": [
                    {
                      "score": 24,
                      "content": "A moose what now?! That sounds delicious! How does moose taste compared to beef, venison, or lamb?",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Oh man I always take a sip of a new wine before I try cooking with it.  Glad your bourguignon came out well though!",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 153,
              "content": "I know it’s hard to believe but a lot of people do. Every year for Christmas we make short ribs and what adds the amazing flavor is the $150 bourbon we use to marinate them. We literally only use it for this yearly dish. Like I don’t even drink anything that expensive.",
              "id": 168,
              "comments": [
                {
                  "score": 6,
                  "content": "Recipe please!",
                  "id": 169,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 126,
              "content": "People who are *serious* about their cooking",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "You use roughly a 1/4c per quart of sauce,  you don’t use much at all.",
              "id": 171,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I do because it makes no sense for me to go out and buy another bottle for cooking when I only need a few tablespoons.",
              "id": 172,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Because the recipes for vodka sauce typically only call for 2 tablespoons of vodka. Why would someone bother to buy a whole separate bottle for 2 tablespoons; just use whatever bottle you have on hand?",
              "id": 173,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I use good wine for cooking so I don’t think it’s that out there. If I wouldn’t drink it, I’m not gonna put it in my food and risk not liking the taste",
              "id": 174,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Good ingredients make good food?  (Me: uses the absolute cheapest shit alcohol to cook with)",
              "id": 175,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 584,
          "content": "INFO: Did he really never tell you that you what you were eating (I.e., vodka sauce) before?  Like, “wow, what delicious marinara or aurora sauce” and he’d reply, “oh, it’s vodka sauce”.",
          "id": 176,
          "comments": [
            {
              "score": 157,
              "content": "Maybe she thought it was like Panda Express, whose food isn’t actually made with real panda.",
              "id": 177,
              "comments": [
                {
                  "score": 22,
                  "content": "It’s NOT?  What??",
                  "id": 178,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Don’t worry, it’s imitation panda which tastes just as good.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I mean in my house all sauce is pretty much called \"sauce\" until there's more than one in play at a time.",
              "id": 180,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 356,
          "content": "Also, this dish is literally CALLED  VODKA SAUCE",
          "id": 181,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 323,
          "content": "She also thinks 1.5 years is \"years.\" Over a year, sure. The way she phrases it is like they've been together a decade. I think she's prone to dramatics and not paying attention.",
          "id": 182,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 145,
          "content": "This needs to be so much higher up",
          "id": 183,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 145,
          "content": "The way OP kept saying YEARS and you broke it down to 30 times. 😭 I cannot",
          "id": 184,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 33,
          "content": "right. And what did OP think she was eating the other times he made the dish?",
          "id": 185,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "I hadn’t thought of this. But I see three things from this thought… \n1. OP was largely exaggerating for this post. \n2. Somehow OP has never once been in the kitchen for around 30 times this has been cooked. Not sure how. \n3. The bf purposely hides the alcohol from site and this is the first time he was caught.",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4985,
      "content": "This reads like a person imagining how a recovering alcoholic would act like.\n\n\"It still bothers you\" that he drinks with his friends? Really? Stop it. \n\nYTA. No, you can't just knock over a bottle of alcohol in someone else's house and expect not to pay for it. And no, cooking with alcohol doesn't \"lace\" your food with it. For a supposed \"recovering alcoholic\", you know very little about the substance itself.",
      "id": 187,
      "comments": [
        {
          "score": 1327,
          "content": "It does read like fiction. What kind of alcoholic wouldn’t recognize top shelf vodka? And wouldn’t taste alcohol in vodka sauce?",
          "id": 188,
          "comments": [
            {
              "score": 567,
              "content": "Okay, to be fair, some alcoholics are more into beer, wines, etc., not so much spirits, so it’d be a strong generalization to assume they’d recognize top shelf vodka. But I agree with the rest!",
              "id": 189,
              "comments": [
                {
                  "score": 8,
                  "content": "lol as a not so recovering alcoholic I don't give a shit about top shelf. I'm looking for cheap shelf",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 360,
              "content": "No, the sauce doesn't taste like vodka at all. There's very little in it and it's greatly overpowered by other ingredients.",
              "id": 191,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "Most alcoholics I have known drink cheap booze because they drink so much of it and an $80 bottle every other day is not sustainable. Only rich alcoholics drink top shelf all the time.\n\nAnd vodka sauce if made properly doesn't taste like actual vodka lol.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Do alcoholics always have to be expert in alcohol though? Alcoholics drink frequently, so I doubt they have enough money to go for the top shelf stuffs. My bet about the sauce part is that she’d never known how it was supposed to taste so she assumed it as normality. I cook with wine sometimes, and tbh the taste of alcohol are barely there if you only use a bit of it, especially for sauces. \n\nBut yeah she should pay for what she broke. And if she’s uncomfortable with him she should just leave him.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 369,
          "content": "It really does read that way. I’m in recovery, and I know plenty of people from support groups and they wouldn’t act the same way as OP. They’d say if they’re uncomfortable with something and not flip out. Some have partners that drink normally and don’t get bothered by it. As for alcohol in food, when I was less than a 18 months sober, I had chocolate that alcohol in them, I didn’t read the box at first until after I tasted the whisky flavor. Did I freak out, throw a fit and throw it out so everyone couldn’t have any? No, I just stopped eating them and called my sponsor.",
          "id": 194,
          "comments": [
            {
              "score": 34,
              "content": "Really glad you were able to STOP and reach out for support, that in itself is such a big part of the battle. I know for me there was a struggle with getting ashamed & wanting to cave in 1. Binge drink and 2. Lie about it to others. \n\nI didn't thankfully but I know when I'm feeling very low it's still tempting to numb out. So I can understand OP being upset with a giant bottle in the house, though it seems she may not have been honest with him about her true want to not have alcohol around her at all. It's wrong to break things and lash out no matter the reason and she should pay for what she broke. YTA  OP",
              "id": 195,
              "comments": [
                {
                  "score": 34,
                  "content": "That temptation to give up and binge drink is one of the biggest issues with the AA abstinence model! When every slip is considered a full relapse that resets your sobriety date/progress, the temptation to say “ugh well I’ve ruined it already with this one beer, might as well go on a bender” is IMMENSE.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Agreed. This was a big reason I left the rooms after three years. The \"all you have is your clean time\" crew just got to be too much. If relapse is part of recovery there shouldn't be so much judgment and gossip that comes with it.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "[deleted]",
              "id": 198,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Yeah, they kinda make a deal about how you shouldn’t treat other people like they’re alcoholics.  It’s ok for other people to drink, you don’t need to be concerned with that.\n\nBut I could see someone not being comfortable dating a drinker, that’s reasonable.  Also reasonable to not eat that pasta anymore, and to tell them you don’t want them cooking your food with alcohol.\n\nBut as for things that happened in the past that you didn’t know about?  No you shouldn’t be angry about something that didn’t trigger you.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I tend bar from time to time and accidentally served a recovering alcoholic an alcoholic drink (due to miscommunication). He took a sip, asked if there was booze, sent it back.\n\nNo harm no foul, he had a great sense of humor... his  line was 'I only tried alcohol once... for 25 years!'\n\nStill, not good to give booze to a recovering alcoholic.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "How is this relationship healthy when she's admitting that from the beginning she expected him to concede to her judgements?\n\nIt's not about the vodka. It's about how she told him she's cool with the existence of alcohol in certain situations, but never truly was.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "To be fair more than half this sub reads like fiction",
          "id": 202,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3112,
      "content": "YTA - You break it, you bought it.\n\nAlso for the \"lacing my food for years\" comment. Settle down.",
      "id": 203,
      "comments": [
        {
          "score": 1246,
          "content": "She’s clearly a dry drunk with rage issues, he should probably take this as a red flag.\n\nETA: YTA",
          "id": 204,
          "comments": [
            {
              "score": 508,
              "content": "You mean a marinara flag?",
              "id": 205,
              "comments": [
                {
                  "score": 517,
                  "content": "No, it's a Vodka Sauce Flag",
                  "id": 206,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Thank you for not missing this perfect opportunity.",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 346,
              "content": "This. My first thought was \"My god, woman. Call your sponsor!\"",
              "id": 208,
              "comments": [
                {
                  "score": 7,
                  "content": "LITERALLY \n\nThe fact she just skipped this step completely and just kept acting like a bratty child shows you what kind of person she is",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "Yeah it’s no joke. She needs to get in some therapy or support groups because her resentment and anger and acting on it is bad news.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Re her edit, refusing to take responsibility for doing something violent while enraged is very dry drunk behavior.\n\nYTA, OP, and you have work to do. Also, no one expects you to march into the liquor store and buy vodka but give the man $80, not stuff of your choosing.",
              "id": 211,
              "comments": [
                {
                  "score": 23,
                  "content": "I agree.\n\n\"I broke it but I'll give you something else.\" Seems so controlling and weirdly abusive.\n\nCan you imagine if a woman broke their man's xbox and said she'd spend the amount on *something else* because she never liked the Xbox?\n\nEff that.",
                  "id": 212,
                  "comments": [
                    {
                      "score": 13,
                      "content": "touch sloppy dam march correct different six crown ludicrous aloof *This post was mass deleted with [redact](https://redact.com)*",
                      "id": 213,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "The fact that the recovering alcoholic is upset her boyfriend didn’t abuse substances and still enjoys them with his friends…. Yeah he needs to run for the hill. I’d have her stuff ready for her to take back to her moms house when she comes with my new bottle.",
              "id": 214,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "What’s a dry drunk (gotta expand my vocabulary)?",
              "id": 215,
              "comments": [
                {
                  "score": 26,
                  "content": "Someone who abstains from alcohol due to addiction issues but does nothing (like therapy or AA meetings) to address the emotional/psychological reasons they used alcohol so heavily.",
                  "id": 216,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Not a single mention of that 12 step program in all of this fallout us super sus.",
                      "id": 217,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Honestly, I'd be scared if my partner lashed out and broke something like that. She also refuses to take responsibility for her reaction and didn't even listen to him or know for sure if they talked about it. I don't say this a lot but he should run.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 106,
          "content": "Especially when they’ve been dating less than 2 years.",
          "id": 219,
          "comments": [
            {
              "score": 120,
              "content": "The math on that logic works about as well as her\n\n1. Not tasting the vodka, alcohol cooked out or not.\n2. Her realizing she's been consuming alcohol for years and not taking from it how meaningless the alcohol is over their lives and that it was always in them to succeed.",
              "id": 220,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "Right and the \"for years\" ma'am you've been with him a year and a half.  You haven't even made it years and at this point hopefully it's done",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1259,
      "content": "Kudos to you on being a recovering alcoholic. That takes a lot of strength and courage.\n\nBut in this case, YTA although I understand your emotional response. Many people put vodka in pasta sauce -- it's called Tomato Vodka sauce. The alcohol does boil away. Whenever you cook with alcohol, unless you add it at the very end, it boils away.\n\nEDIT: several people have pointed out it doesn't all boil away. That's true. But we're literally talking about a tablespoon of vodka in the entire sauce, and much of it boils away. My point is NOT that you're wrong for wanting no alcohol at all in anything you eat. That's your right., It's that you're wrong for how you dealt with it.\n\nYou were wrong to break the bottle of vodka, whether it was a $20 or an $80 bottle. The cost isn't the point. The point is that it's his property, his intentions were good, and you destroyed it in a violent way. Destruction of property is actually on the road to an abusive relationship, so yeah, you need to apologize, and to pay for it.\n\nI get that being a recovering alcoholic is hard & you panicked when you saw that bottle, but you could've asked him not to put even boiled-out vodka in the sauce in the future. It sounds like he would've listened. If you requested him not to and he still did, then he'd be TA. But as it is, this was his own house, he was cooking something he thought was safe, and you reacted very inappropriately.",
      "id": 222,
      "comments": [
        {
          "score": 34,
          "content": "I’m curious if he ever told her the name of the sauce. I had roommates who just put vodka in whatever Dollar Tree jarred sauce they had. No one who knew what penne alla vodka actually is would have thought they were being served that.",
          "id": 223,
          "comments": [
            {
              "score": 6,
              "content": "“Here’s some dry bow tie pasta and a shot of Smirnoff. Enjoy!”",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": ">The alcohol does boil away.\n\nAccording to the U.S. Department of Agriculture (USDA), baked or simmered dishes that contain alcohol will retain 40% of the original amount after 15 minutes of cooking, 35% after 30 minutes and 25% after an hour. But there's no point at which all of the alcohol disappears.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 955,
      "content": "YTA BIG TIME - you do realize that there are recipes made with alcohol, and the alcohol goes away when its cooked. Rum cake for example cant get you drunk unless you pour rum AFTER baking it. Yes - you definitely need to pay for that. I can understand you being alcohol-recovering \n, but that does not give you the right to break a bottle for a reason like that. Thats like you going up to a stranger at a restaurant and breaking their margerita glass cuz you didnt want it in your presence. Also, that would be the same as you destroying a rum cake, which is a very good cake because of the rum flavor that doesnt come from the alcohol itself\n\nEDIT - also your bf was following the recipe, you literally could have told him that you werent going to eat that to be safe, and kept it at that.",
      "id": 226,
      "comments": [
        {
          "score": 296,
          "content": "Rum cake can absolutely get you drunk.",
          "id": 227,
          "comments": [
            {
              "score": 245,
              "content": "Is it even realistic for anyone to eat enough rum cake to get them drunk though?",
              "id": 228,
              "comments": [
                {
                  "score": 288,
                  "content": "Challenge accepted. I'm goin' in...",
                  "id": 229,
                  "comments": [
                    {
                      "score": 67,
                      "content": "Sweet ok, results need to be documented and shared.",
                      "id": 230,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "You've never eaten my aunt's \"famous\" rum cake. I swear she uses an entire 2L bottle of Captain Morgan Spiced in her recipe; it's actually pretty hard to get through 2 bites because of how strong the rum flavor is, and my go-to drink is rum and coke (with Morgan Spiced).",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 124,
              "content": "If you put the rum after you cook it. In order for rum cake to get you drunk you need to soak the cooked cake in rum for days after it's cooked\n\n Adding alcohol to an already cooked dish and not cooking further will put alcohol in it yes. But that's not what we're talking about here.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "I agree with your sentiment but you are confidently incorrect about how alcohol in food works. The flavor in rum cake *absolutely* comes from the rum. And alcohol in food doesn’t really cook out (it’s something like it is cut in half for every hour of boiling) so you could easily get drunk from foods cooked with alcohol, although you’d have to eat quite a bit.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Rum cake always has rum in it, it absolutely does not bake out, everyone who eats rum cake knows this and that rum cake shouldn't be given to minors. The hell are you from that you know what rum cake is, but don't know it has alcohol in it??",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This is a poor comparison. Real Rum cake is literally soaked in rum after baking. No reducing- pure booze on purpose for the liquor flavor. Vodka sauce is cooked in. If it’s flambé then the alcohol is gone. If it’s simmered it’s greatly reduced but either way, not there for the literal liquor flavor but to enhance other flavors. Big difference from rum cake.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "The \"alcohol cooks away\" story isn't accurate: I'm allergic to alcohol, and even when eating dishes where I'm told the alcohol has cooked away, I still get severe allergic reactions. Problem is, I can't really taste it - so usually I'm told AFTER the reaction \"yeah there's wine/beer/rum.. but I thought it would cook away!\" 🤬🤬",
          "id": 236,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "There’s still no excuse for putting alcohol in someone’s meal without their knowledge or consent, especially if they’re a recovering alcoholic.",
          "id": 237,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 925,
      "content": "I hope you never have any baked goods because extracts like vanilla extract are made with alcohol.  I'm not saying he was in the right, but it's not like you never have food with alcohol in it.",
      "id": 238,
      "comments": [
        {
          "score": 376,
          "content": "Pure vanilla extract actually has a 35% alcohol content by volume. I did not know that.",
          "id": 239,
          "comments": [
            {
              "score": 167,
              "content": "get a vanilla bean or two, put it in a vile of vodka for 4-5 months. use some nice vodka, it makes great vanilla.",
              "id": 240,
              "comments": [
                {
                  "score": 26,
                  "content": "It's even better made with bourbon or dark rum.",
                  "id": 241,
                  "comments": [
                    {
                      "score": 7,
                      "content": "This I can vouch for.",
                      "id": 242,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Seeing what the prices are for both imitation and real extract, I might just do that. My husband likes nice vodka. He also likes nice whiskey too. Do you think it'd work with almonds as well?",
                  "id": 243,
                  "comments": [
                    {
                      "score": 12,
                      "content": "It absolutely will work for almond extract. Add a bit of orange flower to the almond, it’s amazing.",
                      "id": 244,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Or more. I make vanilla extract at home by soaking vanilla beans in vodka, and sometimes homemade moonshine.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 205,
          "content": "That’s what I was just thinking — even with all the debate over whether or not the vodka cooks out of the sauce, basically 90% of Western baked goods have at least a couple teaspoons of vanilla extract, maybe even peppermint, lemon, or almond as well. Is she going to smash a bakery?",
          "id": 246,
          "comments": [
            {
              "score": 25,
              "content": "If the baked goods are made with yeast, they have alcohol in them. The yeast that makes CO2, also makes alcohol. The alcohol evaporating helps make bubbles, but some alcohol still remains in the bread.",
              "id": 247,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "So that’s why I’d get drowsy as a kid after making my “super vanilla” milkshakes…",
          "id": 248,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "And no cough syrup!",
          "id": 249,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 908,
      "content": "YTA. hi! recovering alcoholic here. two years alcohol free. \n\nyou're an adult. you know not to smash things when you're angry. you know that when you drop glass on the ground it breaks.\n\nyou know that your recovery and your triggers are your responsibility. you know that your boyfriend, who respects you and cares for you, would not intentionally trigger you or cause a relapse. you haven't relapsed from the vodka sauce, so you know whatever amount he was using it wasn't enough to affect you. \n\ni know it's hard. i can imagine that whirlwind of emotions, that feeling like all your progress didn't matter at all, like he'd stolen a year and a half sober from you and didn't give a shit. but your progress **did** matter and your time sober was **not** stolen from you. i think if it were me, i would apologize. \n\n\nedit: wording",
      "id": 250,
      "comments": [
        {
          "score": 115,
          "content": "Well said, and congrats on 2 years!",
          "id": 251,
          "comments": [
            {
              "score": 28,
              "content": "Congrats on 2 years!",
              "id": 252,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": ">you're an adult. you know not to smash things when you're angry. you know that when you drop glass on the ground it breaks.\n\nI'm not sure she does. Did you see the edit? She literally says she didn't break it, she pushed it off the counter and it broke on the floor. *Then* she says that she's not going to give him $80, she's going to give him $80 worth of things. What an asshole!!! If I was the boyfriend, I'd be running for the hills.",
          "id": 253,
          "comments": [
            {
              "score": 6,
              "content": "God that $80 worth of things pisses me off so much. He doesn’t want things he wants the vodka. It’s one thing to not be comfortable buying alcohol but you can’t even do him the decency to give him the money?",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Love to hear a truly compassionate response. Congrats on two years sober and I wholeheartedly agree!",
          "id": 255,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Congratulations on two years! And you’re 100% right….",
          "id": 256,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Congrats on 2 years sober!\n\nBut, didn't you hear that she didn't break it? She just pushed it off and the floor broke it.",
          "id": 257,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}