{
  "post content": "Background info: \nI (25f) have been bullied by peers for my nose since 4th grade. My mom has also contributed to my insecurities since I was little. I have some features that are plainly my fathers and some that are plainly my mothers. When I was a teenager, my mom made comments like “when I saw your first ultrasound photo’s I thought ‘poor child, she has *father’s name’s* nose”. I still remember how I felt then. She would also comment on her own appearance, things I inherited from her, without realizing she was making me think about myself in the same way. My maternal grandmother has also said things about my appearance. This past Christmas while visiting my family, she said “the grandchildren sure did get prettier the more we had them” while looking at me. I am the eldest. \n\nI am not ugly. I have a nice frame, hair, eyes, and smile. But my nose is certainly the first thing you notice. It’s very deviated and large. I used to be against surgery, but now that I am approaching my late twenties, I honestly just want to feel beautiful while I’m young. I want to not feel insecure when I go anywhere. If i get married, i want to feel beautiful in those pictures. I don’t want to shy away from photos. I want to feel confident. \n\nNow to the recent issue. \n\nI recently began exploring surgery options. Bottom line, because it is cosmetic, insurance will pay nothing. I can afford 1/3 of the cost and have asked my parents if they would be willing to help. My father inherited a good amount of money about two years ago. They talked about it and eventually decided not to because it is an expensive surgery. I try to respect their decision because it is their money and I am not entitled to it. \n\nWell, I recently found out they are going to build a concrete patio very soon. I understand they can do what they want, but it just hurt I guess. I kind of gave my mom a hard time about how she used to make me feel insecure and now she feels bad. There was also a time where I was having to sleep on a dog bed in an apartment across the state because I couldn’t afford a mattress and my dad refused to drive the one I had bought previously. Two months later they bought a brand new mattress for themselves while I was still sleeping on a dog bed. I guess this surgery issue brought up those kind of feelings again and I feel guilty for holding it against them. \n\nAITA for resenting my parents for not helping out after the years of insecurity they gave me?\n\n\n****edit below ****\n\nI appreciate the constructive criticism. I am still probably going to get the surgery for myself with my own money. For those asking, I never demanded money or yelled/belittled/whatever to my mom when I gave her a “hard time”. I also never threw a fit or even complained to them about their answer. This post was more about me feeling guilty because i was internally resenting them. Give me some credit here haha. The conversation with my mom was more that she asked me why I wanted it and I reminded her of all the things she and everyone else said to me and she got sad because she says she didn’t realize what she was saying at the time. I don’t think she was trying to put me down. I do think she never considered how I would take her criticism. \n\nI agree therapy would probably benefit me the most and appreciate the sympathy for how I had been treated. It did suck, it still sucks, but I think everyone has grown from that. It’s just a matter of me being able to move on from this resentment. So yeah thanks for the healthy reminders. Everyone is beautiful :)",
  "id": 1,
  "comments": [
    {
      "score": 452,
      "content": "ESH - Your parents and grandmother suck because they were shitty to you growing up and making you feel insecure about your appearance.\n\nYou suck because you expect them to pay for your cosmetic surgery.\n\nListen, a nose job is not going to fix the underlying cause—your insecurity.  I have a girlfriend with a giant honker and she jokes about it all the time.  She’s gorgeous, intelligent and absolutely emotionally secure in who she is.  She gets hit on all the time and she’s nearing 50.  You know what is sexy?  Confidence.  Self-actualization.\n\nEven if you get a nose job, you’ll become insecure over something else.  You are better served utilizing therapy.",
      "id": 2,
      "comments": [
        {
          "score": 215,
          "content": "It's hard to have confidence when your own family bullies you.",
          "id": 3,
          "comments": [
            {
              "score": 36,
              "content": "Therapy helps with setting up the boundaries to prevent further bullying/not letting it impact you as much.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "I partly agree with you but don’t say a nose job isn’t going to help. I got a nose job myself and I am a different person now. \nI still don’t love everything about myself but my nose was always the one problem I couldn’t handle. \n\nImagine you sitting somewhere having fun and suddenly get sad because you realize people are looking at you from the side.  I can freely laugh and be confident in my appearance now. \n\nAlso depending on the country, the doctors are watching your reason (mental health) e.g. consequences of bullying etc.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "> Even if you get a nose job, you’ll become insecure over something else.  You are better served utilizing therapy.\n\nThats not always true. There are tons of people who get plastic surgery, only do one procedure and desire nothing more, and are really happy with it. I got my eyelids done and I wouldn’t call myself ~insecure~, it’s just something I didn’t like and was happy to have it fit in with my face better. Although a minimal procedure, it really increased my enjoyment of life! \n\nWhat would be best is for her to speak to a therapist on whether or not plastic surgery is a healthy choice for her. \n\nOP, get the plastic surgery or not, but don’t expect anyone else to pay for it. It’s your face and your decision, so it should come from your pocket.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Your story reminds me of my friend in high school. She was gorgeous but was a tad self conscious about her nose. One time this guy who was into her tried to compliment her and said “You’re so pretty, you don’t even notice your big nose”. Still makes me laugh to this day! Poor guy tried.",
          "id": 7,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I can't say for certain if the family was bullying her or not. \nI have a LARGE nose. I get it from my grandfather. my mother use to show me pictures of him and she would laugh and apologize for my honker since it was from her dad.\nEven my fiance now tells me what a big hook nose i have. \n\nI wouldn't call it bullying. Its fine to notice flaws and imbrace them, even laugh at them. Its what makes people unique.\n \nNow if family was saying \"dang that fat nose makes you ugly as sin\" then yeah that's messed up.",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 175,
      "content": "[deleted]",
      "id": 9,
      "comments": [
        {
          "score": 45,
          "content": "Man, the guy who fixed my deviated septum refused to \"take a little off the top\" 😂",
          "id": 10,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 86,
      "content": "ESH.  I understand why you feel like your parents owe you for contributing to your insecurities.  But you recognized you weren't entitled to their financial support before you found out how they planned to spend the money.  This doesn't change that.  And judging by the other issues this seems to be dredging up, I don't think getting them to pay for this would actually make all of that better even if they were open to the idea.  You're going to need to find some other way of dealing with feeling like they don't value you.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 49,
      "content": "ESH, but you a LOT less.\n\nIt is true that you can't expect them to give their money to you. You are an adult now, and you shouldn't really be relying on your parents to help you out financially when it's that expensive. I understand why you're upset about it, as they're the major contributes to your pain and they have the money to spend, but you aren't really their responsibility anymore financially.\n\nThat being said, the way your family treated you as a child is horrible and they should know how terrible it was. Bringing down a literal child based on their appearance or anything else, really, is disgusting. And they wonder why you have issues now.\n\nAlso, the mattress thing in particular is crazy to me. How could they possibly justify letting their kid sleep on a DOG BED because they were too lazy to transport the mattress to you?? The one that you bought *yourself*?? They don't seem like good parents imo. I would honestly try to distance yourself from them; they've made you feel insecure, seem to see little value in you, etc and you don't deserve to be around people like that.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "ESH. As you said, it is their money and you are not entitled to it. \n\nYour parents (or more specifically your mother and her family) shouldn't of made those comments to you. That sort of thing can (and clearly did) leave deep insecurities.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "YTA. Sorry but it’s their money and you’re not entitled to it.",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 22,
      "content": "It's hard to give a judgement on this because ultimately, this is not about one situation. This is about the years of being bullied and belittled for years by your own family, made to feel worthless *forced to sleep on an actual dog bed*. I'm so so sorry for everything that you've been through, but even if your parents paid for this surgery it would not make up for all the horrific ways they've treated you. I don't believe you're entitled to your parents paying for this surgery but I just cannot bring myself to call you an asshole, sending you lots of hugs and I hope you know that despite all the bullying you are beautiful the way you are.",
      "id": 15,
      "comments": [
        {
          "score": 22,
          "content": "[deleted]",
          "id": 16,
          "comments": [
            {
              "score": 10,
              "content": "Yeah I don't understand this myself. Why not buy a new mattress? If you can't afford a mattress you probably can't afford moving out of your parents' home. If she can't afford a new mattress how will she ever afford an expensive elective surgery??? \n\nYes, OPs family sucks for belittling her looks. At some point though (esp at 25 years old) you need to stop becoming so dependent on your parents' money.",
              "id": 17,
              "comments": [
                {
                  "score": 2,
                  "content": "This was years ago when I was 18 and just moved out and was in college. I already bought a mattress and some furniture on Facebook marketplace and my dad agreed to rent a uhaul and help me drive it up across state to where I was moving. The day before I moved he said he didn’t think that the mattress would fit in the truck (he didn’t end up getting a uhaul) and we would “figure it out”. \n\nI didn’t have any money or friends and was alone across the state and bought two cheap unused dog beds because that was all I could do. I don’t know what to tell you, it’s embarrassing. One of my roommates eventually got her friend to give me a mattress and that was probably the most humiliating moment of my life. I only had that sleeping situation for two months before I got a mattress. \n\nMy parents didn’t reimburse me for the mattress I bought, never arranged to buy a new one, and ended up getting a new $500 mattress for themselves. When I brought it up crying to them my mom said she didn’t realize I needed one. I don’t really understand what they were thinking and yeah it still pisses me off to this day. \n\nThis was 7 years ago, not recently. I make more money now.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 21,
      "content": "YTA \n\nYour parents aren’t assholes for refusing to pay for your elective surgery.",
      "id": 19,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "Yta.  \nYou're in your late 20's. \nTime to pay your own way for things you want.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "I thought most plastic surgeons had a finance program.",
      "id": 21,
      "comments": [],
      "relation": "No"
    }
  ]
}