{
  "post content": "My (F27) best friend (F27) and I have been bffs since high school. We both came from a small town but had really large goals that we both, for the most part, have achieved. We moved out of our small town together and lived together as we both went to schools in a much larger state. I went to school and got my Masters in Political Science and my best friend (who we will call Michelle) went on to culinary school and has done apprenticeships all over the world and is a REALLY good cook.\n\nThe only issue I have taken is, since she's done all these amazing culinary things and has become so in love with food, she CONSTANTLY shames people for what they eat. She is literally incapable of not making a comment about any food. If you crave a burger from McDonalds, she will tell you how disgusting that burger is and about a burger she had in Ireland from a small pub made from lamb. Once I was eating Cheetos and she commented that she would never put that in her body and suggested I started making my own cheese puffs and that they are easy to make (they are not). Every meal we eat together, she comments on everything and will then applaud herself on the choices she has made.\n\nThe other day we went to a restaurant (it wasn't a super nice one, it was just a little hole in the wall sushi place) and our boyfriends came with us. My boyfriend is mostly a vegetarian for health issues and tries to stay away from meats, but will very occasionally eat fish. Last night was not one of those nights. He ordered a roll with solely vegetables and Michelle would NOT stop harassing him about not choosing one with any fish. I told her that she really shouldn't care what he ate and that she needs to just enjoy her meal. She then proceeded to talk about this amazing sushi she ate abroad and then said \"I have such a refined palette, I honestly don't know why you all don't just order what I order anyways\" and told my boyfriend that he wasted his money.\n\nI was kinda at my breaking point, so I told her she was being overbearing and kind of pretentious. This upset her, because then she told me that with my boyfriends diet and \"how I feed him\" she's doing him a favor. I asked her what she meant, and she said that I don't feed him the most nutritious or enjoyable meals. At this point I called her an AH and told her just because she's good at cooking doesn't mean she can be rude. Then I told her about all her political opinions that I think are stupid but don't comment on, because having a Masters doesn't make me entitled to shove my opinions down everyones throat.\n\nWe aren't speaking, but she refuses to apologize and I'm starting to feel bad. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 7956,
      "content": "NTA - she sounds like she has some toxic traits and you have every right to let her know she overstepped and offended you.",
      "id": 2,
      "comments": [
        {
          "score": 3614,
          "content": "Exactly NTA it never will be her concern what you eat. She trying to brag about herself constantly but is insulting other in the process which she has no right to do.",
          "id": 3,
          "comments": [
            {
              "score": 728,
              "content": "People who shame others to make themself look good are just horrible. Sadly, people tend to not speak out against famous/rich/people in positions of power, thus enabling their horrid and immature behaviour.",
              "id": 4,
              "comments": [
                {
                  "score": 246,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 6,
                      "content": "> I tried to shut that down pretty quickly by saying while it was a good thing that she was eating healthy, she didn't need to put down what other people eat and that there are quite a few people that don't have the luxury to eat the food she can afford.\n\nAnd what was her response?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I love that when it came to your boyfriend being on the receiving end of her douchey behavior you jumped in.  Brava!!!",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I think she's bragging because she's feeling insecure about something else in her life and cooking/food is the only thing she's good at/can control. There must be some facet of her life that isn't as great as it seems.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I agree. NTA.\n\nBut OP also shouldn't expect an apology from  Michelle (even though she deserves one). That's clearly not happening. OP has to realize Michelle is a pretentious braggart busybody and not expect that to suddenly change. If Michelle has other qualities that make this worth dealing with for OP, great. But this seems to be who she is.\n\nOP can try to mitigate that politely (or less politely if Michelle can handle it?) shutting it down each time. Or OP can just ignore it completely. Or whatever. Or if she really can't stand it she can start spending more time with people that aren't Michelle. But it does not sound like Michelle is open to self-awareness and growth in this area and OP can't make her.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1008,
          "content": "Just to follow on this, she has a lot to learn about the concept of feeding people from a culinary position.  I spent the better part of 2 decades working in restaurants, some of that time in the kitchen, and a couple of times in Michelin star restaurants.  People that cook for a living, know that food is sustenance, we would eat what we could, when we could.  Fast food and taco carts (along with food that got messed up) was what I lived on for most of that career.  No one I worked with once I got to that level thought any different, as we were all scraping by, working long hours and knew how ridiculous some of the food we cooked was.  This is a lack of life experience on her part, and you are NTA.",
          "id": 10,
          "comments": [
            {
              "score": 520,
              "content": "Seriously. I have a few chef acquaintances and they all eat anything and everything, from frozen chicken tenders to beef tartare. I’ve seen them make some wild, delicious concoctions, especially after a night of drinking. But after a long shift? You bet your ass they’re eating the easiest thing possible before crashing.",
              "id": 11,
              "comments": [
                {
                  "score": 248,
                  "content": "Yep, I work in a kitchen. The last thing I want after a shift is to spend another couple hours making a meal. Frozen pizza and noodles all the way!",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 98,
                  "content": "This sooo this have bin a chef for 13 years and after 16 hours in a kitchen you bet your was I'm going to eat what ever is rdy or easy OP friend is a massive AH",
                  "id": 13,
                  "comments": [
                    {
                      "score": 18,
                      "content": "My dad was the same.  Professional chef, ordered my mom to make him fried bologna sandwiches while at home.  No culinary f's given.\n\nThere's a reason why chefs go out after their shifts and drink, and let *someone else* cook for them.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "Yes, this! ha I know a chef that after a long shift makes himself what he calls a slop bowl haha. He throws whatever ingredients are on the line in a bowl and eats them mixed up with a fork with a gulp of gin. haha she'd be horrified at hat chefs eat",
                  "id": 15,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I'm not a chef but this is BASICALLY how I cook for myself... \n\nI have a lot of dietary restrictions too so my philosophy is that it doesn't matter what you eat as long as you enjoy it and it doesn't have any immediate physical consequences. Healthy means something different to everyone, and there's no point in shaming people.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "> I have a few chef acquaintances and they all eat anything and everything,\n\nMy uncle wasn't a chef, but an excellent cook.  As an engineer, he would follow a recipe to the letter, and it would come out tasting amazing and look just like the picture in the cookbook.  But one of his favorite things?  To hollow out Vienna Sausages with a straw, and fill them with Easy Cheese.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Oh god, that made me gag.\n\nBut I am a pretty decent home cook (just the other day I spent hours and hours on a pho broth from scratch), and I still eat boxed Mac and cheese with liberal amounts of Frank’s hot sauce when I’m feeling lazy, so I have no room to judge.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My chef friend loves Taco Bell. Taco. Bell. After work she doesn't want to go home and cook, and apparently chalupas are comfort food.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 340,
              "content": "She sounds like someone who went to culinary school but hasn’t actually worked in any form of food service. \n\nI own a restaurant and when it’s busy I live off slightly burnt tortillas or mistake orders.",
              "id": 20,
              "comments": [
                {
                  "score": 93,
                  "content": "I've worked in the restaurant business for 20 years and that was my first thought. Going to culinary school and actually working in the industry are 2 completely different things. And I like trying all kinds of food like her. I've eaten in a michelin star restaurant and I've also had chips for dinner after working 16 hours in a hot kitchen. She is definitely the AH not the OP. Criticising someone for what they choose to eat is terrible and it's not her place to do so.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 34,
                      "content": "And you can eat fancy gourmet food and still enjoy Cheetos... I love \"refined\" food but I also love junk food. The two things can coexist.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 85,
                  "content": "snagging small pieces of baguette bread dipped in salad dressing",
                  "id": 23,
                  "comments": [
                    {
                      "score": 26,
                      "content": "You just took me back to college. I can taste this comment.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Exactly this.\n\nWhen I was in culinary school - and when I was working full time after - I survived off cheap sandwiches I picked up on my way home. You couldnt PAY ME at that point to turn on a stove and cook something. And if I did, it was cheap ramen. There was no way after that long on my feet and in that hot of an environment I was subjecting myself to that at home. \n\nPretentious foodies drive me INSANE.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 40,
                      "content": "[deleted]",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 141,
              "content": "And the fact that she can cook doesn't mean that the quick convenience and taste of cheetos is suddenly deplorable and disgusting lol\n\nLike yeah, anyone can potentially make any type of fast food item or junk food better by cooking it themselves, but the whole point of fast food, chips, etc is that it tastes fine and it's quick and easy. Which, when you work in the chef/restaurant business and are on your feet and moving nonstop all day, sometimes that's all you want.",
              "id": 27,
              "comments": [
                {
                  "score": 27,
                  "content": "[deleted]",
                  "id": 28,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah I watch a YouTuber who is absolutely amazing. He does great things when it comes to food. He has a portion of his channel called But Better, which is just him going to mostly fast food joints, getting a classic food there, taking it home and making a better version of it from scratch hah. \n\nIts taught me that, its doable and there is stuff I am 100% going to try, buuuuuuttt sometimes I'd rather just take easy way haha.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Besides, when you want a bag of Cheetos, *you want Cheetos,* not a homemade version which might be \"better\" but not exactly what you want. I've made \"homemade versions of ___\" and while tasty, none hit the spot like the actual product.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "[removed]",
              "id": 31,
              "comments": [
                {
                  "score": 15,
                  "content": "Now I'm craving khichdi 🙁",
                  "id": 32,
                  "comments": [
                    {
                      "score": 7,
                      "content": "[removed]",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I have a family member who's this way as well. She now can cook for anyone's dietary needs (and makes it delicious!). I learned a lot from her as I had to cut out whole good groups due to health problems.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 8,
                      "content": "[removed]",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Man, agreed. My brother has worked all over the world, also at Michelin star restaurants (or highly ranked ones on the San Pellegrino list) and while he can kill the joy of eating what you previously thought was fine dining by over explaining why it’s good/bad, I have also seen him eat KFC Double Downs until he hates himself, just to see if he can. When he comes home, he craves my mom’s home cooking and all manner of shitty western fast food. And then sometimes he busts out a $1000 bottle of bourbon or goes to the best restaurants in town to try their tasting menu. I think chefs just like to eat, period.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "For real, my boyfriend just went back to working in a restaurant and he's living on staff meals and protein shakes.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I wasn't in the industry even half as long as you but I learned that fast. When you are cooking for other people for hours on end you just want something quick and filling for yourself, doesn't matter if its junk or not fancy. \n\nAlso learned that the walk in is the place to go to yell or cry. \n\nBut the chefs I knew were exactly like you, not stuck up about their own diets or others. Though understandably get irritated when people want to screw up dishes at the restaurant with too many changes.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yea this screams of her overcompensating for her relative lack of experience in the culinary industry. Reminds me of a quote i heard but not sure who to attribute it too because ive seem a few different sources...”the less people know, the more stubbornly they know it”",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "NTA. She's a bully.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I just need a friendship with a someone like your friend. I've known her since I was 11, (23F) and just couldn't put up with her shit anymore. Especially since I live in another country now and she can't communicate for shit. \n\nIts ok to end friendships like these, you don't need to hang on to toxic people just because you have known them for a long time.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Only some??",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "My SO is an amazing cook, he knows a lot about nutrition and all that, but if I crave some bad and unhealthy kfc or mc he never says anything, ever. Sometimes people just want bad food. It’s not on your plate, or in your stomach. Just ease off, jesus!!!! NTA.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2529,
      "content": "NTA-Your friend is a condescending, pretentious asshole. People around her have the right to eat what they want, how they want without her constant condescension and pretentious behavior.",
      "id": 44,
      "comments": [
        {
          "score": 571,
          "content": "Don't forget arrogant",
          "id": 45,
          "comments": [
            {
              "score": 599,
              "content": "And sexist! \n\n>she told me that with my boyfriends diet and \"how I feed him\" she's doing him a favor.\n\nWTF is that?! If OP is dating a child, their diet would not be my most urgent concern. Assuming the boyfriend is an adult, he can eat what he likes and monitoring his nutrition intake is not in any way OP's responsibility!",
              "id": 46,
              "comments": [
                {
                  "score": 154,
                  "content": "Exactly! Why is it her responsibility to “feed” him? That’s so gross.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Yea it's so sexist towards the bf suggesting he can't feed himself lmao what? Every guy I know is capable of cooking for themselves...",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "I used to live in Japan with my girlfriend (now wife). When she’d go to work parties, they’d always ask her “but what is your boyfriend going to eat tonight?” (because she isn’t there to “feed” me). She’d respond with some variation of “I don’t know, he’ll figure it out.”",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -19,
                      "content": "Wow. Feminists always find a way for women to be victims",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 180,
              "content": "You’re right. I did forget arrogant. Thank you.",
              "id": 51,
              "comments": [
                {
                  "score": 77,
                  "content": "De nada 😆",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "The especially hurtful thing is shaming the mostly-vegetarian for *not eating meat*.\n\nCome off your high horse and *look* at the people around you, for fuck's sake",
          "id": 53,
          "comments": [
            {
              "score": 84,
              "content": "*Especially* when it’s for health reasons. Just because you have a “refined palate” doesn’t mean anything you like is automatically safe for everyone else at the table.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Isn’t someone who doesn’t eat meat but eats fish a pescatarian or something? Or is that the opposite? Or am I thinking of the religion? God that word will always confuse me",
              "id": 55,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 78,
          "content": "She sounds like someone I wouldn’t make it through one meal with lol. The extent of me having anything to do with what anyone eats is telling my boyfriend (or friends / family) to try a bite of what I’m eating if I think it’s tasty. And if they say no, that’s the end of it. More for me. \n\nAm I a bit of a foodie? Yup. Does that mean I don’t also love some mass-produced junk food? Nope. Sometimes the fancy mac and cheese from some fancy restaurant just doesn’t hit the spot like kraft instant mac does lmao",
          "id": 56,
          "comments": [
            {
              "score": 20,
              "content": "Oh, hear, hear! I am absolutely a foodie, and I appreciate all sorts of fancy foods. I have a small army of spice jars, and I create my own scone and pie recipes. That said.... dessert last night was Doritos ranch chips and occasional Little Caesar's crazy bread or the rare McDonald's hamburger Happy Meals are a guilty pleasure.",
              "id": 57,
              "comments": [
                {
                  "score": 4,
                  "content": "I’m like you. I’m a home cook, but a pretty darn good one. I like to create my own recipes and 95% of the time make everything from scratch. \n\nI always have frozen chicken fingers, fries, pizza, and instant ramen on hand. Could I make it all from scratch? Sure. But sometimes you just want reasonably tasty convenience food. \n\nAnd you’ll pry my bacon and egg McMuffin, A&W Teen burger and diet rootbeer, or old Dutch sour cream and onion chips from my cold dead hands.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "See, I can't eat Kraft mac and cheese.  Not out of snobbery, but because my dad wanted it at EVERY DINNER when I was growing up, no lie.  And my mom, a good cook, but also a traditionally-minded housewife of the 70s and 80s, catered to his preferences.  \n\nHowever, she did her damnedest to sabotage it by never mixing in enough milk or butter, so we always had lumps of fluorescent orange cheez powder.\n\nAnd the worst thing was?  It didn't matter to my dad!  His mother had been such a rancid cook that his standards were in the basement, and so we ate lumpy, powdery Kraft dinner whenever he was home and he kept asking for more while the rest of us grumbled. \n\nAnd when I got to college and someone offered me Kraft mac and cheese, I politely declined and made ramen noodles instead.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "It reads like insecurity to me, her friend sounds insecure and needy. I don't think she is getting the kind of attention she wants from the world about her amazing palate...sounds like she wants to be treated like some sort of national culinary icon, and that's just not in the cards.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This!! Plus food can be a VERY sensitive subject for a lot of people, it’s never cool to comment on what people eat the way she did.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1983,
      "content": "NTA. “I have such a refined palate, I honestly don’t know why you all don’t just order what I order anyways”. Yikes.\n\nFor someone who went to culinary school, she seems to have missed that food and its enjoyment, like other artistic pleasure, is relative and unique to each individual. \n\nHer attitude is pretty trashy for someone who thinks she has “good” and highbrow tastes.",
      "id": 62,
      "comments": [
        {
          "score": 1096,
          "content": "She didn't used to have this attitude until she went on her last internship to this really nice restaurant in France last year. Ever since then it has been non-stop critiques about what everyone else is eating. She's made me hate the French lol.",
          "id": 63,
          "comments": [
            {
              "score": 1019,
              "content": "[deleted]",
              "id": 64,
              "comments": [
                {
                  "score": 274,
                  "content": "I'm French too, and yes eating for me is all about pleasure. It doesn't matter if it's \"good\" gastronomy, or just a burger King. I don't care at all! But even a French like me have the stereotype that some French gastronomy chefs are arrogant lol. (idk why now that I think of it, maybe because the movies or smthg) \n\nAnd I agree with the comment above. She lack of class by lecturing people on how they're \"supposed to\" approach food. She needs to get off her high horse and learn what the word \"humility\" means. I believe humility push people to become better while self sufficience tends to let people stay on what they know and not trying to improve.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 105,
                      "content": "seriously my favorite meal in france was a big ass baguette and whatever cheese i grabbed that day with some balsamic. so good. so simple. so cheap. NTA, OP.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Food is love. OPs friend is abusive and disdainful of that love and it literally leaves a sour taste in my mouth. Disgusting.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "I must say, i went to France and had an absolutely fantastic time. The food and the people were absolutely phenomenal. I asked people for recommendations wherever I went to eat (gave my poor uni student price range) and everyone had great recommendations and were very patient with my terrible, broken French.",
                  "id": 68,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 75,
                  "content": "Wasn't this the whole revolution of the kind of cooking that Julia Childs brought to the US? French cooking as a celebration of simple but fresh ingredients that are accessible to everyone? \n\nExtreme snobbery like this doesn't remind me of high class people. It just seems so trashy.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Fresh ingredients make all the difference. I will never forget the time I got to eat eggs straight from the nest.  I was visiting a friend for the weekend and they kept loads of chickens. We had eggs collected that morning for breakfast. Just scrambled, nothing crazy.  They were the most delicious eggs I have ever tasted.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Yes. You are all like that when it comes to food but it's okay. Most southern European cultures are like this with food but at least the French understand the value of a good but simple meal. I mean, you can safely cook a traditional French dish for a  French friend and they'll just tell you to use more butter. Just always let them pick the wine. Try that with somebody from Italy, I \\*dare\\* you.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 8,
                      "content": "If I absolutely had to condense cooking down to it's absolute basics, \"there can not be too much butter or garlic\" is probably pretty accurate. Although for myself I'd add cinnamon to that list.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I wish I could disagree, but one of my mother's favorite stories about her grandparents (both Italian, but from different regions) was how much they argued about cuisine ...",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "The most “French” meal I can imagine is good cheese, good wine, and good bread.\n\nThough these days I can’t drink alcohol and I’m lactose intolerant. It’s a real monkey-wrench in my dreams of wine and cheese tastings in France.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yes! Some of my best memories of France are just with a fresh baguette or one of those bigger breads, a hunk of cheese and wine and sitting in an Alpine meadow absolutely feasting. Every culture has fast food and more culinary inclined food. France just got famous for its culinary stuff, but by no means does that sum up French eating culture.\n\n  \nYou might be able to get some pills that'll contain lactase (I think?) that'll allow you to have one serving of something that contains lactose. When I was temporarily lactose intolerant due to a damaged gut from gluten, I took those sometimes. They worked for me, but everyone's different.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeah one of my biggest regrets is not traveling the world before I got my celiac diagnoses. I still think wistfully of all of the street cart things I will never be able to try. \n\nAnd breads, because that was one vice. Usually dunked in something, or smeared with something delicious.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "My sister was an actual French major she's such a francophile. Her love of all things French started bc our father owned a restaurant and bar supply company that did the entire kitchen for 2 different very popular French restaurants in NE Florida. I grew up being jealous of kids that were allowed to eat fast food as my parents cooked restaurant quality food at home. One thing nobody in my family ever did...shame someone for their choices in food! We were definitely all 'foodies' at home long before the term was invented (I grew up in the 80s). We also loved eating at other family members' homes, regardless of culinary skill bc of the camaraderie. I've been very grateful for McDonald's dollar menu at times, even if I did grow up eating escargot. 😂",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "I get you. I no gastronomer (or whatever the word is), but I do love basic French food like onion soup with cheese croutons. Rather that any day than some fancy meal that ain't big enough to feed a mouse.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 8,
                      "content": "“Gourmet” is the traditional term.  “Gastronome” is probably the term you were thinking.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "The food was excellent when I went there.  But I am a lightweight on alcohol and it feels like my trip was a 10 day bender.",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I think the food in France is on average better than the US (my home), and in general you guys put more care into eating and cooking than we do, but idk where OP is from.\n\nIt must be because the movies depict France as one giant Paris and the French as incredibly snobby. Y'all are delightful and while I've not studied at the Cordon Bleu, I've never met a single arrogant chef across your belle campagne. Mostly just hardworking people who love the food they make. And who laugh politely at Americans when we mix up \"canard\" and \"connard.\"",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 208,
              "content": "Augh, I'm French and honestly the only thing I know for a fact about france is indulge yourself. Want chocolate? Indulge! How about some bread with cheese? Indulge! Unhealthy snacks from a bodega? Indulge! McDonald's? Indulge!\n\nAlso, why is she nagging about your bf being vegetarian? French cuisine is like 80% vegetables, 15% fish and chicken and 5% beef and pork. A lot of French ppl don't eat meat or fish every single day so it's weird she is judging that.",
              "id": 82,
              "comments": [
                {
                  "score": 23,
                  "content": "As an American, I believe we have that \"indulge\" part down. Look at our obesity levels. This pandemic didn't help either.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Minor difference between \"indulge\" and \"binge.\"",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "I am less than shocked and I *love* the French.\n\nEdit: Not slamming the French, but Americans who do 6 months in Europe typically act like this and the food thing + arrogance about it is definitely French.",
              "id": 85,
              "comments": [
                {
                  "score": 45,
                  "content": "We are not arrogant about food, we like good food and to eat well most of the time but the important thing is to enjoy cooking and to enjoy the food you eat. Whatever it might be. \nIt is not defenetly french, if she became like that in France its because she was with arrogant assholes and because she probably was already kind of an ass",
                  "id": 86,
                  "comments": [
                    {
                      "score": 83,
                      "content": "I’m saying that’s what Americans who don’t know France see and take back when they are there for a short time. \n\nThey don’t fully understand the culture, so they get a surface level glimpse and then, on top of having an obviously amazing experience they are going to brag about constantly, emulate it with only the surface aspects that don’t really conform to American culture. \n\nThis generally applies to all countries, it’s just that the specifics, as stereotypes perpetrated *by the American,* are what screams out “French stereotype”. \n\nI’ve personally spent plenty of time in France and sure plenty of Parisians are arrogant but no more than an upper class Londoner or prep school NYer or the Swiss in their entirety. \n\nI used to spend summers by St Maxine and the only arrogant people I’d run into were Americans living in Monaco.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I don't think it's necessarily the BFF trying to emulate what she thinks is a French attitude, but more of a privileged American being a snob. In Europe, it's very common to travel to different countries and speaking more than one language is often necessary. The US is extremely large and it's expensive to travel abroad. I read an article that only between 5-10% of US citizens travel overseas in an average year. We mostly travel between states or stay on our side of the globe. That being the case, it's seen as a symbol of wealth and being \"cultured\" to have been to other countries. LOTS of Americans come back from trips overseas acting like pretentious assholes.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "My moms cousin is a great chef and has cooked for royalty. He is very very humble in that he will always praise whatever my mom feeds him whenever he's in town because he appreciates the effort. My mom will try to get a few pointers from him for dishes (she had to host a lot of dinners for my dad's job in the past and continues to improve her recipies). Hearing him talk about food makes me want to actually spend time in the kitchen. That to me is what a chef should be.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "To me this sounds like the people who suffer from the Donning-Krueger effect. I bet that she knows her stuff but apparently lacks the \"suphisticated worldview\" of knowing that people have different tastes and different situations, where one person cannot just dictate what is best. Same goes for all \" artistic\" expressions. \n\nI had a friend who started making good techno music from his bedroom, let me tell you, this fucker became insuffeable. Every piece of music got compared to techno and all music discussions devolved into \"techno is the best music ever made\", like, my man, if that were true, all people would naturally pick up and love it, which is apparently not happening. So whenever someone said that they love for example rock'n'roll, he would just go on a berating tyrade acompanied with music examples that the other person clearly did not enjoy. The funniest thing, for all his \"advanced and sophisticated music taste\" he did not know about David Bowie, The Queen or The Beatles, he never even heard of Gorgio Moroder who was in my opinion one of the forefathers of house and electronic music.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "and it's not going to change ... she now considers herself on a higher echelon.... and if she keeps it up, she'll have no friends at all....Time to move on.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Is your friend [Dennis from IASIP?](https://youtu.be/0vRZthsF0Nc)",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Just an FYI, doing internships at 27 around the world is not being a chef. It's just paying to be exploited in some cases and paying to travel around in others.",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "This sounds like something that could have been stopped early on with replies of “who cares,” but unfortunately it’s gone on long enough that she’s fully taken on the mantle of grand arbiter of all things food.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "On the charitable side, she is trying to be helpful and doesn't realize how she sounds and is coming off, on the flip side, she is pretentious and feels superior to everyone around her and is trying to keep herself above y'all the only way that she can.\n\nPolicing others food is never appropriate.  Her comment about her palette?  To be honest, she may have a great palette, she may not.  But what she likes and enjoys can be miles away from what you and your boyfriend enjoy, and that is okay.  If what she had looked appealing, then you would have ordered it.  Your boyfriend was in a vegan mood and did not want fish.  Why she though shaming his was the way to go and was going to make him immediately slap his head and change his order?   Michelle, you are not that good.\n\nIt sounds to me like you didn't yell at her, but use your viewpoint to show her how she is coming across.  Hopefully she will come to realize that she needs to tone it down.  She may be mulling it over right now and will apologize when she feels a bit less defensive.  Either way, you are not in the wrong for defending your and your bf's preferences.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "[deleted]",
          "id": 96,
          "comments": [
            {
              "score": 9,
              "content": "Except that instead of Turkey, it's really a meatball or something.",
              "id": 97,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Agreed. This is crazy to me. My dad went to culinary school, and in general I come from a family of foodies. We have always had really nice family dinners, and I have been very lucky to have explored a huge variety of foods growing up. I love to cook and create things that taste good. \n\nMy husband just doesn’t care that much about food-he has likes and dislikes, but for the most part he just goes the easiest route to put something into his body when it is hungry so he can move on with his day. I would be furious if someone commented on that in a way that put him down or made him feel embarrassed even for a second. It sounds like OP’s friend forgot to have a personality and has just let her entire identity be taken over by this idea that what you eat speaks to your value as a person. \n\nI’m glad OP stood up for her boyfriend. There is nothing for OP to apologize for, but that friend has some work to do. NTA",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Exactly. The point of dining with friends is for everyone to enjoy their food and enjoy each other's company. Attacking other people's menu choices negates both of those possibilities. OP is NTA, but her friend is a major AH.   \n\n\nNext time simply say, \"You're right. Your sense of taste is so much better than mine. In fact, I can't  believe I had the bad taste to pick a pretentious, patronizing b\\*\\*\\*h like you as my friend.\"",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "My dad always says (with a grin) that he's lucky he doesn't have a refined palate at all, because to him more foods are enjoyable. Which isn't to say he eats nothing but junk, but you could give the man a cheap fish or wine and he's still going \"wow this is so good guys!\"",
          "id": 100,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 604,
      "content": "NTA, she can buy a hitachi like the rest of us.\n\nAlso, that 'how you feed him' remark is weird. What, are you mama-birding this guy?",
      "id": 101,
      "comments": [
        {
          "score": 383,
          "content": "My boyfriend is an awful cook, and while he can make enough to sustain life, they are not enjoyable. We live together so I do all the cooking, so that's what she's referring to.",
          "id": 102,
          "comments": [
            {
              "score": 314,
              "content": "You were at a restaurant for this incident though, so unless you ordered for him it's still a weird thing to say, imo.",
              "id": 103,
              "comments": [
                {
                  "score": 318,
                  "content": "Oh I completely agree. I thought it was extremely weird for her to bring up. I think she was trying to find something to throw in my face.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 72,
                      "content": "She's a bit of an asshole, I doubt she only eats Jambon Iberico or Wagyu Beef from Kobe prefecture etc etc etc.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "She's so rude to throw your efforts in your face as \"not good enough\". Tons of people sustain their families by cooking for them without ever having set a little toe in a culinary school.  That's tacky as hell. Sorry OP. \nI'm also the one who cooks in our family because I'm better at it, and we divide work by our strengths. If you haven't given him food poisoning or made yourselves survive on strictly poptarts  I'd say you're doing a great job. 😊",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Also, he is capable of buying premade food, I'm sure, so if he wanted something different, he could easily get it.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "That is the same with my husband. He can cook a frozen pizza or Kraft mac and cheese or heat something canned, but that is the extent of his skill, haha\n\nGood for you for sticking up for him. My husband has really plain food tastes, and if anyone ever said anything about it to him, I would lose it.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 301,
      "content": "NTA. \n\nFull disclosure: I was that friend a while ago and I have realized how fucking stupid I sound. Your friend, a mature adult, hasn't realized it and needed to be put back in her place.",
      "id": 109,
      "comments": [
        {
          "score": 105,
          "content": "Mate, good on you for seeing it and adjusting yourself! We're fully allowed to make mistakes, it's how we deal and grow from them that truly shows our character.",
          "id": 110,
          "comments": [
            {
              "score": 28,
              "content": "Thank you! I have realized that there is no such thing as 'refined palate'. It's all about the opportunities you have been afforded and if you like to rub it in other people's faces, then you are a dick. (which I was some time ago).",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I'm someone who's had my food choices ridiculously scrutinized and judged, and I just wanted to extend a thank you your way. For people like me with food sensitivities, there's a lot of embarrassment and insecurity surrounding food, and comments often make it worse. It makes my heart warm to see someone who's changed their mind and started reserving judgement. Seriously, thanks ❤",
          "id": 112,
          "comments": [
            {
              "score": 6,
              "content": "Honestly empathizing goes a long way. I just thought one day, how would I feel if people were commenting on my choices the same way I do on theirs and just like that I stopped. I feel like shit sometimes for judging people like I did but I have come a long way and I am proud of it. \n\nThank you for appreciating. Hope you have pleasant people around you. ♥️",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 170,
      "content": "NTA. “Make your own cheese puffs, it’s easy” made me heave the biggest sigh.  It’d be easier to cook and eat her for talking shit than to try to bake/fry a whole bag of Cheetos. \n\n I don’t blame you for snapping at her, frankly I’m astounded you didn’t do it sooner.",
      "id": 114,
      "comments": [
        {
          "score": 177,
          "content": "The funniest part was that she later made me homemade Cheetos and no one could finish them because they did not taste good and were super time consuming. She's the only one who ate them and told us they were superior, however, I believe that she scarfed them down to prove a point.",
          "id": 115,
          "comments": [
            {
              "score": 66,
              "content": "Haha what the fuck, she cant be for real. When you make and eat garbage for hours and still have to insist on its superiority. Idk I think maybe shes a sad fucked up human version of Plankton",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Ya some cooks/chefs are more talk then game",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Same. There are some foods that I *can* cook or bake fairly easily. Like a burger. But guess what? A drive thru is even easier, so if I want a burger for lunch, I’m gonna go buy one from whataburger instead of going to the grocery store for ground beef and buns, going home to cook a single burger patty, and then go back to work.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I'm reminded of an Binging with Babish episode where he made his own Ritz Crackers and made the comment \"And this only took like an hour.  Soooo much easier then going to the store and spending $2 on an arguably better version\"\n\nEdit: I really hope its obvious he's being sarcastic",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I hate when people say \"just make your own, it's easy.\" yeah, it might be easy, but it's not worth your time. I know how to make mayonnaise , and I can do it, but home made is more expensive and more time consumming. It's not worth it.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 113,
      "content": "NTA. She really seems to overstep her bounds. There's a difference between being proud of what you do and wanting to share it with others in an appropriate manner and what she does. You labeled it for what it was. Overbearing pretentiousness. Google Dr. Linda Bartoshuk and refined palettes. It's 100% BS. You don't train your taste. You are born with the taste receptors you have and those define what things you find pleasing.",
      "id": 121,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 98,
      "content": "NTA\nShe sounds like an assh*le. She has no right to tell anyone what to eat, especially considering she is a cook, not some professional, medically certified dietician or something. Also, “I have such a refined palette, I honestly don’t know why you all don’t order what I order anyways”!? What right does she have to say such a thing?! Everyone has different tastes and preferences and requirements in their food, and hers will never please everyone. She also sound quite toxic and narcissistic is her way of criticizing your food choices while bringing the story back to her life. I say ditch her!",
      "id": 122,
      "comments": [
        {
          "score": 35,
          "content": "OP's friend sounds extremely r/iamveryculinary.",
          "id": 123,
          "comments": [
            {
              "score": 6,
              "content": "I'm surprised at how big that sub is",
              "id": 124,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "That was one of my first thoughts, that being a good cook does not make you a good nutritionist.\n\nIf she'd like to make suggestions based on a subjective flavour palate, that's one thing, but telling people what they *should* eat as a matter of dietary health is something she doesn't have the education for.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 77,
      "content": "NTA. Your friend sounds exhausting to be around.",
      "id": 126,
      "comments": [
        {
          "score": 30,
          "content": "Truly. I would be exhausted just overhearing that conversation. Hell, I'm kind of exhausted after just reading this post.",
          "id": 127,
          "comments": [
            {
              "score": 8,
              "content": "Ikr. I'd be dodging any invites that involved eating with her.",
              "id": 128,
              "comments": [
                {
                  "score": 6,
                  "content": "Something tells me she would be able to bring literally any topic or activity back to food though.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 61,
      "content": "NTA - she sounds like the type of person who will tell you what you’re eating that’s bad but do lines of coke or polish off a bottle of wine (just a joke obviously I don’t know)\n\nAlso your adult boyfriend doesn’t depend on you for food either so that was dumb of her.\n\nI would say you shouldn’t call her opinions dumb. Even if you have a maters in something it’s just a piece of paper you are not a master ( I have a master in computer science but I will be the first to admit I am not a master at coding)",
      "id": 130,
      "comments": [
        {
          "score": 98,
          "content": "I know I'm not a master in political science, but there are some things she thinks that I believe are just downright insane due to my degree. But one again, it was the only time I've never commented on those opinions.",
          "id": 131,
          "comments": [
            {
              "score": 22,
              "content": "That’s good. Educate the dumb just don’t come off as arrogant. Good luck with your friend and you can’t make cheese balls as good as Cheetos that is a fact",
              "id": 132,
              "comments": [
                {
                  "score": 22,
                  "content": "Truth. Nothing is as good as Cheetos. If she's as refined as she thinks she is, she should know that 😏",
                  "id": 133,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Ugh now I want cheetos",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I wish I could have cheetos (i'm allergic to MSG with soy and in the US you can't differentiate between where the MSG came from)",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Things such as what?",
              "id": 136,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "What are her dumb opinions? (I know you probably don't want a political debate breaking out in the comments but my gf is nosy and wanted me to ask....)",
              "id": 137,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}