{
  "post content": "\n\nMe (M32) and my wife, Dahlia (F28) lost our apartment 2 months ago and moved in with mom temporarily. Issues began to arise between Dahlia and mom and I had to ask my friend, Anthony (M31) to let us move in til I get enough money to rent out. His wife was away visiting family and he agreed but even there, some issues started to arise.\n\n\nFyi, Dahlia is very shy around Anthony. She grew up in conservative home and so it's understandable, but sometimes it can be a bit much I admit that! \n\nFor example, she freaked out when she accidently drank from his glass, she also once made a fuss when he passed by the guests room when she was lying down and the door was open. Thankfully, Anthony was super understanding and we were able to talk some of these issues out.\n\n\nLast night, Dahlia was passing the hall and noticed a framed picture of Anthony and his wife kissing hanging on the wall. She told me about it and said it made her uncomfortable. She asked if I could speak to Anthony about it but he didn't take it well. He gave me a look when I spoke to him and said this was \"bonkers\" because first of all, his wife put it there. And second of all, the picture holds sentimental meaning to him and his wife and argued that it wasn't some \"explicit\" picture of them, just a normal wedding kiss. We started arguing and he said that it wasn't like it was hanging in the living room wall or a perfectly lit room. I asked him to be a little more considerate because it's not like I asked him to remove it completely, just move it elsewhere that Dahlia won't reach or keep it off the wall til we leave. He said he was sorry but still refused. I explained how Dahlia was feeling but he said that again, he was sorry but would not move the picture. We argued some more and he said that it's his house and that I was being pushy and kind of too comfortable to make such \"demand\" and be pushy still.\n\n\nThis morning, Dahlia refused to even come out of the room until the picture is moved. Anthony is refusing which makes it worse. Now I feel like I'm getting stuck between a rock and a hard place. Yes she might just be over reacting but I feel like this isn't such a big ask for Anthony to decline and turn down. fwiw If it were me, I'd go the extra mile to make sure my guests are comfortable.\n\n\nAnthony has been a friend of mine for 10 years. I wouldn't have asked to move in with him if I didn't have such strong bond with him. He himself constantly talks about all the things and situations I helped him out with and we are considered brothers.",
  "id": 1,
  "comments": [
    {
      "score": 26469,
      "content": "**You are guests in their home because you are currently homeless.**\n\nYour wife is clearly the problem here. Get a grip. YTA.",
      "id": 2,
      "comments": [
        {
          "score": 6979,
          "content": "Yo, and they're currently homeless after already staying with someone else and wearing out their welcome there. Like he's basically setting up that they're just going to blow through every single person they have an even passing good relationship with to get what they want",
          "id": 3,
          "comments": [
            {
              "score": 2450,
              "content": "If I was Anthony I would walk around naked.. then tell them to fuck off and leave my house",
              "id": 4,
              "comments": [
                {
                  "score": 540,
                  "content": "Don't even have to go that far. Op's wife would probably faint if Anthony so much as took his shirt off!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 181,
                      "content": "Or GOD FORBID Wore a Tank Top / Muscle Shirt",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2108,
              "content": "fade plucky cable light pie plant bewildered quickest slimy birds\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "id": 7,
              "comments": [
                {
                  "score": 366,
                  "content": "This could be one of those situations where someone is so used to things not going well in life, that they sabatoge whatever situation they end up in. Why?  Self-fulfilling prophecy of failure and eventually hatred of anything/everyone.\nErgo, confirmation to themselves that life has dealt them a bad hand.\n\n\n\nJust speculating here.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Or someone who is used to ALWAYS being catered to and getting their way. There are more people than you’d think who have never faced an ounce of adversity in their lives and this is the result.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 58,
                  "content": "I know right. And she drank out of Anthony's glass then had a fit. Like what?!?!?!?",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 55,
                  "content": "THIS, so much this. She was mad that he was walking in HIS HOME! If she wants a private moment to lay down and is bothered by a man WALKING BY, then she should CLOSE THE FUCKING DOOR. To be so entitled that she'd be upset at the HOMEOWNER for daring to walk around in his own home.... when she was the one that had left the door open? LIKE WTF!? This woman is batshit insane and needs serious therapy.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 751,
              "content": "That was my thought exactly. OP was intentionally vague about the issues that arose between his wife and her mother.",
              "id": 12,
              "comments": [
                {
                  "score": 508,
                  "content": "Yeah I hate to say it but my drama llama is begging me to find out what happened with the mom. I'm sure I'll never know, though, so the damn thing will just have to starve",
                  "id": 13,
                  "comments": [
                    {
                      "score": 60,
                      "content": "Im pleased to meet your drama llama, my first, I will have to get one. \nWe can't let them starve. \n**OP GIVE US THE TEA**",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "I wouldn't be surprised if the the wife alienated the landlord before that too. It's clear that she's the common element in all these conflicts.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 380,
              "content": "They'd be out if it was my house. My house where I go to feel safe and recuperate. If someone makes me feel on edge in my own home, they don't belong there.",
              "id": 16,
              "comments": [
                {
                  "score": 57,
                  "content": "Imagine being upset someone walked by you when *you didn’t close the door*",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "Same here. I would not stand for it since in this situation, Anthony has the complete power to just chuck them out immediately",
                  "id": 18,
                  "comments": [
                    {
                      "score": 51,
                      "content": "It's like they don't even realize how tenuous their situation is if they keep burning bridges with the people willing to home them.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Yup, once he started fighting with me about it and the wife wouldn’t come out, that’s it.  Get out right now.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Especially something as lovely as a wedding picture. I would hate for someone to twist something so sentimental and beautiful to me into something to be offended over.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Right. Even after knowing the dude for 10 years he's about to get kicked out because his wife is weird as fuck and he's making demands and playing into her crazy shit. Kind of made me wonder if this was real or not. Like how does he think for a second he's not TA? Is there anybody in this thread that has his back on this??",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2706,
          "content": "They're *not* guests. Guests are invited by the host to stay somewhere that is not their primary place of residence. People who *ask* if they can *move in* because they have nowhere else to go are beggars or charity cases, but not guests. Not shaming them for being in that situation, but it's a completely different thing to being a guest.\n\nSurely she has to be doing this on purpose? Is she trying to box him into a corner where they have no other option but her family or something like that? If you are doing something in your bedroom that you are uncomfortable with others seeing, you don't forget to close the door. How can you blame someone else because *you* took a sip of *their* drink? The thing about the picture almost seems the most reasonable and it's still insane. The first two seem like traps that she set up on purpose.",
          "id": 23,
          "comments": [
            {
              "score": 493,
              "content": "Im glad someone else pointed out the \"guest\" issue. I was reading that thinking that there was a misunderstanding of the word \"guest\" somewhere. And even if I invited someone to stay with me and they were uncomfortable about a wedding picture (that doesn't seem like it is in a main location of the house), I still don't think I would move it.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1035,
          "content": "[deleted]",
          "id": 25,
          "comments": [
            {
              "score": 34,
              "content": "I agree. This can't be real. Therefore lying OP, YTA.",
              "id": 26,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "Yeah, they're not guests, the friend is doing them a favor. Insane mindset from OP.",
          "id": 27,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 43,
          "content": "Yeah, if you've been having issues at every place you lived, you might be the problem.\n\nPersonally, I might get it if it was like a nude or explicit picture in some way. But even then it's their house, you can avert your eyes.\n\nDoes she get uncomfortable if Anthony and his wife kiss in real life?",
          "id": 28,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "OP is very careful not to use the H word, but that is the reality, OP and wife are homeless and some entitled beggars.",
          "id": 29,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "They aren't guests, they are non-paying tenants who need to be a lot more grateful.  Dahlia is out of her mind, I can see why no one wants to let her stay.",
          "id": 30,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16310,
      "content": "If your wife is uncomfortable with images of someone kissing, wait until she finds out where babies come from. \n\nYTA - Your wife is being bonkers, and you are both being horrible to a friend who has saved you from potential homelessness.",
      "id": 31,
      "comments": [
        {
          "score": 4254,
          "content": ">If your wife is uncomfortable with images of someone kissing, wait until she finds out where babies come from. \n\nWhat would be uncomfortable about a stork putting your baby by the door and ringing the bell?",
          "id": 32,
          "comments": [
            {
              "score": 1436,
              "content": "\"Oh boy, it's the Stork... wait, where's the baby?\"\nStork: \"Honey, me and you are gonna make the baby.\"\n\n*cue Barry White music*",
              "id": 33,
              "comments": [
                {
                  "score": 131,
                  "content": "Love when he changes out the light bulb to a red one!",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "*Womp womp wah woooowoooowoooww*",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "But, I thought babies came from the cabbage patch!",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 50,
          "content": ">If your wife is uncomfortable with images of someone kissing, wait until she finds out where babies come from.\n\nSpat my drink out laughing!!! Excellent point - what do you guys do is there's kissing or \\*gasp\\* sex on the TV? Has she seen any movie ever?!?",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Agreed. The wife needs a therapist and the OP needs a lesson on basic manners.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12423,
      "content": "[deleted]",
      "id": 39,
      "comments": [
        {
          "score": 19002,
          "content": "Right? I mean the audacity! Dahlia needs help. OP and his wife should just move out if they aren't going to appreciate their friend doing them a favor and putting a roof over their head. Anthony could have the picture painted on the entire living room wall. OP has no right to ask him to remove it. No wonder OP's mom had a problem with Dahlia. YTA OP.",
          "id": 40,
          "comments": [
            {
              "score": 16245,
              "content": "[removed]",
              "id": 41,
              "comments": [
                {
                  "score": 7224,
                  "content": "If she's that upset by a married couple kissing, how can they have kids?",
                  "id": 42,
                  "comments": [
                    {
                      "score": 3553,
                      "content": "Closing her eyes under the covers with the lights off.",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 566,
                      "content": "Given the conservatism/puritism, odds are likely that she may have been raised to not have a say in the going ons of the marital bed.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1222,
                  "content": "This isn’t necessarily a sign of psychological trauma. Some women stress their conservatism as a way of virtue signaling, indicating “purity,” or to emphasize that they’re “shy” around the opposite sex. OP is clearly buying into it.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 1117,
                      "content": "Some conservative women really are *that way*, though. My mom literally whispered the words \"toilet paper\", just like that old TV commercial. One story that gets laughs is about the time an apartment building in our town burned and I overheard mom & dad talking about it. Mom: \"There were people coming out of the building *naked*! In the middle of the night! Why were they naked?!?\" I was about six so I probably thought she had a point, at the time. Years later I randomly recalled this incident and fell over laughing.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "Her freaking out and locking herself away seems far more mental than just an act. Conservative shame can absolutely create heavy trauma for women who will truly believe their purity = their value as a woman/human. \n\nI've known plenty who really were THAT messed up, and it might not seem so bad in day to day life when OP only sees her interact with people who 1. Bend to her odd rules and 2. Aren't stuck around her daily to cause friction. \n\nOP clearly likes his delicate conservative flower, which is just as concerning to me!",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 49,
                  "content": "Yeah I think OP really sugar-coated “full blown cult” with “conservative” bc, Jesus Christ",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3984,
              "content": "If I was Anthony I would start walking around in just my underwear but I'm an ass.",
              "id": 49,
              "comments": [
                {
                  "score": 3375,
                  "content": "[deleted]",
                  "id": 50,
                  "comments": [
                    {
                      "score": 1660,
                      "content": "*pearl clutching intensifies*",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1244,
                      "content": "Gee, wonder why there were ‘issues’ between Dahlia and his mom…",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 204,
                      "content": "Can you imagine if she had been at a local park today when my daughter was marrying her wife in Halloween getups?",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 36,
                      "content": "My husband kissed me in a restaurant the other day...Dahlia would faint",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1507,
              "content": "Exactly. If she's so conservative like that then just tell her to keep her eyes to the ground to avoid looking at anything. And for heaven's sake close the door if she's laying down. Rude much? \n\nOP YTA",
              "id": 55,
              "comments": [
                {
                  "score": 1419,
                  "content": "That really got me. I mean, the audacity of Anthony to…walk past an open doorway in his own home?",
                  "id": 56,
                  "comments": [
                    {
                      "score": 1002,
                      "content": "And if it’s so traumatic for her, why did she leave the door open in the first place? I think there’s something seriously wrong with that woman, and she should be in therapy pronto before they run out of friends and family to take them in.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Honestly, makes me wonder if Dahlia was SA’d or abused, given her extreme reaction to seemingly innocuous things (the door open while she was on a bed, drinking from OP’s friend’s cup, freaking out over a picture of a ‘wedding kiss’). \n\nI hope OP gets her help, because that just isn’t normal.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4173,
          "content": "Jumping on top comment to ask:\n\nINFO: Why couldn't you keep staying at your mom's house? Honestly, if she is so offended by seeing a photo of a married couple kissing at their wedding, it's way beyond a conservative background. She is uncomfortable with any public display of affection, and that's a HER problem that she needs to deal with. OP, you're about to burn another bridge with your best friend of a decade.",
          "id": 59,
          "comments": [
            {
              "score": 2600,
              "content": "I'm assuming mom got sick of OPs wife and kicked them out.",
              "id": 60,
              "comments": [
                {
                  "score": 1623,
                  "content": "Yeah, OP is king of the understatement in this post: \"Issues began to arise\" and \"she might just be over reacting,\" so I doubt we'd get the whole story",
                  "id": 61,
                  "comments": [
                    {
                      "score": 531,
                      "content": "The issue that rose is OP’s wife.\n\nStated by Captain Obvious.",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 264,
                  "content": "Yeah, I'm guessing that it's similar issues to what's happening now. Mom was refusing to bend over backwards for OP and wife. But I'm guessing that because it was OP's mom wife had no issue talking to mom directly. It seems like wife has conservative enough opinions that she feels she can't confront OP's friend directly.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "I'm seeing Dahlia behaving exactly the same way with the mother, until she had too much and kicked them out.\n\nOP and his wife are going to be going around friends and family for a while, with the situation repeating itself until they run out of options.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 791,
              "content": "It's not even public! It's in their home, in a hallway! This is next-level bonkers. She either has insane intimacy/control issues or is fostering a secret crush on Anthony.",
              "id": 65,
              "comments": [
                {
                  "score": 402,
                  "content": "I’m creeped out by how weird OP’s wife is about this… I also wanna know why they can’t stay with his mom.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Yeah I really can’t think of any reason she’d be so bothered by this photo. There’s no logic behind it whatsoever. She quite seriously needs help, like immediately.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "This guys wife is bonkers. Heaven forbid you walk by your own guest bedroom. I’m failing\nto see how the friend who out the kindness of his heart let them stay with him but he’s the bad guy for walking in his own halls and having a\ncouple photo of them kissing in their home.\n\nThese people sound like nightmares to be friends with.",
          "id": 68,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "Really makes me wonder what ‘issues’ arose between Dahlia and OP’s mother that made them feel the need to move out. The sheer audacity of a guest asking their host to take down a wedding picture is not conservative. It’s bat shit crazy imo. I’m gonna stop thinking about it and go and watch my home team in the WS now. ⚾️",
          "id": 69,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11841,
      "content": "YTA - first your wife had issues with your Mom, now she’s having issues with Anthony…sounds like your wife is the real issue. From your title I was expecting your hosts to have a semi-nude or nude portrait in the guest room. But, no, she’s freaking out over a standard wedding kiss pose in the hallway? Please, child! You need to hurry & get your own place. I think you’re lucky Anthony didn’t ask you to leave immediately.",
      "id": 70,
      "comments": [
        {
          "score": 2121,
          "content": "Yup, common denominator is wife.",
          "id": 71,
          "comments": [
            {
              "score": 893,
              "content": "Actual, so is OP. Wife makes unreasonable request, OP agrees and goes along with it. I bet the same thing happened at mom's. OP YTA.",
              "id": 72,
              "comments": [
                {
                  "score": 132,
                  "content": "I was about to comment the same thing. They are both the common denominator. Note OP is doing the same thing in this new living arrangement: enabling and minimizing his wife's absurd selfishness and frankly insane reasoning.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Specifically, OP is an enabler. From what we have to go on here, Dahlia's behavior honestly sounds like it could be narcissistic- trying to ensure she's always the center of attention by always portraying herself as the victim.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1594,
          "content": "Don't forget that she got upset because he *walked* *past* the open door where she was laying down. Like he can't even walk around his own home just in case she's in a room with the door open!",
          "id": 75,
          "comments": [
            {
              "score": 773,
              "content": "Right?! Also, why couldn’t she have closed the door if laying down is such a private act?",
              "id": 76,
              "comments": [
                {
                  "score": 71,
                  "content": "I must be an exhibitionist, I lay down on couches with other people present at times",
                  "id": 77,
                  "comments": [
                    {
                      "score": 54,
                      "content": "What a ho.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 451,
              "content": "Laying down was a euphemism for frantically masturbating, right?\n\nCos the literal meaning of those words put together makes fuck all sense. Absolutely batshit.",
              "id": 79,
              "comments": [
                {
                  "score": 168,
                  "content": "Exactly! And even then, frantic masturbation is something you close the door for.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "I could not get past this. What is he not supposed to be living in HIS home while they’re staying there? If you don’t want someone to see you laying on the bed, close the fucking door. What.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "The door SHE left open when she knew she was going to lay down. All the problems feel manufactured. I hadn't even thought about her maybe doing some of this intentionally to force his hand and maybe get thrown out so she could go to her family. Either way it's all manufactured by her. How is she upset at anyone else about the drink when she as smiley responsible? Same with the bedroom, SHE controlled that situation by leaving the door open. And the wedding picture request is SO unreasonable it feels made up.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 613,
          "content": "Soon as i read they had problems with the mother, And they didn’t go into details, I knew it had to be them. Lol",
          "id": 83,
          "comments": [
            {
              "score": 97,
              "content": "The missing missing reasons.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Ahem… they didn’t have problems. “Issues arose”. /s",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Agree, wife is gonna burn a lot of bridges for this man.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9642,
      "content": "YTA, and your wife seems to be systematically driving wedges between you and important people in your life. Maybe that’s worth examining. If Dahlia has issues with *everyone* in her sphere, I promise she’s the issue.",
      "id": 87,
      "comments": [
        {
          "score": 1479,
          "content": "Common. Denominator.",
          "id": 88,
          "comments": [
            {
              "score": 422,
              "content": "If you smell dog shit everywhere you go, check under your own (or your wife's) shoe.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 818,
          "content": "yeah this \"sensitivity\" thing totally smells like it could be a covert narcsissist situation... victimizing themselves over random or trivial things to bring attention/coddling towards them. been there",
          "id": 90,
          "comments": [
            {
              "score": 454,
              "content": "Yeah. OP blames his wife's \"conservative background\" but that's not what this is about. It's a dominance thing from the wife. She's trying to assert dominance in another person's home by asking for something \"simple\" then refusing to leave the bedroom because her attempt at dominating has proven futile.",
              "id": 91,
              "comments": [
                {
                  "score": 229,
                  "content": "I suspect it’s to isolate OP by burning his bridges with everyone he has a close relationship with, in order to have complete control over him. It’s classic emotionally abusive behaviour, and she definitely sounds like she fits the bill, given her passive-aggressive outbursts and ridiculous demands.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 221,
                      "content": "Ding ding ding. Took her three days to have a problem with a wedding photo she’s passed every day because she’s evaluating her options and decided that was her best next plan of attack. This guy has got to run.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Honestly, the wife sounds really controlling.  Someone walks past the guest bedroom in their own house and she freaks out about it?  Then she loses it over a picture of a couple kissing?  What's next, Anthony and his wife have to move out of their own home because Dahlia is uncomfortable knowing that they've had sex in it?",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "Yo, that's an extra layer I didn't think of. I was just thinking that she was controlling and hostile and mistreating people in their homes. But he should look at whether she makes issue with other significant people in his life",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "What's that called when someone systematically diminishes their partner's support system and keeps them from having outside resources? Spicy nation? Intonation? And who is it that does that kind of thing again? Is it a majestic diffuser?",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6284,
      "content": "YTA Let me guess, the issues you had staying with your mother had everything to do with your wife being absolutely ridiculous? This isn't about being from a \"conservative home,\" so what is really going on here? Was she raised in a cult, is she affiliated with some fringe religious group?\n\nSeriously, you're staying in THEIR home and throwing a fit over him... Kissing his wife in a photo? And your wife is throwing a fit and refusing to leave her room until they take down their perfectly normal wedding photo?\n\nAnd your comment about just doing it to keep guests happy is so baffling given the situation. Like, the photo isn't the issue here. And it's not the only problem that's already happened. So, your wife also freaked out after accidentally taking a sip of his water, does this mean he's also not supposed to drink water in his own home to keep her comfortable? And then she got all upset because he had the audacity to walk past the door, which she had left open, while she just happened to be sitting on the bed. So, he's also not allowed to walk through his home. What else is he not going to be allowed to do in his own house, breathe?\n\nIt would be bad enough if you were just guests that were visiting for a weekend, but this guy was extremely generous to allow the two of you to stay there while you figure out your financial burden. You're not even guests in the traditional sense, you're basically just roommates who aren't contributing financially. And this is how you treat him for taking you into his home?\n\nWhat is really going on with your wife? And why are you enabling this atrocious behavior and extreme entitlement? You letting her continue with her childish tantrum, in SOMEONE ELSE'S HOME, is making you as much of an asshole as your wife. Though, I do wonder if there's an underlying mental illness behind your wife's behavior.\n\nYou keep this up you're going to need another place to stay. And I'm sure that your wife will inevitably get you kicked out of the next place, and the place after that.",
      "id": 97,
      "comments": [
        {
          "score": 1562,
          "content": "If I were Anthony, and for some reason didn’t want to kick them out yet, I’d 1000% not apologize if I knew it would keep her in her room. I mean, I wouldn’t apologize anyways, but bonus.",
          "id": 98,
          "comments": [
            {
              "score": 862,
              "content": "Anthony qualifies for sainthood just for putting up with this nonsense as long as he has.",
              "id": 99,
              "comments": [
                {
                  "score": 35,
                  "content": "If this was my house I would be sending them on their way with a nice cardboard box.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I’d be reprinting the picture as posters and hang one in every common area room.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1082,
          "content": "Wait until the wife comes home and there's the possibility of consummation. Are they also not allowed to do that with 'guests' under their roof? Dahlia needs therapy. And OP needs to realize that his wife is a problem, or has a problem, and he can't fix that by asking everyone else to cater to her demands. She has the problem, she can fix herself.",
          "id": 102,
          "comments": [
            {
              "score": 502,
              "content": "I thought about that, sort of. I find it hard to believe these two will be staying much longer, but I can't get over how hilarious her reaction is going to be to them doing something as simple as a quick peck hello when she comes home.\n\nI legitimately do not know if this is a mental health crisis, or if she grew up in an extreme household where this is what she was taught was normal, though I suspect it has to be both.\n\nAnd I can't get over the fact that OP, like you mentioned, just thinks everyone should cater to her and her insane demands. Like, this is a serious problem and enabling her is surely part of how it got to this point How can he honestly type all of this information out and think his friend might be the asshole in this situation!?\n\nAnd his brushing it off as her being from a \"conservative household\" is so eerily similar to people who just brush off the most toxic, abusive behavior because someone is from a \"very traditional household.\"\n\nHow can someone be so oblivious to how disturbing and unreasonable this behavior actually is? Part of me hopes the responses here are the wake-up call that OP so desperately needs.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 447,
              "content": "“Do you think your wife could move out so she doesn’t make my wife uncomfortable with her PDA?  Just as long as we’re staying here.”",
              "id": 104,
              "comments": [
                {
                  "score": 338,
                  "content": "\"Could you maybe not pee or like, shower in your home while we're here? My wife is uncomfortable with your penis existing in her vicinity.\" When does it stop?",
                  "id": 105,
                  "comments": [
                    {
                      "score": 112,
                      "content": "“Can y’all just get a hotel until we figure this out? She doesn’t appreciate you waking up before her”",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 96,
          "content": "I just let her stay in the room. It's going to be really uncomfortable when she needs to go to the bathroom.",
          "id": 107,
          "comments": [
            {
              "score": 70,
              "content": "She’s acting like a kid threatening to hold her breath to get her way.  At some point she’ll get hungry and have to use the bathroom.  She’s going to have to get over herself",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 50,
          "content": "Yeah I mean they aren’t guests at this point, they’re freeloaders.  Even if they were guests they are WAY out of line here",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3304,
      "content": "YTA\n\nHe's nice enough to let you live at his house—for free—and you're asking him to *redecorate* for you? Of all the nerve. \n\nAnd your wife kicked up a fuss when Anthony *walked down the hall past her door*? It was *she* who didn't shut the door, for Pete's sake. \n\nIf I were you I'd start packing, because Anthony is about to throw you guys out.",
      "id": 110,
      "comments": [
        {
          "score": 740,
          "content": "If I were Anthony I would be packing for OP.",
          "id": 111,
          "comments": [
            {
              "score": 403,
              "content": "If Anthony was a real friend, he’d just make Dahlia move out, and ask OP to stay for a long chat about healthy relationships.",
              "id": 112,
              "comments": [
                {
                  "score": 53,
                  "content": "He's probably tried, and OP didn't listen.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 58,
              "content": "And this is just from op's perspective. With guests like these you can be sure that Anthony and his wife have a laundry list of complaints. These sound like the kind of guests who leave their dirty dishes everywhere and make demands about what you cook for dinner. \n\nYTA op and so is your wife. You are living off of someone's generosity and they are the ones who set the house rules, not you. Tell your wife to get over herself.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2222,
      "content": "YTA. I don't care if it's a full frontal nude on the wall. Beggars don't get to be choosers. If it bothers your wife so much then leave. \n\nYour friend is being incredibly generous by letting you stay there. Your wife's request is beyond unreasonable.",
      "id": 115,
      "comments": [
        {
          "score": 315,
          "content": "I would argue now is the perfect time to put some nudes up.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1884,
      "content": "YTA and this is a deeply unreasonable request from your wife. I simply do not know what else to tell you",
      "id": 117,
      "comments": [
        {
          "score": 632,
          "content": "I agree. I'm speechless with such entitlement from OP and his wife. And she's refusing to leave the room until her crazy demands are met?\n\nOP, one question, considering you will be homeless soon, does the guest room has a direct exit to the street? Your wife will need it. You can leave through the front door though when you get kicked out.\n\nThe entitlement, wow!",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1579,
      "content": "YTA. Go stay in a hotel. If I was your friend, I would have kicked her to the curb for her entitled self absorbed attitude. What gives you the right to go stay with someone as a favor and make it so they can't feel comfortable in their own house? No wonder why there were issues between her and your mother.",
      "id": 119,
      "comments": [
        {
          "score": 167,
          "content": "Indeed, to respect your friend you should absolutely leave his house immediately. You can apologize to him when you're out of his house, but your wife should in no way still be there since she's already multiple times tried to bully him in his own home and is currently giving him the silent treatment, in his own home where you are staying for free",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Hotel is not an option because non-married people are allowed to stay there. hehehe",
          "id": 121,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 42,
          "content": "But a man might walk past their room *gasp*",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}