{
  "post content": "I know that weddings are a big deal and lots of planning goes into it. However I am very torn. \n\nMy (22f) little sister (18f) got engaged to her long time bf a few months ago. I live in a different state to her and travel can be expensive. Especially during holiday seasons. \n\nI’m a full time student studying a very intensive course, midwifery, and next year I have two 6 week placements at the hospitals. My sister had already stated she was going to have an engagement party in April and it became a massive fight when I said that logically I would not be able to go. It is during one of my placements, I am saving to move with my bf and like I said it is expensive during Easter holidays. I felt really guilty, but after lots of back and forth she accepted it and we were able to talk again. \n\nNow I love my sister I do, and I would want to be there for her, but she told me yesterday that she will be surprising people during the engagement party and turn it into the wedding. When I asked what about people who would t be able to make it for an engagement party but would want to for a wedding she said that anyone who actually cares for her would be at the party no matter what. I kinda felt like it was a stab at me. \n\nI told her I will 100% try and be there. But I don’t think it would be possible on that date. I just found out our other sister (we don’t speak) is graduating her college course that month as well and may have trouble going. As well as most of the family live out of state and would have trouble going during the busiest season of their business. \n\nWould I be the ass hole for asking her to change her wedding date. \n\nPs. Hope your not on reddit but if you do see this and recognise me sis I love you but just as very torn.\n\nUpdate:  after lots of chatting between the family she has decided to move the wedding to the end of the year and not to do a surprise one. Whilst I would prefer she not get married so young and maybe travel instead with her partner, she is dead set on marriage. Can only support her and try to be there for her. She isn’t happy with me, but has been willing to compromise.",
  "id": 1,
  "comments": [
    {
      "score": 6860,
      "content": "I can't believe I am saying this after that title but NTA.\n\nThe engagement party is a surprise wedding? What is up with that crap? You CANNOT reasonably expect people to travel for both. People travel for weddings, not engagement parties. So she is going to be pretty disappointed with the turnout. She is definitely showing her age with these immature shenanigans.\n\nEdit: thank you for the silver",
      "id": 2,
      "comments": [
        {
          "score": 2025,
          "content": "Op should tell the sister “sorry, I’ll try and make the next one”",
          "id": 3,
          "comments": [
            {
              "score": 1102,
              "content": "At 18 and with that level of maturity, I would not expect it to be her only wedding. Statistically speaking.",
              "id": 4,
              "comments": [
                {
                  "score": 304,
                  "content": "All teenage long term relationships I personnaly know, where mariage was involved, indeed ended in divorce a ridiculous amount of time later",
                  "id": 5,
                  "comments": [
                    {
                      "score": 115,
                      "content": "Same. In my tight clique of 6 people, 4 got married young, 2 did not. 1 guess who's married and who is not.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "Of the 8 couples in my highschool graduating class that got married immediately afterward, only 2 were still together 5 years later.\n\nIt'll be 30 years next year, and both my husband and I and the other couple are still going strong.  But I absolutely understand why the others didn't, and we refuse to recommend it when asked.  It worked out for us, but it was incredibly difficult on occasion.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Met my husband when I was 16, moved in at 18, married at 21. It’s very young where I come\nFrom.  Still together after 20 years :)",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Weirdly I know of two relationships that started out, one in middle school, the other in high school, and they've been married for 20+ years. So it IS possible, but yeah, unlikely. These friends are just the statistical anomaly.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Anecdotal, but I was married at 18 and divorced by 21. Completely agree.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "I better tell my buddy his 24yr relationship/marriage is doomed.  I hope his 3 children (18/17/15) don't take it to hard.\n\nOh well.  He's only 38. Lots of time to meet the right one yet.\n\n(Personal anecdotes don't mean much)",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I know of very few high school sweethearts making it long term. Reality usually intercedes.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I appreciate your addition of \"statistically speaking\"",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 265,
              "content": "Yes OP should ask the sister to delay the wedding by 10 YEARS",
              "id": 14,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 104,
              "content": "My uncle actually said this to my aunt when she married her 5th husband and it was 8 hours away. A lot of us didn't attend due to logistics and, well, it being her 5th one and all.",
              "id": 15,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 49,
              "content": "Oof. Sick burn.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My FIL's brother called him on the day of FIL's third wedding to say congrats and apologize that he couldn't travel to it. FIL said, \"That's ok, you can come to the next one!\"",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My Dad justified missing his sister's second wedding by saying he went to the first one.",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Snicker",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 877,
          "content": "[deleted]",
          "id": 20,
          "comments": [
            {
              "score": 257,
              "content": "[deleted]",
              "id": 21,
              "comments": [
                {
                  "score": 276,
                  "content": "Their anniversary party is secretly a divorce! Surprise!",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "RemindMe! 18 months",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 76,
              "content": "This exactly. Little sister sounds very immature, OP, I think there's way more issues here like, why is she getting married at 18. Especially if she doesn't even have the manners to make sure her own family can be there? NTA OP, and sorry you're dealing with this",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "This response needs to be higher.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That’s how I was leaning!",
              "id": 26,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 297,
          "content": "The girl is 18. There's no way she understands the real life obligations of others yet. Time to up and get married!\n\nNTA.",
          "id": 27,
          "comments": [
            {
              "score": 54,
              "content": "This is exactly what I was thinking. Yikes yikes yikes. Not saying every 18 year old is too immature for marriage but this one clearly is right now. Why rush into such a huge life event... I’ll never understand! This is just a recipe for a divorce within 3-5 years.",
              "id": 28,
              "comments": [
                {
                  "score": 22,
                  "content": "I'll say it. 18 is too young for marriage. Your brain isn't fully formed yet. And the part you're waiting on controls long-term planning and consequences.\n\nI don't think it should be illegal or anything, though. If you intend on being together for the rest of your lives, why the rush?",
                  "id": 29,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I agree generally it’s too young for marriage, and that there should be no rush to step into this huge next chapter of your life. But it’s just facts that some people can handle getting married at 18. It’s becoming less common for good reason, but there’s many instances where people get married that young and make it work... just like some people have a baby at 18 and make it work. It’s probably not the ideal or easiest path but some people mature fast and can step up to the plate.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Also, am I the only one that finds it extremely creepy and weird that they're married at the age of 18?\n\nI mean...if her boyfriend is like 20(Which is likely), then it means that he waited for her to get to the age of 18. That's just weird at such an extremely young age, she's still a teenager. I have no idea what's with this sister and her boyfriends' minds.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My auntie was 19 when she decided to get married. Her fiance hit her on the day they announced their engagement. Initially she had second thoughts, but she confessed her doubts to her mom and her mom somehow convinced her that everything would work out fine.\n\nLater, her parents saw how he talked to her in private, and told her she shouldn't go ahead with marrying him. \n\nBut then, the wedding invitations had been sent out, and she had proudly distributed them to her colleagues at her first job. She tells me she didn't want to disappoint them and/or look stupid in front of them, so she went ahead with the wedding. \n\nWhat followed was years of abuse. She got divorced after too many years in the marriage. She has been married to a really nice person for nearly fifteen years now, but the abuse from the first marriage was so bad that she still has severe anxiety issues, hoarding issues, claustrophobia, agoraphobia, and can't socialize without having a PTSD type reaction.\n\nSo, yeah, don't get married young.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 171,
          "content": "Idk she could just be making up BS to get OP to turn up. Reasonably OP can't confirm without ruining the 'surprise'",
          "id": 33,
          "comments": [
            {
              "score": 106,
              "content": "This is exactly what I was thinking. \"oh I changed my mind but I'm glad you're here!\"",
              "id": 34,
              "comments": [
                {
                  "score": 18,
                  "content": "In that case, little sister is SUPER TA.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yup",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "She could confirm with the groom perhaps?",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 94,
          "content": "[deleted]",
          "id": 38,
          "comments": [
            {
              "score": 28,
              "content": "Everyone else responding has hit the nail on the head. The bride and groom came from MASSIVE families (bride's mom was one of 9 kids, and her dad one of 12), grooms family was slightly smaller but still huge. Having a surprise wedding was a way to plan quickly, avoid the drama about not getting married in a church, date, location, why aren't you inviting aunt June and her 6 six kids, and all that.\n\nThe bride told me once that if they were to get married just family invites would total something like 275 people. Surprise wedding meant that they could just get married like they wanted to.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "But why?",
              "id": 40,
              "comments": [
                {
                  "score": 66,
                  "content": "Sometimes it’s a way to elope and still have people there.  All the people trying to second hand plan your wedding can be stressful for people.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "One reason I can think of to do this is to avoid the drama of \"why are you not inviting x?\"\n\nThe slightly further family members and friends you invite to the \"engagement party\", if they come that's great and shows they care about you, if they don't- they can't complain that they weren't invited...\n\nThe really distant family, parents' friends, etc., you just don't invite. These are people who wouldn't personally be insulted for not being invited, but your parents/grandparents etc. can give you a hard time if you plan a wedding and don't include these people - but if they don't see the planning and are surprised in the event, they'll just be surprised and excited and wouldn't really care about those extra people not invited.\n\nThis is, of course, assuming you can really be certain that the people you really care to see there will actually be able to make it, which isn't the situation here.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I don't know about this. I would be less likely to change my entire schedule around to attend someone's engagement party compared to someone's wedding, regardless of how close I am to them. I would for sure make an exception for someone's wedding, but an engagement party is basically just a party, and generally, people don't travel/miss work or whatever for that. And to give another example, sometimes people have to arrive late to parties because of work or school or something, but imagine if they get there late and find out they've missed an entire wedding.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Correct me if I'm wrong, but isn't the wedding date pick out first? So in this case, not inviting those people might be a big deal because they were planning on attending the wedding.",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Chance to reduce drama? Reduced return on gifts vs expenses? Didn’t want certain people there and knew this trick would work?",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 78,
          "content": "A good friend of mine had a birthday party she kind of made a big deal about. I almost didn’t go because Reasons (unexpected guests I didn’t know if I could bring but didn’t want to ditch) but did go in the end and it turned out it was her wedding!\n\nShe would have been a bit disappointed but she would have understood . And it was amazing too! \n\nThis sister sounds like an ass though, also, she’s 18, wonder if she’ll actually go through with the wedding.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "I think she got the idea from Parks and Recreation",
          "id": 47,
          "comments": [
            {
              "score": 20,
              "content": "April and Andy seem much cooler then Op's sister",
              "id": 48,
              "comments": [
                {
                  "score": 1,
                  "content": "True that. I’d have gone to their wedding party.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "And they got the idea from Brad Paisley and his wife, Kimberly Williams.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "April and Andy did it!",
          "id": 51,
          "comments": [
            {
              "score": 2,
              "content": "Yes and it rocked!",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "I know people who did the “party is the actual wedding” thing and it was 100% because they didn’t think it was serious and they didn’t want to pressure people into coming.",
          "id": 53,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "This is literally an episode of Parks and Rec...",
          "id": 54,
          "comments": [
            {
              "score": 8,
              "content": "Parks and Rec did it better :)",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3206,
      "content": "\"Surprise! The minor party you thought would be preceding the actual wedding by months was the wedding! Anyone who didn't come to my WEDDING is now showing that they HATE ME HATE ME HATE ME!!!!!\"",
      "id": 56,
      "comments": [
        {
          "score": 695,
          "content": "Chalk this up under “reasons 18 year olds shouldn’t get married.”",
          "id": 57,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 689,
          "content": "10/10 translation, sounds just like what the type of person who gets married at 18 would say. \n\nI'd be more angry on OP's behalf if her sister was actually a full-grown adult pulling this kind of stupid BS. But as it is, she's a teenager rushing into marriage with (probably) her first boyfriend, so... what else can you expect?",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 467,
          "content": "And i didn’t get any gift boohoo",
          "id": 59,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 187,
          "content": "So 👏🏼damn👏🏼accurate👏🏼👏🏼.\n\nI wonder if OP’s parents know about this. I know my mom would’ve flipped her shit at being caught off guard with this. I get it, it’s your engagement/your wedding and you can do what you want, but this is taking it way over the fucking top.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "I think her sister's pregnant and just trying to get married as soon as possible to hide that.",
          "id": 61,
          "comments": [
            {
              "score": 21,
              "content": "If that was true they wouldn't put it off til April.",
              "id": 62,
              "comments": [
                {
                  "score": 6,
                  "content": "If she's barely pregnant now she'd be about 6 months along then, it's theoretically possible to hide it at that point depending on how the pregnancy develops.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Still seems risky. Then again, so does everything about all of this, so",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Unless the wedding is actually a SURPRISE BABY SHOWER!!!",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "A logical and very likely conclusion.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "That, or just saying she’s going to do this to try and guilt OP into coming.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "And sucks to be you if you already bought tickets to travel for the actual wedding!",
          "id": 68,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "🤣🤣🤣 Wow great translation!",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Also waiting for the follow up post of her complaining no one brought major gifts when they thought it was an engagement party...",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1323,
      "content": "NTA. She has control over when she gets married. And yes, her wedding is important, but that doesn't mean other people don't have other things going on that are important too. Life doesn't stop every time someone gets married. So she needs to drop the attitude that anyone who cares about her will forget everything else going on in their lives and jump at her command. She would do well to remember that while the people who really care about her will do their best to be there, she needs to show those same people that she likewise cares about them and their presence, and will try to make this happen when they can be there without disrupting everything else in their lives.",
      "id": 71,
      "comments": [
        {
          "score": 173,
          "content": "What weirds me out is that you have a wedding for other people? Otherwise just elope. So if you want other people there don’t spring the wedding on them and claim ‘everyone who couldn’t come doesn’t love me enough to attend what they didn’t know was the wedding’\n\nEdit: used the wrong there",
          "id": 72,
          "comments": [
            {
              "score": 38,
              "content": "I don’t know if it’s for other people so much as getting attention on your special day. As the child who’s been pushed to the back burner most of my life I’m excited for my future wedding cause it will finally be a time I get what I want and get to be selfish. \n\nI still think the sister is stupid for the surprise wedding.",
              "id": 73,
              "comments": [
                {
                  "score": 8,
                  "content": "I think it’s a mix!\n\nYou’re right, it should be what you want and you should feel like it’s your day! And sister is wrong, it is about having other people there. \n\nI hope your future wedding is everything you want it to be!",
                  "id": 74,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I hope so too! I know I’ll save up for it! Honestly my dream wedding is pretty simple... only 3 things could make it go wrong.\n\nMy father dying and not being there to see me happy.\n\nMy church I want and grew up in no longer being around cause it’s almost bankrupt \n\nBeing pressured into letting children at my wedding.  (My nieces and nephews are straight up bullies to me and I don’t want them there)",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Man I don't wanna bum you out... but as a fellow back burner child who is currently planning her wedding, I will tell you, my family is somehow STILL making it all about them. Your results may vary re: having something actually be about you for once. My partner and I have been going back and forth on eloping for months because I'm sick of it.\n\nI really hope things work out for you, but I wanna save you some shock and disappointment if they don't :(",
                  "id": 76,
                  "comments": [
                    {
                      "score": 2,
                      "content": "My 4 older siblings got it to be all about them and lately (thanks to my outbursts of what I like to call scream crying) my dad has been trying to prioritize me more. They’ve finally realized that all the shit I’ve been through this past year wouldn’t have happened if they had just paid attention to me. They are finally noticing the kids biting and hitting me and screaming over me when I speak. They are slowly starting to change and it’s AMAZING but really slow",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Why? A surprise wedding sounds like a great compromise between a wedding you might not want to/ be able to pay for and eloping. As long as you don't hold it against people who can't make it, I think it's a totally valid way to go.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yeah but this bride sounds like she is holding it against people",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -2,
                  "content": "Yeah that’s not why people have a wedding. It’s to gather your friends and family together to make a public commitment and celebrate the fact that you’re in love. Not an opportunity to be selfish. If that’s your reasoning you’re basically the sister getting married in this story, and every woman in the Bridezilla show? (Also, why not just hold a big birthday party for yourself in that case?)",
                  "id": 80,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I mean yeah I’m getting married to show my love and I’m not going to get married *just* to be selfish. If was going to get married just to be selfish then I would be married by now and out of my house tbh. If I find someone I love and want to spend my life with I’m marring them. But I’m also going to use it as an opportunity to finally get to pick things for myself you know? My birthday parties and what not have always been picked by my parents and I’ve never even been able to have friends over. My wedding will be my choices. (And my fiancé’s assuming he wants to be involved in the planning). \n\nWhen I think of it I picture my church with pretty cobalt blue and white flowers with silvery glitter ribbons. And no kids screaming over me or biting me. Finally getting dance with someone to music I enjoy instead of sitting around listening to southern gospel. Getting the food I want that doesn’t make me sick. Finally having the fruit salad made without the blueberries that make me throw up. Chocolate cake instead of the coconut cakes I can’t stand. Walking down the aisle with my hair done and a pretty dress entirely my style and a shiny tiara to commit myself forever to a man I’ve chosen and who has chosen me, not some random Christian guy my mom wants me with. \n\nThese are the things I consider allowing myself to be selfish. Getting to pick for me instead of what works best for the family and traditions",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "A wedding is an event that you are hosting, that you invite guests to.\n\nWhen you invite guests, you have to be considerate, and think of other people.\n\nA wedding is more than “IT’S MYYYYYY DAAAAAYYYY.” There are other people, and quite a lot of people seem to have lost focus of that. Yes, it is in bad form to wear white to someone else’s wedding. Yes, you should graciously decline if the wedding is a tacky gift grab, or you simply cannot attend, or if you have been in a committed relationship for years and someone is being an asshole and saying you cannot bring your partner because “engaged or married couples ONLY”. You should not feel obligated to invite every person your mother or future mother-in-law has ever known.\n\nBut ultimately, it is a party you are hosting for other people. It’s not solely YOUR DAAAAAAY.  If that’s your mindset? You are going to be disappointed in how your wedding turns out.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly why we eloped. Formal family gatherings feel so awkward to me. Doesn't help that my mom and dad + stepmom don't want anything to do with each other. It was literally just me, my husband and the judge on our \"wedding\". \n\nMy step sister on the other hand is very traditional and had a church wedding followed by a reception. Nothing wrong with that at all, I was very excited for them. I wasn't able to attend though. It was in our home country, around the time the travel ban was a thing and my husband didn't feel comfortable with me and my daughter leaving the country. She still wanted us to have a small part in the wedding so she asked us to film a video for her, saying what I would've said in my speech if we made it there and she played it during the reception.\n\nTo OP, don't feel bad about not being able to go. It is a special day for someone you care about but it's just that, a day. You have your studies to worry about which would have major implications for the rest of YOUR life. If she refuses to acknowledge that then she's she's the asshole.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "[deleted]",
          "id": 84,
          "comments": [
            {
              "score": 29,
              "content": "[deleted]",
              "id": 85,
              "comments": [
                {
                  "score": 12,
                  "content": "Good for you for nipping it in the bud straight away! Straight out asked her who's paying and made it clear you won't participate, no messing around. Her childish reaction (it's all about meeeeeeee!) shows just how right you were to dodge that bullet.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 12,
                      "content": "[deleted]",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It’s neither customary for the bridesmaids to have their stuff paid for, nor choose what they wear, so I can see why the bride said no to that?",
                  "id": 88,
                  "comments": [
                    {
                      "score": 2,
                      "content": "It's becoming more and more common for a bride to have a color and a style and let the bridesmaids pick out their own dresses. I think it's considerate to let your best friends get something they feel comfortable in and can afford, plus I think it looks great to see the group similar but not identical.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "The bridesmaid shit is crazy. Like, presumably you LIKE your bridesmaids? And want them to be happy and not go broke. I've been in three weddings-\n\n\\- One, we wore the same dresses but we had a group convo picking them out to make sure everyone liked them and they were inexpensive. It's floor length and sparkly so I haven't found a good reason to rewear it, but I really like it so I keep it around (might be good for halloween.) \n\n\\- Second, the bride gave us a color and approximate length and we found something (and I LOVE the dress I got for that one, I rewear it to almost every other wedding, haha)  \n\n\n\\- Third, the bride had a particular David's Bridal color picked out and we could pick from the styles they have. This was most expensive and I liked that dress least because DB is kinda bleh, but I was able to get one on sale so it was still very manageable. Sold that one, because there are always people wanting DB dresses.   \n\n\nWhen I got married I gave my bridesmaids a general color family and told them to go nuts. I wanted a variety of textures/shades.   \n\n\nWhat I'm learning is that I did a good job picking friends (well, one of those was my sister).",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": ">So she needs to drop the attitude that anyone who cares about her will forget everything else going on in their lives and jump at her command. She would do well to remember that while the people who really care about her will do their best to be there, she needs to show those same people that she likewise cares about them and their presence, and will try to make this happen when they can be there without disrupting everything else in their lives.\n\nShe's 18.",
          "id": 91,
          "comments": [
            {
              "score": 34,
              "content": "She's grown enough to get married. She's grown enough to understand that other people have lives outside of her wedding. I get this is the most important things in the world TO HER. That doesn't make it the most important thing in the world to everyone in her vicinity.",
              "id": 92,
              "comments": [
                {
                  "score": 2,
                  "content": "Clearly given her actions she does still think the world revolves around her and she's obviously far too young and immature to get married. Her behavior surrounding her wedding is a moot point. She shouldn't be getting married, period. You're completely correct about what she *should* understand about her wedding. I'm just pointing out that she's still years of life experiences away from being able to fully understand that. She needs to grow up still. She *doesn't* understand those things yet.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I also just want to point out she's 18, he's 22, they've been together long enough to call it \"long term.\" Those ages give me the creeps. \n\nThat said, she's probably going to find out from this wedding that people have their own lives. Hopefully a harsh lesson early on like this will teach her about life and these kinds of things and she'll mature from it. Hopefully.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 2,
                      "content": "OP is 22, not the fiance. (Unless that's mentioned somewhere else and I haven't seen it yet.)",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Na, und?\n\nMy ten year old niece has figured out that not everything is about her and that other people can't rearrange their lives to suit her whims. If a literal child can understand that her uncle can't make it to her entire birthday party because he won't be off work until after it starts, an 18 year old should be able to understand that her relatives can't attend her engagement party due to work or school obligations, or financial constraints. And an 18 year old should *definitely* understand that a lack of attendance at an engagement party does not mean these people do not care about her or don't want to attend her wedding, so she should know better than to make it a surprise wedding to see who \"really cares\" or whatever.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[deleted]",
          "id": 97,
          "comments": [
            {
              "score": 1,
              "content": "I didn't catch the last post. But I feel like she's being the asshole because she is expecting her engagement party to be treated with the same importance as the wedding itself, and demanding that anyone who cares about her show up, regardless of the consequences it has on their lives. Most people don't know it's going to be her actual wedding. And she scheduled it during a time when a good portion of her family would not be able to make it. That's an asshole move.",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 527,
      "content": "NTA - Fist of all \n\n>little sister (18f) got engaged to her long time bf a few months ago.\n\nMy ass long time bf...\n\nYour sister sounds incredibly immature, in no way is she ready to get married.  \n\nWho cares if you go to her wedding or not, she's gonna be divorced in less than a year, I guarantee it.",
      "id": 99,
      "comments": [
        {
          "score": 112,
          "content": "She is both mature and immature is some ways. They have been together for nearly two years and have just moved to a new town together away from all their family. Do far it seems to be going alright. \n\nJust really worried she would hate me if I didn’t go. She’s already said if our father (who owns a business where Easter is on the of busiest time dog the year) doesn’t go she will never speak to him again.",
          "id": 100,
          "comments": [
            {
              "score": 473,
              "content": "If she’s threatening to cut people out of her life over not going to her engagement party, it’s better to call her bluff than to frantically rearrange your schedule so you can go. She’s doing this because she thinks it’ll get her what she wants; if you don’t indulge her, she may whine and pile on the guilt trips, but she probably won’t try to pull that crap with you again.",
              "id": 101,
              "comments": [
                {
                  "score": 38,
                  "content": "Also, if it works once, there's every chance she'll do it again. Anniversaries, birthdays, kids birthdays...",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 412,
              "content": "Nearly two years? Yeah, that isn't long time at all. Long time for me would probably start at 5 years.",
              "id": 103,
              "comments": [
                {
                  "score": 151,
                  "content": "[deleted]",
                  "id": 104,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Been with my girlfriend 6 and half years now, we've been together since she was 18, no plans to get married or even engaged yet we have been living together for over 4 years, different people take different paths in life, but I couldn't imagine being 18 and marrying someone I've only been with for 2 years sounds so rushed and like kids trying to play grown up.",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "Going on 4 years with my husband, but we've known each other since we were 13 and just passed the \"known each other for 50% of our lives\" milestone. Thank god we didn't start dating until after college (he went, I didn't.)\n\nCertain parts of our personalities are still the same, but we've changed in so many ways as we grew up",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Meet my fiance in highschool (14-15) we got engaged (20-21) getting married (22-23) \nGetting married at 18 would have felt really rushed because I'm still figuring out adulthood man",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "I am engaged to the person I started dating when I was 18, though that was 7 years ago. We have both changed a lot since then, so we probably would have had no way of working we'd still be a good fit this many years down the line. And after just 2 years, we were still basically getting to know eachother and still looking for the right way to define our relationship.",
                      "id": 108,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "My husband and I dated for a month before we got engaged and married three months later.  We were both 20 and recently celebrated our 25th anniversary.  I guess we’re unicorns because we just knew we wanted a family together and didn’t wait.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 47,
                  "content": "seriously. When I heard long term, I’m thinking at least four or five years. Not just the last half of high school lol",
                  "id": 110,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Jeez I’m in my early twenties and have been with my SO for over 3 years and it still feels pretty young at times. I still feel like a kid at points to be honest! \n2 years in consideration of life is next to nothing!",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "But HS is like my whole life man.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I think amount of time spent together is far less important here than the age of the people involved.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 2,
                      "content": "That's also true. 2 years can feel like a lot when you've only just finished high school, but that's only because you haven't lived and experienced a lot at that point. Which is another reason why you probably shouldn't be making plans to last a whole life time.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 64,
              "content": "Have you tried sending her blog posts and news articles about how everybody hates surprise weddings and it’s not gonna be as magical as she thought? (Edit) Whoops that link was about surprising the bride with a wedding which.. is pretty fucked up. Hard to find stuff about the other kind of surprise weddings.",
              "id": 115,
              "comments": [
                {
                  "score": 37,
                  "content": "I'm sorry, but the mental image I got here is a woman working in an office, typing up an email, and some dude in a tux walks in. She glances up, a bit confused, but whatever, she's got stuff to do.\n\nThen a priest shows up, things are begining to become surreal. Her family starts piling into the office in formal ware. It's standing room only, the office isn't all that large to begin with.\n\nRandom dude in a tux stands next to her in her cubicle, the Priest begins to speak...",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Link to article? would like to read anyways",
                  "id": 117,
                  "comments": [
                    {
                      "score": 20,
                      "content": "https://www.google.dk/amp/s/www.dailydot.com/via/surprise-weddings-worst-trend/%3famp \n\nHere you go, I definitely didn’t expect “something old” to be the actual ancient customs of “your wedding is happening now and you have no say in the matter” \nBut at least all the stories about it are negative.. sadly surprise weddings for the guest only have advise on how to plan it and soak up the excitement...",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "I had a surprise wedding...... I’m married. A big wedding is a huge waste of money anyhow.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "I feel incredible sadness for your father. Like I thought your sister was being an asshole to YOU, but this is beyond the pale.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "“Nearly 2yrs” is *not* long-term, especially in comparison to the *rest of your life*. \n\nThey also only just started living together? Seriously? They’re still in the honeymoon phase, and have no idea what actually living together long-term is like. On top of all of that, they’re having a pretty short engagement. This whole thing sounds like they’re sprinting towards this rosy idea of marriage without ever having gone through any hard stuff. Top that with never speaking to her ***parent*** again if he can’t make the engagement party? There’s not a drop of maturity in this child; and I honestly wouldn’t even worry about this whole situation because this relationship has not even had time to form a solid foundation, and has a huge chance of cracking under the pressure of wedding planning.",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "Shes willing to disown her own father because he cant go? Shes immature and ridiculous and shouldnt be getting married. 18 is not mature at all if shes saying people who cant go dont love her. If she hates you thats her loss. NTA",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "Yeah like I said she immature as hell and this is NOT how you plan a wedding. Don't worry if she will be mad, she'll be crawling back in no time, to your father too.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Your sister sounds like a brat.  Ask her if she'll move it, but if she won't budge and is prepared to continue to be a self-absorbed twerp on the topic don't break your neck trying to be there for it.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Yeah her age is showing.",
              "id": 125,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "No one that pulls that kind of temper tantrum on their dad and the rest of their family can be qualified as mature.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Ctfu. This is hilarious and I agree with every bit of it!",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "I mean, to be fair, you can have dated someone for a long time regardless of age. My girlfriend and I are 19/20 respectively and we've been together for five years. Of course, we don't plan on getting married any time soon or anything like that, because getting married at this age would just be ridiculous, lol.",
          "id": 128,
          "comments": [
            {
              "score": 31,
              "content": ">Of course, we don't plan on getting married any time soon\n\nThere you go. And I wasn't wrong. Op said they were together 2 years.",
              "id": 129,
              "comments": [
                {
                  "score": 4,
                  "content": "I see, thank you for the clarification! You're right, that's not very long.",
                  "id": 130,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "[deleted]",
              "id": 131,
              "comments": [
                {
                  "score": 6,
                  "content": "No, you're absolutely right! I agree wholeheartedly-- that's why we're waiting, haha.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Good call!\n\nI was really worried i would offend you, but i had relationships when i was 22 thst i still didnt know wtf i wanted or needed so i always worry about people like OPs sister jumping into things like marriage or bsbies so fast",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yep, \"sorry I can't make it. But don't worry I'll be at the next one.\"",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 503,
      "content": "Nta. Your sister seems like she knows she's picking the worst time of year for everyone in your family...and doesn't care. Shes knowingly doing something that could create a rift with the whole family...on purpose?\n\nAlso kind of a crap thing to turn an engagement party in to a surprise wedding...not everyone would put the same effort in to getting to one as they would the other. Especially when it comes to travel. It's unlikely but it'd be poetic if no one showed up to the engagement party lol.",
      "id": 135,
      "comments": [
        {
          "score": 170,
          "content": "It seems like maybe she’s doing it to prove who cares about her, if they’ll rearrange their schedule at the busiest time and put themselves out for her then they really care. Like a stupid immature test.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "I actually wouldn’t be surprised if there was no surprise wedding and she was using it to guilt OP.",
          "id": 137,
          "comments": [
            {
              "score": 4,
              "content": "Had the same thought.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "We did a destination wedding because of all the family bs, knowing full well others couldn’t attend. I got flack for not sending invitations. For what? All 4 people? I’d already had the friend discussions and my family expected us to pay air and hotel for them, so I said screw it. My family didn’t bother to assist in finding a place to celebrate after we got back, so we didn’t do that either. Parents got off cheap because they didn’t pay a dime. We also got married in the middle of the week to hit a certain date. I’d had zero expectations from anyone. \n\nTo expect people to drop everything important and throwing a tantrum that they’re not loved if they don’t is behaving like an entitled brat. When/if the bride grows up, maybe she will get it.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I can think of roughly zero circumstances where I’d inconvenience myself to go to an engagement party, but there’s also almost nothing that I wouldn’t do to go to a wedding. It’s a related stance: I’ll travel for one of your events, but it seems logical to save that for the big one.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 471,
      "content": "NTA\n\nYour sister is being incredibly unfair to the invited guests if she doesn't tell them it's her wedding **and** interprets their absence to mean they don't care.",
      "id": 141,
      "comments": [
        {
          "score": 27,
          "content": "Yes, this. People can do the \"surprise wedding\" thing, but the standard advice is that it *does* mean more people will miss it.",
          "id": 142,
          "comments": [
            {
              "score": 3,
              "content": "And why do this unless you are a celebrity trying to get married without a gaggle of press? Who does a surprise wedding?",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I mean this is the attitude of a spoiled child... Which the sister may well be.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 448,
      "content": "[deleted]",
      "id": 145,
      "comments": [
        {
          "score": 49,
          "content": "If she goes through with this plan, I hope at least one person who misses it replies with \"Don't worry, I'll attend your next wedding.\"",
          "id": 146,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 174,
      "content": "Nta. Your sister is an idiot and is acting like what that she is - a child. You have plans you can't change. So your thing. If she decides to do this surprise wedding it's going to blow up in her face. Go to her next wedding because it's almost guaranteed that this marriage will crash and burn.",
      "id": 147,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 103,
      "content": "NTA - if it mattered enough to her to have all people she loves and cares about there she shouldn’t make it a “surprise” wedding. Plus, before she decided on the surprise you had already told her that your placement would make it difficult to be there.",
      "id": 148,
      "comments": [
        {
          "score": 40,
          "content": "I'm starting to wonder if the boyfriend even knows that the engagement party is a surprise wedding",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "The boyfriend knows and I think he is happy with it.",
          "id": 150,
          "comments": [
            {
              "score": 8,
              "content": "Just tell her you will go to her next one.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 102,
      "content": "NTA. your 18 y/o sister is acting like a child. shocker. like all children must learn, the world doesn't actually revolve around her. you have an important prior commitment that you cannot miss unless you want to screw up your future. let her throw her tantrum if that's what she wants to do. she's the one who's going to spoil her own day by having it without the most important people in her life, when she could have easily moved the date. she'll definitely regret it, but that'll just be one in a long list of regrets about this monumental occasion, I'm betting.",
      "id": 152,
      "comments": [],
      "relation": "Support"
    }
  ]
}