{
  "post content": "Some background...my cousin was married about 3 weeks ago. She is on her honey moon so we agreed to take her daughter on vacation with us. I love my niece, and she is stunningly beautiful, very sensitive and smart but also boy crazy as any other 17 year old. I'm only 25 so I feel I have more in common with her than I do my cousin.\n\nWe went to the pool at the resort the first day and she wore a one piece with a sarong on the way but when she took off the sarong the bottom was a dental floss thong. I mean her entire butt was out. There must be a huge cultural shift in the 8 years between us because she swam and she walked around with no fear. She has several bikinis that are even more revealing.\n\nAs we were laying I sort of brought up the discussion of was she sure that she was comfortable with the attention she was getting. She said it wasn't a big deal to her and it was the style now. She even showed me tons of pics on Instagram to back it up. And I felt like a real old lady when my 17 head old niece talked me into buying 3 thing \"kinis\" of my own that will get here before we leave...so I may be prancing around with my butt out (yikes but fun...I guess?)\n\nAll was fine until my husband's freind who lives in town came over for the day yesterday. He's the friend that I tolerate but will never like because he's never got over not being in college. I could see him checking out Alicia's butt which was really weirding me out. He had a few beers and both me and Alicia are sure he said  \"do you like asshole behind thong pics? because that's how you get asshole behind thong pics\" As she was walking by his chair. Alicia grabbed her towel and took off for the room. I told the friend that was an awful thing to say and he gave me the \"what, I was just being honest\" and then \"what I was just joking\" and then the nerve to say \"what, I was just looking out for her from the pervs around here.\" I told him to get the fuck away from us and tried of catch up with Alicia. Oh the way I ran into my husband coming back from the bar and told him his friend had to leave and don't you dare argue with me about it.\n\nI caught up with Alicia in the room and we had a long talk about how that wasn't her fault and how he was just a jerk and jerks are everywhere. She handled it very well but I suggested that maybe until my swimsuits get here, she should should wear her competition suits or I'd buy her somthing with more coverage. She got really mad at me and said I was making it sound like it was her fault what he said. I was like no, I'm not saying that at all but maybe when I have my equally revealing suits all the \"pressure\" won't be on her since they'll be another woman dressed similar. She said I wasn't making any sense and I sounded just like her mom. I told her I was really sorry, I'm trying to do my best since I'm not usually responsible for a minor. She got very insulted when I said that and hasn't really spoken to me.\n\nI feel bad but was I the asshole ?\n\nEdit: I think people are really misunderstanding and thinking I’m “blaming the victim.”  I don’t feel that way, I feel I’m saying “wait one day and we’ll be dressed alike and we can deal with the shitty comments together.”\n\nEdit: people are still installing their own narrative here, I’m sorry but you are. If you aren’t reading what I actually wrote then I’m really not inclined to listen to your judgment.\n\nEdit: well I’m out folks, either I suck at explaining or there’s a whole lot of agendas being pushed and/or forcing hours own narrative on my situation. If im telling you you’re wrong in the way you’re interpreting my actions, then you’re wrong. You didn’t hear the conversation, you don’t know me, you don’t know my niece. Anything other than what I’m telling you is your narrative. I’m not checking this thread again so spit into the fan all you like and tear me down, I’m done. I gotta tan my ass in my new “kini” with my bomb ass niece who understands the world far better than a lot of you. Bye",
  "id": 1,
  "comments": [
    {
      "score": 4065,
      "content": "ESH except your niece.\n\nDo not teach her that she needs to change because grown ass men are assholes. Your husband's friend is a total douche and you absolutely were blaming her for what he did.",
      "id": 2,
      "comments": [
        {
          "score": 910,
          "content": "Exactly, it's not up to her niece to stop older men being weird creeps. She can wear what she wants, the rest is on them. \n\nESH, except your niece.",
          "id": 3,
          "comments": [
            {
              "score": 156,
              "content": "Sure you could say that and you’d be right on paper, but until you develop skin so thick that verbal sexual harassment doesn’t phase you anymore, pervs and jerks will comment and make you feel like shit.\n\nEdit: of course that’s not the only reason people will harass you, but my point is that OP advising her niece to cover up, at least in this case, is similar to telling women to not walk that sketchy alleyway at night.",
              "id": 4,
              "comments": [
                {
                  "score": 378,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 216,
                      "content": ">The niece is perfectly capable of deciding for herself if she wants to let other people's behavior dictate her own. She's 17. This isn't her first time being sexually harassed and it won't be her last.\n\nI completely agree with this. The niece doesn’t need to change her behavior, the creep does. Telling him to get to fuck was well handled. But OP overstepped by suggesting the niece change her clothes. She can wear whatever she wants. She was uncomfortable with his creepy comments, not with what she was wearing. ESH except the niece.\n\nHaving her not wear something revealing until you get your revealing swimsuit also doesn’t make much sense. It’s like saying, “Let’s wait until we can be harassed in solidarity.” How does that improve the situation in any way?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 85,
                      "content": "I am a huge fan of Caitlin Moran, a feminist writer and was lucky enough last year to go to a talk by her. Someone asked her a question about how you deal with balancing wanting to be supportive of a teenage daughters choices with wanting to be more expressive in their sexuality. Moran replied that her before her own daughter started going out in more revealing clothing, that she would be prepared for reactions she could expect. So they sat in the kitchen and Caitlin threw random insults that a white van man might shout out the window as they passed and her daughter had to shout back comebacks. It allowed them to broach the subject, discuss it openly and let the daughter decide if she still wanted to go out wearing whatever without feeling insecure. And most importantly it brought up that there were definitely men out there who would try and take advantage of what she was wearing to make her feel bad and that it was not acceptable",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "OP is advising her niece to wait until OP's *equally revealing* swimsuits arrive and she can draw some of the creepers-gonna-creep flak off the niece. She's saying 'wear what you want, but if you hang on for a sec I can help make wearing what you want easier and more pleasant for you'.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Oh my sweet flower. Verbal sexual harassment happens no matter what you're wearing.\n\nAlso the sketchy alleyway is, statistically speaking, safer than the homes of many girls and women. You're far more likely to be assaulted by someone you know than by a stranger.\n\nAt any rate, a better prevention measure would be to forbid men from walking down alleyways or going to swimming pools. Let's let them live in the social equivalent of purdah for a change.",
                  "id": 9,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "...what? This comment is insane. OP wants to stand with her niece when she can, so they can support each other. Putting it on the men feels nice and proper (it’s true, they are the assholes here), but it doesn’t do anything to stop her niece from being harassed and feeling like shit. You can’t just hope it goes away. If they’re both wearing similar stuff and can defend each other, maybe something changes. I just want there to less harassment, and this seems like a good avenue for that.\n\nEdit: The point is the niece is being harassed. She is struggling at shrugging off the harassment, which is understandable (she shouldn’t be being harassed). Expecting to go out and for everyone to have their mind changed on the topic & her never to be harassed is a pipe dream at this moment; it’s going to take time for perception to change. In the meantime, giving her a supportive environment (OP wearing something similar & defending her while doing so) and telling her it’s not her fault seems to be the best option. In the meantime, preventing the harassment from ever coming about seems to be the best choice for the niece. It’s not fair or right, but I think it’s the best solution to the issue.\n\nAdditionally, I’m curious what the niece would have liked OP to do.\n\nEdit2: View changed, I don’t think the OP handled this entirely appropriately necessarily, but I don’t think the way she handled it made her an asshole.",
              "id": 10,
              "comments": [
                {
                  "score": 3,
                  "content": "You believe that her clothing triggered the harasser. Nope, not even close. The harasser was gonna say something disgusting no matter what.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "As a 27 year old, I can relate. Listen- you don’t want to limit what you’re wearing because other people may not like it. \n\nBut how you dress, sends a message about you. You can’t show your body and expect male and female not to notice.  If you walked around with your ass out, even I would stare at you. I am a straight woman. Do not walk out with cleavage and wonder why people are only staring at your boobs. \n\nIt would be really nice if we could wear whatever we want- and ideally- she shouldn’t give a flying fuck what other people think. But that is not the world we live in. As badly as I’d like it to change- it hasn’t. If I don’t want to be sexually harassed on the train, I’d prefer not to dress well in clothes that fit me. \n\nIt is not fair. She shouldn’t have to change what she wears to keep creeps from being creeps. They will be creeps regardless of what she is wearing. But I feel like when you are wearing items that get you attention- you shouldn’t get upset when they get you attention. \n\nUnfortunately, we do not live in a society where sexual assault, harassment and murder do not happen: these are all risks that are much higher if you are a woman. I wouldn’t like to be told what to do or wear- but I also don’t want to put myself in more dangerous situations than I have to.\n\nEdit. I won’t “stare.” I will look.i will go on about my day.  But life is not fair. But people need to realize we shouldn’t put ourselves in dangerous situations if we can avoid it",
              "id": 12,
              "comments": [
                {
                  "score": 5,
                  "content": "> If you walked around with your ass out, even I would stare at you. I am a straight woman.  \n\nI won't. I will look, sure just like I would when I see something unusual. I won't stare past that. And I'm a horny ass straight man.\n\nsays a lot about you.",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "&#x200B;\n\n>Edit: I think people are really misunderstanding and thinking I’m “blaming the victim.”  I don’t feel that way, I feel I’m saying “wait one day and we’ll be dressed alike and we can deal with the shitty comments together.”\n\n&#x200B;\n\nYour words are not \"blaming the victim\", but your actions are. By asking her to cover up (for the time being), you are putting the responsibility of not being harrassed on your niece. You might not have intended to blame her, but you inadvertently did.\n\nWhile this was unintentional on your part, your story written here was intentional. Your disdain for her choice of bikini is apparent and this is an intentional \"shaming\" of sorts. You can't say you aren't shaming your niece but dedicate the first part of your story on how her outfit is revealing, how apparently culture has changed and how her entire butt was out.\n\nI am glad you got rid of that creep immediately and stood up for your niece, but because the question if you're TA is regarding you asking your niece to tone it down... ESH.",
          "id": 14,
          "comments": [
            {
              "score": 57,
              "content": "Really don’t think OP has that much disdain for the bikinis - she bought three for herself.",
              "id": 15,
              "comments": [
                {
                  "score": 68,
                  "content": "Yea it's more like OP wants to have safety in numbers rather than \"cover it up\" kinda attitude.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 24,
                      "content": "yes! this is the way i took it too.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "If she wants safety in numbers, all she has to do is be with her niece. It doesn't matter what she wears when she's with her.\n\nAlso: There is no swimsuit her niece could've worn that would make that creep less likely to say something creepy.  Creeps find a way.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": ">  you absolutely were blaming her for what he did.\n\nNo no no don't you see...by telling the victim of the crude remark that she should dress differently to avoid more crude remarks she was actually *NOT* victim blaming lmao what a fuckin dumb edit",
          "id": 19,
          "comments": [
            {
              "score": 30,
              "content": "As a a former slutty dressing teen I agree with this statement. While it sucks that she got negative attention and that guy was out of line, the reality is of you dress a certain way you are going to draw attention. \n\nMost ppl dress provocatively bc they want attention. The trouble is that not all ppl, especially teenage girls are capable of handling all of the positive and negative attention that comes along with dresses provocatively.",
              "id": 20,
              "comments": [
                {
                  "score": 34,
                  "content": "As a former non-slutty dressing teen I can guarantee you that harassment happens on the daily even to girls dressed in oversized t-shirts. \n\nThere is no correlation between clothing and harassment.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Unfortunately, yeah, you’re super right. I’ve got a buzzcut and only wear boys’ clothes and still get gross comments from older men quite a bit. :/",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Oh HOW SILLY of me to misunderstand that.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "[deleted]",
              "id": 24,
              "comments": [
                {
                  "score": 8,
                  "content": "> I gotta tan my ass in my new “kini” with my bomb ass niece who understands the world far better than a lot of you. \n\nshe said this as if the niece isn't of same mind as reddit",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "So giving an easy interim solution while proposing a better solution is somehow bad now? This is more like \"I can't help you today but tomorrow, so it would be smart to lay low until tomorrow\" instead of \"you will die in hell for showing you Butt in public and deserve all the negative attention\".",
              "id": 26,
              "comments": [
                {
                  "score": 5,
                  "content": "She already did help her niece just fine in the clothes she was already wearing. She's not Wonder Woman; she doesn't have to put on some special sexy outfit to unleash her super powers to help her niece.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "This is terrible advice.\n\nYou don't accept drinks from strange men you haven't seen the bartender make. You tell a good friend when you go out and who you're with and when you'll check in with them the next day. You don't walk alone in the shady part of town.\n\nIt sucks these things are required, but it's also stupid to not do it.\n\nWear whatever you want. But it's statistically more likely to get inappropriate comments and behavior when you wear more risque clothing. That's not your fault, but it's also going to happen.\n\nFor example, you are 100% morally and legally justified wearing a gay pride rainbow shirt to a red neck country music concert. But you should also be ready to get called \"Fag\" and other slurs. Not your fault and the bigots are the assholes. But you should be ready for it to happen and if you don't want to deal with it sometimes it's just easier to wear plaid to fit in.\n\nLife sucks and sometimes we have to deal with it. It's not fair. It's wrong. But it's life.",
          "id": 28,
          "comments": [
            {
              "score": 348,
              "content": "[deleted]",
              "id": 29,
              "comments": [
                {
                  "score": 129,
                  "content": "This is so important!! I was literally in my business clothes for work yesterday walking my dog and four men surrounded me on the street and hold me they \"knew how to eat my p**** right\". Absolutely terrifying and I could not have been more covered up. The only thing that stops sexually harassment and rape is people not sexually harassing and raping.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 73,
                      "content": "100%. I’ve been sexually harassed in an ankle length parka and in daisy dukes alike, when I’ve been wearing makeup for a night out and when I’m sick as a dog sneezing at the Walgreens. Men who will do this shit don’t give a fuck about what you look like or who you are.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Ayup. Walking down the street in broad daylight wearing a calf-length wool coat/scarf/everything, and some fucker grabbed my ass and said \"You're gonna come home and give me more of that, sweetie.\" It doesn't matter what we wear, or don't wear, if it's night or noon or well-populated or sparse. It never stops.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Jesus Christ I’m sorry that happened to you. Where I’m from the tide seems to be turning and men even watch what they say in jest - but to know this sort of male pack mentality bullshit is making people terrified by its implication anywhere in the world is fucking awful. In the interim - pepper spray and throat punches",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "I'm sorry that happens to you and I hope that if you can't regain your confidence to wear what you want that at least OP's 17 year old cousin doesn't lose hers. The world sucks and everyone deserves to express themselves how they want to.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "The most aggressive cat calling I ever got, I was 8 months pregnant and retaining water like a sponge.  I looked like a pregnant version of the Michelin tire man in a muumuu.\n\nThe guy was so relentless and obscene, a bystander rammed him with her SUV to get him away from me and offered me a ride to my car.  This was in broad daylight, in a nice part of town.\n\nAssholes are going to be assholes.  Covering up or taking precautions might divert their attention to an easier target, but that's all it does.  That advice is just saying, \"let them abuse someone else.\"",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "Then start wearing your fun clothes again, shaving and wearing makeup if you enjoy it. People are going to be assholes no matter who you present yourself, so might as well at least enjoy what you are wearing and how you look.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "This is so true, I've been so disgusting, sweaty and stinky from a run, red faced, hair sticking up everywhere, and still get sleazed on. In fact, sometimes I think dressing up and putting on make up actually serves as a barrier because it makes you come across more haughty or unapproachable, you might get some comments or catcalls but fewer people will follow you around. Anyway it's just a fact of life women have to deal with, so might as well wear what you want. I will often comfort myself with feelings of disdain for men who grope and shout and harrass and by knowing that I'm way smarter than them and have a much less pathetic and desperate life. It can get really frightening though.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yep! I realized a few years ago that what I did had zero impact on my victimization. I am a human being and I have a right to live my life without fear, even if that means being out alone late at night or drinking at a bar with friends or wearing shorts shorter than the tank top I was wearing. If I had been victimized in any of those situations (and I wasn’t), it was because a victimizers was there and chose to target me. \n\nThe times I’ve been victimized, it’s been by people I was friends with and trusted or people I was in intimate relationships with. And even then, I was victimized because THEY were there, not because I did anything",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "You aren't lying, a guy tried hitting on me when I had the flu and literally looked like a zombie in sweatpants. I coughed on his ass.",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I am the size of a middle schooler and get sexually harassed/catcalled when I wear a knee-length puffer coat because my coat is purple.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "> But it's statistically more likely to get inappropriate comments and behavior when you wear more risque clothing. That's not your fault, but it's also going to happen.\n\nProve it. Because I disagree wholeheartedly.",
              "id": 41,
              "comments": [
                {
                  "score": 11,
                  "content": "I could see a correlation, like you’re more likely to get harassed or groped at a bar where alcohol is flowing (not that you won’t get harassed outside these places, but in my experience it happens more often at bars/parties). You’d also be more likely to dress up or wear revealing clothing during this time. But as everyone else is attesting in this thread- what you wear does not determine if you get harassed. It happens All. The. Fucking. Time.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Right? She pulled those statistics out of her ass.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 62,
              "content": "This just isn't true. Google the exhibit what was I wearing when I was raped. You'll see hoodies, pajamas, t shirts, sweats, turtlenecks. This is a myth that men, and some women, perpetuate so it feels like they have some control. \"That could never happen to me, or my loved one. After all, they/I don't dress that way.\" Harassment is not about what you're wearing.",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "If she had worn a one piece bathing suit, the creep would have found something else to creep on. Dressing one way or another does absolutely nothing to prevent sexual harassment. Zero. Your comment is out of touch with the reality of being a woman. She will be harassed either way. The question is what will those around her do about it. OP took the right first step, calling out the creep and making him leave. But her suggestion that her niece should stop wearing what she wants was a step backwards into victim blaming.",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Not sure why anyone would call someone a fag at a Lil' Nas X concert, but okay.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Want to source that bud?",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Its statistically more likely, eh? Then I suppose you have some statistics to back that up?",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Go google for the recent art exhibit showing the clothes of rape victims worn at the time of the attack.\n\nAnd then think about your comment again.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "> But it's statistically more likely to get inappropriate comments and behavior when you wear more risque clothing.\n\nCan you show me these statistics?",
              "id": 50,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Then how do you justify rape of those women who barely ever leave the house and dont wear anything provocative? \nChanging your clothing will do nothing. Changing your attitude might actually allow you to love who you are.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Oh so OP is an asshole for giving her a suggestion on how to feel more comfortable in the meantime? You're high. \n\nShe made very clear it is not this girls fault and that the guy was an asshole is in more than one way tried to make the niece feel more comfortable.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I mostly agree, if this was my daughter I would want to make sure grown men weren't gawking at her like that. I would be glad she has the confidence to do something like this and I would make sure she was well equipped with some pepper-spray. It's hard to go on either side here as both have fair points. We should endlessly protect someone's right to express themselves like this, but also prepare them for the creeps out there. They'll pay attention to her regardless simply because she's attractive, but in the end it's her choice and I hope she stays safe regardless.",
          "id": 53,
          "comments": [
            {
              "score": 129,
              "content": "Creeps will ogle no matter what the woman is wearing, short of getting in a cardboard refrigerator box. \n\nA competition suit for 100% sure would not stop the creeping.",
              "id": 54,
              "comments": [
                {
                  "score": 66,
                  "content": "Agreed. Teaching her to stand up the assholes and helping her develop thick skin is so much more important. \n\nThere was a STUNNING girl at my university. Beautiful long hair that waved in the wind as if accompanied by some sort of mythological breeze, tall and toned. She was the type of girl that \"stopped traffic\" wherever she walked. (She was in the art program, and my roommate was a decent friend of hers, and in the program as well.) \n\nUnfortunately, the male gaze became too much and teachers were giving her TOO much attention and she was passing classes and afraid that she'd fail her art review (panel of men & women).\n\nSo, she buzzed her hair (bald, just a bit of peach fuzz as it grew in, but think Xavier). Went make up free. Wore sweats and pajamas. She still got ogled. She failed her junior review and ended up dropping out of college. (Scholarship issues).\n\nHad her professors worked with her, instead of staring at her...they wouldn't have fucked up her life.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Cultures that wear burkas still have a lot of sexual harassment and assault problems. I don’t get why people think “covering up” will make a difference. Wearing low cut tops is arousing to men, sure. But a normal man will glance, appreciate, and move on with his life. Men aren’t savages, they don’t see some cleavage and become unable to control themselves. People that make comments will make comments regardless.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Sadly you couldn't be more right, that's why if she's going to stick with it then she should at least be able to protect herself. Those creeps will be too wide-eyed and distracted to see some justice being sprayed at them...",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I think a competition suit would be more likely to not have the verbal aspect.\n\nThe thing about wearing an extremely revealing bathing suit is that its interpreted as wanting attention.  Are people going to stare at her butt either way?  Definitely.  Are people going to comment on it if she's wearing a competition suit?  I think that's far less likely.\n\nI'm not saying any of this is fair or right, but at some point we have to accept that if you wear clothing that attracts attention (and is in fact the point of the clothing), some of that attention isn't going to be the type you want.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I disagree. My sister-in-law used to wear her comp suits (the ones that look like mid-thigh length shorts) to the beach and then wrap a sarong around her waist. Guys would still whistle or even stop her to comment on her figure. Me in my one piece and full length sarong would still get guys calling me out (and tbh I don't even think I'm that conventionally attractive). \n\nI have had my ass touched in my business wear and was cat-called twice in my up-to-neck winter coat yesterday (which was frightening AF but let's not get into that). Point is WHAT YOU WEAR IS NOT GOING TO STOP YOU GETTING HARRASSED.\n\nI wore a mini dress out a while back (coz after being scared of being seen as \"asking for it\" all my life i realised that being modest has not protected me at all and I finally stopped giving af) and guess what? I didn't get cat-called, hit on or comments. Know why? Coz the men that happened to be there weren't animals. The men who catcalled me in my coat were. Stop saying that clothes control this shit. They don't. Only the type of people who happen to be around do.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Idk. I think competition suits are way hotter than bikinis, but that is a: just me and b: I dont cat call or ogle.",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I'm not saying its right or fair, but wearing thongs like that around lots of people is straight up going to attract attention.\n\nI understand the \"don't victim blame\" mentality, but at some point we have to accept that if you wear clothing that attracts attention, some of that attention isn't going to be the type you want.\n\nThe guy is absolutely wrong for making the comment, but you can't control what other people do, and if you wear thongs at crowded places with drinking, you're going to get comments.",
              "id": 61,
              "comments": [
                {
                  "score": 36,
                  "content": "You think a 17 year old doesn't know that shit already? She could've been upset that the comment came from a family friend rather than just that the comment happened. You'll be hard pressed to find a 17 year old girl who has never been sexually harassed before; she was lucky to have the confidence to wear that kind of swimsuit in public before and fuck that guy for making pervy comments at an underage family friend.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 31,
                      "content": "[deleted]",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "So will wearing swimsuits at all though. If she's in a swimsuit and she's the kind of guy the creep finds attractive, he's going to comment. It's a lose-lose proposition.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 0,
                      "content": ">If she's in a swimsuit and she's the kind of guy the creep finds attractive, he's going to comment.\n\nWith the caveat that all things occur on a spectrum, I don't think that's necessarily true.  Revealing clothing is pretty much universally (at least in the US) an invitation for attention.  That's why people wear it.  That gives the creeps who have even a hint of social sense the idea that they are playing into the persons desires by commenting.\n\nIs not wearing revealing clothing going to stop all of it?  Absolutely not.  Is it going to make it significantly less common?  Yes, it is.\n\nThe bottom line is you can only control your own behavior, you can't control what other people do.  So if that sort of thing bothers you, you're either going to have to find a way to make it less likely to occur or grow thick enough skin to deal with it.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "100% this.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This is what I don't understand. I didn't understand it either in OP's story. The comments about the thongs and showing your butt cheeks. Is this an American/European thing? I'm from a Latin American country and this sort of swimsuits are extremely common. You can show your butt cheeks and nobody bats an eye. Even one-piece swimsuits are slim on the back. It's not even a teenager thing. I'm also 25 and most of my swimsuits are like this. My mom's 54 and hers too. Do you guys are used to wear things that cover all your butt?",
                  "id": 67,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Most of it yeah.\n\nAnd I think your post highlights something I tried to convey elsewhere.  It isn't a straight up \"this % of skin showing = more attention\", its variation from the cultural norm and thus relative.  In the US a thong is on the risque side with the cultural norm being something like this-\n\nhttps://www.target.com/p/women-s-strappy-back-one-piece-swimsuit-black-sunn-lab/-/A-51515589\n\nMeanwhile that exact same swimsuit that would be conservative in your country and normal in the US would be completely salacious in many Muslim countries.\n\nIt is deviation from the cultural norm towards the risque that attracts the attention, not some objective measure of skin shown.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "[deleted]",
          "id": 69,
          "comments": [
            {
              "score": 13,
              "content": "Except she told her to wear other swimsuits that cover up more.",
              "id": 70,
              "comments": [
                {
                  "score": 11,
                  "content": "[deleted]",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "*sigh* \n\nTypical AITA misinterpreting things. OP didn't say niece needed to change. She was trying to suggest options to make her feel comfortable.",
          "id": 72,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Agreed, ESH except the niece",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "MPSH?",
          "id": 74,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1224,
      "content": "[deleted]",
      "id": 75,
      "comments": [
        {
          "score": 258,
          "content": "It's definitely ESH, excluding the niece",
          "id": 76,
          "comments": [
            {
              "score": 6,
              "content": "niece* but agreed.\n\nedit: i before e except after c",
              "id": 77,
              "comments": [
                {
                  "score": 3,
                  "content": "Fuck thanks. I'll edit that",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1158,
      "content": "YTA. 100%. How are you going to tell her \"it's not your fault this older perv made you uncomfortable\" but then tell her its her responsibility to cover up. I know you weren't trying to be, but you \"deal with\" a person who is predatory towards children. I dunno dude, just maybe think next time before you tell a teenager (an age group known for having low self esteem) that she should cover her body.",
      "id": 79,
      "comments": [
        {
          "score": 255,
          "content": "The super confusing thing here is that OP is willing to wear the suit herself, mere hours before telling the neice she probably shouldn't wear it?",
          "id": 80,
          "comments": [
            {
              "score": 164,
              "content": "But then it'll be okay because she can wear her butt floss in solidarity. Instead of just the \"niece\" getting harassed, they can get harassed together! It'll be a great bonding experience...\n\nAlso OP, for the record, your cousin's kid is not your niece. Nieces/nephews are your sibling's children. A first cousin's child is your first cousin once removed. And YTA for telling her to cover up, even if you meant only until you can share the burden of being harassed in a few days. Victim blaming for a couple of days is still victim blaming.",
              "id": 81,
              "comments": [
                {
                  "score": 72,
                  "content": "Could be that OP isn’t American / of American descent. In the country where my family is from, cousins are referred to with the same “honorific” as siblings and their children are considered nephews/nieces.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yep. In Mexico, my first cousins are my primos hermanos (cousin siblings) and their kids are my nieces and nephews.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "I call my mom’s cousins aunt/uncle. It’s the only acceptable honorific for a family member that’s older than you but isn’t your direct ancestor. We’re Mexican-American and Spanish doesn’t have a special word for it, either.\n\nBut plenty of white people call their parents’ friends aunt/uncle.",
                  "id": 84,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "My cousins kids call me auntie. This is not particularly odd even in the US.",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "[deleted]",
              "id": 86,
              "comments": [
                {
                  "score": 14,
                  "content": "Yeah, it's like people didn't read what OP wrote or something. NTA, neither is niece, only husbands friend.",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "The false premise here is that her niece's swimsuit played any role in the harassment. It didn't. \n\nThere is no swimsuit on earth that would've kept that guy from harassing her. If she'd worn a Burkini he would have told her to take it off. Or that it was skin tight. Or that he could see her nipples. Or that he wonders what she's got under lock and key.\n\nThis is so incredibly obvious that I'm not sure how to explain it any better. Let me just say that men in speedos don't get harassed more than men in board shorts. If skimpy clothing correlates to harassment, the speedos guys would be getting harassed. But they're not. **Because clothing is unrelated to harassment.**",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Yeah I'm also baffled about this point.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 591,
      "content": "YTA. She can wear whatever she wants as long as it follows the rules of what's allowed at that pool. Your husband's friend was the asshole that made that comment, he's the one that needs to go.",
      "id": 90,
      "comments": [
        {
          "score": 133,
          "content": "Yeah I never get why people punish the person who got the comment instead of the person who made it.",
          "id": 91,
          "comments": [
            {
              "score": 203,
              "content": ">  I told him to get the fuck away from us and tried of catch up with  Alicia. Oh the way I ran into my husband coming back from the bar and  told him his friend had to leave and don't you dare argue with me about  it.\n\n&#x200B;\n\nI agree with the general sentiment here, but she absolutely did go after the person who made the comment, and didn't \"punish\" her niece. She saw her niece in a dangerous situation, and her first instinct was to try to find a way to make it less likely to happen again.\n\nShe made a misguided suggestion and, by all accounts, she's now realized it and is trying to do right.",
              "id": 92,
              "comments": [
                {
                  "score": 33,
                  "content": "Yeah, I think she had good intentions but the bad way of going about it.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 585,
      "content": "NTA. Downvote all you want you really can’t blame OP she literally asked the niece if she was ok with attention and the niece was positive she was, now she gets the attention and is shocked by it. Yeah you can wear whatever you want but really you’re shocked someone would be creepy and comment on your ass being out lmao. You probably didn’t need to tell her to tone down her swimwear it’s her choice what she wears but she can expect men to comment or gawk at her when her ass is out that is a reality of the world we live in. Your husbands friend is the only asshole as he’s well above her age and that was just a strange comment to make to begin with.",
      "id": 94,
      "comments": [
        {
          "score": 239,
          "content": "Agreed. The niece said she was comfortable with the attention, then she wasn't. OP can't tell everyone at the pool not to say anything to her niece or not to pay attention to the niece. When the niece got upset by the comment, the OP basically said that in order to not get attention, cover up in something else, or wait for me to dress like you so we can both share in unwanted attention. That's TRUE. There is nothing blaming there. To call that \"blaming\" is like telling someone they're victim blaming if they warn a person to wear sunscreen to protect their skin from the sun. It sucks, but it's TRUE. The OP cannot prevent people from staring or making comments.",
          "id": 95,
          "comments": [
            {
              "score": 343,
              "content": "There's a difference between being comfortable with attention and being comfortable with pervy and mildly threatening comments being made.\n\nAttention =/= bad and pervy attention.\n\nStaring and making comments does not =/= making pervy and lewd comments.",
              "id": 96,
              "comments": [
                {
                  "score": 71,
                  "content": "THIS x 10000000000000",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "I mean the OP is just as incapable of making sure nobody says anything pervy or lewd to the niece so I don't see how it matters. I mean the reality of it is that the more skin you show, the more likely you're going to get lewd comments; this is the way it is. Niece is old enough to know that.\n\nI will also say that if this had been a man who showed up to the pool in a \"floss\" bikini he probably would have been asked to leave for indecent exposure. There is a double standard here.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 34,
                      "content": "> Niece is old enough to know that.\n\nYeah, she's old enough to know there are creeps out there, and her aunt showed her exactly how to deal with them. Call them out on their rude comments whenever and where ever you see them. Raise your boys not to behave that way. \n\nHer being old enough to know she can be objectified does not mean she can't be upset when she's objectified. \n\n>There is a double standard here.\n\nAs long as their junk is covered probably not. I have seen some speedos out there in the wild that are not much better than 'floss' bikinis and no one was asked to leave for indecent exposure.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "You can't pick and choose which attention you are seeking.  (It's like a box of chocolates. :))  Kids act out all the time to get attention, and it's usually negative, they just want it.\n\nThe guy was wrong, OP was doing her best (she's not her mom) and 17-year-old Suzy needs to know if you're going to bare your ass literally, people may bare their ass back figuratively.  That's why it's called, \"dressing provocatively.\"",
                  "id": 100,
                  "comments": [
                    {
                      "score": 15,
                      "content": ">You can't pick and choose which attention you are seeking.\n\nYou absolutely can. You absolutely can call out bad attention and not want certain attentions. \n\n>Kids act out all the time to get attention, and it's usually negative, they just want it.\n\nShe is not a kid acting out to get negative attention. She is someone dressing in the latest fashion to get positive attention. She is more than justified in calling out negative attention in such a situation.\n\nAnd now 17 year old Suzy knows that when a creeper says shit like that, to call him out on his own bad behavior and not blame herself. And hopefully creeper has been made a bit more self-aware and will be less likely to be a creeper in the future.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Honestly though, men will be men. Creeps will stare and make lewd comments without a second thought, they don't see a problem with their behavior, hence they don't see a reason to change it. You can't choose the kind of attention you'll get by dressing provocatively. \n\nThe friend is definitely and ass, no question about that, but there will always be guys like that, and if you can't handle their comments/attention, maybe you shouldn't dress provocatively. I know this is incredibly controversial, but people like that will not change. Dressing less provocatively to avoid harrassement is just good advice on OPs part.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 10,
                      "content": ">Creeps will stare and make lewd comments without a second thought, they don't see a problem with their behavior, hence they don't see a reason to change it.\n\nWhich is exactly why OP was in the right calling the dude out on how he was acting. Men will be men is just an excuse. When creeps act like creeps they need to be called out on it and held accountable. \n\nNo, you can't choose the kind of attention you get, but the problem here is with the creeps, not the person wearing the outfit. The creeps need to be called out.\n\n>But there will always be guys like that.\n\nSure, if their behavior is constantly excused as 'men will be men, there's no changing it.'\n\nThere is. Call them out when it happens, and teach your boys this is unacceptable behavior. This isn't an inevitable natural disaster or something we can't prevent. Boys and men CAN be called out and taught.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Lmao what reason is there to walk with your ass out, other than wanting to flaunt your fucking ass?  2019 has people living in an alternate universe",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 129,
              "content": "[deleted]",
              "id": 105,
              "comments": [
                {
                  "score": 32,
                  "content": "Shhhh. You're speaking far too much sense in this sub.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 14,
                      "content": "This sub is  filled with entitled people that think that what they do and what they wear has no impact on the world and how people will react. That is just life, gross and pervy guys WILL gawk at you if you have your ass hanging out. It’s literally common sense.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Thank you agreed!",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "Seriously, this thread is nuts. People have sexual impulses and some have poor self control. If anyone young and attractive is going to walk around 90% naked, they are going to get comments and not all are going to be nice. \n\nThat doesn't excuse the behaviour, but sometimes you have to inconvenience yourself if you want to avoid trouble. It's never someone's fault they get mugged, but maybe don't walk down shitty streets with a handful of cash and a gold watch.",
          "id": 109,
          "comments": [
            {
              "score": 72,
              "content": "Yeah this just seems to me like something that kids all need to learn growing up nowadays, that when your sense of normality is based off of Instagram you’re not going to experience the best results in real life.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "This thread just goes to show how reddit is mostly 15-25 year olds who's entire concept of social attitudes comes from online echo chamber communities, and who's entire concept of how to behave comes from instagram. \n\n&#x200B;\n\nI am sorry the world sucks and doesn't work by reddit logic. It would be nice if you could snap your fingers and the practical realities of the world cede and give way to your idyllic \"this is how things should be\". But, that's not how it works. It's not an issue of slut shaming; dressing like an instagram butt model at a family resort is not really the best idea.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "That's just the way our world is, it isn't perfect but we have to live in it nonetheless. Ideally she'd be able to walk around however she wants without getting stared at, but that's not the world we live in. By definition provocative clothes are designed to get a reaction from people, that is their whole appeal. If you can't handle it simply dress differently.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Someone asks something like this about once a month, and the comments are always the same. Not sure what weird planet I was apparently raised on but I don’t get it either.",
              "id": 113,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "So much this.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "Thank you!\n\nSad to have to scroll this far down to see a voice of reason. \n\nOP is not “victim shaming” her niece (who had claimed she welcomed all the attention she would get.) All OP is trying to do is help her niece AVOID a similar situation in the future by offering slightly different clothing to wear… that’s so not the same as blaming her niece. \n\nCause and effect exists in this world, outside of a vacuum. It may not always be fair, but it’s clear OP was just trying to help her niece prevent a repeat situation. \n\nNTA. ",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "You also can't \"wear whatever you want.\" This is a fucking public pool at a resort that allows minors. If this outfit wasn't outright against the rules at the resort it was at the very least against common decency. The only people who want to see a 17 year old's bare ass separated by a piece of dental floss are assholes and pervs like the husband's friend. The rest of us are just uncomfortable. So yeah, I have no sympathy for the niece being made uncomfortable by a crude comment because she had no problem making everyone else uncomfortable with her outfit.",
          "id": 116,
          "comments": [
            {
              "score": 67,
              "content": "My thinking is, if you think you can wear whatever you want (even if that makes other people feel uncomfortable) you have to accept people can say whatever they want (even if that makes you feel uncomfortable).",
              "id": 117,
              "comments": [
                {
                  "score": 28,
                  "content": "Right? For this exact reason, I only wear these types of bathing suits at events where I know I'm only going to encounter people of similar age groups, because thats the only people I want attention from. I'm pretty body positive, but there is a time and place for everything. Realistically, theres no reason to where these bathing suits other than to attract attention to your body (otherwise you could pick from the extensive selection of traditional bikini style bathing suits.) I dont think anyone should be prevented from wearing these types of outfits wherever they want, but they *are going* to encounter attention they do not want, whether it be from a creepy perv, a disapproving old bat, or an offended mom, and if you're not mature enough to handle this attention than you shouldnt wear it. You can't selectively attract attention only from the people you want to recieve it from. The world is not going to change for you.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "THANK YOU!  You know she's dressing provocatively on purpose, to attract men (or girls, I guess, if that's her preference) but it is NOT for herself other than to glorify her body and draw attention to it.  It's why we dress how we dress - to please the eye of others.  She didn't put it on to stand in front of a mirror all day, saying \"this look is all for me.\"  She put it on, went out in public, pulled off the sarong and waited for accolades.  Unfortunately, there are plenty of jerks out there just looking to give her the attention - she just didn't like THAT particular attention.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "Exactly. In an ideal world, no one says something like that to a teenage girl. In the real world, they 100% will and she has to decide whether wearing a trendy suit is worth it. Just because you think/know other people’s opinions are shitty doesn’t mean they’ll stop having them.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Why isn't this the top comment?",
          "id": 122,
          "comments": [
            {
              "score": 18,
              "content": "Cos the thread is about a woman's right to wear dental floss as attire at a fucking public pool - this type of thread will **always**  result in a YTA as top comment",
              "id": 123,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "I agree with NTA. Yes it's very rude and creepy for the friend who made such comment on a minor, and OP was right to kick him out. The niece has the right do where whatever she wants, that still doesn't have to equate to her having to be absolutely comfortable with any remarks she'd receive. The thing is, OP is also looking after someone else's underage kid. Maybe it's a comment from a perv today, but what if the niece gets groped tomorrow? Yes whoever groped her would be a piece of shit for doing that, and no the niece's outfit isn't an invitation for the perv to do so. But the damage was already done, how would OP explain to her cousin that yeah that happened under my watch? Maybe her niece would be like whatever, but the niece's parents might react to it very strongly and hold OP accountable for it.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Agreed. You have the right to do what you want, but you also have to deal with the effects of your actions. You walk around naked, you get rude comments. Wanna dress like that and not get gross comments? Stay at home. \n\nPeople demand rights but have no respect for Others rights. What happened to compromise and understanding that YOU AREN’T THE ONLY PERSON ALIVE??",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "It's pretty shocking when family friends make lewd sexual comments toward you when you are a minor. It's way worse than when strangers do it. When a stranger does it, I just think, \"Oh, what a piece of shit, oh well.\" When family friends do it I'm like, \"Well fuck now every time I see this person I have to worry because they are statistically more likely to hurt me and they know where I live and I have to be nice to them to uphold peace in the family\". It's a completely different thing. \n\n\n\nAnd being ready for someone to be an asshole is not the same thing as being okay with them being an asshole. I'm ready for someone to break into my car, but if they do it I am not going to think, \"Yeah, I knew it would happen. If I didn't want this to happen, I would have never gotten a car.\"",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 254,
      "content": "NTA\n\nThis was a very thin tightrope to walk and I think you walked it the best you could. Husband’s friend was way out of line (“Hey, I’m just being honest”...seriously WTAF dude) and kudos to you for telling him to leave.  And I don’t get the sense you were blaming her. But you’re right: there are more assholes than him in the world, and some of them won’t limit their bad behavior to words.\n\nYour niece is right that she shouldn’t HAVE to dress conservatively to be treated with respect, and she has a right to wear her bathing suit of choice. But she does need a contingency plan for when this happens again, because it will. The choice she’s making requires a thick skin, and “I should t have to” is cold comfort in the aftermath of harassment or sexual assault.  She needs to be prepared to defend herself.",
      "id": 127,
      "comments": [
        {
          "score": 60,
          "content": "Had to scroll down a while to finally find the answer that really touches on a much-too-ignored issue. I think all parties agree that a world where we wear what we like without derogatory comments is best. She has the options like you said for how to deal with it. \n\nTell the perv to fuck off or educate him on his asshole remarks. \nShe could prepare herself for inappropriate comments (even ones she knows she doesn’t deserve such as this). \nOtherwise, she isn’t mature enough to be wearing the revealing bathing suit in my mind and probably needs to be more open to the idea of changing into something that has more coverage. \n\nThe first two options are best to be sure, and wearing a bikini with more coverage doesn’t eliminate inappropriate comments either. OP seems like she understood all of it but wasn’t used to working with a teenager. Did your best, OP, and there’s really NAH.",
          "id": 128,
          "comments": [
            {
              "score": 2,
              "content": "> She could prepare herself for inappropriate comments \n\nCommenting that a person who is showing their naked ass to the world is showing their naked ass to the world is 'inappropriate', but showing their ass to the world is 'appropriate'.\n\nThe truth seems entirely appropriate to me. You seem to want to both do things and force people to pretend you aren't doing them- is that some kind of fetish?",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "This is what I think people are missing. Sure, women have a right to dress this way, but unfortunately the world is a shitty place with shitty people. People need to take into account that this behavior may draw unwanted attention to themselves.  The “shouldn’t” is just a unrealistic hypothetical, the world ain’t like that.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": ">Your niece is right that she shouldn’t HAVE to dress conservatively to be treated with respect, and she has a right to wear her bathing suit of choice. But she does need a contingency plan for when this happens again, because it will. The choice she’s making requires a thick skin, and “I should t have to” is cold comfort in the aftermath of harassment or sexual assault. She needs to be prepared to defend herself.\n\nSo in general I agree with this, but isn't there a point where you can be indecent enough that it kinda goes out the window?  And while to some extent any amount of indecency is a cultural thing, ie topless in US is different than topless in Europe and bottomless at a nudist beach is different than bottomless on a normal beach, doesn't that suggest that dressing significantly more risque than is considered standardly acceptable is likely to bring extra attention?",
          "id": 131,
          "comments": [
            {
              "score": 3,
              "content": "Certainly you can’t break laws against indecent exposure (there are legal repercussions), but even if someone did, it never justifies sexual harassment. I once saw a man walking down the street wearing nothing but a bandanna wrapped around his stick and stones, I didn’t feel any urge to yell “NICE ASS” at him.\n\nThere will always be assholes who think they are justified. And it’s been my experience that it has nothing to do with what you’re wearing: they ALWAYS think they’re justified, they’re just looking for an opportunity to behave badly without repercussions.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Pretty much this. This isn’t victim blaming, it’s trying to protect a young girl from having to deal with unwanted attention. I\n\nThe people on this thread act like asking a 16 year old if she wants to wait for an adult to walk home at night is suggesting that if someone tries and assaults her by walking home alone night, it’s her fault for walking alone. Uh, no. It’s trying to protect that 16 year old from the possibility of something happening. This is the exact same thing.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 234,
      "content": "ESH except for your niece. She can wear what she wants, your husband's friend needs to stop being so creepy. Did you talk to him about it? Or only her? Bc otherwise it seems like you are not holding him accountable for his comment. She is 17. That's not okay\n\nEdit: I just reread and see that you did, but the fact that he justified his behavior is gross. You need to cut him off instead of getting her to change her behavior, she did absolutely nothing wrong",
      "id": 134,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 213,
      "content": "NTA.  You handled that as best you could. I usually don't comment, but there's some unreasonable shit going on here.\n\nThe people saying YTA are sticking their heads in the sand. There is no actual dispute that the particular garment your niece was wearing was meant to sexualize her. People say things like \"it's comfortable\" or \"I'm just expressing myself,\" but that's just pretext. It's sexual.\n\nIt's not a question of shaming someone. It's a question of whether you're okay with sexualizing a young girl. Based on this premise (I assume) you advised her to tone it down. There is nothing wrong with that. It's common knowledge that when someone sexualizes themselves, they will attract sexual attention from others. That's the whole point, right? \n\nYour husband's friend is an asshole. It sounds like he may have been pointing out the ridiculousness of her outfit, but it's still an inappropriate comment (even if it's true). \n\nYour niece is also an asshole for not expecting attention when she is clearly seeking it. However, she gets a pass for being a dumb teenager. \n\nShe's lucky to have someone like you looking out for her.",
      "id": 135,
      "comments": [
        {
          "score": 44,
          "content": "Finally, a levelheaded response, this honestly needs to be top",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "You are a shining beacon of common sense. Thank you.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "God, finally someone with common sense. And no, you are absolutely NTA. And what u/oliversherlockholmes is saying is absolutely correct. Swimwear like that are meant to sexualize women. That “l am expressing myself” bullshit and I can wear almost to nothing is grossly stupid or naive. Anybody walking with their ass half out would also get sexual attention. You handled it well too.\n\nEdit: is it her choice to wear it? Sure. But damn, even if a man were to walk around a pool with his ass checks out he would get sexual attention. Clothes like that are meant to attract sexual attention. Period. And whomever pretends it is not the case is absolutely kidding themselves. People need to stop being so open minded that their brains fall out.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "> There is no actual dispute that the particular garment your niece was wearing was meant to sexualize her.\n\nTHANK YOU. \n\nAlso, attracting sexual attention =/= giving out license to be sexually harassed.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 147,
      "content": "YTA \n\nIt is not her responsibility to dress a certain way because of one gross jerk. You should have just stopped at \"*that wasn't her fault and how he was just a jerk and jerks are everywhere.*\"",
      "id": 140,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 81,
      "content": "NTA. I'll never understand the commentors on this sub who absolve people like Alicia of all responsibility in these kinds of situations saying \"sHe cAn wEaR wHaT sHe wAnTs\"... like no shit. I can wear gold watches, gold chains, louis vuitton shades etc etc into a ghetto hood but I guess if I get robbed it has nothing to do with my choices, right??",
      "id": 141,
      "comments": [
        {
          "score": 12,
          "content": "The issue here is that women get sexualized no matter what they wear. I've gotten catcalled in sweatpants. It shouldn't be the onus of women to cover up to keep men from being gross. Looking is fine, sometimes eyes wander, but staring and commenting are much different. There are plenty of booties on the internet to leer over, they're no need to make teenagers uncomfortable.\n\nIf you get robbed, it is still the fault of the robber. We punish the robber for a reason. We would never find a robber not guilty because of what you were carrying or wearing.\n\nBesides, getting robbed and getting leered at are different. When someone robs you, they have a physical reward. When someone makes crude comments, what's the reward? Feeling smug about putting women in their place? That's skeezy and gross.",
          "id": 142,
          "comments": [
            {
              "score": 47,
              "content": "It seems you missed my point entirely. People get robbed regardless of what they wear or how they present themselves. Obviously, if I'm dressing like I'm worth a million dollars in the hood, I'm more likely to get robbed than if I dressed far more casually. It's not saying that the robbery isn't the fault of the robber, but acknowledging that if I don't want to be robbed there are steps I can personally take to mitigate that risk. Should I **have** to take those extra precautions? No, I shouldn't. People suck and shouldn't steal but not taking precautions to prevent a scenario I would otherwise want to avoid would be foolish on my part.",
              "id": 143,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}