{
  "post content": "I didnt know if I should go to relationship advice or here and I decided to just post here also I'm on mobile so format might be wierd\nMe and my best friend of 7 years almost 8 both liked this girl who might have liked me for 3 years or since we met but I never picked up on it cause I have no girls getting skills he and me one night were talking about one of my exes *dont remember the reason might have just been taking about random girls) and he brought up melissa which is not her real name who he has liked for 3 years and I've liked for 2 and I brought up the time my ex broke up with me and what happened and realized that she might have liked me and I asked him if he thought she liked me or not which we agreed probably not but maybe so would I be the ass hole for asking her out and dating her if she said yes?\n:Edit:I was planning on asking my friend tomorrow when we dont have school in a couple hours and ita not 12 at night",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "NAH If he's liked her for 3 years and not made a move, that's on him. If she likes you back, go for it but be prepared for backlash. Your friend is gonna call you an asshole anyway and it's gonna cause tension. At the end of the day, it's up to the girl who she dates.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "You need to ask your friend, not the internet.",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA, but I would say to give him a heads up beforehand. Something like \"Hey. I know you like this girl, but I would like to ask her out. It just felt fair to let you know since I know you've had a crush on her.\" \n\nOne of my friends came to me in high school saying that a guy I had a crush on asked her out, and she liked him too, but didn't want it to come between our friendship. I was bummed but supportive of her going for it. Not everyone handles it the same way and I know that's best case scenario. But I was glad she let me know.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Info: Have they ever dated and, if not, does he intend to ask her out any time soon?\n\nSimply having a crush on someone does not mean they belong to you. You’re probably NTA to ask her out.\n\nHowever, depending on how much you value your friendship you should ask permission first",
      "id": 5,
      "comments": [
        {
          "score": 2,
          "content": "He has never had a girlfriend that I can think of off the top of my head and he is my wing man and is much more attractive than me",
          "id": 6,
          "comments": [
            {
              "score": 1,
              "content": "Ok. So both of those things won’t weigh into any judgment I make. He has never dated the girl you like and, to the best of your knowledge, he does not intend to ask her out any time soon. \n\nNTA if you ask her out but be careful because it could hurt him. Ask permission first if you want to avoid issues with your friend. However, If you choose to ask permission and he says no you need to respect that",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI didnt know if I should go to relationship advice or here and I decided to just post here also I'm on mobile so format might be wierd\nMe and my best friend of 7 years almost 8 both liked this girl who might have liked me for 3 years or since we met but I never picked up on it cause I have no girls getting skills he and me one night were talking about one of my exes *dont remember the reason might have just been taking about random girls) and he brought up melissa which is not her real name who he has liked for 3 years and I've liked for 2 and I brought up the time my ex broke up with me and what happened and realized that she might have liked me and I asked him if he thought she liked me or not which we agreed probably not but maybe so would I be the ass hole for asking her out and dating her if she said yes?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Smh if girls like a guy and that guy doesn't make a move  they won't think \"I guess I have to date his best friend\"🙄",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "first of all, what? Second of all, just ask the dude if you can",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NTA, you snooze ya lose",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NTA\n\nHe'll...probably be upset in all honesty, but if he's liked her for a while and done nothing then it's not like you 'stole his girl' or anything. You'd be in the clear morally, so you really just gotta decide if his upset would be worth it.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    }
  ]
}