{
  "post content": "A couple of weeks ago I accidentally left my car keys in my uniform pants at work, and left my pants in my locker (I don’t wear my uniform home for multiple reasons. I just bring it home to wash - I have 2)\n\nI realized when I got to the subway station, where I’d  parked, that I’d left my keys back at work - a half hour train ride and no guarantee I’d be able to get back in the building (it was after midnight).\n\nI called my husband to ask him to bring me the spare key. Twenty-two times. I tried my son, but he was asleep (he’s 19 and has a car) and didn’t wake up when I called a second time. And I tried a friend. I didn’t want to call too many people because again, it was after midnight. \n\nI kept calling my husband hoping eventually he’d hear his phone. \n\nI wound up taking an Uber home.\n\nI needed to go get my car because they ticket after 2 am usually. So, when I got home, and I was pretty upset that I’d called 22 times and he hadn’t answered. I continued trying to call him the whole way home in the Uber. \n\nWhen I got home, I went inside and up to the bedroom and woke him up.  I was pissed that had this been a serious emergency, I wouldn’t have been able to get through to him. \n\nHe kept saying he had my number in his “favourites” so that if I called twice, the second time it would go through. But he had the phone on SILENT!  And then put it on top of something soft. So he didn’t hear it vibrating. \n\nHe complained that I was mad at him for something I did. I replied that no, I was mad at ME for forgetting my keys. That was 100% on me. \n\nI was mad at HIM for not having his phone on and that he’s unreliable in an emergency, which thankfully, this wasn’t a huge one. \n\nSo, AITA for waking him up and being pissed that I couldn’t reach him in what wasn’t a big emergency, but what if it had been?",
  "id": 1,
  "comments": [
    {
      "score": 16472,
      "content": "YTA. He's right: your mad at him for something you did. Him having his phone in silent was an accident, just like you forgetting your keys. No one except you did anything to you here.",
      "id": 2,
      "comments": [
        {
          "score": 5708,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 2703,
              "content": "If they already knew you were going to be okay why use the resources of the sheriff to bring him back?",
              "id": 4,
              "comments": [
                {
                  "score": 3026,
                  "content": "I think they meant that the sheriff was sympathetic to the wife. The sheriff wanted to drive the point home to the husband of what an idiot the husband was for not telling his 6 month pregnant wife what route he would be on. And to do that, the sheriff let the husband sweat it out for 30 mins, then once the sheriff and husband got to the parking lot, the sheriff told the husband that the wife was gonna be okay. Let the husband panic for a half hour.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 19,
                      "content": "That was fucking awesome of the sheriff. Let the dude worry about his pregnant wife for 30 mins. Fucking dolt. Who goes hiking and doesn't tell anyone where he's going? Sadly, it happens every damn day. I live near the mountains, and idiots do it all the time.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 284,
                  "content": "The # of commentors on here that think the sheriff wasted his time bringing a husband back to his very pregnant w/a serious illness (food poisoning is incredibly dangerous to a fetus.) Should be its own AITA post.\n\nOp you are NTA and your concern about “what if it was a real emergency?” are valid. Treat this as a trial run and you all need to adjust accordingly.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Agreed!!  Plus she said she was at hospital alone with 2 small children so yeah, the husband was needed to take care of children and if something critical happened to wife and fetus",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Especially with her edit that she had two small children with her.  She needed her husband to care for their children while the medical team cared for her.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "She also stated she had 2 young kids with her. Her husband needed to come back to take care of the other kids.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Babies are often born early due to something mom will recover from. Babies die all the time from things when Mom is going to be okay. That's why sheriffs will go get the father -to-be when pregnant mom has a medical problem that she'll recover from.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I was 6 months pregnant, with 2 young kids at home and was having cramps from vomiting so much, plus dehydration. He needed to get his butt home and was unreachable unless the sheriff went up the mountain after him.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "She had 2 young kids with her, so yes she absolutely needed her husband there by whatever means necessary.\n\nI’ve had to go to the er with my kids before, they were 1, 4 and 9 and I would have been through the roof if I couldn’t get ahold of my SO to watch them.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I mean, between being six months pregnant and hospitalized (which is honestly reason enough), she had two small children with her who were likely panicking because \n1) mom is really sick and that's scary, and \n2) mom is likely panicking that she can't get ahold of daddy and what if something bad happened to him too?\n\nIn her position I'd have used whatever resources were possible to find my husband and get him to me and the kids as fast as possible.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Probably for him to get the kids since she was hospitalized in the ER.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "she said she had young children, if she was in the hospital she would have been unable to take care of the children herself",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "What does \"okay\" really mean? She's puking and shitting in an ER room, whilst pregnant, ALL THE WHILE tending to two other children. \n\nFuck that.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1152,
              "content": "This is like comparing apples to chainsaws. OP was able to call an Uber and get home just fine. Would it have been easier and less stressful if he picked up the first or second time? Sure. Did the outcome change? Not really, no\n\nAlso, why did the sheriff go look for your husband if he knew you were going to be okay? Does he not have other sheriff duties to attend to?\n\nETA: when I first responded, this commenter did not include the edit clarifying she was in the ER with her two children. I understand her calling the sheriff now, but still maintain these are two very different scenarios that feel reckless to compare. One was a medical emergency that required emergency services and utilized them, and the other was a series of unfortunate errors that led to a stressful situation that wasn’t handled well on multiple levels",
              "id": 18,
              "comments": [
                {
                  "score": 964,
                  "content": "I think the issue is him not being reachable had she had an actual emergency. I think this because she literally said it. For a woman commuting home in the middle of the night on public transport, I would also want to know my partner is reachable should an emergency occur, and would feel uneasy if I was just shown that they wouldn’t be. It’s scary.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Okay but it was an *accident*. She also made a mistake that led to this, so why not be understanding and talk about better protocols instead of being pissed at him?",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "But you can never *know* that and mistakes happen.\n\nHow is he going to make sure he's available? How can he control the cell network? What if he didn't put it on silent but the ringer didn't go off (happened to me before, had a few days with 0 notifications)?",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 488,
                  "content": "Taking an Uber home isn't necessarily safe for a single woman. I was rooming with a colleague on a work trip who had to call the police on her Uber driver because he refused to let her out without her agreeing to sleep with him. She was sobbing when she got back to our room.\n\nI've taken several Uber rides and never felt unsafe. It's actually my preferred mode of transport a lot of the time. Both the passenger and the driver are putting themselves at risk by being alone with a stranger, and sometimes that doesn't work out so great. I don't blame her for wanting a ride from someone she trusted.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 238,
                      "content": "I agree, also it's the fact that you have to wait for an uber at midnight. We don't know the area, it could be sketchy. I've waited 20 min for an Uber that says 5 minutes. Yeah, I could see how she'd be scared.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Driving home isn’t necessarily safe. Ever leaving your home has its risks, as does never leaving your home. It’s called life.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 349,
                  "content": "Apples to chainsaws is going to be my new go to.🤣",
                  "id": 25,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Apples to assholes is mine.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 340,
                  "content": "The fact that a woman alone after midnight is a huge red flag should scare the crap out of her SO. My husband would have been 1-terrified for my safety and 2-so sorry that he accidentally turned his phone down and missed my call. I check every night to make sure my phone is off of silent and turned up because I’m a parent (and daughter of elderly parents) and shit happens. It was an accident but one to learn from. This was a wake up call for them both.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 308,
                  "content": "It's not though.   \n\n\nYes, this time the emergency was minor. But he didn't know that when he was sleeping with his phone on silent while his wife was getting off work in the middle of the night.   \n\n\nThat's the point.   \n\n\nMy ex was unavailable for all kinds of minor emergencies and I would get pissed off every time. Then his family had a major emergency where they needed him to help rightfuckingnow and none of us could reach him. I ended up having to leave work to take care of someone he wanted us to be the backup guardians for if something happened to her guardians. And the next time there was an emergency his phone was off again.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 99,
                  "content": "The point is suppose she had been in a life  threatening condition in a hospital. The medical staff would need his permission for any treatment if she was unable to give her permission.  As a nurse that resonates with me. Leaving her keys is her fault but it is just as irresponsible  to have the phone on silent so she was unable to contact him.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 38,
                      "content": "That assumes that the hospital staff would be able to break into her phone and know which contact in her phone to call......  No one is left to die because there isn't a person to give permission.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I have my phone on silent while I'm trying to sleep because a family member used to drunk text/dial me at all hours on random nights and disrupt my sleep. There are emergencies and there are oopsies. This was an oopsie and OP totally overreacted. YTA.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Public transport is not very safe for women who travel alone late at night. It's not unreasonable of the OP to expect her husband to have his phone on in case she has an emergency. I've called my husband from a restaurant I had to take refuge in when someone followed and harassed me on my way home from work.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I think it's more because her husband thoughtlessly going onna trip where he wouldnt be reachable when his wife was 6 months pregnant is nothing like not hearing your phone ring after midnight on a normal day?",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "> Also, why did the sheriff go look for your husband if he knew you were going to be okay?\n\nBecause she had a medical emergency and her husband was needed at the hospital. \n\n>Does he not have other sheriff duties to attend to?\n\nThat was a sheriff duty.",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I’d like to add to the point of it being two different situations that just in general you should never go hiking up a mountain or anywhere without letting someone, partner friend or otherwise, know the exact route you’re planning to take. \n\nThis persons husband was stupid for that and the two situations are in no way comparable.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 629,
              "content": "OK. but I don't think you can compare a husband being unreachable whilst in the mountains with his pregnant wife at home to a husband who was sleeping during the night whilst his wife went to pick up something she forgot at her job.",
              "id": 36,
              "comments": [
                {
                  "score": 165,
                  "content": "Cellphones aren't magic. They often don't work in the mountains.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 313,
                      "content": "I get the world has changed because of cell phones - and I will even admit I've quickly gotten spoiled being able to reach someone/or be reached just about anywhere/anytime - but having grown up in the 80s/90s before this was a thing, I find it interesting how 'expected' this has now become. To the point of someone being pissed about not being able to reach someone (the OP), and in the above case, sending a damn sheriff out to look for their husband who was hiking in the mountains because the wife got food poisoning and *not* because the husband was missing, expected home and didn't arrive, etc.\n\nI get it, to a certain degree, but also this is just a very different world than what I grew up with that I feel conflicted.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 609,
              "content": ">  for husband to not be reachable to that extent is beyond ridiculous. \n\ntheres absolutely nothing ridiculous to \"not be reachable to that extend\". if the husband did it intentionally than yes, that would have been a dick move, but from what was written it was an honest mistake on his part and there dozens of reasons why that could have happened. \n\nand no, \"having been unable to reach someone in an emergency\" is not a carte blanche to act as an ass towards them when they tell you that it was an honest mistake unless there are additional circumstances that make it more likely you will need them on short notice and they are aware of that. it might (again depending on actual circumstances) excuse you for lashing out at them at the moment, but thats the point where you wait a day, take a deep breath and afterwards beg their pardon because you were in a bad situation and acted out in a panic, not because you actually feel you were (and still are) right, not to mention that in this case in particular it wasn't even what would qualify as an emergency.",
              "id": 39,
              "comments": [
                {
                  "score": 364,
                  "content": "Amazing how people lived before cellphones existed. Anyone remember? When people didn't have one in their hand 24/7?",
                  "id": 40,
                  "comments": [
                    {
                      "score": 501,
                      "content": "Back then they would've had a land-line you don't put on silent before bed though",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I remember those days… when you could call the house phone, and people didn’t turn off the ringers on them, so if they were home they could be reached!",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I'm definitely guilty of this. Back in the day, real phones always rang loud enough to wake most (nearly all, if you called enough times). I put my cell phone on vibrate because I don't want it going off during meetings, and rarely turn it on audible unless I'm expecting a call.\n\nIt's a mixed bag. I'm technically always reachable, but I often miss calls. Back in the day, if I wasn't home that was the end of it.",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 465,
              "content": "Hard disagree. Your situation and OPs aren’t even in the same universe of “emergencies”. You’re husband knew you were pregnant and that should keep a spouse in high alert. To expect your spouse to be on high alert during every moment of your existence “just in case”, isn’t reasonable. Look, OP wasn’t even alert enough to keep track of keys….but husband is a bad guy for not being prepared for this non emergency?  Nope.",
              "id": 44,
              "comments": [
                {
                  "score": 34,
                  "content": "Exactly. Given the fact that she, presumably, gets off after midnight regularly, it makes sense that he would be asleep already. Honest mistake to have it on silent and on something soft. I understand OP's frustration, but you've gotta handle your own stuff sometimes. It was her fault that she was in the situation to start with. Grow up",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 372,
              "content": "Genuine question: what did you expect from your husband in this situation? If you were in danger the best he could do would be call 911, which you’d already done. If you’re sick and call the emergency services, why did you have them search for your husband instead of help you? This story must have been distressing for you, but you don’t come across as someone who understands what a real emergency is. People in emergencies don’t turn away emergency services so they can launch a manhunt for their spouse instead.",
              "id": 46,
              "comments": [
                {
                  "score": 207,
                  "content": "Right like, I don’t have a husband, what am I supposed to do if I get food poisoning? Guess I’ll just die.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 133,
                      "content": "This my response to a lot of these comments. I'm single and I get ubers by myself all the time at all times of night?? No wonder people stay in bad relationships if they think women shouldn't get into ubers alone",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Lol same. I live alone and am single so I'm screwed if I can't call 911 during an emergency but need someone I personally know and am close with.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "I was looking for this comment. I’m confused because if it were an emergency where her safety was concerned then emergency services would be the best to call. Not her sleeping husband?? Anything beyond that would be frustrating, yes, but I really don’t know if it warrants the reaction she gave. That and the over 20 phone calls kind of suggests control issues to me",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "2 young kids at home and my parents were out of town. As for getting the sheriff involved, that was the doctors who did it, not me. I was too busy puking and trying to calm down a 5 and 7 year old.",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "That's what I can't get over. If it's a serious emergency, and you're sick with food poisoning call 911 or call an Uber. They'll get you to a hospital quicker than a husband who's away on a mountain somewhere. Needing emotional support isn't a serious emergency.",
                  "id": 52,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "That commenter never said she turned away EMS? She only said that the sheriff made her husband sweat because he didn't leave his route with anyone when climbing alone and an emergency occurred.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "??? What? She didnt turn away emergency services. She was already at the hospital with their two young kids. Yeah, they needed the husband there. It was the hospital that sent the sheriff after him.",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 328,
              "content": "No she is most definitely an asshole especially for the way she’s replying to people",
              "id": 55,
              "comments": [
                {
                  "score": 76,
                  "content": "[deleted]",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 279,
              "content": "Wow this is sooo over the top dramatic.",
              "id": 57,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 244,
              "content": "Also your situation is literally no where near similar to hers",
              "id": 58,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 199,
              "content": "Sounds like you’re still mad at your husband and are making unfair comparisons.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 674,
          "content": "Accidents happen. \n\nEmergencies happen. \n\nWhether it was an accident or an emergency, husband was unreachable. My husband works overnight and my phone is on LOUD in the event he needs me (gets locked out, has to get home early, etc).\n\nOP, NTA",
          "id": 60,
          "comments": [
            {
              "score": 439,
              "content": "I work nights and know my wife will be absolutely unreachable after about 10pm 🤷🏻‍♂️",
              "id": 61,
              "comments": [
                {
                  "score": 338,
                  "content": "Because this is the aita reddit and in the spirit of it, you should 100% divorce your wife for such a huge red flag /s",
                  "id": 62,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Nah because according to this sub: she's a woman, so she probably does most of the domestic tasks alongside a most likely full time job and taking care of the kids, so she earns her rest and shouldn't be disturbed.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Same. I worked in Boston and got out around midnight. Hour drive home. She is near impossible to wake up. According to all the women here, she is a trash man for being so damn lazy and red flags everywhere. Smfh",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "And op couldn't talk about that calmly the next day ? She HAD to wake him up and fight with him? Thats not how you discuss problem, grow up.",
              "id": 65,
              "comments": [
                {
                  "score": 9,
                  "content": "She wanted to avoid a ticket so she woke him up to get her car.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 11,
                      "content": "She knows how to use Uber, though. Couldn’t she Uber to her keys/ car?",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "But why did she yell at him right when she woke him up?",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "unreachable when im sleeping. guess im a supervillan",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "That’s what emergency services are for",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "lol my wife and I have our phones on vibrate almost 100% of the time.  If it's that big of an emergency, we'll go into find my iPhone and activate the pinging noise since that bypasses silent mode.\n\nOP was TA because this conversation about expectation management could have waited until morning.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "So you never fell asleep with your phone on silent before? By your own post, accidents happen. Op is def YTA. You can’t pick and choose which accidents to follow",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "People put their phones on silent by accident, it has happened to me sometimes. She could have tell him in the morning that he has his phone on silent and that please procure it doesn't happen again since he is her emergency contact. She could have explained everything and he wouldn't have an issue with that avoiding the fight. And he is right, she's taking it on him when both of them made accidents that day 🤷🏽‍♀️ YTA",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 305,
          "content": "She should have Ubered back to her car while they slept. Yta op.",
          "id": 74,
          "comments": [
            {
              "score": 123,
              "content": "It probably would've been cheaper to get the ticket than to take a second uber",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "It’s not even an accident. People are not on call 24/7!  When I am asleep, I am intentionally setting my phone not to disturb me. IF you expect him to be on call 24/7, you have to get him on-board, but I would never sign on to such a thing.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This. Your accident was just...an accident. But *his* accident was...an act of malice? Or something?",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "And this is how OP reacts that no one at home is answering their phone. It inconveniences OP, not even thinking something may have happened at home.",
          "id": 78,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Also, even with your phone on silent and DND, if someone from your favorites calls more than once, it will alert you on vibrate. So he’s right about that too.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "People saying nta because of a fucking emergency that didn’t happen. this people is grazy. YTA OP, don’t search anymore",
          "id": 80,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10311,
      "content": "I don’t get the  y t a ‘s.  NTA I get what you are saying.\n\nMy dad went through a very serious emergency a few years ago, and I live out of state.  My mom kept trying to call my sister who lives 20 minutes from them, but her phone was dead (even though she was at home). So all she was able to get was the daughter a plane ride away who could do very little to help until I flew out (which I did within a few hours of course).\n\nThere are settings on phones for this exact purpose to allow families to get in touch with you in an emergency. And while yours was not a true emergency this time, I understand why you are worried about what you would do if you had a true emergency in the future.\n\nAlso let’s be honest, waiting for an Uber alone late at night as a woman is definitely a little uncomfortable. I would have wanted my partner to at least know what was going on/stay on the phone with me while waiting for the Uber.\n\nAnyways, he needs to figure out a better system. Especially since it sounds like you work late nights often.",
      "id": 81,
      "comments": [
        {
          "score": 4650,
          "content": "[deleted]",
          "id": 82,
          "comments": [
            {
              "score": 1087,
              "content": "The screaming is what makes her an asshole talk to him in the morning no need to walk in the house acting like a crazy person after she made a mistake. Also phones are not super intuitive I had this setting on with a friend he had to explain to set my phone to do not disturb not silent. And then. Nothing because we talked like normal people and I made a change after an honest mistake.\n\nEdit:to all the people saying WhEn DiD sHe SaY sHe ScReAmEd!? It’s a story from her perspective and she still sounds unhinged calling someone asleep 22 times for a non emergency along with someone that she’s not related to. Do you think she has the emotional maturity to be calm at midnight while pissed?",
              "id": 83,
              "comments": [
                {
                  "score": 1085,
                  "content": "[deleted]",
                  "id": 84,
                  "comments": [
                    {
                      "score": 1040,
                      "content": "You don’t get a free pass for being an asshole because you nominally “own that.” You can’t say “I acknowledge my part in it” and then yell at someone else for your mistake because you claim to already have acknowledged it. You’re still yelling at them, not yourself.",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "OP taking full ownership is just words. She showed by her ACTIONS she was TA. Her emotions, stress, exhaustion, and whatever are all her problem, not his. At the end of the day the husband has a life too, and wasn’t expecting to be called so many times given that it was past midnight. Frankly, that she thought to call all these people in the first place when she could (and did) solve the problem by herself makes her a bigger AH. Or is his life/needs not relevant because he’s the husband. \n\nImagine the roles were reversed and hubby showed up foaming at the mouth past midnight because he couldn’t get a hold of his wife after calling 20+ times because he needed a ride after midnight (when he could have Ubered). A conversation about how to handle emergencies could have waited until the morning, every call to hubby past the third one was pure entitlement and completely unnecessary. TA",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "its passed midnight the logical belief in that situation is hes not answering cause he went to sleep... this should of been a conversation she turned it into a arguement",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "I am pretty sure op knew her husband was asleep..",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Dude, it was at night. People are sleeping at night. \nThat he was asleep is by far the most logical conclusion, no need to imagine an emergency in this situation. Call me old fashioned, but there are emergency lines and lots of resources. My partner is an adult. Of course I'm helping out when I can or in case of an emergency, but I'm going to be honest here: when I sleep, my phone is on silent. But we're also living in a pretty safe country and additionally a safe area, so maybe walking around at night isn't the same.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "People on this sub when a man shouts at his wife out of frustration:\n\n> I get your frustration, but you shouldn't have yelled, YTA.\n\nPeople on this sub when a woman shouts at her husband out of frustration.\n\n> I totally get your frustration, who wouldn't have shouted? NTA.",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "There's nothing saying that there was any screaming, from either party.",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Where does OP say she screamed or yelled at him?",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Also, she had to wake him. They still had to go get the vehicle before this became a costly mistake as well as a major inconvenience. She’s already upset about everything, she came home to find nothing wrong, so she yelled. Personally I think ESH but only as a bare bones kinda way. Both made a mistake. Both will calm down and realize it could have been worse. Both will probably ensure these events do not happen again. Normal married life",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "OP did not “own their mistake,” as they still took their anger out on their husband for being asleep.\n\nIt is ok for wanting your spouse to be reachable. In fact, I tell my husband all the time that he should have his phone on. But I never get “pissed” about it.\nIn this case, it’s all in how you handle the conversation.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "So basically a rare emergency situation that hasn’t happened and has nothing to do with this situation makes her right? 😂",
          "id": 95,
          "comments": [
            {
              "score": 17,
              "content": "Yea, that’s the common consensus here. Plenty of comments saying “you’re NTA because this completely different potentially life or death situation happened to me” ignoring the fact that this was over OP forgetting her keys.",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Apparently so.\n\nAlso since when does forgetting your keys constitute an emergency that’s literally a common inconvenience.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "Op has the right to be upset but this situation did not warrant her waking him up to argue about it",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I'm going to say OP is TA, unless she also got mad at her son and friend for not answering. The husband made a mistake.",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I feel like if you reversed the genders people would be up in arms. Husband forgot his keys in his car called his wife 22 times then constantly in the Uber back home. Gets home and wakes his wife up to immediately start yelling at her.\n\nClear AH either way.",
          "id": 100,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3998,
      "content": "YTA. Your first move here should have been taking an uber home. Calling someone 22 times in a row should be reserved for emergencies only. And calling friends after midnight over a minor inconvenience is totally innapropriate. \n\nYou could have 100% solved this non-emergency situation yourself. But you decided to make it everyone else's problem.",
      "id": 101,
      "comments": [
        {
          "score": 4372,
          "content": "Wow. I would help a friend who called me after midnight for this, no questions asked.",
          "id": 102,
          "comments": [
            {
              "score": 2421,
              "content": "[deleted]",
              "id": 103,
              "comments": [
                {
                  "score": 3236,
                  "content": "You can tell there are a lot of men in this thread who don’t have to constantly worry about being assaulted or threatened while alone at night. Must be nice!",
                  "id": 104,
                  "comments": [
                    {
                      "score": 504,
                      "content": "[deleted]",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "I think it may also be a question of where you live. I'm female but where I live I'd still feel safe waiting for an Uber (which would probably also be there faster than my husband).",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "I see where she's coming from as a woman. It's the fact, that she felt scared and couldn't rely on her husband.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "this idea this men walk the streets at night alone without constant worry of being threatened or assaulted is fucking ridiculous and needs to be put to bed",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "OP at no point indicated that she felt threatened or unsafe. There's plenty of cities where you can be at a train station at night without fear of assault, regardless of gender. You'd think she'd be a lot less worried about a parking ticket if she were afraid for her life. Besides, the husband probably would've taken longer to get to her than the Uber, so how exactly would that have helped protect her?\n\nWomen are at a statistically higher risk of sexual harassment / assault, but it doesn't typically happen in back alleys in the dead of night. It happens in social situations, at clubs, in workplaces. It's often people they know. Not everything is about gender. She just forgot her keys and freaked out, her husband isn't automatically the asshole just because she's a woman.",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "My husband wouldn't even let me walk to the area at midnight to get my car like that. I'm am shocked at the Y t a posts. It would be dangerous for op to go back and get her keys. Yeah op made a mistake but no one is perfect and spouses are usually the ones to help us out.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 412,
              "content": "I ALWAYS tell my friends to call me if they need a ride, no matter the time.\n\nGranted I’d be pissed if they purposely kept going out every weekend with no plans of how to get home because they knew I’d come get them, but in a situation like OP’s I would be more than happy to help them out. Being out after midnight already isn’t safe for a female and having a car ticketed/towed sucks.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 369,
              "content": "Yeah some of these people are shitty friends",
              "id": 112,
              "comments": [
                {
                  "score": 13,
                  "content": "No one is really upset about getting called. She is the ass because she is upset no one helped. By all means call me in an emergency. But don't crucify me because I was asleep. Taking an Uber home and eating a parking ticket is hardly an emergency.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I was referring to the numerous people saying they wouldn't pick up a friend calling for a ride late at night",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 115,
              "content": "Um, that would require giving a shit about the people in your life. We can't have that in this sub!",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I have. When someone you love calls you after midnight it’s a big deal and if you’re any kind of friend and are in a position to be able to help, you get up and go to them.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "If I heard the call and I wasn’t busy or asleep, ok.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Just because you would doesn't mean it's not an annoying inconvenience.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 571,
          "content": "It’s not her friend it’s a spouse?",
          "id": 119,
          "comments": [
            {
              "score": 1356,
              "content": "She called her husband, her son, and an additional friend beyond that.",
              "id": 120,
              "comments": [
                {
                  "score": 1237,
                  "content": "I would hope my friend calls me at any time if they are stranded. Dangerous things can happen in a car park alone at night",
                  "id": 121,
                  "comments": [
                    {
                      "score": 472,
                      "content": "Yeah seriously, reading the replies on this I'm like damn some cold people in this world. If a friend or loved one called me in any sort of worry at 12am I'd be there 15 minutes before GPS said I should be. Whether it was serious or not, you deal with that AFTER they are safe and secure.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "But she wasnt stranded, she was able to get back.",
                      "id": 123,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Agreed, people ITT are cold.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I would also hope that my friend doesn’t barge into my house in the middle of the night upset at me because I had slept through their call from when they thought they needed me.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I agree with you, but I would also hope my friend called an uber right away instead of waiting to make 22+ phone calls. You can always cancel an uber, but extending the time you're in that area is not worth it.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 268,
              "content": "She also called friends and her son.",
              "id": 127,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I hope my spouse is also my friend!",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 202,
          "content": "Why not go back to place of employment while calling husband 22 times?  I don't get that.",
          "id": 129,
          "comments": [
            {
              "score": 505,
              "content": "Op said since it was after midnight she might not be able to get back into her work since there might not be anyone available to let her into the building.",
              "id": 130,
              "comments": [
                {
                  "score": 13,
                  "content": "That's what confuses me. If she had no real expectation of getting her car keys back that night, then how was this an emergency at all?",
                  "id": 131,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Her husband had a spare key. He could bring her the key so she could get the car out of the lot before they ticketed.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I am telling you.... she just didn't want to solve her own problem.  she didn't want to get an overnight parking ticket and the UBER cost her something too.  She is mad that her f-up cost her some money and she wants to blame someone convenient.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 201,
          "content": "She’s upset because he wasn’t available, not because of her car situation. She consistently comes home alone late at night, as her spouse he should be reachable in case there’s an emergency. It could’ve been something way worse and dude is super careless to just pass out with zero concern for the safety of his family. \n\nAt least now she knows her husband is totally unreliable and she should remove him as her emergency contact.",
          "id": 134,
          "comments": [
            {
              "score": 30,
              "content": "I understand where the OP is coming from.\n\nMy son lives with my ex during the weekdays and the weekend with me. I always have my phone to ring and vibrate loud when my son is not with me and I turn it off when I have him.\n\nOne day I guess I left it on silent and my ex called like 20 times. My son was alright but he had to go to the doctor in the middle of the night because he was really sick. I felt horrible that I wasn't there.\n\nIf the OP's husband knows that she comes home late, he should have his ringtone on but sometimes it goes on silent without even realizing it.",
              "id": 135,
              "comments": [
                {
                  "score": 13,
                  "content": "You felt horrible, but do you think you deserved to be berated for it as well? I don't.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Nope. It was the OP's fuck up and she made it about her husband and son but I do understand how the husband had an unreliable moment.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "So wife can make a mistake and husband can't?",
              "id": 138,
              "comments": [
                {
                  "score": 7,
                  "content": "OP is totally taking out her shit on her husband and he knows it. He said it was an accident. OP can say she \"owns her mistake\" all she wants, but it is clearly not the case.",
                  "id": 139,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "It sounds like it was a mistake. He had his phone on silent, and she forgot her keys at work. I'll bet that neither of them make the same mistakes again, but you don't blow up at each other for something that's unintentional.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You cannot expect people to be 100% available 100% of the time.  That's a ridiculous notion. Y'all act like you are robots waiting on a charger, ready to spring out at a moments notice... like you never had a single instance of unavailability",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Depends on income. An Uber may sometimes mean people go without food. Needs more info.",
          "id": 142,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "I wonder if the OP also got mad at her son and friend for not answering.",
          "id": 143,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Yeah i have huge issue with people doing this relentless contact thing.\n\nIf i dont answer, send a text. If i dont reply, call again.\nThat's were it ends. Assume i dont have my phone, ill be back in contact when i can.\n\nAnything more than this is rude",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yikes, glad you ain't my friend.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Inappropriate? She wasn’t calling her boss or the queen. Chill. I would be ashamed of myself if my friends didn’t think they could call me at any hour.",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "What kind of \"friend\" would someone be if they don't want to be called when their friend feels unsafe or has a problem. Friends are not just for having fun.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3326,
      "content": "NTA. This is a weird one. I didn’t realize so many people would be okay with their spouse being out of reach (unless it was something you both knew about ahead of time). The recent AITA about the dude whose fiancé was MIA for nine hours - he was quite right (from all replies) to flip because he couldn’t get in touch, but this person shouldn’t be mad, because… I don’t know.  \n\nIf I were stranded somewhere and tried to call my partner and they ignored me, I’d be upset too. I’d also point out to them that if I had been calling for an emergency - say I was hospitalized and trying to get ahold of them - they would’ve missed my call, and that going forward they need to be more responsible about it. \n\nBut that’s an expectation for me, not you. If your spouse didn’t know you expected support…",
      "id": 148,
      "comments": [
        {
          "score": 935,
          "content": ">If I were stranded somewhere and tried to call my partner and they ignored me,\n\nHe was asleep...he wasn't ignoring her.",
          "id": 149,
          "comments": [
            {
              "score": 834,
              "content": "I expect (and have done it myself) that I’d be added to my partner’s phone as an emergency contact to bypass silent mode on phones. I would not ever want to miss my partner’s call. I know they’re not going to call me at 3 am for shits and giggles.",
              "id": 150,
              "comments": [
                {
                  "score": 367,
                  "content": "That’s the thing, she is set to ring through but he still had the phone on silent and on a soft surface. Problem is on IOS silent and dnd are different things so if you silence the whole phone, nobody will ring through, just vibrate.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 220,
                      "content": "I use IOS. You can set someone on emergency bypass, which means it will ring even if the phone is silenced. Source: I have my phone on silence always, and have some people as emergency bypass contacts.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "That does not mean someone will wake up instantly.  People still need to sleep and you can’t guarantee someone will wake up, that’s not how sleep cycles work. \n\nHow scared of life are you people that you can’t pivot to calling a cab without an entire entourage knowing about your *oooo so harrowing* Uber ride.  \n\nThis is so sad.",
                  "id": 153,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "How can that be done?",
                  "id": 154,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Depends on your phone, but in iOS you click the Ringtone option for a contact and select the Emergency Bypass option.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "In android you use don't disturb mode instead of silent mode, this means calls and notifications are on silent, it also allows you to list some contacts that can reach you directly, they will always ring.\n\nI also have a setting that if the same number calls 3 times in 10 minutes it will ring, anyone calling 3 times in 10 minutes it's in an emergency.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "For iphones, you can set DND to be bypassed either by all contacts or only favorite contacts on or after (can’t remember ATM) the second ring. Doesn’t matter if your ringer is on or just set to vibrate, only those people’s calls can reach you on DND.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "OP said herself it wasn't an emergency, so while your SO might not call you for shits and giggles, this one apparently will and does. \n\nIts pretty scary to me that so many people here think someone is an asshole for being unreachable in the middle of the night. You can really tell how young the audience here is.",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Personally I wouldn't want anyone bypassing my silent mode, I was almost fired once for being on my phone at my first job, ever since its been on silent permanently. I suppose I could change the settings twice a day but when all it takes is one time forgetting to do it to lose your job it isn't worth it to me",
                  "id": 159,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Some people may not know that’s a thing. I didn’t until I read this. He isn’t at fault for being asleep. She should not be angry at him for that.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "emergency contact isn’t a feature that everyone knows about. our phones have literally hundreds of features. if it was an emergency she seems capable of calling 911.",
                  "id": 161,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I guarantee not everyone knows about that though. I myself just learned of this and I dont think my fiance knows of it either.\n\nBut I always leave my phone on though for other stuff. It sucks when it wakes me up but eh",
                  "id": 162,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Right? I don't understand these people.\n\nHe didnt ignore her\n\nHe didn't hang up on her\n\nHe didn't go do something else\n\nHe was sleeping. And accidentally put his phone on silent. How was he to know he got called 22 times? He. Was. Sleeping.",
              "id": 163,
              "comments": [
                {
                  "score": 14,
                  "content": "He should be awake and holding his phone staring at it at all times in case his SO needs something.  DUH.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Oh SHOOT. you're right!\n\nI understand being available for your spouse.\n\nWhen my wife goes out and she says \"I might need a ride\" I put my phone on loud and usually stay up as alye as possible until I pass out.\n\nBut if on a random night when she wasn't needing me and then called me 22 times and I didn't wake up? She wouldn't be mad. I'm a heavy sleeper and regularly sleep through my alarms, let alone a phone call",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "The fact there's a ton of people trying to blame him for being asleep is mindboggling. Not sure if its just redditors wanting to play devil's advocate, but good lord some of them just want to blame him regardless of her actions.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 380,
          "content": "Most people put their phones on silent when they go to sleep.  It's weird to think otherwise.",
          "id": 167,
          "comments": [
            {
              "score": 287,
              "content": "It’s weird to think that you wouldn’t add your partner as an emergency contact to bypass silent mode.",
              "id": 168,
              "comments": [
                {
                  "score": 586,
                  "content": "I, for one, didn't know that was an option.",
                  "id": 169,
                  "comments": [
                    {
                      "score": 244,
                      "content": "Neither did I, and I am a tech savvy person.",
                      "id": 170,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 106,
                      "content": "same, brand new information to me and I'm not exactly a technophobe by any means",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Most people do not know it is. So I would never assume someone has it on.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "At least on my version of Android it is not an option. Only if they call twice it will punch through DND, nothing for silent.",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "If your spouse calls you 20+ times over losing her keys and everyone else in her phonebook you might not be inclined to add that bypass.\n\nSuch an entitled attitude on aiti expecting people to be available for you 24/7",
                  "id": 174,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "I have 0 emergency contacts lol",
                  "id": 175,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "never heard of that..",
                  "id": 176,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I think that’s something you have to discuss with your partner and not just expect them to know this is a thing.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "IDK She accidentally forgot her keys, he accidentally had his phone on silent. Everyone is ok. I think maybe they should both relax. What does OP want? The spouse can't rewind time and have the phone on. Can only try to make sure it's on in the future. I don't know why this is a \"fight\". It sounds like OP was very stressed (understandably) from the situation. Some of that stress came out as anger at spouse for not being available/not being completely understanding of that anger/stress and in turn, got miffed back/felt attacked for a genuine mistake/whatever. \n\nSeems to me that both are kind of TA, Spouse can acknowledge OPs feelings and add her as an emergency contact/try to make sure it doesn't happen again. OP can be understanding that accidents happen and try to be understanding that spouse was not being malicious and was in fact unconscious.",
              "id": 178,
              "comments": [
                {
                  "score": 6,
                  "content": "She went crazy because of his accident after having her own accident, she is 100% TA. A NTA would've waited till morning to talk things over.",
                  "id": 179,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 239,
          "content": "That other situation was completely different. If your spouse is out and supposed to be home that night and then stops answering calls and shows up at 7am the next morning, that is a problem. A spouse not answering their phone because it’s 2am and they are sleeping at home…that’s reasonable. That person isn’t “out of reach”, they’re sleeping! You have a right to sleep, you don’t have to be accessible at all times. There are exceptions…say OP was pregnant and could go into labor…then I’d say it’s reasonable to expect your partner to have their phone on them and ringer on all the time.",
          "id": 180,
          "comments": [
            {
              "score": 31,
              "content": "\"You have a right to sleep, you don’t have to be accessible at all times.\" That's what you say about your boss calling you or if she just wanted to chat at that time, but definitely not for this situation or emergencies in general... NTA",
              "id": 181,
              "comments": [
                {
                  "score": 14,
                  "content": "No. I mean I don't live my life waiting for my wife's emergency. I want to be there for it, and she isn't silenced on my phone. But I can still sleep when she isn't home.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 8,
                      "content": "OP isn't angry that their partner was asleep. They're angry that the partner was unreachable.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "I often put my phone on silent throughout the day and have forgotten to turn it back on more than a few times. It happens. He wasn't intentionally ignoring her; it was an unfortunate oversight.",
          "id": 184,
          "comments": [
            {
              "score": 3,
              "content": "Totally! I have a Fitbit though and it vibrates when I have a call coming in- which actually will wake me up or alert me if my phone is on silent and I don’t hear it (which actually happened today at work- phone in my pocket, didn’t feel it).  That’s my cheat for silent mode.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "lol, being asleep =/= ignoring your partner\n\nespecially AFTER MIDNIGHT, unless your partner has given you reason to believe they would consistently be awake at that time, why would you have any expectation that they're going to pick up the phone, regardless of it being on silent or not? plenty of people sleep through alarms let alone just a phone ringing or buzzing.\n\nmore importantly, OP is literally mad at her husband for something SHE fucked up, and then made essentially zero effort to fix while expecting literally anyone but her to resolve the situation, again, all after midnight. sure, there's no guarantee she gets back in the building but why not at least TRY to go back while she was trying to call her husband or simply Uber home immediately to get the spares?",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "The MIA person was traveling away and said they'd be back at a specific time then went radio silent. This guy was at his home, sleeping at the normal time most people sleep. This is very different.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "So you are the type of person who wakes up his SO to fight with him instead of communicating ? What a healthy couple",
          "id": 188,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "I would argue waking the husband up furious at him made her the asshole.\n\nHe thought the phone would ring if she called twice. It was an honest mistake in a non emergency situation. She wasn't stranded, she called an uber home. \n\nThis deserves an honest talk with you partner in the morning, so that he doesn't do it again because it could have been a problem, not a \"wake you up in the middle of the night heated discussion\" when she arrived.\n\nShe is not wrong by complaining, it's the manner and timing that was wrong.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Literally every person I know puts their phones on do not disturb at night. Y’all live much higher stakes lives.",
          "id": 190,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": ">If I were stranded somewhere\n\nDon't be so dramatic. Op could uber home just fine. It's not like it was in the middle of nowhere.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2198,
      "content": "NAH\n\nPeople here responding telling OP to call 911 if it *was* an emergency don’t get the point. The point is that OP’s partner was unable to be contacted. If there had been an emergency and emergency services were calling and calling, he *still* wouldn’t have answered. *That* is what OP means when they worry about him not responding during an emergency. OP was not saying their partner should ACT as emergency services. \n\nOn the other side, her husband didn’t do it intentionally. There wasn’t malice here. \n\nEveryone is *so* mad in the comments. \n\nTake a break, guys.",
      "id": 192,
      "comments": [
        {
          "score": 383,
          "content": "NTA - but I agree with OP - the whole reason we have these mobile phones is we can be reached when needed.   I wouldn't say OP's husband is the bad guy but he had a phone and the one time your really needed to talk, he wasn't there.",
          "id": 193,
          "comments": [
            {
              "score": 296,
              "content": "I don't want anyone on the planet to think they have unfettered access to me at all times.\n\nHaving a cell phone doesn't mean you signed up to be tethered to your phone at all times.",
              "id": 194,
              "comments": [
                {
                  "score": 244,
                  "content": "Neither do I. That's why I put my phone on Do Not Disturb, use Google screening, but I also have it set up so that the most important person in the world to me can get through that anyway. Because they might *need* to.",
                  "id": 195,
                  "comments": [
                    {
                      "score": 17,
                      "content": "That's what he thought he was doing and didn't realize Do Not Disturb was different than silent. It was an accident.",
                      "id": 196,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "So you're disagreeing then. Because \"the most important person in the world\" is still someone on the planet. Imagine if you were born 20 years earlier, you wouldn't have survived.",
                      "id": 197,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Not even your loved ones in a time sensitive situation?",
                  "id": 198,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "If you have a partner, elderly parents, or children, I absolutely think you should be reachable at all times.  This doesn't give anyone carte blanche to call you at any time, but you should be reachable in cases of emergencies.   We can disagree with each other on this point.  Everyone is allowed to establish boundaries, but to me, it implies you are not someone who can be counted on because you value being untethered more than helping  out a loved one in a potential crisis.",
                  "id": 199,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "HE WAS SLEEPING.\n\nHE WASNT \"NOT THERE\"\n\nlmao wtf is going on here. He wasnt ignoring her to play games, or hike or whatever.\n\nHe was literally sleeping",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Emergency services would of went to the house to then depending on the situation. Mistakes happen and expecting  anyone to always be reachable 24/7 or not to haven mistakenly left their phone on silent. So she is without a doubt a AH for how she handle the situation.",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Honestly this isn’t even a “who’s the asshole” situation, this is a communication issue. \n\nI hate when people post about situations like this, because AITA is a garbage place for relational advice - it asks people to make concrete decisions on who is wrong/right, when the majority of relational issues (aside from abusive situations) are nuanced and need to be worked out as a team, without blaming or vilifying each other.",
          "id": 202,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Honestly the only real assholes here seem to be in the comments",
          "id": 203,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "yall over defending the OP's argument, the dude should of answered but he didn't deserve to get woken up at 2 in the morning to get yelled at for not turning his phone on when the situation had already been resolved, at that point OP was fine. she was angry at herself and took it out on him",
          "id": 204,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1446,
      "content": "YTA. You took one moment where everything was stacked against your husband that he didn’t hear his phone go off, ignored his reasonable explanation, and jumped to “you’re unreliable in an emergency.” That’s not a reasonable way to talk through a conflict",
      "id": 205,
      "comments": [
        {
          "score": 359,
          "content": "After 12am he wasn’t available mind you - such a reasonable time of day to not be reachable lol",
          "id": 206,
          "comments": [
            {
              "score": 1063,
              "content": "Um, no. If your wife regularly commutes home alone after midnight you should absolutely be available in case of emergency. Hell, if you have any family at all you should always be available.",
              "id": 207,
              "comments": [
                {
                  "score": 217,
                  "content": "Nah. You don’t know his job. He’s NTA. When my gf worked late I tried to make it as late as I could but I wake up at 6am for construction and at one point I can’t keep my eyes open. \n\nYTA saying it’s reasonable to shake him awake and complain at him. This wasn’t an emergency and neither you nor OP can pretend like it was. And it sounds like if he can’t stay awake and she works late always that’s in need of a couple’s solution that doesn’t include blaming him entirely for a fictional event.",
                  "id": 208,
                  "comments": [
                    {
                      "score": 236,
                      "content": "I don't think anyone's suggesting he shouldn't go to sleep while she's working nights. Just that he shouldn't go to sleep with his phone on silent (with no emergency contact bypass) AND silent while she's working nights.",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 66,
                  "content": "I missed the global decree that now that everyone owns a phone, they must be available to answer their phone at any time. 911 is the number to call if there's an emergency. \n\nAnd I mean really, I'm having trouble imagining here, so together let's consider all the possible emergencies that could have occurred that night, and which ones are ones where getting in contact immediately with the husband was critical.",
                  "id": 210,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "This is an insane take. Until the late 2000's it was extremely impractical if not impossible for someone to be available even most of the time. We all got on just fine without being able to get in touch with someone 24/7/365. \n\nIts simply ridiculous to expect someone to be reachable at a moment's notice at literally any time on the off chance there's an emergency. You know there are millions of people working jobs where they can't even have a cell phone on them, right? Is OP's husband never supposed to take a flight because he might be unreachable? Does he have to swim with his phone on him? Should he tell his boss he needs to have his phone ring tone on during meetings just in case his wife forgets her keys at work again?\n\nA lot of you people seem like you're really high maintenance if you seriously think this way.",
                  "id": 211,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Also it's pretty ironic that the emergency was she forgot her keys, something an unreliable person would do. It's not like he knew he was in an emergency situation and flaked.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1332,
      "content": "YTA. This wasn't an emergency...so you woke him up after midnight to yell at him for not waking up? Charming. What was so bad about waiting until morning to speak to him and ask he recheck his settings? Not sure why you preferred to stew on your way home and start an argument at an ungodly hour over a mistake you made. You forgot your keys. You could have called an uber and gone back to your work eith spare keys if you really wanted to.",
      "id": 213,
      "comments": [
        {
          "score": 719,
          "content": "Yep this is why OP is firmy TA.\n\nI understand being frustrated with the situation & being concerned for future emergency situations. \n\nWhat is *completely unacceptable* is waking them up to yell at them half asleep. To take your anger out on your spouse. To still be angry with them *two weeks later* stewing on such a minor issue.\n\nThis could be so easily solved with some rational conversation the next day. The husband mistakenly thought DnD & silence were the same features - now he knows & can fix it for real emergencies going forward.",
          "id": 214,
          "comments": [
            {
              "score": 207,
              "content": "Agreed. If you work in construction or mining or something easily as dangerous you would understand this as a 'near miss' - a situation which could have been bad (I.e. not being contactable in an emergency) but didn't have negative consequences. It's an opportunity to learn and educate, not point fingers and blame. \n\nYour final point hits the nail on the head, he can fix this to now be reliably contactable in an emergency. Didn't need to be woken and yelled at to achieve this result. \n\nI get that OP owns their mistake but I feel YTA for what you did to your husband.",
              "id": 215,
              "comments": [
                {
                  "score": 109,
                  "content": ">Your final point hits the nail on the head, he can fix this to now be reliably contactable in an emergency.\n\nThe other strike against OP is that instead of using this as a learning activity, she generated (and 2 weeks later, is *still generating*) conflict over it, which has a tendency to predispose people to be defensive instead of taking lessons from things.",
                  "id": 216,
                  "comments": [
                    {
                      "score": 10,
                      "content": "And feel less inclined to respond late at night if they call",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "This thread is giving me flashbacks. \"Generating conflict instead of learning\" was my ex's standard operating procedure and over the course of 20 years this was actually traumatizing. \n\nI'm glad she chose only me to treat this way and doesn't do it to the kids.",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "I would go so far as to say that if OP is the kind of person who calls 20+ times over every little thing like this the husband is not actually wrong to have his phone on silent when he is trying to sleep.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I don’t think she was wrong for calling her husband. If this was my partner I’d hope he calls me before having to get multiple Ubers and maybe a parking fine that will ultimately cost *us*. It depends on your financial situation, but I’d rather get up and give him a ride in that situation.\nGiving him a ring hoping he answered is fair.\nWhat’s not cool is waking him *after* getting the Uber just to yell that he didn’t pick up!",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Speaking of mining or construction, sending her husband to work with a few hours of sleep after he spent half the night chauffeuring her around is far more dangerous than her taking an Uber home. OP took zero responsibility for her own mistake, she's owned nothing. The fact that she blew up for weeks about this says to me blaming her husband for her mistakes is not an uncommon issue.",
                  "id": 221,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Yup, \"near miss\" is a thing in medicine as well. We need to do all we can to prevent serious safety events, so near misses are reviewed so we can see what could be changed so that we can prevent something more dangerous occurring in the future.",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "As someone with anger issues I know exactly how OP was thinking in that Uber and it's 100% projection. OP is def TA",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Exactly, if the husband forgot his keys how would OP react?\n\nWould it be different since he's a man?",
          "id": 224,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "She woke him up to take her to go get her car(she had to that night if you didn't read that part) and bitched at him some at the same time.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 912,
      "content": "YTA. I don’t think I know a single person who has ever put their phone on silent who hasn’t at one point forgotten they’ve done so. It happens.\n\nAlso you do not call people 22 times for ‘forgotten keys’, especially not after midnight. \n\nEmergency’s after midnight are for the emergency services. If it’s not for the emergency’s services then it’s not a true emergency. \n\nYou had your phone and the means to pay for a ride home. It was never an emergency, merely an inconvenience that you caused yourself.",
      "id": 226,
      "comments": [
        {
          "score": 147,
          "content": "Worded perfectly.\nOP- YTA 100%",
          "id": 227,
          "comments": [
            {
              "score": 144,
              "content": "I've had a phone for 25 years and the only \"emergencies\" of other people Ive ever had to deal while asleep were buttdials, drunk texts and Amber alerts.\n\nMy phone is on silent when I sleep.\n\nOP YTA obviously. 22 times ffs....",
              "id": 228,
              "comments": [
                {
                  "score": 9,
                  "content": "22 times before getting in the Uber and then constant calling in the Uber lmao",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": ">I don’t think I know a single person who has ever put their phone on silent who hasn’t at one point forgotten they’ve done so. It happens.\n\nOr accidently put their phone on silent.  I can't tell you the number of times I've accidently placed my phone on silent because I accidently keep pressing that damn down volume key when talking on my cellphone.  Good thing is my kids/family/friends can still reach me in case of an emergency at my Mom's number since she still have a landline with the same telephone number she's had for 35+ years and I live upstairs.",
              "id": 230,
              "comments": [
                {
                  "score": 5,
                  "content": "Emergencies are the only reason my parents haven't gotten rid of their landline phone.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Does no one else keep their phone on silent 24/7?",
          "id": 232,
          "comments": [
            {
              "score": 10,
              "content": "Mine is always on vibrate. Can't remember the last time I had sound on",
              "id": 233,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "I can think of plenty very urgent scenarios that wouldn't warrant calling 911. \n\nForgotten keys that are 30 minutes away on foot and train is a bit of an emergency imo. Have you ever tsken public transit late at night?",
          "id": 234,
          "comments": [
            {
              "score": 11,
              "content": "If you can get and afford an Uber home, that's not an emergency. IMO this is a bit of a privileged take. She has a keypad entry and could get inside her home fine; this was an inconvenience, not an emergency where she had NO options if someone didn't pick up.",
              "id": 235,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Yes. And I am a woman. This is not an emergency. She was locked out of her car. Not her home.",
              "id": 236,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Emergencies after midnight are for emergency services?? Huh?? So if your child or SO was in danger or needed help you wouldn’t want to know?",
          "id": 237,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 648,
      "content": "You. Must. Chill.  Seriously.  You called him 22 TIMES?!?!  You’re still mad TWO WEEKS later?  That’s excessive.  \n\n\nWhy did you even call him to pick you up in the first place when you could have Uber’d?  Knowing he was asleep?  That’s pretty inconsiderate.  You want him to be concerned about you, but you weren’t concerned about him - you literally wanted to wake him up to do what an Uber could (and did) do for you.  Please try to think about other people, and get a hold of your anger.  \n\n\n22 times.  How are you not embarrassed?",
      "id": 238,
      "comments": [
        {
          "score": 207,
          "content": "Seriously, this upset after 2 weeks? I am flabbergasted.",
          "id": 239,
          "comments": [
            {
              "score": 36,
              "content": "Can you imagine being married to this person?  The hubby must be a saint.",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "And over something that was her fault too lmao",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": ">You called him 22 TIMES?!?!\n\nAfter 3-4 times just give up. He clearly can't hear his phone, you're just getting yourself worked up.",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Not only that, but once she did get home the first thing she did was wake him up and scream at him. Pretty clear she blames him for her inconvenience and wanted to punish him for it. If she was actually worried about what would have happened in a real emergency she could have raised it with him the next morning.",
          "id": 243,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "The 22 times gets me. I’m not sure I have an opinion about not being contactable, or the rest in general, but I’ve been in the mindset many many years ago that would lead to behaviour such as calling 22 times in a row and it’s ultimately down to emotional dysregulation. I think there’s probably bigger priorities for OP other than her husband’s contactability. I wish them the best.",
          "id": 244,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Right? Nothing happened to her and she was able to Uber home. The majority of her anger is about what hypothetically could’ve happened. It’s a legitimate point that your spouse should be contactable in an emergency, but the amount of emotional energy and emphasis on it is way out of proportion",
          "id": 245,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 610,
      "content": "YTA he did not ignore your call, it was not an emergency, and now you can have a discussion about your expectations when you are out of the house and he is sleeping.",
      "id": 246,
      "comments": [],
      "relation": "Attack"
    }
  ]
}