{
  "post content": "\n\nMy wife is a grade A+ picky eater. It's bothersome to a certain degree but on holidays basically the shitshow begins. She'd refuse to eat certain meals and mom would take it personally...which results in a series of arguments between them.\n\n\nAs a compromise this year, My wife offered to bring her own food to thanksgiving dinner. I was stunned I asked if she thought this through and she looked at me confused. I told her about how weird it'd be for her to bring her own food especially when she woudln't be sharing it with anybody else, and told her to think about how mom will react. She'd get very offended and upset. My wife said that it's not her problem and that she was just trying to make it work by bringing her own meal. I told her again that mom might not like nor even allow this. She blew up at me asking if I want her to either eat food she doesn't like or go hungry. I suggested she give my mom's food a chance but she said it wasn't about my mom's cooking, she just doesn't like certain foods. We had an argument and I ended up telling she could stay home this thanksgiving and have whatever meal she likes. She got quiet then lashed out on me calling me insensitive and negative to say this to her. I repeatedly asked her to calm down but she couldn't stop ranting about how I was basically willing to exclude her from a major event.\n\nShe started cold shouldering me about it while at the same time guilting me saying I'm treating her poorly after she offered the \"perfect compromise\".\n\n\nUpdate: And so, my wife has decided to go spend thankgiving with her family (who by the way live HOURS away, so this means unnecesary travel expenses) instead and basically ditch me for a whole week. Y'all happy now? Though I appreciate some insightful comments on the situation. Some others?.....not so much especially with those assumptions claiming that my wife has allergies, SHE DOES NOT! Y'all get that from? But anyway. S'all good now I guess though I'm not too thrilled with her decision. I feel like she's doing it to spite me or get me to cave in.",
  "id": 1,
  "comments": [
    {
      "score": 45874,
      "content": "YTA. She offered compromise. My wife's family does the feast of the 7 fishes. I hate fish. So since I joined the family it's the feast of the 7 fishes and a chicken. We all get a good laugh and my MIL is happy to make it for me.",
      "id": 2,
      "comments": [
        {
          "score": 11908,
          "content": "My family did the 7 fishes and chicken and a baked ziti because I too don't eat fish. It's not that big of a deal to either bring or make something else. Everyone else had some of the non-fish dishes too!",
          "id": 3,
          "comments": [
            {
              "score": 3558,
              "content": "Baked Ziti always gets in there somehow!",
              "id": 4,
              "comments": [
                {
                  "score": 1955,
                  "content": "Who doesn't swoon over a baked ziti?!? Om nom nom nomnomnomnom",
                  "id": 5,
                  "comments": [
                    {
                      "score": 786,
                      "content": "True confession: I've never tried it or even seen it available.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 239,
                  "content": "[removed]",
                  "id": 7,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "For my husband’s family it’s lasagna",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1080,
              "content": "[removed]",
              "id": 9,
              "comments": [
                {
                  "score": 130,
                  "content": "My thoughts exactly. OP is placing Mommy Dearest's feelings above his wife, who I think from the sounds of it probably has ARFID and therefore has a very valid reason to make her own compromise for food if OP's mother won't be kind enough to provide accommodations...which she obviously doesn't since she's just as much of an AH as OP is.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I think it's definitely ARFID. Sometimes it's the textures of foods that is the turn off also. No reason to not accommodate your loved ones. It's fine to encourage trying different foods, but being forceful about it usually pushes that food even farther into the \"no way I'll eat that\" zone.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 118,
                  "content": "SERIOUSLY THIS",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "He despises his wife. Everything she does he sees coloured through a negative lens. His update is full of poor me she’s doing it to spite me words. Everything is about him. He’s petulant and immature, and I really hope a week away from him will give his poor wife a moment of clarity. He needs to not inflict himself on another poor woman until he’s actually grown up.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Right? He was “oh mommy dearest will be offended!” His edit makes it worse!!! “She’s now going to spend thanksgiving with her family who live hours away.” Then continues to be pissed about “unnecessary travel expenses” and that she’s using this to force his hand.\n\nExcuse me sir? 1) does your wife go back to see her family holidays? And why on earth would should she starve on thanksgiving or eat things she doesn’t like to appease your mother? It sounds like going to her parents where she will be able to not only eat but eat things she enjoys without bickering with her MIL sounds like it will be a reprieve. \n\nMan, OP sounds insufferable! And also a “grade A++” AH. \n\nSorry for grammar, on mobile and on lunch break. Don’t care to fix ATM.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1015,
              "content": "I'm so jealous of Italian families with the feast of the 7 fishes.... I will totally eat your fish portions for you\n\nETA: Italian-American",
              "id": 15,
              "comments": [
                {
                  "score": 648,
                  "content": "I have never heard of the Feast of the 7 fishes until now and am swooning. Would love that! If only my husband didn't hate seafood...",
                  "id": 16,
                  "comments": [
                    {
                      "score": 574,
                      "content": "Feast of the 7 fishes is on Christmas Eve.  It consists of 7 different fish entrees/appetizers and usually baked Ziti, lasagne, and regular sides.  We then have the usual Christmas Day dinner too.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "My mom would do that every year at Christmas time. Lobster, shrimp, scallops, flounder.......now I'm hungry and miss my mom. :-(",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I used to work in a seafood department with a huge variety of beautiful and fresh fish. I was so surprised by this tradition! I had never heard of it before working in seafood. It was so much fun getting the Italian customer during the holidays and helping them choose all their fishes!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My fam does turkey but I’m pescatarian. My mom always makes me a fishy treat. I had not heard of the feast of seven fishes but it sounds like a dream! 😻",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 378,
              "content": "(What is the feast of 7 fishes?!?)",
              "id": 21,
              "comments": [
                {
                  "score": 961,
                  "content": "Italian Christmas eve meal with pasta and seven different types of fish. The ones I can remember off the top of my head are eel, oysters, little octopus things, some other tentacle thing, a regular fish (idk which one), and some other stuff. I don’t eat fish so my grandma gives me plain spaghetti with her regular sauce.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 247,
                      "content": "Wow! Coming from a very landlocked county in California, this would be a hazardous evening!\n\nSounds delicious!",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "Not to contradict you, but it’s an Italian-American tradition. I’m Italian and I had to google what it is! In Italy the tradition is just seafood for Christmas Eve, but we don’t count how many types of fish! A nice local tradition for Christmas Eve that I find really amusing belongs to the capital: in Rome they fry everything for that night. Veggies, cod’s fillets, potatoes.. but the rest of Italy goes for seafood.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "My friend remembers that growing up, the day before the Feast of the 7 Fishes, there would be a live eel swimming in the bathtub, which would be expertly prepared by her father. After he died, her mother asked if anyone would mind if they skipped doing the eel. They happily subbed in Clams Casino. LOL",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "One of the fish in traditional Italian meals (when ingredients are available) is baccala which is salted cod which gets soaked and used in different types of dishes",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "We always called it Christmas eve with the fish.  50+ Italians circling a huge table piled high with seafood buffet style.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "[removed]",
              "id": 28,
              "comments": [
                {
                  "score": 19,
                  "content": "This sub would have 25% less content, lol",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "My wife and I are both vegetarian and our families from the rural Midwest are not. We \\*always\\* bring a dish that can be a side dish for everyone else but is filling enough to be a main course for us. At meals like Thanksgiving (in my experience anyway) people usually fill their plates from an assortment of offerings, it doesn't hurt anyone if some people eat more or less of any given dish.",
              "id": 30,
              "comments": [
                {
                  "score": 9,
                  "content": "Similar here.  Accommodate everyone.  My sister and I are vegetarian. Our parents, my sister's kid, my partners, and my partners partners (big poly family on my end) are not veg, though they love lots of veg food.  There's half a dozen allergies or dislikes in the group.\n\nSo we just make a huge Thanksgiving feast with a ton of different things so there's plenty of options for everyone, and nobody would even think about getting worked up about what people do or don't choose to eat.\n\nI'm not even bothered by my partner who prefers cranberry goo from the can to my specialty Grand Marnier cranberry relish. Really i'm not. 😉",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "We often throw in Goldfish (crackers) and Swedish Fish (candy) to get to the 7 for Seven Fishes!",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Love it! When my kids were young, they hated the pumpkin pie my mom made. So she made a new tradition and started making banana cream pie so the kids would enjoy dessert.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9183,
          "content": "I have very loved but diet-misguided vegan nephew. I'm a meat eater through and through. Before his vegan ism, I don't think I had ever made a single food item without an animal product. I spent hours researching vegan food for Thanksgiving. I made additions and adaptations to our menu. We did hummus in addition to cheese dip. I did a portion of asparagus without bacon and some potatoes with oil instead of butter. I added Brussel sprouts. He was flattered and slightly teenage boy embarrassed I was being *that Aunt* and many times offered to just bring his own food. Hell no child. Aunty's house is where you come to get spoiled. Here's your plate of veg and there's more if you want seconds.\n\nOP, your wife should feel loved and respected at her MIL's and instead you made her feel marginalized and unwanted.  YTA\n\nEdit: This blew up and thank you all. These are my partner's twin niece and nephew who I met when they were 15. They're great kids (and now great young adults). I remember feeling out of place at family events, like I had to put on a facade, and I want them to always feel the love at my house. I am loving all the vegan suggestions.\n\nEdit 2: For those getting upset by me saying he's \"diet-misguided\", you need to relax. It's a joke between us and we have a very healthy relationship. We tease. One year he got me a stick of butter ornament for Christmas. A few years ago he brought \"NOT A VEGAN PRODUCT\" labels to Thanksgiving and stuck them on everything, including family members and pets. It's become a running joke but it doesn't show any less love and acceptance.",
          "id": 34,
          "comments": [
            {
              "score": 1822,
              "content": "that’s so sweet! i’ve been vegetarian for almost 9 years now and every time we go visit for a holiday, my meat-loving, wakes-up-at-3-am-to-start-the-smoker uncle makes sure i have an option that’s just as good, but vegetarian!! i’ve always appreciated the effort he and my aunt go through to make sure i’m getting food too :) my aunt has even chosen the veggie option over the meat option a few times now lol",
              "id": 35,
              "comments": [
                {
                  "score": 375,
                  "content": "[deleted]",
                  "id": 36,
                  "comments": [
                    {
                      "score": 116,
                      "content": "umm, can your family adopt me?  This is literally my fantasy every time I go home and have to explain that no, I still won’t eat meat even if it’s just little pieces in the vegetables",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 269,
                  "content": "I'm glad you have someone who puts in the effort. I've definitely learned to appreciate Brussel sprouts because of it. (But thar said, I'll grab a scoop then drizzle them with pan drippings. Moderation lol)",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Does your uncle make you smoked mushroom “bacon” or fancy smoked butter?",
                  "id": 39,
                  "comments": [
                    {
                      "score": 49,
                      "content": "no, he uses the smoker for the turkey every year, which is why he has to wake up so early lol but for me he typically grills a portobello mushroom for a veggie burger! and then my aunt will always have some meat-free sides prepped and always makes sure i fill my plate with those lol. i started eating fish about a year and a half ago and he did this beautiful salmon that i still think about lol",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "You might slip him this recipe:\n\nhttps://www.food.com/recipe/walnut-cheddar-loaf-255161\n\nI am not vegetarian but I will take that over any meat on earth. Try it with a white gravy. 🤤",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Exactly! It's not that hard to do-- I'm the only vegan in my usual \"fr-amily\" holiday gathering and our thing is that we all try to have a couple of vegan appetizers (or easy things to have me snag before toppings make it non vegan) and then they have their main meals of traditional foods, and I provide my main meal. \n\nIt is easy enough to make it work when you care about the other person and want to accommodate them, OP's SO isn't even asking for that, she just wants to participate and be allowed to bring food she enjoys, his mom needs to take a step back and be flattered she wants to spend time with everyone, instead of being insulted she doesn't like the food.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My MIL starting making adaptations for my vegetarian self the first thanksgiving I was there and has continued to make them. She always makes sure I can eat all the veggies and stuffing, and I always bring a dessert, generally a homemade cheesecake of some variety. It makes me feel so cared for that she puts the extra effort in and I always tell her so, she is the best",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That's because your Aunt and Uncle have manners and decency.\n\nIf you invite someone for dinner and you know they have dietary needs, then you meet those needs. If you're not prepared to meet them, don't invite them.\n\n I'm guessing OPs mom likes the drama. I mean OP's wife even said she would take her own food. OP is deffo a mamas boy! Now he is crying because she's gone away !\n\nEdit:my terrible grammar and autocorrects.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 436,
              "content": "You sound like an amazing aunt! Wish there were more kind and open-minded people like you in the world.",
              "id": 45,
              "comments": [
                {
                  "score": 539,
                  "content": "Thank you! To be entirely honest, I assumed it was a phase at first. I was supportive of him, but I didn't think it would be ongoing. But it will be 5 years of Thanksgivings coming up soon and we get to meet the vegan gf this year.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 245,
                      "content": "Thank you for being supportive! My family also assumed it was a phase and led to years of eating things like \"potato salad sandwiches\" at gatherings.\n\n21 years later... not a phase",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "As someone who is vegan, the effort you put in really makes all the difference. Like your nephew, I also don't want to inconvenience others so I sometimes end up in situations where I can only drink beverages while everyone else is eating. And while I would never hold it against people, I am technically being excluded so it doesn't feel too great. I really like that you are willing to try something new to make sure your nephew doesn't experience that exclusion at a family gathering. \n\nThis is something I feel OP's mum could do - try to include OP's spouse by catering to her dietary preferences instead of being so caught up in feeling offended. If she doesn't want to do that then it's on her, I don't see why she should be entitled to taking offence. OP, it seems like you want your spouse to ignore her needs and pretend to like the food, without expecting any effort from you mother. For that I would have to say YTA.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "I absolutely LOVE your love of people.  When I went off to college, I experienced so much stress that it almost killed be.  My stomach was a mess.  What resulted were new food sensitivities, including to onions.  My mom, being Asian, cooked everything with onions.  For years afterwards, no matter what holiday it was that my mom hosted, she would continue to put onions in everything.  Being a college student, I still technically lived at home and would be there before these get together, reminding her as she cooked about my new sensitivity, thinking I just needed one or two items i could  eat. (For those wondering, if I ate onion, I would just throw up.  Didn’t matter how small, cooked or raw.  Nothing would stay down.).  Then we’d all sit down with all the family all passing around the dishes and everything still had onions.  When others noticed and asked, she’d just say “I forgot.”   It wasn’t until my uncle came down with a similar sensitivity that she started separation a bowl of whatever she was making and then adding onion as the final step in preparation.  So there was a Lorri and Uncle Paul option for a few big dishes.  We got there, but it took several years and several meals where I’d eat off the cheese platter or make myself a sandwich.  You are a true blessing to your nephew.  Never underestimate a gesture that tells a child (no matter how young or old) that they matter.  Receiving the opposite message throughout your childhood can be brutal on a spirit.",
              "id": 49,
              "comments": [
                {
                  "score": 16,
                  "content": "I'm so glad your family eventually came around. A friend of mine has an onion insensitivity and it took her a long time to get anyone (even her doctor) to recognize it was a real problem.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I worked with a woman with diabetes.  When we traveled together and had to eat out, I would often have to ask if things came with or without onions.  When I shared, I would tell the waiter I was “allergic.”   She would roll her eyes and finally asked why I go into detail.  Why can’t I just not state I didn’t want onions?  Her argument was that when she asked for sugar free, she never went into the fact she was diabetic.  I shared that I thought if I didn’t tell them about my allergy, they’d not know to take it seriously.  But she made me doubt myself and didn’t want to be dramatic or attention seeking, which she implied.  So the next evening we all went out again to eat (business trip was several days long), I asked the waiter if something I wanted had onions. He checked with the cook and told me no so I ordered it.  A few bites in, my stomach started to churn.  I ended up in the bathroom throwing up.  When I came back and checked again with the waiter, he admitted there were onions in the dish but said the cook said “she won’t taste the onion.”  Yeesh.  I then only ordered things with less ambiguity or asked and told them simply that I was allergic.  Never had a restaurant try to slip me onions ever again.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "vegan daughter.  \n\nWife boils a giant pot of cubed potatoes for mashed potatoes.  Pulls like 30% aside to be vegan uses Miyoko's vegan butter (made with cashews and amazing) and then a good oat milk instead of Milk.  I am actually where I prefer the vegan mashed to dairy version with butter and whole milk and it is super easy to do.  \n\nalso Foccacia is super easy to make vegan and at this point a thanksgiving tradition for us.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "When my vegan sister gave birth a few years ago, I had my own adventure of cooking without animal products for the first time in my life. I made her a ton of vegan freezer meals including stroganoff, smashed potatoes, and chocolate chip cookie dough balls (so she could pull out and bake as many pre-portioned balls of dough as she wanted and have freshly baked cookies at any time).\n\nI personally find it to be a really fun challenge to cook for people with different dietary requirements than I would normally do! You sound like an amazing auntie :)",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "My sons fiancé and nephews GF are both vegetarian/vegan.  My son eats that way too 99% of the time unless he comes home by himself.  I too have made sure that I bring dishes they like/can eat since no one else in the family is veggie peeps.  Not to hard to change recipes, plus I really don’t eat a ton of meat- but I must insist to not take away my dairy. 😂 I have a goat cheese addiction.",
              "id": 54,
              "comments": [
                {
                  "score": 14,
                  "content": "I was surprised how many options there are to adapt recipes. It really means just more mixing bowls and I use little foil trays inside the main dish to vegan portions.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I love you. Now, that’s how you host family for the holidays!!!",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Try infused olive oils next time! We started out with garlic and butter flavored when we needed a new bottle of EVOO, and now we have so many more.\n\nEdit to add we are not vegan, we just like the added flavor without all the extra calories! 🙂",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Perfect host right here! I feel like Thanksgiving is all about the sides anyway - so many are naturally vegetarian and we make several unintentional vegan dishes despite being through-and-through omnivores.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2660,
          "content": "My step-dad (RIP Andy!) was hand waving Italian Catholic, came to the US when he was six. Upheld all the traditions but he LOVED the feast of the 7 fishes. He worked on that meal from planning to execution more than he worked on Christmas dinner and he always had a couple extra non-fish offerings because \"not everyone can do the fishes, y'know?\" He'd have loved your 7 fishes and a chicken. <3",
          "id": 59,
          "comments": [
            {
              "score": 872,
              "content": "Andy was a real one. Requiescat in pace, papá.",
              "id": 60,
              "comments": [
                {
                  "score": 459,
                  "content": "Requiescat in pisce.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 19,
                      "content": "This comment turned me into [Robert Redford](https://tenor.com/z8SP.gif).",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "Call me crazy, but I’ve never heard of the feast of 7 fishes. 🤔 Can someone explain please?",
              "id": 63,
              "comments": [
                {
                  "score": 283,
                  "content": "It's an Italian-American tradition of having a lot of sea food dishes (traditionally seven, hence the name) usually on Christmas Eve. I only really know about it because I grew up in an area with a lot of Italian heritage.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Thanks! Good to know.\nAre there 7 specific traditional fish dishes that are made? Or just anything goes as long as there’s fish?",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Not the most religion anymore but I still proudly host the Feast of Seven Fishes every Christmas Eve.  Hands down my favorite ever.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I am from an Italian family and this is done to have a \"meatless\" meal prior to communion at midnight mass on Christmas Eve. In the Roman Catholic church, Christmas Eve is considered a vigil and Christmas Day is considered a feast day and meat is served. Some families do not strictly adhere to 7 dishes - some do more, some do less. All I know is as a kid, we would then go back to my Grandfather's house after mass for another meal (lasagna, fruit, nuts and pastry) but my sister and I could never stay awake and passed out on the couch near the tree.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "My sister in laws family is Ukrainian and they have lox and cream cheese and pickled herring on Christmas Eve along with borscht and perrogies (sp) and some thing that's kind of like a pudding. It's where I found my love for lox - the first time we went there when her and my brother were engaged.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1862,
          "content": "I was deemed the picky eater by my ex's family. They loved garlic and onions and every dish that wasn't a dessert had a ton of garlic and onions in it. I would get nauseated and headaches. My ex would get mad at me for not eating a lot if she cooked with a lot of garlic and onions. Like she would get very mean. \n\nTurns out I'm intolerant to both and they trigger migraines...\n\nA lot of the times a person is a picky eater for a valid reason. And a lot of the times if a person can't respect your diet they aren't good partners.",
          "id": 69,
          "comments": [
            {
              "score": 523,
              "content": "Exactly, this is why I asked the OP to describe “picky.”",
              "id": 70,
              "comments": [
                {
                  "score": 427,
                  "content": "Good call. \n\nI get called \"picky\" and it gets under my skin. I'm a very adventurous eater and constantly challenge myself with things I didn't like so much previously because taste buds change, acquired tastes etc. But I have an unusual sensitivity + am vegan so people often have no clue how to feed me. The funny part is that those who call me \"picky\" are always the non adventurous eaters that wouldn't eat a french fry if you call it vegan!\n\nI prefer the terms adventurous or non-adventerous eater vs picky, because people with dietary restrictions often get lumped in the latter, but it has no bearing on how someone actually approaches food.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 174,
                      "content": "Exactly this. My family makes fun of me for being “picky” because I have a list of food (really ingredients) that don’t agree with me/that I don’t like, but I’m a very adventurous diner and have never failed to find something I enjoy at any restaurant. Meanwhile, my Boomer father will disregard entire ethnicities of food that I’m pretty sure he’s never even tried.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "What a lot of people mean when they say \"You're so picky!\" is \"You don't like the same stuff I like.\"\n\nAs an aside, it truly drives me up the wall when people say they \"won't eat vegan food\". Like...really? You've never eaten apple slices with peanut butter? Corn chips and salsa? Some Oreos and a cup of black coffee? It's enough to make me wonder what they think vegan actually means, or if they're just assholes.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "I’m not vegan but am trying to move in that direction slowly so I like finding/making vegan substitutes, but my sister is “weirded out” by vegan food which baffles me. It’s like…. These are just cupcakes made with more oil instead of eggs, there’s nothing “weird” about it, but she won’t try them. I’m a very picky eater myself but actually find anything vegan a “safe” option because there’s no weird animal products that can seem questionable to my picky self.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "My MIL used to say I needed my tongue scraped - lol.  We didn’t always get along but she always made sure there was stuff I would eat when we were there - that’s family.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I used to think of myself as a picky eater. \n\nTurns out there’s a chemical in broccoli cultivars that people with a certain genetic allele taste as strongly bitter. And turns out that canned veggies are just terrible. I actually eat far more broadly than the family members who used to claim I was picky. \n\nSimilarly, we have a younger friend who was fairly picky with food, who would come over for dinner frequently. No onion, no peppers, few tomatoes… a long list of foods to avoid, mostly nutritious ones. \n\nTurned out she was fructose intolerant. \n\nLater, turned out that it was aggravated by celiac’s. \n\nPicky eaters do exist. But a lot of people who have been branded as such are actually reacting to something.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "It’s generally fairly easy to cook for vegans imo. There are so many recipes online. I’m not even vegetarian but I make vegan meals all the time just because I like them.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "In my experience, meat-eaters who call vegans picky tend to be some of the pickiest, most entitled eaters I’ve ever seen. \n\nI have no dietary restrictions whatsoever, and I still “incidentally” eat a lot of vegan/vegetarian food because just… there’s a shitton of delicious food in the world, and statistically a lot of it is just gonna be vegetarian/vegan. \n\nI have so many “carnivorous” friends, people who insist that a meal literally isn’t complete without meat, and honestly it just makes me feel bad for them.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Also, I'm adventurous *and picky*! I keep kosher, don't like several common vegetables, if my food is too fatty I will get sick (like a whole donut is going to make me queasy, it's not a lot of fat) and I can't cope with some textures. \n\nSince leaving home, I have discovered sushi (seaweed onigiri is amazing), curry and other Indian food (yum yum yum), Vietnamese food (pho is meh, hot and sour soup is the best)... I love to try new food, I just want to know *exactly* what's in it first and may well \"nope\" out if it's got something on the \"nope\" list.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "I am not picky. I am 49 years old and I know what I like and what I don’t like.  I will try new things on occasion.  But let me eat what I want",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "I love this question.\n\nPeople say my son is \"picky.\" I say he is selective and while annoying from a cooking standpoint I can't even complain. This kid will try almost anything, and it's a legitimate try. Just so very little crosses the threshold to \"like\"...\n\nIf OP's mom cooks the same dishes year in and out it's a safe bet his wife gave it a legitimate chance over the years.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "You're also allowed to just dislike food.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "I never liked onions as a child and would pick them out of foods. Turns out as an adult, onions give me diarrhea, so my body clearly can’t digest them. Took forever to get people to understand please leave the onions out cuz I don’t want to spend the next 10 hours in the bathroom.",
              "id": 83,
              "comments": [
                {
                  "score": 10,
                  "content": "Garlic and onion are a huge IBS trigger, a LOT of people's bodies have a hard time with them, so you're definitely not alone. \n\nTrust me, I'd absolutely love to slather everything in onion and garlic, but, as you said, spending the next day and a half not able to leave the bathroom just isn't that worth it",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yeah, my sister, after a year or so of elimination diets and all that fun shit, finally found out that the reason she'd usually felt at the very least bloated and gassy after most meals was due to wheat and onions. Though sometimes this meant actual pain, and days of it. It isn't an allergy either. \n\nWe live in the south. Do you know what is in 90% of what you eat here? Wheat and/or onions. So now on Thanksgiving, I make a small pan of dressing for her- use gluten free cornbread and no onion. I've also located a chicken brother that doesn't have onion (it's the Progresso, if you're interested. It just has carrots. The rest, Swanson, etc, all have onion). It's not really extra work since I'm making all that stuff anyway and it's worth her not spending the next two days in bed moaning because it hurts.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Oh wow.  I’m a migraine sufferer. Soy is a known trigger for me. But I didn’t realize my love of garlic and onions might need a closer examination.  Thanks for mentioning this!  It’s amazing the health info I pick up on the little side discussions on this sub.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "man for a minute I was so caughtup in the euphoria of Wholesome Family Cooks that i forgot this was a post about Intolerant Asshole Family Cooks",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My friend has an allium allergy as well and I swear it’s almost harder than any other allergy.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 679,
          "content": "My ex's family is Puerto Rican. Ham is basically a flavoring agent and in everything. I try not to eat beef or pork, so every time we came for dinner, she'd make something I could eat too. My family is Indian. My mom would do the same when she figured out what foods he liked.\n\nEdit: to add to this, my sister loves certain foods my mom makes. My BIL loves other ones, so my mom will make both when they come over, or drop off/freeze food for them if she makes it. Hell, she even drops off (and receives) food from my BIL's parents. They all do this bc it's food, it's meant to be shared and enjoyed, but mainly bc they're not AH.\n\nEdit again: thanks for the award! My ExH is an ex for many reasons but his parents were always good to me. They still send extra for me when they send my son home with Thanksgiving leftovers.",
          "id": 89,
          "comments": [
            {
              "score": 9,
              "content": "That's really lovely. I'm Latina, and my STBXH is Indian. Unfortunately, I wasn't able to share foods between families because my MIL was horrible. My family likes Indian food.\n\nI'm glad you were able to share that nice experience 😊",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 472,
          "content": "None of the grandkids eat fish, so my nonna always makes pasta and chicken parm along with the fish for us",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 256,
          "content": "My husbands family is Italian and does this, as well. I am allergic to shellfish and seafood, and there is not one single dish for me available. I end up bringing a vegetable lasagna or pesto tortellini (idk if meat is offensive on Christmas Eve lol), so I can eat something. We used to stop at McDonald’s on the way lol.",
          "id": 92,
          "comments": [
            {
              "score": 13,
              "content": "Me, too! As in allergic to anything that comes out of the water. It’s so awkward at times, but I kind of showed my ass when my coworkers voted to have our team lunches at Red Lobster 4 months in a row.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 237,
          "content": ">feast of the 7 fishes and a chicken\n\nhahahaha!",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "That’s sweet of her, also it is funny lol",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "JFC what kind of asshole tries to police what other people eat?  Is your mom really that egotistical that EVERYONE has to eat her food, no exceptions?  That's a ridiculous hill for her to die on, and YTA for allowing it and telling your wife to stay home from a FAMILY oriented holiday over something as dumb as your mothers inability to compromise.",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 33960,
      "content": "YTA for not standing up for your wife. \n\nShe's trying very hard to make holidays work with your family, but you only care about your Mommy's feelings. \n\nIf your mother is so thin skinned that she can't handle the idea that people have different dietary needs, she doesn't get to host parties.\n\nEdit: your update makes you absolutely the asshole. Hundreds of people are telling you that you need to support your wife and when you don't, you get angry that she's going to head to her family who does support her.\n\nMan, you are a terrible husband.",
      "id": 97,
      "comments": [
        {
          "score": 6165,
          "content": "Heck, I would be grateful that I don't have to figure out more stuff to add and cook and worry if it would be to their liking. It's supposed to be a family gathering, not eat whatever I cook gathering.",
          "id": 98,
          "comments": [
            {
              "score": 2082,
              "content": "Right?? Isn’t it easier for me to bring a dairy free dessert instead of me asking that you cook an extra dish to my specifications? It’s no work for the host",
              "id": 99,
              "comments": [
                {
                  "score": 341,
                  "content": "And I have my problem making simple adjustments to make it more inclusive, if I can too. For example, my son is allergic to cinnamon, nutmeg instead. Lactose intolerant, I can switch to LF milk in recipes. ((Can't afford LF cheese for an entire meal, probably would not be too hard to separate something out to leave out to change an ingredient!)",
                  "id": 100,
                  "comments": [
                    {
                      "score": 215,
                      "content": "Or using oil in lieu of butter to make it fully dairy free. Sometimes, I will bring vegan butter/DF margarine to a family members house who's cooking and wants to use some so I can eat what they're cooking. I always offer to cook stuff so it's not a bother, but half the time it's the stress of getting the right ingredients that people aren't allergic to.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4769,
          "content": "Yes, OP, your mother sounds like a nightmare. Can’t you just talk to her? “Hey Mom, you know that Wife is very peculiar about food. It’s not that she doesn’t like your food, it’s that she just doesn’t like some specific food. Do you mind if we bring her own dinner? That way we’ll avoid discussions like last time”. If she says no, I would skip Thanksgiving and enjoy alone time with the wife, instead of subjecting her to your rude family.\n\nWhatever, dude, I may be wrong, but you sound kinda like a momma’s boy that can’t stand up for your own wife. She’s your nuclear family now, not your nightmare mom.",
          "id": 102,
          "comments": [
            {
              "score": 921,
              "content": ">But whatever, dude, I may be wrong, but you sound kinda like a momma’s boy that can’t stand up for your own wife. She’s your nuclear family now, not your nightmare mom.\n\nAbsolutely. Its clear where OP's priorities lie and it ain't with the wife.",
              "id": 103,
              "comments": [
                {
                  "score": 708,
                  "content": "Completely agree.\n\n> I told her again that mom might not like *nor even allow this*.\n\nThis dude has the emotional maturity of an 8 year old.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 95,
                      "content": "OMG.  I commented before I read any of these just to stay neutral, but “allow” this!\nNot only is this guy an AH but a major AH.  Does he need mommy’s permission for everything he does?  How did he get married!",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "But will not ask. She might be fine. Or neutral, less cooking probably less arguments.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 730,
              "content": "This is the best answer. YTA.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 729,
              "content": ">If she says no, I would skip Thanksgiving and enjoy alone time with the wife,\n\nThis is the answer.",
              "id": 108,
              "comments": [
                {
                  "score": 20,
                  "content": "Nah much better to tell the silly disobedient wife to \"calm down\" so that mummy isn't offended ;)",
                  "id": 109,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Telling someone upset to calm down has never once in the history of our species worked. It’s one of the rare purely 100% asshole moves.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 530,
              "content": "Exactly! I once invited my 2 veggie friends to my parents house for lunch they offered to bring their own food. My mum refused. When we got there she had gone ALL out. Every dish was homemade, veggie and beautiful. My friends nearly cried at the effort. They were used to being an after thought of just a frozen Veggie pizza being slapped in front of them. \n\nOPs wife is making the perfect compromise imo, doesn't put extra effort on the hostess for a very big meal with lots of dishes. Though I think it'd be nice of the mum to at least make one dish his wife can eat. Maybe switch out for one of the others so as not to make extra work for her.",
              "id": 111,
              "comments": [
                {
                  "score": 28,
                  "content": "Wow that is so so sweet of your mum! I'm a vegetarian and I always offer to bring my own stuff (like for a bbq) and I really don't mind doing that. People don't know what to get me and I've tried a lot of meat substitutes, so I know what I like. But I'm always super grateful and appreciate the effort so much when people offer stuff I can also eat :) if there's at least a few veggie side dishes (like not throwing bacon into everything), that's great, but some actual mains, that's so lovely!",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "When I have vegetarians coming to dinner I make an Indian potato and cauliflower dish with mustard seeds coriander and turmeric. There’s none left at the end of the meal, no meat eater had shunned it.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I'm a meat eater, but there are so many delicious Veggie meals. I have no idea why so many meat eaters refuse to eat a dish if it doesn't contain any meat. Also, 2nd the recipe request cos that sounds DELICIOUS.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 299,
              "content": "I thought he was TA before, but his edit with the \"y'all happy now?\" is so needlessly aggressive now I have no doubt. I don't really give a crap what her dietary preferences are, even if she will only eat chicken nuggets and fries, she offered to bring food for herself so she's not putting anyone out with the expectation of making special dishes just for her.\n\nHonestly I hope OP's wife decides to make her visit to her parents' place a permanent one.",
              "id": 115,
              "comments": [
                {
                  "score": 14,
                  "content": "We all do. \n♥️♥️♥️",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Makes me think he has the issue and he’s blaming his mom.",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 104,
              "content": "His mom does sound like a nightmare.  However, let’s remember that we are only hearing this story from OP’s perspective.  For all we know his mom could give less of a shit. OP could just be making assumptions based on his own insecurity that people are going to judge his wife, and by extension, him.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "That’s what I was thinking! I can’t imagine my mother having an issue with this. Hell! My mom found out that even though my boyfriend loves all desserts, cheesecake is his favorite so she makes a whole cheesecake every holiday now so he can have his favorite and take home leftovers. I don’t like celery and my mom noticed me eating around it in the thanksgiving stuffing years ago so she sets aside some of the stuffing for me and then adds the celery to the rest. We’ve never asked her to do those things. She just wants everyone to enjoy everything as much as possible. Why wouldn’t OP’s mom want to prioritize everyone e being together and happy?",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "What I’m getting from the post is, that OP didn’t even ask his mum, just said no immediately! That makes it even worse! Maybe mum would have said yes, we will never know…\n\nRegardless, OP YTA",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "So much this. I come from a very very large family and none of us would bat an eye that anyone stopped to pick something up that they could or would eat. More for us and to take home lol. \n\nAlso couldn’t imagine my spouse not sticking up for that and just being like, “oh stay home then” and then being upset she’s decided to go visit HER family.\n\nDafuq.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "The bit that really stuck out to me -\n\n> Mom wouldn’t like it *or even allow it*\n\nY’all are adults now, there’s no longer any such thing as “Mom won’t allow it”.\n\nLPT for cis-dudes: male-attracted women want a husband who *respects* his mother, not one whose mommy still controls him.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1346,
          "content": "Definitely YTA why is your mommy’s feelings more important than having your wife with you at thanksgiving? Your wife offered a completely acceptable solution and you picked a fight with her and the kept telling her to “calm down” (because that always works when you act like a jack a**) \n\nI have several food allergies/ sensitivity and I don’t give a rats a** who is offended when I bring my own food to their function maybe you need to just grow up and tell your mom that your wife is going to be bringing her own stuff to eat and if she gets upset then both of you can stay home.",
          "id": 123,
          "comments": [
            {
              "score": 217,
              "content": "\"calm down\" is a huge trigger for me, and guaranteed I will escalate like crazy!",
              "id": 124,
              "comments": [
                {
                  "score": 40,
                  "content": "That's exactly why people say that, in order to push your button and make you look like the one who's being irrational. Remember this the next time you get told 'calm down'.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "I feel the same. Bring her own plate. Let momma know in advance to diffuse the ol’ lady. (I really don’t get why she’d be offended in the first place). Not necessary but later your wife could slip in taster portions separate from the main deal in case others are curious and make it a fun thing.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1018,
          "content": "Exactly. I get being annoyed by picky eaters like this… but the wife tried to come up with a whole solution for her own needs that truly don’t hurt anyone else.  \n\nShe COULD have made a big deal about how MIL refused to try to compromise and ensure she makes some foods that wife likes… but no, she simply plans to make her own food to not inconvenience anyone. \n\nYet this is SIMPLY still not enough because god forbid mommy’s feelings get hurt. Where is the wife’s feelings considered in any of this?!",
          "id": 127,
          "comments": [
            {
              "score": 429,
              "content": "Can you imagine being so controlling & cruel that you actually derive pleasure from forcing someone else to put something into their body that they don’t want to?  Just so you could know they forced it into themselves even though they hated it?",
              "id": 128,
              "comments": [
                {
                  "score": 12,
                  "content": "Also-maybe the mom is just a shitty cook who no one dares to tell her. I have a few moms in my family that think their food is the second coming of manna from heaven and I'm like \"dude your tuna casserole with hot mayo and noodles with the consistency of jello is just not my jam.\"",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "i dont see why everyone gets so annoyed by picky eaters, do they not have the same choice as you to what they want to put in their mouths? especially if they are willing to bring food for themselves and not trouble anyone else by their decision of what they want to eat/dont eat.",
              "id": 130,
              "comments": [
                {
                  "score": 16,
                  "content": "Same. As a child, I had a limited range of foods I liked and lots I hated. At home I had to try everything, even if we already knew I hated it. At extended family meals, I was allowed to eat only what I wanted, which was great. It seems to me that insisting someone eat things to don’t want to eat—for whatever reason—is simply wrong and rude. OP’s mom shouldn’t make a big deal over OP’s wife “being picky.” I’m still a picky eater and if it bothers people, that’s their problem not mine. \n\nOP is YTA.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I'm a picky eater, but I never ask for people to make compromises for me. I'm perfectly happy with my plateful of potato. Most people can't hack that though and start offering all kinds of alternatives. \n\nI'm sure OP's wife would be happy to eat what she can and skip the rest or bring her own meal. It sounds like MIL is the one causing the problems.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 532,
          "content": "He didn’t even stand up for his wife! He just assumed his mom wouldn’t allow it; he didn’t actually bother asking which is even worse",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 444,
          "content": "I love how he told her to \"calm down\" after she was making a reasonable compromise. \n\nYou know, cuz everyone loooooves being told to calm down so one can make mommy happy instead.",
          "id": 134,
          "comments": [
            {
              "score": 29,
              "content": "Telling me to calm down is a sure fire way to get me not to calm down, it will be worse for both of us. 😆😂",
              "id": 135,
              "comments": [
                {
                  "score": 14,
                  "content": "LOL. I will see RED!",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "**Repeatedly**",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "Omg. OPs edit. \n\nNow he’s mad she’s going to visit her family and ‘basically ditch me for a whole week’ after he already told her he’d ‘ditch her’ rather than accept a perfectly fine compromise. \n\nHe’s definitely TA.",
          "id": 138,
          "comments": [
            {
              "score": 28,
              "content": "And his \"are y'all happy now?\" Part of the edit. I'd be a lot happier if his wife didn't come back to him. He sounds like a miserable person to be around",
              "id": 139,
              "comments": [
                {
                  "score": 13,
                  "content": "The part that got me was him griping about \"unnecessary travel.\" Like OP made sure his wife wasn't welcome at his family's, but is mad she's going to travel instead of stay home and mope or suck it up and go to his family.",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "he’s too much of a coward to respond to any comments too lmao such a loser",
                  "id": 141,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "[deleted]",
          "id": 142,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "I find it alarming that her going to see her family is seen as a ways of money in his opinion.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "He was already TA, but wow his update is another level of being an A. He “punished” his wife by telling her that she was not invited to his family’s thanksgiving dinner and tells her to stay home, and then gets mad when she decides not to stay alone by herself in their home and instead goes to spend thanksgiving with her family… Op is a crazy controlling lunatic.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16335,
      "content": "Lol. So let me recap:\n\n* She came up with a solution to endure the hell that is being around your mother.\n* You told her you were too scared of mommy to even allow your wife to suggest finding a solution. (Gosh! Mommy is so scary!)\n* When she told you you were insensitive to her legitimate problem, you told her to *calm down.* (Ugh. Women, right?!)\n\nCome on, dude. You should be thankful  your wife isn't picky about the men she marries. YTA.",
      "id": 145,
      "comments": [
        {
          "score": 4684,
          "content": "That last sentence made me spit out my coffee 😂 OP YTA.",
          "id": 146,
          "comments": [
            {
              "score": 762,
              "content": "Oh no I'm so sorry commenter but this award was went to the wrong comment. I'm so sorry, I hope you enjoy it though! Take it and go. :p",
              "id": 147,
              "comments": [
                {
                  "score": 830,
                  "content": "I was a bit curious why I'd recieve an award for that comment 😂 thank you, I will cherish it ❤️\n\nEta: thank you all for your sweet and funny comments and awards. I'm glad I could make some of you laugh and I too love my username 😄❤️",
                  "id": 148,
                  "comments": [
                    {
                      "score": 48,
                      "content": "A name like \"nipple_fiesta\" deserves an award.  😄",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "Take my freebie as well for being such a good sport and copping the mis-award like a champ!",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 36,
                      "content": "If I had one I’d give you an award for your name. it makes me giggle like a 12yo.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "You’re worth all the awards, keep being you ❤️",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Thankfully I swallowed mine before finishing.  Thanking OPs mom should have swallowed too...",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1178,
          "content": "REPEATEDLY  told her to calm down. Repeatedly. Damn.",
          "id": 154,
          "comments": [
            {
              "score": 655,
              "content": "I *hate* this! The person who says it usually includes: “I’m the logical one, I was patient, I politely….”\n\nAnd the other person is usually “dramatic, overly-emotional, or irrational.”",
              "id": 155,
              "comments": [
                {
                  "score": 449,
                  "content": "The way that men gaslight women into think that unchecked aggression ISN'T an emotional response and continue claiming they're the \"logical\" one",
                  "id": 156,
                  "comments": [
                    {
                      "score": 87,
                      "content": "I know!! Women are so emotional, while they lose their temper and smash shit up. Anger is an emotion and giving into it is being emotional",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 35,
                      "content": "I read a thread before, where a woman at work was dealing with misogynistic guys who kept saying she was getting \"emotional\" when she was legitimately frustrated about things, but would also get randomly really angry when told they were doing something wrong. So she started giving them a taste of their own medicine and refusing to deal with them saying, \"Ugh, I just can't deal with you when you're so emotional\" every time and it actually worked after they tried to complain about her doing it and she explained to HR that if they can say it about her emotions why can't she say it about theirs.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Update made me even angrier ugh\n\nOP; \"Stay home for thanksgiving then!\"\nWife; *makes other arrangements*\nOP; \"THATS EXPENSIVE HOW DARE YOU\"\n\nThe audacity",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "Ah yes. Men. So rational, so logical and unemotional. Who the fuck managed to get everyone to think ANGER isn't an emotion?",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 35,
                  "content": "The only time the \"calm down\" needs to be used is when both parties are getting heated and emotional and someone goes \"let's stick a pin in this, we need to calm down before one of us hurts the other without even meaning to. Let's pick this back up when we're both ready.\"",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "It has been my experience that anyone who claims to be the “logical” one is actually completely illogical and very emotional. They just don’t realize it because they are so out of touch with their feelings they can’t properly identify them.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 164,
              "content": "That line made me so angry",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Like in hundreds and thousands of years past, when has saying that to someone ever worked? They just get more angry. I would've asked for a divorce after that. I have a feeling he puts mommy dearest above all in everything and there are multiple stories of him not defending his wife and defending him. Jfc cut the umbilical cord already.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 939,
          "content": "You missed one: He suggested she just try mom's food, which means he has no idea what his wife's food issues are.",
          "id": 165,
          "comments": [
            {
              "score": 672,
              "content": "She knows she doesn’t like certain foods, and he’s convinced it’s because she hasn’t tried his mothers cooking OF those certain foods. It’s like the amount of people who tell me I would like beets if I just tried THEIR beet recipe. No, I will not. Beets taste like dirt and I will never like them.",
              "id": 166,
              "comments": [
                {
                  "score": 398,
                  "content": "Or how men tell lesbian women they are lesbian bc “they haven’t tried theirs”.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yikes",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "As someone who likes beets, I agree they taste like dirt. However if you prepare them well they taste like nice flavored dirt. It’s really an acquired taste. I learned to love them in prison because I was starving and it was one of the only good healthy vegetables we got.",
                  "id": 169,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Now I’m wondering how my grandmother managed to get me to eat my vegetables without a struggle bc I loved beets as a kid. I don’t think she even did anything special to them, they were just canned beets (and I don’t really even like canned foods) 😂",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "People say the same thing to me about fish.\n\nI still always try it because who knows, I might like this one recipe.. but I always make sure to tell the person who made it “I don’t like fish. I’ll try it, but please don’t be offended if I don’t finish it.”\n\nBut I understand people who won’t even try things they know they don’t like. Like I can’t even try lobster bc I gag at even the smell",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Just like coriander/cilantro tastes like soap to some people.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Yes! I don’t want my pizza tasting like pepperoni and Dawn!",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "> It’s like the amount of people who tell me I would like beets if I just tried THEIR beet recipe.\n\n**THANK YOU!!!**  And can we add liver to that quote because people have told me that I haven't tried theirs.  Look, I had a beagle when we were children and \"HE\" wouldn't eat it neither, so his rejection proved that I was right.  My no go list: beets, liver and okra (it feels slimy going down my throat as I swallow).",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I will never like Green Bean Casserole, especially not with the breaded onion on it. It looks exactly like tons of snot that I've pulled out of my nose. -10/10",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I didn't like spinach-mom used to feed me the metallic spinach out of a can.  Then later, when I was an adult trying to lose weight, I was trying a variety of healthy foods because I realized, to lose weight, I might have to suck it up and try things I thought I didn't like.  I tried raw, uncooked spinach, and love it.  I didn't like avocados either, but discovered that prepped right-with a little lime, salt, and pepper, they're delicious.  So people aren't necessarily wrong in that it can be how it's prepped.  They shouldn't force you to try it, though.  That decision is yours.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 8,
                      "content": "DUDE! For real, raw spinach. Who knew that all you had to do was NOT cook it for it to stop being a bitter, sticky-teeth mess? I couldn’t believe how perfectly fine raw spinach tasted. Why do people do it? It’s like cooking an apple. Just… why?",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I can't do the texture of mushrooms, I love the taste but can't eat them unless they're minced up or thinly cut and on the very top of a pizza where they get obliterated by the heat. If I'm offered a dish with mushrooms I'm not going to be able to eat it, and if I force myself to I may throw up. There is no trying them again for me, I've tried several times.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "This is absolutely hilarious! And more importantly 100% correct!",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Don’t forget to edit in that despite trying to abandon her for Thanksgiving, he’s crying that she’s spending it with her family and feeling abandoned. If only irony was a glass to sip from.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "When I read the part where he told her to calm down it just infuriated me. If he had any common sense at all, he would know that phrase amps people up 100% of the time. If someone tells me to calm down. I'm ready to throw down. OP, YTA as is your mom. Your mom's a grown woman. Quit coddling her and stand up for your wife that is trying to find a compromise. She married you, not your mom. Don't be surprised when she divorces both of you. It's natural for people to bring a dish or more to a Thanksgiving meal. It sounds like your mom should not be in charge of hosting because she is so controlling and an asshole.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Loved that last bit hahaha 🤣",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Don't forget he said he mommy might not even ALLOW an adult woman to eat her own food.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "AHAHAHAHAHAHAHA your ending!!!! 10/10",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "\" You should be thankful your wife isn't picky about the men she marries.\" \n\nIt wouldn't surprise me if OP's wife becomes picky about who she is married to soon. YTA",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13425,
      "content": "[removed]",
      "id": 186,
      "comments": [
        {
          "score": 2679,
          "content": "ikr all he cares about is his mom here!!!!",
          "id": 187,
          "comments": [
            {
              "score": 6777,
              "content": "Men who get married, but still put their Mommies first should do the world a favor and leave innocent women out of their enmeshment.",
              "id": 188,
              "comments": [
                {
                  "score": 2949,
                  "content": "But how else are they going to give mommy the grandchildren that she requested if not finding an incubator?\n\nAnd what woman wouldn't be honoured to marry them and carry their mommy's grandchildren? They're such a handsome boy and a great catch. Mommy says so.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 892,
                      "content": "LOL!!!!\n\nExcept if they are my late MIL who did not want grandchildren because \n\n1) Meant that their children were having sex \n\n2) Took her children's attention away from her",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Laughing so hard at this XD",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 453,
                  "content": "Lol my SO LOVES his mom and I also like her very much. It still has taken some reprogramming in teaching him mom doesn’t always get her way (and she’s so cool she usually has to tell him “listen to HER.”). \n\nWe talked about when we have kids and I mentioned the when I give birth I just want him and my mom in the room. He said his mom gets to be in the room too. I told him the long list of why woman pushing baby out gets preference (turns out his mom would NEVER WANT TO BE IN THE ROOM IN THE FIRST PLACE). They live in a small town and I mentioned when we have a kid I want to stay at a hotel when we stay over because they smoke in the house. He said it was nonsense. I had to explain that while I was okay with smoke in a house, a little kid should not have to be subjected to not being able to breathe (turns out his mom agreed with me!!)\n\nI am very lucky his mom and I get along and she takes my concerns and tells him off when he’s thinking about mom. I mean, he sees/talks to her maybe a total of a week out of the year. Him and I are together all but probably 10 days of the year - why do some dudes NOT see this?",
                  "id": 192,
                  "comments": [
                    {
                      "score": 426,
                      "content": "Divorce him and marry his mom",
                      "id": 193,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 142,
                      "content": "You are so lucky that your MIL is reasonable! My late MIL was not - which is where 75% of our problems came from. Husband was raised to try to make his mother happy. I was raised by wolves, so there was an immediate conflict.",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Yeah but mommy won’t blow them.",
                  "id": 195,
                  "comments": [
                    {
                      "score": 18,
                      "content": "So glad I did not take that sip of hot chocolate before I read your reply. ;)",
                      "id": 196,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "[deleted]",
                  "id": 197,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Look at the update too. He still doesn't get it and had to put in \"Y'all happy now?\" He's blaming redditers rather than look at himself. Holy crap that's unhinged.\n\nYTA OP",
              "id": 198,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 466,
          "content": "The update is sending me 🤣 \"My wife offered a compromise, and I told her my mommy will be offended, so now she's decided to spend the holiday with HER family and LEAVE ME! Are y'all happy?!\"\n\nLike damn, when do her feelings get to factor in?",
          "id": 199,
          "comments": [
            {
              "score": 222,
              "content": "I *know* the update just makes it *worse* doesn't it? \"She's doing it out of spite!\" No dude, she's doing it because you massively hurt her feelings, repeatedly, for years and she feels disrespected, unloved, and like she does not matter in this marriage. Because she *doesn't*. Someone's *perceived* rudeness, by *their* standards, does not outweigh bodily autonomy. To me, it's rude to force someone to eat something they don't want to or starve",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "> Are y'all happy?!\n\nDelighted for her, tbh.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Right? The update made it seem like IP was blaming us.  \n\nMomma’s boy who physically incapable of taking responsibilities.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6755,
      "content": "INFO:  Has your mother ever attempted to accommodate your wife's food issues?  Are there typically any dishes that work for your wife?\n\nEdited in response to OP update:  YTA.  Considering the unwillingness to answer questions here, I'm going to guess there hasn't been a lot of discussion with your wife in which you were open to options.  Saying she does not have allergies does not preclude sensitivities, intolerances, or bad past experiences with food.  Both the obligation to adapt (reasonably) to guests as a measure of hospitality and the acceptability of taking food to an event vary by both culture and individual family in American culture.  There's not one hard and fast rule for it.",
      "id": 203,
      "comments": [
        {
          "score": 3030,
          "content": "This is what I’m curious of too. I have an *extremely picky* MIL and I cook a huge Thanksgiving meal every year. I always make her 1-2 dishes with absolutely no spice and no seasoning that she can happily eat (but no one else wants.) \n\nIt’s annoying but it’s what you do for family.",
          "id": 204,
          "comments": [
            {
              "score": 1254,
              "content": "This. It's like people have forgotten the Hosting party's responsibility is to make their guests feel welcome and comfortable. Guests are supposed to be polite and grateful. That doesn't mean suffering food they dislike. It means politely declining. Somebody not liking food is not an insult. It would be like expecting everyone in a room to like the same music/sports team/etc...",
              "id": 205,
              "comments": [
                {
                  "score": 373,
                  "content": "Same line as one of my comments. If you don’t try to accommodate your guests that makes you a shitty host. The first year I get it but once I know guests don’t like certain things I would try to find a dish or two that they WILL eat. The fact of this going on multiple years means the mom refuses to make any other dishes.",
                  "id": 206,
                  "comments": [
                    {
                      "score": 152,
                      "content": "Yup, the refusal to accommodate gives me big bad host flags.  I cannot imagine anyone in my family condoning meal preparations that a guest can’t eat at all.  Depending on the needs of the guest you might not be able to provide as fine a feast but you should do your best to ensure something suitable is available.  If that’s not possible, allow the guest to bring or prepare their own food.  (Such as detailed dietary restrictions that an inexperienced chef is unlikely to manage effectively.)\n\nAlso, as a long time “picky eater*” I was always taught that as long as I say no thank you politely and accept that everything won’t be to my taste/I might need to find food elsewhere, my manners are appropriate.  Food is not a punishment.\n\n*as many people here are noting, “picky eater” often means that yes, some things we just don’t like but plenty of other things are avoided because eating them causes unpleasant consequences.  Even if it’s not a full allergy, why would I want to eat something I dislike just to have a stomachache the rest of the evening?  For that matter, what kind of host would want to inflict that on me?",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Seriously! Ask your DIL what she likes, crazy MIL, and *make that for her so she knows you welcome her into your fucking family*.\n\nWhy is this so hard for some people???",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Since OP hasn't answered anything, I'm going with intuition and wondering if she's really a picky eater or if she's just vegetarian. It also sounds like one of those \"mom has to host the holidays\" and \"demands everything be the way she wants.\"",
                      "id": 209,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Heh, great point but I've seen so many posts on different sites that declares that guests must stuff whatever is served them down their gullet no matter how much they hate it. And do so with a smile. Politely declining is not an option.",
                  "id": 210,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I've seen it a fair bit too. And it frustrates me to no end. People wonder why nobody likes their mother in laws...\n\n(My MIL is great. She made a Ham because she knows I loathe turkey. So I have Ham. My wife has taken over Thanksgiving now and we make a ton of accomodations for allergies and taste. Including a Ham. )",
                      "id": 211,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Plus, I bet even if OP’s wife declined politely, MIL is likely one of those people that won’t accept no and just repeatedly hounds OP’s wife about eating it.",
                  "id": 212,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Yeah. For example, I hate sweet potatoes, a common Thanksgiving food. Me not wanting to eat your sweet potato casserole is not a personal insult against your cooking!",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 440,
              "content": "My MiL wavers between vegan and vegetarian. My SiL is severely celiac. Our housemate (husband's cousin) is sometimes vegan and sometimes not. My FiL is very much on the spectrum and has food/spice aversions. I host Thanksgiving and manage to have enough food that everyone can eat. It takes planning, but when I host a holiday meal, I want all my guests to be included and know I took their needs or preferences into account.",
              "id": 214,
              "comments": [
                {
                  "score": 46,
                  "content": "This. Our family ranges from full on carnivore to poultry-only to vegetarian and then doubles down with spice-intolerance and diabetes.  We've figured out how to make weekly family nights work.  Seems like it would be a lot easier to make ONE food-loaded day work for everyone.",
                  "id": 215,
                  "comments": [
                    {
                      "score": 11,
                      "content": "My grandfather was allergic to red meat and soy, diabetic, and had heart conditions (low sugar and low sodium diet). My MIL was (at the time) vegan and gluten-free. I still managed to bring 2 dishes to the holiday meal that both could eat.",
                      "id": 216,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 192,
              "content": "You are so kind. I gave up dairy (doctors suggestion for an auto-immune issue) that Thanksgiving my MIL added heavy cream to absolutely everything except the jellied cranberry sauce & the turkey. So that’s what I ate. Her doctor recently recommended she go both gluten free & dairy free so Thanksgiving should be interesting this year.",
              "id": 217,
              "comments": [
                {
                  "score": 110,
                  "content": "That sounds like a deliberate attack on you.",
                  "id": 218,
                  "comments": [
                    {
                      "score": 145,
                      "content": "It was but after 17 years of marriage, I am used to her passive aggressive BS. Thankfully my husband is amazing & tells her off every time. This year is our first Thanksgiving in 3 years so fingers crossed it goes well",
                      "id": 219,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Yup. I'm also a very picky eater with quite a few dietary restrictions, and one year Christmas was held at my aunt's house. She made some Kraft mac and cheese just for me because I couldn't eat anything else besides the bread rolls. It was extremely sweet of her.\n\nFor Thanksgiving, I always bring a dish (we do a potluck thing) so I know I have something to eat.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My mom doesnt like poultry, so we make a whole ham in addition to turkey at Thanksgiving. It's just the right thing to do to ensure everyone can eat.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 438,
          "content": "Thank you for this info request. It feels like there’s more here to the issue. When I read it, I thought, why wouldn’t the mother make at least ONE thing she knows the wife will like? Then I thought, why wouldn’t the wife just bring a dish she likes that everyone can share too? Like it feels like there’s some power struggle backstory we’re missing key info to. If I purely read it from OP’s poor mommy description, my first instinct is to say OP is the AH but this one feels like we’re missing some background here on how, and if, anyone tried to be accommodating in the past.\n\nETA: Op, YTA. That pissy update was all the info we needed.",
          "id": 222,
          "comments": [
            {
              "score": 136,
              "content": "Given OP’s edit/update, I’d say the info we were missing was that OP is an unreasonable, immature, self absorbed a-hole.",
              "id": 223,
              "comments": [
                {
                  "score": 22,
                  "content": "Agreed. Like holy fuck over reaction to being told he's wrong.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": " Couldn’t have said it better myself!",
                  "id": 225,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Did you notice how her traveling to see her own family is \"unnecessary travel?\"",
                  "id": 226,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I totally agree and thought all of this!",
              "id": 227,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "<<why wouldn’t the wife just bring a dish she likes that everyone can share too?>>\n\n>I don't think the wife would be unwilling to bring something everyone would share--but she's been told that only Mommy can cook the food for the family--so I think she already took that into account with her offer.  *\"I'll make my food so I have something to eat and everyone will be happy with your Mommy's food.\"*  \n>  \n>I realize that it's not specifically said, but I think it's a reasonable conclusion that if she's willing to make a whole meal for herself, she'd be willing to make an upsize for at least one of them.",
              "id": 228,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "This was my thoughts. I’m a picky eater too with sensory issues, but I can usually make most things work. It depends on the situation if MIL was expecting her to sample everything or if she planned dishes she knew his wife did not like.\n\nPart of being a host is trying to accommodate everyone’s needs as much as possible. Like we saw in another post, it would be rude to demand MIL to make a separate meal or entree when cooking that holiday is stressful enough, but she should be considering sides and dishes that everyone can eat most of. I wouldn’t do a main dish that people loathed unless I had another option or if the person who loathed it offered to bring something else.\n\nI’m sure part of this dialog is feeling like their food isn’t good enough for wife…and they interpret it as making a scene with something else instead of interpreting it as being gracious and that you didn’t want to inconvenience the host with additional dishes. I think it really comes down to interpretation based on other feelings. If you think the best in someone, it wouldn’t be interpreted as negatively.\n\nI think the best option (IMO), is wife eating her meal on the way there….then taking little servings of what she can tolerate. If they hassle her over her quantity or lack of variety, then it’s on OP to defend and shut it down.\n\nI get a little anxious over other family’s dinners that I’m not going to like enough or come across rude to the host if I don’t eat enough. It sounds like there needs to be a little bit of compromise from OP without forcing her to eat something she doesn’t like.",
          "id": 229,
          "comments": [
            {
              "score": 19,
              "content": "Honestly, i think it's pretty silly to expect her to eat her food in the car. Sometimes people have different food needs, it's fine.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I have a family of extremely picky eaters including food intolerances and vegans. I make sure there is sufficient variety so that everyone gets fed.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I really hope OP answers this. I love hosting family gatherings and make the effort to cater to everyone’s dietary restrictions and preferences, which at the end of the day really isn’t all that much work. It sounds to me like MIL has zero consideration for OP’s wife, and he’s a serious momma’s boy.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "This is exactly what I came here to ask!! Mom seems to make a feast - has she ever tried to accommodate what wife might like?",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Right! If she’s gone hungry in past years, I would say not.\n\nI have the opposite situation — my fiancé’s family are all extremely picky eaters, so there are certain traditional Thanksgiving foods they won’t touch (e.g. sweet potato casserole, which is my favorite). It used to bother me, but now I get it; my SIL has struggled so much with food for her entire life that even the smell of some food makes her gag, and she can’t help it. \n\nNow I just make my own lil’ dish of sweet potatoes and bring it with me when we do holidays with them, and everyone’s cool ¯\\_(ツ)_/¯ \n\nI hope that OP’s wife gets to have a full and happy meal for Thanksgiving with people who actually care about her. YTA",
          "id": 234,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6457,
      "content": "YTA. Your wife is doing exactly what those with food allergies do. Bring their own food. There is nothing wrong with that, at all. Your mom needs to not be so easily offended by your wife's food preferences.",
      "id": 235,
      "comments": [
        {
          "score": 1174,
          "content": "I second this. I have diabetes and often have to bring something to events or dinners and stuff because there's so much I can't have. It affects my mental health as well so it would ruin everything and people are like \"oh you can have a little just cheat.\" And they don't understand that I have to be careful with everything I eat and can't have alcohol with the insulin. Definitely agree about the allergies.",
          "id": 236,
          "comments": [
            {
              "score": 839,
              "content": "Celiac here, and I cannot tell you how many times I’ve gotten sick from being lied to or people not realizing if they add flour to the potatoes (which, what, who does that) it means I cannot eat them. \n\nI do Thanksgiving. I don’t trust other people to not poison me.",
              "id": 237,
              "comments": [
                {
                  "score": 349,
                  "content": "Lactose intolerant vegetarian here, and same. I have often eaten plain bread rolls and undressed salad leaves at other people’s houses.",
                  "id": 238,
                  "comments": [
                    {
                      "score": 218,
                      "content": "My first year in CA I couldn't go home for Christmas and was invited to a friend's family's house. \n\nI said I'm a long-time vegetarian (almost a decade at that time, now 30+ years) so I'd love to bring some sides to share so I know I have some options. Her family was like no no no - you are our guest! We're responsible for the whole thing. \n\nMy Christmas Eve dinner that year consisted of dinner rolls. They had an amazing spread, but the green salad had shrimp in it, the broccoli salad had bacon, the green beans had bacon, and the mashed potatoes were made with chicken broth. These are the ones I remember specifically, but no joke, every single dish was made with some meat. I was flabbergasted! LOL \n\nOn the 2 hour drive home my friend and her parents were super apologetic and realized they absolutely should have allowed me to being food.",
                      "id": 239,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "waaaat, that's horrible. I try to make at least some vegetarian options when I make Thanksgiving dinner now when we have guests who are vegetarians. :/ that sucks so bad that they wouldn't even try for ya.",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Celiac vegetarian here, most people actually prefer I bring my own dish, and since I like cooking I often bring enough to share so everyone is included. I can’t tell you how many plain lettuce and tomato “salads” I’ve eaten before I stopped being concerned about people who aren’t concerned about me",
                      "id": 241,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Lol severe lactose intolerant person here. We were camping with some friends who were DETERMINED to make me my first ever tray of nachos, but the drink was flowing and muscle memory kicked in. They were scrambling trying to pick each shred of cheese out of my nachos, I said guys it’s cool I have other food. Please don’t stress. Literally fishing out cheese pieces from chips, when the chef comes over and dumps cooked onions on top, swimming in butter. Their faces when I said I couldn’t eat it cheese or no. 🥲 so sweet, so thoughtful, but just let me make my own food.",
                      "id": 242,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I DON'T TRUST PEOPLE NOT TO POISON ME! \n\nTHIS!!!\n\nLike, people who dont have any kind of food allergies or restrictions or whatever genuinely do not understand how serious this stuff can be! This is our lives. Our health. Our general wellbeing. We aren't just being difficult on purpose just to piss somebody's mommy off. \n\nAnd I really wish people would understand that its a lot more stresful/embarassing/upsetting for us than it is for them. So what if I don't eat your potatoes? You'll live, and everybody else is already gobbling them up anyway. I already feel like enough of an asshole being a guest in your home and yet refusing to eat the (potentially poisonous) food you've put in front of me. You dont have to make it worse. \n\nOP is YTA. His wife is trying, and all he can do is make things worse for her.",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Dairy free person here, who's also allergic to beef and intolerant to red meat.\n\nPeople getting confused as to what is even dairy (if it comes from a nipple?) So they'll put sour cream in something but omit the eggs. They'll try something in butter and say \"oh it's not in it, it was just cooked in butter :)\". \n\nI also usually cook so that I can eat something that's delicious and there's no experimental recipes being given to me while everyone gets something delicious and I get something SO SAD",
                  "id": 244,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Ugh, my sister is dairy intolerant in addition to also having celiac. I always accommodate her. Enchiladas without cheese. Lasagna without cheese. It’s not that hard to make a portion WITHOUT CHEESE",
                      "id": 245,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I have to work so I don't do extra that Thanksgiving because I work in retail and I can't honestly handle both. It's too much.  I'm often drained and depressed especially around the holidays and the job doesn't help with having C-PTSD. I have no family so I try to be respectful of my boyfriend's family and friends but if I go I'll bring my own stuff. I don't mind staying home. But the OP could have been more sensitive and made his wife a priority.",
                  "id": 246,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Celiac here also.  I had never even heard of putting flour into mashed potatoes until after I was diagnosed.  Lmao still confuses me!",
                  "id": 247,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Non-celiac, but I can't have any non-fried gluten, and even some fried gluten (no idea what is going on, I tread careful with all new brands). I'm lucky that my fiancé's family makes sure there's food I can eat, and we bring food for me (or stop somewhere on the way) if we aren't sure. No one is salty about it. Dietary needs are a PITA, and everyone always seems happy that I'll grab whatever I can to help, or not make a fuss if things are missing. I'm always just happy to be able to join in with family holiday meals.   \n\nAlso, gravy. It's crazy how many people don't realize flour is the usual thickener.... we always bring gluten-free gravy mix or cornstarch at this point.",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": ">just cheat\n\nI get a feeling they don't understand what diabetes is at all. It's not like a diet that's meant for you to loose/gain/stay the same weight, it's literally to keep you out of the hospital (or worse)",
              "id": 249,
              "comments": [
                {
                  "score": 10,
                  "content": "To be fair though, many of us diabetics (at least type 1s) *can* eat whatever we want, we just have to do corrective injections/boluses.  Type 2s I understand since often it's controlled through diet and exercise and for many they like having a better idea of the carbs and such.  The main thing I'll bring to gatherings is diet soda since many people don't bother having it for parties.",
                  "id": 250,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I thought Thanksgiving was about spending time with our loved ones and being thankful for them and our the blessings we have. Not to build Mommys ego by worshipping her Turkey and Tators. Guess I was wrong.",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I have ARFID and I have to do the same thing.",
          "id": 252,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "As someone with autism, I am a very picky eater. I don’t like trying new foods because it’s just so overwhelming for me. Even when I try food and I so I  know it tastes good, I still can’t eat it because for me it’s less about the taste and more about the texture of the foods.\n\nAs a child, whenever I’ve had family get-togethers, my parents would make and bring food for me separately. As an adult now, I do the same thing. When I go to friends houses, I’ll bring my own food. Even when they’re inviting me to their parents’ houses, I bring my own food and no one gets offended. They might offer for me to try their foods at first, but once I explain it to them, no once takes it personally. Even when I go to restaurants with friends or family, where they typically have rules about bringing outside food, when I explain this to the staff, most times they’ll allow me to eat my own food.\n\nIf OP’s mother is seriously going to be offended about OP’s wife bringing her own food food so she can feel better, then OP’s mother has a problem and OP is enabling that problem by not supporting his wife on such a trivial issue. \n\nOP’s wife did come up with the “perfect compromise”. And OP YTAH.\n\nEdit to OP’s Update: I don’t see why OP cares if OP’s wife spends thanksgiving with her family. He already told her not to come to thanksgiving with him, and that she should stay home. So she isn’t abandoning him because he had already decided to abandon her. Also I don’t see how she’d be doing “unnecessary travel expenses” since he’s the one who told she shouldn’t go. Like does he really expect her to just stay at home and wait on him to return when she has family a couple hours away that she can stay with. OP just seems really petty rn. And then to ask everyone here, if we’re happy now that she’s not spending thanksgiving with him and his family, as if we actually had anything to do with that. All that’s on him and he needs to realize that and making it seem like everyone’s out to get him.",
          "id": 253,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Yes!  I have IBS and multiple things set it off.  My in-laws don't cook and like to order Thanksgiving dinner and I don't want to make that hard for them.  They eat their dinner, I bring spicy rice noodles for me and everyone is happy. \n\nYTA,",
          "id": 254,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3786,
      "content": "YTA.\n\nYou're actually a double AH here. First, you don't explain why your wife is a \"picky eater\" and I suspect it's not because she just doesn't like stuff but that there are issues with certain foods. My wife has numerous issues that make regular meals a problem. For example, she can't have ordinary black pepper. It took me 15+ years to get my mom to fully realize how complex my wife's dietary restrictions are. Bringing food is a perfectly acceptable alternative these days. If your mom can't support that and can't support making something that your wife can eat, then neither of you should go.\n\nSecond, you're siding with your mom over your wife. Did you exchange marriage vows with your mom too? Is that why you won't support and defend the person you supposedly chose to build a life with? Keep doing that and you won't have a wife anymore. The \"cold shoulder\" is just the start. Next up will be the wild ride that [this poor guy](https://www.reddit.com/r/BestofRedditorUpdates/comments/vetfpn/very_long_my_marriage_is_on_the_rocks_because_of/) went on.",
      "id": 255,
      "comments": [
        {
          "score": 628,
          "content": "Agreed YTA. But some picky eaters are just picky eaters. Sometimes it is \"can't\", for others it is \"won't\" (my brother is the latter).\n\nThe only thing that might have helped is offering to bring a dish she eats family-sized, for sharing. But the mother sounds, from what little was written, like even that would be considered an offense.",
          "id": 256,
          "comments": [
            {
              "score": 747,
              "content": "It doesn’t really matter, no one should be forced to eat something they don’t like. Can’t or won’t doesn’t really matter, because you’re not the one eating. Especially in OPs case since she was willing to just bring her own food to not inconvenience anyone.",
              "id": 257,
              "comments": [
                {
                  "score": 561,
                  "content": ">It doesn’t really matter, no one should be forced to eat something they don’t like.\n\nWhenever there's a post here about \"picky eaters\", there's always people who just cannot grasp that idea. I've read \"grow up\" or \"all you picky eaters are selfish assholes who expect everyone to accommodate them\". Or \"everyone hates going to restaurants with you\" (like that person knows the minds of every one of my friends 🤣). Or \"I hate when I'm eating and someone else doesn't\".\n\nIt doesn't matter if you're allergic, have health restrictions, religious restrictions, sensory issues, eating disorders, are vegetarian/vegan/etc., or just hate the taste of something. **Eating is supposed to be pleasant**. Especially in social gatherings, eating isn't supposed to make you wish you weren't there.",
                  "id": 258,
                  "comments": [
                    {
                      "score": 133,
                      "content": ">everyone hates going to restaurants with you\n\nThey don’t, and honestly if being a little picky or bringing your own food so your other friends don’t have to accomodate you makes them hate you, maybe you’re just not a likeable person or your friends suck 😂",
                      "id": 259,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "Yes! And turning down a dish is in no way reflective on what we think of your hospitality; I’m always grateful if someone will cook anything for me; but no amount of psyching myself up will let me swallow scrambled eggs. \n\nTurning down a dish is not what causes a problem at a party. It’s the host trying several times to convince you, then getting all hurt feelings when you still turn down the eggs. \n\nThe most anyone should have to say is, “No thank you.” No is not a challenge or a negotiation starter.",
                      "id": 260,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": ">sensory issues\n\nIt doesn't even have to be a full blown issue. My oldest son won't eat tomatoes, but has no problem with non-chunky tomato based sauces (pasta, pizza, etc). He simply can't stand the mouth feel of tomato flesh. It makes him want to hurl.",
                      "id": 261,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "AND if I am your friend, I presumably care about you and want you to be happy/comfortable. I can’t imagine treating my spouse like this.",
                      "id": 262,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Yeah my blood is still boiling over the people who said a guy was not an asshole after he kicked his brother and his brother's girlfriend out of his house because instead of eating the Costco pizza he provided his brother went out to get better pizza.\n\nSo many people were all: if a guest doesn't eat what I provide then they can GTFO, but then would refuse to admit that that's basically coercing someone to consume something they don't want to.",
                      "id": 263,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Thank you for saying this. My mom has violent reactions to a weird host of foods (10+ years with no diagnosis) and my sister is just a picky eater. It poses a challenge to be able to cook for my entire family, but I welcome it as an opportunity to get creative.\n\nSometimes I still have to do two versions of the same food, and do so happily. I also have certain pairings of dishes that I love but won't make because it's something I know my mom would love but can't eat and I don't like the feeling of everyone around her trying something delicious that she can't have (mainly my cheesy broccoli bake; still sad I found this recipe after my mom had to stop eating cheese). I'll also ask her if she's found any new recipes that I can add to the meal for everyone else to try (her recipe for lamb meatballs, kale, and barley is killer).\n\nFor me, I love all kinds of foods and enjoy trying new things. That said, I have one thing I refuse to eat, hell or high water: beans. I hate them. The texture, the taste, the look, everything. It's the only thing I won't even try if I know it's in a dish and I will go hungry over eating. My family knows this and my mom believes it stems from surviving on beans and hot dogs as a child (thank you WIC). This only ever poses an issue when it comes to chili, but my mom would make me a separate serving without beans and my boyfriend does so too now. He actually was surprised at how good his mango habanero chili was without beans (we used ground beef, ground turkey, and bison).\n\nBasically, we love each other and want to ENJOY meals together. The tiny sacrifices of food preferences is worth the quality time we spend having dinner together. Going a little bit out of our way is simply courtesy and love.",
                  "id": 264,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Yes... with the addendum that some \"picky eaters\" actually have an eating disorder triggered by trauma. Read about ARFID. It's incredibly debilitating, and it's not a case of \"won't eat X.\"",
              "id": 265,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I’m picky about onions in the way that I’m not allergic but I also visibly gag when I try to eat them. I’m 40 so I grew up in the “eat what I made or go to bed hungry” generation…. I was hit, sent to bed hungry and 2 hours early, shamed, berated, told that I’m mean and bad and making the host/cook feel badly. I tried to hard to pick around those ingredients that my throat just will not swallow. I spent countless meals eating the bread/crackers and pushing the rest of the meal around on my plate hoping no one would notice and planning to sneak into the kitchen later for a PBJ. \nif picky eaters could just decide to stop being picky, we would. Don’t be an asshole. \nAlso, did you know that strong food intolerances are extremely common on the autistic spectrum and are often the result of a sensory dysfunction? \nOP, YTA.",
              "id": 266,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Why does it matter if they prefer not to eat certain things over being unable to? Should they be forced to eat them anyway? I don't understand why it's relevant. Unless they're faking being picky to be spiteful or rude about it somehow, I don't see how it matters",
              "id": 267,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I agree with you about “can’t” and “won’t” but IMO that’s a moot distinction as far as MIL is concerned. It’s not MIL’s business. Allergies would definitely warrant more caution, of course. My point is, it’s a matter of “Wife won’t eat that.” MIL should accept that at face value and *then* plan accordingly, i.e. if she “won’t eat peanuts,” they can safely be served everywhere. If she can’t obviously more action is needed.",
              "id": 268,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 186,
          "content": "I was not prepared for this by any means. You need to add more of a disclaimer lol",
          "id": 269,
          "comments": [
            {
              "score": 85,
              "content": "Seriously. What the fuck did I just get into",
              "id": 270,
              "comments": [
                {
                  "score": 45,
                  "content": "That took a turn I was NOT fucking expecting, oh my god",
                  "id": 271,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "There were a couple at the top of the page under spoiler boxes. That being said, yeah, it was rough. I missed that guy's first post 3 years ago but joined the ride starting with his second. It was a train wreck in slow motion happening live in front of us and we couldn't get it to stop.",
              "id": 272,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Holy shit, even after reading everyone else's reactions, I still wasn't properly prepared for that! My eyes widened when it got to \"grandparents rights\" but fucking hell, it just kept getting SO MUCH WORSE FROM THERE!\n\nI feel so bad for them, but I'm glad the wife stood up for herself and I hope that the OOP can work through everything in therapy and find happiness somewhere",
              "id": 273,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That was so heartbreaking to read.",
              "id": 274,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Fucking RIGHT!?",
              "id": 275,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 93,
          "content": "I agree, double YTA & thanks for the link. That was a wild & painful read. I hope OP sees it & does better immediately.",
          "id": 276,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "This one right here gets it.\n\nYTA, OP. I knew someone with celiac whose family stuffed the turkey, recipe handed down from grandma. She just brought her own turkey and her own gluten-free casserole and ate what she could of the rest (devilled eggs, beans, etc). You're missing the entire point of the holiday is TO BE THANKFUL TO EACH OTHER. To spend time with your loved ones and be glad to have them, NOT FOOD.\n\nGet your head outta your ass and apologize to your wife.",
          "id": 277,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Jesus Christ. That was fucking traumatising. OP you really need to read that post.",
          "id": 278,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Oh my goodness. *THAT* was a rollercoaster.",
          "id": 279,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Damn, that was a Wild ride. Thanks for the link!!",
          "id": 280,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1969,
      "content": "YTA. You and your mother.\n\nAFRID is a thing. People have legitimate food aversions, and your family's petty, spiteful attitude is just cruel.\n\n\"iF yOu dOnT eAt aLl oF iT yOuAr a MoNsTeR.\"\n\nYour mother can bugger off with that attitude, and so can you for enabling it. You clearly care more about your mum not bitching than your wife, to the point where you'd leave her home like a misbehaving dog when she came up with a very reasonable solution.\n\nYou're a very cruel and spiteful asshole, OP. I hope your wife finds people who actually cares about her to spend the holidays with",
      "id": 281,
      "comments": [
        {
          "score": 279,
          "content": "I hope the wife takes the day and spends it either with her own family, or on a mini vacation for herself.\n\nOp and his mother sound utterly awful.",
          "id": 282,
          "comments": [
            {
              "score": 179,
              "content": "According to the update, she’s doing exactly that and OP is offended she’s ditching him instead of the other way around",
              "id": 283,
              "comments": [
                {
                  "score": 173,
                  "content": "That really pissed me off. \"You can't come to my thanksgiving but how DARE you go to a different one.\" I also wonder if they live close to OPs mom because he can't dare to upset her by being more than an hour away",
                  "id": 284,
                  "comments": [
                    {
                      "score": 169,
                      "content": "and he chalks it up to 'unnecessary travel expenses' like wtf? So she's supposed to either go to his moms and suffer or stay alone at home as a punishment? Good god this guy is a mega asshole!",
                      "id": 285,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "Fr tho. He straight up told his wife to stay home alone after she suggested a perfectly acceptable solution to her picky eating habits. And he’s shocked she made other plans instead of sulking at home in lonesome misery on Thanksgiving.\n\nAnd yeah, the ‘unnecessary travel expenses’ comment really irked me.",
                      "id": 286,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Omg that update is salty as fuck. Like op  manages to somehow frame his wife not wanting to be alone on Thanksgiving as a slight against him.\n\nWhen she eventually leaves his ass I doubt he has the self awareness to realize how his actions drove her away/ he'll accept no responsibility for his part in the marriage dying.",
                      "id": 287,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "I love it that he also makes it our fault. Denial is a river in Egypt.",
                      "id": 288,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "And he’s moaning about the additional travel costs. What did he expect her to do, stay at home by herself?",
                  "id": 289,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "It’s actually ARFID. \nAvoidance-Restrictive Food Intake Disorder. \n\nIt can be a precursor to full blown anorexia nervosa especially in younger people. \n\n[More Info on ARFID](https://www.nationaleatingdisorders.org/learn/by-eating-disorder/arfid)",
          "id": 290,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "That his wife was still willing to compromise and attend what has got to be a dreaded family event speaks to how hard she’s trying…for the OP. She earned the right to go to her family, and OP can suck on the “added expense”.",
          "id": 291,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1395,
      "content": "YTA. \n\nThe problem as I read it is not that your wife is a picky eater, but that your mom takes offense because of that. Which is ridiculous because how is that in any way a personal attack on your mom? \n\nYou’re the ahole for not trying to make your mother see that it’s nothing to do with her cooking but with your wife’s tastes. And if that’s something your mother just doesn’t want to see; well, I think you know where the problem lies at that point. \n\nAgain: Your wife isn’t the problem.",
      "id": 292,
      "comments": [
        {
          "score": 160,
          "content": "IKR!! its only the moms fault that it feels like a personal attack to her!!!! jesus he is willing to do anything to accommodate his moms weird sensitivity but not his wife’s food sensitivity??? tf??? what makes mommy sm more important? moms not coming up with any compromises but wife is.",
          "id": 293,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Forcing someone to eat is about emotional control. She likely forced her kids to finish their plates or try everything, so that is likely why OP doesn’t understand and thinks it’s just manners. Hosts outside of family don’t chastise guests for what they do or don’t eat.\n\nMIL is upset because she can’t control DIL the way she has done her children, and instead of defending her CHOICES, he wants her to comply to avoid conflict.",
          "id": 294,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1096,
      "content": "YTA. I'm a picky eater as well. Its a terrible psychological issue and I hate it and wish I ate anything and everything and its caused problems for me my whole life.  I'm 35 yo. My husband's family is so understanding and always goes the extra mile of making special food for me along with their traditional food for everyone else and I always feel so bad since I could just bring my own food but also so loved. Your family seems to be the opposite and instead of being there for your wife when she is clearly trying to find a way not to be a bother but also still be around your family even though they give her a hard time for something she struggles with, you are adding to her stress and hardship.",
      "id": 295,
      "comments": [
        {
          "score": 310,
          "content": "Came here to say the first part of this. It’s a shameful and embarrassing subject for me. It’s very hard to get psychological help for this issue too. I wish I could change it but it’s not as simple as not liking the food.",
          "id": 296,
          "comments": [
            {
              "score": 239,
              "content": "Food aversion us so hard to explain to people who don't have any trouble. Look, I'm not being picky, if I try to eat that I will gag. I don't have control over it.",
              "id": 297,
              "comments": [
                {
                  "score": 59,
                  "content": "[deleted]",
                  "id": 298,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I can’t force myself to choke down anything that has lived under the water…. My first thanksgiving with my MIL was the first time she ever decided to include muscles in the stuffing.  :( She managed to make every dish include something I have a massive aversion to or FULL of dairy.  I think I used my whole bottle of lactaid pills for that one meal just so I could eat.  (My issues are severe lactose intolerance and all personal issues with fish/seafood.) \n\nAlso, can I just say how much is chaps my ass when I say I’m severely lactose intolerant and someone goes “me too!” Then lists the dairy items they have no problem with?! Wtf I’m so sensitive I can tell you within 10 min if there is even some dairy snuck into cooked food.",
                      "id": 299,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Right? Just looking at the Salmon crayon triggers my gag reflex.",
                      "id": 300,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "My sister and I are like this and her husband doesn't understand. He can shovel anything in his mouth no problem. But I can feel my throat close up if I even smell something that puts me off. I physically cannot get the food down and I will have to spit it out.",
                  "id": 301,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Same.  Most food tastes absolutely horrific to me.  I have no idea why, but it's terrible.  If I can even choke it down I may puke it right back up.\n\nEggs are the worst.  Just the smell of eggs cooking makes me retch.",
                      "id": 302,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "A good friend has a child who had selective mutism and serious food aversions that were diagnosed and being treated by psychiatric professionals when the child was younger, yet people who knew this would still think you just had to “force” her to eat or talk and it was a matter of discipline. Thankfully mom knew better and only offered love and support.",
                  "id": 303,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "Please don't feel ashamed. ARFID is misunderstood by so many people.  My daughter has a very limited palate and we have encountered the \"just grow up\" attitude many times.  \n\nWhat so many people don't get with \"picky\" eaters is they can't see some food as food.  Had a friend (who worked with Duke University to get ARFID recognized) describe it as asking someone to eat garbage or tree limbs or glass.\n\nI am grateful my family is not offended by people not eating their cooking.  The host makes the bird and everyone brings a dish to share.  I make sure to bring food my daughter can enjoy.",
              "id": 304,
              "comments": [
                {
                  "score": 23,
                  "content": "I’ve been looking into ARFID recently as someone on Reddit had mentioned it to me. It’s so intriguing and explains an awful lot.\n\nI hope your daughter is doing ok!",
                  "id": 305,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I have developed such severe anxiety about going out to eat with basically anyone who is not my parents or my best friend. The constant shame and embarrassment of people commenting on what you are/are not eating is exhausting. I have a list so long of foods I can’t eat (texture, taste, smell etc) or shouldn’t eat (IBS) that finding something to eat off a menu is such a huge effort it’s usually not worth it. \n\nIf I could change this, I would. But when I try to explain it to people, I tell them I would just rather not eat at all than eat whatever the thing is. They don’t get it.",
              "id": 306,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I agree, I grew up with the ‘pickiness’ and it was an incredibly sore subject for me knowing how many people I was inconveniencing simply because I couldn’t tolerate certain foods and couldn’t give a solid reason why. Being teased and belittled was common, especially among parents and peers (you’d think people would get a clue as an adult, but nope, I got flack for it too well into my 20s).  I’m much better now than when I was a child, but there’s still so many things that I just cannot eat because of it and I just cater to my own tastes now. My husband has been the only person to get me to even try certain foods, and it usually goes like “do you like it?” “It’s okay.” “You want more?” “Not at all!” So even trying things and ‘liking’ it doesn’t even solve the aversion. \n\nYTA OP, it’s not uncommon for people to bring their own dishes to Thanksgiving in the first place, even without food aversions, and make it a halfway potluck. Your mother needs to get over her pride and you need to support your wife.",
              "id": 307,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This thread is actually bringing up why I kind of resent Thanksgiving as I’ve gotten older (not even getting into the history of the holiday.) So many people have some kind of issues around food, whether it be history of ED or aversions or family pressures etc that it’s just so stressful. My dad gets so bent out of shape if he can’t have his favorite traditional foods or they don’t taste right. Who cares!!!!!",
          "id": 308,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "As a mother in law of an amazing woman who just happens to be picky, please don’t feel badly. I’ve learned some new dishes and I think my DILs needs and input has made it way more of a great family holiday. I want everyone to be happy and full on the holiday, and it sounds like your MIL is the same",
          "id": 309,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "We need to retire the word Picky. \n\nWe don’t call people picky if they decline to go to a horror film with us; they just don’t do horror films. \n\nAnd if my friend says no to going to the symphony with me, I don’t do the “just try it once!” guilt on her. I just know she prefers country music.\n\nWhy is food any different?",
          "id": 310,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Cooking for people is my biggest love language. I can’t imagine hosting a holiday meal and not being willing to make one thing the wife would like or at least inviting her to make something to contribute that she will be able to enjoy!",
          "id": 311,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I didn’t learn that my pickiness was down to sensory issues with certain textures until I was an adult. Yet my parents accommodated me. Friends and their parents did (albeit make comments) accommodate me. But regardless, I was accommodated. My in laws now are amazing about it because my mil works with special needs kids so she gets it!",
          "id": 312,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}