{
  "post content": "I am 19M, and my sister (22F) got married about a week ago. She was rather mean to me growing up, and I still don't like her very much.\n\nSeveral months ago, we were all having dinner as a family. I was asked by my sister if I could be the organist for her wedding. She told me that she can't pay me, but that I can have food at the buffet. Since most of the gigs that I do are paying ones, I initially said that she's going to have to pay me. But my parents got mad at me and told me that it's unreasonable to expect family to pay me for playing music. I asked my sister if there'll be vegan options for her buffet, and she told me that she'll make sure that there will be. So I gave in and agreed to play as long as she has vegan options for me.\n\nWhen I arrived on the day of the wedding, my sister came over and told me that she wasn't able to get any vegan options for the buffet, so she got an Impossible Whopper for me from Burger King on her way there. Not only was that completely insulting, it has mayo in it so it isn't even vegan. I told her that I'm not going to play for the wedding unless she sends me $200 on Venmo right now. She went and discussed it with her fiancé, only to be told that she can't do that. So I immediately left the wedding and muted my sister, her fiancé, and my parents on my phone. There was no music for the wedding ceremony. I went to go see a movie with my friends instead.\n\nWhen I got home, my parents were predictably very angry and screaming at me. But I refused to apologize. I honestly don't care that much what they think anymore at this point because I'm already moving out in less than a month. My sister is now demanding that I reimburse her $2500 for the organ rental, and is threatening to take me to small claims court. I told her to pound sand because not only was there no contract, she didn't even uphold her end of our verbal agreement.",
  "id": 1,
  "comments": [
    {
      "score": 22156,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 7627,
          "content": "Fuck finally, I don't understand how people think the punishment fits the crime on this one.",
          "id": 3,
          "comments": [
            {
              "score": 2709,
              "content": "Why is this so far down. Two separate levels of incident. It's just food vs a whole sibling wedding. Why on the day.\n\nEdit. Love each other. Be mature and have these conversations post-wedding days. Too many people wrecking family weddings in this sub. I’m gonna go look at cats now...",
              "id": 4,
              "comments": [
                {
                  "score": 3632,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1184,
                      "content": "And ESPECIALLY by family. They don’t get let off the hook for trying to take advantage.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 946,
                      "content": "I guess there's a lot of family history going on here with similar incident. Having grown up myself with a narcisstic, egocentric and condescending sibling I can imagine this wedding was just the climax of a whole bunch of s**t OP had to take from his sister his whole life. \n\nImo NTA because you kinda reap what you sow. She didn't uphold her side of the contract. \n\nAnd being family is no excuse for being a major asshole.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": ">Money clearly isn't an issue considering 2.5k spent renting the instrument. It seems they never intended to get him a meal. Like they couldn't even put in the minimum thought of getting an actually vegan burger.\n\nEXACTLY. The sister knew ALL ALONG that there was no vegan option for the OP. Did the sister go to a nice restaurant and order something really tasty for the OP and bring it? No, they swung by Burger King. They paid $2500 for the organ but refused to pay $200 for the OP. The sister did ALL of this and expected the OP to just suck it up. Seriously, the $2500 organ rental is what sealed the deal for me. The sister wasn't really broke—just too cheap to pay their sibling and also too cheap to pay for a decent meal. This whole thing was 100% avoidable by the sister.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "fuck man we are not obligated to to humiliate ourselves for family. This is so fucked up wedo not need to roll over just for family. Her actions were her consequences she agreed to have at at least food for him there and didn’t but did spend almost 3,000 dollars on the instrument he was going to play???? Not everyone has good relationships with their siblings.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Thank you holy moly. OP is NTA. These people really are cool with his family bulldozing OP like that. Screw the sister and her wedding. She can pay 2.5k for an instrument but can't afford to pay the player?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Agreed. Am I wrong to think weddings are like a big family event? Like of course the two being married are the stars of the show, but never have I ever been to a wedding where A SIBLING's dietary restrictions weren't even considered when preparing the menu? Like if it was some distant 3rd cousin who the bride and groom rarely see then I wouldn't be so shocked... But the bride's own brother? My sister is vegan and you'd best believe at my wedding she would be sitting at the head table with something delicious to eat, just like everybody else. This leads me to think the family can't be that close, and to expect him to play for free was crossing a line. That said, while I would have been absolutely pissed, I don't know if storming out was the right call, but then I go back to thinking how hungry he must have been and that alone would cause me to overreact. I think my judgment is NTA, or maybe ESH but where sucking is mostly on the part of the sister who kind of sounds like a monster to me. If I was OP I would have stayed and then come up with some petty revenge plot for later that ruins her day, but not her wedding day. Tough situation.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Thank you, I have no idea how people are defending OP’s sister when all she wanted was free labor and couldn’t even be bothered to find him a real meal to eat. Jesus.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Yo, so much this.\n\nOP is in a professional enough position to be paid for playing his organ. \n\nYour family should endevour to support you as you support them.\n\nI launched a novelty business, my dad brother and fiance (and a couple friends) have been my only real customers. They've paid full price and joyfully to express they are overjoyed and agree that I am capable of doing this. \n\nTheir agreement was money or food, neither was provided. It's OP's sister's fault that \"I'm leaving\" wasn't taken at face value. My guess is \"Mom and dad will make him anyway.\"\n\nIf sister and parents aren't ever capable of thinking \"maybe I was entirely wrong\", OP is better to wash his hands of them. \n\nThis is the first step in teaching people how you want to be treated. If they can't suffer to give him a modest amount of respect, he's much better off.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "That's why I've been saying!! \"Oh we are blood related so I get to take advantage of you\"",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Seriously. She shelled out two and a half grand for a fucking organ rental? I’m sure she could have spared an extra two hundred.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 337,
                  "content": "Because it’s so obvious the sister did it on purpose. “Love each other” - you think the sister who bought her brother a *fast food burger* has any respect or care for him?",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "Yeah no.\nI was a professional performer for many years. Weddings a big part of that. If someone had done this to me, my team and I would have walked. As discreetly as possible, but I would not have cried a single tear at ruining the wedding of a person so blatantly attempting to cheat me.\n\nThe organ is the key here. $2500 on the instrument but  'we can't pay'. Cant is just wont. No hired service provider would accept that. But faaaaaaaaamily waah\n\n'Family' is not an excuse to let bullies bully you into accepting less. All too often for the performer or the self-employed,  family expect endless work gratis... but believe you me they will whine at the slightest wait or imperfection like they are your top consumer.\n\nSupport your talented family by actually supporting them, not constantly wanting freebies. And everyone else? Stop shaming professionals who work in creative fields because 'family'\n\nGenes mean shite. Family are the people who love and support each other... not cheat each other and want special privileges.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "This sub flabbergasts me sometimes.\n\nThen I think back to when I was a teenager, and through absolutely no fault of their own (they are wonderful people) I would go through phases of thinking my parents were the Worst People Ever and have little fantasies about getting back at them for every perceived slight. But I didn’t have reddit to validate my immature revenge fantasies and tell me my family were toxic narcissists or whatever. I grew up and realized it took two sides to get along, I was often the problem, and my parents were good people.\n\n“My sister didn’t realize the impossible whopper wasn’t vegan? She fucked up and I’m going to ruin her wedding by walking out and leaving them with no music because I am the all important organ player and then they’ll all cry and realize how they’ve wronged me!!!”\n\nNo, everyone in the real world is going to think OP is an immature dick. Maybe the caterer messed up, maybe the sister did, at least she tried to fix it by running to Burger King on her damn wedding day, which is absolute chaos for a bride, to try to find food for OP. She didn’t even seem unwilling to pay $200, but her fiancé said no, maybe they didn’t have money to Venmo right then, I don’t know, maybe it was a bigger conversation that couldn’t be had right then right before a wedding.\n\nAny decent person would suck it up, be the bigger, kinder person and play the organ rather than fuck up the wedding. The argument could be had later, OP could demand payment later (or more appropriately, sister could take her to dinner, as the agreed payment was a dinner, not $200) but OP should have helped her sister out EVEN IF HER SISTER WAS WRONG.\n\nThis sub breeds angry, lonely people who have burned all their bridges.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "If one person has the ability to ruin an entire wedding, perhaps the bride shouldn't treat them like an absolute piece of shit. She ruined her own wedding.\n\nBoo hoo now she has to face the consequences of her presumptuous and disrespectful attitude.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "What pushes this into at least ESH territory for me is that, based on the fact that payment was food, the OP wasn't otherwise even invited to his own sister's wedding.",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Family is a two way street. You can't claim your sibling has to do something for you \"because we're family\" and then refuse to give them the barest of consideration.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Small problem- sister decided the day of the wedding to take back her verbal agreement to provide food. \nNot a whopper. \n\nSecond - if it was someone other that wasn’t family, and she said instead of money here is a cold fake version of food for you to eat.\nHow should that have gone over? \n\nFamily assumed that OP would play for free- like another posting - a women was assumed to do bridal make up for free - and everyone sided with her as being NTA. \n\nI’m sorry- family doesn’t give an automatic “free” unless the person offers.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "[deleted]",
              "id": 23,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "Because the sister treated OP like absolute shit? Some of you seem to expect people to accept being treated like doormats.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "So I mean under normal circumstances I would agree, but it's not like the conditions weren't clear. It's not like he's punishing her for something she did, he's just not doing what he said he would after she didn't do what she said she would.\n\nIf you hired a wedding photographer and when they showed up you told them \"oh btw we aren't paying you\" would they stick around as an obligation to avoid ruining a wedding? No... If she wanted a wedding that wasn't ruined, she should have made what I consider to be VERY basic arrangements to ensure music will be there.\n\nIf my family treated me like shit I would have done the same thing.\n\nHe could have taken the high road, but he's not obligated to.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "MUSICIANS DESERVE TO BE PAID FOR THEIR WORK \n\nMUSICIANS DESERVE TO BE PAID FOR THEIR WORK \n\nMUSICIANS DESERVE TO BE PAID FOR THEIR WORK \n\nMUSICIANS DESERVE TO BE PAID FOR THEIR WORK",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "The “crime” was not paying the agreed-upon price for services to be rendered. The “punishment” was that services were not rendered. \n\nI don’t know what you think the appropriate response would be.",
              "id": 27,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "honestly commenter op made a good point but it sounds like his sister bullied him growing up and it didnt seem like he was really \\*asked\\* to be the organist, more or less told to be the organist then when he agreed on one very very very very small condition, his sister forgot. Although I dont know if the punishment fit the crime, but I do wonder if the sister forgot or just didnt care. I wonder if this is the first time something like this has happened where its essentially OP's obligation to do something for his sister, and I wonder if the road is one or two ways. End of the day if were assuming OP is telling the truth it sounds like his sister probably does things to bring him down all the time and i really dont feel bad for her.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It does? Think it this way, the agreement was: vegan food= free musician so the 'anti'-agreement would be something like: not vegan food- not free musician? He didn't ruined the wedding, I think people don't realize she could put a phone and a speaker and suddenly there would be music?",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1510,
          "content": "Took too long to see YTA. This dude is acting like a child. This will forever be a stain on his relationship with his family. Wedding days are stressful, especially for the bride, and at least showed up with a sandwich for him, which I think is a nice gesture. Not a gracious bone in this dude's body. YTA",
          "id": 30,
          "comments": [
            {
              "score": 1267,
              "content": "A sandwich which the brother couldn't eat as it wasn't vegan.",
              "id": 31,
              "comments": [
                {
                  "score": 7,
                  "content": "I'll be honest,  I had no idea the impossible whopper wasn't vegan til he said it. It's an easy mistake to make. He is attributing that to malice when it likely is just ignorance",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 640,
              "content": "That's not a nice gesture. A nice gesture would have been having at least one vegan option on the menu. How fucking hard is it to have at least one vegetable dish on the menu with no eggs or dairy?? It almost seems like she went out of her way to not include something vegan so he wouldn't eat her expensive food.",
              "id": 33,
              "comments": [
                {
                  "score": 363,
                  "content": "I can’t believe people are defending her when she got him a fast food burger.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Right? Even if you put the organ playing arrangement aside, his sister planned a wedding in which she had no food for her own brother to eat. She was going to let him go hungry for the entire celebration and didn’t even bother to tell him ahead of time.\n\nHow is the sister not an asshole for being such a terrible hostess that she didn’t bother accommodate her own brother? Add in the arrangement where she specifically promised to in exchange for organ playing and she’s an even bigger asshole.\n\nI think ESH because OP went a bit nuclear, but I’m astounded by the Y-T-A responses from people who think she’s in no way at fault for her shitty behavior just because it’s her sPeCiAL dAy.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "Oh but she's the bride and she's doing something for someone else on HER day! And she's going out of her way to appease OP's strict sensibilities and he just SCORNS all of her effort for NOTHING. \n\n/s",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "And one that isn't even vegan. That was a crap move, and I think it was purposeful.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 343,
                  "content": "[deleted]",
                  "id": 38,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Yeah I agree. It's just so weird to not to have ONE dish a vegan could eat, especially when someone specifically asked her about it and she promised.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "I've been to big catered events last minute (a funeral)   and even they had baked potatoes (in oil)  a salad that they were able to make some without the dairy dressing. And some asparagus also cooked in oil. \n\nAlthough not an ideal meal it really wasn't bad. \n\nOil is cheaper than butter anyways.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Considering she gave him a fast food burger, I’m guessing she did it deliberately. Probably angry that he wasn’t falling all over himself to help at her wedding.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "She didn't. There's no way she even attempted to do this.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 608,
              "content": "Catering menus are setup weeks beforehand. She couldn't have told him ahead of time that he wouldn't be able to eat at her wedding?",
              "id": 43,
              "comments": [
                {
                  "score": 69,
                  "content": "According to OP, they asked him months in advance. More than enough time to add a plate. But even more atrocious, is he is immediate family. They know he is vegan, why wasn't that an option from the start?",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "If she told him in advance how is she supposed to guilt him into it by putting him on the spot at the last minute? Her plan would have worked on most people, who would let themselves get screwed rather than cause a scene. She just didn't realize her brother gave zero fucks that day.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 406,
              "content": "Wait a sandwich is a gracious gesture for him freely preforming a highly skilled art at their wedding for free against his wishes?  I wouldn't be grateful either.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 331,
              "content": "[deleted]",
              "id": 47,
              "comments": [
                {
                  "score": 21,
                  "content": "That was my first thought! I was like, ok if he's her brother and going to her wedding, shouldn't he be eating food anyway? Unless he isn't even invited and she just wants him there to play organ for free. Yeah, the gracious thing for him to do would have been to play anyway, but all things considered, I don't blame him for telling her to pound sand.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Right?  And I assume he was invited to the wedding anyway and would have had access to the buffet.  So his payment was being able to eat the food he was already able to eat?",
                  "id": 49,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 300,
              "content": "It took too long because the judgement is based on flawed reasoning\n\nOP got no payment, let alone even a meal they could eat at their sister’s wedding but are expected to do this huge favor for them while going starving and unpaid\n\nA stressful day isn’t an excuse to treat your family less than dirt\n\nThe sandwich wasn’t even a nice gesture because it had mayo and wasn’t even vegan. You failing to do one simple thing doesn’t make it a nice gesture because you tried. You don’t get trophies for trying to provide the bare minimum to someone. It’s called an empty gesture.\n\nThe sister had no gracious bone in their body to treat OP with dignity but apparently it’s gracious to make sure you do whatever you can for family while they treat you like dirt, don’t pay you and starve out all the while lying to you about a promise that there will be vegan options at a buffet (that is settled well before the wedding)",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "Idk man. As a DJ who's done friends weddings I always get paid my fee, the food, and in one instance beer and the sandwiches the bridal party was eating. Being family/friend doesn't entitle you to someone's service.",
              "id": 51,
              "comments": [
                {
                  "score": 13,
                  "content": "Exactly! People think that because of family they should do everything for free, but you don't live out of favours.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 6,
                      "content": "And that $2500 organ rental could be used for a high end DJ or band with lots of lighting.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "right? you go to a friends business because you want to support them and it's someone you trust.\n\nI take my car to my friends shop and insist I pay full price for everything. why? because I want my money to go to good people, and I know that I can sign the bill without needing to question anything.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": " Wait he asked to be paid, to which she said \"You can have food\", to which he reluctantly agreed, but then *there was no food*. \n\n\nPay people what they ask for or get nothing.\n\nIf sister was smart she would have agreed to pay him the 200.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": ">and at least showed up with a sandwich for him, which I think is a nice gesture\n\nIf all the other the guests at the wedding all get to eat for free, then giving her a crappy fast-food sandwich (that wasn’t even vegan like she had agreed) isn’t a nice gesture in any sense.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "She agreed to provide food as payment (which is already bullshit given he’d be needing food as a guest to the damn wedding), and then failed to even do that, instead offering a last-minute, cold, soggy, shitty burger from Burger King that’s not even vegan. They’re family, yes, which means she should have had the basic decency to get food her own brother could eat. It’s not a ‘nice gesture’ to get him fast food to feed him at his own sister’s wedding.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1490,
          "content": ">you’ve been sucked in by this sub’s rigid, unrealistic (and frankly immature) views on family\n\nFamily is no excuse to treat someone like shit, ever. She asked him to waive his fee of $200, he obliged since he was promised at least to be fed. When he arrives, she has not delivered on her part of  the deal (that BK burger ain't vegan and they probably bought it just because they wanted BK before coming to the venue).\n\nIt's obvious she had zero respect towards him, but he tried, and got shafted, so he paid back in kind. You get what you give.\n\n>You ruined her wedding ceremony. I can’t imagine how awkward and weird it was to walk down the aisle to no music at all. I feel so sad for your sister.\n\nShe fucked up her own wedding over not giving a crap about  her brother, what they agreed upon nor what the repercussions of her actions could be. She could have paid him after he rightfully called her gamble out.\n\nPlay stupid games, win stupid prizes.\n\nEdit: let me ask you it this way around: she could afford a $2500 organ, but she could not afford to buy vegan food OR pay her brother? It just tells about her priorities more than anything. OP was well within his rights to leave. I mean, he was not even invited as a guest, just to play the organ, so it's clear they don't like each other to begin with, so when you screw someone who didn't want to do something in the first place, what the hell did she expect was going to happen? Entitled bridezillas.. 💁‍♂️",
          "id": 58,
          "comments": [
            {
              "score": 745,
              "content": "Yes! Why is it his fault that there was no music. She didn’t compensate him as promised. She obviously had enough to pay for things like a buffet and an organ rental which aren’t cheap. Family is no reason to let people treat you like crap.  I’m fact, the argument could be made that people should be MORE respectful BECAUSE they are family. Not the other way around.  If he wasn’t her brother this wouldn’t even be an issue. \n\nFinally, how did no one have the sense to just play something on a phone or some other sound system. Ask the other guests to sing a familiar song. If his sister wanted free music there are other ways to get it.",
              "id": 59,
              "comments": [
                {
                  "score": 65,
                  "content": "Oh please, with Spotify or Pandora she could had music.  If she didn't it was her fault.  And if she could afford $2500 for the organ rental she could afford $200 to pay her sibling.  She cheaped out by not having the vegan option and trying to get away with a cold Buger King option while everyone else is having a great dinner!",
                  "id": 60,
                  "comments": [
                    {
                      "score": 66,
                      "content": "I love how people are calling him an asshole and just ignoring the fact she spent TWO THOUSAND to rent this organ. She couldn’t pay literally a tenth of that to have someone play it?\n\nFamily isn’t an excuse to manipulate them into getting what you want, and that’s exactly what she tried to do. She probably knew there wouldn’t be vegan options and just wanted to bait him in until it was “too late” to back out. Every wedding, I’ve ever been a part of, had the food set up weeks/months in advance.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "If he wasnt her brother this wouldnt even be an issue. \n\nThank you! Someone finally said it and they're exactly right. If OP wasn't related to this entitled hag, yall would all be saying NTA.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 25,
                      "content": "[deleted]",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "This should be the top comment. Sounds like a family of narcissists and they deserve it.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": ">the argument could be made that people should be MORE respectful BECAUSE they are family.\n\nThis is my rule. If my family and friends treat me worse than stranger or acquaintances, then they are not going to be a a part of my life. I have not had to   remove but one person from my life for this. I spoke to that person multiple times about the way they treated me, and saw no changes. So, I am no longer friends with them.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Because, people have loving relationships with their families and they think this is okay. It isn't. I have family like this. I had to cut them out of my life because I saw how they were brainwashing my kids like they did to me. I finally saw all the manipulations and lies. Unpaid labor was a common thing because they were family and needed help. But they couldn't be there for me. People think the OP was rocking the boat. He wasn't. The sister was rocking the boat. OP just got out and let her sink herself.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "She literally only had to pay him $200 but she decided she rather fuck up her own wedding LOL. Says more about her than it does about him.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "> Edit: Let me ask you it this way around: she could afford a 2500 Organ, but not to buy vegan food OR pay her bro? It just tells about her priorities more than anything.\n\nNot to mention organists are a dying breed.  My mom took gigs as a church organist for the past four decades, and she's seen them become few and far between. Even when adjusted for inflation she has been able to increase her rates substantially. $200 for a wedding is more than fair.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My confusion is why the caterer's did not have a vegan options of any sort. I've worked many weddings and had many caterer's as clients and every single one has been able to produce something vegan, even if not notified before hand. She could stop and get an impossible burger but couldn't have ordered pick up from a vegan place or a fast food place w a vegan option?! No bc she didn't care, all she wanted was what benefiting her. They had a verbal contract and she didn't hold up her end of the bargain. Should he have just done it for free bc it's his sis, meh..., each family and there relationships is diff so who can judge. His sis sounds terrible.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">Play stupid games, win stupid prizes.\n\nPeople complain about that saying being overused on Reddit, but man oh man it fits perfectly in this case. The sister thought she could con her brother into playing the organ for free when it would have been very simple to just get him the freaking meal.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 621,
          "content": "[deleted]",
          "id": 71,
          "comments": [
            {
              "score": 52,
              "content": "Right. This kindness thing people expect from OP goes both ways. \n\nNot only does it seem like he wasn’t invited, but his sister couldn’t prioritize his meal (being his sibling and the musician playing your music on a 2500 rental)?  \n\nThe meal portion is a big part of the wedding and so is the music. Oversights happen but this just seems negligent on the sister’s behalf.",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 544,
          "content": "Sounds like OP wasn’t even invited to the wedding until they wanted them to play the organ. Like who says you can eat at the buffet as payment to your sibling unless they weren’t invited.\n\nEdit. I guess he approached them to play but it still sounds like he wasn’t invited",
          "id": 73,
          "comments": [
            {
              "score": 30,
              "content": "No re-read it, OP was approached by sister to play at the wedding. \n\nSecond paragraph, second sentence. \n\nI do think ESH, but only mildly for OP. It’s a terrible situation but I think sister is the bigger AH here since she didn’t respect OP enough to actually feed them vegan food. It’s really not that hard to get vegan food catered. There’s lots of vegan options especially now and an impossible Whopper with mayo as consolation?? How incredibly rude!",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 461,
          "content": "So OP is TA for not being a doormat? They made an agreement and the sister could not keep up her end of bargain. Yet, that’s ‘not the place’ to make a fuss? Had it not been family OP’s sister wouldn’t have gotten away with that. \n\nAlso, the sister was willing to drop $2500 for the organ rental but couldn’t give OP $200 OR make sure that there was a vegan option for them. That is far worse. You are basically telling OP that they are the TA for not bending to their sister’s will even though they were being disrespected. Even if OP had just done it OP STILL wouldn’t have been able to eat at the wedding since there were no vegan options. \n\nOP’s sister didn’t have rent the organ if she couldn’t afford to pay her sibling to play it. She didn’t have to agree to the terms if she didn’t want any vegan options at her wedding. I am more annoyed that ppl get upset at this sub when they let ppl know that they don’t have bend over backwards to try to appease their toxic loved ones.\n\nWhat if OP had said ‘no’ in the first place? Would that have been better?! Then you would tell OP that they were TA for not wanting to play at their sister’s wedding even though their sister was willing to compromise.",
          "id": 75,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 362,
          "content": "What you are missing is that OP doesn't even seem to be invited to the wedding in the first place, or at least he isn't treated with any respect. \n\nIf he couldn't play the organ he would still go to a wedding where he couldn't eat anything. His sister didn't keep her end of the deal so it happened anyway, but at this rate it is beside the point. It is fucked up that your sister care so little for you.\n\nHis family might be mad, but honestly, fuck them. They are clearly not valuing him as an equal.",
          "id": 76,
          "comments": [
            {
              "score": 17,
              "content": "This may be a stretch, but it sounds like sister is the golden child. She was mean to him growing up, and the parents and sister ganged up on him to play for free. Then, sister did not even hold up her end of the bargain. The parents are taking her side (I am guessing they usually do.)I think she knew exactly what she was doing. I am guessing that this was his one big chance to enforce a boundary and let her have true consequences for her actions.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 295,
          "content": "I didn’t realize this sub’s view that your family shouldn’t treat you less than dirt is an unrealistic expectation when you’re asked to do a huge favor for the wedding all the while not being paid or being able to eat anything\n\nMaybe fix your own views and actually learn that you should treat your family like human beings with some goddamn respect and dignity\n\nOP asked the couple if they’d pay 200 and they straight up said no. I’m sorry are you supposed to wait and beg around for money? Stop it. This isn’t remotely on OP at all. \n\nThe couple had months to arrange a single decent food option for OP and then when they failed to do so, they said they wouldn’t pay OP either. They clearly don’t give a shit about OP so why should OP work like a servant for someone like that? Just cause it’s your wedding, doesn’t make you king of the world where everyone bends to your word without question",
          "id": 78,
          "comments": [
            {
              "score": 45,
              "content": "Fuckin right. I don't get the \"you're the ass\" judgement at all. Looking at it from a business perspective you wouldn't expect an artist to stay and perform with the agreed payment. Just bc they family doesn't mean they can get away with bad treatment. If she cared enough about her wedding she would've payed him the 200$. What would she have paid if he hadn't agreed to perform? She should've cared more about her own wedding to make sure there wasn't a hic up. It's not like it wasn't in her control to provide food.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Why aren't more people talking about how it isn't just his sister's wedding? She had to ask her husband if she could pay her brother. Does that not seem weird to other people? I wonder what else he controls in the relationship.",
              "id": 80,
              "comments": [
                {
                  "score": 11,
                  "content": "It does seem weird but I just assumed that she asked the husband in the sense that they make financial decisions together and not by themselves\n\nBut that’s a whole other can of worms to open all the while in this already ridiculous crappy situation for OP",
                  "id": 81,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "No, OP's sister tried to take advantage of the fact that they're family, and not hold up her end of the deal, which was why OP was going to do it anyway. If you're asking a service from a family member, the right thing to do is offer compensation. OP's sister couldn't provide, and they weren't on good enough terms for OP to just do it anyway. You don't treat your family poorly and expect them to make nice.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 265,
          "content": "Shouldn't this be an ESH at least?  Sister didn't fulfill her promise either",
          "id": 83,
          "comments": [
            {
              "score": 150,
              "content": "I legit cannot understand anyone voting YTA and at least not ESH. Like sister should have provided her brother vegan options, even if he wasn't playing the organ for her wedding. It's a really basic thing to provide to a wedding guest.",
              "id": 84,
              "comments": [
                {
                  "score": 37,
                  "content": "The NTA comments were at the top before and now people are upvoting the one whining about family. Makes me mad because she deliberately got him fast food and people are giving him shit about it.",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It took way too long for me to find this",
              "id": 86,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8478,
      "content": "NTA. You agreed vegan buffet food as payment for services. She couldn't pay, so you didn't provide the services.\n\nAlso, total asshole move offering to feed you from the buffet as payment in the first place. As a wedding guest, wouldn't you have got to eat anyway?",
      "id": 87,
      "comments": [
        {
          "score": 3868,
          "content": "Right?  Thats the weirdest part of this to me.  Was the brother not going to be invited or something? Or only some guests got to eat? What the heck\n\nEdit: spelling",
          "id": 88,
          "comments": [
            {
              "score": 1118,
              "content": "Wasn’t there someone asking about being an asshole for not wanting to feed wedding guests? Maybe that was his sister.",
              "id": 89,
              "comments": [
                {
                  "score": 491,
                  "content": "Haha i didnt see that one but man i hope so. That would be pretty funny.   You know the othee thing here is these ages are young. 22 and 19? Im not married but i cant imagine not paying one of my brothers if i asked them to play or make something for my wedding if that came about.\n\nEdit:  so i went to bed and woke up to quite a few responses on both sides of the fence.  Some of the coemts are pretty valid so i'll add that if they were close this wouldn't be am issue.  She would repect his personal choice and have vegan food for him no problem, and he be happy to play for her free. In which case sister would hopefully give him a nice gift in return.  Here is soumda like they dont get along and dont like each other and shes using their blood relation to try and get free labor. From a 19 year old who probably doesnt make/have much money.  Menu's for weddings are set months in advance, she knew her standard buffet didmt have the right food and didnt cate about him enough to make the proper arrangements (and im not talking about fast food, thats insulting too even if shed gotten no mayo).  Frankly if her new husband knew about this he should be embarrassed too.\n\nAlso, i would totally make things for my brother's wedding for free (or at consumables cost) but we are close and i not a professional. I just like crafting and am close to them. The quality of the relationship matyers a lot here. Blood doesnt guarantee love it just.. Jump starts it? Gives it a defacto edge up?",
                  "id": 90,
                  "comments": [
                    {
                      "score": 311,
                      "content": "Right? I'm young (23) and not married, if I was in this situation you bet your ass I would pay my brother. And have vegan options for him. It's not hard to have vegan opinions for food either.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I'm 25 and my brother got online ordained to officiate my wedding and I plan on paying him or at least giving him a nice gift.",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "[removed]",
                  "id": 93,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Seriously, the only things I remember from all the weddings I've been to have been:\n\n1. Food\n\n2. Music\n\nYou can cheap out on music (depending on the age of your guests) but if you cheap out on food nobody will forget (in a bad way). I still crave the food at my sister's wedding... it was a full southern barbecue with a pig pickin'.  Cheesecakes for dessert...",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1917,
          "content": "I can’t get over the 2500 they spent to rent the organ but didn’t want to pay anybody to play it.",
          "id": 95,
          "comments": [
            {
              "score": 722,
              "content": "Right? That's what I didn't understand either, willing to drop $2500 on a rental but not pay the organist?",
              "id": 96,
              "comments": [
                {
                  "score": 633,
                  "content": "I can't understand how in that moment when you can't feed your own damn brother that you would still think paying them $200 was unreasonable.\n\nAnd it's the day of the wedding you find you you don't have vegan options? Oh homegirl knew for a while she was pulling this one.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 377,
                      "content": "I have this feeling that she never told the caterer she needed a vegan plate.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "This.  How hard would it have been to have a vegan dish or two. For her to give so little consideration to her brother, she had no right to expect his consideration--even at a wedding where he would have been better off as a guest. \n\nIf he had just attended as her brother and not part of the entertainment, he might have been hungry but he wouldn't have had to work to learn the music and then perform it on an empty stomach.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 247,
              "content": "Not even paying the grand sum of *some vegan food*.",
              "id": 100,
              "comments": [
                {
                  "score": 77,
                  "content": "Right? Shit, buy the dude a salad. Is it a GREAT vegan option? No, but at least it's frikkin vegan.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Why is everybody's first thought for vegan options a boring frickin salad? A salad doesn't fill you (unless it has beans or rice or whatever). She could've gotten him a burrito bowl or some asian veggie dish. There are plenty of take-out restaurants with adequate vegan options. Even McDonald's has a vegan burger. But I bet the caterer would've had some great ideas for vegan buffet dishes if she had asked them.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "That's an easy one, they approached the brother as high quality services that were available with no cost. I am almost sure that if he was renting organs, they would want it for free as well.",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 94,
              "content": "It's safe to assume they're lying about how much it cost.",
              "id": 104,
              "comments": [
                {
                  "score": 14,
                  "content": "Dude I can get you an organ for three fifty  and a six pack",
                  "id": 105,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 89,
              "content": "I’m not shocked at all. Look online at how many people brag about how cheap they had their wedding because they had their entire families pitch in to do the services that normally would be paid. Hard not to see how it goes from people asking to people demanding",
              "id": 106,
              "comments": [
                {
                  "score": 5,
                  "content": "I would never have considered asking for services from family...and not only because I don't like most of them. Those who offered were very gratefully accepted and offered payment but there's an obligation with family that, once you ask, it's really hard for them to refuse.",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "they spent that much because they have OP in mind to play it",
              "id": 108,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I suspect Sister is lying about the rental (or this is fake). Anyone who would pay $2500 for a rental would cave on the $200.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Which is why this was the best answer OP could have given:\n\n>I told her to pound sand because not only was there no contract, she didn't even uphold her end of our verbal agreement.\n\nShockingly mature, given the circumstances and threats of suit from bridezilla.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 390,
          "content": "$200 out of an entire wedding budget for music is nothing. They were just betting on OP doing it for nothing and no food (or a Whopper which wod be insulting even if it was vegan) because family. NTA, I hope she learned a lesson.",
          "id": 111,
          "comments": [
            {
              "score": 167,
              "content": "Apparently the budget had room for a $2500 organ rental, but the cost of a hamburger for the human to play it.",
              "id": 112,
              "comments": [
                {
                  "score": 6,
                  "content": "Completely ridiculous!!",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yeah you have to actually like your family for the \"do it for family\" line to be a viable strategy. In my family I'm pretty sure if any of us played the organ we'd be happy to donate our services to a family wedding for free, but we'd also make sure that everyone had a legitimately good meal to eat. Her not caring enough to get him more than a whopper is directly related to him not caring about whether her wedding went well.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "Lol and then to stop at burger king before the event buy a non vegan burger and expect that to be the tasty alternative mmmm",
          "id": 115,
          "comments": [
            {
              "score": 175,
              "content": "\"Here's a cold burger that's now soggy oh and also it's not even vegan because I *don't even care enough to get that right*... Now, play my music!\"",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Who said she was a guest ^^",
          "id": 117,
          "comments": [
            {
              "score": 4,
              "content": "Clearly she wasn't, which makes it all the more insulting.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "This... was he not going to be invited to the wedding? I don’t understand...",
          "id": 119,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "NTA. \n\nNo payment, no service. Now if OP liked his sister and wanna do it for free. That is no issue. But he doesn't like her and wants to be paid for it, that s cool too.\n\nBut then she didnt pay... so... lol",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Thank you,how the hell is OP TA for wanting payment,and all the sister had to do was get a vegan option.\n\nAlso how the hell is the top comment a YTA,it makes no sense.",
          "id": 121,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "It sounds like he wasn’t a guest until she needed music.",
          "id": 122,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3291,
      "content": "She told me that she can't pay me, but that I can have food at the buffet.\n\nWtf is this even? Did her guest have to pay for their meal?",
      "id": 123,
      "comments": [
        {
          "score": 517,
          "content": "That's exactly what I thought!",
          "id": 124,
          "comments": [
            {
              "score": 636,
              "content": "What I find even more baffling is the sister didn't even consider adding vegan options for OP just because they were siblings. She played the organ or not, shouldn't she have made arrangements for family and friends who she invited?",
              "id": 125,
              "comments": [
                {
                  "score": 300,
                  "content": "It's not like people who aren't vegan can't eat vegan food, either. It's not all mock meats etc.\n\nNTA... It's not like you asked for an entire buffet, you just wanted to be able to eat *something* as per your agreement. Plus, you were being generous enough to bring your skills/talent to her event for free.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 97,
                  "content": "That’s what I thought... I’m eating a vegan meal right now without even thinking about it (& I’m not vegan or even vegetarian). Surely at a buffet they’d at least have salad, rice, veggies or bread? I mean what kind of food is this??",
                  "id": 127,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Meat buffet! Meat on a stick! Meat lasagna! Meat & gravy! Meatcake! All meat, all the time!",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I bet everything is covered in butter and she didn’t have a salad bar. That would eliminate everything from green beans to bread. A bunch of sides probably also had bacon pieces in them too.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "if the rice or veggies had butter, they wouldn't be vegan.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 309,
          "content": "Couldn't pay for the gig or real vegan food but apparently paid $2,500 for an organ rental? IDK man.",
          "id": 131,
          "comments": [
            {
              "score": 187,
              "content": "And decided $200 for the musician was too much...? Interesting place for sister to draw the line.",
              "id": 132,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I feel like this detail is getting largely ignored. Is not feeding your wedding guests a thing now, or was OP not even intended to be a guest in the first place?",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2744,
      "content": "Bold move. Look I'm going to go esh, but justifiably so.",
      "id": 134,
      "comments": [
        {
          "score": 785,
          "content": "I'm agreeing with you.\n\nOP was well justified, but still and asshole. One of the many cases on this sub where they had an asshole thing done to them and responded with justified assholeness back. Still a dick move, no matter how right they were to do it.",
          "id": 135,
          "comments": [
            {
              "score": 415,
              "content": "It’s not a dick move to back out of a job when you’re not even getting the payment that was promised for said job...",
              "id": 136,
              "comments": [
                {
                  "score": 1559,
                  "content": "It's his sister, and I know this sub has a hardon for noy giving family special treatment, but in the real world, family does matter to most people. This isn't just a contractual obligation with a stranger, and treating it like that is ignoring a huge chunk of social context. \n\nHonestly if a family member of mine asked me to do something for them that I usually get paid for, and that would take a day(i.e not a long term project that would hurt my earning ability) I wouldn't even think about asking for payment.\n\nI'm not defending the sister either, and bringing in a fucking sandwich was a MASSIVE dick move. But OP isn't a perfect angel in this either.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 612,
                      "content": "The sister literally walked over and spat on OP for not even giving an actual food option that they could have\n\nThere is no reconciliation here because they suddenly couldn’t eat and they thought a goddamn Whopper with mayo was an acceptable substitute to a vegan\n\nSo OP decided if they were gonna starve, to at least pay them 200 bucks which is literally nothing compared to what you pay for actual music being played at your wedding\n\nAnd then the sister actually had the nerve to refuse that too. OP was literally disrespected and being treated like a servant.\n\nI didn’t realize that because you didn’t bend over backwards and work like a servant for your sibling at their wedding meant that you’re not an angel\n\nAnd somehow the sister later coughed up all that money to rent an organ when they couldn’t pay OP? Nah there was no other option for OP to do besides what they did",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 251,
                      "content": "He doesn't get a food option at his own sister's wedding.\n\nThat's how much his sister values him.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 214,
                      "content": "Just because you have no problem selling your talent short to family doesn’t mean other people are okay with doing so, I’m of the mind that if you want a family member to do a job for you, you should pay more because you want to support them.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 109,
                      "content": "I'd agree except when your so called family didn't make even the slightest effort to provide vegan options at a buffet? I mean most buffets would accidentally have some vegan options so if sister has that little respect for OP she lost any special privileges being OP's sister brings.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 98,
                      "content": "The thing is though-- that this goes both ways. If I want a service done by a friend or family member, I will offer something in return, exactly because they're close to me and I want to treat them well.\n\nThe sister not only didn't offer anything back-- I mean, sure, food as everyone else who aren't expected to do something for the ceremony, which means it cannot be considered as \"payment\". She apparantly couldn't even make sure that her own brother could have something to eat at the buffet. \n\nThe fact that the sister doesn't give him any special treatment-- or if anything, the special treatment would be worse than everyone else. She also doesn't treat him as a contractor. She literally treats him like shit and he's an asshole for standing up for himself?\n\nI would agree with you, if the brother had just stopped negotiations if he couldn't get paid, but he gave in under a certain condition, which he most certainly wouldn't offer anyone else besides a family member (giving her special treatment, as you said he should)-- which she then didn't manage to fulfill.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Let me guess, your field is not something that proppe need for a single day on the regular?\n\nBecause for most of us that work in fields of the type that people need for weddings (for reference, chef in my case) - never work for free is the hardline rule. If I did weddings/big birthday parties for free I’d be working every single weekend.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "In the real world, family can be shitty or abusive. Stop taking your experience of family values and project it on every person in the world, because that's not how it works. In the real world.",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "It’s because relationships matter in context. I have 3 sisters... two of them I’d go out of my way to help... the oldest... would not get urinary assistance should she find herself in a combustible situation.\n\nShe straight up lied to op. There is zero chance she COULDN’T get a vegan option... it was probably just more than she wanted to spend.\n\nShe decided she could get away with lying to him. She put a value of $8-9 on ops talent and time when she showed up with that burger\n\nWhen op pointed out the original agreement terms were null and void op demanded well below market value for their skill... sister straight up said no. She got exactly what she deserved",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "> in the real world, family does matter to most people\n\nAccording to some people in this thread, it should matter to the brother who is spending hours working while everyone else celebrates, but it shouldn't matter to the sister who is refusing to feed her brother.",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "\"But hold it together for the family\" is probably the reasoning you will get back. Fuck that. Blood is overrated.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 6,
                      "content": "It's great that some people have amazing families that would anything for each other, but to expect EVERY family to be like that is asinine. Some families are toxic and it sounds like OPs is as well. Family is not always blood, it's who accepts you and who want you in their lives.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 96,
              "content": "Was OP supposed to play with no payment? \n\nWhat kind of doormat BS are you encouraging here?",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "[deleted]",
              "id": 150,
              "comments": [
                {
                  "score": 38,
                  "content": "The better approach would have been to say no all along. \"You can have food at the buffet\" makes me feel like she didn't want to invite her own brother, why should he do a thing for her without proper payment? If you want to use the family excuse, then don't do it in front of the family member you don't consider a guest to your own wedding.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I think that's too much hindsight there. He tried to say no and got guilted into it. With that much pushing and prodding, you'd think his sister would do the bare minimum, even if they aren't close. When he arrived and she couldn't even provide that bare minimum, what was he to do?",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 130,
          "content": "Haha what?\n\nSuddenly it’s being a justified asshole when they didn’t even get what was promised as payment for their job?\n\nThis isn’t what justified asshole means, OP was just plain justified\n\nWhat’s the alternative here? To play for free and starve?",
          "id": 153,
          "comments": [
            {
              "score": 89,
              "content": "Nah, obviously the alternative is to play, but to change the key of whatever music was chosen from major to minor. \n\nOr just play the Star Wars imperial march theme, if OP had wanted to be even less subtle 😇",
              "id": 154,
              "comments": [
                {
                  "score": 9,
                  "content": "That could have been a quite interesting outcome.\nAnyway, for a sister that always treated me like sh*t, who didn't even invited me to her wedding, and asked to play for food that didn't exist, I would smashed the keys.\nNta",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Couldn’t OPs parents have run out and grabbed something for him on the way to the reception. I doesn’t seem like there was really any problem solving done here.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "[deleted]",
          "id": 157,
          "comments": [
            {
              "score": 43,
              "content": "Even if you do believe family shouldnt charge for family, which is ridiculous, I get discounts but not freebies, but even so, if you agree to something dont back out and give them a fucking Burger King burger at a wedding and expect them to be OK with it.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2478,
      "content": "[removed]",
      "id": 159,
      "comments": [
        {
          "score": 818,
          "content": "Came to say this but without the mayo part. YTA.",
          "id": 160,
          "comments": [
            {
              "score": 63,
              "content": "My family is devoted carnivores. They treat veggies as if they are poison. I'm the only vegetarian in a very, very big family and I constantly for years got mocked for it. They would chew with their mouth opened and say \"mmmmm carcasses. Dead, tortured delicious animals\" , ask me when I would become normal again, some would even trick me to eat meat the first years. \n\nOn weddings, baptisms, parties, even smaller family gatherings there would always be vegetarian or even vegan options. I would always ask if I should bring anything/eat before and they always said no. They would either make veggie food themselves or have the caterers make sure there were many veg options, sometimes even whole as meals just for me with cute little cards about how it's only mine, what it contains and that they hope I like it. You know why? Because no matter how much they enjoy teasing me, the care for and respect me enough to make sure I can at least eat. The sister was very disrespectful of op. And she would have ample warning about the lack of vegan food, that shit isn't decided the day of. \n\nAnd, what did they think mayo was? Ground up veggies?",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 749,
          "content": "When my dad got remarried, me and my brother didn't do anything but look pretty at the ceremony. He still went out of his way to make sure we had vegetarian options at the buffet. Just to emphasize, this wedding was held in the middle of the countryside in Texas, practically in a barn. They still had vegetarian options. We were the only two vegetarians. \n\nEither the post is lying or the sister made absolutely no effort to feed her brother. She treated him worse than dirt.",
          "id": 162,
          "comments": [
            {
              "score": 320,
              "content": "Vegan and vegetarian are not the same thing.  Most of the time, it comes down to veggies being cooked with or without butter.",
              "id": 163,
              "comments": [
                {
                  "score": 210,
                  "content": "The venue cooked pretty much all of its veggies with bacon or incorporated some sort of meat dish. When me and my brother were going through the line, they pulled us aside and showed us a small section of food prepped to be vegetarian. \n\nMy point being most places are good at accommodating various diets, and this was a [ranch in tolar texas](http://lcranchtexas.com/). Tolar had a population of 911 in 2017. Really feels like if this place is accomadating, everywhere else should be. It shouldn't have been difficult for the sister to talk to the kitchen service and make sure there were vegan options.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 225,
              "content": "...and it's not like meat-eaters can't eat vegie or vegan food. I'm a meat-eater with a vegetarian boyfriend, and it's so easy to make something delicious we can all eat and then to supplement mine with meat. We often do a vegie risotto and I add some fried sausage or something to mine after it's served. To have nothing vegetarian or vegan at all on a buffet takes EFFORT.",
              "id": 165,
              "comments": [
                {
                  "score": 12,
                  "content": "Well, the [specific wedding I went to](http://lcranchtexas.com/) had nothing that was vegetarian naturally. Beans cooked with lard, everything that was mostly green had some bacon in there somewhere. They were still able to prep some vegetarian food to the side of what they normally make. If a ranch in tolar texas can be accomadating, every other catering service should be able to pull out an option that's more than a salad bar.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Plus it's 2020. Any catering company that doesn't suck would easily be able to cater for vegetarians, vegans, and half a dozen different food allergies. My guess is that the sister agreed to the deal, and either knew at the time or only realised later than the catering was already organised without vegan options on the menu.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 442,
          "content": "But.... He didnt expect her to pay, they made a deal that he would play if he could eat.\n\nShe knew what the deal was, and the consequences of breaking it, and decided to break it anyway. \n\nYou shouldn't let people walk all over you, family or not.\n\nEdit: even if he was only going as a guest and the sister didnt provide him any food, she'd still be a minor asshole. Expecting a service on top is definite asshole territory.",
          "id": 168,
          "comments": [
            {
              "score": 23,
              "content": "Why couldn't the bride just order a vegan dish for delivery?",
              "id": 169,
              "comments": [
                {
                  "score": 7,
                  "content": "That's exactly what I wondered. Thai and Indian food are both pretty widespread, and both usually have lots of vegan options. Ordering him some red curry with tofu would have been exponentially better than what she did, and just as easy. It's just total and complete thoughtlessness.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 426,
          "content": "> \"And then you expected her to have a vegan option at the buffet literally only because of you\" \n\nFirst of all pretty much any wedding is gonna have guests with dietary restrictions. If you can't accommodate them basic courtesy says you atleast give them a heads up. Especially if they're immediate family. She actually straight up lied. \n\nSecond, your expecting someone to do a days work unpaid for someone who's idea of accommodating their dietary restriction was to buy them a fast food burger. Next time you go out to an expensive steak house how would you feel if the person taking you out handed you a cold big mac?",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 336,
          "content": "Man you sound entitled as hell",
          "id": 172,
          "comments": [
            {
              "score": 309,
              "content": "That's exactly what I was thinking.  There are lots of people on this sub who are clearly really close to their family and very happy to have them.  I'm guessing they can't fathom not being willing to do anything for them.\n\n\n\nEdit: I just wanted to say to those that have kind of family, that's really amazing for you and I hope nothing ever changes that.  Some of us don't have that, and it colors our opinion just like your experiences colors yours.  I'd ask everyone in this sub to just be considerate of others, close to your family or not we don't have to throw knives at each other.",
              "id": 173,
              "comments": [
                {
                  "score": 167,
                  "content": "Especially since OP explicitly said that they don't have a good relationship",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I'm close to most of my extended family. I spend over $2000 just to attend a cousin's wedding. But even I can understand how OP's sister disrespected him here. First, she showed that she wasn't initially planning on feeding him by saying she'll let him eat if he plays the organ. Then she gave him options he couldn't eat. My own sister bitched about my dietery restrictions(I'm Muslim and don't eat fish or dairy and she had non-halal meat as the main course) but she had no problem accomodating her vegan friends so I did end up with the same dish as them. I just think it's an asshole move to not feed someone at your wedding. Maybe it's because I'm Muslim and Islam tells us to feed everyone at a gathering we're throwing but I've never heard of even a non-Muslim event where the attendees were expected to go hungry. You should just not invite people you're not planning on feeding.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yes, I hate the attitude that since your family is good, that everyone's family is that way. It's just not true. It shows a serious lack of empathy to think someone should be willing to do something like for someone who bullied them growing up. People should not have to suck things up for family.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 298,
          "content": "Vegan food is not some rare treat . She could have made it happen like she said she would. She ruined her own wedding.",
          "id": 177,
          "comments": [
            {
              "score": 157,
              "content": "...and it's SO EASY. Stir-fry some broccoli in olive oil. Done. Vegan food that meat-eaters will happily have as a side. Grill some mushrooms so they have some protein. Make a green salad and just make sure the dressing is dairy free. It takes basically no effort to feed a vegetarian or vegan on a buffet. (Allergies, on the other hand, can be a nightmare.)",
              "id": 178,
              "comments": [
                {
                  "score": 23,
                  "content": "While I appreciate the sentiment, these are actually terrible vegan options. None of these have any calories, and mushrooms have zero protein. You need something heavier than lettuce to make a meal, like some grains, pasta, starchy vegetables, beans, etc.",
                  "id": 179,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Which mushrooms contain a reasonable amount of protein? My experience is they have maybe 2 grams of protein per cup.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It takes effort to treat people with empathy though",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 249,
          "content": "She paid 2500 for an organ.  But couldn't pay 200 to play it.  Major dick move.",
          "id": 182,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 189,
          "content": "I think if you want someone at your wedding, you have to make sure that they have food they can eat at the reception. If you can't, you have to give them a heads up and understand if they don't come because they don't want to sit around watching other people eat? Also, why the hell would you pick up fast food before a wedding for someone so they can either eat at like 4pm or have a burger that's been sitting around for a few hours? Gross. And if you don't know someone well enough to figure out anything they'd eat, then you probably don't know them well enough to ask them to provide a service for free that they usually get paid for.",
          "id": 183,
          "comments": [
            {
              "score": 42,
              "content": "...and once you realise you didn't include food they can eat on your buffet, PICK UP THE GODDAMN PHONE! Apologise, offer to pick something up for them, ask what they can eat, run through some options, and finish up by APOLOGISING AGAIN.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "\"And if you don't know someone well enough to figure out anything they'd eat, then you probably don't know them well enough to ask them to provide a service for free that they usually get paid for.\"\n\nSay it louder for the people in the back!",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 186,
          "content": "You are not looking at this from the perspective of OP. some siblings have a close relationship with each other. (Example: you and your sister) others do not (Example: OP and his sister). I can relate to this 100%. Every family is different, please remember this.  OP's sister tried to take advantage of the \"family card\" when they didn't have any real relationship anyway, and then made a deal with him in the place of payment (a vegan food option). When weddings are planned, you know what is going to be served at your wedding. Catering is set up a long time in advance. She did not find out that there would be no vegan option the day of her wedding. She just decided to tell OP the day of the wedding, and get him a Whopper in place. She obviously did not care enough to even check if the burger was vegan, because it clearly was not. She did not care that much about OP or their deal, and only cared about what she would be getting out of the bargain. OP took time out of his day in which he could have been making money for a family member he did not really care for in exchange for food. And she did not hold up her end of the bargain. Do I feel bad that her wedding was messed up? Yes. But it was her fault and her fault alone, she had every chance to fix things for OP's end of the deal. NTA.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 154,
          "content": "Seems pretty obvious that there’s been a history of her using him and this was the last straw. Vindictive, yes, but it doesn’t necessarily make him the asshole.",
          "id": 187,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2316,
      "content": "YTA - sorry but you could have got mad about this after the wedding and not made a scene, maybe asked for something else in repayment after the wedding that wasn't your full rate, it's her wedding day and playing some music is not a big sacrifice for family. Even family you don't like much.  You had an opportunity to be the bigger person and you blew it, and acted like a child.",
      "id": 188,
      "comments": [
        {
          "score": 1024,
          "content": "He is 19, he basically still is a child. And if his family haven't even bothered providing FOOD for OP after agreeing that's what they'd do (although there should have been options even if he was just a guest), why do you think they'd reimburse him later? It being family does not mean that anyone has the right to be disrespected and saying that you should be the bigger person only encourages the negative behaviour and stresses out the person trying to be 'bigger.' it's basically code for be a doormat when everyone has the right to assert their boundaries.",
          "id": 189,
          "comments": [
            {
              "score": 638,
              "content": "In the real world, there is literally no one that would say he isn’t an asshole. Being kind doesn’t make you a doormat. Ruining a wedding does make you an asshole.",
              "id": 190,
              "comments": [
                {
                  "score": 204,
                  "content": "She's the one who ruined her own wedding by being a douche to and stiffing her organ player. She completely reneged on her deal, and was offered to pay the (very reasonable) fee OP had originally demanded instead, and *still* wouldn't pay. She staked her entire wedding on OP being a doormat (working for free for your disrespectful sister is being a doormat, not nice), and OP called her bluff.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 55,
                      "content": "People are only Calling him y t a bc it's his sister. If he was just a friend or someone hired, and she backed out last minute, it wouldn't be an issue.... \n\nPeople also clearly have never had a poor relationship with a family member. Not every family has a good dynamic.\n\nYaknow the actual saying is \"the blood of the covenant is thicker than the water of the womb\"? OP doesn't owe her anything just because she's family, and people who think so are entitled.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "You are way wrong. This is prime choosing beggars bullshit. They guilted OP into playing for food (which he should be getting anyway if his sister actually gave a shit about him) and then purposely did not uphold their end. Menus are set far in advance, meaning she knew there was not going to be vegan options and was banking on him being a doormat. Then she added insult to injury by getting him a burger. Finally, she had the opportunity to pay.\n\nIn no scenario is OP the asshole, and I would pay money to have been at that wedding to see his sister realize you can't treat people like garbage without consequences.",
                  "id": 193,
                  "comments": [
                    {
                      "score": 37,
                      "content": "A burger king burger on top of that. Was it seriously hard to contact a vegan restaurant and get her OWN brother a freaking meal? \n\nIt is actually disgusting that people don't see that the sister can pay 2k on an organ but can't spend more than $7 on her own brother after the brother accepted doing a $200 service for her.",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "The sister ruined the wedding by making a poor decision and not planning accordingly. It’s like shooting yourself in the foot and blaming the gun.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Not providing food for your family makes you a huge AH. There’s no way OP is at fault here.",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "In the real world you pay for services. I wouldn't ask family cater, dress, photograph, or perform for free. \n\nWant to support family? NEVER ask them for freebies or discounts from their business. Always pay full price. That's real support.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "in the real world he would have been paid money for his talent and time and if the payment that was promised did not happen, then he absolutely wouldn’t be expected to play for free",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Nope. In the real world, I'd be laughing my ass off. I have no sympathy for people as trash as his sister. Imagine wasting a $2500 rental fee and having to walk down the isle in silence just because you're too stingy to buy a salad. LMAO.",
                  "id": 199,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Honey, she ruined her own wedding. You reap what you sow, and she has an entire farm full of shit.",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "At 19 you know right from wrong. You arent really a child.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "[deleted]",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 226,
          "content": "Imo you're putting too much weight on the value of family. Many people have family they don't give two shits about , as seen here due to years of bullying and inconsiderate behaviour. If you read between the lines it seems she wasn't even going to invite OP. I mean damn she wasn't even planning on feeding him unless he performed. And then she failed to do even that.",
          "id": 203,
          "comments": [
            {
              "score": 59,
              "content": "This..so many people feel like you should bend over backwards for people just because they’re related to you. She didn’t even care enough to ensure that her brother could actually eat at her wedding, so why should he care enough that she didn’t have music for her wedding.?",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "And too little weight on the value and difficulty of music. It's not just playing some music, it's playing for a large crowd in a situation where you're under a lot of pressure to do it right. Weddings were my most stressful music gigs when I was playing.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "If they can’t provide food, which was the MINIMAL amount to offer, what the hell is he going to get?",
          "id": 206,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "My friend just got married and had to pay all vendors in full at least one week before the wedding. Because guess how easy it is to collect payment for services after the fact? \nMy dad did photography as a side business when I was growing up and eventually stopped because even people he thought were family friends would drag their feet on paying for his services. \n\nOP’s sister and family never would have reimbursed him for anything, so he did what any other vendor would’ve done if a client didn’t pay.. he didn’t provide the service. NTA",
          "id": 207,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2184,
      "content": "ESH, but Jesus Christ dude, of course you’re a huge fucking asshole. Please do not let this revenge-hungry sub vindicate you when everyone in your real life is telling you the truth: that you have done an incredibly selfish, petty thing, on an extremely important day of your sister’s life. \n\nThere were probably a million other things on her mind and she still at least tried to get you the shitty Whopper. I doubt many brides envision a food stop as part of their getting ready time. The forgetting your food is rude, but do not let that fool you into thinking that you are somehow in the right here. They could’ve ordered you food. It could’ve been another errand. These problems have solutions beyond “Fuck you, I’m leaving.”\n\nMaybe she should’ve offered to pay you but dude you’re her fucking brother. Think of it as a gift. You’re 19, I doubt you bought her anything of use to her starting a new life. Get over yourself and admit that what you did was insanely self absorbed. It seems like you were just looking for an excuse to ruin her day and make it about you, over your unfair treatment. \n\nIt’s sad that you guys don’t love or respect each other, but it feels especially mean on your end, while she was just clearly preoccupied and possibly thinking about the budget of her wedding.",
      "id": 208,
      "comments": [
        {
          "score": 404,
          "content": "All of this one. OP basically made it clear that he does not have any interest in a relationship with his sister. Maybe at 19 it's hard to understand how important wedding days are, but he straight up destroyed months of planning over some food, which she actually tried to fix for him. Like others on this sub, I had no idea mayo wasn't vegan - I've never really thought about what mayo is made of.\n\nPlay the ceremony and leave. That was the right thing to do here. Sends message, but doesn't ruin her day. OP acted like a child (because he basically is) and it will take years to repair his relationship with his family.\n\nEdit: ESH, but OP way more than his sister. Grow up, kid.",
          "id": 209,
          "comments": [
            {
              "score": 25,
              "content": ">he straight up destroyed months of planning over some food, which she actually tried to fix for him.\n\nActually, she destroyed it herself by renting the organ and then not paying anyone to play it. That's on her. And to say she \"tried to fix it\" for him is ridiculous; getting a Burger King sandwich for someone as the meal at a wedding is too pathetic an effort to count as trying.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "\"He straight up destroyed months of planning\" that somehow didn't include panning the vegan meal she promised him in exchange for his services? No, she ruined her own wedding.",
              "id": 211,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 193,
          "content": "The bride knew weeks ahead of time that she would need vegan options, so completely disregarding that means she does not give a single fuck about her brother, so why should he give a fuck?",
          "id": 212,
          "comments": [
            {
              "score": 19,
              "content": "People keep saying this, but based on the story as told it seems more likely that someone else made the fuck up, most likely the venue (I've been on a few wedding parties and the venue has gotten something wrong every single time, even as far as adding back in peanuts to a menu where the bride was allergic)\n\nThe fact that she scrambled last minute to go to a burger king in the middle of getting dressed screams that this was dumped on her last minute. It's possible that someone reminded her (but like, who other than OP would ask about the vegan dish for OP?) but it seems more likely that she checked in with the venue and they were like \"Huh? what vegan dish? that'll be 1000 to add last minute)\n\nIf she actually didn't care she would have let OP play the wedding then tell them there was no real vegan food.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "She didn't forget his food. Menus are set far in advance. She knew for months that there weren't actually going to be vegan options and waited until the last second to tell OP, hoping he'd feel pressured and still play anyway. \n\nShe doesn't get points for picking up a shitty burger when she couldn't even do that right.\n\nPlus you're ignoring that OP wasn't going to be invited unless he played. How do we know that? Because she offered to pay him in food!! Guests at weddings are fed, everyone else was fed, so she just wasn't going to invite her brother or have anything for him to eat at her wedding? Bridezilla",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Interesting take. \n\nSee, im under the impression that if something is important enough to ruin an event, you pay to make sure it's taken care of....or at least feed the fucking person doing it for you. \n\nWedding posts bring out the most entitled ridiculous humans i swear. \n\nDirectly below this one is a post about a man whos shitty mother came to his house asking him to pay for her cancee treatments because she was dying. He told her to get bent and it was pretty unanimously nta. If a *dying person* isn't entitled to help, what on earth makes someone getting married so god damn important the deserve free labor? Get real. \n\n\"Think of it as a gift.\" Yes, i totally want to give someome who bullied me growing up and has no respect for me (see: wont feed and wont pay) a gift of my time and talent. \n\nHe didn't ruin her day, she did. She presumably didnt even invite her to her wedding considering there was *no food he could eat there.*, she asked him to come play for free. He said no and he got guilted into it. All he wanted was some food, but she couldn't be arsed to do it. \n\nI also really love how you bring up \"most brides dont get food on their wedding day.\" You couldn't be more wrong. I used to work at an upscale event for weddings, i cant count how many weddings I've done, but durring the spring and summer we had at least 4 weddings a week, and some weekends wed do 2 a day, so multiply that by 3 years and thats how many weddings ive seen. People get to the venue hours, HOURS before the ceremony. They get hungry and they order  food. Sometimes its finger sandwiches and mimosas, but usually they have one of the brides maids run out and grab something for everyone. Taco bell, bk, McDonald's, whatever the bride wants. Its usually greasy because 9 times out of 10 everyone is hung over from the rehearsal dinner. \n\nShe manipulated him into playing for food, she knew all along what was going to be offered because *she made the fucking menu.* you're aware that the couple choose the food right? Especially if its buffet style lol. \n\nThis is so insane to me.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Sharing DNA doesn’t mean anything if they don’t act like family. The whole “her time could of been used better instead of getting him food” is bullshit plain and simple, lol. It was payment for something he didn’t even want to do for something other than money.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "How about, and hear me out here, if you want someone to do you a favor you don't treat them like human garbage? Wild idea, I know.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1627,
      "content": "NTA; Not only did she not get you anything to eat she also expected you to play for free because you're \"family.\" The small claim is honestly laughable like how are you gonna expect me to play at the wedding, not give me anything to eat like you said and then not pay me but you want me to reimburse you 2grand. Yeah no. She can kick rocks.",
      "id": 218,
      "comments": [
        {
          "score": 895,
          "content": "My husband is a career musician with two degrees in the instrument he plays. He has been asked by literally every family member on his and my side to play weddings for free, or as a gift, and he always turns them down. It's the ones who expect him to play which treat him the worst. The only person he ever gifted playing for was his best friend, and that's because he knew his friend would truly appreciate his art.",
          "id": 219,
          "comments": [
            {
              "score": 369,
              "content": "This reminds me so much of when I was still dating my EX. I was a hairstylist at the time (which is how we met) and he told me he had  large family I would have a good business with them etc. Umm...NO. They were a large family, but almost no one came to me and when they did, they expected it to be free. I used to charge low but affordable prices. If someone came to me and told me they had financial issues I probably would've done it free, but they didn't. There was an Expectation it would be free. Nope. This is my business.",
              "id": 220,
              "comments": [
                {
                  "score": 247,
                  "content": "For years my cousin did my hair for free. She was getting her training hours and I was doing promotion for her band (like running their socials, not like telling 3 people and saying it was promotion). She's not playing any more and is a full-fledged hairdresser, so I paid her $75 last time. \n\nCause she's a professional and so am I.",
                  "id": 221,
                  "comments": [
                    {
                      "score": 34,
                      "content": "No one shouldn't be paid for their time doing their job professionally. I never understood why people would do that, I've got friends who are photographers and they would need models for their projects and I would happily oblige because they need their grade and training. Now I pay them when I want pictures because they worked for that shit. PEOPLE DESERVE TO BE PAID FOR THEIR TIME DAMNIT!!!",
                      "id": 222,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "I have a cousin who is a hairstylist. She is extremely affordable for most people, but being in a small town, the prices are really cheap. She still does a discounted price for family. I would never consider not paying for her services and will usually tip (which is not common here) because I can afford the normal prices. Hell, a cut and blow-dry with her would cost me 12€ or so, in my current country it would cost me around 70€.",
                  "id": 223,
                  "comments": [
                    {
                      "score": 3,
                      "content": "This is what I do for family. I’m a professional massage therapist. I don’t do it for free but I charge them a heavily discounted rate",
                      "id": 224,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I can never understand that attitude from friends/family who expect you to do what you do to earn a living for free for them. I have a friend who recently qualified as a podiatrist and set up her own business. I needed my feet fixing so booked her. When she was done, I paid her the full amount she charges plus a tip and she tried to charge me less, then give me half the cash back. I told her, don't undervalue your work and don't charge less for friends or family. You charge that amount because of the training you have, the years of study you did, the cost of your insurances and cost of all your equipment plus you're here to make a profit. If anything, friends and family should pay more. They're the ones that should be supporting your work before anyone else!",
                  "id": 225,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "If I loved someone, I wouldn't ask them to perform at my wedding anyway... it's a *ton* of work! They should be celebrating too! At most if they'd be willing to do maybe one song later on in the evening, but an entire wedding?",
              "id": 226,
              "comments": [
                {
                  "score": 15,
                  "content": "My husband and I didn’t ask, his cousins offered to play at our wedding as a present to us. They were only playing during the ceremony, 15-30 minutes and that was a very generous gift because it’s not just that time but the many hours spent preparing.",
                  "id": 227,
                  "comments": [
                    {
                      "score": 12,
                      "content": "And this is the crux of the problem with OP's post and the Y-T-A's on this post.  It's one thing when an artist/musician OFFERS to do something for free and it's a completely different thing when it is ASKED/DEMANDED.",
                      "id": 228,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "You know what when I get married every single one of you guys that responded to me are coming to my wedding.",
              "id": 229,
              "comments": [
                {
                  "score": 3,
                  "content": "Hahha deal!!",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "My friend is a film director (he went to school for it and has done a number of commercials and short films). I asked him to film my wedding reception and asked what his going rate was. He told me I was the first of our friends to ever expect to pay him.\n\nI don't understand that. If you're going to have a videographer (or photographer) anyways, wouldn't you want to get your friend some money for it rather than some stranger?",
              "id": 231,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "You know, despite family being crappy, this is oddly beautiful! So sweet he has a friend he knows loves his craft :)",
              "id": 232,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "I like your insult, she can kick rocks, I will be using it in the future.",
          "id": 233,
          "comments": [
            {
              "score": 73,
              "content": "She honestly can, like me and my siblings sure we're assholes to one another but we're siblings. One of us spends money on the other we pay them back, you want something to eat fs I'll get it. Just because we are family doesn't mean I'll treat you lesser no matter the circumstances.",
              "id": 234,
              "comments": [
                {
                  "score": 88,
                  "content": "NTA, I’m getting married very soon. In addition to compensation for their time, our photographer and DJ both have vendor meals in their contracts which is around $30 each. That includes food but not the open bar. It was mentioned before... $2500 for an organ rental, but nothing for you? Unless you owed your sister or parents money, there’s no way you shouldn’t have been a regular guest and maybe play a song or two as a kind gesture. \n\nFYI that burger she gave you might have been free, T-Mobile has a deal with BK for a free regular or impossible whopper almost every week.",
                  "id": 235,
                  "comments": [
                    {
                      "score": 19,
                      "content": "That's exactly how it should be. It should've been something OP wanted to do not the other way around.",
                      "id": 236,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Go kick rocks with some sandals",
              "id": 237,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I hope she does take it to small claims court because the judge  would rule in the OP's favor for what happen and might even tell the sister to pay up because what she did was absolutely wrong. Also the OP's parents can go kick rocks too because it was their enabling favoritism nonsense of \"Family don't make other family pay\" that help cause that situation in the 1st place - So NTA and it clear OP doesn't need them for anything after she moves out, unlike all of them that needs her as a punching bag.",
          "id": 238,
          "comments": [
            {
              "score": 5,
              "content": "I really feel like the judge will laugh on stand, you're absolutely right every family dose have favorites and needs a single scape goat that they tend to lable as the problem child. I hope she doesn't need them ever again, and honestly OPs sister will get hers.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1032,
      "content": "So you weren't invited to the wedding until you were the organist? Your sister wanted an organ so much she spent 2500 hiring one but nothing on someone to play it? Your sister had time to go to Burger King on her wedding day? This is a weird story.",
      "id": 240,
      "comments": [
        {
          "score": 255,
          "content": "You dont think sister is lying about spending 2k on a organ rental?\n\nEvery where I look is only 250 to 500\n\nSource \nhttp://retrorentals.net/product/hammond-b-3-leslie-speaker-custom/",
          "id": 241,
          "comments": [
            {
              "score": 343,
              "content": "Or maybe OP is lying about the price to make for a better story.",
              "id": 242,
              "comments": [
                {
                  "score": 54,
                  "content": "I’m thinking this is more likely",
                  "id": 243,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "More likely. Also more likely lying about most of what's going on here.",
                  "id": 244,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Per day. The organ rental is probably at least 4 days, if not a week. There’s your $2k there. For a weekend event, it’s likely delivery on Thursday, pickup on Monday. 5 days. \n\nWe rented an organ for a church service not held in a sanctuary. These guys drove 3 hours one way to deliver the organ (because there isn’t an organ rental place on every street corner), unload it, set up the organ and speakers, voice it for the space, then drive back that distance to pick it all up. It’s a several thousand dollar instrument, so the care they have for packing that thing up is far more than just throwing it on the back of a pick-up. You need it days in advance because the organist is going to want time to practice on it and figure out all the stops and whatnot. It’s not like a piano, where you can plop down on any bench and just play.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": ">You dont think sister is lying about spending 2k on a organ rentat?\n\nMany parishes require an additional fee if you want to use their pipe organ.",
              "id": 246,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 123,
          "content": "It's obviously fake.",
          "id": 247,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "Yeah, this story is just fishy in general. I'm thinking it's fake but I don't know OP personally.\n\nWho knows.",
          "id": 248,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "I'm confused about why she even agreed to do it. If the post is real, that is",
          "id": 249,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 990,
      "content": "[removed]",
      "id": 250,
      "comments": [
        {
          "score": 390,
          "content": "Agree.  What kind of bride has time to run through a drive-through on her way to her own wedding?",
          "id": 251,
          "comments": [
            {
              "score": 21,
              "content": "Right? I had someone dash out and grab McDonalds for the wedding party (BEST DECISION EVER), but I was at the venue by 8am or so.",
              "id": 252,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I did 🤷🏻‍♀️",
              "id": 253,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "A) Digital church organs do exists, depending on which model you want it‘ll set you back the same amount as a nicely equipped Mercedes.\nB) Hammond organs do exist\nC) Small chest organs do exist \nD) Some parishes demand a rental fee if in external organist uses the organ of the church\nE) Keyboards sound crappy\nF) Many organists are rather mediocre pianists.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Also when did he ask to play? Like 2 days before the wedding, and she must have known in advance that there is no vegan buffet, so why did she only say it on the wedding night. Also if he was going to be a guest anyways then he should have been able to eat from the buffet even if he didn't play in the ceremony. This is just too weird.",
          "id": 255,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "As a pianist/organist, I agree with this. Also a sibling of a pianist/organist would have grown up with this person taking lessons their whole life in order to get to a point where they're considered professional enough to play a wedding, and would have known better than to create the scenario OP is taking about. I call BS.",
          "id": 256,
          "comments": [
            {
              "score": 5,
              "content": "Totally Agree. There’s much more than happened in this story.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This needs to be at the top lol",
          "id": 258,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Also, at this day and age, there was no vegan option at all? The $2500 rental is absolutely BS.",
          "id": 259,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}