{
  "post content": "My (17m) twin sister Emily (17f) is so fucking annoying. She's a drama queen. Always pokes her nose where it doesn't belong and doesn't respect my boundaries. I hate that I have to share so many milestones with her because she always make things about herself.\n\nEmily has a best friend Jane that she always brings over to our house. She was cute but she and I didn't talk much but one day she saw me practicing on my guitar and starting talking to me. I guess that's when she got a crush on me because she asked me out a few weeks later. We had a good relationship. I was happy and felt cared for. Emily hated it per usual because she saw me as stealing her best friend even though Jane still hung out with her a lot and asked ME out. We dated for 7-8 months until I caught her making out with a senior. That broke my heart because I loved her and thought we had something special.\n\nEmily would still bring Jane over even though she knew what happened. I talked to her about not bringing Jane over because of her betrayal. She told me I need to grow up and be a real man instead of acting like a sissy. My parents took her side as well because she should have the right to bring over whoever she wants.\n\nI am on the ping pong team at school and this semester Jack joined the team. Jack is a cool guy. We quickly became friends and he invited me to his house over a lot to play video games. Apparently Emily hates Jack because he used to make fun of her hair and her weight last year. I never saw the bullying happen but knowing Emily, she probably exaggerated the whole thing because he turned her down or something. I called him over last week to play a new video game I bought. We were playing in the living room. Emily was out but when she came back and saw him, she froze. She asked what Jack was doing here. I told her Jack is my friend and we're hanging out. She went upstairs. After Jack left, she barged into my room screaming at me for bringing someone who \"traumatized\" her into our house. I told her suck it up buttercup and real women aren't scared of their bullies. I can bring home whoever I want. She called me an asshole. I called her a bitch. My parents are mad at me for bringing Jack over but I told them if they interfere, I'm going to leave and move into my uncle's house. He hates their guts anyway and would be more than happy to take me in. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 56,
      "content": "ESH - every line i read makes every person sound worse and worse. dating your sister's best friend (you must understand how that changed their friendship??), bringing home the girl who cheated on your brother, clearly resenting your sister and doing something that hurts her instead of just talking about your feelings, bringing home a guy who bullied your sister and immediately getting defensive about it instead of trying to be understanding, victimblaming, and the parents not bothering to educate you guys on boundaries... jesus christ.",
      "id": 2,
      "comments": [
        {
          "score": -31,
          "content": "I did try to talk about my feelings. I told her I felt very uncomfortable with Jane being around. She dismissed it and so did my parents. With family like this, who needs enemies lol?",
          "id": 3,
          "comments": [
            {
              "score": 16,
              "content": "I get how you’re feeling but surely you had to know dating Jane was going to eventually complicate things and change relationships, especially since she was your sister’s friend first. It‘s kind of like how they say “don’t mix business with pleasure” - it’s not a bad idea sometimes to keep certain aspects of your life separate from one another.",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "you (from my understanding) resented her prior to the jane situation, and instead of talking to her about dialing down certain discussions when shes around you so have more peace of mind, or talking about how something she does makes you feel so and so, you continued silently harbouring more and more resentment until it all blew up. unless you actually did have a discussion with her about it, the point still stands. resenting people in silence is so much worse for all parties than trying to move past whatever is making you feel negatively.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "I like how you gave ages for you and your twin sister lol",
      "id": 6,
      "comments": [
        {
          "score": 3,
          "content": "LOL",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 21,
      "content": "ESH- she should’ve respected your wishes and not brought her friend over after knowing you had a rough history with her. But there’s a difference between a high school breakup and him clearly harassing her and ruining her confidence. You’ve got some fundamental issues with women judging how you write about them. You both handled this poorly.",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "I'd imagine Jane cheating must have ruined his confidence too? As well as gave him some sort of trust issues.",
          "id": 9,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -22,
          "content": "It was tongue in cheek. I was giving her a taste of her own medicine. She was actually happy when my ex and I broke up because she now had Jane all to herself. There were times when I was imprisoned in my room because Jane was over for hours at a time",
          "id": 10,
          "comments": [
            {
              "score": 12,
              "content": "You fighting fire with fire has a worse result than telling her you’re uncomfortable when Jane’s over and you’d rather have them hang out somewhere else. You brewing that anger and plotting revenge helps nobody and just causes more pain.",
              "id": 11,
              "comments": [
                {
                  "score": -1,
                  "content": "I did tell her how I felt. She told me I needed to grow up and act like a real man",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "People who say “tongue in cheek” are usually just trying to justify their AH behavior.",
              "id": 13,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "You guys are the worst twins ever. \n\nYou need to be each other’s allies not enemies.\n\nAlso, stop dating your sisters friends. You’re messing up her relationships, of course she’d be salty.",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "YTA she was your sister's friend before you dated her  and you didn't take into consideration what would happen if you guys broke up. Sure she is an AH for cheating on you but you would have made the same demands if the breakup was for you cheating on her or any other reason.\nThe, because you didn't get your way you invite a bully because \"oh, I didn't see the bullying so it can't be that bad and my sister is just a drama queen\".\nYou are the drama queen! So your ex cheating on you messed with your head but your sister didn't emotionally suffer when a bully called her fat and made fun of her hair? That gives someone self-esteem issues and the fat shaming can leed to eating disorders.\nA \"real man\" doesn't date his sister's friend without considering the consequences of a fall out. A \"real man\" doesn't bring a bully into the house as revenge to torment his sister! Make no mistake you didn't bring him because he is a good friend, you brought him as payback! And, a \"real man\" recognize his bad actions and apologises instead of threatening his parents for his outcast uncle as revenge because you, a spoiled bratty drama queen, can face the consequences of your own actions!\nIs your sister self centered?! Probably. She is a TEENAGER! They are supposed to be self-centered.\nSo are you btw! GROW UP!",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "[removed]",
          "id": 16,
          "comments": [
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 17,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "ESH\n\nWhy would you date your sisters best friend? Whatever happened to the bro code? Weird. It’s also weird how you have so much disdain for your twin and want her to experience something you clearly did not like to experience. Get a therapist",
      "id": 18,
      "comments": [
        {
          "score": 6,
          "content": "Dating a siblings friend is extraordinarily common? Don’t know why that’s what you focused on, that’s weird. \n\nEverything else I agree with though. Kid has some issues and should go to therapy regardless.",
          "id": 19,
          "comments": [
            {
              "score": 1,
              "content": "I only say that because of how immature they are to do that. He dated her friend and when they broke up he wasn’t comfortable being around her. That’s why the whole situation played out, I was just raised to avoid dating my sisters friends",
              "id": 20,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "ESH - the fact that your parents couldnt even let your sister know that it might be difficult for you to see someone who betrayed you. That's messed up, no one cared that this girl cheated on you?\n\nHowever, you should know how that feels. You chose revenge over empathy. It's too bad, you had a chance to be better but you chose to be petty.",
      "id": 21,
      "comments": [
        {
          "score": -4,
          "content": "It wasn't revenge. I really like hanging out with Jack.",
          "id": 22,
          "comments": [
            {
              "score": 8,
              "content": "You like that hanging out with him is an easy and pleasant way to get revenge.",
              "id": 23,
              "comments": [
                {
                  "score": 4,
                  "content": "Yup, OP is an AH, no wonder he thinks Jack is a good guy.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "At least own it, give me a break",
              "id": 25,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "Yikes.",
      "id": 26,
      "comments": [
        {
          "score": 3,
          "content": "All the way around",
          "id": 27,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "ESH, you all seem really toxic tbh, no wonder you think Jack is a good guy.",
      "id": 28,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "What a hot mess of a sibling relationship. Y'all are 17 and acting like 7 year olds. ESH. Sort yourselves out.",
      "id": 29,
      "comments": [],
      "relation": "No"
    }
  ]
}