{
  "post content": "My sister (35f) is getting married this fall. When she got engaged she asked me (30f) to be a bridesmaid approximately a year ago. Recently she gave out her bridesmaid proposal boxes and I did not receive one. I was cut out of the wedding party. I never said anything because personally I feel like it would come across selfish and if she selected people to be apart of her day then so be it. I was hurt though. \n\nA little backstory, my sister and I have history. She has done some very wicked things to me. As example she had a baby when I was 15 YO and told me if I babysat for her everyday after school she would gift me her old car on my 16th bday. Fast forward after babysitting for 6+ hours every day for a year, she sold that car and kept the money and told me to get over it. \n\nMy sister has excluded me from all wedding activities such as dress shopping etc but yet my SIL/Mom/Grandma etc have all been invited. \n\nNow back to the wedding- I recently got the invitation and scanned the QR code to go to her wedding site. Where I discovered that I was excluded from a plus one as well and cannot bring my boyfriend of 2 years. If I were to go to this wedding that I was already de-bridesmaided, I would also have to attend alone. I decided I honestly did not want to go and told my mother. She’s calling me the a hole telling me that I’m going to regret this and it’s ridiculous to not attend over some bad history and “your boyfriend not being allowed to come”. For reference it wasn’t about the plus one, it was just my final straw. \n\nAITA or am I justified in my decision?",
  "id": 1,
  "comments": [
    {
      "score": 8550,
      "content": "NTA\n\nYour sister has the right to control her guest list and bridesmaids. You have the right to not attend for any reason. Your mom is TA for trying to force you to attend.",
      "id": 2,
      "comments": [
        {
          "score": 3505,
          "content": "I smell a family with a golden child and it ain't OP",
          "id": 3,
          "comments": [
            {
              "score": 1167,
              "content": "She has their grandchild. Probably grandparents don’t want to get cut off from the kid.",
              "id": 4,
              "comments": [
                {
                  "score": 679,
                  "content": "OPs sister definitely sounds like the type of person who would use the kids as pawns.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 152,
                  "content": "If she had the child at 15 and is 35 now, the child must be 19 or 20 - too old to be cut off from the grandparents.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 405,
                      "content": "She had the child when OP was 15 so the kid is 15 since OP is 30 now.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "The op’s sister is a user. Yes, she might be mad for the moment but will get over it when she needs something.",
                  "id": 8,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1710,
          "content": "I agree. I wanted to also say, don’t get her a gift either, if she says anything you can mention that you did babysitting for a year…for free.",
          "id": 9,
          "comments": [
            {
              "score": 1325,
              "content": "And if she gets worked up about it, tell her to \"get over it\".",
              "id": 10,
              "comments": [
                {
                  "score": 167,
                  "content": "Yes.  I should have added that to my original comment lol.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 68,
                  "content": "This 100%",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "What goes  around,  comes around... every time.  Sad though,   as it will lead to family who aren't  in possession of all the facts judging  OP somewhat harshly.   \n\nOP,  I would say go to the wedding,  eat and drink, but no gift,  she already  got it with the baby sitting stunt.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 39,
                  "content": "Shit. In my book, she doesn't have to buy her a Christmas gift ever again.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Or even speak to her.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I love this.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Exactly, the bride and the mom .. can both ... \"get over it\" ..",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 448,
              "content": "Give her a card and inside it write, \"My gift to you: free babysitting for one year in 2003/2004.\"",
              "id": 18,
              "comments": [
                {
                  "score": 101,
                  "content": "Be sure to include your calculations (interest)",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "I’d try to include the 6+ hours everyday too. That’s way more than just say, an hour of babysitting occasionally throughout the year. OP, you’re a saint to have put up with her nonsense for this long.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 4,
                      "content": "This would almost definitely be one of the most expensive gifts received even without interest as the national rate for babysitting a 6 hrs a day (not to mention the extra hrs) for a year is just under 50 thousand dollars",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Ooh I like this",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 322,
              "content": "[deleted]",
              "id": 23,
              "comments": [
                {
                  "score": 77,
                  "content": "Oooh. That sends a MESSAGE!",
                  "id": 24,
                  "comments": [
                    {
                      "score": 82,
                      "content": "“It’s not about the money, it’s about sending the message”",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 70,
                  "content": "We got an ashtray as an engagement present. From his cousins. Neither of us smoke.\n\nThese are the same cousins who bought him a 200g box of chocolates from their entire family (15-20 people at a guess). 200g is about 6-7 oz for the non-metric readers. (Edit: this was a birthday gift, not a wedding gift.)",
                  "id": 26,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Wow, that's messed up....",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 40,
                  "content": "A rock in a box with a note saying \"go kick.\"",
                  "id": 28,
                  "comments": [
                    {
                      "score": 7,
                      "content": "*a handful of rocks",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "Leave the price sticker on",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "In a brand new box that shows a picture of something new, shiny, & expensive!",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Link please",
                  "id": 32,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Oohh, I love ❤️ that. A used toaster from Goodwill is the perfect gift for someone like this.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Better would be to take that toaster to an engraving place and have “get over it” engraved on the sides.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Especially if said engraving was done using keys. Even better if it somehow renders the toaster unusable.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "How about a set of plastic champagne glasses from the dollar store?",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "This is a real power move! I love it!",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 118,
              "content": "Usually I say invite = gift but in this case I would have to agree and honestly I don't think sister even wants OP there in the first place and the bridesmaid snubbing and lack of plus one were just a petty power move to ensure OP didn't attend while still giving the sister a chance at playing the victim \"but I invited her\".",
              "id": 39,
              "comments": [
                {
                  "score": 48,
                  "content": "OP might consider no contact since OP’s sister seems to be petty. OP’s sister will repeat the story of how OP didn’t attend her wedding at every family gathering and event.\n\nWhat OP might consider is playing by her own rules and bring her BF to the wedding. That would make a more interesting story. :) /s\n\nEdit: the last suggestion wasn’t a serious one. Adding a /s for clarification. \n\nBut the suggestion for NC wasn’t because of the lack of the BF invite, but for the years of potential abuse the OP would have to endure at family gatherings for not attending the wedding.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Showing up anyway with a +1 is just going to exacerbate the situation and make it easier for sis and mom to make it look like OP is being petulant. As WarGames taught us, the only winning move is not to play their dumb power games.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -9,
                      "content": "She should go NC because … she didn’t get an invite for her bf to the wedding? That’s the most ridiculous suggestion I’ve ever heard.",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 45,
                  "content": "I would almost be tempted to wait until she asks if I got her anything and say “yes, I got you a free year of babysitting” wait for her to get super excited and thank me, then hit her with a “remember?” And tell her to “get over it” when she bitches.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I skim-read that as “Get over it, bitches”, although that works too.\n\nOP, NTA.  I would go, just so your awful sister can’t lie and say “She didn’t even come to my wedding, woe is me”.  Doesn’t mean you have to stay any longer than the ceremony & meal, then excuse yourself.  And absolutely NO GIFT.\n\nIf the wedding is far away, could you and your bf stay in a hotel and make it into a mini-break? He could chill and order room service or go sightseeing while you’re at the wedding.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "This.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Omg THIS",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Nah. OP should get something expensive that she knows sis wants, take a picture, and gift sis the picture in a card that says \"I know you were excited to have this, so I sold it and kept the money.\" Even better if OP buys it off the registry so no one else gets it for sis.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Nah. Be petty. OP should find a matchbox car that looks like the one her sister promised to give her and send it along with a bill for the free babysitting.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "She should give her a small box and when it opens, it's empty except for a note: \n\n\"I gift you the car you gave me when I was 16.\"",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Please!!! I hope OP sees this. Perfect answer.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "The line I've been seeing lately is \"It's an invitation, not a summons.\"",
          "id": 51,
          "comments": [
            {
              "score": 20,
              "content": "You want to make sure I attend? I require a sacrifice",
              "id": 52,
              "comments": [
                {
                  "score": 8,
                  "content": "LOL.  Yes, a summoning requires a sacrifice.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Oooh, I like this line",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I am absolutely stealing this line!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "I really don't understand how op will regret this decision.",
          "id": 56,
          "comments": [
            {
              "score": 102,
              "content": "Very good point, what is there to regret? Sitting alone eating cake while everyone fawns over sister? Boo hoo, what a terrible thing to miss.",
              "id": 57,
              "comments": [
                {
                  "score": 32,
                  "content": "I would miss the free cake",
                  "id": 58,
                  "comments": [
                    {
                      "score": 65,
                      "content": "OP can buy herself a nice cake and stuff her face while enjoying her sister-free day with her boyfriend. Much cheaper and doesn't come with a side of family drama.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "But the cake could be a lie",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Obviously she'll regret ruining her relationship with someone who manipulates and lies to her because then how will she be manipulated and lied to? Duh! /s",
              "id": 61,
              "comments": [
                {
                  "score": 0,
                  "content": "PepperVL  .  Her family will see and hear  1/2 of the story and  judge and talk.  A wedding  is just a day,  but memories are a lifetime...",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 46,
              "content": "I think the only thing OP would regret is going!",
              "id": 63,
              "comments": [
                {
                  "score": -2,
                  "content": "Calm-quit2167\n\nHow would OP regret going for free food and drink?",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I went through this same situation.  My mother nastily screamed at me that I had to go to my sister’s expensive destination wedding I couldn’t really afford to attend.  I was told I’d regret it.  Only thing I regret is allowing myself to be bullied, spend the money and go.  Haven’t seen my sister or mother in over a decade.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 107,
          "content": "but FAMILY!!!!",
          "id": 66,
          "comments": [
            {
              "score": 74,
              "content": "WHAT WILL PEOPLE SAY???!",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Omg this☝️",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 72,
          "content": "But just do it to keep the peace! /s",
          "id": 69,
          "comments": [
            {
              "score": 47,
              "content": "Be the bigger person. /s",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Also the sister is obviously trying to get OP to uninvite herself so she doesn’t have to be the bad guy. She asks her to be bridesmaid then ejects her from the wedding party without telling her? OPs the only one without a plus one?\n\nSister got what she wanted",
          "id": 71,
          "comments": [
            {
              "score": 2,
              "content": "Eh, people will comment. Everyone will know. It’s going to backlash and be the undercurrent the whole day.",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Don't even send a gift - tell her she can buy herself one with all the money she saved not paying you for babysitting. NTA",
          "id": 73,
          "comments": [
            {
              "score": 3,
              "content": "But *do* RSVP, so she has to pay for the place setting.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "An invitation is not a summons.\n\nOne of the best bits of advice I've learnt as I've grown up.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "uhmmm sister is also TA for asking OP to be one and then changing her mind without saying shit. judging from the story, she did it on purpose too just to get OP's hopes up. so yeah, sister is TA just as much, if not way fucking more, than mom  \n\n\nshe absolutely has a right to control who her bridesmaids are and who gets a plus one, but a bait and switch? asshole. purposefully not giving your own sister a plus one when everyone else gets one? absolute fucking asshole. just because she decides who gets invited doesn't mean she isn't an asshole for deliberately doing this shit. you can be in control of your guestlist and an asshole",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2375,
      "content": "NTA but it beats me why you still had a relationship with her and especially to the point of accepting to be a bridesmaid.",
      "id": 77,
      "comments": [
        {
          "score": 1536,
          "content": "I don’t have a lot of family to begin with, and family has always been something I valued. But I feel like as I’ve gotten older, I’m starting to realize things a little bit differently.",
          "id": 78,
          "comments": [
            {
              "score": 686,
              "content": "It can definitely be something we acknowledge/accept with time. I think what is very important to consider is that you are right to value family but they also need to value you.",
              "id": 79,
              "comments": [
                {
                  "score": 177,
                  "content": "Well said. Your family is who you choose to love and surround yourself with. It doesn't always have to be biological.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Chosen family is just as good as any biological connection. Sometimes better 😊",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "the sister has cut her out of all parts of the wedding except the party where she shows up, tells sis/bride she's lovely and gives her a gift.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 155,
              "content": "If you value family, you need to recognize that family isn't just blood relatives... But who treats you with love and acceptance and wants the best for you. \n\nYour sister abused that and has shown she hasn't grown up to be any better than at 20.",
              "id": 83,
              "comments": [
                {
                  "score": 235,
                  "content": "I feel like I’ve definitely started to grow and realize it more now than ever. Tis the basis of me not wanting to go to the wedding. First time I’ve ever stepped back to actually set myself a boundary.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 137,
                      "content": "You’ve never set a boundary before, so they’re going to fight this one HARD. Don’t give in. You decide what you’re willing to put up with. You can’t control what they do, but you CAN control what you put up with and what you choose to do. NTA",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 68,
                      "content": "Remember that you are not obliged to justify your decision, or explain it, or defend it.  You are not obliged to argue with them.  The same goes for anybody who might come to you on their behalf.\n\n\"I prefer not to attend.\"\n\n\"Oh, I won't be attending.  Personal reasons.  Have a lovely time!\"\n\n\"You already asked me that and this is not a topic for discussion.\"  *subject change*\n\n\"If you can't stop bringing this up, I'll have to end this call.  Good night.\"",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Stick with your boundary OP, even when they are tearing you down for it.\nUsing the excuse of 'its family' is so toxic.  Family isn't just blood and family doesnt treat people this way.  \nRemember 'no' is a complete and justified answer.  You do not need to elaborate on why.  You do not need to attend, you do not need to send a gift.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Let them think you're going to go, to save yourself hours of arguing now. Leave the house early on the day instead and have a great day out with your boyfriend, leaving them a letter detailing why you skipped it.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Hmm...    it's just a big party... (not worth the drama of not attending)  go and enjoy,  but don't give her any gift.  She got it 15 years ago...",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "This 100%, I'm going to my brother's wedding only because my mom will get angry at me if I don't but I have almost no relationship with him except a toxic one, so I keep it to minimal contact. \n\nBut over the years I have built my family. Yes there are people who are blood related to me but they are just people. My sister, is truly someone I love, adore, and know I can rely on in any situation. I have my husband and my beautiful baby boy. Then there are my friends, like my sister, I have several close friends I have culminated who I love, adore, and know I can rely on in any situation. They are my family. \n\nI know this is hard, OP. You've been programmed to believe real family is those blood related, but it's not. It just means they have an excuse to abuse you and guilt you if you try to walk away. This is something that is hard to forget when venturing out on your own, but it is worth practicing so that you can build that real family.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "I feel like as you get older and learn what is healthy in a family (dysfunctional or not), you learn family is what you make it. You can create your own family if this is how your family is.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "I’d start thinking about CHOSEN family, OP. \n\nWhile I love my family of origin, there’s a reason I moved a flight away- I needed to extricate myself from the day to day painful things they never saw as disrespectful or hurtful to me. So now we catch up a few times a year, enjoy it, and it lets me have space and peace to take what I want and need and leave the rest from these relationships.\n\nYou can still value family! It just doesn’t have to look like a traditional family. ❤️",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Family are the people we choose to keep in our lives because our lives are better because of them and their life is better because of us. Bullies, ppl who take advantage and manipulators are never truly family, regardless of their DNA.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "I think you might benefit from a story my therapist told to me.\n\nImagine a scrubby little weed growing in a gray ditch behind a factory someplace.  There's a drainage pipe nearby.  Now and then some barely drinkable water drips out of it.  It's enough to keep the weed alive.  People come out back to smoke sometimes and flick their cigarette butts in the weed's general direction.  And sometimes they call it \"you poor damn thing, what are you doing here?\"  It's something.  The weed isn't entirely alone.\n\nSomebody walking along the access road notices the weed.  They come back with a bucket and a spade and dig it up.  The weed is terrified.  Everything familiar is being torn away!  Where is it going?  What's going to happen?\n\nThe weed finds itself replanted in a green lawn beside a clear running stream.  Everything is so strange.  There are ducks instead of trucks.  Soil instead of dust.  A neat little picket fence around it, instead of the gray rim of the ditch.  Strangers wander past.  Sometimes the weed sees people from the factory, but they never even look in the weed's direction.\n\nBut...\n\nA winter and a summer, and that weed is a springing sapling, tendrils uncurling, leaves abounding.  A few more years go by, and the weed has become a laburnum tree whose golden chains of flowers sway in the breeze.  Some sour-faced people resent it for showing by its mere existence that there is life beyond the factory.  But others come to rest in its shade, and admire its resilience.  All it needed was good water and soil, a place free from poisons and careless stamping boots.\n\nThe secret to recovery, my therapist told me, is realizing that you are the weed *and you are also the gardener.*  You can take *yourself* to a better place.  You don't have to stay where you were planted.  You may well find a place much better, where you can flourish.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Do you feel like your family values you though?",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "they don’t value you, stop wasting your time and enjoy the day in your own way",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "You sister is nor worth your time.  You deserve better op",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "They don’t seem to value you, unfortunately.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Probably because OP’s whole life revolved around her sisters selfish choices enabled by bad parenting and favouring one child over the other. It takes a lot of time to deprogrammed yourself from all of that and then realizing that you have to establish boundaries, respect and trust when up to this point- there’s been none. \n\nIt can be daunting to realize and difficult to live that reality once you’ve come to that realization. \n\nBut OP’s getting there and these comments, conversations and posting on Reddit is one of many steps she’s correctly making to inherently improve and enrich her life.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 940,
      "content": "NTA - Stay home to escape the drama and pain. Your sister is an AH-she dangles “carrots” (car, bridesmaid) in front of you then does not follow through. You’re right, the plus one is the final straw.  I’m sorry your mother accepts & enables your sister’s behavior. \n\nStay home and spend the day with your boyfriend…perhaps even a weekend away. You will not regret it!",
      "id": 100,
      "comments": [
        {
          "score": 170,
          "content": "Nahhhh if OP can, she should splash out on a dream holiday, better than the sister’s honeymoon and make sure that she frequently updates social media with pictures of her sipping cocktails out of a coconut in an amazing setting. \n\nThat’s the kinda petty I aspire to be",
          "id": 101,
          "comments": [
            {
              "score": 34,
              "content": "Facetime mom from a beach in Aruba during the reception\n\n\"Oh shit (sister)'s wedding! That was today? Aww bummer...\"\n\nEven better if you take the trip to their honeymoon destination for a little extra punch",
              "id": 102,
              "comments": [
                {
                  "score": 9,
                  "content": "No, I don't think that would go the way you're imagining. OP is 30 y/o and is just now learning how to set boundaries and not be a punching bag for her family, and her conviction is tenuous at best right now. Initiating conflict with her family will:\n\n- allow Mom, Sis, and whoever else to cry victim to the rest of the extended family. OP says family is important to her. While she's testing the idea of going LC/NC with her immediate family, being alienated from even her extended family might be too much for her. Sometimes it's nice to have just one person on your side. Mom and Sis will do their best to make sure that doesn't happen. OP shouldn't give her family any ammunition against her.\n\n- allow Mom to guilt trip OP into removing those boundaries again.  OP is in a vulnerable state right now. She's flexing her independence and starting to rebel against the status quo of her being the scapegoat in the family. Those that benefited from that dynamic will not give up quietly. \n\n- put a damper on OPs whole trip. She already feels bad enough about the current issue so much that she posted on AITA asking if she was wrong. She'll just be thinking about how her mother yelled/ screamed/ cried/ guilted/ raged/ etc at her the rest of the trip. Did she do the right thing? Should she go back? Things like that.\n\nThe worst thing someone can do to a narcissist is ignore them. I'm not sure if Mom and Sis are narcissists or just shitty people in general, but either way just ignoring them would be the best course of action. Why should they get to live rent-free in OPs head? That's not fair to OP, her mental, or her physical health.\n\nI know it sounds cathartic to be able to \"stick it to\" Mom and Sis and rub it in their faces and leave them angry and frustrated while OP lives her best life without them, but I don't think that would work out that way right now. Maybe in a couple of years. But right now, OP just needs to cut all contact and focus on putting distance from her family.\n\nEdit: adjusted the first word to \"no\" because my original wording might have counted as my vote 😂",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Damn.. thats the pettiest petty ive ever pettied",
              "id": 104,
              "comments": [
                {
                  "score": 2,
                  "content": "Richard Petty saw that comment and said he aspires to be that petty. Love it!",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I think this is a great idea. Get away, so come place  to relax. Unplug, but post the photos later. I’d put my phone on airplane mode and not even bother to respond or reach out to family the entire time.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 567,
      "content": "NTA. She will regret it when you finally go Nc with her. Tell her you’ll come to her next one.",
      "id": 107,
      "comments": [
        {
          "score": 54,
          "content": "Amen to what you said",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Off topic but my husband once told a friend he will go to her next wedding because she cheated on her ex with a married man. The guy then left her after 3 kids so, there may actually be a next one after all.",
          "id": 109,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "Oh snap!",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 414,
      "content": "NTA.  I bet you're not even at the family table. Golden child probably won't even notice you're not there and mom is pissed because she lost her clean up crew.\n\nGo on a romantic date with your SO.",
      "id": 111,
      "comments": [
        {
          "score": 154,
          "content": "I'm guessing mom only wants OP there to keep up the happy family facade. And yes, probably the go-for and clean up crew for the day. Now who will do all the extra work for free?",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "I think golden child will notice. It’s one of a long line of things she’s done to make OP feel less-than. Sister is a bully, I totally agree OP should just nope out of this whole thing.",
          "id": 113,
          "comments": [
            {
              "score": 34,
              "content": "Yup. That sister wanted to hurt OP. Many times over. This game is only “won” when OP stops playing. \n\nMy favorite saying is it takes 2 to dance the dance of dysfunction.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 302,
      "content": "NTA\n\nFrankly, if it was just over the lack of a plus one I wouldn't fault you either. Pretty standard that un-married adult party guests are given a plus one, particularly if they are in a long term relationship already.",
      "id": 115,
      "comments": [
        {
          "score": 139,
          "content": "I mean, OP is 30! This isn’t a teenager in a 2 month relationship. This really is insulting and I’d be upset too.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -78,
          "content": "YOU are TA for thinking that. People can exclude plus ones if they want. Weddings are expensive and there's no obligation to pay for some random person you barely know. If both people were close with the couple, they'd have both received an invitation. How entitled or codependent do you have to be to get upset about not being able to bring your SO to ONE event that isn't even about you?",
          "id": 117,
          "comments": [
            {
              "score": 49,
              "content": "Holy shit gaslight more.\n\nIf my sister didn't allow my GF of three years to come to her wedding I'd be pretty upset. \n\nOn top of all the other blantant manipulation? OP is a saint for even considering attending\n\nIt's not entitled to expect to bring a long term partner to your sister's wedding it's fucking expected.\n\nI've attended three weddings this year, none with more than 50-75 people. I haven't seen two of three couples in 2-3 years. I had a plus one. The $25 catering plate for you siblings SO isn't gonna break the bank.\n\nYTA not OP",
              "id": 118,
              "comments": [
                {
                  "score": 15,
                  "content": "On a side note, one of my cousins had a wedding where the plates were $350 each. Insanity.  She deliberately chose this for fancy shamacy status versus family… totally her pejorative. But we have a huge family, so she had tiered invites- plus ones and “kids” (24-18 year old cousins) could come after dinner for dancing. In theory whatever, her wedding, buuut I had been helping elders get seated at their tables so when I got to mine, there was no seat!!!!!!!! I went to make sure I had the right table number and there were about 3 other people doing the same. Wedding planner was having a fit bc people brought their plus ones and adult kids in revolt. They new couple was being introduced and I had to squat at the table while we waited for a chair/table setting to be squished in. And the plus one crashed at my table was so smug. Not even my wedding (and I didn’t agree with the lack of the plus ones on the first place) and I wanted to dump pasta on their head or something.   \nSorry. Back to OP- NTA go on a lovely date night with your partner and don’t think twice about not going!! Self preservation is clutch",
                  "id": 119,
                  "comments": [
                    {
                      "score": 13,
                      "content": "$350 a plate?!?!? \n\nWas their wedding catered by fucking Gordon Ramsay himself?\n\nThat's absurd.... Did the plus one who wasn't supposed to be there get a plate?",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -3,
                  "content": "It's common to allow plus ones but not required. Same with including relatives and children. The couple can do whatever the hell they want. Yes it's entitled AF to think any couple is OBLIGATED to invite certain people to their own wedding.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "idk I feel like it’s different when it’s immediate family?  I’ve been invited to birthday parties for boyfriend’s sisters when we’ve only been dating a few months. if this were just a friend then sure but op’s bf is closer to a brother in law",
              "id": 122,
              "comments": [
                {
                  "score": -18,
                  "content": "Why does it matter if it's immediate family? Not everyone is close with their family, and these sisters are clearly not close. Sounds like they had plenty of problems long before this, so she's far from \"automatic guest list with plus one\" status. And if she WAS close enough for that, then their relationship is also important enough that she should suck it up and respect her sister's wishes about how she wants her own wedding. Can't have it both ways.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Because its expected?? Older couples in long term relationships tend to attend events like this together, and its expected that immediate family in long term relationships will bring their partners. Its not entitled, its the way things are.\n\nThe only exception would be if it was a small wedding and literally NO ONE got a plus one, which I highly doubt is the case here.",
              "id": 124,
              "comments": [
                {
                  "score": 7,
                  "content": "Even at small weddings (like my own,) you typically give plus ones. Really it ends up being very few additional people. Most of your older family is likely married, many of your friends you'll already be friends with their partners and invite them by name. We had a handful of plus one invites, maybe 3 of those people actually used it.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That's nice, however I think we might be thinking differently in terms of small wedding. Yours seems to be more intimate family and very close friends type of small wedding, I'm thinking more along the line of *intricately* small weddings or shotgun weddings. Like ones with, maybe, 5 attendees maximum (bride and groom, 1 witness each, and the officiant), in which case as I said literally *no one* would get a plus one.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "\"It's the way things are done\" has never been a good reason for anything and pretty much gives you away",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "It's co-dependent to want to bring a partner of 2 years to your sister's wedding?",
              "id": 128,
              "comments": [
                {
                  "score": -11,
                  "content": "You can want it but to feel entitled to it? There can be plenty of reasons the sister might not want the boyfriend there. Maybe the family doesn't like him. Maybe their relationship is super rocky. Maybe she's a serial monogamist who goes through a \"serious\" two year relationship EVERY two years. Or maybe the couple getting married just doesn't want to spend the extra $50 per person on EVERYONE'S random guests. Whatever the reason, the sister's wedding isn't about her. She'll be fine spending ONE NIGHT without her boyfriend. If you think that sounds crazy then yes you're codependent AF.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 14,
                      "content": "And maybe YTA.",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "It is pretty rude. \nI am still kind of annoyed at my cousin for inviting me to his wedding but not my husband (boyfriend at the time). We were all admittedly really young, but we had been together for five years at that point, had been living together for four, and had a three year old daughter together.  \n\nI feel like inviting only one half of an unmarried couple is unrealistic given how modern relationship are, as well as incredibly judgemental.   \n\nAnyway, guess who is now divorced and who is still happily with her partner?",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Let's celebrate love by excluding the people whom your loved ones love! /s",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 251,
      "content": "NTA. Your mother isn't being very understanding and I'm sorry for that.\n\nThat you don't even get a +1 is interesting, especially being the sister of the bride.  Adding that on top of being unceremoniously bumped from the wedding party and being excluded from all wedding activities, I'd consider not going too. That's a whole box of \"slights\" you didn't sign up for.\n\nIf anyone is going to regret this situation, it will be your mother and sister who will have the dubious duty of explaining your absence.",
      "id": 133,
      "comments": [
        {
          "score": 81,
          "content": "You should tell your mom it’s pretty clear your sister doesn’t want you there. She’s doing everything possible to make you know you’re not welcome…changing her mind about having you as a bridesmaid with zero explanation or apology, excluding you from dress shopping, not including your boyfriend. Say, “Mom, clearly she doesn’t want to have anything to do with me and I’m assuming she just feels like she has to invite me for the sake of appearances. I’m just doing her a kindness by taking the hint without her having to say it out loud.”",
          "id": 134,
          "comments": [
            {
              "score": 37,
              "content": "And honestly, your mom should be standing up for you! I’ve read of other brides treating their siblings like dirt and the parents step in and say, “Stop this nonsense or we’re not contributing to the wedding!”\nTypically works like magic.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Bumped and finding out by being frozen out of all the events. Sister didn’t even tell her.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Not having to go dress shopping or plan a bridal shower sounds like a gift, not a slight. However, I'd be pissed at the no plus one also.",
          "id": 137,
          "comments": [
            {
              "score": 0,
              "content": "You know.... it just occurred  to me...  OP could bring her BF anyway.... and just say she assumed the missing +1 was just a mistake.",
              "id": 138,
              "comments": [
                {
                  "score": 3,
                  "content": "I'm not sure that's the right way to go either. I'm amazed at the number of people two weeks away from my wedding that are asking if they can bring a plus one or suddenly saying they are coming but never returned an rsvp. Like sure you all can come but I don't guarantee you food at this point.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Awww - does no one else genuinely enjoy being there for their friends/family for that type of thing? I love seeing my loved ones happy and excited and sharing life milestones with them!",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "[deleted]",
          "id": 141,
          "comments": [
            {
              "score": 2,
              "content": "exactly.  If the wedding is in town or close by I might attend the ceremony, attend about 1/2 hour of the reception, enough to greet aunts/uncles/grandparents briefly, and arrange to have a friend call with an \"emergency.\"  Or, I would just slide out w/out fanfare - duties attended to, light and polite, no room for criticism.",
              "id": 142,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "They will lie about her absecence or just chop it up to you know sister, we always odd man out.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 159,
      "content": "Romantic weekend with your boyfriend….\n\nPlease don’t allow people to treat you in this toxic way with the excuse of it’s for family or that’s what family does.  Set boundaries and follow them make people follow them and include your mother on that list since she seems from this post your sister comes first regardless of your feelings   NTA",
      "id": 144,
      "comments": [
        {
          "score": 95,
          "content": "This is what I will do ❤️ thank you",
          "id": 145,
          "comments": [
            {
              "score": 9,
              "content": "Go somewhere. Put your phone on airplane mode to save yourself the headache of family calling and texting while you aren’t there, that way you can really enjoy the vacation.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This was my thought exactly.  Last minute vacation somewhere lovely and come back with all the pictures.  If the family asks why you weren't there say simply \"I wanted to spend time with a person who loves me.  I hope you enjoyed your wedding\".  Hard stop.  Repeat it over and over if they ask again.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 157,
      "content": "NTA.  Assuming you’re not leaving anything out your sister sounds like the A, to the extent I’m surprised you’d ever want to go, or be a bridesmaid.",
      "id": 148,
      "comments": [
        {
          "score": 180,
          "content": "We’ve def had ups and downs. As my boyfriend has stated, I tend to let people walk all over me. This one just had me puzzled because weddings are a moment to celebrate and I wasn’t sure if I was being overly sensitive or not.",
          "id": 149,
          "comments": [
            {
              "score": 80,
              "content": "You’re not. I’d be crushed, however poor the relationship, that I was asked, and then figuring out by how I wasn’t included, that I was un-asked.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "I don't know your family dynamics but if she's denied you bringing anyone it's probably so she can laud it over you \"look at me married and happy whilst sad pathetic sister sits in the corner single, where's your plus 1 sister of the bride?? Sad and lonely at 30\" \n\nDon't go and give her the satisfaction and definitely don't invite to your own wedding. If you have to just explain to your mum you don't feel comfortable going without your boyfriend when everyone else is permitted a plus 1 and then ignore them. I distanced myself from my family and now live far enough away that I can miss out important life events like marriages and babies and my life is much better for it.\n\nNTA",
              "id": 151,
              "comments": [
                {
                  "score": 16,
                  "content": "> If you have to just explain to your mum...\n\nNo, OP, you don't need to explain anything to anybody.  It just gives people the chance to JADE you.  \"I decided not to\" is as much of an explanation as you need to give anyone.  You don't need to Justify, Argue, Defend or Explain anything.  If they try to maneuver you into doing so by repeatedly goading you to explain yourself, they are just being manipulative.  Don't fall for it.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 2,
                      "content": "They don’t *have* to explain their decision to their mum, but they may well want to, assuming they care about that relationship and that their mum isn’t as much an A as their sister apparently is.  There isn’t necessarily anything wrong with explaining our decisions to our loved one to help them understand us and the situation we’re in.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 155,
      "content": "NTA. It kinda seems like she was trying to set you up. Either making you the bad guy by not coming,  getting upset about being excluded, or by trying to embarrass you if you went.",
      "id": 154,
      "comments": [
        {
          "score": 134,
          "content": "This is the exact words my bf said and my bestfriend",
          "id": 155,
          "comments": [
            {
              "score": 47,
              "content": "Probably best to not go and limit contact with those that judge you negatively for it. Especially,  if they are aware of her past treatment of you and how she had treated you throughout this situation. I hope things improve",
              "id": 156,
              "comments": [
                {
                  "score": 2,
                  "content": "She wants to stay in touch with her nieces though. I would say to go, don't give sis a reaction, leave earlyish.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Go, and don't give her a gift aside from the cheapest-looking dollar store greeting card you can find. Don't write a personal message, just write \"Congrats - OP\"",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Or just accept that she won't be able to do so anymore since ot means being in touch with the person who has mistreatment her over the years.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Sounds like your boyfriend is already being a better family for you than your family",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "If you really want to make a dig at her, tell you can't come because your goldfish is a drowning risk and you need to make sure you can lifeguard for them.",
              "id": 161,
              "comments": [
                {
                  "score": 2,
                  "content": "Vesper ...  😆  just when i though I heard it all. Lol",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Pleaseee update us after wedding happens",
              "id": 163,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "If this happens.  Send those relatives/guests this post.  This is all the explaining you need to cover your own butt.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}