{
  "post content": "Last night my bf & I were really tired after long days. He wanted to get cheeseburgers, so we did, and I said I wasn’t very hungry but wanted some fries & could we get a large to share? He said that would be fine. \n\nI ended up recognizing that I was hungrier than I thought & got a cheeseburger for myself. I asked him if he still wanted to do the large fry to share and he said yes. \n\nOn the way home, he was going to town on them, about 2 miles away from the restaurant and less than a mile away from my house, I reached into the bag to eat a fry and there were barely any left. Maybe 10 fries in the container. Including what was in the bottom of the bag (which was unknown to both of us at the time) there were about 1/4 of the fries left.\n\nI instantly became upset, and said something like “you ate all the fries, wtf” & I feel angry, and kind of withdraw into myself a bit, trying to calm down but obviously very angry. He says “sorry, I’m really bad about waiting to eat”. I say, “that’s so rude. You knew I wanted some.“ He says “I’m sorry I didn’t know you wanted that many”. He grows silent & we get home & I’m not letting it go. I am want a real apology & acknowledgement for my feelings out of the deal (which is starting to feel like pulling teeth). I’m getting excuses, mixed in with maybe 1 or 2 “I’m sorry’s”. We end up settling on “I thought a quarter of the fries would be enough since you said you didn’t want many”, but that didn’t feel honest since there was less than a quarter left in the container & we didn’t even know there were any in the bag.\n\nAITA for being upset at my bf for eating almost all the fries and not accepting his defense immediately instead of a complete apology?\n\nEdit: Therapy can’t compare to hundreds of people on the internet telling you “you suck”. I want to say thanks to everyone who has shared their opinion. I truly am here to gain perspective and make changes for myself to improve my relationship, and those things seem clearer to me now. This post is bigger than I expected, and I want to keep going through comments for any new information that might help me or questions that pop out, but I think I’ve gotten most of what I needed & am grateful. I think I owe my boyfriend a heartfelt apology for how I handled things.",
  "id": 1,
  "comments": [
    {
      "score": 3544,
      "content": "When will people learn this lesson? Order more fries than you think you need because smelling them is going to turn people into potato devouring gremlins.\n\nESH",
      "id": 2,
      "comments": [
        {
          "score": 702,
          "content": ">When will people learn this lesson? Order more fries than you think you need because smelling them is going to turn people into potato devouring gremlins.\n\nA life lesson we all need. Thank you.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 253,
          "content": "You can never really have too many fries",
          "id": 4,
          "comments": [
            {
              "score": 123,
              "content": "[deleted]",
              "id": 5,
              "comments": [
                {
                  "score": 69,
                  "content": "An omelette with french fries??",
                  "id": 6,
                  "comments": [
                    {
                      "score": 43,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": "Not something I have done, but I could total see cutting them up and turning them into hash browns, which is definitely a breakfast win for me.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Damn, that’s genius. I bow to your culinary mastery.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 14,
                      "content": "[deleted]",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Oh you mad mad *genius*…",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "It's also a Pittsburgh PA thing to add them into sandwiches.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Oooooooh fry, egg, and cheese tacos 🥰",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "I just air fry them",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Or put it in a tortilla with scrambled eggs for a breakfast taco.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "My french fry motto is \"never leave a man behind,\" and do not ask me if you can have some, the answer is no.\n\nI'm over 40 and *just* started sharing fries (dumping all 3 medium sized fries into the middle of the tray) with my parents when we drive to vacation every year. (Yes I'm over 40 and go on vacation with my parents.)",
          "id": 16,
          "comments": [
            {
              "score": 23,
              "content": "I also go away with my parents and I'm 56! Off to Filey with my dog in October, can't wait! Thankfully, my parents are too old to appreciate the French fry so they're all mine!!!",
              "id": 17,
              "comments": [
                {
                  "score": 15,
                  "content": "Awwww you guys are SOOOO blessed. I wish my mom was still on Earth so we could vacation together…",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Filey is beautiful",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Lucky, my parents will take my sister and nephews on trips, but I am their designated dog-sitter (I am at their mercy because they are so kind to put a roof over my head . . . It’s complicated) But yeah, they leave me behind every time.",
              "id": 20,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 56,
          "content": "thats why you order a large for the meal and then a small for the ride home!",
          "id": 21,
          "comments": [
            {
              "score": 9,
              "content": "Are you my dad? His one rule regarding a specific burger place in NY.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -8,
              "content": "Please tell me this is a joke? A large is already too many fries for one person, and like, 1/4 your daily caloric needs. Eating the fries in the first place already is the splurge, right? Eating an extra serving the size a small child would consume seems like that might not be good for either health or waistlines, right?",
              "id": 23,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "Tbh, this is a really crappy take. If he knew he was so hungry that he probably wanted more than half of the large fries, he shouldn’t have said he would share. OP is an AH because they…. [check’s notes] can’t read his mind or predict the future?? It’s not normal to eat all the fries just because *you’re* hungry",
          "id": 24,
          "comments": [
            {
              "score": 28,
              "content": ".",
              "id": 25,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "When someone asks \"Are there any fries left.\" The answer is, \"Fries? What fries?\"",
          "id": 26,
          "comments": [
            {
              "score": 7,
              "content": "Another good one  \n\"Are there any fries left.\" The answer is, \"IDK, did you eat all of yours?\"",
              "id": 27,
              "comments": [
                {
                  "score": 0,
                  "content": "Or \"you want see foods?\"",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This sounds like they were at 5 guys.  It's notorious for putting in extra already.",
          "id": 29,
          "comments": [
            {
              "score": 26,
              "content": "if they were at 5 guys there would be no issue...a large is enough for like 4 people",
              "id": 30,
              "comments": [
                {
                  "score": 11,
                  "content": "You say this, but my mom has done this exact thing. \"Just want some fries and no burger\".  She scared down 90% of the large fries as dad and I were munching on our burgers.   We weren't even half done when she had finished them, and she proceeded to eat the other half of my dad's burger.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 3,
                      "content": "We have the same mother!",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Same w/ chips and salsa.  Pre-warn server: keep 'em coming.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Agreed!! Also if there will be food sharing, I always keep the bag closed! No hands reaching in on the way home from anybody!",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This... =P\n\nhttps://www.youtube.com/watch?v=zQUO39j\\_c\\_k",
          "id": 35,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1199,
      "content": "ESH. He said sorry, no need to continue a fight. If it's such a pattern then that's on you to wise up and not suggest sharing.",
      "id": 36,
      "comments": [
        {
          "score": 245,
          "content": "Yeah, OP would've been fine, but they just kept pushing and pushing after he apologized several times.\n\nThe irony is that OP is upset because he didn't say the right things in the apology, but OP themselves couldn't communicate what they wanted to hear either.\n\nESH all around.",
          "id": 37,
          "comments": [
            {
              "score": -9,
              "content": "Op would have Ben fine if they ordered their own.\n\n\nThey the aashole",
              "id": 38,
              "comments": [
                {
                  "score": 17,
                  "content": ">Op would have Ben fine if they ordered their own.\n\n>They the aashole\n\nThis is why you don't reddit while drinking.",
                  "id": 39,
                  "comments": [
                    {
                      "score": -23,
                      "content": "Burn.\n\nMaybe you should quit drinking.",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 703,
      "content": "[removed]",
      "id": 41,
      "comments": [
        {
          "score": 70,
          "content": "This is the way. If you ordered two fries & he ate his & part of yours, he would be TAH. But, you ordered one fry & he did leave you some to eat.\nNTA. Order your own in the future.",
          "id": 42,
          "comments": [
            {
              "score": 51,
              "content": "Well, although I agree that they should’ve ordered separate fries and making the post itself was a bit dumb, it’s pretty common courtesy that if you’re sharing something, it’s halfsies, unless otherwise determined before hand. He was definitely an AH for eating more than half. The “I’m not very hungry” applies to the “I don’t want that much to eat so I won’t order a burger, but I’d like to split fries”. Also, it seems as though she communicated she was hungrier than previously established because she ordered a burger, then asked “did you still want to share fries”, which tells me chances are she causally mentioned “oh, maybe I am hungrier than I thought. I’ll get a burger too”.\n\nSo, while yes both points are true, it’s literally just common courtesy to eat half if you’re sharing. If you’re unsure of how much someone wants, you eat half and wait for them to finish. If they eat them all, great. I’d they don’t, more for you.\n\nPlus, who eats nearly an entire large fry (I’m assuming McDonald’s or another FF chain) on the way home? I live 15 miles from any decent FF chain and I still wait until I get home regardless of how hungry. Just a general cleanliness thing *and* they’re sharing, kinda hard to dictate how much you should eat when one of you is driving.\n\nMy dad was much like OPs boyfriend. I doubt it’s a one time thing. It was annoying then, it’s annoying now. They set rules, he couldn’t follow them. Post is still stupid as it’s over fries, but I’m just saying, dude is still a dick.",
              "id": 43,
              "comments": [
                {
                  "score": 21,
                  "content": ">Plus, who eats nearly an entire large fry (I’m assuming McDonald’s or another FF chain) on the way home?\n\nFries have an extremely short half life. They're best consumed ASAP, before they become cold, sad, and hard.",
                  "id": 44,
                  "comments": [
                    {
                      "score": -5,
                      "content": "A few, maybe, but again, I live *15 miles* away, not 15 minutes, miles. I’ve been eating FF for 22 years. Maybe not super often, as I care about my health, but I do know the shelf life of fries.\n\nRegardless, I couldn’t imagine inhaling a nearly entire large fry. That’s just ridiculous. Disagree if you want, but if I can survive 15 miles + parking, walking in, changing into pjs, picking a show, then eating and it’s still nice and hot, I do believe OPs boyfriend can survive not eating 3/4 of a fry. That’s just so much.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "So OPs bf made it clear he was getting a medium fries (if they weren’t sharing a large), to me that establishes BF wanted the equivalent amount of fries to a medium fries (which is more than half a large), so a disproportionate distribute of fries was pre established.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Then why offer to share? Sharing to me isn’t eating 90% and leaving just a few. THAT is the problem.\n\nPlus, she even said (not a direct quote) “I’m hungrier than I thought so I’m going to get a burger too. **do you still want to share?**”. He said yes. So? I dunno man, if you asked me to share a large fry, I’d assume you mean halfsies, I’d eat halfsies, and wait to see if you finish. \n\nI mean no anger/disrespect, I’m simply playing devils advocate. Of course, I do think he’s an AH, but it’s like a “bruh” moment. It isn’t that big of a deal, but I do feel pointing out that’s it’s normal, and acceptable, to assume sharing = half unless otherwise determined.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "This. At McDonald’s 75% of a large fry is equal to a medium. Including the fries in the bag, he left 25%.  If my husband was ordering a medium and I asked him to get a large, he also would think I meant some not half.  Next time OP be clear on what you mean by split.  He did split them, just not the % you had in mind.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Agreed. While I understand the ESH points, I feel more bad for OP as they got screwed over simply because BF couldn't wait and was greedy and they weren't the one driving. \n\nOP even realized they were more hungry than they first thought and didn't wait until the food was ordered and then dibs more fries because of it or anything like that.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Ultimately what made me decide to weigh in on my opinion was the fact that she clearly communicated her wants and needs.\n\nShe said she wasn’t super hungry, asked if they could share fries. No problem there. Upon getting to said FF chain, she realized she was more hungry than previously established. Right, fair. So, she told him (I’m assuming) that, so she ordered a burger. Now, even if she didn’t tell him, how could he not have noticed? Anyone in my family or my GF would’ve noticed, and would’ve said “I thought you said you weren’t hungry”. If that wasn’t enough to sway the “but did OP actually communicate”, she further asks if he would still like to share. So, at this point, they had to have had a conversation about OP changing her mind.\n\nThis, to me, is what made him an AH. My GF has said “I’m not super hungry, can I just have a few fries(a handful for her)” but later is actually very hungry and eats more than intended. She still leaves me half and fixes something else for herself. She’ll still ask and say “hey, I’m sorry, I was hungrier than I thought. Can I just have 1/4 or half?”. She knew we agreed on a predetermined amount (normally if we just say “share” it’s half and half) and wanted more than her handful, so she did the courteous and respectful thing and asked. \n\nThat’s really my only gripe. The fact that, after telling him (it would be the same argument if the roles were reversed, too) she was hungrier than originally thought, and asked again if he was sure he wanted to share, he still ate most of them. To me, it would just annoy the absolute hell out of me. Yet, people blame Op for not communicating. To me, she communicated plenty, he just didn’t care or wasn’t paying attention.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -3,
                  "content": "That’s a lot of daddy issues to project onto a guy who accidentally ate more than half of a shared order of fries",
                  "id": 51,
                  "comments": [
                    {
                      "score": 6,
                      "content": "More like devils advocate. That’s really all it is.\n\nIt’s common courtesy, plain and simple. My mom always shares her food with me. I’m always allowed and she never finishes her food. I always ask. If she has leftover pizza she always lets me have 1-2 slices. I always ask. There hasn’t been a single time where, upon asking, she says no. She even says “you know you can” like, yea, but it’s basic respect to ask.\n\nPlus, I read her replies to other comments. Paints a more complete picture.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "A vote of “NTA” means he is the asshole. Maybe you mean NAH?",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "He left her 10 fries. That's not \"leaving some,\" that's mindlessly pounding most of the food and not caring there isn't any left for his partner.\n\nI've split food with people plenty of times and never had an issue. It's not difficult to care other people get their fair share.",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -1,
              "content": "You mean, YTA, don’t you?",
              "id": 55,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Seriously. Who the hell splits fries?",
          "id": 56,
          "comments": [
            {
              "score": 21,
              "content": "Maniacs, that's who. Red flag for anyone to suggest it really 😂🚩",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">Who the hell splits fries?\n\nYou can split Five Guys fries. The first time my husband and I went, we ordered a large each and ended up with enough fried potatoes for a family of ten. A hungry family of ten.",
              "id": 58,
              "comments": [
                {
                  "score": 2,
                  "content": "I did this the first time I ever went to Five Guys, got a large for two people.  It's like a trash bag sized portion of fries lol.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -3,
          "content": "[removed]",
          "id": 60,
          "comments": [
            {
              "score": 6,
              "content": "In that case, you're nta and should get out ASAP. If you said no twice and needed you to freak out before stopping, he is not a good person.\n\nLegit, run and don't look back. He's not gonna get better, only worse.",
              "id": 61,
              "comments": [
                {
                  "score": -19,
                  "content": "We’re going to take some time before we talk. I want to believe him that he was too in the moment to have heard me. At the end of it, he finally conceded to validating my experience. We were trying something he wanted & he was super into it & I was enjoying it besides this one specific thing, which was just 1 step further than i wanted to go. He really is a good person. I’m trying to make sense of things. We’re on our last leg though because it’s so difficult to just get an apology without first having to cater and validate him repeatedly anytime there is conflict. It’s definitely a maturity issue. We’re both trying and wanting to make changes, and are recently off a 6 month break. Not sure I’m ready to call it, or if I should bear with him for the changes. There has been improvement, but it’s hard.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I really don't recommend it, stay safe.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Sounds like the argument wasn’t about the fries, that was just the catalyst. \n\nIt may be time to really consider if you feel safe and respected within this relationship or not.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "When someone shows you who they are, believe them",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 587,
      "content": "INFO: this isn’t just about fries, is it?  \nThere’s more going on here I think",
      "id": 66,
      "comments": [
        {
          "score": 384,
          "content": "Yea. Things have been hard. There’s a lot more, but I’m trying to accept him & be patient with changes & make those same changes myself. We are just coming back together after a 6 month separation. We broke up because I never feel heard or validated. Things were really one sided for a long time. We both want to be better people, and want the relationship to work, but both have opposing traumas that cause us to do things that trigger the other. It s hard to ever get an apology, but I know he’s trying. Sometimes it’s too much though. I need to learn to take space & not drill things for resolve. He needs to learn to verbalize understanding & that validating emotions doesn’t mean agreeing. We’re trying.",
          "id": 67,
          "comments": [
            {
              "score": 300,
              "content": "Its not about the fries really, is it? 😔",
              "id": 68,
              "comments": [
                {
                  "score": 177,
                  "content": "It’s not about the fries Or the Iranian yogurt",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 51,
                  "content": "Its never just the ____.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 242,
              "content": "You don’t have to try to make the relationship work. You can be on your own. Sounds like that would be better than trying to force someone to respect you when you two don’t seem to be able to create an relationship based on mutual respect. \n\nRemember, if only one of your relationships works in life, that’s a pretty good track record. If you hold on to a relationship that clearly isn’t working any more, you’re just wasting your time and frustrating yourself.",
              "id": 71,
              "comments": [
                {
                  "score": 69,
                  "content": "I agree, I never understand people who try so hard to make EVERY relationship they’re in work even when it’s obvious that it just…doesn’t work. Majority of our relationships won’t work out, and that’s okay. All of that leads to you hopefully finding someone it truly does work with, and when it happens you won’t have to try so hard to make it work.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Exactly! I turn 40 this year and will be celebrating 10 years of marriage. Before we met, neither of us had had a relationship longer than four months. Why? Because we each had pretty good bullshit detectors that would sort out people we didn’t match with. Once we were together for seven months, I could it was time to go ring shopping.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 56,
              "content": "Look, I get why you want a better apology. He apologized but kept justifying himself with his logic. People who aren’t feeling actively malicious have a hard time believing they are wrong; self-justification is very strong!\n\nI also get why people are saying you are exhausting. Your trust with him is so fragile that this is a far bigger deal than it should be. \n\nSit down with him and say you are sorry for berating him about this mistake. You both made mistakes and acknowledge that. You both can do better. \n\nThe discussion around “intention” and the “why” for these mistakes only factors in to your plan for preventing the mistake in the future. For example, he doesn’t get to decide that you get less percent of something you are sharing. If he is having impulse control issues, plan around it (get more fries). And for you, if you get triggered by something he does that makes you feel like he doesn’t care about your feelings, you instead will tell him that. This will give you two an honest starting point to fix the problem instead of justifying it. \n\nMake a plan for fighting in the future, and follow it. \nYou two need to talk about how your fear that he doesn’t care about your needs and feelings is making it harder to get back together. How are you going to navigate that? Maybe therapy?\n\nRemember, you are a team and these are “us” problems. Good luck.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "[removed]",
              "id": 75,
              "comments": [
                {
                  "score": 8,
                  "content": "https://www.thestranger.com/savage-love/2018/02/20/25837088/savage-love-letter-of-the-day-dtmfa-dtmfa-dtmfa",
                  "id": 76,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I’m so glad he continues to use “Santorum” in his column.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Therapist here. Validation works like a charm. It is a great tool to learn about and use with people in distress. It can be so frustrating when you are trying to teach someone a great/easy tool to use and they are reluctant to it. Validation can be problematic because people refuse to use it because it could mean you are supporting problematic thought processes. That isn't really how it works if you use it correctly though. It isn't saying \"you're right\" it is saying, \"I know you are in pain and its okay that you are\". This sounds frustrating and painful. Don't settle for less than you deserve out of a relationship.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Sending hugs your way, OP. Ignore the people throwing insults at you for how you reacted. It's normal to be stressed after a long day and it seemed this just pushed you over the edge, and you were obviously hungry. Me and my husband are such grumps when we're hungry, so we keep each other fed. When we get fast food, if the passenger wants to eat fries on the way home, then they feed the driver too. Eat a fry feed a fry. Have you considered both couples and separate therapy? You may both benefit a great deal from having a therapist to help you two work through your traumas and learn how to love each other without triggering each other as much. NAH, while he should have known better than to eat most of the fries, it sounds like you both are going through some things. Take care, I hope your situation improves and you're able to be with the love of your life.",
              "id": 79,
              "comments": [
                {
                  "score": 9,
                  "content": "Thanks, I really love him so much & it was kind of dumb.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -12,
                  "content": "She pushed to share fries saying she wasn’t that hungry THEN changed her mind on what she communicated. Did we not read the same story ??!?",
                  "id": 81,
                  "comments": [
                    {
                      "score": 8,
                      "content": "We did, but you clearly didn't understand it. Re-read it or go be rude to someone else for your lack of reading comprehension. She didn't change her mind, she asked him if he still wanted to share the large fries.",
                      "id": 82,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Sometimes you can love someone from a distance. If you two are incompatible, that's ok. Be kind to each other and separating is ok. NTA.\n\nI wouldn't settle for a half-assed apology on missing fries either! But next time maybe go back for more fries?",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Eating all the fries while you are driving seems only mildly inconsiderate but could possibly be a piece of a larger pattern where one partner sees their needs as being more important than the needs of others. Also, not being able to give a real apology isnt great, but if the whole conversation has devolved into chaos its also potentially understandable. Let me ask you this, how would he have responded if you ate all the fries? Does he feel entitled to take more than he gives in the relationship? Is he capable of giving real apologies and validating your feelings on the non fry related big stuff? You need to get to the bottom of why this was triggering for you.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Sometimes when we eat a lot of shit over a long time it comes back up again. You keep going against your gut/better instincts under the motto of acceptance and patience, but your brain is noticing that you keep putting yourself deeper into a bad situation so it jumped at the chance to be mad about something small and safe. He might not be a bad person, he might even be trying, and that can still be too little and too late for you to build upon.",
              "id": 86,
              "comments": [
                {
                  "score": 1,
                  "content": "Not necessarily, I don’t think. I have some serious trauma trying to gain control of the show here and it’s something I have to work against. I don’t think it’s my better instinct, I think it’s my brain being highly sensitive and critical of the person who I love the most which I linked to some pretty deranged shit that I am actively working on healing.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Ok so I’m clearly late to this post OP but I’m worried about you. I can’t read the entirety of your comment that got deleted but judging from what I can still read/from context clues from other comments, your bf didn’t respect your sexual boundaries and argued with you over whether what he did was actually wrong?!?Please feel free to correct me. If that’s the case though… please rethink this.\n\nAlso, I think he does kind of sound like TA for eating almost all of the fries you were supposed to *share* and for giving lame excuses instead of a sincere apology. You are NTA.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Seems to me the relationship is over and has been for awhile.\n\nJust find a man who actually cares about you and talks to you. It isn’t hard to only eat half of a thing of fries. It also isn’t hard to wait until you get home to eat a thing of fries. \n\nYou 2 don’t seem to vibe so just break up and move on. There are good people out there that would respect your boundaries (more than just fries but that does apply here too). To me, what he did was just super rude. You don’t ask to share them then eat the majority of it. This wouldn’t be a big deal as much if it didn’t happen often but I’d wager it does happen, hence the reason for the post. \n\nJust leave and find someone better.",
              "id": 89,
              "comments": [
                {
                  "score": 1,
                  "content": "I don’t doubt he cares about me. He has many redeeming qualities. I love being around him and we have a lot of fun. We have similar values about almost everything (except for sharing food apparently). I see this conflict being avoidable in the future. \n\nI know I could find a man that’s more selfless, and more this or that, but I really want this one. He’s quite a beautiful soul & my love for him is pure. It might be easier instantly somewhere else, but I think it can be easier with him too. We’re young. We’re both insecure. We’re growing and giving our best. I think the ways I feel challenged to be better for him are very good for my heart in the long run.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 2,
                      "content": "It’s your life - it just seems like yall are trying way too hard. You broke up for a reason, no?\n\nI mean, I was maybe 2-3 months into dating my GF before I could pick up on her Q’s. She had her own issues growing up and communication was kinda hard for her, but I didn’t mind because eventually, I began to naturally read her like a book. I know exactly what she means when she says “I’m not that hungry”. It’s not that she is lying or something, it’s just that to her, “not that hungry” = not hungry enough for a burger and fries, but hungry enough for a small/medium fry, and a large is just cheaper. I’d imagine a small and a half is about half of a large.\n\nIt just doesn’t seem like someone pays attention if, after I’m assuming a minimum of 6 months in a relationship, they don’t know what you mean. You both could’ve communicated better but it’s just wild to me that anyone would assume “not very hungry” = eat 10 fries, especially after you admitted you were hungrier than anticipated and ordered a burger. I’m not arguing with you, as it’s your life, but like lol. If you’re making a post about fries, it really isn’t about the fries.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 258,
      "content": "ESH. Him for being inconsiderate and you for continuing to scold him like child and demand he continues to apologize until the apology is up to your standards. That’s not helpful, and in my experience, can be very controlling and abusive behavior in itself. Especially since you already know he’s “sensitive to shame and guilt”. \n\nIf his behavior is a pattern, talk about that next time instead of the fries.",
      "id": 92,
      "comments": [
        {
          "score": 52,
          "content": "This is what I need to hear.",
          "id": 93,
          "comments": [
            {
              "score": 19,
              "content": "[deleted]",
              "id": 94,
              "comments": [
                {
                  "score": 52,
                  "content": "Did you read the post. She literally told him before they ordered that she was hungrier than she thought and did he still want to share the fries.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 0,
                      "content": ">I ended up recognizing that I was hungrier than I thought & got a cheeseburger for myself. I asked him if he still wanted to do the large fry to share and he said yes.\n\nSo per her own words, she never told him she was hungrier than she thought.  Just that she recognized it so she decided to get a cheeseburger for herself (remember she was only going to have a few of his fries originally).  The man isn't a mindreader, she should have told him she was hungrier and wanted her own fries or half the fries.",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 39,
                  "content": "Disregarding everything else, if someone were to ask me to share something with them, I'd automatically assume they mean split it in half with them.\n\nIf they only wanted a bite or a few, they would ask for a bite/a few.",
                  "id": 97,
                  "comments": [
                    {
                      "score": -5,
                      "content": "[deleted]",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Proper french fry sharing etiquette is to split them roughly 50/50 until one person is full. *Then* the other person can have the rest. BF jumped the gun, ate too many fries before OP even had a chance to have some.",
                  "id": 99,
                  "comments": [
                    {
                      "score": -5,
                      "content": "[deleted]",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -5,
                  "content": "I glossed over this detail and you're absolutely right. OP miscommunicated her actual state of being, and her BF acted reasonably with that information. Also her refusal to accept several apologies (small apologies, but eating fries doesn't demand a big apology) belies that this isn't about the fries, which OP has confirmed.\n\n(My judgement is ESH though. \"_____ to share\" to me implies a 50/50 split, and to communicate whether a person is gonna eat more than that. While it's reasonable to assume that OP, who stated she wasn't hungry, wouldn't need half the fries, we know what they say about assuming. Both need to continue working on their communication.)",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 196,
      "content": "YTA. You started off in the right but apparently you're the personality type that's never heard of a small issue. Your refusal to accept a simple apology for a simple mistake is why you're the ahole. He didn't declare his everlasting shame and remorse in his apology because all he did was eat too many damn fries. He didn't tear up thinking about how he was monstrous enough to hurt you so badly because, once again, all he did was eat some of your share of the fries. Try to get some perspective on what's a big issue that needs to be resolved with deep conversations and genuine remorse and what's a small mistake that deserves no more than I'm sorry. I'm emotionally exhausted just reading your description of the great fry betrayal. I can't imagine how your bf feels.",
      "id": 102,
      "comments": [
        {
          "score": 34,
          "content": "This actually made me laugh & I appreciate the perspective. I’m trying.",
          "id": 103,
          "comments": [
            {
              "score": 40,
              "content": "Glad I make you laugh. I'm a deep thinker too. The thing to understand is a lot of people aren't. Keep trying and you'll eventually be able to differentiate when a mistake has deeper implications and when it's just a case of fries are freaking delicious and your bf morphed into a mindless fry shoveling machine.",
              "id": 104,
              "comments": [
                {
                  "score": 19,
                  "content": "I’d prefer to think of him this way.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 17,
                      "content": "And you were probably hangry too. \n\nProbably",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This perspective being shared here is nice, and is good perspective, for *this singular situation* being described to us here. Only you know if this behavior from him, his not listening to you, dismissing your feelings/concerns, and not taking responsibility for his behavior, if any of *those* behaviors from him are more normal and ongoing outside of this one singular situation though, then I would look at your bf's behavior as part of a bigger pattern than just 'he ate too many fries and you are overreacting' as told to you above. \n\nOnly you how this incident plays out in the larger scheme of your relationship, and only you know if his 'apology' ended up in changed behavior or was just another 'I'm sorry, I'll do better next time' in a string of apologies. Do his actions now match the words he said when he told you he was working on things?",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I'm sorry but....wtf lol \n\nHer boyfriend was rude and Inconsiderate. And in another comment OP shared that he has a habit of not listening to her and being thoughtless.\n\nApologies don't mean jack shit if the person keeps doing the same behaviour over and over again. \n\nIf he has a habit of selfish and thoughtless behaviour that he just says \"sorry\" and does it again and again... It's meaningless. \n\nShe was hungry and frustrated. \n\nHe sounds like a child.",
          "id": 108,
          "comments": [
            {
              "score": 7,
              "content": "If he has a habit of being thoughtless, wait for a calm moment and talk to him about that habit. Picking a lengthy fight about fucking fries, *after he said he's sorry,* after a long day, is neither healthy nor beneficial. Sometimes a molehill just needs to stay a molehill.",
              "id": 109,
              "comments": [
                {
                  "score": 0,
                  "content": "But if it's a habit then he keeps doing it. She said she's talked to him about it before. \n\nSo you're honestly telling me that if someone keeps doing the same crappy behaviour over and over... You're gonna talk to them calmly every single time until the end of time and that they can just keep saying sorry ..without actually changing their behaviour?\n\nSorry only means something if the person means it..and makes a conscious effort not to do it again.\n\nYou guys keep focusing on the fact it's \"fucking fries\". Have you never heard of the straw that broke the camels back? \n\nIt's the fact he keeps doing the same thoughtless behaviour over and over. He doesn't listen to her. He doesn't think of her. He doesn't consider her.\n\nAn isolated incident is one thing. Repeated behaviour of something that you know upsets your partner is disrespect. \n\nReddit just blows my mind like.. one post someone does something rude and you all crucify them and then in another, a man acts like a selfish a££hole and you all lay into the woman because she didn't placate him like a damn baby.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Are you seriously not aware women are infamously known to say their not hungry, ask if they can just snack on bit of their partners food, and proceed to take way more than what's appropriate. I'm completely blown away you're not aware to what extent the world talks about this obnoxious behavior and the irony of your rant",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I think these small things add up and lead to resentment. Sure this was nothing major but it's pretty selfish to eat all of the fries without thinking about your partner. And I get the sense this isn't the first time he's committed a small infraction that makes OP feel like he doesn't think about her when making decisions.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "She was never in the right.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 133,
      "content": "Next time/*every* time… get your *own* fries or whatever. Even if it’s cheaper to split a large than two smaller ones. \n\nAnd don’t share, because your fellow obviously doesn’t know how to share. WTF, he ate almost all the fries, (as far as he knew, not noticing the ones in the bottom of the bag!), before you even got home. *Even though he knew you wanted some*. NTA. \n\nAnd then he got defensive about it!",
      "id": 114,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 43,
      "content": "~~YTA~~ ESH. \n\nSince he was the passenger. He should have known how many he ate\n \n\nYour an ass because you made a huge deal out of fries....totally fine to scold him once then drop it and next time order your own.  Also he did apologize,  what more do you want a 1000 page report explaining his thoughtless mistake and how it would effect you mentally?\n\n\nBut also who was driving? If he was the passenger he knew how many he ate, if he was the driver he didn't.  So if he was the passenger he also is an ass for being greedy\n\nEdited to change to call him an ass also since he was not the driver",
      "id": 115,
      "comments": [
        {
          "score": 30,
          "content": "I mean, it sounds like he knew how much he ate?\n\nNothing in OP’s post defends the point “we didn’t even know how much was in the bag,” other than that she was driving. So yeah she may have not known, but doesn’t mean he didn’t? And when he said “I thought a quarter was enough,” she just says “you didn’t even know there was a quarter left.”",
          "id": 116,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "It’s not an apology if you keep making excuses though. \n\nThat’s a fauxpology and doesn’t count. But it seems like the fries aren’t the issue here.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I was driving.",
          "id": 118,
          "comments": [
            {
              "score": 34,
              "content": "Do yourselves a favour and the passenger has to also feed the driver if the chips are shared.\n\nMy boyfriend is absolutely capable of mindlessly eating most of our shared chips. He gets one handful, I get one handful (obviously being careful with traffic etc).\n\nAlso, most fast food chips get cold by the time I get home. I don't want to be eating that soggy mess...",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "So turn around and get more fries",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "100% this.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 43,
      "content": "NTA. \n\nI'm surprised by all the E S H votes because yes, you hounded him for an actual apology but it feels deserved. \n\nHe knew he was eating all the fries, he knew you two were sharing them. He then gave excuses that are clearly lies- oh I figured you just wanted a quarter of the fries- and we know they are lies because he didn't know there were hidden extra fries in the bag, so he didn't save you a quarter of the fries, you stopped him before he could eat ALL of them, and when you say you are sharing something, that means 50/50 unless otherwise discussed. \n\nSo of course you weren't happy with an apology that contains a \"but\" and an untruth. \n\nSure, it is just over fries, but I think you are probably this upset because it is a pattern, and even if it isn't, I find these like \"white lies\" to be some of the most annoying. Just be like- I wasn't paying attention and I scarfed all these fries, I'm so sorry and I can go get you more or will treat you to dinner tomorrow.\" That's an honest apology. Apologies exists because people mess up- they don't think, they act selfishly, they misunderstand- and that's okay! But a true apology is honest without excuses or lies, and comes with a how to fix it/move on.",
      "id": 122,
      "comments": [
        {
          "score": 22,
          "content": "You people are exhausting. It's never just about fries. There just has to be some deep-rooted physiological issue behind every single action a person does.\n\nThis is what 10 year olds fight about. If you're so hungry that being cheated on a handful of french fries kills your whole mood, order your own dang fries.",
          "id": 123,
          "comments": [
            {
              "score": 11,
              "content": "Who is \"you people\" exactly?",
              "id": 124,
              "comments": [
                {
                  "score": -10,
                  "content": "[removed]",
                  "id": 125,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Ah redheads. Got it.",
                      "id": 126,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I just don't get this kind of thinking at all? You must just be a super thoughtless, careless partner. \n\nYou go to the cinema and are looking forward to the shared popcorn. Oop your partner ate them all. Nevermind its just popcorn \n\nYou save a slice of cake from work and have been looking forward to it all day. Your partner eats it before you get home. Oop. Nevermind, don't be petty it's just cake \n\nYou specifically buy your favourite alcohol to enjoy on your day off. Oop partner has drank it. Nevermind...\n\nLike...what? OP states in another comment that this is a common occurrence with him. Who the fk would want a partner that thoughtless and selfish?",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "I agree with this.  It’s really inconsiderate.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "ESH... he shouldn't have ate that money but he did apologize.  Do you want him groveling at your feet? Let it go.  This relationship is doomed to fail if you continue this behavior.",
      "id": 129,
      "comments": [
        {
          "score": 12,
          "content": "Thanks, I actually appreciate it. I know I need to reset and let some things from the past go. Its resentment. It’s a pattern of behavior I think I need to either accept as is as long as there’s effort of change & growth, and I have my own to do obviously. It’s not worth making things like this harder.. I guess pick my battles.",
          "id": 130,
          "comments": [
            {
              "score": 3,
              "content": "I totally get that it's the small things that build up. They always say it's the small issues that lead to divorce and I don't think you should feel like you should just accept them. It really sucks when your partner does something that shows they weren't thinking about you at all; my pet peeve is my partner never replaces the toilet paper and I think it's rude as hell.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "At 58, I wish I had learned to let things go earlier.  I worried about a lot of things that ultimately didn't matter.  My life would have been so much better and easier!  I now ask myself, will this matter tomorrow, or in a week, month or year?  Then I try to react accordingly.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}