{
  "post content": "So right now both of my kids (16 year old son and 9 year old daughter) and my ex are extremely mad at me because I won't give up my appointed time with them. My son wont even talk to me and my daughter is crying all the time. \n\n&#x200B;\n\nA little backstory. Me and my ex divorced shortly after my daughter was born. I blame him for it and he blames me. I won't go into detail here. We ended up with a 50/50 custody agreement switching every other week. While this was 8 years ago we're still not on good terms. We rarely ever talk to each other outside of the kids and i'm perfectly fine with that. One thing we have agreed on since the beginning though is that we don't plan things on days that aren't ours. And unless it's extremely important we don't \"switch\" days or weeks. In the 8 years since we've been divorced I have never asked him to have the kids on a day that isn't mine and I've never given him one of my days even if he begged. \n\n&#x200B;\n\nWell, last week my ex contacted me and told me the \"good\" news. His parents are hosting a week long family reunion in the summer at Disneyland and he want's to take the kids. Well, the problem is that it's on one of my weeks. He asked me to let the kids stay with him that week or to switch a week with me and I shot him down. It's my week with them and I get to spend it with them. I told him if it's so important to him to reschedule but he claims his parents can't do that and this is the only week that the whole family can go and he told me that I need to \"think of them\". I told him \"tough luck\" and hung up on him.\n\n&#x200B;\n\nWell, this last Sunday when my ex dropped the kids off with me my son refused to talk to me at all and my daughter wouldn't even look at me. When I asked my ex what was wrong he refused to talk to me, only saying \"ask them\" in a snarky tone before leaving. When I asked my daughter what was wrong she burst into tears and said that i was \"not letting daddy take them to Disneyland\". Asking my son (who still refuses to talk to me) it turns out that my ex told them I was not letting them go to Disneyland with him. He's trying to paint me as the bad guy. I sat both of them down last night to talk to them and explain it's my week with them but they refused to listen to me. My daughter just cried and my son told me i'm only doing this to get back at my ex.\n\n&#x200B;\n\nI'm not though. I think its unfair for him to do this when his parents scheduled it during my time with them. I demanded an apology from my ex and him to set things straight but he refuses, and his last text to me being \"can't tell them the truth cause they already know it\". \n\n&#x200B;\n\nI'm so pissed right now. Am i the asshole because my ex scheduled something during MY time with MY kids? How is it my fault that i'm only using my right to spend time with them? ",
  "id": 1,
  "comments": [
    {
      "score": 27346,
      "content": "YTA. Your ex gave you months of notice for this trip.  Have you ever been to Disney? That's the kind of trip that takes a lot of planning, especially if your ex is trying to coordinate it with a large extended family.  If this is the only weekend that his whole family can go, then do you really think this is the kind of thing that can be rescheduled so easily? \n\n> He's trying to paint me as the bad guy. \n\nThat's because you are the bad guy. You are being incredibly small, selfish and petty, and it sounds like you are using this opportunity to get back at your ex and his family somehow.  What you are really doing is damaging your relationship with your kids.  This drama isn't even about your kids, it's about you and how you are being (in your opinion) so, so wronged. If you value your kids and your relationship with them, be flexible.  ",
      "id": 2,
      "comments": [
        {
          "score": 6335,
          "content": "Agree. It’s not easy at all to reschedule a family reunion. OP is depriving her kids of not only a vacation with their father, but with their extended family that probably doesn’t come up very often. It definitely seems like she is taking the stance of being petty.",
          "id": 3,
          "comments": [
            {
              "score": 2293,
              "content": "Yep. OP you are essentially using your kids to get back at your ex. Not cool and yes, it makes YTA. Also, if it's your ex's family then it's your kids' family. So, not only are you keeping two young kids from Disneyland for no apparent reason, but you are also keeping them from seeing and meeting extended family. They deserve to have strong relationships with both sides of the family. Keep them two weeks prior to the trip and then let them go - if there needs to be a compromise. Personally, I'd just let them go and enjoy a two week \"vacation\" for myself. ",
              "id": 4,
              "comments": [
                {
                  "score": 1091,
                  "content": "YTA \n\nI also smell some bullshit here. Look at this.\n\n> And unless it's extremely important we don't \"switch\" days or weeks.\n\nokay...\n\n> In the 8 years since we've been divorced I have never asked him to have the kids on a day that isn't mine\n\nSo he is the one who has switched days on you?\n\n> I've never given him one of my days even if he begged. \n\nWait, what?\n\nNot only is that contradicting it makes you sound extra bitchy.\n\n",
                  "id": 5,
                  "comments": [
                    {
                      "score": 371,
                      "content": "I do agree on YTA on this, as it's a very big deal to kids to get to go to a place like Disneyland or Disneyworld, family connection is important on both sides, and OP is being petty and unreasonably stubborn (esp since it sounds like her ex isn't even the one who chose the date, his parents are).\n\nHowever, I think there's a possibility you're misunderstanding this part (or I am lol). To me, the text here is saying that they don't switch days, she's never asked him to switch days with her, and she's refused to switch for him in the past so she expects the ex to understand that she wouldn't switch now for this vacation. Nothing contradicting or bs to the statement, though I also agree it's written with bias and writing objectively would help OP come across as a more pleasant person.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 760,
                  "content": "The most frustrating part is the fact that OP might ignore all these comments. I hope for the sake of the kids that OP owns up to this and shows some change. I come from a family of divorce and one thing I always tell people is that the kids should come FIRST. Not your own pettiness around your ex or past issues. The kids should not be ammo to get back at the ex, they should be the forefront. ",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 200,
                  "content": "If everyone got along better, Mom could've got an invite too.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Right? ",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 468,
              "content": "Agree your kids will never forget this or forgive you. Might want to think about the future relationship you want with your children.",
              "id": 10,
              "comments": [
                {
                  "score": 267,
                  "content": "This would definitely be something that I'd be resentful about for the rest of my life.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 296,
              "content": "I’d literally hate you if you were my mom. YTA.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3535,
          "content": "Out of every comment, I sincerely hope you read this one, OP. If this is how you’re handling your kids’ opportunity to go to Disneyland, I would say you’re the reason for the breakup with your ex. \n\nIf you want your kids to leave you as well as your ex, keep this shit up OP. ",
          "id": 13,
          "comments": [
            {
              "score": 1996,
              "content": "I literally am a child of one of these divorce proceedings, time split in half, OP is acting like my Mom, we ended up going to court and making my Dad primary guardian when my sister was 14, I was 10.\n\nShe's using her time with THEIR kids as a way to get back at the husband. Children are being used as pawns by OP. Incredibly sad and something I can sadly whole-heartedly relate to.\n\nALL SHE WOULD HAVE TO DO IS GET HIM TO GIVE HER ONE OF HIS WEEKS AT ANOTHER DATE, That's freaking it and time would be equal.",
              "id": 14,
              "comments": [
                {
                  "score": 1285,
                  "content": "Worst part is that she mentions him being super reasonable and asking to switch weeks.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 891,
                      "content": "Oh God, I must've looked over that part. OP in this case is being a genuinely bad person and an even worse parent. How are you going to say \"tough luck\" when your ex rightfully says \"think of them\". Actually, I know how. Because my Mom is the same kind of cold person. Which I why we moved with my Dad. \n\nI have no problem in this situation in saying that OP was largest the cause of the divorce, I mean, who the fuck can live with someone who is that unreasonable and petty.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Seriously! Doesn't this mean that OP could have two whole weeks in a row with them? Why wouldn't you jump on that?",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "Also mentioned in the past she's never asked to switch time, but also she's never given in to requests to switch time \"even if he begged\".",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 520,
                  "content": "As a parent who lets my kids (f12 and f14) go where they feel they should be at this point with an ex who does the same, this and the responses under it make feel like I'm doing something right.  We've always let the kids celebrate family things.  My guideline has been 1. Would they go do this thing in we were still together? 2. Is the anything that legitimately can't be rescheduled scheduled in this time? If it's yes to #1 and no to #2 they go no matter how I feel.\n\nMy ex's mom was sick this summer and my now 14 year old basically stayed with her as much as possible when she wasn't in the hospital. At one point I started to feel bad for myself. After all, it's my time with them. Then Granny died and I was SO glad I let her be where she felt she belonged.  I could never look her in the eye if I'd kept them apart.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 283,
                      "content": "When I was 14 I spent the last summer of my grandmom’s life w her. We thought she was sick (rather than dying), but she had an oxygen tank and needed help shopping, cleaning, etc.\n\nI ended up hanging around the whole summer, helping her finish all if her hand-crafted Christmas gifts for friends and family...tying up loose ends (I realized later). She knew, long bf any of us, that she wasn’t going to live until the holidays.\n\nPoint is, I wouldn’t trade that summer for anything. So thank you. Thank you for parenting unselfishly. Thank you for giving your daughter a summer she can hold in her heart. ❤️",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "My ex wouldn’t let my son see my grandmother the weeks leading up to her death. I will never forgive that woman. You are a strong, amazing person. Your kids will one day, if they don’t already, appreciate the selflessness you displayed at such an important and tender time.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 346,
                  "content": "I am also a child of a parent like this. It was an absolute nightmare. I haven't seen nor spoken to my mother for 10 years - got outta there at 18 and never ever went back. \n",
                  "id": 22,
                  "comments": [
                    {
                      "score": 84,
                      "content": "Yep, I have an incredibly superficial relationship with my Mom. See her on some Holidays and her Birthday. I don't necessarily do it because she deserves it, but because I think it's the right thing to do. Not judging you for your actions. My Dad told me \"Love her as much as you can and forgive her the rest of the way\". Peace my brother/sister",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Did your dad bring a stepmom into your life? Did you find a positive and reasonable mom-relationship in her if so?",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "When my ex cheated on me after ten years, a baby and an engagement, it would have been so easy to be vengeful. But all I have to do is look at my daughter. It wouldn't just be hurting my ex - it would be hurting my daughter. It really benefits no one. I promised myself I'd never use her as a pawn for revenge and I never have 5 years later. Most of the time, I even let him take her if he asks last minute (on days that aren't \"his\"). That's her dad. I want them to have a good relationship and I never want her to grow up surrounded by tons of animosity between her parents. It doesn't do anyone any good. ",
                  "id": 25,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Can confirm: does no one good, especially the kid\n\nGood on you for being a good divorced parent",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "My dad pulled this with my mom and it ended up being an utter nightmare. Parents acting like spoilt children fighting over toys which are feeling human beings. OP you sound like my dad and that's really not complimentary. It was a point of contention and led to me making the choice to be with my mom full time, so keep it in mind OP when your kids decide they would rather be with dad who is reasonable. ",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "My mom did this once. Because I wanted to live with my dad, where I had lived my whole life in the same house with all my friends, my mom refused to take me on vacation with her. She left me with her friend for the entire week I was supposed to be with mom. Instead of just leaving me with my dad. No....I had to couch surf for 7 whole days just to prove a point. She even said \"see, if you lives with ME, you could have gone to Florida with me.\" I have never forgotten that.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Exactly. Want to take your kids on a fun trip of your own on one of his weeks, you'd have \"leverage\" if you let them go on this trip. ",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "She could plan something too!  Make it an amazing and memorable summer for her kids.  They go to Disney one week and then two weeks of fun with Mom too!  Best summer ever!",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Literally had this exact same experience.  My dad wouldn't budge on his weekend.  I was 9.  I am almost 30 and I still haven't been to Disney.\n\nFuck you, Dad.  I hate you for many other things aside from this, but this is up there.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I am a child of a nasty divorce like you. My mom used all of us to get back at my dad for the relationship ending and it has eventually contributed to me never speaking to my mom again. Children should never, I mean NEVER, be used as leverage. OP, what is the big deal? Think about the kids first. This is family plus a kids dream come true trip to Disney. It is completely selfish to deny them this simply because it is your week. This stinks of jealousy. OP, choose love first always, that is the best thing you could emulate for them. And please don't put them in the crossfire for Christ's sake. This is something that they will remember the rest of their lives and they will start to take notice of this behavior until it snowballs into a big steamy pile of bitterness and resentment towards you. Drop your ill-placed pride, call your ex and apologize for being the asshole and let your kids go. I speak from experience, I look back and remember ALL of the asshole stuff my mom did and so will they. ",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 653,
              "content": "Yes YTA. You don’t have any other plans for them so why are you being difficult?! You’re stopping your children from going to Disneyland, put that into perspective... \n\n\nIn fact, I can’t actually fathom why you would rather your children be unhappy and develop a slight hatred for you then just let them go? I feel sorry for your ex for having to be tied to you for another 9 years... harsh but true. \n\nJust have them for two weeks after they’re back? Jeeez. ",
              "id": 33,
              "comments": [
                {
                  "score": 134,
                  "content": "And the ex even offered to swap weeks so he could take them. He wasn't even demanding extra time - just different time!",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "I actually wouldn't be surprised if the kids started pushing for their father to take full custody. OP doesn't realise this resentment will stay with her kids for a long time. ",
                  "id": 35,
                  "comments": [
                    {
                      "score": 30,
                      "content": "The daughter is 16, she could almost certainly get the judge to say she gets to pick where she lives and if she has to visit either parent. It's very possible a judge could just grant the almost adult daughter the freedom to choose for herself.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 237,
              "content": "Even with Disneyland out of the equation, it’s still an opportunity for them to connect with their relatives. ",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": ">I would say you’re the reason for the breakup with your ex.\n\nI agree. I am guessing that her pettiness got in the way of the marriage. People who won't give an inch are miserable to be married to. ",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "OP is vastly underestimating how easy it is for kids to cut their parents out of their lives once they’re on their own. ",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "This was such an easy situation to resolve. Who wants to get back at their ex so bad they’d slight their own children?",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "THIS! I grew up in a divorced family and my mom used my brother and me as pawns in this exact way.  I haven't talked to my mom in 5 years and she hasn't met 2 of my 3 children.  I talk to my dad about once a week and he has a great relationship with my children.  I promise, if you keep this shit up you will lose your children too!",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1046,
          "content": "[deleted]",
          "id": 42,
          "comments": [
            {
              "score": 402,
              "content": "YTA\n\n#BAM - Nail on the head",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 248,
              "content": ">a vindictive narcissistic wench and just getting your way\n\nWell stated. Agree totally.\n\nExcept I'm not sure about this part:\n\n\\> If you were my mother, the minute I turned 18 I would be done with you.    \n\n\nWalking away from family is tough. Instead, what I envision is the kids beating themselves up over the decision to cut contact. Torturing themselves trying to care about a Mom who puts herself first. Trying desperately to have a mature relationship... struggling for years wondering what they've done wrong to be treated this way.... :( Quite sad. I have a friend struggling with all of that with her MIL. ",
              "id": 44,
              "comments": [
                {
                  "score": 22,
                  "content": "Sometimes parents make it easy. A good friend of mine moved out of her mom's home on her 18th birthday and did not see her again until about a week before the woman died. The woman never met any of her grandkids (Friend has two brothers who did the same) or was invited to a holiday, nothing. Friend wouldn't have even visited that last time if her aunt hadn't paid her to do so.\n\nHer mom was a piece of work, and honestly the OP reminds me of her. She once called the airline and canceled Friend's plane ticket because it was \"her\" week and Friend should have scheduled her school trip (not even with her dad) for a \"dad\" weekend.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "eh, i have been no contact for 5 years with my mom, better life without her.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "While she is at it, she needs to apologize and admit she was wrong to her kids and her ex. It will go a long way in re establishing goodwill. ",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 870,
          "content": "[deleted]",
          "id": 48,
          "comments": [
            {
              "score": 510,
              "content": "Exactly.  What do you have scheduled on this week?  Nothing???  YTA.  ",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 690,
          "content": "I mean, the nerve of this person. Acts like an asshole, gets called out for being an asshole, and then is shocked when everyone treats her like an asshole. \n\nOP is the kind of person who smells shit everywhere she goes and assumes that it is other people instead of checking her own shoe. ",
          "id": 50,
          "comments": [
            {
              "score": 77,
              "content": "Exactly!!!!!!!!",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "She also stated that shes refused to switch weeks in the passed \"even if he begged\".\n\nClearly not the first or last time shes refused or ruined plans of his with his children because of a court ordered custody agreement. Time is still equal, the kids are still there, but she wont give up \"her time\" for the sake of it being \"her time\".",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Amen!!! I can’t believe she can’t even see she is the asshole. Her poor kids.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 575,
          "content": "I'm sensing r/raisedbynarcissists might be in those kids futures. Like... how much of a piece of shit can you be? You rip an AMAZING childhood experience away from your own kids just so you can \"win\" your divorce. Trash.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 505,
          "content": "He even said he would switch a week or just ask him to give up another week in the future, OP should have at least tried to compromise a trade with the ex. ",
          "id": 55,
          "comments": [
            {
              "score": 169,
              "content": "And she even said that if it’s extremely important they’d switch weeks. Well I’d say that this is one of those extremely important times since it sounds like he didn’t have anything to do with the planning and as what’s been stated before rescheduling a trip to Disney would be a bitch. She’s most definitely the asshole. ",
              "id": 56,
              "comments": [
                {
                  "score": 23,
                  "content": "She also said she's never agreed to a switch no matter how much her husband begged.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Right, which means she’s not only an asshole but is full of contradictions herself to make this seem more self righteous to her. ",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "100% agreed",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "That’s what I was thinking! She is doing this 100% to get back at her ex. She won’t allow her kids to go to DISNEYLAND bc it’s HER week when he was willing to compromise? The kids are the ones who lose here. I would let my ex take our daughters to Disney if it meant it would interfere with any amount of my weeks bc I would want my kids to have a good time with their family. Reschedule a family reunion bc it is HER week? If she was my mother I’d seriously be pissed for the rest of my life.\n\nYTA times 100000",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "That’s what I was thinking. What harm is it to switch times temporarily? To me that makes OP come off as stubborn. She wasn’t thinking about the kids at all. \n\nMy ex husband and I switch times plenty.  \nIf work schedule changes or even for random ideas to go do something fun. \n",
              "id": 61,
              "comments": [
                {
                  "score": 27,
                  "content": "Very stubborn, this is a special occasion for her kids to have a very memorable week/weekend. One thing I hated was how OP said “MY kids” well they are the ex’s kids too... there is always a peaceful resolution. A trade/compromise would have been best for this situation",
                  "id": 62,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Ugh my boyfriend’s ex wife does that and always tries to lessen his son’s time with him.  Calls him her child.   And will battle with him about even fucking minutes of time.  It sounds like an auction almost.  I mind my own business but people that talk like that make me see red.  \n\nYou’re right, a compromise would have been best. Those kids have every right to be pissed off. How often does a fun trip with family come around? I’m venting and probably need to stop. ",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Exactly. What kind of lesson is she teaching her kids about compromise and problem-solving? What will they tell their employee when they need time off for something important? \"Tough Luck\"? OP is being an extreme asshole and needs to reflect on her life choices and see where she is causing the problems in her own life. ",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 307,
          "content": "Totally. Disney land was one of my absolute best memories as a youngin. Even then i knew it must have been insanely expensive to plan, unless you have some other equally important thing planned that week that you told him about before the disneyland thing came up YTA  - just trade a week and let them go, youre dragging your innocent kids into some petty shit.\n\nMy parents split when i was young and getting dragged into their shit talk about each other was the worst, divorce is bad enough for kids without the parents making it exponentially harder because theyre pissed off and resentful.",
          "id": 65,
          "comments": [
            {
              "score": 88,
              "content": "Planning a trip to Disney can be a task!  I found it to be more challenging to plan a trip to DisneyWorld (been twice!) than it was to plan a trip to DisneyLand (once!).  Both locations are a fair amount of work though, especially now that you can book both the attraction fast passes and restaurants online in advance. You have to book those well ahead of time (months!) to get the experience you want.   I'm pretty sure my kids don't know about that side of planning, and they don't need to.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Hijacking the top comment to say as someone who was the child of divorced parents who had 50/50 custody: fuck you OP. It sucks being the child in those situations. I am so thankful that my parents were usually willing to swap weeks when they asked each other, since me and my sister would've missed many special occasions with our parents otherwise. Being militant about which specific weeks belong to you is stupid, unless he's asking to swap a school holiday week for a school week or something similarly inequitable. \n\nEDIT: \"Fuck you\" is a little harsh. This is probably a genuine mistake, which is okay: both you and your ex are gonna make a lot of those. Just try to learn from this. :)",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "The thing that really irked me was OP getting all bent out of shape over the children being HERS. ‘MY week with MY kids. ‘ , does she think she climbed on top of herself and got pregnant? The kids are just as much his as they are hers and OP needs to find a way to grasp that concept. \n\nOP, totally YTA and if any apologies are needed it’s you who needs to apologize. Let the kids go on the trip. This kind of thing is once in a lifetime. Don’t ruin that for the kids. ",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16272,
      "content": "YTA.\n\nYou.\n\nAre.\n\n100%\n\nThe.\n\nAsshole.\n\n>He's trying to paint me as the bad guy. \n\nIn this situation you are the bad guy, telling them that you said they cant go to Disneyland isn't a lie, it's not painting you as a villain, its just the cold hard truth of the matter.\n\n>My daughter just cried and my son told me i'm only doing this to get back at my ex.\n\nThat's exactly what you are doing, you are denying your kids a large family holiday at Disney because you're too selfish and petty to change weeks.\n\n>I demanded an apology from my ex \n\nThere is 0 reason for him to apologise here, he asked you to swap because his Parents planned something and you said no.\n\n>and him to set things straight but he refuses\n\nThere is nothing to set straight here, you're being selfish, unreasonable and using your children as a weapon.\n\n>Am i the asshole because my ex scheduled something during MY time with MY kids? How is it my fault that i'm only using my right to spend time with them? \n\nYou are such a fucking asshole, you're denying your kids something that they clearly want to do and treating them like objects.\n\nTake a step back, pull your fucking head out of your ass and think about what is best for your children here instead of how you can be pissy and pedantic and \"Win\" over your ex.\n",
      "id": 69,
      "comments": [
        {
          "score": 2853,
          "content": "Harsh, but necessarily so. ",
          "id": 70,
          "comments": [
            {
              "score": 834,
              "content": "Not harsh enough...",
              "id": 71,
              "comments": [
                {
                  "score": 303,
                  "content": "Needed to be at least 3x more harsh than that. ",
                  "id": 72,
                  "comments": [
                    {
                      "score": 59,
                      "content": "[removed]",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1696,
          "content": "Thank you for this response. \n\nSo fucking accurate, I'm just some random dude on Reddit that has 50% custody of my kid and I'm infuriated by what a piece of work OP is being.\n\n&#x200B;",
          "id": 74,
          "comments": [
            {
              "score": 919,
              "content": "[deleted]",
              "id": 75,
              "comments": [
                {
                  "score": 401,
                  "content": "And why the kids might end up jacked up in their lives and future relationships. Flexibility is vital, being a bitch is optional. \n\nOP is: YTA, all the way. Switch a damn week before your kids decide to live with their dad full time when they have that option and never talk to you again. ",
                  "id": 76,
                  "comments": [
                    {
                      "score": 98,
                      "content": "Ohhhh yeah, they are NEVER going to forget this. Forgive, maybe- someday far in the future, after lots of therapy- but never forget. OP, this is going to be the defining memory of their childhood, I guarantee it. ",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 179,
                  "content": "Seriously, my best friend coparents with 2 different dads and no parent has ever denied a child a trip. If it falls on the others weekend they trade days. They make it work for their kids. The kids are the priority not the parents’ ego. ",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "My exes first wife is a lovely and reasonable person.   Her and I and her new husband worked hard to make sure the kids always had what they needed while their father was a complete shitlord.  We’ve been divorced for 7 years or so, their mom brought the kids, their half sister and their grandmother to visit me over the summer and stayed for 3 days.  It was an excellent visit.   We also did a camping trip a few years ago - mom and I and the 3 girls.   Their father/ my ex at this point has made no effort to see his kids in 7 years after YEARS of being difficult, unreasonable and nursing a victim complex the size of Montana. ",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 517,
              "content": "The OP sounds the type to alienate her kids from their dad, be petty and then wonder why they decide to live with him or cut her out of their lives when they are adults.",
              "id": 80,
              "comments": [
                {
                  "score": 157,
                  "content": "Yep. My dad was like that when I was a kid. Always so petty and spiteful towards my mom, and absolutely willing to hurt me for the sake of hurting her. I haven’t spoken to him in almost 5 years.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 45,
                      "content": "This cheers me up. \n\nMy husband's ex is a weapons grade bitch who has done everything she can to sabotage his relationship with his kids. She has hurt them time and again, just to score points over him.\n\nI hope as adults they can see her for what she is and leave her to grow old and die alone. Bitter, pathetic excuse for a mother.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "One of my close friend's ex is that way, and the kids loathe him. The older son is old enough to not visit, and the younger one begs not to go. He tells his dad he hates him. Both kids have asked their stepdad to adopt them when they turn 18, and the bio dad knows this, because they both told him that once they turn 18, he will no longer be their father.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Yep, 100% this. OP reminds me of my own Mom. I'll still never forget the time she heard my Dad was going to the Bahamas with a bunch of his friends for their 55th birthdays and bringing my step mom with him there. My Mom told him he couldn't go because she \"already had a trip planned with her sisters\" that weekend, which ended up being a weekend trip to a city about an hour away that she absolutely planned last minute. My Dad had to stay home because, \"Somebody had to watch the kids.\" She always did that shit and used us to get back at him and I don't think I can ever forgive her for that.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I am so sorry your mon put you through that. It is completely an unfair thing to do to a kid.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "[deleted]",
                  "id": 86,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Yup if she goes through with this, it will definitely affect their relationship with her long term, probably forever honestly",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "OP seems like the type of parent who asks their kids \"Who do you love more? Mommy or Daddy?\" ",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "> So fucking accurate, I'm just some random dude on Reddit that has 50% custody of my kid and I'm infuriated by what a piece of work OP is being.\n\nI hope, in my heart, that this post is a masterwork of trolling.   If it is, I applaud the writer. \n\nIf it's a true story I weep for the children. ",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 636,
          "content": ">treating them like objects.\n\nSo much this. It baffles me that OP is withholding a trip to Disney from her kids. I'm an adult who was raised by a single mother, but if my asshole dad's family had put together a Disney trip, there is no doubt in my mind she would have moved hell or high water to find a way for me to go on that trip because her top priority has always been my happiness.",
          "id": 90,
          "comments": [
            {
              "score": 292,
              "content": "Not just a trip to Disney but a vacation with their extended family! OP seems to be forgetting that her ex’s parents are her children’s grandparents.  Their missing out on memories with their dad, grandparents, aunts, uncles, and cousins! ",
              "id": 91,
              "comments": [
                {
                  "score": 142,
                  "content": ">OP seems to be forgetting that her ex’s parents are her children’s grandparents.  Their missing out on memories with their dad, grandparents, aunts, uncles, and cousins! \n\nShe's not forgetting a thing.  She ***wants*** her kids to miss out on making valuable memories with *his* side of the family.  That is a bonus for her, not a cost.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 32,
                      "content": "100%! ",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "Ya but OP hates them and thinks everything is the ex’s fault so why would she want her kids exposed to those trash family members of her ex? \n\n/s\n\nClear case of one parent putting revenge over love.",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": ">heir missing out on memories with their dad, grandparents, aunts, uncles, and cousins!\n\n**In fucking Disney!!** A goddamn kids dream from all over the world!",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "She’s clearly more concerned about HER wants over what the kids would enjoy. Ridiculous.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 442,
          "content": ">Am i the asshole because my ex scheduled something during MY time with MY kids? How is it my fault that i'm only using my right to spend time with them? \n\nUgh the way OP words this makes my blood boil. Her kids are not her fucking property and btw it takes two to make a child so aren't they his kids as well?",
          "id": 97,
          "comments": [
            {
              "score": 158,
              "content": "Right? They're not just her kids. They're his kids too! He's not even trying to take time with her kids away from her, he's offering to switch! She's being vindictive and it's hurting the kids. And she better shape up soon, because one of the kids is old enough to make their own decisions on which parent they want to stay with. If she keeps being spiteful, the 16 year old just might refuse to come back to her house.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Her kids in the future will sub to r/raisedbynarcissists. Guaranteed. \n",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "My my my my my my my OP is so narcissistic I can’t believe it. These are her children. She sounds like a 4 year old not wanting to share a teddy bear",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "This response x 1000. You are the asshole. YTA doesn't do it justice. The worst part is I think you, OP, posted on here thinking everyone would agree with you and yet there are over 1k responses saying YTA. \n\nThe fact that you have never asked to switch IS NOT RELEVANT. The fact that he has begged you to switch and you have said no doesn't make you strong, it makes you stubborn and cruel. Its embarrassing that a grown woman would behave this way. Your husband clearly burned you. That sucks. It's been 8 years. Build a bridge and get over it. Not for his sake, but for your children to have a fun vacation AND to bond with their relatives AND for them to see family values in action because you are not showing them that, you are demonstrating how to maintain a very unhealthy relationship and you should be ashamed. You obviously have nothing planned for that week, although I have a sense you are so petty that you would take your kids to Disney that week and simultaneously NOT let them see that entire side of your family. \"I said tough luck and hung up\". This is so sad and the fact that you could even type and probably with some pride is the very worst part. Let them go and sit down with your ex, come up with a plan of how to decide switching off weeks or days. People have special events come up, that's life. Maybe set a month in advance warning, or something similar and limit it to 4 week switch offs per year. Just growwww up and pretend to be an adult.\n\nSeriously, what a pathetic post. Your kids might get over this Disney event but this toxic behavior will definitely poison your relationship with them and bite you in the ass one day. ",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "100% this. Please don’t use your kids as pawns. There are no winners by forcing everyone to lose.   \n\nTime for OP to grow up and move on. Divorce is hard but it’s been almost a decade now. She is only hurting herself and her family by holding on to this grudge.   \n\nTherapy might be something to look into. I would take a step back and ask why you need to control your ex through your kids, why you are still harboring such animosity all these years later. It’s not healthy.   \n\nNot for you, definitely not for your kids. Remember the golden rule of divorce: **the kids come first, period.**   \n\nIt’s time to let your anger go. I wish you luck, op. Let us know how it goes. ",
          "id": 102,
          "comments": [
            {
              "score": 21,
              "content": "Remember that the marriage ended almost a decade ago and the oldest kid is 16. That means OP is at a minimum 30 but more realistic well well into her 30s or even early 40s. Sounds like a 7 year old",
              "id": 103,
              "comments": [
                {
                  "score": 11,
                  "content": "It’s sad really. Reminds me of friends of ours that divorced. It ended badly and she was bitter. A literal Karen.   \n\nWatching someone use their kids as pawns was so disgusting. It’s not healthy to hang on to all that bitterness and anger, imho. OP thinks she’s hurting her ex, but really she is just hurting her kids and herself.    \n\nFor her kids’ sake, I hope she listens to the advice here. I stopped contact with my own mom years ago. Her bullshit and decades of abuse cost her relationship with me and the chance to see her grandson grow up.   \n\nIt’s. Not. Worth. It. ",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "“It’s been 8 years and we still aren’t on good terms.”\n\nI can’t imagine why.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I did this early on in my divorce on a much smaller trip (weekend at a lake). I quickly realized I was only hurting my child. My beef with my ex is my beef, not his. As much as it seems it sucks, the kids don’t deserve to be in the middle of your shit.  8 years later and op still can’t let it go. It is definitely the bad guy and a-hole \n",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Took the words out of my mouth",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "THIS TIMES 1 MILLION!\n\nI was a kid in this exact situation, time split in half after divorce, etc. And OP is acting just like my mom. We ended up choosing Dad as primary guardian when my sister was 14 and I was 10. OP is driving a wedge between her and her kids she can't even begin to understand.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15838,
      "content": "How are you the evil step mom to your own kids?\n\nYTA. ",
      "id": 109,
      "comments": [
        {
          "score": 2344,
          "content": "If I could afford to give you gold I would. Because this comment of yours is in fact, pure gold. \n\nEDIT: u/heygirl333 enjoy your gold made possible by the wonderful human being u/Hubord68",
          "id": 110,
          "comments": [
            {
              "score": 507,
              "content": "He got gold and you got platinum for saying you would give him gold. How did this happen\n\nEdit: platina>platinum\nEdit: Thanks for silver, stranger",
              "id": 111,
              "comments": [
                {
                  "score": 47,
                  "content": "Because platinum gives him Reddit coins so now he can give him gold",
                  "id": 112,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Hmmmmm that’s cool, wish I could give you gold, but I don’t have the reddit coins\n\nEdit: thanks for silver :)",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": ">platina\n\nIt's just one letter off but sounds so like a type of flower\n\n&#x200B;",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "To the person who reported this pleasant exchange, *who hurt you?*",
              "id": 115,
              "comments": [
                {
                  "score": 12,
                  "content": "We got reported?\n\nSigh. ",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I'm watching you. You better give him that gold. ",
              "id": 117,
              "comments": [
                {
                  "score": 10,
                  "content": "done and done my friend.\n\nyou made my month.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 265,
          "content": "I second the above comment\\^. GODDAMN. 10/10, would upvote again.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "Had to make sure we werent in /r/roastme",
          "id": 120,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "OP comes across so badly in this post that I almost wonder if it was written by the Dad, from the Mom's perspective, to show her how bad she is. Because the other explanation is that she's so oblivious that she thinks she might be justified here.",
          "id": 121,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "I was thinking the same thing like wtf OP?",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Hahaha this reminds me of the time I jokingly said to my step child (4yo at the time, after watching a Disney movie) “you’re lucky you don’t have an evil stepmother!” Step said “I do, at mommy’s house. It’s mommy!” I had to say nooo and act like that wasn’t true, but deep down I was cracking up.",
          "id": 123,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "No wonder the kids want to go to Disney! ",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Seriously! I hope OP is seriously posting this for advice and not just a place to vent. \n\nSide not \"asshole\" isnt a strong enough word here...",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11850,
      "content": "You wanna know why you guys broke up? You.",
      "id": 126,
      "comments": [
        {
          "score": 2212,
          "content": "Lolol too real. I really hope she let's the kids go. I've become way too invested in this post",
          "id": 127,
          "comments": [
            {
              "score": 405,
              "content": "Such trash! Haha",
              "id": 128,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 388,
              "content": "We will never know! She’ll never admit to being wrong to the internet. ",
              "id": 129,
              "comments": [
                {
                  "score": 185,
                  "content": "So far she hasn't commented anywhere from the post's account. Hopefully just reading the comments will help her get through this spiritual and emotional journey. ",
                  "id": 130,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "She won’t, I know types like her too well. The whole world can call her an asshole and she still won’t because she feels so self entitled. Her ex will always be the bad guy who ruins everything.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 899,
          "content": "I was thinking that exact same thing. I mean, if this is how she comes across when she tells the story, imagine how bad the situation really is? \n\nI would love to hear some stories from her ex. \n\nOP, can you get your ex to create an account here and post some wild stories about how petty you are? ",
          "id": 132,
          "comments": [
            {
              "score": 595,
              "content": "She says he's begged her for some of her days before. The kids have probably missed other events because of her.",
              "id": 133,
              "comments": [
                {
                  "score": 310,
                  "content": "I am sure that she has ruined many events where she was not the center of attention. Sadly, this is very likely just the latest in a long line of disappointments for those kids. \n\nOn the plus side, it will hopefully show them how to not be a shitty parent who only thinks of how things will impact them. ",
                  "id": 134,
                  "comments": [
                    {
                      "score": 39,
                      "content": "She sounds like a complete and utter narc and sociopath. I hope her kids run away from her and never look back when they turn 18. Good for her son for refusing to speak to her. The woman doesn't have an ounce of empathy or human decency in her body.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 35,
                  "content": "That's the the that stuck out to me instantly , this guy wants the best for his kids and even though he doesn't want to talk to his wife he's willing try .\n\nShe is just a cold bitch.",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "You just know the kids have probably never been with their dad on his birthday.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "The (unkind word for female) called her ex and asked him to apologize to her. Unreal. What type of crazy person does that? She has her head so far up her own ass that she can see her intestines produce the shit that's coming out of her mouth.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 463,
          "content": "r/MurderedByWords material right there. \n\nTypically on this sub you see people that have made hard decisions and feel remorse or some degree of guilt. \n\nHere is the much rarer \"I need confirmation that everyone is a jerk but me\"\n\nThe level of pettiness from OP makes me question if this is a genuine post or not. ",
          "id": 139,
          "comments": [
            {
              "score": 158,
              "content": "I work as a divorce lawyer.  It's genuine.  There are too many petty asshole parents in this world.",
              "id": 140,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "For real! The more I think about it, the more I hate this person",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 100,
          "content": "Thinking the exact same thing, I feel bad for OP’s ex ",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "My first thought after reading her post.",
          "id": 143,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9520,
      "content": "YTA you're stopping your kids from having a vacation at  Disney because you're too petty to swap a week? I completely understand why your kids are pissed at you.",
      "id": 144,
      "comments": [
        {
          "score": 2258,
          "content": "Its not even the rule of not switching weeks. Its obvious as hell that she is doing this out of spite because the children will have fun time with dad. Disgusting as hell. She is robbing her own children of every kids big dream simply to „win“. ",
          "id": 145,
          "comments": [
            {
              "score": 560,
              "content": "[deleted]",
              "id": 146,
              "comments": [
                {
                  "score": 261,
                  "content": "I kept thinking that was going to come up. Like she had already planned a trip to see family somewhere boring and the kids would just prefer to go to Disneyland. ",
                  "id": 147,
                  "comments": [
                    {
                      "score": 187,
                      "content": "Nope. Just all about “MY TIME” and “MY KIDS.” Newsflash they’re fucking people and sound like they’re old enough to understand what a cunt mom is being.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That seems to be about the only acceptable way for her to deny this that I can think of of the top of my head.",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 312,
              "content": "That rule only exists and is enforced in a draconian manner because OP wants to believe she has the moral high ground for never having asked to switch, and likes to stick it to her ex by saying no, no matter how he \"begs\". \n\n&#x200B;\n\nYou're The Asshole, OP, the sad, mean, bitter asshole who can't let go of shit, and is preventing her kids from going to Disney for a family reunion. Just switch a fucking week, you ass.",
              "id": 150,
              "comments": [
                {
                  "score": 54,
                  "content": ">no matter how he \"begs\".\n\nWhat a cruel thing to do. Why not be a bit flexible if need be? It disgusts me that she makes her ex beg, just b/c she wants to win. What a complete and utter asshole she is. ",
                  "id": 151,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "The son was 100% this was an F you to the ex and this whole situation is deeply fucked and depressing for the kids",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "> I've never given him one of my days even if he begged. \n\nShe admits she is so petty she won't even consider swapping days regardless of the situation.\n\n",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 217,
          "content": "And she can't even begin empathize with why her kids are pissed. They truly are possesions and/or means to get back at ex. I hope the week of silent treatment is worth the subsequent decades of alienation and resentment.",
          "id": 154,
          "comments": [
            {
              "score": 24,
              "content": "These aren’t decisions parents that love their kids would make. Parents sacrifice things to make their kids happy. This person is such a fucked up human",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": ">And she can't even begin empathize with why her kids are pissed\n\nThat's even more disgusting. I wonder if she is a sociopath, or just a total bitch?",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Her the second those kids are 18 and are the hell away from her: Why don't my kids want anything to do with me? What could I have possibly done??",
          "id": 157,
          "comments": [
            {
              "score": 18,
              "content": "This is wrong.... She will 100% blame the ex-husband for it and will demand he apologize and return the kids",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6294,
      "content": "YTA.\n\n> my ex told them I was not letting them go to Disneyland with him \n\nWell, he's not lying.\n\nHe offered to switch a week, and you refused. You are punishing your kids because you want that week instead of other, and I see no sign about that particular week being specially important for you.\n\nTherefore, I have to agree with your son: \n\n> my son told me i'm only doing this to get back at my ex. \n\n&#x200B;\n\nOr do you have any other reason that I failed to understand?",
      "id": 159,
      "comments": [
        {
          "score": 1682,
          "content": "\\> You are punishing your kids because you want that week instead of other\n\nOP hasn't even given a reason why she would prefer this week over another. She has no reason. Her only reason is that it's HER WEEK!\n\nI think we all can surmise the real reason, she doesn't like her ex and is willing to hurt her kids in order to hurt her ex. In fact this hurts her kids WAY more. A Disney Land trip to an adult is a nice fun time. A Disney land trip to a kid can easily be on the level of best experience of their childhood.",
          "id": 160,
          "comments": [
            {
              "score": 1457,
              "content": "[deleted]",
              "id": 161,
              "comments": [
                {
                  "score": 331,
                  "content": "[deleted]",
                  "id": 162,
                  "comments": [
                    {
                      "score": 29,
                      "content": "It becomes extremely difficult because “spending time” with the divorced parents means you are unable to decide what you want to do. Watching TV at mom’s vs dad’s is bullshit because they want to “hang out”. ",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "She herself said UNLESS it was for something extremely important and then said not once in 8 years has she ever budged even if he begged. She's definitely the major asshole lol",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 208,
              "content": "Not to mention a family trip. You know for years to come there's going to be stories about how much fun they had on the trip and a bunch of family shennagins. ",
              "id": 165,
              "comments": [
                {
                  "score": 56,
                  "content": "Which also means that the timing isn’t at all under the ex’s control. If you’re trying to coordinate something like this for a large group of adults, the last thing you should have to accommodate is OP’s attitude. I’m sure the rest of the group has legit restrictions and it’s pretty unbelievable that OP would expect the whole family to coordinate around her just because she feels like it. \n\nYTA so much. ",
                  "id": 166,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "Honestly, some of my best childhood experiences is when my family goes on vacation with my aunts, uncles, and cousins. It would always be a week full of fucking around with my cousins and eating the delicious food my parents and aunts and uncles prepared. Just pure fun.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "That's probably why she doesn't want them to go. OP seems like a vindictive person, so I highly doubt she wants her kids having fun & enjoying time with their dad. He's evil in OP's eyes (8 years & you still can't even be cordial with the father of your kids?), so anything she can do to destroy their possibility of fun with him seems like fair play to OP. It's pathetic. ",
                  "id": 168,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Can confirm as a young adult it is still a highlight of my life.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "> my son told me i'm only doing this to get back at my ex\n\nKids are much sharper than people give them credit for sometimes. They see right through their parents. If her son is telling her that, it's true.",
          "id": 170,
          "comments": [
            {
              "score": 38,
              "content": "the son is 16! hes not a kid, hes a young adult sick of his moms bullshit. i see him flying the coop and helping his father get custody for the daughter a few years down the line.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "They're 16 they're not dumb lol",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Those kids are never going to forget/forgive not letting them go to Disney. ",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "> Or do you have any other reason that I failed to understand?\n\nControl.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4622,
      "content": "YTA you won’t compromise with him and switch days because you’ve never asked to change weeks with him? How petty of you. Even if you don’t have a good relationship with your ex think of the children, the only person you’re really hurting from not letting them go is them which they’re completely innocent from.. stop being selfish and let them go. \n\nEDIT; thank you kind stranger for my first silver :,)",
      "id": 175,
      "comments": [
        {
          "score": 364,
          "content": "Exactly. Not once in the whole rant was there a thought about the children or how it would make them feel. It was solidly a thing between OP and the ex. \n",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Heck, I wouldn’t even say that the kids are the only ones being hurt.  If my or my wife’s parents put together a big family vacation in a place specifically geared to the grandkids and didn’t get to have them there?  Man that would hurt.  It would be bad for the grandparents who went to the trouble, cousins who would miss their peers, aunts and uncles and definitely me if I were in OP’s husbands shoes.\n\nI had to miss a lot of big family events in my 20’s, including funerals, because I worked at a job that wouldn’t cut me any slack and couldn’t afford to leave.  A decade later and there are still hard feelings in my family even though everyone understands what a position I was in.\n\nWhat an asshole.  This is bad.",
          "id": 177,
          "comments": [
            {
              "score": 19,
              "content": "While the fact the she's hurting her own children should be her main concern, you're exactly right that she's also hurting her ex's entire family. \n\nMy brother's baby mama wouldn't let my niece come to our side of the family's Christmas party for no real reason but that she was mad at my step mom. It turns out less than a month later my cousin died in a car accident and it would have been the last time my entire family would've be together. My grandma is the kindest, most forgiving, wonderful person I know and she still holds a grudge against the ex because she ruined the last opportunity for her to have all of her children, grandchildren and great grandchildren together. Obviously the ex couldn't have predicted that, but she still ruined it over her selfishness. \n\n",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Not true, she's not only hurting her kids, she's hurting herself more than anybody else here. There's no way the kids don't resent her after this. Congrats you got your week, and lost a good relationship with your kids. Nailed it.",
          "id": 179,
          "comments": [
            {
              "score": 11,
              "content": "Can you imagine just how incredibly awful that week with them is going to be while dad's at Disney? Oof.\n\nAnd guaranteed, she'll blame it all on him.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3682,
      "content": "[deleted]",
      "id": 181,
      "comments": [
        {
          "score": 1776,
          "content": "Can confirm, I no longer speak to my mother because she did shit like this. It's also been 8 years since my parents divorced.  GROW UP.  DO IT FOR THE CHILDREN. ",
          "id": 182,
          "comments": [
            {
              "score": 470,
              "content": "Same thing with my dad and I've completely cut him out of my life. Reading the OP has got me triggered. Why are they so selfish and self righteous? I would be so mad if I was in her childrens place. ",
              "id": 183,
              "comments": [
                {
                  "score": 32,
                  "content": "Yeahp. I feel ya man. Sometimes I wanna text my nmom. Then I see \"You are a horrible person.\" staring back at me in our last conversation lol NOPE never mind. ",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "100% there with you dude. This post pissed me off on a deep level. People like her, the comment above you's mother, and our fathers should not have kids. If you're unable to put your own selfish WANTS above what's best for your kids, you don't deserve to be called a mother or father. \n\n&#x200B;\n\nFuck these people. The worst part is they never see themselves for who they really are. I'm sure your father blames you for you not ever wanting anything to do with him, I know mine does. The only solace I get after years of physical and emotional abuse is knowing that man will die cold and alone because everyone who was ever close to him saw who he truly is and wants nothing to do with him.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "My parents have been divorced for almost 20 years and both of them still try to do petty shit like this. Needless to say, we don't speak much.\n\n*grammar",
              "id": 186,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 521,
          "content": "Her son is 16! Guaranteed he already sees how selfish and vindictive she is, and he gets to make his own decisions on who he stays with in 2 years. She's going to be really sorry when he never wants to see her again because she used him as a pawn to hurt her ex. What a total asshole. \"He paints me as the bad guy\"... Boo-fucking-hoo, you ARE the bad guy! ",
          "id": 187,
          "comments": [
            {
              "score": 81,
              "content": "Yeah I think I misread 16 as 6 when I originally commented and thought OP's kids were both fairly young. If her eldest is 16 he's already old enough to start shaking things up. She better learn to be flexible right quick or she's going to reap what she sows when the 16 year old grows distant.",
              "id": 188,
              "comments": [
                {
                  "score": 41,
                  "content": "I had to re-read the age a few times because I couldn't believe OP would try to control the time she has with her 16 year old. He could definitely petition the courts to have more time with his dad if he wanted to. And honestly, it sounds like she might be pretty petty with her ex, so the damage might already be too far gone regardless. (also sorry if it sounded like I was attacking you, I was just expressing my disbelief that OP is such an asshole) ",
                  "id": 189,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Nope didn't sound like you were attacking at all :) if anything it just underscores my point that she needs to tread carefully and think about her behavior and how she is treating her kids, or she's going to wind up with no-contact adult children and wondering what she ever could've done wrong.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "This, so much. OP needs to sit her kids down, apologize **to them**, and eat massive amounts of crow, admitting to selfish reasoning, and then tell them she's going to do the right thing. They are people with a sense of justice and fairness already, and attempting to save face will just lose their respect even more.",
          "id": 191,
          "comments": [
            {
              "score": 20,
              "content": "Shes setting a horrible example as well as to how adults handle conflict. ",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Hey question for you since you're a lawyer. Couldn't the 16 year old decide to live with dad permanently now and go on the vacation? I have heard at 14 that a child can decide which parent they want to permanently live with.",
          "id": 193,
          "comments": [
            {
              "score": 33,
              "content": "[deleted]",
              "id": 194,
              "comments": [
                {
                  "score": 29,
                  "content": "In her mind though, her kids are going to want to be with dad because he poisoned them against her. I only assume this because of the whole attitude and entitlement of everything she said. \n\nI've been there, I despise having to share \"my\" son with my ex (He is our son but saying our in that sentence didn't look right). But we got over it and co-parent great. It's amazing knowing our son is happy and comes first. And has both of his parents to support him and be there for him. We even *gasp* switch days. Sometimes one of us even has him longer than the other!\n\nBy the way, YTA OP. Get over yourself. It's hard, I know that from experience. But it's worth it when you love your kids more than you love being \"right\".",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "Wish I could give gold to this comment. My Mom used to do this all the time and it got to a point where I went a solid 2-3 years being extremely short with her and not reaching out to her, only talking when she reached out to me. I'm finally back to a point where things feel normal, but I know it's one incident away from me going right back to how I was before.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I love Disney with all my heart. If I was told at 9 years old I had the opportunity but one parent wasn't letting me go, I would be crushed for so long and 100% blame that parent.",
          "id": 197,
          "comments": [
            {
              "score": 9,
              "content": "Yeah, 100% they will be talking about this for the next 20 years. Not in a good way.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Cannot upvote this enough. My parents were GREAT at co-parenting, and I remember being so ridiculously happy during that time. \n\nThen, my dad married his ex-wife. Then it all changed, and my dad start showing behavior like OP here. My relationship with my dad has gotten a lot better the past few years as an adult and since they got divorced, but you better believe that there was a point in high school and early college where we had virtually no relationship. \n\nOP, please reevaluate how you look at your relationship with your ex-husband. I’m not saying you need to become best friends. Just get your shit together and put up with the situation you’re in for your kids. Kids don’t have to feel like children of divorce... I didn’t until my stepmom came around and it sounds like you’re forcing those feelings on your kids too. ",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The killer thing is, she could probably negotiate that extra week to be a week she really wanted, her or her parents birthdays or something, or maybe a trip or opportunity of her own.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3149,
      "content": "YTA. \nWho cares what the custody agreement is at this point. He's not trying to take them anywhere against their will on your time and to be honest your son at least is old enough where you should be allowing him to make these choices himself.\n\nYou're being selfish and petty. Just because it's one of your appointed weeks shouldn't get in the way of them having a great week with their dad and grandparents. Stop being a selfish and controlling mother and let them go to Disneyland with their dad.\n\n\n~~Take this opportunity to ask for an extra week at a later date.~~ I see he actually did offer to swap a week and you refused. Wow. Stop being so selfish, petty and entitled. It sucks this sub won't allow us to call you anything other than an asshole. Your kids are going to resent you when they're older if this is the kinda shit you pull. I wouldn't be surprised if they don't already as you've probably done similar in the past.\n\nStop being the \"Well the courts say it's my time so it's my right...blah blah blah\" asshole of a mother. Make exceptions for the benefit of your fucking children. Who the fuck cares if it adds up to 60/40 at the end of the year so long as your kids are happy. At least your ex seems to be a good father.\n\n>I have never asked him to have the kids on a day that isn't mine\n\nWell at least you aren't a hypocrite.",
      "id": 201,
      "comments": [
        {
          "score": 1499,
          "content": "She seems almost satisfied that this trip landed on her week. saying how she hung up on him after saying \"tough luck\"  seems like such a vindictive things to do, almost as if she is happy she gets to take joy from her ex. I think the only reason she made this post is because she doesn't know how to handle her kids reacting to her true character.",
          "id": 202,
          "comments": [
            {
              "score": 544,
              "content": "Sounds like this women would end up on r/entitledparents somehow",
              "id": 203,
              "comments": [
                {
                  "score": 461,
                  "content": "I was thinking r/raisedbynarcissists or r/raisedbyborderlines",
                  "id": 204,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Yeah, I was raised by a borderline mother, and I am so triggered by this post. I replied to this post in a sort of respectful manner, but damn I'm so mad for those kids. ",
                      "id": 205,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": ">She seems almost satisfied that this trip landed on her week. \n\nI know. Isn't it absolutely revolting beyond belief? I feel so bad for her kids. ",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 434,
          "content": ">Who the fuck cares if it adds up to 60/40 at the end of the year\n\nThis is how petty she's being - if she switches with him, it'll still be 50/50, so she loses nothing.  Even if she doesn't get a week back, it's 25/27 instead of 26/26? And all so her ex can't be the hero just one time, taking them to Disney.",
          "id": 207,
          "comments": [
            {
              "score": 41,
              "content": "I can't help but wonder what else she's made her kids miss because she won't compromise even when the dad is begging. Is it all fun stuff so he can't be the \"fun\" parent, or if there's been more serious things like funerals. It's such an insane thing to be proud of. ",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "Kids 13 and over also get a lot of say in custody. He can take her back to court to force her hand and the kid will tell the judge exactly what he thinks. She’s playing with fire. Petty ass horrible woman. (I’m also a woman) ",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "> so she loses nothing.\n\nAh, not so fast.  She loses the ability to make her ex's life just a bit more miserable.  She also loses the ability to  prevent her kids from having an amazing life experience with **his** side of the family.\n\nBoth of these things are clearly very important to her.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Right it's been eight years. Time to loosen the reins and allow for some flexibility. Life doesn't always fit neatly into regimented schedules. If there is no harm being done to her kids then she should have no problem swapping weeks at this point in the game.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "How much do you wanna bet the only reason she never asked him to have the kids on a day that isn't appointed to her is just so she can pull it as a justification when she denies him. Cause thats definitely the kind of petty shit this lady seems to like to pull.\nYTA, prioritise your kids' happiness, don't become the parent they don't want to be around. You will regret it.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Yeah, this is going to go down in sibling history as “remember the time Mom wouldn’t let us go to Disneyland because she’s a giant asshole?” ",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2730,
      "content": "INFO- why are you like this? \n\nEdit- woah this blew up, thanks for the coins guys!! \n\nAlso, OP I really hope you get back to us and let us know how the apology went. If you really have some undying need to make your ex suffer it can be done in a way to benefit the kids, like taking them to Disney for TWO WEEKS (on your own time, because swapping is clearly not a thing you do)",
      "id": 214,
      "comments": [
        {
          "score": 360,
          "content": "[Obligatory Michael Scott reference](https://giphy.com/gifs/why-hyMFaxhuQkZTq)",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 197,
          "content": "[deleted]",
          "id": 216,
          "comments": [
            {
              "score": 286,
              "content": "Best use of INFO I've ever seen.",
              "id": 217,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 43,
          "content": "Lmao",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Seriously -I can’t imagine being this awful to my kids just because I didn’t get along with my ex. I treated my dog better than she treats her kids when my ex and I broke up.\n\nCan’t imagine why she doesn’t want to go into the details of the divorce, she was probably shitty about that too.",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "The only appropriate comment that doesn't start with \"YTA\".",
          "id": 220,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Ahahahaha I’m geeked ",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Destruction",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "this had me cackling thank you",
          "id": 223,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}