{
  "post content": "I (28F) was having dinner with my high school friend Grant (28M). For context, I went to two different high schools, High School #1 being a fundamentalist hell hole. I left High School #1 at the end of Year 9 because, to be blunt, I was being bullied mercilessly. There was a girl, Janet, who I'd briefly been friends with in Year 7. She and her loyal sidekick Katie had turned on me for reasons I never knew or understood.\n\nAfter they kicked me out of the group, Janet spent the next three years doing everything she could to make my life a living hell, bent on making sure I was friendless and isolated. Long story short, school was a nightmare. Even after I left, she tried to get to me at my new school. To this day, I don't know what her problem was. I was a desperately shy bookworm who was no threat to anybody. \n\nI now live with Complex PTSD, in part due to her cruelty (there's other reasons I don't want to go into). I'm on medication, and I see a psychiatrist. Despite all that, I'm doing very well now. I can manage my condition, I have a career I love and I'm happy. I am honestly living my best life.\n\nAnyway, it turns out Grant, despite witnessing everything Janet put me through, has been friends with Janet since we graduated. I found out he's been keeping her somewhat 'updated' on my life, and told her about my health problems she's partly responsible for, without my consent. Grant told me Janet feels \"bad\" for what happened, but apparently Janet doesn't remember what she did to me, or why.  \nGrant said Janet asked him to organise for me, her and Grant to \"hang out so we can be friends\". I said absolutely not. Grant continued, saying Janet has changed and, in her words, thinks she and I can have \"girl talk\" and it will all be ok. He started telling me she's been divorced twice and really needs friends (even her sidekick Katie severed ties with her), and can't I just meet up with her and let her say sorry?\n\nI said to Grant that Janet may 'not remember' what happened, but I'm still living with the consequences. I reminded him that she spent all of high school trying to sleep with him even though he's gay, trying to turn him against me, and told him a few specific things she'd done to me. He was shocked and said \"Wow, she was awful, but can't you just forgive her?\"\n\nHe kept trying to convince me. I ended dinner by saying \"If her 'apology' can take away my diagnosis and the past 15 years of therapy I've been in, then I'll meet her,\" I asked him to please not share any more personal details about my health to her, or any other information about where I live, work etc.\n\nGrant was disappointed with me and told me I should \"stop holding onto anger,\" and said \"Everyone goes through bad stuff, so why are you the one who's so special and gets PTSD?\". That comment cut deep.\n\nReddit, AITA for saying no? Should I \"get over it\" and be her friend?\n\nEdit: Wow, I'm so overwhelmed by the responses and kindness of people. I've read every single comment and I sincerely thank everyone for their support. \nI can forgive Janet, but seeing her or being her friend is out of the question. As for Grant, he's skating on thin ice and I will be having a very serious talk with him. It's sad but I don't think our friendship will ever be the same.\n\nEdit: My dad told me I'm just making excuses and should \"extend the hand of friendship to someone clearly making an effort\" and maybe I \"unintentionally wronged Janet\"\nI'm speechless.",
  "id": 1,
  "comments": [
    {
      "score": 7643,
      "content": "NTa. You owe this woman nothing and quite frankly, Grant sounds like a really shitty friend.",
      "id": 2,
      "comments": [
        {
          "score": 2791,
          "content": "Horrible friend. He clearly doesn't respect her at all. He's already shown this by relaying everything about her life to the person who made her suffer, without her consent.\n\nThat last comment about 'why is she so SPECIAL (wtf?!) to get PTSD' is extremely off-putting. Wouldn't be surprised if he's already been talking bad about OP with the bully to begin with. \nA statement that disgusting and disrespectful doesn't just pop out of someone's mouth one day without it having been brewing in their thoughts for some time. (At least I'd like to believe that it doesn't)\n\nHis constant siding with the bully while disregarding OP's feelings shows me he cares more about the bully than OP.\n\nEdit: NTA",
          "id": 3,
          "comments": [
            {
              "score": 358,
              "content": "He's probably sick and tired of being treated the same as OP was and wants OP to be his shield.",
              "id": 4,
              "comments": [
                {
                  "score": 124,
                  "content": "Which makes it worse.",
                  "id": 5,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 116,
                  "content": "I see this a lot from people who are like 'why can't you just forgive the person who bullied/abused you?'\n\nThe solution seems pretty obvious in Grant's case as he's an adult (not a kid stuck at home or some shit) he should just remove himself from Janet's life instead of sticking around as her meat shield.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 25,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "> I see this a lot from people who are like 'why can't you just forgive the person who bullied/abused you?'\n\nYou know what? I've long since forgiven the people who bullied me as a kid. And if they came up to me and said \"Sorry\" I'd tell them that. Sure, it's no skin off my nose.\n\nBut I'm not gonna hang out with them! Why would I do that? I've got people I can hang out with who *don't* have all that unpleasant backstory attached.\n\n(And if I didn't want to forgive them, well, I guess they'd have to come to terms with their awful childhood behavior without me. Boo hoo freaking hoo.)",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 157,
              "content": "NTA\n\nAnd not only is Grant a horrible friend, he is now actually bullying you to forgive your bully.  No one gets to decide, but you who you should forgive.  That is for you to decide.\n\nAnd while Janet may not remember what she did, it sure sounds like nothing has changed.  She has worked to turn Grant against you just as before.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "I get the sense that he's trying to pull some kind of enlightened centrism thing? Like, \"it sucks that you had a relationship of one-sided abuse but it's fifteen years later now and she's clearly over it, and now you're both equally my friends, so I will now proceed to treat you like you should be on the same page about moving past it. And since you're refusing you are the one I will see as being irrational and shitty about it.\"",
              "id": 10,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "I absolutely agree that OP is NTA and that Grant is being a despicable friend, but him saying special might be a translation thing. I don't know OP's language but in mine special can also just be different.\n\nE: meaning different instead of special Would make Grants statement ignorant and mean instead of downright cruel and despicable.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I was somewhat willing to give him the benefit of the doubt (his wanting to be the peacemaker among his friends) until that incredibly shitty comment. I'd go no contact with him. And OP - you owe this woman NOTHING. Have you considered writing her a letter \"reminding\" her of every awful thing she did, and pointing out that karma is a bitch? It might just give you some closure.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 371,
          "content": "🚩🚩🚩🚩\nDoes grant have a soft crush on her or what? Insist OP to meet with her bully",
          "id": 13,
          "comments": [
            {
              "score": 80,
              "content": "He's gay",
              "id": 14,
              "comments": [
                {
                  "score": 239,
                  "content": "Soft crush mean something like a platonic flirt. Not like LIKE LIKE kinda thing",
                  "id": 15,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Oh okay. Thank you",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 54,
              "content": ">\tsoft crush\n\nIsn't that what friendship is? You like and may admire them in a platonic way. If you don't, they're probably more of an acquaintance.\n\nAs for this situation, OP should throw away his \"friend\" Grant as he clearly doesn't have boundaries nor empathy. He wants to make himself feel better for being friends with a bully by getting OP involved. I'm curious as to what exactly happened between them over the years to make them close. Anyway, no one ever needs to forgive their abuser or forget what they did to appease third parties who have no clue what went on and have no say in it.",
              "id": 17,
              "comments": [
                {
                  "score": 94,
                  "content": "To me it sounds like that bully is a very manipulative person. Grant apparently has known OP for a really long time, but somehow missed all the bullying and even takes her side, because \"now she needs friends\"?\n\nGrant is not a good friend, if he takes the bully side, passes on information without consent and even thinks OP should apologize? For what exactly? \n\nBullies almost always \"forget\" what they did to other people, and if you are lucky you will get them to offer a mutual apology and \"water under the bridge\" not working for redemption but expecting it. It is a telltale sign that this person has not changed.\n\nThere is no reason for OP to let a former abuser back into their life when they spent years getting that person out of their life and are still working on it. There is no \"getting over it\", as OP is clearly still working on this and with professional help, too.\n\nIf OP is truly considering to meet this person, I would recommend to do this only with the therapist in the loop and on their recommendation, maybe even supervision.\n\nOther than that, OP is NTA, but Grant for sure is for pushing someone to do something they clearly do not want and not accepting their no.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 69,
                      "content": "Grant: “She’s changed! Oh, also she’s had two divorces and her best friend couldn’t stand her anymore. But I swear she’s changed!”",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "OP should not meet with her ever, under any circumstances, because she does not wish to. Period. No is a complete sentence. \n\nJanet hasn't changed. She's still a bully. Now she is bullying OP, through Grant, to do what she says. She has not offered any apology, just an outright lie. She remembers perfectly well every shitty thing she ever did to OP. And she is still gloating about it, make no mistake about that. You cannot apologize for something you claim not to remember, and you cannot deny your own actions and pretend it is an apology.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": ">Grant is not a good friend, if he takes the bully side, passes on information without consent and even thinks OP should apologize? For what exactly?\n\nI don't see where OP says Grant wants her to apologize. Agree with the rest.\n\nUgh, I had a childhood bully, B, try to friend me on social media. That's a hard no from me, chief. I only mentioned it to my parents, and it turned out my mother remembered him by name as he was awful enough to have a starring role in my stories about the hell I went through even though many others bullied me.\n\nMy dad coached my sports team when I was growing up, and my mother told me that once, one of the league people asked him to take B on the team, he had a rough life and needed a positive role model and so forth. My mom told him how horrible B was, and my dad refused. I felt a little sorry hearing about this. My dad could have been great for him, but he burned that bridge. Some people are their own worst enemies, like this Janet person.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 261,
          "content": "NTA - fuck no. Why are abusive assholes deserving of redemption?  Grant sounds like a really shitty friend.",
          "id": 22,
          "comments": [
            {
              "score": 211,
              "content": "He only wants OP to forgive and forget for *his* comfort. So he doesn’t have to pick a side. He’s a lazy coward.",
              "id": 23,
              "comments": [
                {
                  "score": 71,
                  "content": "I get the impression he's using OP as his shield -- The timeline is a little muddy to me, but it's been around 15 years since they were in high school, and the bully is STILL asking about OP.  I would be afraid the bully would straight up show her true colors again, particularly after the \"why are you so special comment.\" My guess is they've been shit talking OP for \"being dramatic\" and think she's faking, and that Grant is secretly afraid she'll turn on him too.\n\n&#x200B;\n\nEdit: misremembered the ages when I posted.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 115,
                      "content": "To clarify the timeline, Janet targeted me from Year 7 - 9 , and that's when I finally escaped the school. I graduated from high school in 2010, but even in 2015 I heard of Janet telling a family friend not to like me.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "The bully already has shown her true colors again, by continuing to bully OP through Grant.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": ">He only wants OP to forgive and forget for his  comfort. So he doesn’t have to pick a side. He’s a lazy coward.\n\nHe already picked his side.  I think sharing such personal information with OP's bully might be worse than what the bully did in the first place.  Basically, he's bullying her behind her back and he's an adult.  Original bully was a young teenager.  That's still not an excuse but an adult should know better.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "[deleted]",
                  "id": 28,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I knew Grant still had Janet as a Facebook friend, but when this happened it came out that he's gone on holidays with her and having cosy dinners, which is where I came up (allegedly). He keeps telling me she's a much nicer person now and I truly don't think he'll ever stop seeing her. \nI feel so betrayed and hurt by this and at the very, VERY least Grant will be demoted from close confidante to acquaintance...",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 125,
              "content": "Done and done.  Grant has NOT been a friend, certainly not a trusted one.  I’m actually more pissed at him than her because you HAVE trusted him and he played both angles to benefit him, let’s face it.  Who else has he been telling your personal information to?  Of course, discuss this situation with your therapist in case there is a more  therapeutic approach to this that directly relates to the other things you’ve worked on. However, neither should be considered friends or given the time of day.  Quite frankly they deserve each other with their manipulative ways.  Wash your hands of them both and make new friends when you’re ready.  Absolutely NTA.  Congratulations on creating a great life for yourself!  👏🏼♥️",
              "id": 30,
              "comments": [
                {
                  "score": 14,
                  "content": "Can’t give this comment enough upvotes (or awards, I’m super poor 😔) but could not agree with this more! Grant is the biggest AH in this scenario and OP deserves so much more than both of them. It’s probably even harder for her to work through her PTSD because Grant is keeping it alive with his manipulations.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "To add to this you need to stop being friends with this guy. He s harmful to you moving on from this situation",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "exactly this. \n\nGrant is either too stupid to realize that he has made several AH moves in the last 15 yrs or he doesn't care.\n\nCut him off if he refuses to change.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Makes sense that he and Janet go on so well.",
          "id": 34,
          "comments": [
            {
              "score": 9,
              "content": "They are both AHs!",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Yeah, Grant sounds like a flying monkey. Janet found out that Grant stayed in touch with OP and pumped him for information, then pressed him to lure OP into a meeting to 'girl talk' away years of abusive bullying. OP, you're NTA and it might be time to cut Grant out of your life too.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "He doesn't sound like a friend at all. He's clearly taking sides with the other girl, and not taking in consideration OP's feelings and everything they went through.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Which friend would stay by the side of your bully and update about your life to your bully even after graduation? Geez, OP is better far away from these two.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Totally NTA like I would cut ties with Grant personally, because if I found out a friend was telling my high school abuser information about me I would be livid.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1671,
      "content": "NTA. You have zero obligation to help Janet feel better about herself for making your life a living hell all those years ago. Grant is also an asshole for remaining friends with her knowing what she put your through, speaking with her about your issues without consent, and trying to force you to forgive her. He is seriously overstepping. I would reconsider your friendship with him, especially if he continues with this behavior.",
      "id": 40,
      "comments": [
        {
          "score": 274,
          "content": "And someone who really wants to make amends for being a bully would make an apology and not expect anything in return if it’s true they are sorry. This sounds pretty much like just another massive manipulation for control on Janets part and whether or not Grant is part of it or being manipulated matters less. \nIf this Janet wanted to be your friend she would have started by stating how bad of a person she was and she was sorry and never every expected OP to respond or accept it. because someone whose truly apologetic recognizes they may not be forgiven but it’s the apology that counts.",
          "id": 41,
          "comments": [
            {
              "score": 140,
              "content": "Also don’t buy that she has no idea what she did. And the fact the she’s presumably under 30 (or just over) and already divorced twice doesn’t bode well for her character. Maybe her ex husbands got sick of her crap too.",
              "id": 42,
              "comments": [
                {
                  "score": 92,
                  "content": "She was twice divorced by age 25. I believe she's the same age as me now (28)",
                  "id": 43,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Yeah, stay away from that hot mess. I’m willing to bet a dollar to a donut she just wants to continue to torture you to make herself feel better about the crap show that is her life.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Well there’s your answer on her trying to make amends. She kick it with y’all for a while in till she finds another man and leaves. Definitely don’t let her in.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yiiiikes. That’s even worse. Don’t get caught up in that mess.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 70,
                  "content": "I’m old and bitter but I can’t help thinking the bully is too and just wants to “reconnect” with OP to continue her bullying to make herself feel better. Regardless OP is NTA.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I really wouldn't be surprised if that was the case.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Grant asking why OP was so special as to get PTSD is really fucked up. What would satisfy Grant? That maybe OP had a more traumatic life and so didn't endure the cruel bullying as well as others? Okay, great. Good for others. That doesn't change what happened to OP. Everybody copes differently and it isn't OP's fault that she just couldn't get over it. \n\nYou take your victim as you find her. \"How was I supposed to know you'd take my viciousness to you so hard?\" is the weakest possible argument to forgive someone.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Grant is also ableist for seeming to just dismiss her PTSD and expecting her to somehow just magically get over it? As if it's that easy? \"Just forgive her haha\" it's not that easy. Seeing her could make OP's condition worse or make her break down, even asking her to meet this woman could have been really bad.\n\nOP is NTA but both the bully and Grant are",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 887,
      "content": "NTA. NTA at all. Protect yourself. Don’t cave in and meet with her. And please consider whether or not you can trust Grant. If he so freely told her your personal medical information without stopping to think that maybe that crossed a line (which it absolutely and definitely did), how do you know he won’t continue to tell her information about your life now that you’ve asked him not to? He clearly disregards your feelings and undermines your experiences, and his last reported comment was abhorrent.",
      "id": 51,
      "comments": [
        {
          "score": 770,
          "content": "His last comment made me cry. I realise people go through worse things, but I don't feel he has the right to decide that I shouldn't have PTSD. It's not like I can control that.",
          "id": 52,
          "comments": [
            {
              "score": 506,
              "content": "He absolutely doesn’t have that right. Trauma isn’t some dick measuring contest, it’s just trauma. We all respond to trauma differently; some people can go through a whole lot and come out pretty unscathed, others can’t. Your brain did what it needed to to get you through the trauma Janet caused you, there is absolutely no shame in that. As somebody who also has PTSD, I’ve been where you are. People are so quick to invalidate PTSD when it’s not military related since that’s usually what people think of when they think of causes for PTSD. It sounds like Grant hasn’t been a good friend to you in a while and it may be worth reevaluating that friendship or at least creating some distance until he apologizes for what he said.",
              "id": 53,
              "comments": [
                {
                  "score": 200,
                  "content": "Thank you.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 149,
                      "content": "Add on to this, the same traumatic event can cause PTSD in one person but not another, not because of the resiliency of the person, but because of the quality of their social support.  Somebody who is going through an event alone is more likely to develop PTSD because they never get to work through their negative feelings with people they trust.    \n\n\nJanet not only caused your trauma, but also isolated you from your peers and made sure that you went through it alone, thereby getting PTSD from that trauma where you might not have otherwise done so.  It was shitty of Grant to suggest that you forgive Janet and it was extra shitty of Grant to make that comment about your PTSD.  I think you need to keep him at a distance for a while, he sounds like a bad friend.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "Ignore Grant. PTSD can occur to anyone and from anything, and it doesn't make you any less of a person. My wife is remarkably resilient but she has PTSD from working, and actually has recurring nightmares, usually related to work (she quit after she had our two kids and looks after them right now). It's just something that can happen to anyone and is in no way your fault! Glad you're having an awesome life right now, you sound like you deserve it!",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Drop Grant, he's an asshole and is a shit friend",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "I have Complex PTSD and it is nothing to be ashamed of. It is not a weakness or an attention seeking thing. You also hint at other reasons behind your diagnosis than Janet’s behaviour which makes her the straw that broke this particular camel’s back but it would still be valid if she was the entire bale of straw in your life.\n\nProlonged consistent bullying where the victim feels trapped is in fact abuse. And it’s a recognised risk factor for C-PTSD on a par with abuse at home. And it is without any other risk factors. Calling it bullying is minimising bullshit.\n\nThis situation with Grant is horrible. I imagine you are freezing up and spiralling into an emotional flashback or reliving and all your PTSD spidey senses are going haywire. It’s feeling like you will never escape this feeling or the situation with Janet.\n\nI’d like you to try to take a step back in the spiral and feel where the PTSD is in your body. Because Complex PTSD is a weird thing. Sometimes it is the most over reactive smoke detector in the world throwing our brain into shit fit mode because it gets an atom of a reminder of trauma. But sometimes if you can stop and breathe for a second you realise it is also our actual instincts keeping us safe. That pause allows us to smell smoke. The smoke alarm is working. It is correct. You are in the same danger. Your brain is Lassie knowing the child is in the well when last week it was crying wolf.\n\nGrant is not your friend, Grant is danger. Grant is  a threat. This is a Lassie moment where your PTSD is saving you. It’s showing you to a fire exit. Leave Grant to play with matches and go breathe fresh air. I guarantee your PTSD will improve almost instantly and the feelings that remain will be ‘normal’ grief and betrayal rather than a full trauma response.\n\nIt took me a while to learn that my safety harness PTSD feels very different to my hit the panic button PTSD and learning which was which has been transformative. Just last week I had to cut a wolf in sheep’s clothing off after reading the cues of my own trauma and months of issues lifted fast.\n\nI also recommend Pete Walker’s book on C-PTSD Surviving to Thriving. I found it as helpful as therapy for coping strategies in the immediate trauma stage. For when you are less high alert I suggest Bessel Van der Kolk’s book The Body Keeps The Score.\n\nI have also found that one of the most useful trauma tools I have is the block button. I block the everloving fuck out of anyone’s phone, social media, emails etc who triggers me or retraumatises me. No contact with my abusers is IRL and digital and it extends to anyone who is their flying monkey sent to do their work for them.\n\nGrant is a flying monkey and Grant can get royally fucked. He’ll play the victim forever more than you blocked him like you murdered his firstborn but never stop to think ‘oh hurtful things hurt me. I wonder if experiencing constant hurtful things like this is why OP has PTSD?’ \n\nThis is because flying monkeys lack empathy and because they have the same intellect as a chimp who likes to hurl its own shit to create fun. No one needs a shit flinging chimp as a friend even if they only fling shit occasionally and are usually a cute chimp in an outfit having a tea party. Shit sticks. Time Grant finds that out.\n\nEnjoy your life not having to be hyper vigilant to shit flinging. Feels really unsettling for the first few weeks, then you wonder how you lived with shit stains everywhere for so long.",
              "id": 58,
              "comments": [
                {
                  "score": 12,
                  "content": "Wow!\nWhat a ride that was reading you comment. Thank you for sharing that with us, it was very interesting and helped me understand a little bit more about what OP (and you) might be going through.\nI hope it'll help potential flying monkeys out there realize that their actions might be hurting others.\n\nNTA, and stay away from both your original bully (fuck her) and Grant. Stay safe, physically and emotionally!",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Hey friend, I’m currently making my way through Surviving to Thriving and I wondered if you also found it as triggering as it is helpful? I’ve just put myself on a waitlist for some more therapy because I’ve realised I need some support and someone to verbally process with if I’m going to read the rest, did you find that?",
                  "id": 60,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I’m really glad you asked that because yes, I found it triggering in places, like a slap of reality with a wet haddock in other places and really helpful in places. It depended on the part of the book I was in, my own headspace and what certain aspects brought up as ‘problems’ before giving ‘solutions.’\n\nIt was not an easy read at all and I took breaks (including book in the freezer level breaks of freak out), had to pace because my brain was so overloaded with good info and bad feelings and because it stirred up some actions in my life that meant reading it was both theoretical and interactive. \n\nIt was a wild ride of a read and while it helped me hugely, I did feel it intensely. I was relatively early in trauma therapy and deeply suicidal and it helped hugely with that and lessened a lot of my feelings of failing as a person when it explained why my brain was doing brain shit.\n\nI was toying with going back and reading it five years on to see if I can get a more observer eye reaction to it to help give better suggestions about it when I recommend it so thank you for spurring that on.\n\nI hope your therapy comes through soon and remember that trauma recovery is not linear. You will loop and spiral and often feel like you are back where you started so my suggestion is to start something like a journal, Pinterest board, art, planting a garden or anything that helps give you a gauge of your milestones and improvement without being specifically trauma focused so you can go to it and feel comfort when you feel stuck and remind yourself that even if you are spiralling the gaps between the loops are getting further apart and you are making more progress than you give yourself credit for from inside the spiral.\n\nBest of luck. And remember slow and steady wins the race. You have the rest of your life to heal from trauma. It’s not like a free subscription you have to use up or lose so take breaks if needed and don’t pressure yourself too much. Camp out by your trail don’t hike til you collapse. A lot of trauma work is done in the ‘down’ bits not in the ‘up’ bits of active therapy sessions or reading. You need both aspects equally.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Thank you so much.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "It’s not a competition on who has it worse, the fact is this women bullied you to the extent that you have PTSD. You owe this women nothing, and tbh I wouldn’t consider Grant to be a friend after his reaction to this situation.\n\nAll the best friend, and look after yourself",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "He doesn't, and keep in mind that PTSD is a rational reaction to extremely abnormal circumstances and there is no \"right\" or \"wrong\" way to suffer from it. However, experiencing repeated exposures to very emotionally intense events that you can't escape from IS an extremely common way for something like PTSD to develop, so it's not surprising, strange, or an overreaction for you to have PTSD due to bullying.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "you can get PTSD for so many different things, your trauma is valid even if people have it worse. you need better friends.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "GRRRRRrrrr! That is like blaming someone for being injured in a car crash because they know of others who managed to walk away from it with only a few scratches! Fvck that several ways to Sunday!\n\nIt sounds more like Grant is minimising your distress as a way of dealing with the fact that he likes Janet and he likes you and he can't / doesn't want to deal with the fact that someone he likes is also a Bad Person, and therefore since HE likes her she can't be that bad and so you must be exaggerating and WHY can't all his friends Just Get On (tm) so they can be all shades of fun together! This sounds a bit like some of the Geek social fallacies but not quite.\n\nIt sucks, It really really sucks.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "NTA your \"friend\" is a massive asshole for that alone. Trauma isn't a competition.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Your feelings are valid, Grant is not your friend if this is how he feels",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Just because children are starving in Africa doesn't mean you can't be hungry. It was an incredibly shitty and disrespectful thing of him to say.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "No one has the right to dictate how another person should feel. The fact that you have PTSD speaks to how deeply Janet bullied you and for how long. The fact that he (conveniently) doesn’t remember any of it happening or being as bad as it was doesn’t mean it didn’t happen. This invalidation strikes me as manipulative, honestly.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "I don't think he went into major detail about my mental health, but I can't say for sure.",
          "id": 71,
          "comments": [
            {
              "score": 57,
              "content": "it obvious where his loyalties are time to get new friends. i sure she manipulating him.",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 368,
      "content": "Boomer wonders why Grant is trying to push this so hard. Maybe some kind of saviour complex. NTA",
      "id": 73,
      "comments": [
        {
          "score": 221,
          "content": "I love Grant dearly and don't really understand why he's pushing this either. He even asked if I will potentially change my mind in the future and I said no.",
          "id": 74,
          "comments": [
            {
              "score": 411,
              "content": "He’s pushing this to make himself feel better about being friends with your high school bully. It was never about you, it’s about HIS comfort, so he can keep both of you without guilt. \n\nI would really want to know *why and how* they became friends so soon after high school, when he knew what she put you through; and why he’s pushing for *you* to compromise, not her. Fuck him, he’s not your friend.",
              "id": 75,
              "comments": [
                {
                  "score": 102,
                  "content": "Just my guess, but I wouldn't be surprised if Grant completely detached himself from OP's experience with bullying. He didn't see it, so he can pretend that it wasn't so bad and has been able to justify to himself his friendship with OP's bully. And of course that friendship automatically makes him more sympathetic to the bully and in turn even more unsympathetic towards OP's ongoing suffering.\n\nBasically, Grant already was a shit friend when he became friends with someone who he knew had bullied OP off her previous school.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 2,
                      "content": "We were all in school together until I escaped and transferred. He was right there in the thick of it.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "This is EXACTLY why!   He doesn’t want to feel bad about HIMSELF because he’s friends with a horrible bully.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Agree with this comment. This is more about him than about you, OP.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Cognitive dissonnance is a bitch. He's friends with both of you but he also knows that she hurt you deeply. He can't reconcile treating her as a friends when she has treated you so badly. But choosing between the two of you would require a sacrifice and either admitting to himself that he doesn't care enough about your feelings or that he has disrespected your feelings for years and has to come to terms with that.\n\nMuch easier on him to push you to forgive your bully. If her actions are forgiven then he is in the clear as well.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Don't confuse how you feel about Grant with the objective reality of his inappropriate behavior.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "You may love Grant, but he is actively harming you and clearly doesn't care about your boundaries or feelings. \n\nArmchair psych thought - Janet has some type of personality disorder and Grant is her flying monkey she sends out to continue having control over your life.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "It sounds like you are at least clear that he is not doing this for your benefit.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Then maybe it’s time to change that. If you don’t while knowing who he truly is your would be partially at fault for being hurt in the future.",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 255,
      "content": "NTA, but Grant sure is for trying to push this, and for telling your bully personal details about you. Honestly, he sounds like a shit friend and I'd be cutting him off too. He has no respect for you whatsoever.",
      "id": 85,
      "comments": [
        {
          "score": 117,
          "content": "His behavior is so weird if he was straight I’d suspect him of trying to get in the bully’s pants.",
          "id": 86,
          "comments": [
            {
              "score": 117,
              "content": "She's been trying to get into his pants since we were 14. In high school she'd send him pictures and videos of herself playing with sex toys and at the Year 10 formal (the junior prom) she wore a dildo tied to her leg under her dress and showed it off to him and other people.",
              "id": 87,
              "comments": [
                {
                  "score": 105,
                  "content": "That explains Grant's behaviour perfectly. You don't owe anyone anything. Trust me he is not your friend. He wants you to be talk to your bully not for your benefit but for hers. He wants to be the \"Knight in Shining\" armour for your bully. What a Jerk. The amount of ignorance in his comment about your PTSD says it all. OP you need to cut such people out of your life. They will only pull you down.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 76,
                      "content": "I know it's hardly the most important thing but.. Grant is gay.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "It sounds like he's flattered by her sexual obsession and enjoys the ego boost it gives him.",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Depending on when you became friends with Grant it could explain her crazy turn. She could have seen you as competition for his affection and bullied you to \"win\" him. \n\n\nIt might also explain why Grant is acting this way. If she still has a crush on him, she'll do things for him that a normal friend with healthy boundaries would never do. \n\n\nThese are potential explanations not excuses. Grant and Janet would still be behaving badly, and you shouldn't talk to them/accept their apologies.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 20,
                      "content": "She started her hate campaign against me in Year 7. Grant and I became friends in Year 8.",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": ">\tat the Year 10 formal (the junior prom) she wore a dildo tied to her leg under her dress and showed it off to him and other people.\n\nWhat the fuck",
                  "id": 93,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I really wish I was making that up",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 246,
      "content": "NTA and Grant isn't a good friend. If I were you I'd be reevaluating being friends with him.\n\nHonestly f*** bullies. Hearing that Janet's been divorced twice and has no friends honestly gives me a justice boner.",
      "id": 95,
      "comments": [
        {
          "score": 138,
          "content": "She also got arrested for a DUI, I heard.",
          "id": 96,
          "comments": [
            {
              "score": 120,
              "content": "And you've come through a lot of trauma, have a career you love & are living well.\n\nGears of karma grind slowly but sooner or later they come through.",
              "id": 97,
              "comments": [
                {
                  "score": 189,
                  "content": "Even a couple of years ago, she told a family friend not to be friends with me. I was stunned and said \"why is she still obsessed with me after all this time? I'm not all that exciting,\"",
                  "id": 98,
                  "comments": [
                    {
                      "score": 87,
                      "content": "I had a bully just like this- years of pain, campaign to destroy me, the works. Years later I find out *shes a lesbian and had a crush on me.*",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "... honestly i dont trust that her intentions now are genuine at all, id most definitely stay far away from all that...",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "There you have it right there. She still has some weird thing about you to this day. I doubt her intentions are pure and I’m sure she remembers everything she did and she’s lying.\n\nStay far away from her and consider dumping Grant as a friend. NTA all the way.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Fucking yikes. Honestly, at this point, I'd ease back on your friendship with Grant too. He sounds really selfish. He knows all about Janet's targeted harassment campaign, but he's invalidating your experience and trying to pressure you into contact with someone who has an established (and recent!) history of cruelty toward you, because it's slightly more convenient for him to have the two of you get along. \n\nYour 20s are the time when you typically grow out of/let go of toxic or incompatible childhood friendships, and it sounds like Grant is someone you may have outgrown.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "A couple years ago she was still doing this but now wants to 'sit down and talk'? It sounds to me like she just wants her foot back in the door to treat you horribly again. HUGE red flags. Obsessive people are dangerous people and Grant talking about you with her and updating her is not doing you ANY favors. Please be careful. And reevaluate your relationship with Grant, or at least, be very careful what you tell him in the future.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 82,
      "content": "NTA And Grant sounds like shit too.",
      "id": 104,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 78,
      "content": "Lol why tf is Grant so invested in turning you and Janet into friends? Absolutely NTA.",
      "id": 105,
      "comments": [
        {
          "score": 79,
          "content": "He said explicitly he didn't want to choose between us although I certainly never suggested anything of the kind.",
          "id": 106,
          "comments": [
            {
              "score": 76,
              "content": "OP this was never about picking sides. If he was a real friend he should have always been on your side. I don't understand how you've let him turn this into a 'me vs her' situation. You need better friends who are loyal and won't play mind games with you. Cut him off",
              "id": 107,
              "comments": [
                {
                  "score": 11,
                  "content": "There's a chance that the BULLLY is making it a her vs me situation or is spinning it to make it sound like \"oh yeah her. Well she won't let us be friends, I WANT to fix it but she wont\" sort of situation.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "BOOM. I called it. This is all about his comfort. You need to ditch this backstabbing “friend.”",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "NTA. You may not have asked him to choose, but by telling her your personal medical details and breaking your confidence to someone who has caused you such harm, he already has. He has shown that he values her mental health and happiness over yours. \nIt’s very sad when someone you care for so much hurts you like this, but for your mental health you need to decide if continuing this friendship is worth the pain it is causing you. Sometimes we grow out of friendships and this is ok. It’s ok to need to love on. Mourn the friendship if you need to, but your mental well-being is the most important thing here.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "OP. Grant has chosen sides though. He chose Janet’s. By staying friends with her while knowing what she did to you, he chose her side.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "He’s obviously choosing sides if he’s trying so hard to get you to forgive her :/ NTA. I suffered quite horribly in school and if a friend tried to ambush me into meeting someone that made my life hell I’d cut them off",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah, you don't have to worry about that. If someone says they're worried about choosing a side, and they're not on yours, they've already chosen the other side. \n\nHe's Janet's friend.\n\nI hope you cut this guy out. You deserve better treatment than you're getting from him. He's a two faced asshole.\n\nNTA",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Make the choice for him.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Make the choice for yourself instead, /u/Rosentic_xo. I’m so sorry that Grant turned out to be a two-faced acquaintance. This entire time, Janet has had tabs on you because of Grant.  \n\nNo one, not even your therapist or any other medical professional (who would be in the best position to diagnose this shit) is in the position to dictate how fast, how soon, how much, nor how their patient gets over their trauma. \n\nGrant is not a safe person. I’d start losing that connection with him. It’s a 14-year friendship, but it saves you from another 14 years where Janet knows what you’re up to. What else has Grant shared with Janet that you told him in confidence? It will be hard to trust his answer to that type of question. \n\nI feel so sorry for you, OP. I know how hard it is to lose such a friendship, but Grant is a conditional friend. I’m so sorry he’s pushing you to get in touch with Janet again. They’re both bullying you against what you want, which is to live your life peacefully.",
              "id": 115,
              "comments": [
                {
                  "score": 3,
                  "content": "Grant is of the opinion that everyone should just get along regardless of what's happened. He was saying \"Well I'm friends with my cheating ex (a whole other story!) so why can't you be friends with Janet?\"",
                  "id": 116,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh those insufferable what-about-isms types.  It’s their experience that matters and it’s not good enough that you just don’t want to.",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "God he’s one of those miserable rugsweepers. The saying “misery loves company” is ringing true to Grant just because he wants to be reminded of his cheating ex and expose himself to that toxicity and now the bully doesn’t mean you have to. Sounds like a him problem and not a You problem. Good luck OP I definitely think an info diet and time out of you don’t want to cut ties is a good way to go.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": "NTA. I'm sure Grant is a nice enough guy, but if you have a friend who goes around flapping their jaw about your business to people they KNOW hurt you; I don't wanna meet your enemies. Forgiveness is something that should be freely given because it is earned. \n\nYou get to decide who you forgive and when that forgiveness is offered. Don't let him pressure you into giving forgiveness to someone who probably hasn't changed (two divorces isn't a fluke it's a pattern).  \n\nFurthermore if I were you I'd be a little more discerning about the details you share with Grant. That is a complete betrayal of your trust and he has some amends to make if he wants a spot back in your life.",
      "id": 119,
      "comments": [
        {
          "score": 15,
          "content": "Also to add on to what you said about forgiveness, forgiving people who have caused you pain or trauma is never for their benefit. It’s for yours. Forgiving them doesn’t mean the damage they caused has gone away, it just helps you not live with the pain of it anymore. I’ve always lived my life by the phrase “forgive but never forget”.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 47,
      "content": "NO! Do not meet this woman. She’s lost all her friends and now remembers the shy bookworm she pushed around when you were younger, who she thinks she can still push around. She’s just trying to bully you into being her friend. NTA",
      "id": 121,
      "comments": [],
      "relation": "Support"
    }
  ]
}