{
  "post content": "For context I am mixed race but look “white passing”, although for the most part I am racially ambiguous. I grew up with my Jamaican family so some of my mannerisms are what would usually be associated with black culture. \n\nI was in a shopping mall when I got into an argument with another shopper who pushed me on the escalator. A black male security guard came over to see what was happening and as he did I happened to call the woman a common Jamaican insult. I usually try to refrain from doing this but there was a lot of give and take insults going on and my temper got the better of me and when it does, the Jamaican just comes out.\n\nThe situation finally de-escalated but as I was walking off the security guard stepped in front of me and told me “little white girls [I’m 23] shouldn’t be using Jamaican language” and that it’s a “disgusting insult to Jamaican culture” because I “don’t understand or respect the people” and that I should leave the mall because I was racist.\n\nI told him I was actually mixed race and knew exactly what the words meant and that he should mind his business. My lock screen on my phone is a family photo which I held up to show him. I told him I would not be leaving if he didn’t kick the other lady out also (although neither of us did anything worthy of being asked to leave, just a bit of an argument). I walked off without letting him say another word (he didn’t try to stop me) and carried on my day. \n\nWhen I got home however the situation was nagging me. I feel like I was unfairly judged and that the security guard was actually the racist one. So I wrote a formal complaint to the mall and provided details of the guard that addressed me. I did accuse him of racism and of unfairly trying to kick me out. \n\nMy boyfriend thinks I overreacted and could cost him his job and because I don’t look obviously black the security guard wasn’t wrong to call me white. He thinks because he didn’t actually kick me out I can’t complain. AITA for complaining about him?\n\nEDIT: because people want to know how the argument happened. This wasn’t the original basis of my question so I didn’t put it in. I more wanted to know about the security guard but if y’all find it important: \nShe put her hand on my back and pushed me forward two steps because I unintentionally stepped on the toe of her shoe (I just put my foot on the step behind me, didn’t even know she was there). I admit I jumped the bat on getting a little angry but the woman had literally pushed me before I had a chance to apologise. She started the insults by asking if I was blind or “just fucking dumb” and then I kind of lost my temper. She called me a fat whore, I called her a bitch and so on.\n\nEDIT 2: I called her a bumboclaat. Wasn’t my classiest reaction, I’ll admit. Didn’t put it in the original post because I wasn’t sure of Reddit’s rules.\n\nFINAL EDIT: thank you everyone for your judgments and views. I am aware that I could have handled the argument with the lady better and I accept I suck for that but tbh it barely affected my day. After hearing from everyone I no longer feel bad for reporting the security guard; he was racist and a little bit sexist and he needs to know that’s not okay. I feel better having talked about it and heard other people’s stories, I’m glad I came to AITA.",
  "id": 1,
  "comments": [
    {
      "score": 343,
      "content": "I’m gonna say ESH here. He was definitely prejudice about your race and was wrong in doing so. You have to take some share as you were clearly insulting another person who may not have even pushed you on purpose and were still insulting her by the time it took for a security guard to make it to you",
      "id": 2,
      "comments": [
        {
          "score": 102,
          "content": "She put her hand on my back and pushed me forward two steps because I unintentionally stepped on the toe of her shoe (I just put my foot on the step behind me, didn’t even know she was there). She started the insults by asking if I was blind or “just fucking dumb” and then I kind of lost my temper. I agree I could have walked away but how many of you have honestly walked away from every argument that arose?",
          "id": 3,
          "comments": [
            {
              "score": 54,
              "content": "Just because she started it doesn’t take away from you being a bit of an asshole too. Accept judgement even if you disagree. If I start hurling insults at someone in public I’d definitely be a bit of an asshole, even if they’re a bigger asshole",
              "id": 4,
              "comments": [
                {
                  "score": 70,
                  "content": "I’m not disagreeing with people’s judgement that I’m a bit of an asshole for the argument, I admit I can let my temper get the better of me. I’m just clarifying for all the people who said it she may of unintentionally pushed me. I don’t go around screaming at every person who bumps me in the street. I would more like people to focus on the situation with the security guard.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 22,
                      "content": "But you did step on her foot... granted not on purpose but it could have really hurt her. This is a whole messy situation from all sides. I do agree that you should have made comment to the security guards managers though, sounds like he was on a power trip calling you a little white girl",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 41,
                  "content": "Why should OP accept a judgement about something she wasn't asking for judgement on? The purpose of this sub isn't to decide if someone's an overall shit person, it's to decide if they were an asshole in a SPECIFIC situation. In this case, she asked if her behavior around the security guard was asshole-ish, and everyone keeps talking about how she acted with that woman.",
                  "id": 7,
                  "comments": [
                    {
                      "score": -6,
                      "content": "Her interaction with the woman is part of the story she’s putting to us. I can’t say she’s not the asshole in a situation which starts with her being an asshole",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Ffs OP is providing context enough with the accept your judgement shit",
                  "id": 9,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -9,
                  "content": "OP started it by stepping on her foot",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "She clearly states that insults were being passed back and forth, so it wasn’t as if she was just hurling random insults at the woman.",
          "id": 11,
          "comments": [
            {
              "score": 21,
              "content": "Hence ESH. Literally everybody sucks in this situation. She could have just walked away",
              "id": 12,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly. What a bunch of fucking children.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -34,
          "content": "He wasn't prejudiced about anything--she presents white, so it was a reasonable assumption.\n\nSecurity guard is NTA\n\nReporting the dude for the conduct described here is kind of extreme.",
          "id": 14,
          "comments": [
            {
              "score": 33,
              "content": "OP stated he said that little white girls shouldn't use the Jamacain words. That IS racist, and very presumptious here.  She admits to being the asshole with the lady she was arguing with.  That wasn't the question.  The question of AITA was if she was TA for writing to HR.  In that instance, no.  ESH, sure, but the guard was an extra prick here.",
              "id": 15,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "You are aware that there are white Jamaicans, right? Just like how there are black people who are Norwegian or Chinese.",
              "id": 16,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Jamaican is a nationality not a race there are white, Chinese, Indian, Jewish and all combinations of Jamaican. “Out of Many one people” is the motto",
              "id": 17,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 272,
      "content": "I'm going to go with NTA, even though it is a garbage fire of immaturity.\n\nFirst of all, it is sexist AF to call a 23 year old woman a \"little girl.\" Second of all, it is racist. Jamaican culture is part of you, too, even if you are \"white-passing.\"",
      "id": 18,
      "comments": [
        {
          "score": 60,
          "content": "[deleted]",
          "id": 19,
          "comments": [
            {
              "score": 5,
              "content": "What about this?\n\nhttps://www.youtube.com/watch?v=TcK0MYgnHjo",
              "id": 20,
              "comments": [
                {
                  "score": 5,
                  "content": "God might actually be dead",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "I can only sadly agree with the immaturity comment. One thing I will take from this personally is working on my responses towards situations like these and try to let things go! \nI didn’t even think of the sexism at the time but yeah, come to think of it, he was more of an asshole than I first thought.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "[deleted]",
      "id": 23,
      "comments": [
        {
          "score": 38,
          "content": "not really a wild concept, for example a white person using the n word is definitely not ok but a black persons using it is",
          "id": 24,
          "comments": [
            {
              "score": 7,
              "content": "This comment really made waves in the racism fandom.",
              "id": 25,
              "comments": [
                {
                  "score": 10,
                  "content": "deadass why they wanna say nigga so bad",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Is bumboclaat a racial slur though or just a word that people from Jamaica use? I’m British and wouldn’t be offended if someone from a different culture used twat as an insult.",
              "id": 27,
              "comments": [
                {
                  "score": 1,
                  "content": "i pretty sure it’s not a slur and i wasn’t saying op couldn’t use that word",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -7,
              "content": "In your opinion. Many of us disagree with that.",
              "id": 29,
              "comments": [
                {
                  "score": 9,
                  "content": "That's like, your opinion man, but the majority of the American black community doesn't agree with you, so I'm gonna go with what's respectful to the most people",
                  "id": 30,
                  "comments": [
                    {
                      "score": -8,
                      "content": "I’m well aware my opinion is the minority. I do find it ironic when the former minority who was discriminated against decides to discriminate against the new minority. \n\nI don’t really care what everyone else thinking. I have my own beliefs which I will always stand for.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -8,
                  "content": "idc most of y’all are probably racists in denial",
                  "id": 32,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Ah, what a perfectly executed argument. You clearly are an educated and intelligent individual. Calling the opposition racist is a graduate level argument.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "I'm fair skinned, but my dad was black enough to get killed for it, do I have the right to use the n word, master?",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -8,
              "content": "What about the OP using it?",
              "id": 35,
              "comments": [
                {
                  "score": 5,
                  "content": "she didn’t say it, the point i was making is that some things you shouldn’t say based on your race",
                  "id": 36,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah, but you didn't answer if the OP could/should say it if she wants to. Is it her genetic makeup or her outward appearance that determines if she's allowed say it?\n\nI don't think it's a very good rule you have. If you absolutely must say it, surely the person you say it *to* should be the one who decides of that's OK?",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -9,
              "content": "[deleted]",
              "id": 38,
              "comments": [
                {
                  "score": 4,
                  "content": "I don't think I've ever heard a black person lord the use of the N word over a white person's head. Like... Ever.\n\nLook, as one Mayo American to another, it really ain't our business to be telling black people how to handle slurs that were used to dehumanize them for swaths of history, and still are today. My life isn't ruined cuz I don't use a word I know has a horrible, ugly history to it and regularly makes the people targeted by it uncomfortable. Nor is my day ruined if I hear a black person call their friend the word casually cuz, again, none of my business. It ain't about us.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 4,
                      "content": "“Mayo American” I’m wheezing",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": -12,
              "content": "Yeah, but is that not fucked up?",
              "id": 41,
              "comments": [
                {
                  "score": 18,
                  "content": "no it’s not fucked up, why should someone who isn’t black be using that word?",
                  "id": 42,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Why should someone black?",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Why should one group be able to do something another can not? Its fucked up that anyone uses that word or it should matter. Being mad because white people use that word is as much discrimination as the anything else.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Try this one: nobody should use it. It is a horrible word with no good intonations. It has no use in society except to hurt",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -7,
                      "content": "I don't want them using it, I'm just saying that it indeed is fucked up how different races have different rights in regards to, say, personal dictionary.\n\nIn other words, how fucked up is it that it has come to this?",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "I would argue it is. IMO there’s a difference between using a word derogatorily vs. as a term of endearment or even just quoting someone. If anyone uses a word like that offensively then it’s just that: offensive and racist. If I call a friend. ‘My nigga’ or even just sing along to a song then I fail to see how that’s racist.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -14,
              "content": "Which is a completely idiotic double standard. If that word is so awful and hurtful then nobody should be using it. Instead it gets used an immense amount by a lot of people who then turn around and act like a different person using it is as bad a burning down a children's hospital.",
              "id": 48,
              "comments": [
                {
                  "score": 18,
                  "content": "Why do you wanna say nigga so badly?",
                  "id": 49,
                  "comments": [
                    {
                      "score": 0,
                      "content": "[deleted]",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -1,
                      "content": "I dont?",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -4,
                      "content": "He could be saying no one should use that word. Im all for my fellow Jews calling each other Kikes, but I understand that many jews and non jews do not think anyone should use the term.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "y’all are being purposely ignorant",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Are you white or something?",
                  "id": 54,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Is that relevant or something?",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -3,
                  "content": ">Which is a completely idiotic double standard.\n\n&#x200B;\n\nMaybe but your opinion on the matter is frankly completely irrelevant. Sorry not sorry. People reclaiming the word and using it within their own community isn't the same thing as culture vultures trying to jump in and play stupid.",
                  "id": 56,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Just as irrelevant as yours. :)\n\nIf you want to water down the meaning of a word by casually using it 6 times in every sentence that's fine by me. If that is the choice you make however you have no right to be offended that the meaning of said word has been so watered down.",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "Honestly. If he’d pulled me aside and just said that’s a bad thing to call someone and it’s not okay then I probably would have just accepted that I was being an asshole and moved on but it was specifically because I’m white that I can’t call someone a name? (It wasn’t the n word btw)",
          "id": 58,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 56,
      "content": "You wrote a formal complaint letter to the mall?\n\nGirl you white.",
      "id": 59,
      "comments": [
        {
          "score": 36,
          "content": "This is my favourite reply.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "it's really unfortunate that that isn't a POC thing -POC need to formally and intensely fight for the things  they deserve.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 45,
      "content": "NTA for reporting the security guard. I’m also mixed and I know what it’s like to have my heritage questioned.\nRegardless of what happened in the argument-I’m glad you accept some responsibility there- no one deserves to have their race questioned by a stranger and told that part of their culture is unacceptable because of their perceived skin colour. Good on you for reporting him, who knows if he’s done this before or would do it again, someone has to stop him throwing his weight around.",
      "id": 62,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 35,
      "content": "ESH but you still the least by the distance. That other shopper really overreacted and even though you should've walked away your reaction is still understandable.\n\nThe cop is *way out of line* by referring to you as a \"little white girl\" that's really degrading to start with. What he should've done to start with is diffuse the conflict instead of getting upset about the cultural meaning of certain specific words.",
      "id": 63,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 29,
      "content": "NTA—Also mixed b/w here. I present somewhat black, but had a black woman go off on me over email as a white person because my name is all anglo.\n\nMy take was basically yeah that's pretty ignorant. He should at least ask first before something like flaming you. I don't think it's a huge deal until you're literally telling/showing him and he's not believing you, but I don't think you have to take that crap either. FWIW, in my case, she turned out to have just transferred from an all-black campus to our more white/Latino one, and was basically having a slow roll meltdown from the transition, so I'm glad I didn't rip her a new one. Might be something similar w/ him.\n\nYou might be wrong for the insult, or maybe the other shopper deserved it, but you don't go into detail about the argument because that's not the interaction you want us to AITA, so I'll just overlook that part.",
      "id": 64,
      "comments": [
        {
          "score": 16,
          "content": "Thank you for taking the time to share your experience with me. The security guard might have been going though some stuff at the time, you’re right. I didn’t yell at him - which I’m really glad I didn’t now - but I hope if my complaint gets taken further then his bosses find out if something was wrong and help him out while reminding him it’s not okay to take it out on others.",
          "id": 65,
          "comments": [
            {
              "score": -2,
              "content": "Lol help him? They would fire him",
              "id": 66,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 25,
      "content": "NTA\n\nHe was trying to police the words you said and believed that you couldn't say them on the basis of race. He was being racist. \n\nIt sounds like he was trying to pull the cultural appropriation card or something like that.",
      "id": 67,
      "comments": [
        {
          "score": 3,
          "content": "What do you mean by \"pull the cultural appropriation card\"?",
          "id": 68,
          "comments": [
            {
              "score": 23,
              "content": "Guard assumed she was white and thought she was \"culturally appropriating\" some Jamaican slang.\n\nKinda like if you look Asian and you get in an argument with someone and call them a \"wanker\" and then an English bobby came by and he was like \"oi, that's a bit racist innit, Asian folks approproatin' our humour. What's all this then?\" but it turns out you grew up in England and he's the one who brought ethnicity into the equation inappropriately.",
              "id": 69,
              "comments": [
                {
                  "score": 2,
                  "content": "😂 that comment made my day.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -4,
          "content": "just genuinely curious, how do you feel about white people saying the word nigger?",
          "id": 71,
          "comments": [
            {
              "score": 2,
              "content": "u/nwordcountbot u/ephemeralkitten",
              "id": 72,
              "comments": [
                {
                  "score": 1,
                  "content": "Thank you for the request, comrade.\n\nI have looked through ephemeralkitten's posting history and found 1 N-words, of which 1 were hard-Rs.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Well look at that, before this comment you had a perfect track record.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "NTA\n\nI'm not touching the argument you had with the woman, because that's not what this post is about. But in the case with the guard, you are definitely not in the wrong. In the first place, it's very obvious that he was racist and was talking down to you cuz he thougth that you are white. Second, why does it matter wether a white or non-white speaks jamaican? That's just stupid. Going by that logic, no POC should be speaking english, because it originates from a white people country.",
      "id": 75,
      "comments": [
        {
          "score": 3,
          "content": "It's the shit I hear all the time because white people are not supposed to speak Spanish. So much bullshit here.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NTA - just because your’re black does not exclude you from racism. The Guard had no buissness asuming either your heritage or the reason you used the language.",
      "id": 77,
      "comments": [],
      "relation": "Support"
    }
  ]
}