{
  "post content": "So to start this off  I’m the only male in my house hold, my father passed away when I was younger, I live with my mom and my sister who is 16, I’m 17. Being the only male in the house can be really unfair sometimes, I hate it.\n\nSo me and my friend, who is the same age as me had plans already, we were going to hang out with these two girls, But my sister wanted to go hangout with her stupid boyfriend. I told her no I wasn’t going to take her because I’ve already made plans to hang out with people and when I told  her that she starts getting an bitchy attitude, then she called our mom who was at work at the time, and told her I wouldn’t take her to her boyfriend’s house, and of course you know my mom yelled at me and demanded that I took her so I did. We went to pick up my friend first. \n\nI pick him up and we are on the way to drop my sister off. He lights a cigarette then out of no where my sister starts yelling and shit, “Put that out, I have asthma!” I told her to stop fucking yelling one cig won’t hurt, she continued talking shit to me so I let the window down but she still was like “The window doesn’t help! I want him to put it out now” then I asked my friend to just put it out he refused to “you need to learn how to control your sister, you are the older brother dammit, no I’m not putting it out” Then out of no where my sister stars kicking the back of my seat like a fucking brat! I told her to stop she kept saying “Put it out! Put it out!” So I slammed on the brake and said get out of my car, she said “No I want it out now” I told her it’s my fucking car I can decide what happens in it, then she started to call our mom so, I got out the car and dragged her out and made her walk to rest of the way. \n\nWhen I got home later on that day, My mom raised so much hell, shit she even tried to take my car keys away from me, of course I didn’t let that happen, its MY car I payed for it. My mom was saying shit like “you are a horrible brother! Why would you make you sister walk by her self! What if something happen to her?” Well she needed to learn not to disrespect my car and my friends. Like I was saying in the beginning being only male in the house fucking sucks, I can’t wait to leave the shithole.",
  "id": 1,
  "comments": [
    {
      "score": 82,
      "content": "ESH - you, your sister and your friend all suck. \n\nIf your sister really does have asthma you should have asked your friend to put the cigarette out. You're dropping her off anyways, he could have lit another one soon after. \n\nYour sister on the other hand sounds spoilt and childlike, demanding rides and calling your mother every time she's inconvenienced is hardly mature behaviour.\n\nThe biggest asshole here though, by far, is your friend. \"control your sister\"??? It's not a brother's job to control their sister. The fact that you didn't stand up for your sister and kicked HER out of the car instead of your asshole friend after he had the audacity to say that and smoke in front of her with no consideration of her asthma is just sad.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 45,
      "content": "ESH but you're more of an AH\n\nShe shouldn't have been so pushy about you driving in the first place. You're not her chaffeur (idk how to spell it but you feel me) \n\nYou allowed your friend to smoke a cig with a kid in the car who has asthma! Of course she was freaking out and getting pissed off!! Opening the window is definitely not enough at all and this was extremely inconsiderate and rude! Your friend can't go a few mins without smoking?",
      "id": 3,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 33,
      "content": "ESH - you all sound like whiny little brats. You for not putting your friend in his place. Who the fuck just smokes in a car with other people without asking if it's ok first. You for being a little child and not sticking up for your sister who has a medical condition and lastly your sister for throwing a tantrum like a child instead of telling you to fuck off and walking her damn self. \n\nYou all need to grow up. \n\nP.S. - your whole intro of boohoo im the only Male and get treated like a second class citizen makes this even more whiny.  FFS this post annoyed me.",
      "id": 4,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 20,
      "content": "YTA this literally has nothing to do with being the only male in the house it’s just you are a horrible brother. You know your sister has asthma and you were going to let your friend smoke in the car. I’d probably have the same reaction too. Also kicking her out and making her walk is a dick move. If my friend refused to put out the cigarette that affected MY SISTERS HEALTH he would be the one that got kicked out. I hope this is a troll but if not please seek some help because all this maliciousness you hold towards your family is not healthy.",
      "id": 5,
      "comments": [
        {
          "score": -11,
          "content": "I think its more ESH.\n\nOP for the reasons you state, but everyone else as well. I actually think OP is the smallest AH in the story!",
          "id": 6,
          "comments": [
            {
              "score": 10,
              "content": "How is he the smallest asshole when he does not care about his sisters asthma and that he kicked his sister out of the car instead of the friend who refused to put out the cigarette",
              "id": 7,
              "comments": [
                {
                  "score": -5,
                  "content": "Because his sister in unbelievably bratty and entitled and needs to have more respect for her brother who is doing her a favour (and it is is car his rules. If she doesn't like it she can find other means of transport) not to mention kicking the back ofbthe drivers chair whilst the car was in motion. Putting everyone's lives in danger.\n\nHis friend because he was asked to put his cigarette out by OP and refused and told OP to control his sister. Added AH points because sister has got asthma so doubles down on the don't force others to inhale your second hand smoke.\n\nThe mum because she's enabling the bratty entitled behaviour of the sister. She should not have got involved but the fact that sister rang her as soon as OP said no and then Mum backed sister up in her unreasonable demands heavily suggests this is common behaviour.\n\nOP is still an AH but lesser than the others. He should have kicked his friend out of the car for refusing to put out his cigarette.\n\nEta: question baxk to you, why is no one else an AH?",
                  "id": 8,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I never said no one else is the asshole but the way he talks about his mother and sister shows some form of maliciousness. Maybe because he’s the only male? Who knows. But yes it is his car but he lives in his mother house the least he can do is drive his sister somewhere. Then the only reason why OP sister was causing a fit was because his friend lit a cigarette when his sister has asthma. Then and I quote he said “one cig won’t hurt” knowing his sister has asthma and instead of telling his friend to put it out right away he tells his sister to stop bitching even though she literally would not be able to breathe. That’s why she was kicking the seat. A childish reaction? Yes. But when you are worried about your breathing I think it’s a bit justified. Then instead of kicking out the friend who refused to put out the cigarette he kicks his little sister out and makes her walk. So yeah compared to his mom and sister he’s the asshole and so is his friend. They are lovely assholes together",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "ESH. Your friend shouldn't have been smoking around people with asthma, your sister shouldn't be kicking your chair and you should have told your mate to out out his cig.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "100% YTA!!  Are you kidding me??  She legitimately has a medical condition and you are not a doctor, so you don’t get to decide if one cigarette is not a big deal?  And you dragged her out of the car???  You should have dragged your friend out of the car for not putting out the cigarette!  You mom is right.  You are an awful brother.",
      "id": 11,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 13,
      "content": "ESH\n\nYour sister is entitled and immature, your friend is a misogynist and asshole *and smoker*, and you are terrible at finding compromises between two fools. \n\nThat said, your sister is the biggest asshole. Once she started kicking your seat, she interfered with the safe operation of the vehicle, and that's just about the biggest no-no a passenger can make in someone's car. It puts yours and everyone else's safety on the road at risk, so kicking her out of the car was completely acceptable (assuming you are in a safe part of town.)",
      "id": 12,
      "comments": [
        {
          "score": 8,
          "content": "You forgot Mum - Bratty sisters enabler. Shes also an AH",
          "id": 13,
          "comments": [
            {
              "score": 3,
              "content": "Fair point, I overlooked that for sure.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Her life was being endangered. When you can't breathe, you have to do anything possible.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "YTA.. nice friend you have there.. being a sexist towards your sister in front of you !!!! \nHowever annoyed my sister is to me , i would have set my friend straight for disrespecting my sister....\nI have a question for you..\nIf your mother would have been there in the car instead of your sister , would your friend still have lit the cigarette ?..\nAnd if your mother said she is uncomfortable would he still give your the man in the house speech ?",
      "id": 16,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "ESH. She was acting like a brat, but knowing your sister had asthma you shouldn’t let your friend smoke around her in the first place. Your friend could’ve waited a few more minutes before smoking. Your mom also kind of sucks always taking your sister’s side, but this is in no way because you’re the only male in your house hold, don’t make it a gender issue when it’s not.",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "YTA. It’s a quick drop off, it’s not that big of a deal. Letting someone smoke in an enclosed space with someone with asthma also makes you an AH. Your friend can wait to smoke. Leaving your sister somewhere also makes you an AH. \nLastly, do you think your mother likes to deal with this petty vindictive attitude you have? She’s trying to work and y’all can’t just act like adults and work it out yourselves? Had you grown up in my family your ass wouldn’t of had a car anymore after this, paid for it or not. Let your mom work and both of y’all need to stop acting like spoiled children",
      "id": 18,
      "comments": [],
      "relation": "Attack"
    }
  ]
}