{
  "post content": "I am 28M and single. Now that covid has settled down a bit in my area, I have cautiously started dating again. I use dating apps mostly and don't really meet girls until we've talked for a week or two.  Recently I met up with a girl I've been talking with for a couple weeks and we had coffee. I thought we really hit it off so we set up a date a couple nights later for drinks. That went really well too so we set up a third date for dinner. \n\nWe decided on a fairly casual restaurant where we could sit outside and that wasn't too pricey. I arrived at the restaurant first and waited for her before getting a table. When we sit down she mentions that she forgot her wallet and asked if it was ok if I paid. We had paid for ourselves on our previous dates, but I didn't really think anything of it and agreed. It's not like the place was very expensive anyway.\n\nThe first red flag was when she immediately started being rude to the waitress. We hadn't even been sitting for 3 minutes and she made a comment about it \"taking long enough\" when the waitress came to offer us water and get a drink order. I honestly thought she was making a joke in poor taste because she hadn't behaved like this on our previous dates. She ordered a gin and tonic and when it arrived she took a sip and literally refused to believe it was a gin and tonic. I asked to take a sip and it was definitely a gin and tonic. She then accused the waitress of giving her the wrong drink to which the waitress apologized and offered to bring a new one.\n\nI honestly wouldn't be surprised if the waitress just brought back the exact same drink, but the second one was perfect according to my date. She then insisted on having an appetizer because she was starving. Ok, I like apps, lets do this. But then she ordered the most expensive entree on the menu and a little lightbulb went off in my head. She ate half her entree and then decided that it wasn't good and asked for a new one. At this point I had enough and decided I needed to do something. I excused myself to the bathroom, found our waitress, explained that this girl sucked and I was leaving but wanted to pay my half of the bill. I also told her that if she told my date that she has no idea where I went, that I would give her an extra $20 in addition to the tip. \n\nIt took about 20-minutes before my phone started blowing up. Text messages flowed in asking where I was, then when reality sunk in for her, she started asking how she was supposed to pay for her meal with no money. I blocked her after I got home and told the story to my roommate. She agrees the girl sucked but thinks I was a jerk for leaving like I did.",
  "id": 1,
  "comments": [
    {
      "score": 2729,
      "content": "ESH - She sounds like a bad date, but instead of putting the waitress in an awkward position, why didn't you confront your date and call her out on her bad behaviour? Also you knew that she couldn't pay the bill, so leaving her there without any means of paying (regardless of her behaviour) was a bit shitty.",
      "id": 2,
      "comments": [
        {
          "score": 552,
          "content": "Yeah, this. You were right to leave, but you should have texted the girl and said \"you're a gold-digger and I'm out of here.\"",
          "id": 3,
          "comments": [
            {
              "score": 280,
              "content": "Building on this - if she had acted nicely on the first two dates (which I presume), her having a sudden behavior change is odd. Even moreso, if she was just after money, you'd think she'd have pushed for a nicer place or dinner on an earlier date.\n\nShe's behaving in a sketchy/assholeish way, definitely, but I wonder if there isn't some weird context behind it and it would've been good to address it head-on.",
              "id": 4,
              "comments": [
                {
                  "score": 104,
                  "content": "Eh, not necessarily (about pushing for a nicer restaurant). This happened to a friend of mine, but the girl was so smooth and never let on until the date (that cost a grand total of $22) was over and she basically taunted him for being loser and \"thanks for the free meal.\"\n\nSome people just suck.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 48,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "> Building on this - if she had acted nicely on the first two dates (which I presume), her having a sudden behavior change is odd. Even moreso, if she was just after money, you'd think she'd have pushed for a nicer place or dinner on an earlier date.\n\nYeah, just no.\n\nThe way narcissists generally trap people is by being nice at first and then gradually showing their true nature.\n\nIf they showed their true nature immediately noone would ever get in a relationship with them.\n\nDo you think women whose husbands are abusive and controlling hit them after the first date? Or do you think they gradually worked up to it?",
                  "id": 7,
                  "comments": [
                    {
                      "score": 52,
                      "content": "WTF not every shitty person is a narcaccist",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -142,
                  "content": "She might be bipolar or have some other mental disorder.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 89,
                      "content": "Bipolar disorder does not present in huge personality shifts. It results in the same personality being charged and manic, or low and slow and depressed. You really ought to read up on common mental disorders my dude, it's not cool to use them as insults if that was your intention.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 36,
                      "content": " Educate yourself on bi polar disorder and stop spreading the stigma.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Some girls just do this as a way to get a free dinner. Not necessarily a mental disorder — sometimes just an asshole.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "That's some real armchair psychology. Seriously, there are a multitude of reasons why the woman acted like that and we have no way of knowing which ones it was. I highly doubt you have any qualifications to diagnose anything, so why don't you refrain from doing so?",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -22,
                      "content": "This!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "[Text of original comment deleted for privacy purposes.]",
          "id": 15,
          "comments": [
            {
              "score": 104,
              "content": "[deleted]",
              "id": 16,
              "comments": [
                {
                  "score": 28,
                  "content": "Assuming she's a similar age to OP she probably doesn't get carded very often.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I’m 30 and get carded all the time. I would never even think of ordering a drink if I didn’t have my wallet. And having worked somewhere that sells alcohol,the rule is you have to card someone as long as they look under 40, at least in the states I’ve lived in.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "If a woman did this it would be nothing but NTA's and 'You go, girl!'s in this sub. Gimme a break. It's no different than if she went to order and forgot her wallet at home.\n\nNTA.",
          "id": 19,
          "comments": [
            {
              "score": 3,
              "content": "I think it's more along the ones of they would use the excuse that confronting a man in public you barely know is \"dangerous\" and he could become a \"threat to her safety\" after she called him on his had behavior.\n\n\nBut you know... Some how we as men are supposed to storm back into our bad dates, slam our fist on the table and shout \"I DONT APPROVE\" or something",
              "id": 20,
              "comments": [
                {
                  "score": -2,
                  "content": "The double standards on this sub especially is appalling.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[Yeah](https://i.redd.it/rque2m7if8f51.png)",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -2,
                  "content": ">But you know... Some how we as men are supposed to storm back into our bad dates, slam our fist on the table and shout \"I DONT APPROVE\" or something\n\nYeah they you'd be accused of being abusive and the reason why women cannot confront men",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Absofuckinglutely.... the solicitude and sympathy for why she may have been an AH on a bad day.... the concern for \"Oh gosh how will she ever survive\" is just hilarious. \n\nBut that is the MO of this sub.  When a woman is the AH.... suddenly there is great push to find the it takes a village angle and to apportion the blame around to everyone.  When the man is the AH, no fucks are given and \"off with his head\" to applause.",
              "id": 24,
              "comments": [
                {
                  "score": 3,
                  "content": "https://i.redd.it/rque2m7if8f51.png",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Does OP realize that if the date really insisted on not paying, like refusing to call someone to bring her the money and leaving, the waitress probably has to pay out of pocket for the meal? (That's what we did at every restaurant i worked at. Complete fucking bullshit. Dont dine and dash, youre not screwing Mr. Applebee's or whatever, you're just transferring the bill to ur waitress.) ESH\n\nEdit: i love all the people insisting i made this up for some reason?? Why would i do that...",
          "id": 26,
          "comments": [
            {
              "score": 52,
              "content": "In most states, it's illegal to deduct dine and dash from the server's wages/tips. \n\nNot disagreeing with your judgement, just pointing out that it is on the business, not the server and if the server does get charged, they can file a claim for wage theft.",
              "id": 27,
              "comments": [
                {
                  "score": 16,
                  "content": "And then they can file for unemployment because management will find a reason to fire them. \n\nWhy is everyone insisting i lied about this? Why would i do that",
                  "id": 28,
                  "comments": [
                    {
                      "score": 12,
                      "content": "And they can find an attorney to work on contingency who will file a wrongful termination suit on contingency, using the timing plus the wage claim along with the absence of employee-signed write-ups to recover damages from the employer violating state labor laws.\n\nOr they can, as you say, get another job while collecting UI.\n\nI don't think you lied. I think you made a statement about what will happen without any proof (not all managers engage in wage theft) and then doubled down.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "This. Can verify. OP is in no way obligated to let his date take advantage of him like that, and hopefully she learned a lesson. Especially since OP made sure to cover his own charges, I say NTA.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Yes, it’s illegal... and they still take it out of tips...25-year industry veteran",
                  "id": 31,
                  "comments": [
                    {
                      "score": 3,
                      "content": "And that's why wage claims and labor laws exist.\n\n—15 year veteran who doesn't let abusive bosses take advantage of them.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "Don't know where you live, but it's illegal to make an employee cover a business loss like that. (US)",
              "id": 33,
              "comments": [
                {
                  "score": 21,
                  "content": "Businesses do illegal things all the time",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "That is made up. Legally, it's wrong and a bold faced lie. In most if not literally every state businesses absolutely can not do that.",
              "id": 35,
              "comments": [
                {
                  "score": 23,
                  "content": "It absolutely still happens though.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Everybody downvoting us and saying we're lying 🤦 this is why i hate reddit",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yes it absolutely does. I was a waitress for 10 years or so and it happened several times. I always had to pay (and tip out the bar too)",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -9,
                      "content": "And that's when it makes national news and then you're really fucked because that's how often it happens.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Lmao u genuinely think that im lying about my waitressing experience on fucking Reddit of all places? 💀",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "I’ve seen it in employee handbooks that bartenders and servers will be held responsible for walk-outs...it happens all the time",
                  "id": 41,
                  "comments": [
                    {
                      "score": 1,
                      "content": "If you've got it in writing then you have an ironclad case against your employer. That's about as open and shut case as you can get.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Just replying to say I believe you because so many are saying you've fabricated this. Just because it's illegal to take the money out of the waiter's paycheck doesn't mean a restaurant won't do it. Hell, we just had to make a law a couple years ago here to say gas station attendants can't have the stolen gas taken out of their paychecks because a guy got killed trying to stop a car. It's amazing how many business try to pass their losses onto employees.",
              "id": 43,
              "comments": [
                {
                  "score": 3,
                  "content": "Thank you. I feel less like a crazy person now. My manager would clock us out at 11 regardless of how late we had to stay for cleanup sometimes, make us clock out but stay there waiting for customers to show up...it was horrible.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "This exactly what made it ESH for me. If he had paid the waitress for the entire meal but to pretend he didn't for a bit, I'd give it a slide. I don't know if the waitress could get in trouble for pocketing that as a tip? Maybe OP could have told her to keep that amount from *his* payment if/when she pays to avoid potential issue?",
              "id": 45,
              "comments": [
                {
                  "score": 2,
                  "content": "Exactly like i think paying the entire meal and ditching the date would be revenge enough.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Lol weird americans",
              "id": 47,
              "comments": [
                {
                  "score": 12,
                  "content": "Says the one with Hitler in their username",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -3,
              "content": "Not true",
              "id": 49,
              "comments": [
                {
                  "score": 4,
                  "content": "Ur right im lying abt waitressing rules. I made it up /s",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I think because she would have just left and then he would be stuck with the bill",
          "id": 51,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 52,
          "comments": [
            {
              "score": 0,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "it’s 2020 who doesn’t have apple pay on their phones lol",
          "id": 54,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -1,
          "content": "Sorry- new here— what’s ESH?",
          "id": 55,
          "comments": [
            {
              "score": 15,
              "content": "Everybody sucks here",
              "id": 56,
              "comments": [
                {
                  "score": 3,
                  "content": "Ah ok, thanks!",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "\"Everyone Sucks Here.\" Alternatively, \"Everyone's Shitty Here.\"",
              "id": 58,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 617,
      "content": "ESH, standard case of both of people doing shitty things. You agreed on something and then vanished. I get your reasons but you don't get pass on being asshole",
      "id": 59,
      "comments": [
        {
          "score": 159,
          "content": "I don’t know. If I agree to do you a favor and you’re an asshole about it the whole time, I think I have the right to back out of doing you the favor. He is an asshole for making the date the poor waitress’s problem though. Kind of ironic since he was leaving because he was upset that his date was shitty to the waitress.",
          "id": 60,
          "comments": [
            {
              "score": 17,
              "content": "He also made the fact the waitress wasn't getting paid for her time since that extra 20 most likely just went to paying the other half.",
              "id": 61,
              "comments": [
                {
                  "score": 80,
                  "content": "Nope. That's not how it works. The business can not take from waitresses to cover patrons who do not pay their bills. That is entirely illegal. \n\nThe fact that people upvote despite what is very irrefutably wrong is insane.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 28,
                      "content": "You have clearly never worked the restaurant business. That $20 was part of the payment for the table. Regardless of whether they meant it as tip or not it goes to what the table owes.\n\nIf my  friend and I sit at your table. We spend $100. I leave $60 in cash on the table an my friend leaves nothing and walks out, the manager that is following the law will comp $40 from the check and you will owe the entire $60 even though I left enough cash for my half and a $10 tip. \n\nAnd that is only the ethical managers that follow the law. Many of them do not and will try and force the server to cover the $40 out of pocket. Many servers don't know it's illegal and even those that do, don't want to deal with being fired and the legal issues that follow. Legal issues cost money and server don't have it.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "It is entirely illegal, but most restaurants have the right to fire you for whatever reason they decide. So if this woman was to walk out without paying, you could absolutely be fired unless you decided to cover the bill out of your tips. I worked for a place like this as a server.",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "People love stories.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Going back on favour is okay, but not how he did it. It's more about that than changing mind. Eg. Be adult and talk to her",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 526,
      "content": "ESH.  You conceded the high ground when you ditched your date halfway through *and paid extra* to purposely try and maximize her embarrassment.  And because of it, I guarantee you she learned nothing from the experience.  You’re now just the ahole guy that ditched her.  Use your words next time.",
      "id": 67,
      "comments": [
        {
          "score": 129,
          "content": ">Use your words next time.\n\n👏👏👏",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -12,
          "content": "She showed him through her actions. He responded in kind.\n\nThere's no need for words if he's done..",
          "id": 69,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 321,
      "content": "YTA.\nYou were TA when you posted an earlier version of this story here...\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/iz4p35/aita_for_walking_out_on_a_date_because_my_date/\n\n... and changing the details doesn't make you any less TA now.\n\nETA: Since so many are asking...\nThe story is actually the exact same formula, he changed specific details-- which were the very details that people in the first post pointed out made him the asshole. First story people said he was TA since he was the one who chose a fancy expensive restaurant and did not clarify upfront whether he was paying or they were splitting the bill. New version has him choosing a reasonably priced restaurant and her telling him upfront that she forgot her wallet. First version claims she was being rude and greedy because she ordered a $60 steak, however it was clarified in the comments that most of the meals were in the 50-60 price range, so what she ordered was an average meal for where he had brought her. In the new version she orders the most expensive thing on the menu. In the original version, he comments about how she kept complimenting the food and restaurant, like it was a bad thing. And people pointed that out to him too- like, so she was being appreciative and complimentary and that's a problem why? In the new version she complains about everything and is rude to the waitress. Both versions end with him ditching her and only paying for his half of the bill. He clarifies that in the comments of the original post too-- he only paid his half. In the first story he ditches while she's in the bathroom, in the second story he says he's going to the bathroom and ditches. The only extra detail I can see here is giving the waitress the extra $20. Perhaps that was added because people dogged him in the comments on the first post about how he potentially had screwed the waitress over as well in this scenario. It's so painfully obvious it's the same person/same story with details altered to make himself appear more sympathetic in the second version. As for the two accounts-- look at the user history. Both accounts have only the one post and no comments on any other posts than that story. And the posts were made a day apart.",
      "id": 70,
      "comments": [
        {
          "score": 108,
          "content": "Wow, after reading the other version absolutely, YTA.",
          "id": 71,
          "comments": [
            {
              "score": 11,
              "content": "It's deleted, what were the notable differences?",
              "id": 72,
              "comments": [
                {
                  "score": 23,
                  "content": "AUTOMOD  The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read this before contacting the mod team\n\nSo I (22M) asked this girl (21F) I met on an app on a date.\n\nShe lived in the suburbs and I lived in the city, but she said she wanted to try a downtown restaurant.\n\nSo I ended up booking reservations at this steak restaurant that my company hosts a lot of dinners at.\n\nDate night comes and she starts saying how fancy the place is and how she’s never experienced dining like this.\n\nI don’t have an endless bank account so I asked what she was thinking of getting and she said she was still thinking because there were so many options.\n\nThen when the waitress comes my date is the one who asks if I’m ready because she’s ready and goes on to order an aged bone in ribeye which is $62 dollars. Meanwhile the steak I ordered was like 3/4 that cost.\n\nDuring our meal she then gets a hankering for a cosmopolitan and orders that too without really asking.\n\nAnd throughout the date the conversation was pretty mediocre and I felt like she just kept talking about the food.\n\nI subtly calculated the bill and it came out to like $200 dollars and her orders made out a much larger chunk of that.\n\nShe indicated that she wanted dessert but first needed to go “ freshen up.”\n\nI felt really taken advantage of because she was ordering expensive stuff without any regard for me and called a waitress over for the bill.\n\nI ended up paying it and leaving because I didn’t want to be used for a free meal or experience.\n\nI just started my job and my wallet isn’t infinite. I felt the way she acted throughout the date was extremely entitled and I didn’t want to see her again.\n\nAITA? My dad is saying that I’m not being a “ gentleman” but he’s also the one who taught me never to order more than reasonably expensive things on other people’s dime. I felt like my date was being greedy.\n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Thank you very much",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "A copy is posted in the comments.",
                  "id": 75,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "How are these 2 posts in any way related?\nThe story is very different\nEven the account is different",
          "id": 76,
          "comments": [
            {
              "score": 32,
              "content": "Yeah and in that story the OP paid the bill, not half of it. There’s no gin and tonic rudeness, etc.",
              "id": 77,
              "comments": [
                {
                  "score": 10,
                  "content": "They clarify in the comments that they only paid their half.",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "The story is actually the exact same formula, he changed specific details-- which where the very details that people in the first post pointed out made him the asshole. First story people said he was TA since he was the one who chose a fancy expensive restaurant and did not clarify upfront whether he was paying or they were splitting the bill. New version has him choosing a reasonably priced restaurant and her telling him upfront that she forgot her wallet. First version claims she was being rude and greedy because she ordered a $60 steak, however it was clarified in the comments that most of the meals were in the 50-60 price range, so what she ordered was an average meal for where he had brought her. In the new version she orders the most expensive thing on the menu. In the original version, he comments about how she kept complimenting the food and restaurant, like it was a bad thing. And people pointed that out to him too- like, so she was being appreciative and complimentary and that's a problem why? In the new version she complains about everything and is rude to the waitress. Both versions end with him ditching her and only paying for his half of the bill. He clarifies that in the comments of the original post too-- he only paid his half. In the first story he ditches while she's in the bathroom, in the second story he says he's going to the bathroom and ditches. The only extra detail I can see here is giving the waitress the extra $20. Perhaps that was added because people dogged him in the comments on the first post about how he potentially had screwed the waitress over as well in this scenario. It's so painfully obvious it's the same person/same story with details altered to make himself appear more sympathetic in the second version. As for the two accounts-- look at the user history. Both accounts have only the one post and no comments on any other posts than that story. And the posts were made a day apart.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "I'm not sure that's the same person and story.",
          "id": 80,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 48,
          "content": "These are different people.",
          "id": 81,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "It would be funny if it was the same guy but two different women.",
          "id": 82,
          "comments": [
            {
              "score": 3,
              "content": "I so want this to be the case!",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Hahahaha! It keeps happening!!!",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 33,
          "content": "Not the same person.",
          "id": 85,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 31,
          "content": "How do you know it's the same person? They have different usernames?",
          "id": 86,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Wow, busted!",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "How are the stories even similiar bro?",
          "id": 88,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "He deleted the post but based on the comments WOW completely different story!!! YTA",
          "id": 89,
          "comments": [
            {
              "score": 6,
              "content": "[deleted]",
              "id": 90,
              "comments": [
                {
                  "score": 2,
                  "content": "> The story is actually the exact same formula, he changed specific details-- which where the very details that people in the first post pointed out made him the asshole. First story people said he was TA since he was the one who chose a fancy expensive restaurant and did not clarify upfront whether he was paying or they were splitting the bill. New version has him choosing a reasonably priced restaurant and her telling him upfront that she forgot her wallet. First version claims she was being rude and greedy because she ordered a $60 steak, however it was clarified in the comments that most of the meals were in the 50-60 price range, so what she ordered was an average meal for where he had brought her. In the new version she orders the most expensive thing on the menu. In the original version, he comments about how she kept complimenting the food and restaurant, like it was a bad thing. And people pointed that out to him too- like, so she was being appreciative and complimentary and that's a problem why? In the new version she complains about everything and is rude to the waitress. Both versions end with him ditching her and only paying for his half of the bill. He clarifies that in the comments of the original post too-- he only paid his half. In the first story he ditches while she's in the bathroom, in the second story he says he's going to the bathroom and ditches. The only extra detail I can see here is giving the waitress the extra $20. Perhaps that was added because people dogged him in the comments on the first post about how he potentially had screwed the waitress over as well in this scenario. It's so painfully obvious it's the same person/same story with details altered to make himself appear more sympathetic in the second version. As for the two accounts-- look at the user history. Both accounts have only the one post and no comments on any other posts than that story. And the posts were made a day apart.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 157,
      "content": "There's no excuse for her to be rude to the waitress (I hate that) but what you did could have got your date arrested for theft of service had she truly not brought her wallet. You agreed to pay for the food and even the most expensive thing on the menu could not have been that much if it was a fast casual place like you mentioned (plus you gave an extra $20 to the waitress). You're not saying she was using you for a meal since she paid for herself the first 2 times. Why didn't you just tell her she's acting rude? I get it she was a bad date, so don't go on another date with her. But to leave out the back like a coward and have her (maybe) arrested is wrong too. Don't agree to pay if you are going to run out. ESH.",
      "id": 92,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 61,
      "content": "Yikes, I don't blame you for leaving but at least have the balls to tell your date to her face, instead of sneaking away.",
      "id": 93,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 38,
      "content": "\\*sigh\\* I really want to say nta here. I certainly support the idea of ditching her for her behavior. But you did promise to pick up the whole tab for the date. Either she and/or the server's gonna have a problem when it's time to settle the tab, generous tip or not (if anybody with FoH experience can give insight oh that, I'd love it.) So I gotta say ESH. You should have cut the date short, paid for it all as agreed, and then ditched her.",
      "id": 94,
      "comments": [
        {
          "score": -1,
          "content": "She was clearly taking advantage. Not sure I can call him an asshole for not paying for something when she was trying to make him spend as much as possible. If you do someone a favour and they’re a dick about it then you shouldn’t be obligated to see it through...",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 27,
      "content": "ESH and YTA- way to leave the poor waitress with your shitty date and the drama that I’m sure followed. Sure your date was crappy but you should have had the backbone to confront her face to face instead of sneaking away like a coward and bringing a random stranger into your drama. Not only did she have to continue to wait tables but she had to deal with a girl who just got left on a date with no money and a bill needing to be paid. She probably had to then involve her boss. All because you couldn’t be honest.",
      "id": 96,
      "comments": [
        {
          "score": 2,
          "content": "He gave the waitress who got shit on by her $20 to lie to her and play dumb. HE GAVE THE WAITRESS $20 TO GET REVENGE ON HER. What OP did was do the waitress a solid.\n\nWaitress: This woman was bitchy to me\n\nOP: I'm sorry for her behavior. Here's $20 to help enact petty revenge for both of us.\n\nWaitress: Thanks!\n\nThis sub: OMG OP is a fucking asshole for mistreating the waitress!",
          "id": 97,
          "comments": [
            {
              "score": 12,
              "content": "Nah, I waited tables for 6 years and I wouldn't have wanted to be part of this shit even for $20. I don't want to deal with other people's personal issues/bullshit and $20 isn't really worth getting screamed at or someone making a scene like I feel this woman might have. Or dealing with someone who can't pay the bill. That's a whole bunch of bullshit (where I worked they would take the person's ID to ensure they'd come back and pay the bill later if someone didn't have their wallet ... I would not want to be the one to tell this lady to give me her ID). Or demand she use her phone to pay or something (which no doubt would make her flip out). No fucking thanks.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I waited tables for years, I would never want to deal with this Jerry Springer drama, not even for $20. Especially when there is a whole restaurant filled with customers & other tables needing to be serviced. That’s like starting a fight with someone at the bar then Running off and giving someone $20 to take the outcome. That’s just fucked up. He should have paid the bill, told the girl he didn’t see things working out & then leave. What he did was extremely inconsiderate & shitty & he should go to the restaurant & pay the waitress some more money for dealing with his problems.",
              "id": 99,
              "comments": [
                {
                  "score": 0,
                  "content": "How about she goes back and pays the bill? He paid for himself. Why can't she pay hers? Right, because she's a woman. The misandry here is insane.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Idgaf who pays it but someone owes that poor waitress more than $20. Dude agreed to pay the bill then bounced leaving the waitress to deal with the blow back. He caused the dramatic situation so he should pay, if not, the wench should magically read his mind & know that he didn’t pay (I mean how would she know he ghosted her like a child) & go hook the waitress up. Either way, they did something shitty. Let’s not split hairs just to argue.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -8,
          "content": "I think 20 dollars would help smooth that bump. Plus, all the waiter would have to do is tell the manager she can't pay as she forgot her purse. Then the manager can deal with it.",
          "id": 102,
          "comments": [
            {
              "score": 6,
              "content": "It was the most worthwhile table for the waitress that day and the entirety of the work she had to deal with is play dumb for half a second. I'd bet the waitress would be ecstatic if all nothing lunches gave $20 tips. This sub is unbelievable.\n\nHe also helped the waitress enact petty revenge.",
              "id": 103,
              "comments": [
                {
                  "score": 5,
                  "content": "You people have obviously never worked as a server in your life. Most likely you're infantiles who watch petty MTV teen dramas and have a penchant for humiliating random people. \n\nA server's job is BUSY. They don't have time for your petty bullshit dramas and definitely dont want to be included in it for \"omg 20 bucks.\" Are you 12? 20 bucks won't cover a phone bill. Might as well be $2. Roll my fucking eyes at the immaturity and ignorance of you commenters with absolutely no life skills or experience. Like...just go sit in a corner and stare at a non interactive screen.",
                  "id": 104,
                  "comments": [
                    {
                      "score": -1,
                      "content": "lol what are you even trying to say? Why would I even have cable TV especially watch MTV? Can anyone translate boomer?\n\nMy life experience is more than just waiting tables.  I aimed a little higher, thanks.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 24,
      "content": "ESH. I agree with you that this chick sucks, I guess she was just comfortable enough to start showing her true colours. But you could have just told her you didn’t like her behaviour, pay and left. Instead you took the d*ck route.",
      "id": 106,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 18,
      "content": "NTA - I think this breaks the sub rules but oh well. She sounds fricking awful, you don't have to put up with that and pay for the \"privilege\"",
      "id": 107,
      "comments": [],
      "relation": "Support"
    }
  ]
}