{
  "post content": "So, I am responsible for doing the shifts roster where I work. I'm not a manager, and I don't get extra money for doing this, it just has always been the rule here that the roster is done internally (i.e. by the employees themselves, not by the boss). We are only a small facility with a handful of employees (can't explain what we do exactly, as I don't want to risk being identified). One of the employees has moved on to another department in the same company, and she used to do the roster, so when she left, as the person who has been here longest and who knows how things work, it made sense for me to take over doing it.\n\nA new person is coming to replace her, and I messaged her to ask her to give me the dates she wants to go on leave. Now, an important part of this is that we used to be able to afford to have 2 people go on leave at the same time, but one of the other employees has been unwell and had to take indefinite leave. The powers that be have said he will not be replaced, so my boss has said that from now on, we can only have 1 person away on leave. I had submitted my leave to my boss a few days ago and he said it was fine (this was a verbal agreement, however, which I admit was a mistake on my part). Now the new girl is also requesting leave on the same dates. I explained the situation to her and she doesn't want to budge.\n\nShe said she is going on holiday, it's already booked (plane tickets, accommodation, everything) and all non-refundable, so she would lose a lot of money if she cancels. My plans for my time off are that I'm going to a friend's wedding. I have paid for plane tickets, but I'm staying with another friend, so no accommodation costs. The guy getting married is a childhood friend and my guy best friend, and I'm also friends with his fiancee (in fact, I introduced them), and I'm a groomslady (best man is our other best friend). \n\nI feel like an a\\*hole saying no to her, especially because I feel like I now have power as the person doing the roster, and I don't want to abuse it. In previous cases, when there was such an issue, the person doing the roster would sacrifice him/her self, because otherwise people comment that they are abusing their power, and I don't want to do that. On the other hand, I would feel absolutely awful not going to my friend's wedding. I don't want new girl to resent me forever, but I know if I give in and don't go to the wedding I will resent her instead.\n\nI could involve my boss, but he may very well say we should sort this out between us, or flip a coin, or something along those lines. So, would I be the A\\*hole if I told her she can't take that time off?\n\nPS Please don't say it should be up to our boss to figure this out, or it should be up to the higher ups to get a new hire to fill in for the person who is unwell and had to go on indefinite leave. I get that that is what *should* happen, but it's not going to. No, I cannot leave my job and find another one (for various reasons).",
  "id": 1,
  "comments": [
    {
      "score": 28,
      "content": "Chances are she'll just quit and go on the trip then find a new job when she gets back. I'd tell the manager that you both have booked tickets that are nonrefundable and ask if there is someone from maybe another dept you can train to fill in temporarily. It sounds like an unskilled job, so that may be doable. NAH",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "You may find this hard to believe, but no, not an unskilled job (quite the opposite). And she can't quit as she has to do this job as part of her training to get a professional certification (part of the reason I can't quit either). It's complicated but essentially our job is quite specific and we need to complete time in various departments in order to get our certification. It's public sector and chronically underfunded though, which is why they won't provide a replacement for the sick employee.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "NTA. You put it in first. Your boss may have to be the one who enforces it.",
      "id": 4,
      "comments": [
        {
          "score": 6,
          "content": "She also had a conflict with another coworker (for different dates). The other person backed down and agreed to switch dates to accommodate her (even though they submitted their request first and had my backing), so now I look like the bad guy who won't help the newcomer out.",
          "id": 5,
          "comments": [
            {
              "score": 10,
              "content": "I see it in another way... She was accomodated in one instance... In the second she need to accomodated some One.\n\nThere's two dates, she won one... Is fair she loses the other.\n\nIf you set a precedent where she win every date she wants, she will expect it in another time.\n\nAnd as the new bee, she has no right to choose... You all are more time there, are more tired for working for more time, you need it more.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You shouldn’t have to be in this position. You may decided to concede here, but really, you have no obligation to the new employee.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Not true. It sounds like the other girl just transferred to this dept and told her right away about the dates.",
          "id": 8,
          "comments": [
            {
              "score": 7,
              "content": "The new person’s dates are irrelevant. They are new to the team. Seniority answers this issue.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. This is above your pay grade and position. You have had your time off approved. Take it. Tell your boss of the conflict and ask if they can find additional coverage for those dates.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA and I do think the person to involve is your boss because this is not a normal disagreement/conflict about timing. This is a person whose decision to come on board may well turn on this pre-booked vacation time. If she already worked there, then things would likely be about who put their request in first, end of story. But that's not the case, and working around a new hire's existing commitment she paid for is an onboarding issue, not so much a scheduling issue. Unless your boss makes you change your plans, I wouldn't do it, and I'd also bring it to them because if they think its worthwhile, they are the ones with the ability to make something work for the window when you both have commitments, because it's worth it to them in the longer term to have both of you on the roster.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "A standard question for new hires is whether or not they have any upcoming plans or anything that may conflict with a schedule before starting.  If she made the company aware, BEFOREHAND, then she is well within her rights to continue with her plans.  Too bad, so sad, for thr company.  If she sprung the news as a sudden, unplanned request, then sucks for her.  Ultimately, it is up to management/HR to make the final determination & they're entirely inappropriate for placing you or anyone else in that position to begin with.  Frankly, if she made her request known beforehand & they also approved your leave, then you BOTH each should proceed with your individual plans & let HR/Management actually do THEIR job & suck it up.  \n\nIt can't be determined if you're an asshole or not, until those questions are answered.",
      "id": 12,
      "comments": [
        {
          "score": 2,
          "content": "So, I used the word \"company\" to describe it because I'm a bit unsure of the correct English word. It's more of a government agency (not sure if that is exactly the right term either). This job is part of training for a professional certification. We don't get hired by HR. We get assigned to different posts by our training body. So there is no interview (except the initial interview when you apply to be accepted to do this certification). Every person (depending on what specific certification they are doing) will get assigned to different posts, eg. 6 months in post A, 3 months in post B etc. They assign you based on what the requirements for your certification are and based on what posts are open at the time. There is an HR here but they don't really deal with people doing the certification training, except for certain specific things (for example, salaries, making sure our paperwork is correct, that we have clearance to work etc) but they don't deal with our rosters or our transfers. So first time anyone heard about her leave here was me when I asked her. The thing is, what usually happens (at least what most do when they transfer to a new place), people will start work first and then establish that their leave is secure and approved before booking stuff, like trips etc. Or if they are eager to book something, they will try to contact someone ahead of time to check. Not sure why she didn't do that.",
          "id": 13,
          "comments": [
            {
              "score": 1,
              "content": "Based on that, then I'd say NAH & lean towards you're NTA.  \n\nYou are NTA for getting your time off locked in.  She is (presumably) an adult & should have taken more initiative to make the \"team\" aware of her plans before having to be prompted by you.  I say move forward with your plans & she will simply have to deal with the fallout for her own decision & not providing advanced notice.  \n\nI still say you're NTA, because you followed the guidelines you were provided.  But she MAY also not be the asshole because it sounds like procedures are very loose & there is no proper hierarchy or accountability.  If it is a certification program, then I think she will just have to take her chances & deal with the fallout of whatever happens.  Perhaps she can simply make up her missing time & extend her training to make up what she missed.",
              "id": 14,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH\n\nYour boss refuses to hire anyone to fill in for the lost employee.  You should both go on vacation and leave him to deal with it.\n\nThe fact that you haven't even tried to involve the boss is odd.  Ultimately, it's his problem.\n\nIf you refuse her leave in favour of your own, then YWBTA, because that's straight up abuse of power.\n\nTELL your boss that there will be two people going on leave and he needs to find a temp.\n\n(Edit)  Who books plane tickets BEFORE knowing whether or not they have time off?",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the AH because not giving my coworker the time off because I want to take the time off instead may be an abuse of power, and because it will cost her a lot of money.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA.  you requested the time off first and your manager agreed to it.  your new colleague did not before booking the tickets/accommodation (something you always do beforehand or its on you, not the company).\n\nrequesting the time off is also not enough, it has to be approved as well before you can even think of suing the company to recover your costs.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, I am responsible for doing the shifts roster where I work. I'm not a manager, and I don't get extra money for doing this, it just has always been the rule here that the roster is done internally (i.e. by the employees themselves, not by the boss). We are only a small facility with a handful of employees (can't explain what we do exactly, as I don't want to risk being identified). One of the employees has moved on to another department in the same company, and she used to do the roster, so when she left, as the person who has been here longest and who knows how things work, it made sense for me to take over doing it.\n\nA new person is coming to replace her, and I messaged her to ask her to give me the dates she wants to go on leave. Now, an important part of this is that we used to be able to afford to have 2 people go on leave at the same time, but one of the other employees has been unwell and had to take indefinite leave. The powers that be have said he will not be replaced, so my boss has said that from now on, we can only have 1 person away on leave. I had submitted my leave to my boss a few days ago and he said it was fine (this was a verbal agreement, however, which I admit was a mistake on my part). Now the new girl is also requesting leave on the same dates. I explained the situation to her and she doesn't want to budge.\n\nShe said she is going on holiday, it's already booked (plane tickets, accommodation, everything) and all non-refundable, so she would lose a lot of money if she cancels. My plans for my time off are that I'm going to a friend's wedding. I have paid for plane tickets, but I'm staying with another friend, so no accommodation costs. The guy getting married is a childhood friend and my guy best friend, and I'm also friends with his fiancee (in fact, I introduced them), and I'm a groomslady (best man is our other best friend). \n\nI feel like an a\\*hole saying no to her, especially because I feel like I now have power as the person doing the roster, and I don't want to abuse it. In previous cases, when there was such an issue, the person doing the roster would sacrifice him/her self, because otherwise people comment that they are abusing their power, and I don't want to do that. On the other hand, I would feel absolutely awful not going to my friend's wedding. I don't want new girl to resent me forever, but I know if I give in and don't go to the wedding I will resent her instead.\n\nI could involve my boss, but he may very well say we should sort this out between us, or flip a coin, or something along those lines. So, would I be the A\\*hole if I told her she can't take that time off?\n\nPS Please don't say it should be up to our boss to figure this out, or it should be up to the higher ups to get a new hire to fill in for the person who is unwell and had to go on indefinite leave. I get that that is what *should* happen, but it's not going to. No, I cannot leave my job and find another one (for various reasons).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "If your request was approved first, then NTA. Time off is generally \"first come, first served,\" in my experience. Is there any way to get your approval in writing without involving the manager in the details? It seems ridiculous to give one equal coworker the power of scheduling over everyone else for reasons like this. \n\nI would prepare for her to not show up though, but the responsibility of coverage should not fall on you if you two are equal coworkers (ie, you aren't a manager or shift lead or higher paid/ranking employee). If you were approved and she isn't, and she doesn't show up for her shift, that isn't on you at all.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    }
  ]
}