{
  "post content": "I (25f) haven’t had a great relationship with my family since moving out, cliche bullshit, brother (30) was the golden child, I was a scapegoat, etc. etc. anyway, that made it for a rough relationship with them and have really spoken to them for 6-7 years. Well a few weeks ago I was contacted though Facebook by a woman who claimed to be pregnant with my brothers child, the problem is he is refusing to claim said child and wants nothing to do with the mother. She told me he has completely ghosted her and blocked her on everything, and apparently my mother has been quite hostile when she has stopped by to try and talk to him, and has threatened to call the police for trespassing if she comes around again. So she tells me this and asks if I’d be willing to do a DNA test after the baby is born so that she can take my brother to court. I told my husband about this in front of some of our friends and one of them piped up and said I shouldn’t get involved with something that has nothing to do with me and that it’d be spiteful to do that to my brother, my husband kind of agreed and said I shouldn’t get involved with my family again. I’m honestly not sure, on one hand I don’t want to have any of my family contact me after doing the test, but on the other hand I wouldn’t want that to happen to me, my brother lives rent free and makes more than enough to buy a house, he should have to take responsibility for a child he helped create. \nThe baby is due in a few months so I have time to decide what I want to do, I’m leaning towards doing the test, but WIBTA?\n\n\nUPDATE/EXPLANATION: The most common response and question I’ve gotten to this post is why doesn’t she just petition the court to get a paternity test? I live in a not so well off area and this exact scenario happens all the time here, the lawyers she’d be able to get have hundreds of these cases and it will take years for her to have her day in court. She wants to have some shred of evidence to prove that my brother could be the father so that it’s more likely a good lawyer will take a look at her case, or that my family will see that he is the father and come to some type of arrangement with her.\n\n\nSMALL UPDATE: My birthgiver decided to try and threaten me last night, somehow she found out that, let’s call her Eve (not her real name), contacted me to ask about DNA and let’s just say that BG was not happy. She sent me an anonymous message about how horrible of a child I am for even thinking about siding with Eve, and that I should be thinking about how terrible it is for my brother to “be accused” like this, and how she will sue both of us for defamation, and just an all around mess of insane choppy texts that vary from accusing to guilt tripping. I am not replying but I am keeping records for court, and I’ll probably get a new number, but that’s what I’m dealing with at the moment, I will update as things progress.\n\nSMALL UPDATE:\nSo sorry to leave everyone hanging, I’ve been dealing with a bunch of bs. So the biggest update, my little niece was born in August 2022, she is absolutely beautiful, she is my niece and my brother is 100% the father. So now, unfortunately, I’m dealing with a bunch of bs with my family, my birth giver is trying to say she will take Eve to court to sue for custody. I will laugh in her face on that day because we have kept all of the threatening messages and voicemails towards Eve and myself, we have also spoken to a good lawyer who told us we have nothing to worry about, we just shouldn’t reply as she just keeps digging herself into a deeper hole. As for my brother, he’s completely ghosted everyone and everything, my birth giver apparently sent him on a vacation after everything went down, he started getting a ton of hate from the rest of our family for being a deadbeat. I will update once the custody issue is cleared.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Taking a dna test to prove my sibling is a father because he refuses to take responsibility but I could be being spiteful because we have a strained relationship\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post. [To learn more about the test click here](https://www.reddit.com/r/AmItheAsshole/comments/tio99u/so_we_decided_to_fuck_with_the_sub_again)*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. Do the test. If it proves paternity for your brother, then he will need to take financial responsibility for his child. If it proves otherwise, then at least the mother will know. My only concern would be your family pushing for custody if the test proves paternity.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA but stay out of this mess. The court’s gonna make your brother do a DNA test to establish paternity.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA at all. I think it's morally the right thing to do. Although I think you need to be careful because it could mean more family drama. If I was in your position, I would take the test though, because that is the right thing to do. I hope this helps OP, take care",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. Don’t go around father children if you don’t want to help support them",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "You don’t have the same dna.",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "They have half the same DNA, assuming they're full bio siblings.",
          "id": 9,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "No but it will show that there's a high probability of relation, which could expedite the process (either the mum can get access to a lawyer quicker bc she has more proof of her claim, or the brother realizes this isn't going to go away)\n\nDNA can trace your family back by generations, so this would be a big blow since his sister is a very close match.",
          "id": 10,
          "comments": [
            {
              "score": 1,
              "content": "mitochondrial DNA can trace back to common maternal ancestors, but that's not what they check in a paternity DNA test",
              "id": 11,
              "comments": [
                {
                  "score": 1,
                  "content": "I mean they're wouldn't be doing a paternal DNA test on OP, just a basic one that can guestimate relation, which exists for cousins and nieces etc.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. Do it. If this child is your brothers it deserves the child support and the benefits it is entitled to. Alternately, it allows the mother the opportunity to ask him to revoke his parental rights so that he has no claim over it later in life. Clearly your brother is aware of this woman, and is simply trying to avoid responsibility. If you aren’t in communication with your family, it’s not like this will make that relationship worse (will it?) You can set your own boundaries with this woman regarding your own relationship with her and the child, and make it clear how much you want or don’t want to get to know them- I would think ahead and potentially consult a lawyer to see if participating puts you at risk (if you’re in the States you can get sued for pretty much anything, so might as well make sure you’re protecting yourself).",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "I’m not worried about making the relationship “worse” per say, but my family is definitely the type to try and sue for the smallest of things, and my mother loves sending her little flying monkeys out to harass me, and she would definitely do it if I dared to make her precious little boy do something he doesn’t want to. It’s a whole storm that would be thrown my way. But I do want a relationship with my potential niece/nephew and their mother, she seems like a really sweet girl, just not so great choice in relationships.",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": "INFO- Why isn't the mom going for a court order DNA test.\n\n This is the saftest option and to be honest you have matching DNA means crap in court. They need his  DNA",
              "id": 15,
              "comments": [
                {
                  "score": 1,
                  "content": "She is planning on going to court, the biggest issue is that she has no money and very little family, she can’t afford a good lawyer, most of the lawyers around here that help people in similar situations are booked up with hundreds of stories just like hers. She is hoping to get proof that her child is related enough so that she can at least have a good lawyer look at it, otherwise she will be waiting years for her case to go to court. This has happened to a lot of people around my area, it’s a big issue here. That’s why my brother likely thinks he can get away with it, most women will just give up trying to get the fathers involved.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1,
                      "content": "What if you both did a 23 and Me. The baby would be listed as a relative and you would have plausible deniability that you didn't help her. It's not \"your fault\" she did the test and found you.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Are you in the States? If so, she can seek out “legal aid” with family court specialist. They can get the fees completely removed in worst case scenarios, and sliding  pay scales if you have some income, but not enough for a lawyer.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "NTA I would do it",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "If you can financially, could you help her afford a lawyer? Like, find a good one, pay him, and have him reach out to her saying an anonymous benefactor has provided funds? This way you could help and have plausible denial if your family ever comes at you?",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Are you in the States?  If she applies and is approved for government assistance, the state will also go after the father for child support to make sure he is equally contributing to the child.  \n\nThat could be a way for you to not get involved but this woman to get the DNA test done.  Have her apply for WIC and food stamps.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "There is another aspect of this too - if the court does it then the result can be trusted and cannot be disputed. If OP colludes to collect a sample without his knowledge and only the mother controls how the sample is sent and how the results are sent then two problems can occur: firstly she can control the outcome of the test. That muddies things significantly. For all we know this woman is trying to manipulate OP into creating false ‘proof’, leveraging the fact she knows OP already dislikes her brother. It may sound far fetched but there is no reason to take the chance. Secondly even if it’s genuine, there’s doubt over the result, he can contest the result and the court would order one anyway. Let the court sort it out fairly.\n\nThis whole issue hinges on the fact that OP already believes the woman more than her own brother, and that is skewing peoples responses - they’ve already decided what the test result is and what the motivation for wanting one is. Yet it’s strange that her brother and mother are going to such lengths to distance from her and even potentially getting police involved - that’s pointless if she’s telling the truth because she could take him to court anyway and force a test. It doesn’t really stack up.\n\nThere just seems no upside for anyone in getting involved here.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 1,
                      "content": ">That muddies things significantly. \n\nIt doesn't muddy things at all. The court will still order a test. If the woman tempers with evidence she is only hurting herself.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I didn’t get the impression she was asking OP to get a sample of her brother’s DNA, but rather to take a test with her own DNA to prove a relationship existed.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "[deleted]",
              "id": 25,
              "comments": [
                {
                  "score": 1,
                  "content": "My mother can’t stand anyone who dates my brother. She’s very emotionally incestual with him, it’s honestly so gross. I doubt she would acknowledge any spawn made from a relationship with another woman. I fully believe she would have her own children with him if it wasn’t frowned upon.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Sorry your mother destroyed your brother.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Ummm what. Why do you want to have any connection to, what ever this is.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA every child has a right to know who their father is. If I were you I wouldn't trust my husband anymore though.",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA.  This could save a lot of time and money if you take the test.  She could approach your brother and get him to own up to his responsibilities.  If he refuses then go the court route.  I don't see this as revenge but doing the right thing, something your family doesn't seem willing to do.  If she's lying about your brother then it goes no further, no money wasted on lawyers by both sides.",
      "id": 30,
      "comments": [],
      "relation": "Support"
    }
  ]
}