{
  "post content": "I have 4 kids, 23, 20, 16 and 13. This concerns my oldest, I'll refer to her as 'Zara'\n\nWe don't normally do big parties in our family after double digits (and 18th/21st), but Zara has been going through a bit of a difficult time so we decided to throw her a surprise party. This was yesterday.\n\nIt was a big family party and Zara was enjoying it. Then the cake was brought out, I have a lot of young nieces and nephews so naturally they wanted to stand up with Zara, and she had no issue. When she went to blow out the candles, my 5 year old niece blew most of them out before her.\n\nEveryone laughed it off, my youngest actually put 23 candles on the cake and there were still a few lit, so I told Zara to blow those out. She did, but she looked angry and started crying. She then walked off.\n\nAfter that it got quite awkward and my sister (niece's mom) got upset/embarrassed, that her daughter is a kid and didn't mean to do it, and she didn't think Zara would act like this. We all calmed her down that it's not their fault.\n\nI talked to Zara and told her she was being a selfish brat and making a scene, she's 23 getting mad about birthday candles.\n\nShe was still upset, and my other kids are telling me I wasn't being fair with Zara.",
  "id": 1,
  "comments": [
    {
      "score": 51147,
      "content": "“She didn’t think Zara would act like this”\n\nSo she knew her daughter was going to blow out the candles. \n\nYTA\n\n\nedit :OP’s daughter is grieving the death of her friend. OP is a major AH in more ways than one.\n\nsecond edit: it was the daughters fiancé that purposed to OP’s daughter that passed. OP’s daughter would have said yes. poor dear I hope she is okay.",
      "id": 2,
      "comments": [
        {
          "score": 28720,
          "content": "Also her daughter \"didn't mean to do it.\" Yes, she did. She meant to blow out someone else's candles; it wasn't an accident she inhaled, then exhaled at full volume toward a flaming dessert. And five is old enough to know if it isn't your birthday/cake, then you don't blow out the candles. The Aunt knew what her daughter would do.\n\nIt must be exhausting to live in a family where even on your birthday, your feelings aren't important, and they aren't really celebrating you...because I'm betting this isn't the first time the eldest was dismissed. (Wanna bet she's always had to set aside her feelings, first for her younger siblings, now for the nieces and nephews.)\n\nYTA.",
          "id": 3,
          "comments": [
            {
              "score": 10382,
              "content": "And why the hell not relight them?!",
              "id": 4,
              "comments": [
                {
                  "score": 14530,
                  "content": "That’s the biggest AH moment. You see she’s upset so immediately relight them and move the niece. \n\nI’d also be very concerned if my 24 year old had this reaction. This isn’t an incident to make her this upset but it could very well be the straw that broke the camels back. OP needs to be a better parent and check in with their kid because she’s going through something.\n\nETA: found out that OP’s daughter is dealing with the death of a close friend. OP is YTA even more for hiding that info and double for treating their child this way when they are grieving. OP you are callus and horrible. If you’re lucky, your daughter may forgive you but don’t expect her to forget.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4106,
                      "content": "I agree. I think there's more to this story.\n\nEDIT: What is with these AITAs where people leave out the big kicker, as in 'oh BTW their husband/ friend/ parent died!' It was YTA anyway, but now he looks even worse. I wondered if he cared more about her embarrassing him in front of the 5 yo's mom than he cared about his own daughter's grief. Seriously, I'd be really concerned about my grown child cracking like that. She is holding too much inside, which is not good.\n\nI hope OP can at least tell his daughter he loves her and that he's sorry things are rough for her right now. She could probably use the reminder that he cares. I'm assuming/ hoping he does care. If he keeps leaving her hanging when she needs support it will not bode well for their future relationship.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2772,
                      "content": "The second part of this is so important. She’s 23, OP is right - this shouldn’t have the impact it did on her. But it did, and OP should be wondering why it upset her and not degrading her further. This party was thrown specifically because she’s been having a hard time and OP is shocked she reacted so negatively. YTA OP. Apologize to your daughter. Niece needs to be taught not to blow some else’s candles out. That wasn’t an accident.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "The whole reason for the surprise party is Zara has been having a hard time. There is definitely something else going on and OP's reaction to her daughter that's been having issues is \"stop being a brat\". YTA, OP.\n\nETA: Zara lost a friend recently. She's literally grieving.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 68,
                      "content": "From the sounds of it once you hit 10 in this family your birthday isn't important unless it's 18 or 21.  Zara is the oldest.  That means she hit 10 first and had younger siblings.  Her birthday was kind of over looked while her siblings got birthday parties.  OP makes it sound like everyone was treated that way but for 3 years a preteen had to watch as she was treated as less than her siblings and probably had no clue why.  It wouldn't surprise if other holidays were treated similar.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Ooof. “The straw that broke the camel’s back” is a terrifying and very real possibility. Support your kids, people.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "WHICH OP WAS ALREADY AWARE OF! That was the whole point of the party",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": ">OP needs to be a better parent and check in with their kid because she’s going through something.\n\nOP \\*knew\\* Zara was having a hard time - that's why they threw the party. And then turned around and dismissed her feelings when the nice thing got stolen / spoiled ...",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "THiS!\nIf my 24 year old was that upset and crying about something like this, I’d immediately know that obviously the candles are not the real issue. It was just the drop that made the barrel flow over ( that’s a German phrase, don’t know if it’s used in english too?). I would know that there is something else going on and my child needs help . I would talk to her and ask what’s going on. I wouldn’t call her a brat in that moment, when she is already clearly upset and probably struggling with something much deeper, than birthday candles. Doesn’t OP know that if you’re having a hard time a small thing that goes wrong can be the thing that’s just too much and puts you over the edge?\nAnd btw., the niece did mean to blow out the candles, that’s the goal when you blow on them. She was the brat, feeling entitled to blow off someone else’s birthday candles. Yes, she’s a child but her mother should have immediately to,d her that this was wrong to do and relight those candles. Then the niece could have learned that her behavior was wrong. Now she just learned that she can get away with such behavior and will even get support because she’s a child. Not a great lesson, since she won’t stay a kid forever.\nI would have my daughters back, relight the candles, told my sister and her kid that this wasn’t nice ( I wouldn’t yell or anything but still say it wasn’t right ) and then let my daughter blow the candles, enjoy her birthday and later have a good conversation, to find out what’s going on in her life and what she struggles with and if she needs help.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "100% agree more to it going on, it’s not just the candles. \n\nYTA",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2384,
              "content": "and, after the last 2.5 years -why are we blowing out a bunch of candles on the community cake?  Kids are germ factories under the best of times...",
              "id": 15,
              "comments": [
                {
                  "score": 775,
                  "content": "Exactly! The last time I thought blowing out candles on a cake that was going to be shared by many people was a good idea was in 2019. \n\nA cupcake with a pair of candles writing out 23 for the birthday girl to ceremoniously blow out before cutting the cake that everyone will share would have avoided this entire situation. Instead, everyone gets to eat a cake that has two people's spit on it. \n\nAlso, OP said that this party was specifically because the birthday girl was having a hard time and then on top of whatever else, she's expected to just shrug off someone messing up her cake.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 24,
                      "content": "This. I make a small but adorable tiered cake for my birthday kids to have alllll to themselves and put the candles on that. Then a bigger separate cake for everyone else.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "My mom thinks I hate cake. I love cake, I hate other people's spit. I always say no thanks, been doing so for decades.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Especially MULTIPLE kids blowing at the same time. Ew.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1188,
              "content": "I’m sorry but “flaming dessert” 🤣\n\nTotally right though - 5 years old is old enough to be acting with intent, and I’m willing to bet the candles aren’t the real underlying issue, as OP even admits Zara has been having “a bit of a difficult time” lately.\n\nZara has probably had to push her wants and feelings down for ages because she’s the oldest and had to “help out” or was outright set aside because she had 3 little siblings that required more attention as they came along. \n\nI feel bad for Zara. OP, YTA, please get Zara some counseling and/or support, and listen to why it’s not really about the birthday candles.",
              "id": 20,
              "comments": [
                {
                  "score": 328,
                  "content": "And then she called her a selfish brat. How dare Zara expect something that's about her actually be about her. OP is an AH.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Age this up a bunch as I can see the stories about niece proposing or announcing her pregnancy at daughter’s wedding, right before the bride is walking down the aisle.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Your 2nd to last paragraph is probably something that's been weighing on her a lot. They call it \"Eldest Daughter Syndrome\" or something like that: having to \"grow up\" early and set aside your own needs/wants because your parents decided to use you as a 3rd parent to the other kids.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "OP said in a comment that Zara's best friend's brother recently died and she's grieving. He already knows why it's not really about the birthday candles, he just apparently doesn't care.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "The last phrase you said is very important. Not just “get Zara counseling” -then carry in as usually cuz the therapy will “fix” Zara and ‘we’ don’t have to change or do anything else *dusts hands motion",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "A 5 year old absolutely knows not to blow out someone else’s birthday candles, but it sounds like the entitled brat has a mom who doesn’t parent, and instead makes excuses and gaslights. \n\nOP, you are very much the AH. A friend dying is more than just a difficult time, and your downplaying of it is not helping. And calling your poor daughter names when she’s upset is only exacerbating the situation. You are horrible. \n\nI hope Zara goes all out petty and teaches her cousin a lesson by blowing out her candles for her when she turns 6.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 660,
              "content": "And even when you’re getting this party specifically because you’re having a tough time, the kids in the extended family are given carte blanche to make it about themselves instead and step all over you.\n\nZara probably had a wish she wanted to make, while blowing out her candles. By the end she would have had a few more.",
              "id": 27,
              "comments": [
                {
                  "score": 55,
                  "content": "Given other comments, I wonder if her wish was along the lines of, I wish my friend can find a way through their grief",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I think you cracked the case. I don’t know if you kept up with this but OP revealed that her boyfriend who had just proposed passed away. In her grief she was probably doing a bit of magical thinking and had planned to wish him back to life",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 602,
              "content": "I wondered how you accidentally blew out twenty candles.",
              "id": 30,
              "comments": [
                {
                  "score": 65,
                  "content": "With a few mouthful of spit, when you are that young 🤮",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Yeah, like no 5 year old is doing that in one puff. Mother should absolutely stepped in and moved them aside, plenty old enough to understand",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "A VERY powerful fart in the direction of the cake? Turning on a ceiling fan instead of turning off the lights? It could, possibly, maybe, be accidental - but blowing at candles is not an accident.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "Yep. This isn't about some birthday candles.\n\nETA YTA",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "This stuck out to me as well. How do you accidentally blow out someone else’s candles. OP even  admits Zara has been going through a rough patch. Way to make her feel like she is unimportant on her bday. YTA",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "This is why I don't agree with encouraging smaller children to \"help\" blow out candles.  Unless you as the parent are teaching a child that you only blow out candles on *your* own cake and no one else's, then it's fine.  However, just giving kids, \"Oh hey! Cake and candles, get over there!\" means that kids will treat the birthdays of others as if it is their own.\n\nMy sister thought letting my six year old nephew \"help\" blow out candles was harmless until he began throwing fits when he was told \"no\" at different friend parties.  It has been the hardest habit to break him out of because it was fine before and not now.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "“ but Zara has been going through a bit of a difficult time ”\n\n“I talked to Zara and told her she was being a selfish brat and making a scene, she's 23 getting mad about birthday candles”\n\nGeeee, I wonder what it could be?!",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Also, if she's going through some stuff, it's possible she's in the middle of a depression, which would make her more likely to cry.",
              "id": 38,
              "comments": [
                {
                  "score": 23,
                  "content": "Her best friend’s brother died…\nThat’s what she is dealing with.\n\nOP is TA. Left that important part out!",
                  "id": 39,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Yeah, that's not minor. It can be hard to support your best friend through such loss. Wait, was the BFF at the party? Because I would cry at my party if my BFF couldn't be there because of grief, candles not withstanding.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2555,
          "content": "My 5 yr old would NEVER. Because she knows better.  My 3 yr old might, because he's 3 and we'll, has ther personality that he might try it at 6 lol.  So my job is to remind him and hold him back if need be. Ya know, parent my kid?\n\nETA thanks for the award!",
          "id": 41,
          "comments": [
            {
              "score": 681,
              "content": "Right? By age 5 (or younger), I have pics of my nieces cheering on their GREAT-GRANDMOTHER to blow out the candles on her own cake. They would have NEVER tried to blow out someone else's candles. They understood that when it's someone else's cake, the joy is in cheering for and encouraging them.\n\nLike, I genuinely don't understand how it's hard to teach your kids, not just not to make everything about themselves, but that there is joy in celebrating other people you love . . . which makes it feel less like they are losing out when it's someone else's turn.",
              "id": 42,
              "comments": [
                {
                  "score": 59,
                  "content": "It's hard because then u have to actually parent.... ugh.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "But the aunt probably thought it should be all about HER child not the birthday girl.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "My gran used to tell the grandkids to come 'help' her blow out the candles because \"I'm too old and there are too many!\" but otherwise, we never would have dreamt of blowing out someone else,'s birthday candles.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Oh, my grandmother would absolutely do the same thing. But until she did, the kids would never have tried! They were very excited for her, LOL.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Yeah, my siblings and I would NEVER have been allowed to do this to any member of our family, no matter how old and therefore \"mature\" they should be--even our great-grandfather at 97 blew out his own candles on his birthday! And none of our cousins' little kids would ever do it either, unless invited to by the birthday person. I've heard so many parents say something like \"No, honey, today is Aunt So and So's birthday, so she gets to blow out the candles and make a birthday wish. You get to blow out YOUR candles on YOUR birthday. Today we're celebrating your aunt, let's be excited for her and help sing for her!\"",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 268,
              "content": "My 5yo would have scolded her for doing that. Not only does he know better, but he would feel enormous second-hand embarrassment from watching someone his age do that. How do I know? Bc this situation has already happened in front of him and that’s exactly what happened. (The birthday kid was also 5, but the situation was the same)",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "This is the comment! My boyfriend's niece's oldest kiddo (who is... 20ish months old? He's almost 2 but I'm not quite awake enough for math yet lol) absolutely adores me (I'm one of the handful of people whose name he knows, though sometimes he just calls me \"dada-da\" which is hilarious because I'm female. He doesn't have a dad though so I'll happily be his haha) and on my birthday my boyfriend's niece got me a cake and invited me over. \n\nTbh I wasn't expecting the whole cake and candles thing. Butttttttttttt when the niece came out with the cake and 27 candles on it I was super surprised and happy. Almost two year old had been in my lap and we were reading books and he was super excited over the cake... now to me because I adore this kiddo I was perfectly happy to tell him to help me blow out the candles. \n\nBut his mom made sure I wasn't bothered by it when he got up beside me (she tried to correct him at first and I was like \"no it's fine I need the help right buddy?\" And he giggled at me in the cute happy way toddlers do lol) and if I had said no she would have removed him from the situation. \n\nThat's the difference there - OP is TA because daughter clearly needed something that was about *her* (as the oldest in my occasionally dysfunctional family, I can understand that) and the family failed to acknowledge her feelings and needs. \n\nAnd let's face it - most little kids want to help with the cake! Thats fine for some people. But at 23, you're basically still a little kid and sometimes you want something that's just for you, too.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "I have been to countless birthday parties of 2-5 year olds and I’ve never once seen the wrong kid blow out the candles. If any kid was trying this, the parent would definitely hold them back, but at 5 it’s pretty surprising they’d even try.",
              "id": 50,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Totally agree. 3 year old is iffy and you’d have to hold the them back because if they see a candle they’re gonna want to blow it out. But by 5 years old they can totally control themselves and should know better. Or if they don’t, the parents are responsible.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "This! My youngest tried to not only blow out the candles, but also open the presents on his siblings b-days. Sorry little dude, mom & dad won't allow that!",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Exactly. My niece at age 2 was given a cupcake at a restaurant  (a friend was a chef and there were cupcakes for staff that night). My niece started looking around and asking whose birthday it was (after confirming it wasn't her birthday).",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1012,
          "content": "Just want to point out how stifling it must be to not be able to emote- sounds like Zara was simply upset and was called a brat for it….after a hard year.\n\nYou know what they say- who needs enemies when your family will destroy you\n\nYTA",
          "id": 54,
          "comments": [
            {
              "score": 142,
              "content": "I feel kinship for Zara!\n\nMy mother chose not to attend my wedding due to family drama with one of my siblings, and I spent a large part of the day alone and crying.\n\nTwo of my siblings repeatedly found me to tell me I was being a selfish, spoiled, brat. I was open with why I was upset and it would have improved things a lot for me to have support rather than being berated. I literally hate thinking about my wedding day because of it. -obligatory disclosure this has 0 reflection on my relationship with my husband, he's the greatest.",
              "id": 55,
              "comments": [
                {
                  "score": 72,
                  "content": "Excuse me? Selfish?? On YOUR OWN wedding day??? For wanting your family there and supporting you????\n\nSorry, I'm just so baffled by their logic. So sorry your special day is such a sour memory. I hate when people ruin what should be a good memory...",
                  "id": 56,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Yeah literally teary-eyed thinking about it at all even now. I spent the entire day after crying on my couch with my husband and step daughter consoling me. Been married almost 4 years and still can't bring myself to send out thank you cards that I had purchased before the event even happened. The whole thing is an ugly mess and unfortunately it permanently changed almost all of my relationships with every member of my immediate family for the worse, other than my younger brothers.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": ">Just want to point out how stifling it must be to not be able to emote- sounds like Zara was simply upset and was called a brat for it….after a hard year.\n\nOof. I felt this in my soul. I wear my heart on my sleeve and am quick to cry. If given the space to work through it, I can usually get it out of my system pretty quickly, but no one gives me that space. I have been so belittled for this throughout my life, and let me tell you, it really takes a toll on you. It makes me wish I'd never been born, quite frankly. My heart hurts for Zara.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 276,
          "content": "Also \"Zara has been going through a bit of a difficult time so we decided to throw her a surprise party. This was yesterday.\"\n\nIf you were really concerned about her well being and had wanted to genuinely give her a birthday party, you wouldn't be making this post. Nor will you call her a \"brat\". YTA.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "I am so over shitty parents expecting everyone around them to forgive their children for doing shitty things. No one is obligated to do that for them.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I have a 4 year old and tell him ahead of time not to blow out the candles if it's not his birthday. It's called being a parent and maybe that person needs to control their kid.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Yep.\n\nAlso, OP, did you ask her what was really bothering her before calling her a spoiled brat? You said she has been going through a difficult time, so this clearly wasn't about the candles. The candles were just the trigger. \n\nMaybe try some compassion and understanding with your daughter. It sounds like she needs your support right now (after you apologize, of course).",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Personally, I'm also stuck on them not having parties after double digits? So, aside from 18 and 21,they didn't have any parties after the age of 10? While they're still kids? Basically meaning that they didint really have any birthday parties at an age where they actually remember them?\n\nAnd what the hell with calling someone selfish on their Birthday? That's the day that is designated to be selfish. And even so, sometimes being selfish is important, sometimes the focus needs to be on a person, without compromising for someone else. No one can spend their entire life giving without sometimes getting something back.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "OP - YTA! How hard is it for you to intervene in this situation, light all the candles again and have the kids stay away from the cake since they can’t behave and have Zara blow out all the candles. \n\nIt’s her birthday and her day to feel special so if that was meaningful to her then just get the lighter and have a do over. \n\nDo you think calling her a brat is a good way for her to feel celebrated? First the candles and then what you said to her probably ruined the celebration for her. You handled this in the worst possible way. Do better.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "OP just updated that the “friend’s brother” that passed away actually PROPOSED TO ZARA! It just gets worse and worse",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 26861,
      "content": "YTA\n\nYou threw this party because you said Zara was going through a difficult time, it's possible that blowing out her own candles is something meaningful for her. She can't be called a brat for wanting to do something intended for her to do.",
      "id": 66,
      "comments": [
        {
          "score": 7439,
          "content": "You are right...I already thought OP was YTA but the extra meaning of blowing out the candles hadn't occurred to me. You tend to make a wish when you blow out your candles and who knows what she was wishing for.",
          "id": 67,
          "comments": [
            {
              "score": 673,
              "content": "Probably a better family.",
              "id": 68,
              "comments": [
                {
                  "score": 17,
                  "content": "I actually like that her siblings at least are standing up for her and telling the mother that she isn't being fair to her. Likely what prompted OP to post this in the first place",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 603,
              "content": "That’s exactly what I was thinking. There’s a moment of hope when you go to make your wish and blow out your candles and it’s magnified when you’re going through a rough time and have something important to wish for. \n\nIt must have been so sad to stand there, poised with a wish while having such a hard life and then bam, stolen. \n\nI’d fight someone for stealing my wish. Truly.",
              "id": 70,
              "comments": [
                {
                  "score": 40,
                  "content": "It can also mark a spot in time. Like, okay, I'm starting a new year of life, time to turn this around because it's been so hard. \n\n*Zara's AH parent, AH aunt and AH niece enter the chat*",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Her friend's brother has recently passed, somehow OP thought this wasn't important enough to share on the post and only commented later",
              "id": 72,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1150,
          "content": "I agree, but honestly, bowing out the candles doesn’t even have to be anything meaningful. It could have just been the final straw, and that’s more than enough. I would even go so far as to say that Zara wasn’t even mad at her niece, she was just projecting. We all go through difficult times, having just a little bit of empathy goes a long way. \n\nSorry OP, YTA",
          "id": 73,
          "comments": [
            {
              "score": 70,
              "content": "Yes to everything you said! This probably wasn't so much about the candles but other stuff Zara is going through. Some grace and empathy is what was needed here not calling Zara a selfish brat. \nYTA",
              "id": 74,
              "comments": [
                {
                  "score": 30,
                  "content": "Yea, when you've been going through a difficult time little things can set you off because sometimes it's just the final straw. Calling someone a brat for getting upset when you know they've been having a hard time is definitely asshole behavior.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": ">Yes to everything you said! This probably wasn't so much about the candles but other stuff Zara is going through. Some grace and empathy is what was needed here not calling Zara a selfish brat. \n>YTA\n\nYeah, this sentiment makes sense to me. A lot of \"issues\" people go through relates to a lack of control or predictability. E.x. accidents/injuries, employment problems, political changes, romantic issues, etc. Things in life we sometimes have some say over but not the final say.\n\nSo having someone userp her birthday celebration and then being told that she is the problem... that completely defeats the supposed purpose of the party and probably just makes her feel worse like she can't even have this one little thing.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 658,
          "content": "Zara is grieving actually. According to OPs comment, one of Zara's friend's older brothers passed away and she is clearly upset. I can't believe OP was dismissive of her feelings, even after realizing what she is going through. She is not mad because some 5-year-old blew out her candles, there's more to it. What happened was possibly the last kick of a bucket for Zara and that broke her down. This is a huge YTA from OPs side.",
          "id": 77,
          "comments": [
            {
              "score": 104,
              "content": "Also, it’s possible having a birthday after a friend has stopped having birthdays has hit her with some very complicated feelings in addition to the grieving. I lost a dear friend close to my age right before my last birthday, and she was on my mind the entire day. \n\nIt sounds like Zara was trying to embrace the joy aspect of another birthday in a tenuous way, and her efforts were literally spit on.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "If you read the edit to that comment it wasn't just her friends older brother. The guy had apparently proposed to Zara and was about to become her fiance.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Instead of OP telling her daughter off, she should have just relit the candles immediately, held the kids back and told her daughter to try again. Problem solved. I dont know why people cant see easy solutions",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Exactly. Mom knew Zara was going through some things and that's why she threw the dang party.  It probably wasn't even the candles, but something much deeper.  And your niece is a brat.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "On top of that, she walked away when she started crying. Crying is an emotion and not a choice, so she didn't purposely cried _to achieve something_; but because she had emotions and her actions were to walk away to a quieter place.\n\nCalling someone a brat for simply having emotions, and not misbehaviour, is exactly the thing that gets children/people in a place where they have trouble to regulate emotions and will have hard times psychologically till later in life.\n\nI think you never should call anyone a brat, but especially not someone who is crying, because crying isn't a choice, it's just something that happens.\n\nOP, I'd highly suggest you look into therapy for yourself to talk about what you think is normal behaviour towards your kids and to learn how that can affect children. If your daughter wants to take you for a conversation to her therapist, be open about that and just listen, don't get all defensive, but just listen as to what the therapist has to say.\n\nReally, I feel for your daughter. I've been her, I've been called a brat for simply having emotions, and at this point I'm a dysfunctional 30 something year old. Give your daughter better prospects, and support her in any therapy and boundaries she wants to take.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "this! I’d wondered if it was almost symbolic of her getting another year but her friend not. or at least it was enough to push her over the edge. I truly don’t think it’s only about the candles",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "It doesn't even have to be something meaningful to her. Back when I was at my lowest in life, I came out into the living room to watch TV for the first time in months. My mom randomly changed the channel to the news and I just completely broke down sobbing. When you're having a hard time, the smallest of things can break you. \n\nOP, YTA.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Notice OP made a big deal put of the cake having the number of candles of their age...when that is the entire tradition?  Except in my family we use numbers",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Under normal circumstances, it's possible it doesn't really mean *that* much to her, but this could have just been the final straw.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 22089,
      "content": "YTA.\n\nThe adults responsible for the younger children really should have anticipated this and kept them away from the cake.\n\nThere's a myriad of possible reasons for the upset.\n- She's going through something right now and this was the last drop in her bucket.\n- Blowing out candles is meaningful to her (e.g. making a birthday wish, or because it's a rare occasion in your family).\n- This may not have been the only frustrating thing these kids had done that day (not necessarily the kids' fault ofc)\n- Hygiene. 5yos aren't always the best at not spitting when they blow candles out. \n\nWhatever the reason, this was a great teachable moment for the 5yo but it sounds like the response was to tell the 23yo not to overreact. Pretty much a sure fire way to make someone feel worse when they're already feeling tense or upset.",
      "id": 87,
      "comments": [
        {
          "score": 8499,
          "content": "OP clarified in the comments that the thing Zara is currently going through is that her best friend's brother died. To me, that makes it so much worse.\n\n#ETA: And the brother just so happened to propose to her and Zara was going to marry him. Does this get any worse!?!?\n\n\n\nAlso, what's with the parents not parenting their kids? I have children. I teach them compassion and empathy and that not everything is about them. The 5yo is not entitled to blow someone else's candles FFS.",
          "id": 88,
          "comments": [
            {
              "score": 1821,
              "content": "Absolutely agree with you! Kids trying to blow other people's candles out is so common and a nice tangible occasion for them to learn about others' feelings and impulse control.",
              "id": 89,
              "comments": [
                {
                  "score": 1066,
                  "content": "Seriously. I get so flustered at my own kids’ birthday parties because there’s always some unfettered little shit trying to blow out candles and open their presents for them. It’s really mind blowing how many parents think it’s okay that their kid “helps” my kid open his presents.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 548,
                      "content": "Absolutely! And an attitude of \"they're just kids\" doesn't really fly, because they're presumably going to be at multiple birthday occasions every year and developing a concept of \"mine\" vs \"not mine\" is helpful in so many situations.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "When my younger brothers were small (like under 7) my mother would always give them each a gift on my birthday, which really hurt my feelings. It was my day and I wanted to feel special and \"well its just the best way to keep them from throwing a tantrum, Code\".\n\n...my birthday is on fucking Christmas Eve, like they were so spoiled that they couldn't even wait one more day to open a shit load of their own gifts.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 365,
              "content": "It definitely seems that OP hide that 'detail' in the main post on purpose. \n\nI am so sorry for your daughter, she is grieving and not even her parents are there to support her. \n\nYTA OP. There were not just candles. We blow candles when we are one year older, something that her best friend's brother won't do it again because he passed away. Your unfair reaction just made everything worse.",
              "id": 93,
              "comments": [
                {
                  "score": 28,
                  "content": "Infinitely worse… OP you are so much YTA! So much YTA that I don’t have words… you’re literally so bad you have rendered me(a person that can talk your ear off about anything) speechless.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 46,
              "content": "Wow OP is definitely YTA.  Re-light the candles at the very least.  Damn.  Let her get a wish.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Yeah. Way too many damn parents these days think it's \"cute\" when their kid misbehaves. No, it's freaking not. Stop laughing at your kid being a spoiled brat, get off your ass, and be a parent.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "She said they told the 5 year old that she did nothing wrong. Which just makes it even worse, if that's possible.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "If my 5 year old blew out someone else's birthday candles I would be MORTIFIED",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1331,
          "content": "OP commented below that one of Zara's friend's older brother passed away and hence the reason she is feeling down lately. She is GRIEVING. This is a big YTA from the OPs side.\n\n They really shouldn't have been dismissive with Zara's feelings, even after realizing what she is going through. Someone passed away, and she's upset. She's not making a scene because some child blew her birthday candles. There's more to it and OP possibly kicked the bucket by being sensitive to this situation, saying Zara is making a scene and calling her a \"selfish brat\"",
          "id": 99,
          "comments": [
            {
              "score": 989,
              "content": "What also really grinds my gears is OP claiming that Zara \"made a scene,\" when what actually happened was she walked away on the verge of tears. That's not making a scene, that's removing yourself from the situation like a mature adult, which OP obviously isn't.",
              "id": 100,
              "comments": [
                {
                  "score": 200,
                  "content": "Exactly. OP deliberately left out information and worded things to make their daughter sound awful, but still made themselves look like TA. Even if she did burst into tears at the table, so what? It's her birthday! She's \"going through a difficult time\" as OP put it.\n\nSister needs to learn how to actually parent, the only brat was the child who was old enough to know it's not her birthday party and that's not her cake, so she doesn't get to blow out the candles. OP needs to learn some freaking compassion and care more about their own daughter instead of their niece.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 24,
                      "content": "It's her birthday, she can cry if she wants to.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 258,
              "content": "A best friends brother is a first crush or a substitute brother too.  How sad for Zara!",
              "id": 103,
              "comments": [
                {
                  "score": 152,
                  "content": "Under the circumstances, it seems perfectly possible that Zara’s best friend’s family treat her better than her own family do.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "So, so true. I actually *married* my friend's older brother. And I absolutely can't imagine how devastating his death would have been.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 16,
                      "content": "If you look at OPs replies, Zara was planning on doing that too - the brother proposed to Zara, she was going to say yes, she just didn’t tell her father about this for well, obvious reasons.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "First crush, or even first love. OP is soooo TA.",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "Also at 23 this is possibly the first person she's actually ever been close to in any way that has died. And almost *certainly* the first time someone near her own age has.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "I'm certain that Zara was thinking about how he'd never blow out birthday candles again, and that really set her off.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Agreed. I also thought throwing a surprise party for her whilst she is grieving may have been a little tone deaf. She didn't have a say in it, didn't get a chance to say no or to mentally prepare herself. And it wasn't a party with her most supportive friends, it was a party with unruly 5yos. \n\nIf it hadn't have been the candles I think it would have been something else. It doesn't sound like she was necessarily in the right headspace to be there.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 595,
          "content": "Going through it but also, maybe wanting something that was all about her to actually be about her. 3 siblings and younger cousins and if this is how the parents/other adults are reacting about her crying about the candles, it makes me wonder if they've spent her whole life minimising other things that should hve been about her but got ruined by younger family members too. \"Yes it was a nice certificate but the youngest doodled all over it... Why are you upset? It's just a piece of paper, we can print you a new one! It won't be anything like the one the school gave you but I don't see why you're making such a fuss about it...\" \"Oh you want us to be at your school play? Well the baby's got to go down for a nap and we absolutely can't leave them with Grandma/auntie, so we just won't be able to come...\" 23 years of being overshadowed...\n\nIf she's 23 then her 22nd and 21st probably got affected by covid especially her 21st. This would be the most normalish birthday party she could have had in 3 years... and it comes to the special moment of blowing out the candles and... yet again, can't do the thing because some one else ruins it for her. And given a loss of someone close to her, that'll be bringing her emotions more to the surface. She probably would have felt upset but been able to hide it and this time, wasn't.",
          "id": 111,
          "comments": [
            {
              "score": 66,
              "content": "Without knowing the age and genders of Zara's cousin's of similar age, she's probably one of the elder girls in the children group that might have been parentified by the adults growing up. \n\nReading this reminded me of a post from a few months ago where it was someone's birthday (or something where they received gifts) and someone else had gone through the \"trouble\" of opening the OP's presents, and the OP in turn was upset.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Uff this comment stirred up some feelings from my own childhood I always thought I was wrong to feel as everyone said I was \"mean\", \"over reacting\" and \"way too sensitive\". Thanks for the validation",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I feel for this girl so hard because this sounds exactly like what happened to me growing up. I was the oldest girl in a Mormon family and was expected to not only be the surrogate parent for every child in the family when I myself was just a child, but to never have my own feelings because I \"had responsibilities\" and any time I showed and emotion was punished and told I was \"overreacting\" or \"being a baby\".\n\nI have such a hard time regulating my emotions now as an adult and it's been a really hard thing to work through. This post just absolutely reminded me of my family and I'm almost positive she's experiencing the same thing. Nothing is ever about HER, I bet she has had to accommodate  the younger ones at every birthday and special event since they were born. I can't remember a single birthday where I was allowed to blow out my own candles, or open every one of my presents. I always had to let one of the younger cousins \"help\" or I was yelled at, called selfish, etc. \n\nI hope she goes low contact with her parents. I'm super low contact with the rest of my family and it's helped immensely.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "That last drop in the bucket thing hits hard. I’m a super emotional person who will sometimes has to remove myself to be upset over what would look like something as small as birthday candles to other people; but that’s really just the tiny disappointment that tips the emotions over the edge. OP’s daughter deserved a parent who in that moment didn’t name call her and instead offered safe place to let out and be supported. She wasn’t crying about the candles; yet no one seemed to want to take the time to get to the bottom of that and be there for Zara in that moment. She even tried to just walk away- likely to minimize any scene she might be accused of causing- and OP and the kids’ mom choose to berate and name call her for doing the best she could manage in that moment. YTA, OP.",
          "id": 115,
          "comments": [
            {
              "score": 32,
              "content": "Agreed, nor to offer her some dignity in this situation. E.g. relighting the candles, taking any unruly 5yos further away, gently rectifying things a little bit without drawing too much attention to it in case she doesn't want to talk about emotional things in the midst of the party.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Yes - I've found myself sobbing in the kitchen over a teatowel that got caught in a drawer on a day when everything else was already terrible. And that wasn't in the midst of a pandemic, or while I was grieving for a friend end my friend's family! Just as the Iranian yoghurt was not the issue for a famed Redditor of yore, so too was my teatowel mishap not the issue for me, and neither were the birthday candles the (only) issue for poor Zara. OP, YTA.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": ">Hygiene. 5yos aren't always the best at not spitting when they blow candles out. \n\nThis. I'd trust an adult but if a 5-year-old blew out my candles I'm not touching that cake, and now the little shit has taken my cake from me.",
          "id": 118,
          "comments": [
            {
              "score": 19,
              "content": "Exactly! And it's the first party-esque birthday cake in years and potentially the last until she's, what, 30?",
              "id": 119,
              "comments": [
                {
                  "score": 23,
                  "content": "Until she finds a family which appreciates her.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "Just telling her not to overreact would probably even have been sort of okay. \nBut the parent immediately went to insulting her! \nAnd it wasn't even like Zara really did or said anything, she just \"looked\" angry and \"started to cry\", eg probably just had tears welling up. \nShe wasn't even ACTING on her feelings, she just HAD feelings, and was called a brat for this. \nON HER BIRTHDAY! \nOP, YTA",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Imagine if she was going to make a wish for her best friend. Or for the late brother who she might have been close to also. Like, I hope you are in heaven and in a better place and free of pain, etc. And her moment to make that wish is taken away. And her family is laughing at her and saying it is no big deal, just blow out the rest of the candles. Had this been a normal birthday party, maybe Zara would have laughed, too. But this one time was not normal. OP even says that the party was thrown to surprise Zara and cheer her up. Zara’s wish may have been a special one, one that meant a lot to her emotionally in her grief. Then, like some sign from above, she does not get her wish. I do not blame Zara for breaking down. And instead of giving her a hug, OP calls her a brat.\n\nMassive YTA",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "OP, YTA.\n\nThat first bullet point is exactly what I was thinking. As an adult who often seems to overreact to weird, small things myself, it’s usually because that thing is the final straw representing my larger stress. Case in point: I wanted to have a chill, relaxing weekend. Instead it turned into an exhausting weekend of errands and housework. The weather was nice, so I wanted to take a walk. I knew I still had stuff to do, but I finally convinced myself that a 45 minute walk with my dog would be fine. I had meat for dinner thawing on the counter. I covered it with a plate. I told my partner about it and told him to watch our sneaky cat. When I got back, the plate had been pushed to the floor and a bunch of the meat had been eaten. I snapped at my partner for not watching out for the cat, in a way that I quickly realized was uncalled for. I apologized and explained to him that it wasn’t really about him, that I was upset that a weekend that was supposed to be relaxing has been exhausting and that I already felt guilty about going for a walk, and the meat incident felt like a reminder that I shouldn’t try to do anything relaxing for myself. \n\nIf I had to put myself in Zara’s shoes, I’d guess that’s what happened here. Her best friend’s brother died. It’s likely that she’s been supporting her friend and putting herself and her own needs to the side to care for her friend. She’s probably feeling like she’s putting all of her energy into supporting someone else without getting that same support from others. To her surprise, she gets a birthday party! Some much-needed support and attention on her! But then her little cousin takes the attention away from her moment, and instead of the familiar reprimanding this kid for doing that and supporting Zara’s feelings, Zara is told that her feelings don’t matter and that she should be fine sacrificing her moment because the child is young. It once again makes her feel like her role is just to support other people and not get support herself, and after being given a sense that people are maybe giving her a moment of support via this party, it feels especially like having the rug pulled out from under her.\n\nI highly doubt it’s just about candles, but even if it is, it’s still rude to not reprimand the child for doing that.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Also- it doesn’t say that she said ANYTHING to the child, she got upset and REMOVED herself from the situation- likely because she knows that while it technically isn’t a huge deal it was to her in that moment and she needed to take a minute to gather herself emotionally. But I imagine having your mom then come in and berate you would just be so terrible. Also how can someone be selfish for wanting to partake in something that was meant to be for them??",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6978,
      "content": "It wasnt about the birthday candles, OP. \n\nYTA",
      "id": 125,
      "comments": [
        {
          "score": 3535,
          "content": "Imagine seeing your daughter shedding tears and walking away **NOT** causing a scene, and going to yell at her for ruining the day.\n\nOP, you said it yourself, she was going through a lot, so she might have been heartbroken or extremely emotional that she didn't even get to blow out the candles on her own birthday (read: *everything* in her life is not going the way she wishes it would).\n\nAlso, seeing you went to call your daughter names instead of consoling her, I think you are also a big reason for her feeling down at the moment. YTA\n\nETA: thanks for the award /u/No-Yogurtcloset-8851, i rarely get awards as I come off as bitter asshole/dick when I comment. so, thanks.",
          "id": 126,
          "comments": [
            {
              "score": 824,
              "content": "To clarify, her best friend's brother died. Like jfc, OP. Wtf.",
              "id": 127,
              "comments": [
                {
                  "score": 708,
                  "content": "OP omitting that very vital piece of info makes them double the AH imo. What an unempathetic parent.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 237,
                      "content": "Omitting that this \"older brother\" was actually her soon to be fiance/ husband is even worse.",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 53,
                      "content": "Also omitting the huge fact that the brother had proposed and she was gonna marry him. Op lost her *fiance*. Fuck the candles, I’d be crying regardless.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "And that brother that died had proposed to Zara. She said yes. So Zara’s FIANCÉ died! Wtf op?!",
                  "id": 131,
                  "comments": [
                    {
                      "score": 13,
                      "content": "*What?!* Way the bury the goddamn lead, OP! How heartless can you be??",
                      "id": 132,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 658,
              "content": "It’s Zara’s party, and she’ll cry if she wants to!",
              "id": 133,
              "comments": [
                {
                  "score": 55,
                  "content": "You would cry too if it happened to you!",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 192,
              "content": "I don't think it's \"at the moment\". In some families, there's a track record of immature behavior, where the oldest kid is expected to be in more control than Mom and/or Dad. But Mom or Dad will happily criticize them if they do lose control of their emotions.",
              "id": 135,
              "comments": [
                {
                  "score": 27,
                  "content": "Honestly, I still (at 50) have trouble showing my emotions because of this.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I also get the impression that the blowing out of the candles by the niece was known beforehand. The aunt said that they didn't expect Zara to react that way, which indicates that it was planned. I'd be livid if I knew my sister planned something like that while my kid was going through a hard time. She just had to make it about her 5 yo, didn't she? I feel so bad for Zara. YTA",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "It is crazy given all the things we see on Reddit, that someone trying to hold things together who doesn't start screaming and throwing a tantrum but extracts themself is being called a brat.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 39,
          "content": "I had to scroll way too far down for this. So many black and white responses, \"she wanted to blow them out herself, she's going through a tough time.\" Guaranteed it has nothing to do with that candles, it's just what set her off. OP definitely YTA.",
          "id": 139,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Correct. Zara is apparently in a fragile emotional state.\n\nFor a lot of people, a big party is not an emotional lift but rather a burden when they're feeling down. Zara might be one.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6498,
      "content": "[deleted]",
      "id": 141,
      "comments": [
        {
          "score": 1742,
          "content": "if OP sucks but Zara doesn't it should be YTA.",
          "id": 142,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 575,
          "content": "When I was 10 or so a younger relative (5 or so) reached over, blew out my candles and scraped half the icing and decorations off my cake and shoved it in his mouth. I was so surprised and sad I started to tear up. The kid’s mom snapped “you’re being so dramatic! Oh my god, I’ll MAIL YOU A BOX of replacement sprinkles!!”\n\nShe didn’t. It wouldn’t really have mattered. Point was made. My birthday, and me, weren’t as important. And yes - that kid is still a little shit who calls mommy demanding money and attention and gets away with murder. My family also didn’t really do birthdays, so even a simple gathering like this one was with a few family members was important to me. It still would be.\n\nThis family sucks.",
          "id": 143,
          "comments": [
            {
              "score": 154,
              "content": "When I turned five, my three year old sister snuck into the kitchen and licked half the frosting off my cake. I don’t remember if the cake was replaced, but I do remember being yelled at for crying. I remember several instances of being screamed at by on my mother on my birthday. \n\nMy 16th birthday was the first year we didn’t do anything at all. I had an orchestra concert to attend, and they were serving cake afterwards as they did every year. I asked if I could go get some cake, and my mother told me no, she didn’t want to wait for that. I asked if we could get cake somewhere else, or maybe icecream. She refused. So, not only no cake, but denied cake that was incidentally available. For some reason, I hate my birthday and dread it for a couple months in advance.",
              "id": 144,
              "comments": [
                {
                  "score": 54,
                  "content": "I’m so sorry to hear that. Parents often chastise older kids for being upset when younger children can’t control themselves. It’s not one child’s fault he or she is upset by the actions of another. Your feelings were valid.\n\n I definitely took my own half eaten (by everybody else) birthday cake into the backyard one year with candles, sang to myself, lit and blew them out…all by myself. I don’t think anybody even noticed I was gone. I sat out there for a long time and just cried.\n\nNow I have friends who are awesome and at the very least we go out for my birthday. Even if it’s just dinner, it’s nice to have ppl who will celebrate you! I hope you are able to find some friends like that. Everyone deserves that. Even if it’s just a cupcake with a candle. I hope your next birthday is better and that you receive a kind word and token of appreciation 💕",
                  "id": 145,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I do actually bake now, so I have just made my own cake before and shared it with friends and not family. I’ve also stuck a candle in a moon pie because I thought it would be funny. If you have even a little bit of knowledge about baking, I do recommend making yourself something. Cupcakes are easier than a whole cake, but are essentially the same thing. It’s a bit cathartic to do it for yourself.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "If someone took my icing there may be actual bloodshed.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "The thing that stands out most to me is that her mom called her a “selfish brat” on her birthday. That is tremendously hurtful. \n\nTo this day, 20 years later, I distinctly remember my mom telling me on my 16th birthday that I’ve “made her life miserable since the day I was born”. I remember the gut-punch feeling of devastation in that moment. Her words profoundly hurt me, and it took many years to contextualize, move on, and learn to love myself for who I am (and not who my mom wished I was). \n\nOP, please, PLEASE, apologize for saying this to your daughter and show her that you love her as she is…big feelings and all. I’m literally begging you, for Zara’s sake. My mom died 5 years after saying this to me, and though she never apologized for that exact moment, I imagine she deeply regretted it in the end. I know it still haunts me.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "There’s other explanations for how ESH is used on the site but I think you are also overlooking that Zara’s siblings are siding with her.",
          "id": 149,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Funny how Zara and the sister were both upset but only Zara is considered a brat and selfish not the sister. Why did her sister deserve comforting but not Zara?",
          "id": 150,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "I dont think it's that they don't celebrate at all after double digits, just that they don't have big parties with extended family.",
          "id": 151,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5802,
      "content": "YTA \n\nYour daughter has been having a tough time and this was her birthday, your bratty niece ruined a special moment for her.\n\nMaybe that birthday wish was important to her, maybe she felt like absolutely nothing goes right for her. A little empathy from you would’ve gone further than the shitty judgmental attitude you decided to go with.",
      "id": 152,
      "comments": [
        {
          "score": 1912,
          "content": "Throws daughter a party because she’s been going through a really hard time. Daughter gets upset about something, parent calls her a brat. \n\nGee. What could be making Zara depressed?!",
          "id": 153,
          "comments": [
            {
              "score": 726,
              "content": "OP mentions \"One of her friend's older brother recently passed\". Poor daughter is grieving and this is how OP reacts? I can't imagine how OP treats her during normal times.",
              "id": 154,
              "comments": [
                {
                  "score": 351,
                  "content": "And the story just gets even worse. \n\nIt’s possible that Zara had a crush on the older brother too which ads another layer of trauma to her grief.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 302,
                      "content": "I had a crush who died when I was in high school. It’s a very specifically bizarre emotion. \n\nIt’s also possible she saw him as a friend as well, or is grieving on her own and her friend’s behalf, or is processing mortality in a new way (he’s likely the first person close to her age who has passed and that’s it’s own mindfuck). Whatever layers are there, OP sucks for not being more sensitive.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "It gets SO MUCH WORSE:\n\n\"I found out later that he had apparently proposed to Zara and she was   \ngoing to say yes. But she needed time to think about it. No one bothered  \n to let me know and it just seemed like a big drama\"",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "This is horrible.\n\nOne big part of grieving is that big moments can be incredibly difficult, particularly if it's relating to hitting a certain milestone or anniversary, or any acknowledgement of the passing of time.\n\nI cried so hard on NYE in 2020 because my brother passed away that September. I felt like I was leaving him behind. I am also not looking forward to turning 30 in June, because my brother was 29 when he died, and it feels wrong that I'm doing so when he didn't. But, I know I will feel some sense of relief and healing once I get there.\n\nI wouldn't be surprised if the daughter was taking her birthday hard, with her getting older but her friend not doing so. Blowing the candles is a clear marker of getting older, and having that moment stolen from her stopped her from achieving some element of catharsis. No wonder she cried instead.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 16,
                      "content": "My mother's father died when she was in high school. She'd had time to process his death, and her grief was no longer all-consuming by the time I was born.\n\nBut the year she turned the age he was when he died? She spent that whole year in fear of dying like he did, even though it was incredibly unlikely. And on her next birthday she had a breakdown. After all, from that point on she would always be older than her father.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "\"Why is Zara depressed? I ordered her not to be, I even bought her a cake and yet she refuses to be happy. Why doesn't she listen?\"",
              "id": 160,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Zara’s grieving the death of a friend and probably also the realization that her parents are narcissists. \n\nI hope she gets therapy because her family sucks.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4865,
      "content": "YTA. You sound like an awful parent if your first reaction is to call your daughter a brat. Something is cleanly going on for her to react like that! And you instantly call her a brat? Really?",
      "id": 162,
      "comments": [
        {
          "score": 321,
          "content": "Def- my mother and I have a very surface relationship because she wasn’t meant to be a mother. Any time I don’t ‘act’ the way she’d like me to, she calls me a brat. I am now 36 and she still will resort to name calling. This is only one example of her verbal abuse, but it changed me as a child and now she knows nothing about me as an adult because I built that wall up long ago. \n\nAdults ask kids to use their words constantly, but it seems a lot can’t be bothered to find their own. Don’t do this to your kids, it’s detrimental to their self-worth and the relationship you’ll have with them later.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "OP is also being incredibly disingenuous here because they have conveniently forgotten to mention that they know what Zara is 'going through'.  It's a bereavement; Zara is grieving and gets called a brat for struggling to cope.  OP is the worst.",
          "id": 164,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3597,
      "content": "YTA.\nEven if she wasn’t going through a hard time, your niece should have not been allowed to do that. Children can learn at a young age that not everything is about them. Considering your daughter is the oldest, I wonder if she’s had this done to her her entire life.",
      "id": 165,
      "comments": [
        {
          "score": 828,
          "content": "I went to a four year old birthday party this weekend. All the kids knew to not blow out the candles because they were for the birthday girl. A three year old there got confused and went to blow them out, but his mom stopped him and explained the candles were for someone else. \n\nFive is absolutely old enough to know that birthday candles are for the birthday person and, if not, it’s a very teachable moment. Seems like this kid was trained to do this because others around her think it’s cute.",
          "id": 166,
          "comments": [
            {
              "score": 384,
              "content": "They literally told the kid that she did nothing wrong. Wtf. I mean, you don't have to yell or punish her but at least explain to her why what she did was wrong. Future brat alert",
              "id": 167,
              "comments": [
                {
                  "score": 53,
                  "content": "And i wanna know how the mother didn’t get embarrassed by letting her kid do that. I would have been embarrassed but then again my child would never do that and he’s 5. He knows he can only blow out his OWN candles. Smh",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "This kid is going to be the kind of person to propose or wear white to someone else's wedding and not understand why everyone hates them.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 344,
          "content": "I hate when people let children get away with everything just because they are kids it teaches them nothing. I grew up as the older cousin. My younger cousins got to hit me, make fun of me, steal from me, break my shit, just be little assholes to me and nothing was ever done because “they are kids” 🫤 It feels triggering reading this because this sounds like something my family would do. Dismiss my pain and feelings and comfort the people who caused it instead. OPs such a dick",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "I had one birthday where a neighbor kid blew out my candles. Then my sister wanted a go at it so we re-lit and she blew them out too. I got the last round. I remember this some 25 years later not because this was a really important event but because something that was mine was taken from me, and instead of making it right, my parents' reaction was to place everybody else's needs above mine and scold me for caring. Again. \n\nYes, this is absolutely a symptom of a much deeper problem and the follow up demonstrates the dynamics at play.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "This. I met children who were raised like this and they really are brats. They make me want to seal my tubes shut.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2511,
      "content": "I remember once when my depression and anxiety were really bad I had a full on meltdown crying and shaking and hyperventilating because.... I accidentally washed my toothpaste off of my toothbrush. It wasn't about the toothpaste, that was just what pushed me over the edge into a full blown panic attack. \n\nIt's not about the candles and YTA for minimizing her daughters feelings and calling her a selfish brat at her own damn birthday party.",
      "id": 173,
      "comments": [
        {
          "score": 364,
          "content": "YEP, this is it! I'm sure it wasn't all about the candles at all, and it's so mean to call her a selfish brat (or any other names) in a party you threw her to cheer her up cause you knew she was going through a difficult time in her life! Doesn't even make sense. YTA!",
          "id": 174,
          "comments": [
            {
              "score": 15,
              "content": "crying and walking off isn't even a selfish or bratty thing to do in ANY context, but even more so this one",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "YEP. I had a similar reaction when I spilled coffee during a particular low point. Wasn’t about the coffee.",
          "id": 176,
          "comments": [
            {
              "score": 46,
              "content": "Yep, mine was coffee too but I brewed it without the grounds. Saw the big mug of hot water and lost it. It's not about the candles.",
              "id": 177,
              "comments": [
                {
                  "score": 16,
                  "content": "I’ve done that before as well—classic paradox of not being caffeinated enough to make my coffee.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "My wife once cried over spilled milk.  She was pregnant at the time, so her emotions were already on edge.",
              "id": 179,
              "comments": [
                {
                  "score": 18,
                  "content": "Yeah those hormones definitely don’t help, especially if you’re already prone to anxiety.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "Same when I missed the colander and accidentally poured out a pot of spaghetti.",
          "id": 181,
          "comments": [
            {
              "score": 63,
              "content": "That would push me over the edge even if everything else in my life was going okay",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Yes, this. I went into full crisis mode once, as in, my spouse was considering calling an ambulance for me, because I accidentally dropped a plate and it broke. It was not about the plate of course, it was about everything else that was going on in my life (with my work and my family of origin) that I was trying to keep together until it all exploded because of a singular little incident that went wrong",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I actually cried for the exact same reason once hah",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I've done something similar. I once started bawling because... my mom threw away my burrito. It wasn't about the burrito.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I once in a depressed episode had a full blown panic attack because I broke the yellow of my breakfast egg when putting the egg in the frying pan.\nOP really doesn’t know what it means to go through a hard time and feeling like nothing ever goes your way and you fail at everything.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1623,
      "content": "INFO: what is the \"bit of a difficult time\" your daughter is going through? \n\nGenerally, I would agree someone her age should be able to laugh it off and let it go, but it majorly depends on her current mental state. I don't think we can give a fair judgement if we miss this info.",
      "id": 187,
      "comments": [],
      "relation": "Support"
    }
  ]
}