{
  "post content": "I 47m have a 22 year old daughter. She’s in college and lives on campus. I agreed to help her make car payments, since she was in school. \n\nI was recently informed by a young man I work with that my daughter strips at a club about 40 minutes away. I confronted her on this and she said she  didn’t plan to do it after she graduated, and she needed some money. I told her then work at McDonalds, not use her body.\n\nWe got into an argument, and i asked her to quit stripping and get a decent job then. She refused and said stripping was easy money, so basically I said there was no need for me to pay her car payment anymore since she is making money so easily. She got upset and said that wasn’t fair, and that she doesn’t make enough for that. I told her to figure it out.\n\nShe told my wife about what happened, and my wife is upset by her job of choice but says it’s unfair for me to stop supporting her so suddenly over an argument. I think it’s perfectly fair, it’s my money and my decision when to cut it off.",
  "id": 1,
  "comments": [
    {
      "score": 85829,
      "content": "What kind of asshole tells a woman's parents that they saw their daughter stripping, as if that's any of his business to get into? Your gross coworker, who goes to strip clubs to ogle women but then tattletales on them, is the biggest AH in this imo.",
      "id": 2,
      "comments": [
        {
          "score": 47316,
          "content": "Prob tried to hit on her and was told to fuck off",
          "id": 3,
          "comments": [
            {
              "score": 16313,
              "content": "Hey babehehe, I work with your dad, but I bet I could be your daddy 😏 /s gross yo.\n\nYTA",
              "id": 4,
              "comments": [
                {
                  "score": 5455,
                  "content": "What a horrible day to have eyes.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2767,
                      "content": "A terrible day to be literate as well",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Off to r/eyebleach I go",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2342,
                  "content": "Probably more like, “have sex with me or I'll tell your dad what you do for a living.” \n\nYTA OP, don't be surprised if your child doesn't want to talk to you in a few years... (not bc the car payment but bc your judgment BS attitude)",
                  "id": 8,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Ew yeah",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "What’s that eye bleach sub?!",
                  "id": 10,
                  "comments": [
                    {
                      "score": 16,
                      "content": "r/eyebleach",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "oh to be Jared, 19",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5508,
              "content": "The possibility of that is extremely high unfortunately. Surprised the dad wasn't more concerned his coworker was watching his daughter stripping.",
              "id": 13,
              "comments": [
                {
                  "score": 7446,
                  "content": "The fact that the dad wasn’t concerned in the slightest about how this coworker knew this (obviously because he saw her), but was all up in arms about his daughter stripping says it all. It’s okay for men to go to strip clubs and watch strippers, but if the stripper is someone they know?! How dare she?! One of the most annoying and misogynistic double standards ever.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 3168,
                      "content": "But those women aren’t supposed to be human! And how am I gonna feel good at strip clubs when one of those is actually my daughter. How dare she ruin that for me! \n\n/s\n\nOP, YTA.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 65,
                      "content": "It's harder to consider her a piece of meat if he gets to know her personally.\nOp YTA and so is your colleague. I hope your daughter makes a fortune out of her job and never ever ever shares a penny with you.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "This exactly!!! Statistically, nearly every person on the planet is looking at porn, but the only “immoral” ones are the people being looked at, not the voyeurs themselves. 🙄",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "I feel like the OP was *especially* concerned about his coworker watching his daughter but lashed out at the one person he felt he could control instead. \n\nSide note: I can't help but feel that if you want your daughter to stop stripping, making money more scarce is one of the worst moves you could make.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "OP - read this comment and start asking yourself if you’re a misogynist. YTA for your reactions.\n\nI do agree that you’re entitled to change support if you feel, however, your reasoning that you’d rather have her underpaid and taken advantage of by something like a fast food joint, but it’s not ok for her to strip? She likely has more time on her hands for study in one role over another just saying. This makes you an asshole.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 39,
                      "content": "Seems to me the dad had an opportunity to teach something or to show that you don't turn your back on family over goofy shit like this. Failed on all accounts. YTA op",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Wtf! It’s ok for anyone to go to the strip club but not my family",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 36,
                      "content": "Yeah, it's awful. Strip clubs are fine but the people who work there have something wrong with them? Really gross. Either the whole thing is fine or it's not. You don't get to have your cake...",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "It's just the same old 'stud' vs 'slut' argument with different words.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "The fact that he thinks he can dictate to his daughter what to do with her own body?? And your absolutely right, the double standard is obvious here.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Patriarchy makes strange bedfellows . . .",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Going to a strip club is fine, because he's a guy. Having sex with tons of women is fine, because he's a guy.\n\nWorking at the strip club (even if nothing more than dancing is done) is disgusting, because she's a woman. Having sex with even one guy is disgusting, because she's a woman.\n\nI bet if it was OP's son dancing at a club (at least if explicitly heterosexual and for women), he'd give him the thumbs up and high-five him about all the attention he'd get.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "The shame and taboo around sex, womens sexuality, and women being free and having control over their own bodies and sexuality is sooo deep.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Surprise twist there is no co worker its dad that likes to hit up the strip club and he saw her at work one night.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Could be playing the long game. Now that she's cut off, he can be her sugar daddy!\n\n>!Goddamn, I felt dirty just writing that!<",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Yes, he wanted to report back first before an accurate summary of his likely creepy behaviour reached her parents.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "“Go on a date with me or I’m telling your dad”",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Or tried to blackmail her: \"Hook up with me or I'll tell your dad where you work\"",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Worse still, what if he’d tried to blackmail her into doing favours by saying he’ll tell her parents if she doesn’t acquiesce!",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Or be blackmailed. \"I'll tell your father if you don't...\"",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4790,
          "content": "[removed]",
          "id": 35,
          "comments": [
            {
              "score": 1008,
              "content": "> Coworker is a raging asshole and an absolute dipshit to be sure. But he did commit to love, raise and support OP’s daughter.\n\ni think you a word",
              "id": 36,
              "comments": [
                {
                  "score": 182,
                  "content": "I you too",
                  "id": 37,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I'd you so good.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "Wait… Did I miss something? The coworker is now supporting OP’s daughter??",
              "id": 39,
              "comments": [
                {
                  "score": 23,
                  "content": "They missed the word NOT, so here are a few extras: not, not, not.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "Ehh, I've never been to a strip club, but is there not a social commitment of \"I won't tell people I saw you at a strip club if you don't tell people you saw me at a strip club?\"",
              "id": 41,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "OP let co-worker essentially win and get what he wanted",
              "id": 42,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Your username often checks out, don't it?",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Um … u/Hoistedonmyownpetard … I think you missed an important word: NOT. *“But he did NOT commit …”*",
              "id": 44,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3710,
          "content": "Sadly, it's not uncommon for men to snitch to family members when they see someone they know at the strip club\n\nSource: was a stripper for 8 years and saw it happen.",
          "id": 45,
          "comments": [
            {
              "score": 4206,
              "content": "It reminds me of when the BYU baseball team went out to a strip club, saw a classmate dancing, and reported it to the Dean. She was expelled; nothing happened to any of those boys.",
              "id": 46,
              "comments": [
                {
                  "score": 1700,
                  "content": "I remember that exact story and was going to bring it up, but you beat me to it. It’s ridiculous how double standards work.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 1375,
                      "content": "Famous poet  expresses it well, Sor Juana Inés de la Cruz..\"¿quién es lo peor, él que paga por la peca o la que peca por pagar? \" \"Who is worse, he who pays to sin or she who is paid to sin?  The poem is called Hombres Necios.   ETA: to take care of spelling errors",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 991,
                  "content": "BYU should be banned from playing college sports. They are ridiculous.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 49,
                      "content": "They were at one time, until LDS Church changed a racist policy probably to get into NCAA.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 767,
                  "content": "Oh, yes, we’re a Christian University! How dare a female work as a dancer! Thank God our students went to a strip club, partying and slapping singles into their thongs! Good job guys! We need to weed out the women that are tempting our Christian young men! \n\nWhy weren’t these tattletales expelled as well?\n\nHypocrisy at its finest!\n\nEdit to add YTA!!",
                  "id": 51,
                  "comments": [
                    {
                      "score": 64,
                      "content": "> Oh, yes, we’re a Christian University!\n\neven worse, a Mormon University",
                      "id": 52,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 35,
                      "content": "But, see, when they went to rat her out they probably said they were so so sorry for sinning and since they confessed voluntarily they’re actually really good men, Christians, and all-around human beings!\n/s, obv",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "And interesting they had no fear of being expelled.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 556,
                  "content": "The thing with BYU is that unlike most religious schools with similar \"honor codes\" they also heavily recruit from outside their own religious community because they want competitive sports teams. That's given rise to a well-documented culture of rampant double standards.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 25,
                      "content": "As opposed to insular religious communities, which are free from double standards?",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 260,
                  "content": "That's such a blatent double standard.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Oh that is so disgusting. And so typical of a place like BYU. 😡",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "As an exmo, this does not surprise me but also ✨️enrages✨️ me. That ~~church~~ corporation is such a misogynistic boy's club.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Ohhh \"That's boys being boys. You can't blame them when they are seduced by women.\"  /s  🙄\n\nA 22 year old found a way to make money that works with her schedule. McDonalds doesn't guarantee that she won't have a manager, other employees, or customers be creeps. Anyone of them can take advantage of her or even end up being a stalker. \n\nOP...YTA. Love your daughter unconditionally and give her your support, emotionally and financially. You've stated your opinion, now be there for her.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "***flames_on_the_side_of_my_face.gif***",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "As someone who lives in Utah, this is one of the MANY reasons I refuse to attend BYU",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 980,
              "content": "I had a friend who was ALWAYS with me- family vacations yearly, always at Sunday dinners, every day she was there with us. I have all male cousins. They would tell me “oh we went to -strip club and saw Krista working there! Got a lap dance from her!” IN FRONT of our grandmother and I got yelled at for it. Like it’s a job and a private matter. I think they should be embarrassed, the coworker should be embarrassed. Not the daughter.",
              "id": 63,
              "comments": [
                {
                  "score": 101,
                  "content": "Kinda the same.  One of my best friends/roommates was  a dancer.  I always brought her to family functions, family liked her.\n\nMy sister gets married, and her husband's stag is at teh bar.  One of his buddies asks my friend to do a lap dance for the groom.\n\nCue my BiL saying \"I can't get a dance from her, she was at Thanksgiving!\" and my friend saying \"I can't dance for him, I'm going to his wedding!\"",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Happy cake day 🎂",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 898,
              "content": "I'm with you! OP is a major AH! \n\nI have never had an issue with a woman's choice to be an exotic dancer, it's a good job with good pay. OP is a complete and total asshole for his response! BTW, I'm f 71 so I've seen it all!\n\nMy younger sister was a stripper, back when my dad was still alive. He often went to one of the local clubs, but made sure sis was NOT at that particular club. All these years later, she has a \"normal\" job and many of the girls she worked with are still in touch. Weird thing is, they all really like my dad. Many of our family members are friends with them on FB, and every year on his Birthday there are memories posted by some of the dancers in honour of dads Birthday, as well as the Anniversary of his passing.",
              "id": 66,
              "comments": [
                {
                  "score": 477,
                  "content": "I’m betting your dad was a nice guy who tipped well, didn’t creep, and told off dudes who did.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 131,
                  "content": "I honestly think hardly anything speaks for a man's character as much as being genuinely liked by sex workers who worked with them.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "This is strangely wholesome. ❤️",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "A friend of mine grew up with a single mom, and had a deadbeat dad who dipped out when she was a kid. She stripped to help with college expenses, and now she’s married with 2 kids and owns her business. On the side she teaches pole dance classes (which look extraordinarily hard BTW).",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I sorta wonder if peoples comfort with strippers/exotic dancers/whatever as a job (whether of choice or necessity) increases if you have a family member who's had the job AND the family was open about it.\n\none of my mom's sisters was an exotic dancer (don't quote me on the semantics) at one point when she was young. even though it was a job my aunt had years before my birth, my mom was always really upfront about. talked about it as- if course this isn't a big deal. the pay was good. she needed the cash.\n\nso to me at least- it's not a big deal.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "You rock.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "It's not uncommon at all. I was a stripper and escort years ago, and a lot of women at the club had issues with people either seeing them at work or finding their ad or website online and exposing them. I've even had other women I'd previously worked with find my independent provider website and send it to my partner, who they found on social media, assuming that he didn't know and that it would ruin my relationship or something. (obv I wouldn't have kept something like that from a partner)\n\nPeople definitely do that shit. A lot. They work awfully hard to be up in your business.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Because they see the strippers as a product and an object. Seeing someone they know ruins that. Really gross.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2392,
          "content": "Mhm, don't see him cutting off that coworker.  YTA.",
          "id": 75,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2283,
          "content": "Or his coworker is made up to hide OP goes to strip clubs and saw his daughter there. \n\nHow the fuck else would a coworker recognize his daughter?",
          "id": 76,
          "comments": [
            {
              "score": 1121,
              "content": "Exactly my thought.  \"How did you know I was stripping?\"\n\n\"One of, um, my co-workers saw you!  No you don't know him!  He just happens to know what you look like.  And he walked right out as soon as he saw you on stage, you totally ruined his night out!\"",
              "id": 77,
              "comments": [
                {
                  "score": 264,
                  "content": "And now he can never go back unless you quit",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 189,
                  "content": "You don't know him because he works from Canada.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Or even worse, he stayed and still enjoyed himself.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 883,
              "content": "Super good point. I don't have a clue what any of my coworkers' adult children look like.",
              "id": 81,
              "comments": [
                {
                  "score": 58,
                  "content": "Most men don’t have a clue what any strippers face looks like…. So, there’s that too.",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 48,
                  "content": "My mom's former coworkers all thought my brother and I were in elementary school until I showed up at the office lmao. I was in high school and they were shocked because they didn't think my mom was old enough to have a teenager. Jokes on them, my brother is 10 years older.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 675,
              "content": "That is an *excellent* point. That would explain OP’s seemingly casual acceptance of the “news” from the “co-worker,” and his disproportionate rage and retaliation, directed in full at his daughter.\n\nIf I’d had the poise and opportunity to be a stripper, it would have been a vast improvement over working as a commercial dishwasher my first two years at uni. Nobody ever tipped me in the dish room.",
              "id": 84,
              "comments": [
                {
                  "score": 38,
                  "content": "I stripped my way through college. No student loans and I went to Europe every year. I wish I was still young and fit enough to do it, I loved that job.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "My coworkers recognize both of my adult children because they occasionally do a pop in to meet me for lunch. Some workplaces aren’t cool with pop ins, others are fine with it.",
              "id": 86,
              "comments": [
                {
                  "score": 55,
                  "content": "This is true, but even so - once strippers get into all their makeup and hair and whatever else a lot of them are still pretty unrecognizable compared to what they look like on the average day. I'm not inclined to believe that a coworker who's only seen the kids in passing actually recognised her, it was more likely someone who knows her VERY well 😬\n\nRegardless, OP definitely gets judged as YTA.",
                  "id": 87,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Yeah, depending on the job and the relationship OP has to his co-workers, there could be various reasons why his daughter may have met his co-workers. My mother was a librarian and I met her closer workmates various times.\n\n(OP is of course YTA in either situation.)",
                  "id": 88,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "He could have pictures of her in the office, could have been taken lunch by her,seen her at a company picnic or party,social media.  Or they were personal friends because I don't see someone delivering that news to someone they don't have a personal relationship with.  A stranger wouldn't know how the dad would react.  Whether they'd get a handshake or black eye",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I didn't even think about this. The only reason my dads coworkers even know who I am is because I went to the high school they all worked at and saw me on a daily basis. So unless there's a very specific situation where they would cross paths frequently, there are only two explanations. \n\n1. OP is lying \n\n2. OP's coworker has been creeping on OP's daughter for a while now, and probably went to the club to hit on her. She probably rejected him, and so he told on her to preserve his ego. Which I would be WAY more concerned and disgusted by.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1340,
          "content": "My best guess is since he obviously recognized her he made a pass and got his feelings hurt.....OP you're TA and your coworker is too",
          "id": 91,
          "comments": [
            {
              "score": 698,
              "content": "And now the daughter is being punished for it by not just one man, but *two*. \n\n\nYTA , OP.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 460,
          "content": "Thank you!",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "Accurate",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "I wonder how that conversation went. \n\n\"Hey bud, I saw your daughters titties and later I jerked off thinking about them, you should stop her doing that.\"",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "The kind that says or does something inappropriate to the daughter and wants to beat her to the punch by telling her parents she’s a stripper in order to invalidate anything else that comes out of her mouth afterwards. And if he’s married, he definitely had some covering up to do!",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 44531,
      "content": "YTA by adding conditions to your agreement after the fact.\n\nYTA for shaming your daughter.\n\nYTA for not being a man of your word.",
      "id": 97,
      "comments": [
        {
          "score": 18805,
          "content": "He got me at the bit when he told her to go work at McDonalds as if it’s a more “dignified” job.\n\nDo I want to make minimum wage at a shitty fast food franchise? Or make a grand a night to shake my ass? 🤔",
          "id": 98,
          "comments": [
            {
              "score": 27711,
              "content": "**Everyone with a job is selling their body!**\n\nOP. YTA",
              "id": 99,
              "comments": [
                {
                  "score": 6837,
                  "content": "1000% I wish more people got this! All paid labor is selling your body, the only difference is the attire",
                  "id": 100,
                  "comments": [
                    {
                      "score": 3318,
                      "content": "Yes! And honestly stripping is a lot less physically damaging than construction. I always joked I’m a very very dirty underpaid prostitute while working construction: sold my back and safety doing long term physical damage for a job that barely paid 30/h for 14h days. Stripping would have been more dignified",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "I can honestly say that I experienced far more (and worse) sexual harassment in corporate jobs than I ever did in my years of stripping and camming.\n\nIt's also an undeniable fact that the more conventionally attractive you are, the higher your average salary is. Same thing goes with being thin/in shape. Even in corporate jobs, lots of people end up making more than someone else with equivalent skills simply because of their attractiveness. \n\nTrying to say that other jobs aren't selling our body is just bullshit that people tell themselves to be able to judge people for doing something they don't like.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Well said",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Then they'd have to realize they're doing the sexy dance for money not because they actually think they're hot haha... so sad!",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Maybe OP's daughter should go in the the healthcare field. That way she can kill her back while being sexually harassed and demeaned as a human, only wearing scrubs.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Right? Don’t use your body, go work at McDonalds? So working at McDonalds is a purely intellectual exercise, is it?",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 983,
                  "content": "Real. Talk. \nI’m in my 30s in the restaurant industry and we ALL have chronic pain. And that’s not even counting the injuries, that’s just due to the day-to-day toll on our bodies. \nAnd that’s not even considered a physically demanding job!",
                  "id": 107,
                  "comments": [
                    {
                      "score": 176,
                      "content": "Shit I feel like I come home with more aches doing food retail than I used to working manual labor",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 132,
                      "content": "I waited tables and bartended after leaving stripping at 29 yo and it wore my body out. Standing on your feet for 8 plus hours a day, bending stocking moving kegs, scooping so freaking much Ice, the various side work jobs that were just grunt work …. It was back breaking and the customers were far more rude and upsetting than any at the club. \n\nAt least the club had bouncers to toss rude customers out.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "For real! I’m a nurse and man my feet hurt at the end of every day…",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I worked as a cashier in a firm where we didn't have chairs because we were doing restock any time we had no clients at the register, and sitting down was considered a \"waste of time\" by management.\nProbably made way less than a stripper for bigger damages to my legs and my back.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Nothing irritated me more than people telling me my serving job wasn't physically demanding. I had to buy a new pair of shoes every eight months because I wore them down to the rubber. I injured my foot at home on a Friday morning before a weekend full of doubles, which exaggerated the pain in my foot so bad I had to take a few days off. That still wasn't enough time to heal it but it was all I could afford/get approved. I had pain in that foot for over a year until COVID hit and I was suddenly on UE. Now, my foot is finally healed, I quit drinking after years of addiction, and I'm never working in another restaurant again. That industry will sap all your energy and health and give you $2 an hour in return.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I've been out of the restaurant business for 6yrs after doing it for over a decade. My feet still hurt.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "What I remember from waiting tables is the constantly swollen feet and lower back pain. And I was 20.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My arms were always dotted with burns when I did food service, and my back always hurt. Later I got plantar fasciitis from retail. Which went away as soon as I wasn't in retail anymore, even when everything else remained the same (weight, etc.).",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "The feet aches be constant",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "I worked at a place where we worked on commission. You think I didn't use my body for sales?! Hell yes I did. I was young, hot and made a killing. \n\nMy fat flabby current self is proud of that.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Came to say exactly THIS! OP YTA. A lying AH of a parent too. You did this because your stupid AH of a coworker embarrassed you. She probably embarrassed him and he wanted to \"get her into trouble\". Wonder why she didn't tell you she was stripping or needed money? You seem like you are the kind of person that starts out all conversations emotionally, like lashing out with anger before you think about what you really want. Do you want her to stop stripping? If so, why do you want her to stop? Arguing with her wont make her stop and taking away her car payment DEFINITELY won't. You're creating a situation where she'll be dependent on the job. What kind of relationship do you want to have with your daughter? Do you love her and want to continue to have her in your life? Why does she like to strip? Money. Yes. Attention. Probably. Validation. Probably.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "And sometimes their soul.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I had to do really unethical things at my last job, like evade trade embargo...\n\nBeing a stripper is hard earned money! \nAnd obviously she needs to pay for her college, so it's not on you to decide how she have to finance her education.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "And McDonald's is way harder on your body than stripping.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Everyone with a job is also selling their mental health!",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yes, it’s just another form of labour. All work (especially manual or in-person work like stocking shelves, flipping burgers, or operating the cash register at a big box store) is selling your body.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 968,
              "content": "A grand a night to shake your ass and get a damn good work out if you're pole dancing. Hell, who wouldn't be happy to be paid to work out?",
              "id": 124,
              "comments": [
                {
                  "score": 297,
                  "content": "As someone who took some lessons in pole dancing. The muscles you discover that you didn’t know you had was amazing. I am uncoordinated as hell. So some of those moves where a workout.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Oh I’m not discrediting how strenuous pole dancing is. I’ve dabbled with it before and it’s tough and painful. And I’m a pretty damn fit woman.\n\nI think it’s amazing to watch women do it so gracefully and so seductively.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "I have been barely able to move all weekend due to taking a pole class on Friday evening.",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "My bff took pole dancing for a while and I tried it out with her a few times and always ended up hurting in places I never thought I could 🤣",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "For a grand a night she probly wouldn't care if her dad supported her. I doubt shes making that much, but I dunno know I don't strip.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 92,
                      "content": "It's not a fixed amount you get paid and most places you have to pay to dance there, wether it's a fixed amount per night or a % of what you make.\nSo if it's a really quiet night you can end up losing $$\nAnd on the good night's the sky's the limit. The most I ever made in one night was $3260 and the least amount was -$52 but on average during my time as a spicy dancer was around $800-$1000 a night.",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "I'd be a helluva lot more in shape if I got paid to work out. haha",
                  "id": 131,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I probably still wouldn't.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I went to went to a strip club in Vegas and spoke to one of the women working there. She told me she only works 3 days a week, lives in Southern California, and flies into Las Vegas to work Friday, Saturday, and Sunday and made $200,000 a year, and this was 15 years ago. If I was a young, hot woman, I'd do it too.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I did pole fitness as a way to work out and it was hella fun. If i had the body to earn money dancing on one then I totally would have.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "While I agree with everyone here about op being an asshole. If it were my daughter i would be concerned. And this is why. i worked as head of security in quite a few of these establishments, from upscale to downright sleezy. Ive seen sweet girls coming in to make an easy buck and make a quick buck off of their youth. I support that. But they get hooked on it and wind up overstaying in this life longer than they should. Late nights turn into drinking heavily with patrons and doing hardcore drugs to get through 5 straight nights of 12 hours sometimes. They wind up falling behind in school or lose their real dream due to being unable to even get up during daylight hours. Then theres the creeps that follow you to your car, stalk you , harass you, and in some really bad cases, kill you. No problem with any woman doing this job, as long as they can maintain the discipline and not fall off a cliff of drinking , drug abuse. And alot of cases actual real prostitution. God knows ive caught girls giving blowies in vip for extra money. Just food for thought. But id always support my daughters in their decisions and bring some old trstament wrath on those who would do them harm. unconditionally. OP is TA.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "To each their own. If you wanna do this, and if you CAN do this, then more power to you. But many people don't. I, for instance, cannot and don't want to, I'll take a shift at McDonald's any time over this. It's not just about \"shaking your ass\", this is such a naïve and oversimplified vision of it. What about withstanding attention from a bunch of creepy customers? No thank you! Any type of sex work involves certain risk, but especially if you have direct contact with \"clients\". I'm not OK with this. Everybody has different boundaries. Women are being objectified on a daily basis, I personally don't wanna add any more to the pile. If you, or anybody else has a different attitude though - that's great. But downplaying the risks - physical or mental - can be extremely dangerous too. And finally, I think it's also not fair to downplay how much work and training goes into \"exotic dancers\". Damn, these women work their asses, they don't just shake them!\n\n&#x200B;\n\nThat being said, the dad is AH.",
              "id": 136,
              "comments": [
                {
                  "score": 25,
                  "content": "Yeah, it's dealing with \n\n1) a very physically demanding job, both in the sense you need maintain your appearance and in the sense you need to at minimum stand in heels all night, often pole dancing or dancing the whole time too.\n\n2) creeps, weirdos, and misogynists that are clients and bosses and people you know out of work who find out, some of whom are bound to think of you as an object.\n\n3) the sheer effort it takes to be naked and vulnerable and appear sexually comfortable at the same time.\n\n4) the amount of judgement you potentially face if IRL people find out, like OP's poor daughter has.\n\n5) the strain it can place on romantic relationships, even if a partner is understanding.\n\n6) having to often be an emotional or sexual surrogate for lonely people, especially dudes. A lot of exotic dancers and strippers I've known or read testimonies by have said there's a lot of near social work involved by men who open to them like a therapist or friend.\n\n7) no benefits beyond $ as far as I know. No insurance no matter how many hours you work, unless you pay 100%. \n\nAnd that's just thinking about it for a moment, not living it. That's why even my asexual ass is impressed by the folks that do this for a living. It's a job that not every person can do and is ripe with minefields of exploitation and danger, as well as emotional and physical stresses. \n\nTo be clear, I don't look down on them, far from it. I just am always hoping that there's no coercion, no safety risks they have to deal with + are kept safe by security, and have a honest club management who isn't exploiting them financially or *otherwise.*",
                  "id": 137,
                  "comments": [
                    {
                      "score": 9,
                      "content": "> I just am always hoping that there's no coercion\n\nThe fact that you need money to eat and not be homeless itself sort of... muddies the waters on if taking *any* job is done without coercion.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "> make a grand a night to shake my ass\n\nBold of you to assume most of us would make a grand in this economy unless we look like Megan Fox or something.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2195,
          "content": "And… OP you could have avoided this if you had CHOSEN to fully support her through college. But you left her to her own devices and she devised a decent way to make money. You have no right to judge her. YTA",
          "id": 140,
          "comments": [
            {
              "score": 1251,
              "content": "He's forcing her into more sex work by making her broker.\n\nOP is a short-sighted, conditionally-moral asshole.",
              "id": 141,
              "comments": [
                {
                  "score": 59,
                  "content": "Was going to say the same thing.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Glad I’m not the only one who caught this!\n\nOP YTA for so many fucking reasons everyone else has stated. And I want to add that you’re punishing your daughter for your own damn ego, not bc you care about her. It’s the misogyny of “no daughter of MINE is going to be doing that” you are taking out on her, and actually driving her further into sex work. If you cared about her safety you wouldn’t do that. This is all about you.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Wow, what a privileged comment. I'm really not sure how you can't understand that not everyone can afford to put their child through college. It's absolutely not an option for a lot of people and shaming someone for their income level is not okay. How this got so many upvotes is beyond me.",
              "id": 144,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 431,
          "content": "Oh but he’s a man of his word: gave it when he wanted, took it back when he changed his mind😂",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Also YTA for putting her in a WORSE spot by not paying her bills. You think - what - making her desperate will force her to stop?",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Not to mention YTA for the way you talk about your marriage. \"My money\"? Are there any women that are allowed to make their own decisions around you?",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I think he has the right to not like it. But he’s TA for changing the conditions on the car thing",
          "id": 148,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "YTA.\n\nJust want to weigh my vote, because OP and his shortsighted nonsense, coupled with the shaming of his daughter due to his own halfbrained ideas about sexualization really makes him TA here. (Let alone dipping out of payments because he just doesn't like HER choice.)\n\n\n*sigh* what are you really mad about OP? Did you like that club and now you're miffed 'cause you feel like you can't go with your coworker? Are you embarrassed he saw your daughter there? Maybe you should shame the coworker instead for going to watch young women half his age shake their booty. Oh, right. You won't... because that's ok, but the women making money off of it is somehow wrong. Or it's not wrong for them, but it *is* wrong for *your* daughter? Explain the mental gymnastics to me, please.\n\n\nI hope she makes a killing and buys herself a new car with all that cash.",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 28485,
      "content": "YTA. She's doing what she has to do. \n\nYou may not like it, but it pays a lot better than McDonalds for fewer hours, so she doesn't have to run herself ragged while trying to study, work, and have a social life all at the same time. Unfortunately, minimum wage has stagnated for about two decades due to people your age and older insisting that it should remain low and that jobs like McDonalds are \"entry level\" jobs and should be paid poverty wages. She would have to work 3-5 times as many hours in a much more physically demanding job to make the same money she's making now. You're asking for her to demote herself.\n\nLike it or not, *every* job anyone has ever worked is selling their body and their time. How is the labourer who has a bad back by 50 selling their body any less?\n\nAlso, your aid in paying her car payments wasn't contingent on her having a specific job or staying away from a specific job, so moving the goalposts now is ridiculous.\n\nEdit: I just noticed your username. Was that randomly generated, or a thinly veiled way of calling your daughter a whore?",
      "id": 150,
      "comments": [
        {
          "score": 2355,
          "content": "This is all so true. I always felt retail was akin to sex work but pays less and MIGHT be more safe. You don't literally suck a customers.......but you definitely metaphorically do and a lot. And managers dont always help you out. They have the customers back not yours more often then not. The theft is rediculous and if you have a line of people and didnt notice someone stole something it's your fault but if you did notice you can do nothing to stop them because its against store policy.",
          "id": 151,
          "comments": [
            {
              "score": 1630,
              "content": "You don’t suck a customers anything as a stripper, either. Usually the dancers don’t allow touching at all.",
              "id": 152,
              "comments": [
                {
                  "score": 132,
                  "content": "Oh right i didn't think about that. All the mire reason sad is wronga",
                  "id": 153,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 58,
                  "content": "We had a \"two foot distance\" rule at every club I ever worked at and security cameras. I got written up once because I stumbled on my six inch heels and put my hands on the customer's shoulders to catch my fall during a table dance.",
                  "id": 154,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "That’s not the same for every club. Jesus, my friend had a longggg list of stories from places she  danced at. Plenty of places doubling as brothels. Money talks.",
                  "id": 155,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 841,
              "content": "I'm an online SWer, and I can say with absolutely definitiveness, retail/customer service fucking blows in comparison. I will never go back. Jerking off on camera is way more fucking dignified.",
              "id": 156,
              "comments": [
                {
                  "score": 459,
                  "content": "I worked as a bartender at a BDSM-fetish club and as a waiter in a regular restaurant; club paid well and the (very sporadic) harassers were thrown out and never allowed entry again, the restaurant did absolutely nothing to protect the staff and paid shit, not to mention the shitty working hours and late minute shift changes.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I believe it",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "More honest too.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 328,
              "content": "Yeah honestly I just used to work for Target and I would still have to deal with things like male customers touching/ grabbing me inappropriately and having to manage my response to not offend them and/or putting up with them following me around the store and watching me as I stocked or peppering me with unnecessary questions and giving me a hard time intentionally as an excuse to keep me talking and keep flirting with them. \n\nDefinitely did not pay enough, and I also messed up my back. Society has come a long way over time, but there's still an expectation in retail that you politely endure and/or pander to the flirting because if you tell them you're not interested and to screw off then you'll get dinged for having a bad survey or being rude to guests. \n\nIt's kinda even more degrading to be expected to stock shelves for flat minimum wage while a creepy guy follows you around staring at your ass every time you bend over and you have to act politely helpful and suck up to it.",
              "id": 160,
              "comments": [
                {
                  "score": 69,
                  "content": "Agreed at least with stripping you expect people to stare at your ass and get money for it.  Not saying stripping doesn't come with its own problems.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Honestly, when you're a woman or AFAB and fem looking, any job is gonna be dangerous, so many men take being nice for the sake of income as some confession of love. Even if you arent a lot of people dont view retail workers or sex workers as humans and have no issues getting voilent with you.",
              "id": 162,
              "comments": [
                {
                  "score": 29,
                  "content": "So true. I worked as a cashier and a returns cashier. I was blocked into my register more than once by a dude putting his items across my exit path. I have tattoos so of course people take that as permission to touch me. One guy said he wanted to see all of my tattoos. I was like umm no. Another guy asked me out I asked if my wife could come. That worked out better than it could have because he seemed genuinely interested in me and not into fetishizing lesbian couples. So he was like oh youre married?...yes this is why I wear a ring on my left hand ring finger. But i get why girls do that and are not married.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I have worn a wedding ring in public since my retail days because of wanting to be left alone and it sadly works most of the time. They only leave me alone because with the ring they perceive me as someone’s *PROPERTY*",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "This is not a common narrative. This is how hole in the wall, poorly managed, barely making money clubs work. Any club that is mid or above has good working conditions, security, and decent management. Strip clubs isn't all SVU.",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "SWer and former retail worker here, I can assure you retail is miles more safe than SW.",
              "id": 166,
              "comments": [
                {
                  "score": 17,
                  "content": "Yeah I figured in many ways retail is safer but I can also see how retail is dangerous albeit in entirely different ways. I think its terrible SWers arent treated with more respect. Also I think they should be able to unionize if they want to, have benefits etc. Im not sure what job needs healtchare benefits more.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I was *just* saying today that so much of retail is flirting for tips, but the tips go straight to your boss' bosses.",
              "id": 168,
              "comments": [
                {
                  "score": 6,
                  "content": "Yep",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Just putting it out there but the security guards at every mall I've ever worked at have been significantly less willing to stop men from harassing me than the security guards at strip clubs my friends were working at lmao",
              "id": 170,
              "comments": [
                {
                  "score": 6,
                  "content": "Thats just sad",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "A regular customer asked me to rub my pussy, I told my manager and he contacted corporate to see what all they could do.  Corporate ghosted him.  He said I wouldn’t have to interact with him again.  Worked for a time, but store was understaffed, I was the only print center employee sometimes, so I had to help him.  Manager said he’d stand by and do work nearby to make me feel safe if I was ever forced to help him.  Well, store was understaffed, so that couldn’t always happen.  So I’d help him like normal.\n\nIn a lot of sex work, creeps don’t get a chance to become regular customers we bend the knee to.  And I’d get paid more than 10 bucks",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1332,
          "content": "I'm going to say this: as someone who has worked in adult entertainment and someone who worked in food service, I was only subjected to verbal and physical abuse from customers at one of those jobs and it was definitely the one where I made $2.13 an hour plus tips.",
          "id": 173,
          "comments": [
            {
              "score": 496,
              "content": "I was waiting for someone to point out the difference in security for each of those jobs. I’m sure his daughter feels a lot safer stripping in a club with security on hand than fully dressed in a fast food joint.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 103,
              "content": "[deleted]",
              "id": 175,
              "comments": [
                {
                  "score": 56,
                  "content": "Good clubs don’t let randos touch the dancers. Sexually assaulting one will have security escorting them right TF out.",
                  "id": 176,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "The great thing about self employment is getting to tell customers to go fuck themselves! r\\ClientCringe is a great time, lol",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "This year makes 20 years since I first began drag,  which I guess is now adult entertainment thanks to Republicans...although my shows were PG. It paid the bills while I got my bachelor's and master's. Now I have a PhD and do it give back. OP needs to stop judging her daughter. I bet this oppressed prude is jealous more than anything. I hope she starts an Only Fans and takes it to the next level! All work is selling your body.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 520,
          "content": "There’s also the added bit that not helping with her car payment makes her more desperate for money. She can’t rely on her dad to help her in financial hardship anymore. What if she gets injured, or her car gets damaged, or any other financial hardships happen? It’s not as easy to say no to dudes who get to touchy or cross boundaries or get too attached to her if it means she won’t make enough money to survive.\n\nParental support helps give her the power to be more choosy and therefore more safe. Sleazeballs who visit her club (like OPs coworker) can tell when a girl will let boundaries get pushed out of desperation.\n\nIf OP is really that embarrassed by sex work, or cares about his daughter, I’d think he’d be more worried about driving her further into sex work and away from the safety he could provide.",
          "id": 179,
          "comments": [
            {
              "score": 29,
              "content": "This should have more upvotes.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Dude is just asking for her to become an escort by cutting off that car payment.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "The way I see it, he's basically pushed her to work more hours stripping since she has to make her car payment herself now.  \n\nWay to win at parenting, daddio!!!  YTA",
          "id": 182,
          "comments": [
            {
              "score": 16,
              "content": "Exactly.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "Omg the username! I think you’re onto something there u/draiel",
          "id": 184,
          "comments": [
            {
              "score": 36,
              "content": "Yup. Came thru the comments to see if someone pointed that out yet. \n\nOP you are the worst. And tbh, your wife isn’t any better if all she did was slightly admonish you. If your wife is her mom, y’all are equally crappy so congrats. \n\nIf she’s her mom & doesn’t pay the bill in your assinine absence of sense, congrats, you’ve terrorized her enough to not even care for her child enough to do anything about her father abusing her (her whole life let’s be real). \n\nIf your wife couldn’t pay it bc The Man Of The House said NO. &/or bc you hold the financial purse strings — congrats you’re a textbook sexist, misogynistic, abusive control freak. \n\nIf the ppl you’re supposed to love the most fear you, YOU ARE THE PROBLEM. If you pride yourself on humans you care about fearing you (like my male life giver), YOU ARE THE PROBLEM. If you see “respect me” as “obey me”, you guess it! YOU ARE THE PROBLEM. \n\nThere’s no scenario here where you’re not the problem is the thing. I seriously doubt there’s any hope in you becoming a better human but \n\nJust in case… just in case you want humans to actually love you and not fear you, if you want to learn how to actually like & love yourself & not behave in such a very toxic way — get help by first recognizing YOU ARE THE PROBLEM. \n\nIf you can’t admit that, sorry but there’s no hope for you OP. You won’t have to worry about which career your daughter sells her body & soul to (your body & your labor is the commodity one uses to earn a living unless you earn a living off of other human’s bodies & labor; no matter the industry). She’ll either kick you outta her life, \n\nor since, unfortunately you & your enabler are the model of how love is given, she’ll probably end up in an equally abusive relationship if she doesn’t recognize the damage y’all have done to her & is able to get a handle on that childhood trauma she gets to deal with in adulthood. \n\nSo. GreAt. I’m hoPING in cASe you miSsed wHat my wOrds refLEcted:\nYTA OP",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Oh God I just caught the username. \n\nThis guy is going to be lucky if his daughter ever speaks to him again.",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "My step brother works repainting cars and is only 25 but his lungs are already suffering.",
          "id": 187,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Agreed. Massive YTA. Also, noticed OP argued with his wife about it and said its 'his money so he can decide what to spend it on'. OP it's also your wife's money. You shouldn't be making unilateral financial decisions, that's just being a shitty husband and partner in life.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I agree with everything except you saying that McDonald’s is more physically demanding th-! stripping. Stripping is extremely physically demanding work and hard work at that.",
          "id": 189,
          "comments": [
            {
              "score": 55,
              "content": "Stripping is physically demanding, for certain. But to make what she makes stripping, she’d probably have to work 40+ hours a week at McDonald’s. So yeah, when you compare them, McDonald’s would probably come out as more demanding in that regard.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "I'm not saying that stripping isn't physically demanding. But strippers get breaks, right? And pole-dancing is usually for a few minutes and then like 20-30 minutes off, yea? I haven't really gone to any strip clubs so I'm not 100% on that, so if I'm wrong, I'm sorry. \n\nBut I did work at a fast food restaurant for over 5 years, and it wasn't uncommon for people to collapse from exhaustion while working. I would almost always eat at the restaurant after my shift, even if I wasn't hungry, just so I had an excuse to stick around for 20 minutes to rest my legs so I wouldn't collapse on the 10 minute walk home. Then there's the heat exhaustion as well, fast food doesn't close just because the air conditioner is broken, and those grills and friers get to hundreds of degrees. McDonalds was in the news not too long ago for wage-theft due to not allowing employees to take their breaks. Hell, my *25 year old* manager had a heart attack on the job. Fast food restaurants push and push their workers to, and even beyond, breaking point.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Exactly. There is this woman who comes into my job sometimes and sometimes my other coworkers are like \"she has to be a stripper\" because she pays in a bunch of singles sometimes for her items. And I'm like yeah,but if you think about it all the items she's buying with those singles, a lot of us can't even get after 1 week of pay even with our employee discount. She can just pick stuff up and go, and we have to put stuff to the side to wait for payday.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22309,
      "content": "[deleted]",
      "id": 193,
      "comments": [
        {
          "score": 4371,
          "content": "I assume she'll just start doing extras to make more money in the same amount of time. Good work dad!",
          "id": 194,
          "comments": [
            {
              "score": 1893,
              "content": "Seriously... this is just going to push her toward full-on sex work.",
              "id": 195,
              "comments": [
                {
                  "score": 736,
                  "content": "Not to be pedantic, but the phrase you're looking for here is \"full service\" sex work.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 149,
                      "content": "Can’t lie, I came to these replies to say this. Tbh it’s a petty difference but it still makes a difference in the mindset towards sex work",
                      "id": 197,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "Can you please explain to me what the difference is (genuine question)?",
                      "id": 198,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "And maybe towards less safe SW places if her current place can’t give her more hours. Because sadly in those fields there’s a lot of people ready to pray on vulnerable people in need of an income",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 166,
              "content": "this is how it normally goes!",
              "id": 200,
              "comments": [
                {
                  "score": 28,
                  "content": "I was a stripper for years, I didn't immediately start FSSW any time I was a little broke. But go on.",
                  "id": 201,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Seriously.\nI was a stripper for over a decade and not once did I take money for anything more than dancing. Not All strippers are selling on the side.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "I mean…it’s not. While FSSW is not something to be shamed, strippers don’t just automatically become FSSW. I had a ton of clients and friends that were strippers, your assertion simply doesn’t hold water.",
                  "id": 203,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yea now it’s time to be a sugar baby. I bet daddy will LOVE that",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 917,
          "content": "\"I'd like to thank my dad for the push to start an onlyfans\"",
          "id": 205,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 316,
          "content": "He thinks that by putting her in a bind she’ll go to a respectable job that pays less. He’s pushing his daughter away and probably sending her down a rough road. Dad of the year.",
          "id": 206,
          "comments": [
            {
              "score": 38,
              "content": "Tbh, I work a entry level job that is \"respectable\" but there is zero respect from the patients/corporate.  At least in stripping, she has a bouncer who can tell disrespectful customers to gtfo instead of giving the customer a gift card and writing the employee up for literally no reason.  Also, wtf are men so insane over their daughters?",
              "id": 207,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "guess who will be put in the shittiest retirement home she can find when he gets to that age 🙃",
              "id": 208,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 283,
          "content": "Yeah he really didn’t think about what he’s incentivizing.",
          "id": 209,
          "comments": [
            {
              "score": 19,
              "content": "Yeah, he only thought about how he could control her. Good luck with that.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Right? Now she has to depend on public transportation or Uber/Lyft which can have its own safety issues? At least in a strip club they have bouncers to stop people from touching the strippers.",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Right? Things are tough right now, everything is expensive, and she felt she needed to strip to make it work. So this dude thinks pulling more mo ey away from her is going to fix it??",
          "id": 212,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10497,
      "content": "YTA. You should’ve asked the guy you work with what he hoped to gain by telling you this. \n\nThe only reason people have a stigma against stripping is because it’s where a woman is using her body however she likes, and of course men are threatened by it because they get no say over it.\n\nIf there were stipulations for the car payments, you should’ve said so before starting.\n\nAre you prepared to destroy your relationship with your child over this? Because it just might.\n\nGrow up. \n\nIf you object to her working, pay her as much as she is making. If you no longer want to support her, be a model of adulthood and kindness by coming up with a plan to ease her into covering an expense that you agreed to cover.\n \nAnd stop talking to jerks at work who want to stir up drama.",
      "id": 213,
      "comments": [
        {
          "score": 2329,
          "content": "I wonder what would happen if OP went to HR to tell them his Co worker wanted to discuss his daughter being a stripper....",
          "id": 214,
          "comments": [
            {
              "score": 1348,
              "content": "My jaw just dropped. Because … isn’t that more important? This person did something super inappropriate and at the very least THEY should be scrutinized for their intentions. Are they the kind of employee who would use privileged information to benefit themselves over the company? Are they malicious actors? do they seek to hold private personal power over colleagues/superiors/subordinates? Are they someone who seeks to inflict emotional damage on others? Are they in a position of power over others? If so, should they be? What kind of reflection / impact could they have on a business?",
              "id": 215,
              "comments": [
                {
                  "score": 401,
                  "content": "The coworker likely never existed. Coworker just happened to recognise a coworker's adult daughter? Uh-hrm.\n\nOP just doesn't want to admit that it was him at the strip club.",
                  "id": 216,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Yeah, but people would be totally happy if she was a model even though the world of modelling is pretty harsh",
          "id": 217,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 32,
          "content": "Stripping is actually a profession where women use their body how men want them to.",
          "id": 218,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "> You should’ve asked the guy you work with what he hoped to gain by telling you this.\n\nHe knew this would happen, now he's going to go back to her and be her white knight.",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "You definitely “use your body” in retail/restaurant jobs and for not enough pay.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "> Are you prepared to destroy your relationship with your child over this? Because it just might.\n\nIt probably already has.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8411,
      "content": "Did you lecture your coworker for going to an indecent place?",
      "id": 222,
      "comments": [
        {
          "score": 2224,
          "content": "This. He didn’t seem to mind the coworker being a patron of a strip club and supporting strippers but he cares that his daughter is one of the strippers? He wasn’t weirded out that the coworker thought it was appropriate to tattle on his adult daughter? \n\nWhy is the daughters job invalid but the coworker’s patronage was valid? Hmmmmm.",
          "id": 223,
          "comments": [
            {
              "score": 605,
              "content": "ThAT's juST bOYs BeING BoYs thOUgh!",
              "id": 224,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 53,
              "content": "I wouldn't even be surprised if it was actially OP at the strip club and I alluded to it in my own comment haha. In any case, I *really* wouldn't be surprised if OP is fine with oggling other people's daughters but is clutching his pearls about other men doing the same to his own. So tell us OP, truthfully, have you ever been to a strip club?",
              "id": 225,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 537,
          "content": "I was just about to ask this",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 172,
          "content": "The INFO I want to know",
          "id": 227,
          "comments": [
            {
              "score": 38,
              "content": "The info I want to know is how the coworker recognized his adult daughter.  I've worked with the same people for 10 years.  Couldn't tell you at all what any of their kids look like.  I'm not entirely convinced it was a \"coworker\" who spotted her.  More like OPs favourite after work activity just got ruined on him",
              "id": 228,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 117,
          "content": "Of course not",
          "id": 229,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 39,
          "content": "Of course not! It's okay for MEN to PAY women for their bodies but not okay for WOMAN to MAKE MONEY from their bodies!!! /s",
          "id": 230,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "Plot twist: there is no coworker. \n\nOP; YTA. People have given you great reasons for why that is.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "As if a coworker would recognise a coworkers adult daughter… how many of your coworkers grown children would you recognise on a night out? The dad clearly went there himself and saw her, that’s why he’s so angry!",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "That's not the biggest thing that bothers me. What the coworker does in his own time is his business. As long as it is legal, it's fine for me.\n\nBut what does bother me is coworker talking (maybe even bragging) about it at work.\n\nEdit: grammar, I'm not a native speaker of english",
          "id": 233,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6515,
      "content": "The real AH is the tattle tale co-worker.",
      "id": 234,
      "comments": [
        {
          "score": 1252,
          "content": "Right?! Like who the hell would feel the need to do that?",
          "id": 235,
          "comments": [
            {
              "score": 1419,
              "content": "A guilty person who was checking out his daughter at a strip club who figured he needed to beat her to the punch. She wouldn’t have said shit, dancers are discreet unless you’ve done something in appropriate",
              "id": 236,
              "comments": [
                {
                  "score": 528,
                  "content": "Either that, or he's an asshole who gets off on having the power to piss off his coworker.",
                  "id": 237,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Seriously...or it was actually OP that went and saw her. Like...unless OP is trying to set her up with every fucking dude at the office, why would some coworker of his recognize her? I sure as hell wouldn't recognize my coworker's adult kid on the street, let alone some place like a club.",
                      "id": 238,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "I reckon he recognized the daughter from pictures on her father's desk, tried his luck with her, and then tattled to get revenge when she refused him.",
                      "id": 239,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "more than likely he did do something inapparorpiate or she rejected him and he wanted revenge",
                  "id": 240,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": ">who was checking out his daughter at a strip club\n\nThat would have been the first thing I said to this creepy dude.",
                  "id": 241,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "He probably hit on her and she turned him down.",
                  "id": 242,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Then she passes you off to the bouncers 🤣",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Either that or someone who knows that OP goes to strip clubs on the regular and is trying to make sure he avoids that particular one.",
                  "id": 244,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 228,
              "content": "One thing about shitty men is they’ll always make themselves available to help other men police women",
              "id": 245,
              "comments": [
                {
                  "score": 16,
                  "content": "This deserves more recognition. Maybe not a tee shirt but a sticker? An Instagram post? Something.",
                  "id": 246,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Embroidered on a pillow!",
                      "id": 247,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Someone who tried to hit on her and got denied so he tattled to daddy. OP, YTA. And so is the coworker.",
              "id": 248,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "It's creepy as hell",
              "id": 249,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "I think there’s plenty of AH to go around here, except for the daughter that is",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "No. OP is still an AH and the bigger one at that. The Co-worker isn't actually her dad.",
          "id": 251,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "No dad's definitely a real AH too",
          "id": 252,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5744,
      "content": ">not use her body \n\nwhat is she supposed to use at mcdonald’s?",
      "id": 253,
      "comments": [
        {
          "score": 2092,
          "content": "Also McDonalds is less safe than most strip clubs. Most have bouncers/safety measures for the girls, McDonald’s has nothing but abusive customers and danger lol",
          "id": 254,
          "comments": [
            {
              "score": 1073,
              "content": "I danced for 8 years. My dude worked at McDonald's for 8 years. Badly behaved customers at my old work were escorted out, whereas at his old work the verbal abuse was more frequent.",
              "id": 255,
              "comments": [
                {
                  "score": 476,
                  "content": "I googled fight/attack at Macdonalds I got a sickening amount of responses, like so many assaults on employees I couldn't actually look at them all. \n\nYeah she's safer at the club with bouncers. \n\nAlso stalling her car payments won't make her safer walking is not how women are safe in cities",
                  "id": 256,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "You get pissy at a strip club they make you leave. You do it at the arches, you get rewarded.",
                  "id": 257,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "My sister was almost trafficked while working at McDonald's... twice. Yeah, I'd rather she work somewhere security will look out for her.",
                  "id": 258,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "I've seen customers throw hot food/drink at cashiers. All we can do is deny them service after the fact. I feel so bad for the girl who got scalded by a hot coffee to the neck. Fast food isn't easy, or simple, or safe work. And you're never paid enough for what you have to put up with.",
              "id": 259,
              "comments": [
                {
                  "score": 16,
                  "content": "Years ago, we had a customer throw a cup of urine at us in London, Ontario. It happens. (Edit: not a McDonalds, my story happened I. A Tim Hortons)",
                  "id": 260,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "And I know girls who have had male managers at maccas who try to abuse their power and assault them.",
              "id": 261,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I can second this my mom was a stripper and while yes, there were creepy dudes who tried to follow her home I've also dealt with that in fast food work. She actually didn't have to touch anyone unless she wanted to. She gave part of what she made to the bouncers, and dudes who broke the rules were thrown out without exceptions. \n\nIve worked at a mcdonalds and when i reported a manager for sexual harassment (after he had already gotten shit for it for trying that with a minor) they told me it didnt count and magically the camera in the area he kept cornering me in was broken, we also had someone threaten to shoot up our store cause we were closed for the night, and i had to put myself between an old dude and one of my teen coworkers cause he was mad he had to pay for gravy.",
              "id": 262,
              "comments": [
                {
                  "score": 24,
                  "content": "Jesus Christ the more people that comment the more I realize just how terrible clown corp is. \n\nI really hate people who use the “well guys will follow you home” I worked at Target and had creepy guys try to follow me to my car when I closed. I’ve also had _fathers_ of children do it when I worked at a daycare. They didn’t get reprimanded even when I reported it because daycares don’t care as long as they get money and Target isn’t as bad as MCD but it’s not great to it’s employees either.",
                  "id": 263,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yup my location actually hospitalized me because they werent letting me drink water, i was sometimes working 10 hour shifts and not getting my tens and i had several managers that would try to get out of giving me my lunch breaks, i also wasnt allowed to have water at my register. So i would be running around and lifting heavy objects in high heat with very little to no water, i had health problems they knew about so the extreme dehydration kind of added to them and i was hospitalized, my doctor also kept putting me off for a week at a time because every time id get better I'd go back to work and suddenly be on deaths door step again. They basically quiet fired me by drastically cutting my hours, i ended up leaving one night after seeing how they'd drastically cut my hours and doctored it to look like I'd put in for days that I didn't, i talked to my GM about it he refused to change it saying if i was that sick i shouldnt be working anyway (which i wouldnt have even had a problem had they just let me fucking sip a glass of water, followed my request for allergy accommodations when i asked for dishwashing gloves, and stopped leaving me alone during several hour long rushes aside from occasional flareups my symptoms are normally manageable) this mixed with the sexual harassment conversation (oh btw i also supplied the evidence for the minors case against that manager ) was my breaking point. I had a breakdown, called my boyfriend, and he just told me to leave. The dude who harassed me wasn't even the only creep they hired and refused to deal with. That place is horrible, and i warn everyone against it if they can help it.\n\nYeah, i never got people who use that, im very pro not glorifying sex work and talking about the possible dangers. it's important to talk about the good and the bad, but \"well guys will get creepy if you do it\" just comes off like victim blaming to me. Guys are always gonna be creepy, predatory, and dangerous when you're in a position where you can't really tell them to screw off because the kind of dudes who do that stuff will always flock to situations where they know they have power and the excuse for why its your fault always changes \"well maybe you shouldn't be so nice\" i could get fired if im not nice im all alone up here what if he gets violent i have to be nice, \"you have to tell them no/to stop and be assertive\" when its your boss or manager youre in a position where they can retaliate against you, \"why didnt you tell someone, just refuse to serve them\" how am i supposed to do that when management doesnt care and we are always understaffed, \"well you shouldnt be so dressed up for work\" how is scratch grey cotton shirt ive been sweating in for hour sexy? Also, a lot of places have rules about \"looking presentable\", and every other reason people find to blame people in bad position",
                      "id": 264,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Put me down for this one too. I’m a middle aged female working on a sewage truck cleaning portapotties and I still had a construction site manager come up to my truck window, grab my hand and refuse to let go until I took his phone number. He even called the office to ask for my home number, but retail and restaurant work was far, far worse.",
                      "id": 265,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Strip clubs are definitely the safest means of sex work as far as I’m aware and much safer than fast food, but the more intimate work she will likely end up doing as a result of OP cutting her off is definitely much more dangerous than McDonald’s.",
              "id": 266,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Can confirm",
              "id": 267,
              "comments": [
                {
                  "score": 6,
                  "content": "Can also confirm.",
                  "id": 268,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Definitely not the ice cream machine.",
          "id": 269,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Telekinesis",
          "id": 270,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "McMagic from the McDonald's employee ™️",
          "id": 271,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "In stripclubs there are many strict rules about how far guests can go with an employee. And these rules are strictly kept. \nThe biggest bodily harm I can think of (if the girl is really just striping) is bruises from the poledancing. (Which is a great and very hard sport)\n\nIn McDonald's there are safety rules, but (accidental) burns do happen. Rude (drunk) costumers happen.",
          "id": 272,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4182,
      "content": "Yes, YTA. As both a former short order cook and former strip club bouncer, believe me when I say that stripping is the more respectable profession. Just to be clear, you’re cutting your own daughter off because people are looking at her jubblies. Really think about how conditional your love is.",
      "id": 273,
      "comments": [
        {
          "score": 1089,
          "content": "Right? I don't recall a single time I've heard of a stripper getting spat on during the course of her job, or have food/drinks thrown at her, insults and cuss words hurled at her while performing, etc. But it happens to fast food employees constantly.",
          "id": 274,
          "comments": [
            {
              "score": 237,
              "content": "I've heard of them getting shot because they had no tomatoes... I'd much prefer stripping to thar",
              "id": 275,
              "comments": [
                {
                  "score": 37,
                  "content": "This reminds me of a hotel owner was shot and killed because they didn't let someone use the pool.  I don't understand how people escalate simple issues to such horrible outcomes.",
                  "id": 276,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "people are wild when it comes to food. they take hangry to the next level.",
                  "id": 277,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "Or worse.",
              "id": 278,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 380,
          "content": "Upvote for “jubblies”. And for a good answer.",
          "id": 279,
          "comments": [
            {
              "score": 13,
              "content": "Upvote for upvoting “jubblies”",
              "id": 280,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 317,
          "content": "Seriously! I got robbed while working at a fast food place. My employer didn’t even care. At a decent club, the girls just have to give the bouncer the signal, and whoever is harassing them or crossing the line is out of there. I have friends that have worked as dancers, bouncers, waitresses, and bartenders at strip clubs, and they all look out for each other and make sure the customers are showing respect. There’s way more respect there from customers than in fast food places. I personally don’t get the big problem people have with dancers either. It’s a great way to embrace your body, express yourself, and make good money while doing it. More power to any girl who has the confidence to willingly do that!",
          "id": 281,
          "comments": [
            {
              "score": 9,
              "content": "Yep, my friend got shot in the stomach as a cashier at Papa John's",
              "id": 282,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "My best friend used to strip and I remember their coworkers being responsible and respectable people who just had bills to pay. The security alone is a big bonus, op should really gain a different perspective on how his daughter is making good choices. She probably dances under a pseudonym, there's strict rules and guidelines in place to protect the safety of the dancers, she's getting cash basically for exercising, and it probably doesn't interfere with her studies.",
          "id": 283,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "TIL that we women have *jubblies.* My new fave word! Combo of jubilee + baubles.",
          "id": 284,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3940,
      "content": "ok so u cut off her car payment so now your daughter will double down and take extra stripping shifts to pay for it.  so cutting her off is not going to make her stop either way.",
      "id": 285,
      "comments": [
        {
          "score": 843,
          "content": "Not to mention a quick trip to the No Contact Zone down the line if he keeps up this line of thinking and manipulating. YTA OP.",
          "id": 286,
          "comments": [
            {
              "score": 39,
              "content": "It’s also to me seems like he’s more mad about the stripping because of how it “looks” on him, you know? Like I’d understand him not being happy about it because customers can be weird and it’s not a super safe job , or maybe the club is in a seedy part of town. \n\nBut nope. He’s just mad at the concept of his daughter ‘selling her body.”",
              "id": 287,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 190,
          "content": "##THIS",
          "id": 288,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "If he's lucky, extra shifts is all she'll do",
          "id": 289,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}