{
  "post content": "First, I want to say I'm 100% certain that I'm the a-hole. I don't know if my certainty is genuine, or just conditioned due to my being the scapegoat/black sheep of my family.\n\nI'm 23. I love my grandparents, but I never visit them.\n\nI never was too close to them growing up. They're not estranged, but we're not close. They left the U.S. as Missionaries for a few years when I was young, and I don't have many memories of them before they left.\nI was much closer to my other grandparents.\n\nGrandma (80s) has dementia. She's going downhill *fast*. It's taking a huge toll on Grandpa (90s). He doesn't sleep much due to her sundowning, and does *everything* to take care of them.\nOne time when my family were struggling, we moved in with them, both to have a roof over our heads, and to help them out. (5-6 years ago.) We didn't know Grandma was as sick as she is.\nOne night, I heard her and Dad arguing in the. Then I heard glass shatter and screaming.\nI'm afraid of anger and yelling, so I listened to music to keep calm.\nDad came into my room and said, \"Keep Bob (my cat) in your room tonight. Lock the door. *Do not* open it until I knock in the morning.\" He then told me she said she'd do something to us that I can't say here. \nEvery night for the time we lived there, we slept with our doors locked.\n\nDad told me if I do visit them, to either go with him, or to leave before late afternoon if I go alone, and to *never* be alone with Grandma.\n\nI also have PTSD when it comes to death/funerals and elderly people (especially sick and/or elderly women). When I was younger (12-13), I lost three people within five months, one of them being Granny. Granny was my best friend and safe haven. I was closest to her. When she passed, I lost everything. Her funeral was the last that I have ever attended. (I attempted to attend a deacon's at my church funeral a couple years ago. I panicked, hyperventilated, and Mom took me home.)\nI secluded from everything and everyone. My therapist diagnosed me with PTSD (and several other things). It's bad enough to the point where if I *see* an elderly person (specifically a woman who looks the *slightest* bit like Granny), I will panic. Grandma looks *nothing* like Granny, but she's much older (my brain terrorizes me about the fact that their times are coming), and she sometimes smells like Granny's perfume.\n\nLast time I visited, I was anxious as hell. My mind flashed back to when I was 12-13. It told me things like, \"What if they just dropped right now?\"\n\nI want to visit them because they don't have much time left, but that's the exact reason why I don't go.\n\nI feel like I'm the a-hole because of all of that. I rarely bring it up when Dad asks why I don't visit. I don't like making excuses. My sister says I need to \"get over myself\" and just go and visit them. She says I'm selfish, and I'm starting to believe her.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 31,
      "content": "NAH here and this issue is miles above our pay grade.  This is a really tough spot that everyone in your family is in, even your Grandma.  She didn't chose to have a disease like this.  Your grandpa is doing the best he can but she needs much more help than he can give.  Start a discussion on what the best way to support your grandparents is (your grandpa needs help too, as a maybe burned out caregiver and cause he is watching his wife go through this terrible disease).  With proper support for your grandma, visiting or interacting with her may feel less scary to you.  Also, you mentioned you have PTSD when it comes to losing people.   Consider getting support for that.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 21,
      "content": "NTA but I think you might regret not visiting them once they die. Also, elderly people and dying are part of life. You say you have a therapist: I hope you are actively working at managing your PTSD because you’re going to have to deal with this at various points in your life.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "Nta.\n\nBe honest and don't feel guilty. People can never truly understand what PTSD does to us. They see a definition on the web but they miss the actual vital information that this is not something that you just \"get over yourself\". no this is something that will be by our side (depending how deep the trauma reaches) for the rest of your life.\n\nSometimes you must tell them in color what happens when your triggered, what triggers you. \n\nAs someone who has Multiple PTSD, I know what I am talking about. Stay in therapy, learn how to handle your trigger. And don't jump on roundway express train \"anxiety\". Move your eyes around don't focus. \n\nIf you feel anxious do the following \n\n1. Look around you and tell yourself 5 different things that you feel with touch/see/smell/hear and maybe taste. For each one of them 5. This exercise is meant to move your thoughts away from what is triggering you for you to calm  down\n\nIt helps me when I have a panic attack or totally anxious to focus on something else then my own thaughts in this moment. Refocus.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Nope you def are not an asshole for this nor are you selfish. Please don’t believe that. This is a very complex situation and your feelings are valid about your grandma. I think though that you would feel better if you started at least some form of contact( I recommend virtual if you can handle it. It can be camera off to help with your anxiety). Try asking your family if they can set up zoom calls for you guys and your face camera is off. Or to make yourself feel better you can only send videos of yourbeing happy/healthy so they’d know your okay. Or if you wanted to you could if your not anxious record yourself asking about them and discussing how you feel!! I’m sorry I don’t have a lot of advice for this. But you definitely aren’t an asshole for this",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NAH. You have your struggles and they have theirs. \n\nI do wonder though, since you’re mostly triggered by elderly women (if I’m reading this correctly) would you maybe be able to have a family member stay with grandma and take your grandpa out to lunch sometime? He could probably use a break and the one on one interaction. Possibly something to discuss with your therapist. \n\nSending hugs. I also did not visit my grandmother when she was in a home suffering from dementia. We’d never been very close and.... well, there’s some trauma there as well. If she’s been mentally sound maybe I would have made the effort to mend things, but anywho... \n\nYour family seems like they don’t quite grasp how serious your situation is, which sucks but I don’t know that it quite crosses into making them total A H. Maybe A H-lite.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA, your dad is not an AH nor your Grandparents, the AH here is your sister, she knows you have problems, and that death scares you. Try talking with them over the phone, it might help.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA, it sounds like this isn't just a \"can't be bothered\" or \"I'll get round to it\", you're suffering from PTSD and trauma and my heart goes out to you. \nI guess you need to weigh up between the mental stress it may cause you and the fall out/regret you may feel if you don't visit them before they pass.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. If you're not feeling well when you're visiting them, then it is is not going to be a good visit. Are you calmer when you're visiting them with someone else with you?",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA\n\nThat period in which you had to sleep with the doors locked for your own protection is reason enough not to visit. Add in the PTSD and valid reasons abound. \n\nWhile it might be nice, it shouldn't come at the cost of your own mental well-being. Dementia, even without a history of trauma is a lot to deal with, many find they just can't handle it, it's nothing to be ashamed of, or to be shamed for. It's a hard thing. \n\nYou can't begin to look out for others until you've managed to look out for yourself first. Focus on working with a therapist on your issues around death and the elderly. Not for grandma, but for you.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. You are not visiting someone who your dad has given you very strong warnings never to be alone with. I don't understand why, given that fact, your dad is asking you why you never visit.\n\nI was prepared to cone in here and suggest you find a way to offer your grandmother some companionship or comfort because of her role in your life before she got ill and her inherent dignity and value as a human being, but the whole spiel doesn't apply to your situation at all. Sometimes, people have terrible things go wrong in their brains that make them dangerous in either general or specific ways, and we have to entrust their care to other family members and to professionals. That is the situation you, personally, are in. Keep on with the not visiting and find other ways to support your immediate family in what they do for her.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}