{
  "post content": "6 of us (me, bf, 4 other friends) are renting out a unit together so we can be closer to all the good summer jobs in a touristy town. The property has a TV that isn’t a smart TV and only works if something is connected to the HDMI cable. \n\nWe have been using my laptop to watch movies/youtube/shows together this way all week. I just started training at my summer job and they are demanding to know my laptop password so they can keep watching movies while I’m at work. \n\nI’ve tried to explain that I have VERY personal things on my laptop, discord and messenger autostart and have notifications and I’m logged into all my accounts on my browser. They’re EXTREMELY offended by this and say that I don’t trust them and think they will snoop or go through my stuff or read my messages. \n\nI DONT think they would INTENTIONALLY snoop, I just don’t want them ACCIDENTALLY seeing anything personal without me in the room. \n\nNow everyone is mad at me because they can’t use the TV if I’m at work, I’ve told them to just get a chromecast or something and they’re acting like now they HAVE TO buy it since I’m an a-hole and don’t trust them. AITA?\n\nEdit: I couldn’t decide between “not wanting to share my laptop with” and “not wanting them to use my laptop” and messed up the title, my bad.",
  "id": 1,
  "comments": [
    {
      "score": 4509,
      "content": "NTA.  They need to get their own laptop.  I access my banking and credit card accounts through my laptop.  No is no.",
      "id": 2,
      "comments": [
        {
          "score": 1454,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 661,
              "content": "A TV do-hickey is like $40 and there’s four of them!! Personally I have a TV kajigger but those are a bit more expensive.",
              "id": 4,
              "comments": [
                {
                  "score": 265,
                  "content": "I prefer the thingamajig. All class.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 152,
                      "content": "Whatchamacallit?",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 146,
                  "content": "Standard Amazon Fire Stick is on sale for $20 at this very moment with a promo code that is listed above the item on the website.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 76,
                      "content": "Right like I'm very broke but even I have a Firestick (I had a $10 gift card and then bought it for the sale price)\n\nLike, I'm cry and count pennies for a 1/2 gallon of milk poor, so even if they're skint af they're being overly put out by this in order to manipulate probably because they *do* want to snoop. \n\nThey could *save coins* and buy this in a matter of a week or two max.\n\nAgain, I'm skint as shit and most of the time I could conceivably come up with 1/4th the cost of a Fire Stick given a week or two. Especially on sale. \n\nCollect cans or have a garage sale, maybe even check second hand shops, Craigslist, w/e in case someone is giving one away even cheaper, offer to pay a roommate back if they cover you... goodness.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 86,
                  "content": "Not to mention a 24” smart TV is $70 at Best Buy right now…. Less than $15/person after tax if all 6 chip in….  They need to get the heck over it.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I mean, if I’m the person whose laptop they have been using, I might just spring for the jiggamathing myself just to keep the peace, but absolutely NTA.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I'd just create a profile that doesn't have access to anything sensitive if I were OP\n\nThat said I'd also never whine about a person not wanting their laptop in use when they aren't around to supervise. This was even more true back when my friends and I were all broke. Things go wrong after all and if I can't buy a thingamummy, then I certainly couldn't replace a laptop.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I understand your point however they being unnecessarily difficult. Depending on what they choose they could get a fire stick, chromecast ect for $5-$15 per person (all 6 chip in together) possibly even less than $5 a person if it's on sale or off marketplace. I would not keep the peace if it came to my privacy when the solution is so cheap and simple",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 67,
              "content": "[removed]",
              "id": 13,
              "comments": [
                {
                  "score": -7,
                  "content": "[removed]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Please elaborate because I don't understand what you're trying to say here",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "Meaning that if they want to watch TV, they need to go through the steps to achieve that goal.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Find some rabbit ears and they can watch local channels only.",
              "id": 17,
              "comments": [
                {
                  "score": 16,
                  "content": "Back in the day, we used a bent wire coat hanger. AND WE WERE HAPPY TO HAVE IT!\n\nSeriously- there are SIX roomies, and only ONE has a laptop.\n\nAnd they cannot figure out ANY OTHER WAY to make TV happen?\n\nNTA   And password protect your damn laptop.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 3,
                      "content": "When I was young we had 2 channels! And were damn well happy! Now get off my lawn you hipsters!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 212,
          "content": "Totally agreed NTA.\n\nIt’s OP’s personal computer.\n\nAnd people can learn to do something other than watch TV.\n\nThat being said, if OP is so inclined, most laptops allow the owner to set up a guest profile with very limited access to the computer.",
          "id": 20,
          "comments": [
            {
              "score": 26,
              "content": "I set up a guest account on my dad's laptop so my brother can't mess with his stuff when he visits. One of the things my brother loves doing is installing terrible and unnecessary updates. I paid extra for windows 10 for dad as he is familiar with it, bro updated it to windows 11 (dad had to spend weeks learning it.)\n\n_through a guest account_.",
              "id": 21,
              "comments": [
                {
                  "score": 3,
                  "content": "I feel you. My dad got his first smartphone 2 years ago (my old one), and I am still getting calls about how to do something on it. He still hasn't worked out how to take screenshots 🤦‍♀️. Someday I wish I wasn't an only child but then one of dads mates kids get a hold of dads devices and fiddles with it and I have to try and work out what they did to it over the phone with no visual and I become glad I don't have siblings cause I know they would pull the same stuff as your brother.\n\nCouldn't you have just uninstalled Windows 11 and reinstalled 10 for your dad (save everything to a hard drive first if needed), that's what my hubby did for my dad.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I was actually planning to roll back the update, but it turned out my brother had done it in secret about 3 weeks before I knew about it, and dad doesn't use his laptop often. So he only learned about it then as he needed to use it to deal with some bills and he didn't tell me right away either.  \n\n\nI'd go there and reinstall windows with a usb stick, but I'd have to travel by public transport for about 3 hours total-ish, and 2 hours by plane lmao. Or 12-ish hours my train.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "That’s my first thought; just make an f-ing guest account.",
              "id": 24,
              "comments": [
                {
                  "score": 23,
                  "content": "Why though? So the entitled roommates can continue to use someone else's property instead of getting something inexpensive that works for everyone? OP isn't under any obligation to let anyone use their stuff. The roommates had every right to ask, cuz you don't know if you don't ask....but OP also has every right to say no.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Oh, absolutely he has every right to say no, full stop. It’s just shady to demand the “owner” password when there are obvious options.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "Or just buy a Roku box. They’re about £30, between 6 people, it’s £5 each.",
          "id": 27,
          "comments": [
            {
              "score": 19,
              "content": "Amazon firestick or chromecast with google tv.\n\nSplit between 6 either one is cheap enough.",
              "id": 28,
              "comments": [
                {
                  "score": 20,
                  "content": "and everyone could control from their phones without the hassle of walking to the laptop to change things. Seems such a no brainer solution that id be more suspicious of their motives",
                  "id": 29,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Agree, I wouldnt trust them not to snoop, or what if they accidentally read something confidential and react poorly to it?\n\nASgree with the firesticks, ALL of my PC's and TVs are meshed using many a HDMI matrix and even i still have firesticks on half of them",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Aye, in the UK we also have thungs called dodgy boxes- all the paid for programmes/services on one device lol!",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Too, if it gets damaged, they prob would not take responsibility for it. Like you stated, OP needs to tell her roommates no means no. its so horrible how people are so entitled these days.",
          "id": 32,
          "comments": [
            {
              "score": 10,
              "content": "People will get away with as much as you allow them to. Then they think of you as a sucker.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "A google Chromcast is $30 on Amazon. They all can pitch in 6 bucks (including OP) and problem solved",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "NTA. They don’t even need laptops. Firesticks are $50 USD on amazon, and they’ll turn any tv into a smart tv. Way cheaper than a laptop.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "While all the apps I use to access banking etc have significantly more between the user and the app showing more than it knows, like, my name, than the password that lets one in the computer… still. They might need a combination of my fingerprint, a second password not stored anywhere it would be looked for, and security questions whose answers are a combination of memorable lies and the pet who, having gotten the most “my hooman is a 14 year old who will someday get a History degree and also should have an Autism diagnosis*” name ever and only 1 other living person remembers sweet Security Answer’s name (…also arguably not my first pet. Also vascular dementia, which wiped it from Mom’s database, sucks) \n\nAnyway, while I think anyone would struggle to get to my finances with the “turn on the device” password, not the only reason to keep people off your device when unsupervised so NTA\n\n*technically if they’d looked through the middle schools for people who qualified for the new diagnosis added to the books I would have been diagnosed with Aspergers, which is the type of detail the Autist knows is not actually needed nor wanted but hurts my brain not to put in",
          "id": 36,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1387,
      "content": "NTA. How is it possible that only one of six young adults in an apartment has a laptop? I don't know where you are but I just looked on Best Buy and they've got a 24-inch smart TV for $70. Surely the people who want a smart TV can come up with that money and leave your private laptop alone.",
      "id": 37,
      "comments": [
        {
          "score": 708,
          "content": "We don’t live in this area, we came here for 3 months because it’s a beach town and the businesses hire extra help like crazy around this time and the vacation goers tip really well. I’m the only one that brought a laptop, the others only brought their phones.\n\nI suggested ordering a chromecast and they’re still mad that they would have to get something else that isn’t the laptop I already brought.",
          "id": 38,
          "comments": [
            {
              "score": 875,
              "content": "A Roku is thirty bucks. You are NTA.",
              "id": 39,
              "comments": [
                {
                  "score": 164,
                  "content": "First thing to my mind too. They cost buttons and work way better than any laptop.",
                  "id": 40,
                  "comments": [
                    {
                      "score": -50,
                      "content": "Ehhh... kids who move to a shared home for seasonal work don't always have $30 to spend on a toy.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 111,
                  "content": "If they want to watch TV so bad they can get a Roku stick for like $50, boom instant smart TV. You shouldn't have to justify not wanting them to use your computer without your permission.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 89,
                      "content": "Exactly.  I'm 70 and I managed to figure this out when our Smart TV was too old, so I'm baffled why this group hasn't thought of this.  They can even take it with them.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "Exactly. In fact our “Smart” TV got so old, none of the apps would update anymore.  Got a Roku and never looked back.  OP NTA.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah, my TV is smart but old, so not that smart anymore. We watch stuff with the Chromecast now. It's pretty cheap even here, The Land of Expensive Everything.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "the Walmart Onn brand has one for $20 that is android tv based",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 76,
              "content": "You could always create a secondary user account on the machine with its own password and everything that has 0 privileges so they can use that one for youtube and whatnot. Your account and data and applications stay safe and they can use it to watch whatever they wanna watch.\n\nHowever, you are obviously NTA for not wanting everyone to leech off of you and potentially try to lay claim to it when you want or need to use it. I honestly wouldn't be too eager to volunteer my stuff in that manner anyway.\n\nLike others have said: the (cheap) options are pretty endless.",
              "id": 47,
              "comments": [
                {
                  "score": 43,
                  "content": "This was my thought too, but viruses, spills, drops, and general age of the laptop will all still be affected by a separate account. They need to buy a Chromecast or Roku.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Or if they can't afford the Roku/Chromecast they could get library cards and check out various forms of entertainment that aren't laptop-dependent. Or they can watch things on their own cell phones which I assume they have with them.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "This is what I was gonna say. Make a guest account with nothing personal on it. But if OP chooses not to do that, that’s perfectly fine too. No one owes anyone anything.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, and all is good til someone spills a ginger ale on the laptop. Fuck that.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "No way! If they are too cheap to get a used Roku or other equivalent device, they definitely won’t pay to fix the laptop if they knock it off the table. Having it constantly hooked up to the TV is a recipe for disaster.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "They can either use your laptop when you're home and ok with it for free, or they can pay money to have a different device.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Assuming windows, even with a secondary, limited account they're going to have to muck around with permissions to keep their personal files protected.  Just buy a Roku, fire stick, or Chromecast and call it a day.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Ah, I’m from an area like that and please don’t share your password with your house. I promise it won’t end well.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "If your roomies don't even have 30-40 bucks for a streaming kit, you're in so much trouble for the entirety of your lease.",
              "id": 56,
              "comments": [
                {
                  "score": 10,
                  "content": "Or she’ll be in trouble when the laptop is dropped",
                  "id": 57,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Dropped, stepped on, viruses, all kinds of things.\n\nAlso what if OP wants to go out after work and bring their laptop with them? Are they not entitled to the use of their own personal property?\n\nLaptops aint cheap these days, either. I already wouldn't trust them, but I especially wouldn't trust my $500 laptop alone around someone that's been eyeing it and implying that it's theirs, too.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "[removed]",
              "id": 59,
              "comments": [
                {
                  "score": 5,
                  "content": "I wouldn't leave a laptop on the car during the summer",
                  "id": 60,
                  "comments": [
                    {
                      "score": 3,
                      "content": "[removed]",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "If six people can't muster $35 for a roku then they need to find some other form of entertainment lol",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "They are here for 3 months and didn’t bring a computer? Kind of stupid.",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "If it’s such a short trip that they only needed a phone then they can watch movies on their phone. Or they can buy one of the myriad of devices that can make the TV smart. They aren’t expensive and frankly if they are particularly cheap, I bet they can find an old one for 10 pounds. I see them offered frequently on Freecycle so you could look there too. And if it’s not worth a pint or two to them, then they must not want to watch TV that much..",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": ">I’m the only one that brought a laptop, the others only brought their phones.  \n\nSo, only one of you has any common sense.\n\n>I suggested ordering a chromecast and they’re still mad that they would have to get something else that isn’t the laptop I already brought.\n\nI hope after this summer is over you are ready to write these dumb children off. They really aren't the type of people you want as friends; too dumb to think ahead, too cheap to take a simple solution.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You need to make sure you can lock your laptop somewhere. I can see a scenario where they figure out the password. I can also see a senecio where they break the HTMI port or laptop somehow and refuse to pay for repair",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "[removed]",
          "id": 67,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Ah, youth. I won't even share my laptop with my SO. Tell them to get their own and when not using yours keep it stored in your room. \n\nAn Amazon Fire stick is $20.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "A Roku is $30 on amazon. I have 2 and they work great!\n\nOP, NTA. They can be adults and get a device that will stream. If everyone in the house contributed $6, you guys could get a roku for the main tv. Simple solution.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 506,
      "content": "NTA\n\nThat’s a weird demand from people who don’t own the laptop. Even if there wasn’t personal information you’re worried about, it doesn’t belong to them. \n\nIf you *wanted* you could make a guest login on your computer for them to use, but I personally don’t lend out my electronics because of the risk of damage. While they may not drop it they could misuse the battery (charging incorrectly), the oils on fingers degrade the paint on keys, general dust, food crumbs, how hard they’re hitting keys can make them stick. Just no. \n\nRoku is cheap and lets you cast from your phone so they can easily do that between 4-5 of them. It’s absurd they’re so upset about this.\n\nAlso, if they have streaming on their phones",
      "id": 70,
      "comments": [
        {
          "score": 143,
          "content": "Though a guest acct does take away the security issue, are they willing to assume responsibility if something happens to the laptop? If they’re so upset about getting a $30 Roku dongle, imagine how much more hassle it will be if the laptop is damaged. Besides, what happens when everyone wants to watch TV but OP needs to use the laptop?",
          "id": 71,
          "comments": [
            {
              "score": 54,
              "content": "Yeah of these people aren’t mature enough to figure this out so wouldn’t let them touch my laptop.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I was going to mention a guest account but I wouldn't want them constantly using my laptop. Will they get mad if she needs it for a few days? Cut this off now. They're being entitled and cheap. NTA",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 270,
      "content": "NTA I can not believe it is 2023, there are six of you in the house and only one of you has a laptop??",
      "id": 74,
      "comments": [
        {
          "score": 103,
          "content": "We don’t live here, we came for 3 months for the summer jobs but I was the only one that brought a laptop. We will leave in late august or early september depending on when the vacation goer tips plummet.",
          "id": 75,
          "comments": [
            {
              "score": 259,
              "content": "That makes it even worse that they feel entitled to your laptop, if they made the conscious decision to leave their laptops behind for *three months*.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 221,
              "content": ">We don’t live here, we came for 3 months for the summer jobs\n\nI don't understand how that translates to \"don't bring my laptop\". Generally, 3 months away, my first thought would be to grab my laptop.",
              "id": 77,
              "comments": [
                {
                  "score": 84,
                  "content": "For real, I wouldn't even leave my laptop behind for a week trip.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I don’t even leave it behind for an overnight stay at a friend/partner’s place",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Unless I know it's going to rain most of the day I bring my ipad on a day trip.\nGoing somewhere for three months; phone, ipad, cables, extension lead, and double adapter are the first things I'd be sure I had packed.",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I don't leave it behind for a weekend trip lmao.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "At least a tablet!",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 49,
              "content": "Then they don´t have the right to use your laptop because they chose not to bring their own. Everyone in the house can each put in $5 and get a chromecast for the summer.",
              "id": 83,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "It’s three months, they could’ve thought to bring a computer or iPad. Hell, they can connect their phones to the tv with an hdmi cable (they make them for phones).",
              "id": 84,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Pitch in together and get a google chrome cast or something similar",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "[removed]",
          "id": 86,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 137,
      "content": "NTA\n\nunder $20 and they can get an adapter from their phone to HDMI.  They are huge AH.\n\nIt a personal computer so you shouldn't feel bad having personal stuff on it.  Lazy and entitled roommates!! Thank goodness it only for the summer, but be more attuned to future roommates.",
      "id": 87,
      "comments": [
        {
          "score": 31,
          "content": "Not just personal \"I don't want people to see\" stuff but also \"I don't want people to accidentally delete\" stuff, as well. That would be my concern. \"Oops, we hit the wrong button and screwed everything up\"...",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "You can get a Roku for 20 bucks, this is such a stupid problem",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 83,
      "content": "NTA, but if it has an HDMI port you can make any tv into a smart TV for the price of a Firestick/Roku whatever suits you.",
      "id": 90,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 79,
      "content": "Cut off their access to your laptop. Completely. They are getting way too comfortable using *your* computer for their entertainment. \n\nThey can watch their little movies on their phone. NTA",
      "id": 91,
      "comments": [
        {
          "score": -47,
          "content": "[removed]",
          "id": 92,
          "comments": [
            {
              "score": 34,
              "content": "You are deeply entitled to other peoples property.",
              "id": 93,
              "comments": [
                {
                  "score": -45,
                  "content": "[removed]",
                  "id": 94,
                  "comments": [
                    {
                      "score": 19,
                      "content": "\\#triggered! LMAO. Apparently, the sarcasm went over your head.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Counter point: the laptop belongs to op and no one else, and everyone else's entertainment isn't op's problem. If they don't want to lose access to their own laptop for pretty much all day, every day, that's their choice. Entitlement and whiny demanding isn't going to change that.\n\nget a job and buy your own devices and stop leeching off your friends",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 44,
      "content": "I wouldn't let anyone else into my devices either. NTA. They should grow up, stop complaining, and cast from their own device like you said.",
      "id": 97,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 42,
      "content": "NTA. They can get a Chromecast to watch things, or watch them on their phone. Chromecasts are only $30ish anyway. You do not have to share your laptop, let them be mad.",
      "id": 98,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "Not giving other people access to your personal devices is just common sense, NTA",
      "id": 99,
      "comments": [],
      "relation": "Support"
    }
  ]
}