{
  "post content": "I 15m work as a staff member at a park where kids from other close by towns come visit. My job is to basically make sure the kids are having fun and to interact with the kids that come. This is my first ever job where I am getting paid, so I was very careful to make sure I am doing the best I can for everyone's benefit.\n\nA boy named Oliver 10m is a kid that I've seen at the park several times during the summer. I believe he has a tick that makes him have a problem with spiting but overall, he is a great kid and gets along well with others and there has been no problems with him so far.\n\nThe bully, Shane 11m is a kid with a brother who is older and not relevant to the story. I have seen Shane and his brother in the park several times thought the summer as well and there had been minor incidents with them. But I will not explain for it would take too long.\n\nOliver then comes up to me at the front gate and he tells me that Shane called him a garden hose for his spiting problem. Me and Oliver tell Shane not to do that and Shane smiles mischievously and does it again. I tell him that is not funny, and he proceeds laugh mischievously and chuckles like Santa to himself. Whilst we were at the front gate the ice cream truck came through and I got Oliver Ice cream to cheer him up.\n\nHere is where I might be the a-hole. Shane's Mother comes to pick him and his brother up every day around 5pm. so when she came, I pulled her to the side and had Oliver tell her the things Shane said to him. The mother was very understanding and told me and Oliver that they would have a serous conversation about it. When we walked in Shane immediately burst into tears and was almost inconsolable with his crying. When that happened, it startled me inside and I started to question whether I did the right thing or not. The mother wanted to see my supervisor to get to the bottom of the story, so I brought the mother to him and her, Oliver, Shane, and my supervisor had a conversation about the problem whilst I sat on a bench off to the side.\n\nWhilst I was sitting my friend Kyon 15m, talked to me and I told him the story. Me and him went over to become part of the conversation and I told him my side of the story. After a bit of dialogue, the mother was very understanding and mirrored that that was unacceptable behavior and left. After all was done with, I left the park with Kyon and Oliver.\n\nMy parents said that I did a good job but that maybe it would have been best to come with my supervisor to talk to the mother while Kyon says I did everything right. I'm just worried that I caused a huge problem for the family, so I just need to know.\n\nAITA?\n\nEdit: I will update if there is any developments :)",
  "id": 1,
  "comments": [
    {
      "score": 13,
      "content": "NAH you let the mother know what was happening today at the park. That is information and not asshole behavior. As a parent, I want to know when my kid bites another kid so we can deal with it at home. It sounds like the mother knew to get a supervisor involved, but honestly, I think your feedback was honest and probably helpful.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA\n\nYou handled this exactly like you should have.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA, As a parent I would want to know when my child was exhibiting bully behavior so that I could put a stop to it.  It's a lot easier to stop bully's early, the longer they continue without correction, the more it becomes a part of their personality, making it that much harder to correct.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA. If my kid is bullying somebody, PLEASE tell me! There will be serious consequences, but I won’t be able to do that if I don’t know what’s going on. I don’t want my kid to be a bully, any more than any parent wants their child to be the victim of bullying.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told the mother that I didn’t know at all that her son was a bully. This women didn’t know me and I don’t want to cause unnecessary drama and stress with Shane’s family. This is my first time ever doing something like this and I want to know if I’m in the wrong\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 15m work as a staff member at a park where kids from other close by towns come visit. My job is to basically make sure the kids are having fun and to interact with the kids that come. This is my first ever job where I am getting paid, so I was very careful to make sure I am doing the best I can for everyone's benefit.\n\nA boy named Oliver 10m is a kid that I've seen at the park several times during the summer. I believe he has a tick that makes him have a problem with spiting but overall, he is a great kid and gets along well with others and there has been no problems with him so far.\n\nThe bully, Shane 11m is a kid with a brother who is older and not relevant to the story. I have seen Shane and his brother in the park several times thought the summer as well and there had been minor incidents with them. But I will not explain for it would take too long. \n\nOliver then comes up to me at the front gate and he tells me that Shane called him a garden hose for his spiting problem. Me and Oliver tell Shane not to do that and Shane smiles mischievously and does it again. I tell him that is not funny, and he proceeds laugh mischievously and chuckles like Santa to himself. Whilst we were at the front gate the ice cream truck came through and I got Oliver Ice cream to cheer him up.\n\nHere is where I might be the a-hole. Shane's Mother comes to pick him and his brother up every day around 5pm. so when she came, I pulled her to the side and had Oliver tell her the things Shane said to him. The mother was very understanding and told me and Oliver that they would have a serous conversation about it. When we walked in Shane immediately burst into tears and was almost inconsolable with his crying. When that happened, it startled me inside and I started to question whether I did the right thing or not. The mother wanted to see my supervisor to get to the bottom of the story, so I brought the mother to him and her, Oliver, Shane, and my supervisor had a conversation about the problem whilst I sat on a bench off to the side. \n\nWhilst I was sitting my friend Kyon 15m, talked to me and I told him the story. Me and him went over to become part of the conversation and I told him my side of the story. After a bit of dialogue, the mother was very understanding and mirrored that that was unacceptable behavior and left. After all was done with, I left the park with Kyon and Oliver.\n\n My parents said that I did a good job but that maybe it would have been best to come with my supervisor to talk to the mother while Kyon says I did everything right. I'm just worried that I caused a huge problem for the family, so I just need to know.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA, you handled this really well for a 15 year old but I think it would probably be better to discuss something like this with the supervisor first.   \nBTW, Shane burst out crying because he knew his behavior wasn't going to be overlooked.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    }
  ]
}