{
  "post content": "I will try to be quick. My fiancé and I have been staying with my sister temporarily while our addition is being built. It's a fairly large addition so it's taking some time but shouldn't be any longer than a few more weeks. We have been crashing on my sister's large sectional in the living room. We pay for the food in the house (that's all my sister wanted from us). Hotels or Airbnb's aren't an option (due to the season- you're looking at $200+ a night). \n\nWell, we just found out 2 weeks ago that my wife is pregnant. She's 18 weeks (she had no symptoms and was still menstruating). It's a lot to process, considering we were told she couldn't have kids. My wife isn't taking it too well (fear mostly), especially because we are sleeping on the couch and there's zero privacy. I mean, these guys wake up at 6am and bring their dogs downstairs and they jump all over us and then we essentially get kicked out of the living room so my wife isn't sleeping very well, if at all. \n\nWell, yesterday my wife had an absolute meltdown because she is \"fucking tired\" of the dogs. All of them. One of the dogs even so much as goes near her and she is pissed because the dogs here have no boundaries and she's tired of being touched/followed. So I was like \"well why don't you take off for the day and go get a hotel for the night so you can sleep\". She does what I suggest. About an hour later I get a call from my sister saying \"I never fucking agreed to watch your dog so you need to come get her\". I guess I just assumed my wife would have taken the dog with her until I got out of work and then we would switch off or something and I would take the dog when I was out of work. So I call and say \"hey my sister wants you to go get the dog and I will just grab her after I'm out of work\". She immediately got pissed. \"So much for me getting a fucking break from the animals, huh? Pretty useless suggestion if you expected me to take your dog with me. I'm going to my mom's for the foreseeable future.\" She hangs up and won't answer my calls. AITA?\n\nETA: to clear up confusion, my sister has 3 dogs and then my wife and I have 1 dog. Our dog is a bit of a follower so her behaviors have sucked since being at my sister's.",
  "id": 1,
  "comments": [
    {
      "score": 894,
      "content": "ESH. You and your wife are staying somewhere totally for free. If she wanted to have privacy and to not deal with your sister’s animals she probably shouldn’t have agreed to this arrangement. But, she is pregnant and pregnancy hormones suck. And your sister had a really strong reaction for it just being a few hrs and you’d been living there all this time. I bet it’s wearing on her too.\n\nAnd you need to step up. You should not have assumed. This dog is your responsibility too and it shouldn’t be unlearning all of it’s good habits. And you need to be a more gracious guest and husband. It was one day and you TOLD her she could get away.",
      "id": 2,
      "comments": [
        {
          "score": 200,
          "content": "How is the OP an A H for expecting his wife to be responsible for the dog while he’s *working*? Wife should NOT have left their dog at his sisters house for someone else to take care of. I get that she’s tired and wants a break, but his sisters dog sitting service is simply not a gift he can give to her. Wife was really rude and entitled there.",
          "id": 3,
          "comments": [
            {
              "score": 546,
              "content": "If someone says, “I want a break from the dogs” and you tell them “ok go to a hotel and take a break”. \n\nWhy on earth would you assume they will take what is bothering them with them?",
              "id": 4,
              "comments": [
                {
                  "score": 103,
                  "content": "The majority of the dogs are the sisters. She would only have to take 1 dog. \n\nWhy on earth would you assume that someone who has let you live in their house for an extended time is your free dog sitter?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 95,
                      "content": "It’s not a one or the other situation, it was unreasonable on both ends. \n\nIt was unreasonable of him to assume that his wife who specifically said she wanted to get away from the dogs would take them with her AND it was unreasonable to assume that the sister would just take care of their dog while they were both away",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "It’s not like they haven’t been stepping out for work, groceries, etc unless the WHOLE time they’ve been there one of them has been watching the dog the whole time. If I was staying with my family they would watch my dog no questions asked for errands, and I would do the same for theirs, and extra for babysitting of date nights or outings, to thank them for letting us stay. \n\nBut this family doesn’t seem to be very good at communicating so.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "I probably would have assumed if my husband told me to go to a hotel to relax that he’d already asked his sister to dog sit and she had agreed \n\nPersonally I’d check first",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "She didn't, the husband told her to go to a hotel and take a break from the dogs. even in his own description of the events she said the dogs (not the sisters dogs alone) were pissing her off and the husband told her to take a break from the dogs. \n\nI'd assume, almost certainly like his wife did, that the husband would tell the sister and ask her to look after the dog for a day and then agree to take her dogs out for a walk or something later.\n\nhe like half did a nice thing for the wife, then didn't follow through on what he actually told the wife to do.. which is take a break from the dogs.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "……OP was going to be home soon enough though",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 49,
                  "content": "Because someone has to take care of YOUR dog? You can't just whine that the place you're staying for free isn't comfy enough and then ditch your animal with them when you decide you need a break from your own responsibilities as a pet owner? \n\nGosh, if I were OP's sister I'd let them know they've completely worn out their welcome. She's doing THEM a favor, it's not her job to puppysit for a grumpy, ungrateful, freeloader.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 18,
                      "content": "To be clear I do think they are the asshole. OP should have asked his sister first before telling his wife that she could take off and if his sister said no then he should have made alternate arrangements but it was also an unreasonable assumption to assume his wife would take a dog her with her to relax when she is specifically trying to get away from the dogs.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I initially assumed all the dogs belonged to the sister. \nOP should have made other arrangements for his dog",
                  "id": 13,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I find it telling that HE refers to dog as THEIR dog and fiancée refers to dog as HIS(/your) dog.\n\nWhy do I get the feeling that she gets to take care for this dog but she had no say in ownership of(as in dog probably predates the \"joint\" decisions stage)?",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Also, why would you assume she *could* take a dog to a hotel? Many don’t allow pets.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Dont worry too much. Its seems he is the dog-wife troll.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Oooh I like this response, this hits all the right points.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 306,
      "content": "YTA. That you had to clear up that its your dog we are talking about really exemplifies that you are not taking enough ownership of this situation.\n\nYou are the primary nexus of all these actions. You have to take a more commanding role.",
      "id": 18,
      "comments": [
        {
          "score": 5,
          "content": "[removed]",
          "id": 19,
          "comments": [
            {
              "score": 2,
              "content": "While he was at work??? Really",
              "id": 20,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 269,
      "content": "YTA, The issue was that she was tired and couldn’t stand being around the dogs so why on earth would you assume that she would take the dogs with her?",
      "id": 21,
      "comments": [
        {
          "score": 77,
          "content": "because it’s her dog and neither of them bothered to ask the sister to take the dog (assuming the wife was home with said dog before going to the hotel)",
          "id": 22,
          "comments": [
            {
              "score": 62,
              "content": "She specifically said that she couldn’t stand the dogs and the dogs were bothering her, why would you assume she would take what is bothering her with her to relax?\n\nThis would be like if someone was being bothered by a younger sibling so you told them to go take a break in their room then assumed they would take the sibling with them\n\nClearly they should have asked the sister first before just leaving her with their dog, but it was unreasonable to assume she would be bringing the dog with her when she is trying to get away from them.",
              "id": 23,
              "comments": [
                {
                  "score": 35,
                  "content": "No, it's like someone being bothered by looking after their own kid, so they just leave it at their sister in law's house without even asking if they're OK babysitting.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Look, if my wife was stressed and wanted to take a one-day break from childcare or whatever else, I as the husband would make the necessary arrangements to make sure she got the break. The way OP tells it, it just sounds like a half-assed effort to give her the needed break.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Except you can child to a hotel and wait till the husband gets off work and comes and takes the baby, but you can't take 3 dogs to the hotel with you, so looking after the dogs at home nullifies the hotel offer",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "Lmfao comparing watching a kid to a dog….ok bud",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "no it wouldn’t be like that because the dog is their property (as a common law marriage). It would be more like just leaving your kid with a family member without asking, because they also have kids. I don’t get why it’s unreasonable to assume that, given that it is their animal and clearly the sister doesn’t want to watch it",
                  "id": 28,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Because she said the dog was bothering her, it wouldn’t be getting away from the dogs if she took the dog with her.\n\nI agree it was unreasonable to just leave the dog with the sister without asking or saying anything, but it was just as unreasonable to assume that the person who is trying to get a break from the dogs would take the dog with them. \n\nThis isn’t a one or the other situation, it was unreasonable on both ends",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Well OP was at work. You know the place that pays the bills. It's their dog their responsibility. Wait until the child gets on her last nerve. Home to mama? Some times you have to deal with your own pet",
                  "id": 30,
                  "comments": [
                    {
                      "score": 7,
                      "content": "If the wife is calling him saying “Your dog” then I don’t think it’s really a shared responsibility between them. It’s his dog",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Are you saying she was supposed to take the dog to the hotel,  or wait at home and only go to the hotel for few hours of sleep before check out ?",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Why on earth would she assume that it was OPs sisters job to look after HER dog?",
          "id": 33,
          "comments": [
            {
              "score": 3,
              "content": "Well they are assuming op can take care of the dog from work",
              "id": 34,
              "comments": [
                {
                  "score": 2,
                  "content": "Or Ops's wife can take the dogs to the hotel with her till he gets off work.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I highly, highly doubt that he even thought about where their dog was. Probably just assumed it was fine to leave at the house, if anything, and when he was called out by his sister he figured he could put the blame on the wife.",
          "id": 36,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Uhm probably because it’s her dog and her responsibility. Why would she expect the sister to watch the dog?",
          "id": 37,
          "comments": [
            {
              "score": 17,
              "content": "She probably made the more logical assumption that OP had already spoken to his sister about it.\n\nShe also refers to it as “your dog” it’s not her dog. It’s his dog that he cares for",
              "id": 38,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 104,
      "content": "[deleted]",
      "id": 39,
      "comments": [
        {
          "score": 46,
          "content": "Really? Sister has had guests taking over her living room for quite a while and now she’s expected to provide dog sitting services as well? And without even being asked?\n\nWife is going to be in for a hell of a surprise when she finds out babies keep you awake and don’t just go away when you need a break. Will she just be expecting family members to watch her baby and drop it off unexpectedly when she wants a break or will she learn that she’s not entitled to anyone’s help and actually ask for it?",
          "id": 40,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Hear me out… maybe the sister is sick and tired of all 3 of them. Maybe the dog is poorly behaved and wants a break from it. Maybe, she was gracious enough to take them in, the least they can do is mind their own dog. And maybe… she would have said yes if she was asked to, not stuck with it.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 83,
      "content": "INFO. This makes no sense. Are these dogs yours or your sisters? The second paragraph says they’re your sisters dogs and they attack your wife. But then your sister wouldn’t be calling you to say take care of your dogs.",
      "id": 42,
      "comments": [
        {
          "score": 11,
          "content": "One dog is OPs. No where is it stated the dogs attacked. Jesus Mary and Joseph! One dog is theirs, so it's their responsibility",
          "id": 43,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -32,
          "content": "We have one dog. My sister has 3 dogs.",
          "id": 44,
          "comments": [
            {
              "score": 36,
              "content": "Okay, then did both of you leave your dog at your sister’s (if so, YTA)? I’d just go stay with another friend or relative.",
              "id": 45,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 69,
      "content": "YTA for creating this situation. Yes managing remodeling projects are hard. It's easy and normal to be stressed about that. You underwent this project without a plan for somewhere for you two adults and your dog to safely stay where all of your needs are met. And now you're seeing the cost of that decision. \n\nYou could take out all the details about pregnancy and dogs and you'd still be sleeping on the couch at another person's house - that gets old for everyone. The conflict would be the same. I'd show some understanding to your sister who opened her house. I'd give yourself some grace for being in a stressful situation. Show everyone and yourself some empathy for where they're coming from and work it out from there. If your sister does not want to watch your dog without you there, then listen to that. If you didn't discuss it before you agreed to stay there, consider the consequences of not communicating and figure it out now.\n\nI've had to leave my house unexpectedly when a company was doing some work at my house and didn't communicate how the work would impact our home life over a couple weeks. Packing my family and dogs and finding places in short notice was not fun but we are adults who live with the impacts of our decisions and figure it out. Congratulations on the pregnancy, you can get through this.",
      "id": 46,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 61,
      "content": "YTA - I thought the point was for your wife to get some rest? Lol. Why would she take the very thing that is stopping her from getting rest with her? You dropped the ball on this one. You should’ve planned to keep the dog with you so she can have the moment for herself. Make nice with your pregnant wife and apologize and just explain your confusion and hopefully you guys can brush this under the rug.",
      "id": 47,
      "comments": [
        {
          "score": 5,
          "content": "Because there is a mountain of difference between your own dog that you own and are responsible for and three more dogs that aren’t yours and aren’t well trained. \n\nThe hotel was so OP wife could rest. Assuming it is a dog friendly hotel the OP wife could still rest even with her *own* dog still there as one dog is extremely different than four total. \n\nIf OP is an asshole here, there is no fair logical world we’re OP wife isn’t just as much if not more of one. OP was at work. He literally wasn’t available to take the dog at that time. The wife could have but she shut it all out. Yes, she’s pregnant but she obviously isn’t the only one stressed out here and from the looks of it especially with how annoyed OP’s sister is I am better the wife isn’t really doing much to help the overall situation.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yes why couldn't OP tell his boss I'm bringing the dog to work! So simple",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 51,
      "content": "YTA. You said ‘why don’t you take off for the day and go get a hotel for the night’. That statement, to me, means ‘let me take care of things so you can get a break from the dogs’. So she rightly assumed that you would run it by your sister that the dog would be in the house alone, or make alternate arrangements. You offered her a break she desperately needed but didn’t actually think through the logistics of making it happen. Like, how would ‘taking off for the day’ help a damn thing if she had to take the dog with her?\n\nGoing to her Mom’s for the foreseeable future seems like a good solution. She needs a bed and some peace for the sake of her physical and mental health. This situation is not tenable, and you need to do more to make it so.",
      "id": 50,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "YTA,  Don't stay with your sister.  A temporary place to stay is part of the cost of an addition. And take care of your own dog",
      "id": 51,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 31,
      "content": "INFO\n\nI'm a little confused here. In the second paragraph you describe the dogs as belonging to your sister, then in the third paragraph you make it out to be the dogs belong to you? Which is it OP, because this is a huge factor here in determining who's in the wrong.",
      "id": 52,
      "comments": [
        {
          "score": -21,
          "content": "My sister has 3 dogs, we have 1. Sorry for the confusion.",
          "id": 53,
          "comments": [
            {
              "score": 75,
              "content": "So let me get this straight. Your pregnant wife is having trouble sleeping because the dogs jump up and wake her. She wants to get away for a night to get some rest so she gets a hotel room. Your sister calls you to take care of YOUR dog, and you expect your wife to take it with her, EVEN THOUGH HER ISSUE SLEEPING WAS BECAUSE OF THE DOG.\n\nYTA OP. I don't know if you're just tone deaf or what, but you're the AH. Take care of your dog, and let your PREGNANT wife get some sleep.",
              "id": 54,
              "comments": [
                {
                  "score": 3,
                  "content": "It’s not his dog, it is both his and the wife’s dog. There is also a mountain of difference between four dogs total with three being relatively untrained and your one dog who is overall trained. \n\nNot to mention that OP is at work and literally can’t take care of the dog at the time. OP tried to do something to help alleviate some of the stress with his wife who doesn’t seem to be trying to help the situation at all and he’s apparently now an asshole because he isn’t super man and is bound by the laws or reality. \n\nThere is no situation where OP is an asshole and yet the wife isn’t. Yes she’s pregnant, but from the sounds of it doesn’t seem to be suffering a lot of symptoms and she can still help alleviate some\nof the issues going on.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I think you’re missing the point where OP assumed wife would take the dog with her to the hotel despite the dogs being the problem.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}