{
  "post content": "My fiance (31m) and I (28f) have two girls aged 4&2. Last year I had a stillborn baby daughter. I said I never wanted to be pregnant again. It hit me really hard and I've never known pain like it. \n\nApparently, your super fertile after a loss and I ended up falling pregnant immediately after our loss and I'm currently 8 month pregnant with a boy. Something my fiance really wanted.\n\nI hate being pregnant. Never enjoyed it. I hate even more how long I've been pregnant due to the back to back pregnancies. I'm miserable and I never want to be pregnant again.\n\nIn the unlikely event the baby I'm carrying now does also die I never want to be pregnant again. If the baby lives I never want to be pregnant again. I honestly can't explain how much I hate being pregnant. I love babies, children etc. Not pregnancy. My eldest two girls and this baby are all c sections which is tough. I gave up work to be a sahm but I'm looking forward to when this one starts school and I can get back to work.\nI hate how sick, tired and achey I feel. I'm short tempered with my other children. I'm fat and saggy. I poop constantly. My mental healths taken a complete beating - I've been in counselling for nearly a year now and feeling better though. \n\nAnyway. My consultant offerered to cut my fallopian tubes during my next c section making me infertile. I said yes of course, just check with my fiance.\nHe is very against it. I don't feel comfortable doing something permanent that effects him too without his support but equilly ill never forgive him if I fall pregnant again. \n\nHe says I'm making a decision based on anger that's I've essentially been pregnant for 14 months now.\n\nWIBTA if I agreed to be steralised - taking away also his choice of having any more children - because that's what I want?\n\nAlso to add, we've discussed me using the coil but there's no birth control that's 100% effective.\n\nEdit: this has gotten more attention than I thought it would. I haven't had the chance to read all replies yet as been doing kids baths dinner etc, still need to get them to bed so will read every reply later.\nJust to answer a few questions that have come up so far. I wasn't sure how much info to add in my original post to not be rambly. \n\nFiance had always said as one of 4 he loved the madness and would want 4. I always said 4 was too many but we said we'd see how we feel after 3. We had never anticipated a still born and that steralisiation would be an option.\n\nThis past year he's been my absolute rock. He also lost a baby, but he had to hold it together while I fell apart. He's a fantastic father. This isn't a walk away from our family matter.\n\nHe's a bit of a stereotypical man in that he doesn't do talking about feelings, this is how he's always been and I accept that. He has so many other fantastic qualities. An example would be when choosing the music for our daughters funeral. He simply refused to pick. It upset him too much. You could say this is an ass hole move, however while I sat inside crying he was outside on the tranmpoline with our other 2 young children making them shriek with laughter, protecting them as best as he could.\n\nI know in a way this is above this sub, because he's not an asshole, but I didn't want relationship advice. I just wanted to know if I would be crossing a line by doing it without his full support.\n\nIf I say I'm getting it done, he won't stop me. But he will resent me. If I don't get it done, I will resent him. \n\nHis main concern is that its extra surgery with extra risks. Second that I'm not my usual self (I'm not - I am a raging hormonal mess, with a dose of ptsd, anxiety and depression to boot thanks to our loss - however I have a fantastic counsellor and things have greatly improved). Third he says there's other forms of contraception that isn't permanent. Forth is my age. \n\nAnd I've had 2 c sections. 1 emergency, 1 planned. Our stillborn was delivered naturally as she was premature and small so not the same risks. I have my third c section booked for the end of the month. I need to give an answer on Wednesday if I want the tubal tie at the same time and we are still in disagreement, so one of us will be upset. I wanted to see if I was being an asshole for choosing my choice, of permanent steralisiation over his suggestion of the coil. \nSo far it seems from comments that I'm not and I really appreciate all the replies. I will read them all xxx\n\nEdit 2. Guys I was asking if I would be an asshole not if fiance is an asshole and I'm beginning to feel very protective over him with some of the comments. I'm not a baby factory in the same way he's not a sperm doner. We love each other and respect each other we just have a difference of opinion on a huge matter and we've ran out of time. Whilst I'm really pleased it seems everyone is agreeing with me he's a good guy too. Everything he does is for us. He's hardworking, loving and fun. He helps me with the kids after a day of manual work. He does baths and the park. He rubs my back, sends me off for baths when I ache. Let's me sleep in, or nap due to pregnancy tiredness.\nLeaving us over this wouldn't of even entered his mind nor is it a concern of mine. We survived a stillbirth while raising 2 other young children, as a team, filling their life with joy despite the pain. We can survive anything if we've made it through the last 18 odd months x",
  "id": 1,
  "comments": [
    {
      "score": 17081,
      "content": "I thought this was going to be some kind of Child-free vs wanting children thing but you're already 3 kids in.\n\nI think NTA but it's going to be a pain point if you can't get on the same page.",
      "id": 2,
      "comments": [
        {
          "score": 7121,
          "content": "4, the still baby counts, OP bore her and birthed her, she carries her loss. I agree she’s NTA, absolutely.",
          "id": 3,
          "comments": [
            {
              "score": 2479,
              "content": "c'mon this really isn't something to nitpick about\n\nedit: i can see now that asking people not to nitpick over such a deeply personal issue only serves to encourage more nitpicking. my bad y'all i was trying to be compassionate",
              "id": 4,
              "comments": [
                {
                  "score": 674,
                  "content": "You missed a big thread / fight over this earlier this week\n\n&#x200B;\n\nedit : because people are asking, in the comments  [https://www.reddit.com/r/AmItheAsshole/comments/cx3tai/aita\\_for\\_asking\\_my\\_wife\\_not\\_to\\_tattoo\\_her/](https://www.reddit.com/r/AmItheAsshole/comments/cx3tai/aita_for_asking_my_wife_not_to_tattoo_her/)",
                  "id": 5,
                  "comments": [
                    {
                      "score": 116,
                      "content": "I’m curious because I missed it, is it still up?",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "Link?",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 421,
                  "content": "Wasn't sure which comment to reply to but it's OK, no offence taken. Sometimes I say this is my third child and other times I'll say 4th but we lost one. Depends on the situation. Child loss is an uncomfortable conversation let alone say in the supermarket check out when Im asked by a well meaning stranger who's observed my large belly. However, if my 4 year old hears me say its my third she will scold me and tell the person all about her sister in heaven. X",
                  "id": 8,
                  "comments": [
                    {
                      "score": 201,
                      "content": "I lost a three year old to cancer. My first husband and I divorced shortly after. I’m remarried now and have two kids with my second husband. \n\nIt’s a complicated thing to answer how many kids I have when someone asks me. \n\nI went to grief counseling, and my counselor’s suggestion was that I only talk about my late daughter with people I want to share her with. If it’s a stranger at some work event, they’re just making small talk and they don’t want to get into my personal tragedies, nor do I in the moment. The counselor suggested that if I feel guilty for saying I have two children rather than three, I should just say an apology in my head to my first. \n\nShe suggested I look at it as a way of protecting myself, and the memory of my child. \n\nBy the way, OP, since I’m telling you this, I will also tell you that when I asked my OB for a tubal, she started to ask me her standard question - if you lost one of your children, are you sure you wouldn’t want to have another? - but stopped herself because she said if anyone absolutely knew the answer to that question, it was me. I think the situation is very similar for you. You absolutely know.\n\nEdit: thank you very much for the gold!!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 94,
                      "content": "Your 4-year-old sounds amazing and you're such a lucky mother to have a child like her. She's right of course but it's okay to not want to talk about your lost daughter with strangers at the grocery store. What matters most is that you're doing what you can to move past the trauma that your daughter's stillbirth has left in its wake.\n\nOne thing I think that might help you and your husband, if you're comfortable with it, is ask for him to go with you to sit in with you and your counselor to go over your feelings about getting sterilized. It doesn't have to be right away. Just ask him if he can arrange time to go with you so that he can gain further insight on how you feel as well as how your counselor feels you're doing in your grieving and recovery.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Ignoring all judgement from the votes and any disagreements on opinions / personal morals / ethics etc through the comments, OP deserves credit and respect for the post and replies. Stay awesome!",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Pregnancy is hard on your body. Having more than two kids is exhausting. (I’ve heard that having the third kid is harder than the first two because you lose the man-on-man coverage.) I wouldn’t blame you for quitting while you’re ahead, but the question is will your husband? \n\nHe is wrong on one thing, though. If you get the tubal done at the time of your c-section it isn’t an extra surgery, they’re already in there stitching up your uterus, it’s nothing to to clip those tubes then. If you don’t do it now and use another form of birth control, then years down the road get it done—that’s an extra surgery. \n\nHave you told him that you’re afraid that you will resent him in the future if you let him talk you out of it? Because that is something I’d want to know.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Hey OP, sorry to hear you're going through this tough time in life. I wanted to just mention one scenario where I think you and your husband could compromise with each other. I'm not sure if others have recommended this, but have you all considered adoption? It sounds like your biggest concerns with having another child is going through the pregnancy and the potential for the child to be stillborn. If you adopt, obviously you wouldnt be going through the pregnancy process, and the child you're adopting is already alive and presumably healthy. This would still allow your husband to have the four children he really wants. The bonus is you have the chance to make a massive difference in a young child's life by pulling them out of foster care and giving them a place to call home. My sister had hodgkins lymphoma cancer as a child and it caused irreversible damage to her ovaries and she had no other options but adopting. Her two kids are wonderful and they love each other just as much as any \"normal\" family. It's an option to consider.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Has adoption never been discussed? Pregnancy is not the only way to have a child, if your husband wants to have another one after this one and you don’t want to be pregnant, why not adoption?",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Your husband wanted 4 babies, he got 4 babies.\n\nPlease, please, if you need to do this, do it.\nHe is not an asshole, but he is still wrong.\nCounseling can help him through your choice, but its yours to make. \n\nNAH.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I think that's sweet of your kid :) I'm also marking this on my list of questions not to ask people in casual conversation...\n\n\\[Ultimately, it's your body going through the pregnancies, so I think you should get the final say. Age is definitely a concern for your and any future child's health and life. Would fiance be willing to consider other ways of having another kid, like adoption or fostering a child? You mentioned you're seeing a counsellor; is he as well? Maybe bringing him along to talk it through could help you both?\\]",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Omg your 4 year old scolding you is so sweet I want to cry xxx",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "It's ur 4th baby, but it is hard to say to people oh I've 4 kids but ones in heaven. So will always depend on situation. Your body and mind has taken so much the last while. I completely understand why you'd want to cut ur tubes. But ur husband is probably right (hormones are feckers for messing with ur head) get coil in and then if u change mind either way u always have options... I've four kids and want no more but here tubes being tied isn't a thing so I've coil in and haven't looked back. I ve recently got all mine in school and crèche and I'm like am I feeling broody again. Am I mad yes but if I'd my tunes tied I know wouldn't be an option which I think would be sadder. I wouldn't make a knee jerk reaction when ur still healing from still birth. Sending love strength to u and ur family xx",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 338,
                  "content": "It’s not really a nit pick. Loss of a child is huge, they have three children, unfortunately only two were surviving. Number four is en route and is a rainbow baby.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 277,
                      "content": "please god do not misinterpret \"this isn't something worth nitpicking over\" to mean \"i need to be convinced this is worth nitpicking over\". how can you read OP's post and think to yourself \"yeah, this seems like the thread to have a stupid  argument about something so immensely personal in the comments\"? stop. just stop. jesus.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 188,
                  "content": "Unfortunately, losing a pregnancy that was intended to result in a child being born, does count as a loss of a child.\n\nSo, losing a child still counts as a child she carried.\n\nNitpicking isn't applicable to counting children, regardless if they survive a full pregnancy or fall to miscarriage.\n\nAdditionally, the miscarriage applies to her perspective, as she mentioned it at the top.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 138,
                  "content": "She's had four pregnancies. Having just one nearly killed me. Pregnancy sucks. The end result is pretty awesome, but the whole process is awful.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 30,
                      "content": "When my mom was 33, she was diagnosed with a disease. The doctors told her not to try and have any more children. The pregnancy itself could kill her and she most likely wouldn't survive a birth.\n\nWhen I was a kid I just thought, \"Oh well, just don't have anymore!\" I didn't realise how much of a lifechanger that is, and how hard it must have been on her. I didn't realise how much havoc a pregnancy can reap onto your body either.\n\nIt was also hard on my, now ex, stepfather who wanted another child. His inability to support my mother through her illness, and the toll it took on their marriage, is the reason why they got divorced. He wouldn't even visit her. I lived in the hospital with her for the month after her surgeries. \n\nHe ended up being an actual asshole. I can only hope that OP's husband will not go this route. It damaged our family relationships beyond repair.\n\nThis is something 100% nonnegotiable to me. Difficult pregnancies are a life risk for the mother and an automatic decrease in quality of life, especially when also coupled with C-sections. No one can have any sort of logic to compete with that.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 67,
                  "content": "It really is to those who have lost.",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 47,
                  "content": "Yes to people who had had a still birth it really is.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 3,
                      "content": "To some people, not to everyone. I think it’s safe to just let people say what they want.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I really appreciate your edit. Shows a lot of self awareness",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 285,
              "content": "NTA I feel like your husband is being very selfish. You are completely allowed to make decisions about your own body. If my husband had said that, I’d tell him to carry any future babies in his body.",
              "id": 28,
              "comments": [
                {
                  "score": 76,
                  "content": "There are also risks with having children after a c section. I know of someone who would have ripped along her original scar if she would have tried for a vaginal birth. Get the doctor to give you (only you) some odds on this happening, and then ask him or her to provide a medical opinion after the birth of your current pregnancy, that you should not have children as there is a 'risk' of harm to you and the next unborn child. \n\nThe doctor won't be in a position to lie, and if your husband wants to push the issue, fine the doctor can give him honest answers, that benefit you. Good luck with it.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 8,
                      "content": "For health insurance reasons a pregnancy post-cesaeran is automatically considered high risk.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I wasnt prepared to learn this today",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Not to mention, OP wants to go back to work, and it looks like she is in a country where the rule is sahm, so if they keep having babies, she will be stuck in that situation indefinitely.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "[deleted]",
                  "id": 33,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Even if he was (and he’s the fiancée so they plan to get married) he still cannot tell her what to do with her body.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 167,
              "content": "I'd go as far as NAH.\n\nYou have every right to body autonomy.  He doesn't have to be ok with you being sterile either.  Ultimately its your decision but it was respectable of you to include your fiance's input in your decision.",
              "id": 35,
              "comments": [
                {
                  "score": 7,
                  "content": "What you said is correct, but it can and has destroyed relationships making those kinds of decisions. She has autonomy but he also has the right to take issue with it and leave, because she did something that they as a pair/team disagreed on. It would no longer be “us”, it would be “her”. Sounds like OP has deeper things to figure out right now, like the fact that her fiancé obviously wants more kids and she doesn’t. That’s sort of an issue that needs to be settled before she goes and gets a surgery...",
                  "id": 36,
                  "comments": [
                    {
                      "score": 13,
                      "content": ">It would no longer be “us”, it would be “her”. \n\nAnd if she doesn't do the surgery and carries a fifth child for this man, it'll be \"him\" instead of \"us.\" \n\nAs a woman who has also had loss and absolutely hates being pregnant, I feel for OP so much. Luckily my husband had no issue with me getting a tubal since, ya know, it's my body and all, but he also understands that the three pregnancies and two living children we have had together is going to have to be sufficient if he wants to keep his family intact.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": ">He doesn't have to be ok with you being sterile either.\n\nUm? It's not his body so I'd say he has to be OK with what someone else does with their body.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "While obviously the still baby counts, we are talking about remaining children.  If the still baby was the only one, it could be understood why the husband would be upset (still wouldn't be his choice but getting upset is something you have a right to).  But they have 2 healthy children and likely a 3rd.  They faced loss, sadly, but they also have plenty of living children so loss isn't all they have.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I say NAH. The husband is aloud to be against it, they need to work this out together.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "NTA also, and tbh, even with no kids, my mind was made up within the first few sentences. All of the surrounding info does not matter. You should not have to conceive and carry a child within you, ever, if you don't want to. Ever. It is a no-brainer to me. I already know id hate being pregnant for many reasons, and you could not PAY me enough to carry a child. It might be an issue in the relationship, but that doesn't mean either party is an asshole, you just need to work on it together, maybe adoption. Or just accept OP hates being pregnant and that that is more important than more kids. This is a serious topic, 9 months, another life created, and not some \"well I really fancy more kids.\" I would equally say he could get a vasectomy if....for some reason he hates making people pregnant, felt he was not a good genetic candidate for a kid (me), etc. Your body, your choice, a relationship should compliment that, not overwrite it.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "four births -- she's going to be raising three kids. i think that's generally the concern. she's not going to be a parent of four.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "NTA Yeah it’s her own body, I don’t see why this is even a discussion, she’s given him 4 children already ffs.",
              "id": 43,
              "comments": [
                {
                  "score": 5,
                  "content": "Right! 4! Dude that’s more shoes than some people own \n\nI don’t know how you afford more than 3-4 kids today",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "She has three kids. She had four but right now she has three.",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Still only three kids in though.\n\nFour pregnancies, three kids. Fourth one hasn't been born yet",
              "id": 46,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 541,
          "content": "[deleted]",
          "id": 47,
          "comments": [
            {
              "score": 388,
              "content": "And they aren't losing their ability to have more children at all. Adoption is also a route to more children and with saving they could even hire a surrogate. It's just taking away her potential to suffer for a 5th time.",
              "id": 48,
              "comments": [
                {
                  "score": 207,
                  "content": "[deleted]",
                  "id": 49,
                  "comments": [
                    {
                      "score": 83,
                      "content": "I know there are those types of shitty people (and yes if you're offended by this you are shitty). They don't deserve kids in the first place. \"This is my trophy. I only care about it because we have similar DNA.\"\n\nWhich I wouldn't be shocked at if OP's husband is one of those since he seems opposed to his wife not suffering. But that's why I even brought up surrogacy. Honestly don't see a reason for surrogates in the first place with the surplus of kids who need adoption. Kinda the same logic as people who spend thousands on dogs then go off breeding their dogs when thousands a day are put down in shelters.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I had a conversation with a friend one day and mentioned I want to adopt rather than have my own children and was confronted with “Well don’t you want to pass on your DNA and name?”\n\nWhen I said I really didn’t care as long as I made someone’s life better and a family is a family DNA doesn’t make a family, he thought I was crazy. \n\nWe have enough population and there’s plenty of kids that need a family.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Adoption isn’t going to the baby store and waiting in line to pick up your baby. You have to wait years sometimes. The birth parents have to pick you above all the other waiting couples. Then even after birth and you have the baby they can still change their mind and take the baby back (amount of time varies based on state). It also costs like $30,000 up front. Flip side is you can adopt from foster care (older children) but sometimes it can take years to sever parental rights (again a child you took care of for years could be taken away and never seen again) and also older children in foster care ended up there for a reason. They have suffered some form of horrible abuse which not all people can deal with (attachment disorders etc) the people who weather the storm and give Children loving homes are amazing, but how can you blame someone for not feeling up to that emotional challenge?",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "If he cares so much about DNA, he can always get a surrogate. OP has already gone through 4 pregnancies - it's above and beyond what most women will experience. Honestly, OP's husband would be such a selfish asshole if he insists on a fifth pregnancy despite knowing how negatively OP feels about being pregnant.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Eugh, some of them even use shitty slogans like \"Made not bought\". It's horrible to think that people can be so bitter over a kid getting a home.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Adoption is incredibly difficult to do and comes with a whole raft of grief for the birth family, child and even adoptive family. It’s not a simple answer for those who can’t have biological children.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 119,
                  "content": "Also more bio children might not even be an option; my sister who had three c-sections told me that doctors won't do more than that on a woman for safety reasons, and if all of her children have been delivered by c-section so far then she might be at her limit for children she can safely deliver. Her doctor might be suggesting this for her own health and safety.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 99,
                      "content": "But apparently thinking of her own health and safety and not wanting to leave her 2 (to 3) living children without a mother makes her an irrational emotional woman. Please someone think of the boyfriend's right to impregnate her as many times as he demands.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "I would definitely ask the doctor this. If the doctor says no more kids, no more kids.\n\nI actually understand fiancé's concerns to some extent (fear of complications, for instance, and worrying about making permanent decisions under duress) but I think talking to a doctor together can clear up some of the confusion.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Agreed, the idea that anyone but the body owner gets a say in this issue is just revolting .",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 396,
          "content": "Okay I’m going to say INFO. We don’t know what the husband is actually saying, if he’s saying “Have the baby! It’s important to ME!” Then that makes him suck. If he’s saying, “Hey, I just want you to think about this for a bit after the birth because I want you to be 100% sure. I know all of these pregnancies have been difficult but you once told me you wanted four kids so just to be sure let’s wait. In the meantime I’ll get condoms.” Then that makes it a no assholes here situation.",
          "id": 60,
          "comments": [
            {
              "score": 730,
              "content": "Okay, but having this surgery done at the same time as her c section is super easy. She is already being cut open once to give birth to the next baby- if she waits she literally has to get cut open in the same spot a freaking FIFTH TIME and has to go through recovery again. She already will have 3 children and 4 pregnancies/births. This isn't like a vasectomy where you wait and see how you feel, it's a big surgery.",
              "id": 61,
              "comments": [
                {
                  "score": 305,
                  "content": "I feel for her. This has taken a toll on her mental health and her body. She's seems done and I think it's best. She already went through a lot. It's time for her to finally recover and move on to the next step in life.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 618,
                      "content": "I’m going to be real honest here: I love my son but hated being pregnant and I hate how my body and mental health never really bounced back like it does with some women.   \n\nWe know our bodies. If OP says she is done, she’s done. I know this might sound cruel, but it doesn’t fucking matter what the fiancé thinks.    \n\nHe’s not the one who has to carry the baby for 9 months. He isn’t the one who has to get surgery just to deliver the baby. He’s not the one risking his life to have these babies. And he’s not the one who has experienced back-to-back pregnancies while taking care of babies they already have.   \n\nThis will be baby #3. OP, if you happen to see this, my advice is to get the tubal ligation if you want it. While you are being very generous by consulting your fiancé on the matter, this is your choice, period.   \n\nHe’s entitled to his opinion. He’s not entitled to force you into more pregnancies that you are comfortable with. You need to sit him down and tell him this is happening whether he likes it or not.   \n\nNTA for choosing tubal ligation. I firmly believe that is a right every woman has to decide for herself. Even taking away the miscarriage, having 3 babies that close together, it’s still acceptable to say you don’t want a 4th or 5th (where the risk can get higher and higher your health may suffer).",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "[deleted]",
                  "id": 64,
                  "comments": [
                    {
                      "score": 12,
                      "content": "This is the agreement my husband and I have. I think it's the most fair, and humane solution, starting by the fact that it's an ambulatory procedure, and in some cases reversible, while for the woman, tubal ligation means major surgery, and is irreversible. That's why while having a C-section is best time to have the tubes tied.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Sure, but I'd say most women have a friend whose male partner lied to them about this, making them have another baby as a result. I have a friend whose husband did this to her TWICE. If you want to be DAMN SURE then get yourself sterilized.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 47,
                  "content": "Yes, and the more c-sections she has, the harder it will be for future pregnancies. Is husband taking into consideration what the toll of future pregnancies will have on her physically as well as mentally?",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "The thought of having o go home from having your tubes tied and take care of three small children the next day while not being allowed to lift anything just makes me want to hide. Doing while they already have her open makes so much sense.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "THIS \\^ .  Time is of the essence.  This is why she said she is out of time.  It's now or never, or it comes at a serious cost to a mom that has been (physically) through a LOT.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Dude should get a vasectomy if they decided they don't want more kids.  A tubal is still more abdominal surgery on top of the C-section.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 158,
              "content": "[deleted]",
              "id": 71,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "It's a really good idea to do it during the C-section. I even signed papers before my fourth baby giving authorization to give me a tubal if I ended up having an emergency C-section. My labor went naturally, so I had to wait 6 weeks for a laparoscopic procedure that took a couple weeks to recover from. She could also get pregnant before she gets them tied if she waits. I'd also like to mention how the coils are not a good idea. I have a friend who got those and ended up with a surprise pregnancy 5 years later. It sounds good since you don't have to get cut open, but it's better to just get the fallopian tubes cut. Less risk of problems with the coils moving and less risk of accidental pregnancy.",
              "id": 72,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I think he still sucks in that situation. It’s not really for him to decide when she is 100% sure. She’s already in counseling, and she is capable of making this decision. There’s no reason for her to undergo a second invasive surgery when she get it done now.\n\nI don’t think he sucks for feeling disappointed or hurt by her decision. Maybe he wants more kids. That’s valid. But the reality is that she doesn’t want to get pregnant again, and he needs to accept that and decide how he wants to go from there.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "How about a vasectomy *and* condoms. That would speak volumes about his intent to protect her rather than pushing a fifth pregnancy on her because he wants a basketball team.",
              "id": 74,
              "comments": [
                {
                  "score": 3,
                  "content": "I’d totally agree to that. A vasectomy would show that he’s taking her side seriously but if she ever did have a change of heart they could reverse it. Then she wouldn’t have to do that major surgery.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He's the one that wanted four kids, she was iffy on that and wanted to stop at three.",
              "id": 76,
              "comments": [
                {
                  "score": 5,
                  "content": "I think that whoever wants the lower number wins the argument. You don’t want to be the child who’s existence is resented.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "She had four kids and also like if she’s miserable being pregnant, she knows she doesn’t want to be pregnant again. There’s nothing about her current state that means she can’t make decisions about her future and that only he, the rational non-pregnant one, knows the real answer for.\n\nShe knows what she wants.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Plus it's not like you only have to stick with one type of birth control either. You can do condoms with just about any other birth control.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 357,
          "content": "I thought the same thing. If she's done then she's done. Itsher body that's on the line.\n\nEdit: thanks for the silver boo. I still don't know what it is for but thank you.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "I agree! As well as the risk of uterine rupture increases with every Cesarean delivery, and they don’t tend to just let you do a VBA3C because that risk is much higher as well as risk of placenta accreta (basically the placenta digs itself deeper into the uterus and sometimes all the way through the uterus, it’s actually the reason why Kim Kardashian uses a surrogate because it is extremely dangerous and can kill mom and baby) . OP’s health is now something to take into account, as this will be her fourth Cesarean which ups those risks. I say OP is NTA because she is doing what will protect her so she can care for her family. Her fiancé on the other hand? He is TA for not respecting her wishes.",
          "id": 81,
          "comments": [
            {
              "score": 86,
              "content": "This is a very good point, and I don't think her husband has been fully educated on the toll this is taking on her body, and the complications it's creating for any future pregnancies. I feel like somebody needs to sit him down and explain to him what placenta accreta & previa is and why she's at greater risk for this following complicated pregnancies and multiple CS. And this is not even delving into the mental health risks she's susceptible to, following such a heartbreaking loss and no real stabilization of her hormones in well over a year. \n\nHe needs to be educated on the medical/psychological side, as well as consider that this is ultimately her risk. She has had dangerous pregnancies. That risk doesn't decrease the more babies you have. I don't think he's trying to be TA, but he is proving himself TA by not pursuing a more rounded medical education on this subject. \n\nOP - why not take him along to one of your counseling sessions? I think having a neutral party in the room will help aid communication on this subject. Plus if your counselor has any medical education at all - they should understand the substantial physical and psychological risks you'd be taking on by following his wishes.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Would it be a different judgement if she was childfree and he wanted her to birth him children?",
          "id": 83,
          "comments": [
            {
              "score": 49,
              "content": "It's kind of a major incompatibility for someone childfree and someone who wants kids to stay together.\n\nIf she'd been through a bunch of awful pregnancies which all ended in stillbirth and miscarriage and said she wanted to stop trying, he'd be the asshole for pushing her to keep going. Childfree is different from not being able to handle pregnancy.",
              "id": 84,
              "comments": [
                {
                  "score": 3,
                  "content": "Okay thanks for answering",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I would think not (same issue at play - her body, her choice).\n\nBut the advice would (should) also have the addition of “you should probably end the relationship,” because if one of you wants a kid and the other doesn’t, that’s a fundamental incompatibility that can’t be compromised on... you can’t have half a kid. And neither one would be fair to expect the other to “change their mind,” on something that’s such a big deal, and that would affect not only them, but potentially a kid that would be at best tolerated, at worst rejected, by one of its parents. That’s the kind of situation where that kid would need some serious therapy to overcome it. So in a situation like that, it’s better to cut your losses and find someone who wants the same things out of life that you do.",
              "id": 86,
              "comments": [
                {
                  "score": 5,
                  "content": "I was just curious if the husband would be the asshole in that cinario. Thanks for the reply",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "They already have 2 kids with 1 on the way. I really doubt one wanting/not wanting a third is a irreconcilable difference. Something tells me they shouldn't \"probably end the relationship.\"",
                  "id": 88,
                  "comments": [
                    {
                      "score": 5,
                      "content": "If you had actually read the comment I replied to, you’d notice it says\n\n> Would it be a different judgement if she was childfree and he wanted her to birth him children?\n\nWhich is a different situation than the one OP is in. I definitely think that in the situation that I replied to, ending the relationship would make sense.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Not really. But having been through multiple pregnancies, no one can doubt that she knows what she’s talking about when she says she hates being pregnant.",
              "id": 90,
              "comments": [
                {
                  "score": 2,
                  "content": "Thanks for anwsering. Was just curious",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "No, she still wouldn't be the asshole, but in that case, I think she would need to end that relationship because they aren't compatible.",
              "id": 92,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Absolutely. In that situation they should break up. It's not even an argument over 1 vs 2. This is an argument over 3 vs 4 children. That shouldn't be a deal breaker for the one who wants more, and who doesn't have to be pregnant. OP has already had an unplanned pregnancy, she is understandably wanting o prevent that happening again.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "She still would be not the asshole if she was childfree, but I would also point out a major incompatibility in life plans and the need to figure it out with a partner who wanted kids, then figure out long-term goals and if they should even remain together.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah. Everything I was going to suggest, she has done it. She has been in counseling. She has tried talking to him. She may be depressed or grieving still, but I don’t think that means she can’t make a decision about her own body. It seems as though she knows what she wants. She understands the consequences. She’s an adult woman, and she deserves to make this decision. \n\nHaving children is the kind of thing that both parents should want.  If one wants them and the other doesn’t, then you don’t have one. What they have been through is tragic, and I feel awful for the fiancé. She needs to understand that this could be the end of her relationship. If her fiancé wants more children, then that’s a dealbreaker. This of course is very difficult for both of them because they already have a child on the way, but it is what it is. \n\nThey can always consider adoption down the road, but there is no reason to force OP to go through another pregnancy.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Would that make a difference?",
          "id": 96,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Agreed. Ultimately it’s her body and she’s been through so much already. \n\nOP may want to seek some family counseling afterward though. My husband and I can’t agree on when our family is complete and it has caused some anger within our marriage.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6729,
      "content": "NTA, but you need to make your reasons to him very clear and have a long talk about it. It is a decision that will affect you both, but ultimately, it is your body, mental health, and well being on the line. \n\nIf he doubles down and insists that you don't do it, it may be time to reconsider the relationship.\n\nEdit: lol, holy shit, reconsider does NOT mean just up and end it, people. It means reevaluate, and that's only if compromise cannot be met in any form. Some of you are raising extremely good counter arguments! Some of you are personally attacking me. How nice.",
      "id": 98,
      "comments": [
        {
          "score": 1440,
          "content": "[removed]",
          "id": 99,
          "comments": [
            {
              "score": 1529,
              "content": "I'm not disagreeing with that - it would have to be something they both considered deeply. He would have a right to end the relationship, just not to insist on what she does with her body.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1062,
              "content": "[deleted]",
              "id": 101,
              "comments": [
                {
                  "score": 354,
                  "content": "My thoughts exactly. What is he gonna do? Have other like 3 children with another woman, achieving his dream of having a lot of kids in total, but only being able to dedicate half his time and half of his resources (if they're lucky) to each three?  It's one thing to split up if one wants to have children and the other doesn't, but this couple has children already. It would be an incredibly selfish and irresponsible move to break the stability and wellbeing of one family (with hopefully 3 children soon) just for the mere wish of having more than 3 kids, as if the previous three weren't enough work.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 330,
                      "content": "Can you imagine the mental trauma of the kids? Learning your dad left you because you aren't enough for him? Because that's how little minds will see \"dad's leaving because he wants more kids\"-- \"we kids aren't good enough for him\".",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "So she should give up control of her body cause he wants a million babies? \n\nSomething has to give of: she becomes permanently infertile, he gets more babies, or they continue to be a family.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Especially after all these pregnancies seem to have basically destroyed her. Is he going to leave her crumpled and fine a new shiny toy? Jesus if her mental state is as raw as her writing seems I wouldnt be surprised if she did something dangerous to herself if he did",
                  "id": 105,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "He doesn't need to leave. If his dream is four kids, there's always adoption or surrogacy.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 343,
              "content": "Imagine being such a tremendous asshole that you break up with your wife because she doesn't like being pregnant and her being pregnant for you four times is insufficient.",
              "id": 107,
              "comments": [
                {
                  "score": 95,
                  "content": "They're not even married. She's totally up shit creek if he leaves her. No legal rights except child support. She needs to be not pregnant for a bit so she can focus on her career because she is legally single.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Hopefully she's Canadian, since she would legally have the same rights as if they were married, as long as they live together.\n\nSource: British Columbian.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Not necessarily the case, depending on the state.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "They aren't in the US. She referred to an IUD as a coil, which points the finger at English.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 295,
              "content": "He has a legal right to leave over this, true.\n\nBut should he? 3 kids is a lot to handle. Wanting to father an ungodly number of children is a bad reason to abandon his first family and would show that maybe he shouldn't be having any kids at all.\n\nLike, sure, he could leave her for this, but he'd be TA if he did.",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 231,
              "content": "He'd be an asshole if he walked away from the mother of his 3 children to have more with someone else. Her body, her choice.",
              "id": 113,
              "comments": [
                {
                  "score": 69,
                  "content": "The mother of his 3 children who gave up her career to bear and raise them, but whom he has not even married and so has no legal obligations to.",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 117,
              "content": "He’s within his rights to consider the relationship, yes, but not to dictate what she does with her body. It’s so easy to say “he has a voice too”, but it’s her that’s gone through the awful pregnancies. I’m at the end of a pregnancy that has almost killed me, will never go through this again, and is my husband sad at the thought of no more biological children? Sure. But he also gets that it’s not him that has gone through 9 1/2 months of utter agony.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "LOL if he would reconsider the relationship and leave behind the children he already has just to get more children then he is a piece of garbage that shouldn't be allowed to be a dad.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 108,
              "content": "\"Within his right\"=/=\"the righ thing to do.\"\n\nHe'd be leaving his children as well, (even if he gets partial custody).\n\nMakes no sense for your desire for future children to be the reason you leave your current ones.\n\nI don't care what people said in the other thread-I wasn't one of them.",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "They already have three kids. Beyond that is just downright irresponsible. We have 7.5 billion people on this planet and dwindling resources.",
              "id": 118,
              "comments": [
                {
                  "score": 2,
                  "content": "Always nice to see I’m not the only one who thinks this. IMO two is plenty.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Why have more than 3?! There's already enough to go around in this world. Selfish.",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "He'd be a massive idiot to disagree with this after they've had 3 (hopefully) kids.\n\n I think it's a thing they should think and decide about in a few month's time rather than right now when they are both mega-hormonal and stressed and worried! But \"3 kids rather than 6\" is a reasonable compromise in any sane relationship I would say.",
          "id": 121,
          "comments": [
            {
              "score": 286,
              "content": "She's having her c section worries the next few weeks.  Tying fallopian tubes is significant abdominal surgery; it makes the most sense to do it when they're already in there.\n\nIt's decision time.",
              "id": 122,
              "comments": [
                {
                  "score": 29,
                  "content": "Yes, or he can agree to have the snip if it must be decided later.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "A laprascopic tube-tie would be outpatient surgery, so while it's best to get it done now while they're already doing the major c-section, on its own the procedure wouldn't require major abdominal surgery, unless she's chock full of abdominal adhesions and scar tissue.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "“Reconsider the relationship”\n\nDo you hear yourself? This is a couple who is married and has had 4 children together. You can’t just throw the whole relationship into a hail\nMary play like talking ONE more time and call it a day. Again do you hear yourself?\n\nThere are many resources available to couples going through fights, arguments, or in this case a disagreement on bodily autonomy, which is very serious. If you’re gunna comment, take responsibility and look into resources such as emergency couples counciling. It’s disgusting you think you can just throw in a comment like that so freely. Someone might actually listen to it instead of getting the help they need for a relationship, while you just get to walk away.\n\nSeriously, I started this comment a bit angrily, I’m sorry for that, but just try your best to not tell people to throw their relationships away over an issue. It’s an awful reddit stereotype",
          "id": 125,
          "comments": [
            {
              "score": 65,
              "content": "I said to reconsider - not to just up and jump ship. Of COURSE they need to sit down and have an in depth, open and honest discussion about this. If they are both on board to seek counseling, absolutely! BUT, if having more kids is the hill he chooses to die on (so to speak) and he won't personally accept her decision, it IS something that would be cause to reconsider. A life choice like that would be a wedge if neither of them are willing to change.\n\nNo one is personally responsible for what someone says online, in a forum wildly full of varying opinions. I'm pretty positive OP is not impressionable enough to take the word of a few strangers as her absolute guiding light. It's ludicrous to jump down my throat because I shared mine.",
              "id": 126,
              "comments": [
                {
                  "score": 34,
                  "content": "[deleted]",
                  "id": 127,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Honestly can't believe you're getting downvoted for this. This sub has one of the worst communities on reddit, bar none. This was the straw that pushed me to just filter it out of my /all feed.",
                      "id": 128,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "Wow this threads gone somewhere else. I know everyone's commenting well meaning but he won't leave me or our children over this and he honestly doesn't treat me like a baby factory. He's a wonderful partner and father. We're not wed yet as I do want a Typical white wedding, but we got our house and children first. When I return to work when the kids are all in school that will be our wedding fund. He's not a monster, he would rather I used alternative, less invasive and permanent forms of contraception. We survived a still born baby with 2 young kids to care for, we will survive anything :)",
          "id": 129,
          "comments": [
            {
              "score": 133,
              "content": "I hope you see this. If he isnt happy for you to have your tubes tied, tell him to have a vasectomy. Its a fairly simple procedure (for most people) to reverse and should be a pretty good preventative measure",
              "id": 130,
              "comments": [
                {
                  "score": 20,
                  "content": "Was looking for this comment. He would absolutely be TA if he wants them to keep options open but is not willing to get a vasectomy instead of OP having to undergo some other form of invasive birth control. Vasectomies are fairly simple and reversible.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I wouldn't treat a vasectomy as reversible, but it's not super expensive to freeze and store sperm for 10 years (before the snip).",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This needs more upvotes, /u/Daydreamernightmares a vasectomy would solve all your problems! Sex life would not be impacted",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "towering wine lavish plants shy thumb joke edge axiomatic apparatus -- mass edited with redact.dev",
              "id": 134,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": ">he would rather I used alternative, less invasive and permanent forms of contraception\n\nThese requirements don't line up. No more permanent form of contraception exists than tubal/salpingectomy. Unfortunately, yes, that's more invasive than the pill or an IUD. But those aren't 100% effective either. No birth control is. Sterilization is all you got. Has your husband considered a vasectomy?\n\nTo be honest, I'm not quite sure what your husband's looking for here, or what you're really asking. NTA, absolutely. Your body, your choice.\n\nBut is your husband telling you he expects more kids? Is he afraid of you getting more surgery? Is he grieving your recent losses? It's not clear to me where exactly his head is at or what he's telling you beyond \"he's against surgery\" and said you're \"making this decision out of anger.\"\n\nCan you clarify? What exactly did he tell you? And did you tell him exactly what you've told us?",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Biggest reason to avoid posting here is that people can get so shitty towards your partner.",
              "id": 136,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "There are other ways to have more chiffren too without her having to be pregnant again. Adoption or even fostering.  \nPregnancy can really suck! Can’t imagine the horror and trauma of having to go through a still birth...",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Don’t take the criticism you’re getting over the “reconsider” thing too hard, but the nuance you intended to acknowledge can’t be gleaned from such a simple statement. You understand what you meant because you said it but “reconsider your relationship” is always going to land the way it did here or anywhere on the internet because folks take things at face value when it’s coming from a complete stranger.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I think the advice was reasonable. If her SO can’t respect and empathize with her needs, hard conversations will need to be had.",
          "id": 139,
          "comments": [
            {
              "score": 2,
              "content": "I'm glad to see that some folks understand what I meant! I certainly could have phrased myself a lot better, for sure, but it was early morning, I was having my coffee, and didn't expect it'd become such a point of contention.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Or, if permanence is the issue. Suggest him getting a vasectomy. They're reversible. Solves the no baby issue and the permanence issue while having the added benefit of showing that he does care for your mental well being (if he's willing to do it).",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "There’s the good ol Reddit advice of “break up.” You all never let me down. And before anyone suggests they didn’t actually say that, grow up. What else does “reevaluate the relationship mean?” \n\nReddit never fails to suggest that two people break up. It’s like the mean girl that’s always trying to sabotage other people’s lives in order to make their own seem less shitty.\n\nReevaluate your relationship... Just wow.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Stuff like this a deal breaker but I tend to always side with the person who says no more kids. No one should be guilted into raising more kids.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3314,
      "content": "NTA. He’s being very dismissive of your feelings here. He doesn’t believe you when you say you never want this again. And he clearly thinks his feelings should supersede yours when it comes to questions about how to handle **your** body. \n\nTell him this isn’t a passing fancy. Tell him you’re in pain in a way that you never want to be in again. Tell him it’s your body to do with what you want. And tell him that if he won’t believe you and support you then you both need to be talking to a marriage counselor, because he’s completely dismissing what you’re saying as irrational. Which is deeply sexist.",
      "id": 144,
      "comments": [
        {
          "score": 1149,
          "content": "Newsflash: In the 21st century, guy is angry a woman doesn't greatly sacrifice herself for his wishes and has to be reminded she's a person too, not an incubator.\n\nEdit: he's not a monster, but he needs to rethink if his dream of having 4 kids is more important than the wellbeing of his wife.\n\nEdit 2: considering they had a stillborn recently, I was very insensitive. I deeply apologize to OP if she's seen it.",
          "id": 145,
          "comments": [
            {
              "score": 511,
              "content": "Hold on, we don't know that that is his perspective. It seriously could be that he's genuinely concerned that if she does it in that particular moment (at the tail end of a pregnancy), she'll come to regret it. He's allowed to, and perhaps should, voice those feelings. Ultimately, it's hey decision, just as it would ultimately be his decision to get a vasectomy. But as far as we can tell from the post, he's just voiced his feelings. NAH based on the info we have.",
              "id": 146,
              "comments": [
                {
                  "score": 419,
                  "content": "Well she sounds pretty done to me and he should know even more than us how she absolutely despises pregnancy. \n\n\"He is very against it\" doesn't sound like he said something like \"I don't really like it but I understand you call the shots since you want it so much and you're the one who bears the risk and sacrifice\". More like he doesn't understand why and how she hates being pregnant, and he thinks it's just anger over the stillborn. He's not believing her and he has a completely different understanding of the situation. He needs to SEE that she's DONE with pregnancies, who knows herself better? Her or him?",
                  "id": 147,
                  "comments": [
                    {
                      "score": 60,
                      "content": "My dad regularly told me things about myself I didn't realize, and still does to this day. Sometimes others DO know you better than yourself, especially your partner who you trust with life. You're making sweeping statements about a man you know nothing about and only using one time he choose a side opposite his wife. He has 2 daughters to whom she says he's a wonderful father, she says repeatedly that he's an amazing man, probably an attempt to dissuade people attacking him like you are. His worries are genuine, clearly, and I think the best compromise is she finishes the pregnancy without cutting her tubes, they don't have sex until she's recovered from postpartum problems, depression, etc., and they reevaluate. If she wants her tubes tied still it will show the husband she means it, if he's still against it all the selfless ground he had to stand on is gone, as the pregnancy hormones are gone and all he can say is I want more children. If he *still* were to argue he'd be sexist, kinda, but having a want and asking your life partner to help you fulfill it isn't a fucking crime either. This militant, angry rhetoric does not feel like equality to me.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "I actually agree with this - I don’t get the feeling that OP’s husband is a monster who wants to make her fall pregnant against her will... I think it seems like a caring husband who sees the emotional turmoil his wife is going through and wants to make sure she doesn’t make any decisions that are permanent during this time if at all avoidable. Could there be a compromise here to where if  OP still feels the same way after the baby is born, the husband can get a vasectomy? Same outcome - no more babies - but reversible so it could put an ease to OP’s husband’s concerns. I don’t think OP’s husband is dismissing her feelings here. I think he is doing something that my husband does for me, which is remind me to take a step back before I make any decisions when I’m feeling vulnerable, overwhelmed, grief-stricken, etc",
                  "id": 149,
                  "comments": [
                    {
                      "score": 147,
                      "content": "It’s not that she had a bad day and is feeling stressed out. She has been pregnant for the majority of the last *four years.* She knows what pregnancy is like, she knows she hates it, and she knows she doesn’t want to do it again. It’s frankly very sexist to assume that OP is too hormonal to make decisions about her own body, especially since she is currently experiencing the thing that she knows she never wants to do again. OP is not a child and is capable of making her own decisions without every man in the room reminding her that she might change her mind.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I actually agree, the vasectomy argument has great merit. Let him put his body on the line, sperm can be frozen. If things change later on, fine.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": ">Last year I had a stillborn baby daughter. I said I never wanted to be pregnant again.\n\nThis isn't just coming up now, at the end of this pregnancy. She said she was done LAST TIME. Now she's pregnant again, with a son, that he wanted. She said she has always hated being pregnant, and even more so now. You really think that sounds like someone who is going to regret it?",
                  "id": 152,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I don't think he's a monster either but I also don't think he understands how much pregnancy takes out of you. It's physically, mentally, and emotionally exhausting especially after giving birth. Add on a traumatizing stillborn and you have some lifelong issues. I think OP is NTA and they should probably go to counseling together to better communicate their feelings.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "If that was the case he could easily have offered to get a vasectomy.  It, unlike getting your tubes tied, is reversible in the event of more children being desired.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I agree with that -- it would be a very fair compromise.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "That's very clearly his perspective. She's been pregnant FOUR TIMES. She knows she's done, she will not regret it. Why can't everyone just trust that women know what's best for them???",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I mean if a man wanted to get a vasectomy after 3 kids because the toll of working to support them was causing him to have stomach ulcers and she said that hes just being irrational and emotional and he doesnt really know what hes talking about, aaaaand she was a sham? No. That wouldn't be cool",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Why!!! Would he ever think that she might regret it?? After 4 pregnancies which she hated, what could ever make him think that she won't hate a prospective 5th as much?",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "That is so, unnecessarily harsh. In her edit she explains his side of things which is totally reasonable because this is his life and his family too. They just need to sit down and talk it out to reach a conclusion",
              "id": 159,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "\"They have 3, close enough\" yikes. It's honestly really concerning how you can state so authoritatively that dismissing someones feelings is so inconsiderate while simultaneously dismissing someones feelings as flippantly as possible.",
              "id": 160,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "Not just her feelings: her quality of life and life in general.",
          "id": 161,
          "comments": [
            {
              "score": 14,
              "content": "Exactly. She wants to get back to work and feel normal again.",
              "id": 162,
              "comments": [
                {
                  "score": 13,
                  "content": "She wants to feel like a person again. Being a single mom I’ve realized I’ve let a lot of my own life go, and I can’t imagine what it’s like to be a SAHM with 2 soon to be 3 kids. Back to back pregnancies. Held off her career for this.  \n\nThat’s fucking rough. No wonder she’s depressed.\n\nEdit: number of babes",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Agreed! NTA. I had my tubes cut a few years ago and I will never regret that decision. It’s your body, and, to me, it’s a major red flag if he can’t get behind your needs, especially because you’ve had a bunch of kids together already.",
          "id": 164,
          "comments": [
            {
              "score": 7,
              "content": "That's the boat I'm in. I just got a positive for number 2 and one of us is getting cut after this!",
              "id": 165,
              "comments": [
                {
                  "score": 4,
                  "content": "You should ask about tube removal, rather than just cutting. Apparently it’s just as easy to do, but way more effective. Just to know your options! 🙂",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Nailed it",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "That's a whoooolle lot of conclusions you just jumped to.",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "A guy can have a voice in a relationship too, you dont know these people. Hes not sexist for his opinion. Hes more than likely genuinely worried that shes making a decision hastily, not to say that she is. I think marriage counseling and long heart to heart needs to be considered. Both parties in a relationship need to be on the same page about this. But ultimately it is OP's body and her right to go through with it regardless",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Careful OP. This person is exaggerating on a whole another level. Take everything in this post with a grain of salt.",
          "id": 170,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1990,
      "content": "NTA. He isn’t carrying the kids, he doesn’t understand what it’s like to be pregnant. C-section recovery is truly horrible. It’s your body when it comes down to it, not his. If you know youre done and do not want more kids after your boy is born get the procedure done.",
      "id": 171,
      "comments": [
        {
          "score": 780,
          "content": "It’s also my understanding that it’s not recommended medically to have more than 4 c-sections. OP has had 4 already, this is going to get progressively riskier for her.",
          "id": 172,
          "comments": [
            {
              "score": 527,
              "content": "This. The fact is, each time you are pregnant, you are risking your life. The OP has every right to decide she doesn't want to risk making her living kids orphans just to give her husband more babies.",
              "id": 173,
              "comments": [
                {
                  "score": 33,
                  "content": "It’s not even just about her risking her life, it’s also about her risking her mental health. I grew up in a four child family with a mother with mental health problems and a father who was trying to fill in too many gaps. \n\nIt’s not fun.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 258,
              "content": "That is 4 MAJOR surgeries that require bed rest and minimal movement for weeks afterwards. Being pregnant is hard enough but being cut open 4 different times to ensure the health of you and your baby would be too much for anyone.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This pregnancy will be her third, her stillborn child was birthed naturally.\n\nIt doesn't change your argument, just clarifying what OP said.",
              "id": 176,
              "comments": [
                {
                  "score": 2,
                  "content": "She said she did have a c section for her stillborn?",
                  "id": 177,
                  "comments": [
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 178,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I was going to say this as well. It's surgery and you should only get it so many times.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This will be her third c-section, the stillbirth was vaginally delivered, but that's just me being nitpicky. That still is insanely risky to keep having them. And with 3 c-sections down she would no longer be able to safely do VBAC either, either birth route would be insanely risky",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "OP should ask him to get his stomach cut open and shove a watermelon up his ass 3 times in a 2 year period, see if he likes it",
          "id": 181,
          "comments": [
            {
              "score": 30,
              "content": "but what if he does like it?  you can't close that door once it's open.",
              "id": 182,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 100,
          "content": "And on top of that having 4 kids because “the chaos of 4 is so much fun!” is on up there for dumbass reasons to have more kids.",
          "id": 183,
          "comments": [
            {
              "score": 23,
              "content": "Yeah, I wonder how fun it was for his *mom*. I'm sure it was great for *him*.",
              "id": 184,
              "comments": [
                {
                  "score": 7,
                  "content": "Exactly! He was apparently fine, so everybody else was, too! \n\nBecause nobody else matters to this guy.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Yeah, imagine the tables turned for a moment, and her insisting he get circumcised for her feels.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Also maybe get it done but just don't tell him, don't tell him if you are or aren't then he can think in his head like she's still a working baby maker and he's happy, and she's happy because she's sterile. What he doesn't know can't hurt him imho.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1401,
      "content": "NAH.  \n\nYou are completely in your right to get a steralization.  However, your fiance is not in agreement right now and has the right to voice against it (key word: voice).\n\nI URGE you to do emergency couples consoling right now.  Talk about why you want to do this.  Let your fiance vent about why he doesn't want you to.  Let him feel heard.  Let him know what your final decision is.  Then tell him, \"I am going to be doing the steralization.  I would love for you to be there for me and to still marry me, but if you cannot see yourself being ok with this in the end, then I think we need to call quits on our marriage.\". Then go get the procedure done and it's up to your fiance to decide rather or not he stays too.  \n\nThis is a giant decision and it affects both of you extremely greatly.  Hopefully your fiance sees your reasoning and pain and understands.  However, this is the topic, kids, is one of the biggest reasons for divorce.  So plan for the worst, and hope for the best.\n\nI don't know why people are calling the fiance an asshole purely for saying he wants more kids.  This is a disagreement, as far as this post goes, he isnt refusing her to get the surgery or anything.  Hes just voicing his disagreement on the amount of kids he wants. He has even suggested a different form of birthcontrol for the time being.  \n\nDon't get the essure.  If it's what I think it is it's very unsafe and doctors urge you now not to get this.  Many women in the study got permanent damage to other organs, became permanently steralized, and were scarred for life.  Do not pick the essure!! (Changed coil to essure since there seems to be a different term for some people. Clarifying again, I am talking about essure and not an IUD).",
      "id": 188,
      "comments": [
        {
          "score": 237,
          "content": "I think the coil you're thinking of is Essure which is a way of sterilisation by inserting a metal coil into each Fallopian tube to cause scarring and block the passage of the egg and has been associated with many health problems. OP seems to be referring to 'the coil' which is a little T-shaped plastic device which sits in the uterus and can be removed again to restore fertility.\n\nJust wanted to point out the difference in case anyone wasn't sure and got worried.",
          "id": 189,
          "comments": [
            {
              "score": 151,
              "content": "Yes, I was talking Essure! What you're talking about is an IUD.  IUDs are really great and the next best thing after steralization.",
              "id": 190,
              "comments": [
                {
                  "score": 71,
                  "content": "Hormonal IUDs do have some issues associated with them though.  Just don't go into 'em blind.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Of course, but your doctor will have to tell you the risks before they give you one.  \n\nIUDs are extremely safe statically.  \n\nI actually had one that embedded in me (less than a 1% get this).  I was bleeding a whole lot (from not bleeding at all) and was hurting much more than normal.  I got in right away, got a sonogram, they took it out, and replaced it right away.  Never had an issue since then.  They think the only reason it happened to me is because I didn't close up as fast as others after induction (which ended in a C-section).  It's honestly not as scary as you might think.  \n\nThe main issue with IUDs is really just \"personal preference\".  Some people bleed other never bleed again, some people get worse cramps, others cramps are much less.  It just depends on what you're looking for in birthcontrol.  \n\nThere is also copper IUDs which are nonhormonal.  \n\nIUDs, once placed and stay in place for three months, have almost zero human error.  Unlike birthcontrol which completely relies on you to take it every single day.  It's definitely by far the most reliable form of birthcontrol that isn't permanent.  It's definitely the next best thing if you aren't quiet ready for steralization yet.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "The copper IUD has no hormones.  Just makes an environment that is not livable for sperm or fetus.",
                      "id": 193,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "I thought the coil was the fallopian tube thing, and the t-shaped things were IUDs.",
              "id": 194,
              "comments": [
                {
                  "score": 2,
                  "content": "A brief googling shows \"coil\" is another term for IUDs, as they have a coil of copper wrapped around the plastic body.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 47,
          "content": "100% this!  Also, do not pick the coil!",
          "id": 196,
          "comments": [
            {
              "score": 26,
              "content": "I second the hard no on the coil. It put my mom and several of her friends through terrible health problems and they've all had to have them removed.",
              "id": 197,
              "comments": [
                {
                  "score": 18,
                  "content": "I’m pretty sure they took them off the market for this reason if memory serves",
                  "id": 198,
                  "comments": [
                    {
                      "score": 4,
                      "content": "They took them off the market because of “reduced consumer  interest” and of course will never admit that it caused an unusual amount of complications.",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I posted my own comment about this not realizing you had also mentioned it - but there is a documentary about the coil on Netflix called \"The Bleeding Edge\" and told OP + their partner to watch it before making any decisions on sterilization. I figured I would reply to this comment as well to help spread the word.",
          "id": 200,
          "comments": [
            {
              "score": 6,
              "content": "There are purely surgical methods of sterilization. Cut and burn the tubes is tried and true and has none of the issues of the clips or the bands or Essure because it involves no medical device aside from standard surgical tools. There are still potential side effects as with all surgery but nothing is left in that can migrate or provoke autoimmune issues.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I feel like you are probably think of the coil placed in the Fallopian tube that causes scar issue.\n\nCoil is a colloquial term used in the UK (and possibly other commonwealth countries) to mean IUD.",
          "id": 202,
          "comments": [
            {
              "score": 21,
              "content": "[deleted]",
              "id": 203,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": ">I don't know why people are calling the fiance an asshole purely for saying he wants more kids.\n\nBecause on Reddit, in any discussion involving children, pregnancies, contraceptives, etc.. men are automatically assholes for even just voicing an opinion.\n\nOP literally only said that he just wants more kids and disagrees with her decision. **Nothing about that makes him an asshole.**",
          "id": 204,
          "comments": [
            {
              "score": 10,
              "content": "[deleted]",
              "id": 205,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": ">OP literally only said that he just wants more kids and disagrees with her decision. Nothing about that makes him an asshole.  \n\nExcept the part where she’s been miserable and in pain for *years*, had her mental health destroyed, and has expressed to him that she doesn’t want to go through this anymore and he doesn’t seem to care about any of that.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "yeah, you ARE an asshole if you decide your opinion has any  place in a discussion about someone else's body. For fuck's sake. LEARN THIS.",
              "id": 207,
              "comments": [
                {
                  "score": 2,
                  "content": "No you ARE not an asshole for having an opinion on something that heavily affects your relationship. It's ultimately her choice but he definitely has a right to voice his opinion.",
                  "id": 208,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "I agree. NAH. Your husband sounds like a really supportive partner, seems like you guys have had a lot of loss and a lot of love together. \n\nThe surgery is a very permanent decision. OP’s husbands main points as listed are valid. OP, you should research the risks of sterilization now vs. getting your tubes tied at a later date. Perhaps you could get on temporary contraceptive for now and revisit sterilization when you’re better healed- mentally and physically. If sterilization is truly what you want, maybe give him some time to come to peace with that or go to counseling fast to discuss why you need this- for your own peace and health.  \n\nAlso, get therapy or have more conversation together! You guys need it. Maybe your husband is scared of the loss of your “future child” and maybe he doesn’t fully understand what you’re going through- men will never go through all the toll of pregnancy and delivery, so he may not understand. Discuss adoption for the future, if you would consider that. A happy family, no matter the number, is stronger with the unity of the parents. Neither he or you should risk causing a rift, so you both should be at peace with your decision.\n\nYou deserve your peace and happiness and it will lead to your family’s happiness. Wishing you a speedy recovery!",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "In Europe they use coil for IUD. \n\nThere's zero reason to freeze any eggs. Sterilization does not affect egg production at all. It's simply a mechanical block mechanism to prevent natural pregnancy. OP could harvest eggs and carry a fourth child herself via IVF at any point in time in the future.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This one. This one right here. This is the answer I couldn’t articulate.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Anyone who doesn't agree with NAH is a giant asshole, themselves.\n\nShe is in no way an asshole for wanting to go through this procedure. He is **also** not an asshole for 1. voicing his thoughts and 2. suggesting the *very reasonable* option of waiting until after the pregnancy to make a decision.\n\nWhenever someone goes through a sterilization procedure it must be thought of as permanent, even if it's technically reversible. That's a huge decision to make. The husband is correct in that OP might be making a relatively hasty decision due to currently being pregnant and having back to back pregnancies. \n\nLet the pregnancy hormones subside. There are tons of methods and options of birth control that will virtually guarantee no more pregnancies until she can make a definite decision.",
          "id": 212,
          "comments": [
            {
              "score": 3,
              "content": "But if she's having a c-section, that is literally the best time to get her tubes tied. Otherwise, it's major surgery. She's been through four pregnancies. She's SURE.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "So pregnant women aren’t capable of logical decision making? So what if it’s permanent? It doesn’t sound to me like OP is too torn herself about wanting more.\n\nThree kids is plenty. It’s 2019, you dont need 14 backup children in case you lose most of them. At this point, she has the right to decide how many more fetuses she wants to carry. And she can make that decision pregnant or not.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Excellent idea",
          "id": 215,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 820,
      "content": "NTA. I’m so sorry for your loss.\nI hate being pregnant with a fiery passion, and I’m currently pregnant again. I love my kids, I love the payoff at the end, but damn I hate pregnancy.\n\nYou already have kids, you’re not dooming him to a life without children. Get those tubes tied.",
      "id": 216,
      "comments": [
        {
          "score": 390,
          "content": "I wish it was normalized to talk about pregnancy that wasn't so great. I met so many women who said they hated their pregnancy but they stay quiet because they're scared of being labelled as bad mothers.",
          "id": 217,
          "comments": [
            {
              "score": 205,
              "content": "I hate that. Pregnancy is hard. Anyone who denies this is ignorant. Women should get to complain about it as much as they want",
              "id": 218,
              "comments": [
                {
                  "score": 60,
                  "content": "In my experience it usually came from the women that had very good pregnancies. \n\nDuring my pregnancy I had a few coworkers that gave me the stink eye because I said I hated being pregnant. We discussed it, and come to find out they had awesome pregnancies. No morning sickness, or pains. Some didn't even know until 5-6 months into the pregnancy. Meanwhile I'm running like a madman to the bathroom to dry heave with a migraine that lasted 3 months. No joke, legit migraine that was there every day from the moment I woke, until I went to sleep. My doctor was concerned and scheduled me for an MRI and set me up with neurologist. They determine it was just a side effect from the pregnancy.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I just want to say, as someone who is 8 months pregnant with her first child, having a great pregnancy isn't a good reason to lack empathy. By all accounts, I have had an amazing pregnancy...very little weight gain (though I was already overweight), my feet aren't swollen, I only had morning sickness twice, for the first time, two weeks ago...my \"worst\" symptom has been fatigue and occasional backaches and heartburn. But I also don't like being pregnant! \n\nYes, I am looking forward to my future child, but I hate not being in control of my body, having the weird alien feeling of his movements, obnoxious heartburn and loss of appetite when I'm an avid food lover (actually, a bit addicted, if I'm gonna be honest), restrictions on working out when I had *just* accomplished losing 20 pounds right before pregnancy...etc etc. I've been fairly open about disliking being pregnant, and there are a few women in my office find it refreshing. I try to continue being open about my dislike of pregnancy because of this, since I'm already kinda considered a grumpy tomboy by half the office haha.\n\nI've found that in my instance, the most vocal ones that look down on talking about the bad side of pregnancy are the ones who consider it to be their ultimate goal in life, a sacred mission that they're fulfilling...something to be proudly stoic about. But then again, I live in the south, so people are heavily biased towards the \"barefoot and pregnant\" lifestyle.\n\n**EDIT**: Also my sincere condolences to the shit parts of your pregnancy, that SUCKS and is even worse when you're looked down on for sharing your struggles! I'm a big baby in comparison...I asked my husband how he would feel if this was our only child, because I hate being pregnant, and he very sweetly said he would be disappointed, but would understand and support me. I'm such a wimp haha.",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Nightmare, this is a nightmare. Every pregnancy thread on Reddit is terrifying lol (cause pregnancies are pretty terrifying tbh)",
                      "id": 221,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "That’s the absolute truth. Any time I bring up how miserable pregnancy is, older women look at me like I just announced my plan to sell the baby on eBay.\n\nOr worse, they give you the “just be grateful” spiel.\nI can be grateful and still hate gestational diabetes, thanks Gloria.",
              "id": 222,
              "comments": [
                {
                  "score": 35,
                  "content": "I am an older woman with three adult kids. I think it is awful when women go on about how wonderful pregnancy is (or should be.) It makes women who hate pregnancy feel like they are doing it wrong or missing out on something special or are bad moms. As for selling babies on ebay -- that's something I think I threatened to do multiple times with my own cherubs.",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Ohh \"just be grateful\" is the worst",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "I hated my pregnancy. Hated. It.   \n\nHad I known the complications I was going to suffer after, I would have never had a baby and opted for foster or adoption instead.",
              "id": 225,
              "comments": [
                {
                  "score": 8,
                  "content": "I've thought about this myself, as my fiance says she really does not like the idea of pregnancy, and given the state of the world and all the kids in the system, maybe we should adopt instead of adding another mouth to feed to the world and putting her through what could be hell",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Amen sister.",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "Pregnancy fcking sucks. I gained 45 pounds. With my second, my dr told me to keep my weight gain in check. Like...🖕lol\nI didn’t sit around eating cake & pizza. I couldn’t freaking walk long, much less try to exercise normally.\nGiant boobs, can’t breathe, everything hurts...yeah pregnancy is so beautiful 😂",
              "id": 228,
              "comments": [
                {
                  "score": 80,
                  "content": "I think of pregnancy as a whole like being the time I puked so hard in my front yard I peed myself (while pregnant). My dogs were so proud of me for peeing in my yard like a big girl, but I had no control over my bodily functions, was embarrassed and uncomfortable, and was covered in pee. These are the themes of pregnancy.",
                  "id": 229,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Why has no one commented on how supportive your dogs are? The best puppies.",
                      "id": 230,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Amen sister. Once with my first, I coughed (like a light cough) while peeing and ended up puking *in* my underwear and pants *at work*. That wasn't even the crappiest part of my pregnancies. I really wish I'd gone through the the litigation during my last c-section and am currently trying to convince my SO to get snipped. I have literal nightmares about being pregnant again and the anxiety is making our sex life miserable. OP is so NTA here, her husband truly has no concept. They need couples counseling but I'd argue she needs to be getting her tubes tied even more. PTSD from birth/pregnancy is a real thing.",
                      "id": 231,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "When my mom was pregnant with me, she pretty much just did whatever she wanted since I was her first. Gained 40 lbs. When my mom was pregnant with my younger brother, she tried to eat much healthier and exercise more until she physically couldn't. Still gained 40 lbs. When my mom was pregnant with my younger sister after that, she just ate whatever she wanted because she knew that no matter what, she would gain 40 lbs anyways. Pregnancy sounds fucking horrible.",
                  "id": 232,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It really is uncomfortable, and a very long 9 months of stress & anxiety :(",
                      "id": 233,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Oh my lord the not being able to breathe!! That was probably tied for the worst part for me. Cant sit this way cant lay that way. I was always struggling to breathe and stay out of pain at the same time. The worst.",
                  "id": 234,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I couldnt walk up a single flight of stairs without sounding like I sprinted half a mile lol!\nI had to give a presentation, and I was so nervous like usual. I couldnt breathe well, my mouth was dry, I had awful heartburn so I was coughing & clearing my throat a lot.  My teacher thought I was either going to die or give birth in the middle of class lol",
                      "id": 235,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "You're right about that.  This is the first time I've been willing to admit I hated being pregnant.  Trimester one and two weren't so bad but once I got really big it became awful.\n\nI broke my pubic bone when I was younger and getting up in the mornings was SO frickin painful because of that old injury.  It took me forever to get out of bed it hurt so bad.  \n\nWhen he flipped to his head down position I had to be put on painkillers it got so bad :/",
              "id": 236,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Personally, I loved the acid reflux I had when I was pregnant. It was also great not being able to sleep because I developed restless leg syndrome. And that time I got sick and threw up and peed at the same time? Good times.\n\nPregnancy sucks.",
              "id": 237,
              "comments": [
                {
                  "score": 3,
                  "content": "I had restless leg syndrome too! I didn't sleep for two weeks straight, then once i started taking iron supplements it went away. So much fun...",
                  "id": 238,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I wish they didn't keep yammering that it's sunshine and daisies whenever I say I'm not planning to be pregnant ever. It's like they want their misery to have company, really.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I find it refreshing seeing women here say it. My coworker and I were talking about how terrible pregnancy sounded and a male coworker came over. He’s about to have his first kid next week. He said it wasn’t that bad as we think and I all the negative symptoms don’t happen to everyone. I’m like ok well you sacrifice your life like a breeding cow for a yea and tell me how great and awesome it is.",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I feel this so personally. I hate pre eclampsia and I felt terrible for months. They didnt find it til I was 34 weeks but it turns out I had been suffering through it for months. Swollen, extra tired, massive weight gain and having to carry that around. All pregnancy symptoms were just magnified by 10, nausea that never left, hips and pelvis that were so painful I could hardly walk, migraines. It was horrible. But people tell you just to be grateful, \"just wait til shes here, its only going to get worse\". People are horrible.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "The worst is hearing condescending comments from guys at my office.  During my pregnancy, people would of course make small talk like “how is the baby feeling today?” or “how is the pregnancy going?” while waiting to use the microwaves or coffee machines.  Usually, I would just smile and give some generic happy response, but occasionally, I would say, “my back is starting to kill me!” or “can’t wait until my insomnia dies off”, and I would actually get these patronizing, “well, it will be all be worth it in the end, you’ll see.  You are growing a life inside of you, so it isn’t easy but it’s such a great thing!”\n\nThese guys weren’t even married and didn’t have kids. What, I’m not allowed to complain at all during my 9 months of this?",
              "id": 242,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "I’m with you, being pregnant sucked. I have four living kids and had several early losses, I love being a parent but being preggers is something I don’t miss!",
          "id": 243,
          "comments": [
            {
              "score": 18,
              "content": "I’m very very sorry for your early losses. I couldn’t imagine going through that and I hope you’re ok!",
              "id": 244,
              "comments": [
                {
                  "score": 4,
                  "content": "Thank you for your kindness, I am, it was a long time ago now, but it’s part if my story.",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Seriously, they will have had 4 kids total once this one is born (I can’t imagine losing a kid, though, and I’m so sorry for that). I agree she’s very reasonable to want to get her tubes tied after this.",
          "id": 246,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 407,
      "content": "NTA. Fer cryin' out loud, fingers crossed, you're going to be parenting three children. What is he expecting, exactly?",
      "id": 247,
      "comments": [
        {
          "score": 162,
          "content": "That she'll take care of all of them while he's off to work, probably.",
          "id": 248,
          "comments": [
            {
              "score": 70,
              "content": "Boy, this comment didnt age well at all per OPs edit.",
              "id": 249,
              "comments": [
                {
                  "score": 26,
                  "content": "Yeah, it didn't.\n\nI was arguing with someone in the comments over petty speculations and accusations, but as soon as I read OP's edits, my anger and desire to be right and have the last word disappeared. I thought \"wth am I doing here? Who cares about this petty shit? Why am I fighting someone over this?\".\nI just...let it go.",
                  "id": 250,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "Lol nailed it",
              "id": 251,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 257,
      "content": "NTA\n\nUltimately this comes down to you making a decision about your own body.  It was good that you brought you SO in to have a discussion about it, but him being against it doesn't mean you can't do it.  He doesn't get final say on anything regarding your body, only you do.  You've been pregnant for over a year, dealt with a stillborn child (I'm sorry, my condolences).  Did he give any reasons for why he's so against it?",
      "id": 252,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 257,
      "content": "[deleted]",
      "id": 253,
      "comments": [
        {
          "score": 57,
          "content": "Adoption _can_ be an option for many people, but it isn’t always. If it’s not an option for OP and/or her fiancé, then getting sterilized would affect their ability to have more children. \n\nI agree with you that it’s ultimately her decision. But I think NAH because it sounds like her fiancé merely voiced his opinion. I didn’t get the impression that he’s angry or trying to coerce/manipulate her into postponing.\n\nETA: it kind of baffles me a little that so many people say, “just adopt if you want a fourth child”. It’s not that easy nor that simple.",
          "id": 254,
          "comments": [
            {
              "score": 103,
              "content": "Tbh, if you can't adopt, you most likely can't properly support four kids anyway.\nThis is coming from someone who was adopted, plans to adopt one day, knows many people who have adopted and given children up for adoption (of different races, sexualities, ages, classes, locations everything), and helps run events for adoption agencies.\n\nUnless by \"not an option\" you mean they just don't want to.\n\nYes it can be costly, time consuming, and difficult, but so is conventional childbirth? Monetarily, especially in the US, hospital costs for a C-section (and raising a kid in general) are already super expensive, and there are ways to help with adoption costs (grants, etc) and fostering can be free. Agencies will evaluate based on your readiness and ability to raise another child, if you consistently get no's from everywhere it's for a reason and you maybe shouldn't have that extra kid in the first place. Harsh truth.",
              "id": 255,
              "comments": [
                {
                  "score": 12,
                  "content": "Hello fellow adoptee\n\n>Unless by \"not an option\" you mean they just don't want to\n\nI guess I meant “not an option for whatever reason.” \n\nIIRC, a c-section in the US costs $7,500-$14,500 (depending on the state and health insurance). \n\nTo the best of my knowledge, the average cost of domestic infant adoption $20,000-$40,000 (though please correct me if I’m mistaken). Do grants and tax credits lower this cost so it’s at least somewhat comparable to the cost of a c-section?\n\nTrue, fostering is free. But I don’t think everyone is cut out to be a good foster parent (or adoptive parent, for that matter).\n\nI think agencies (rightfully) have a relatively high bar for prospective adoptive parents to meet. Depending on the parents’ financial lifestyle, I could see a situation where they could comfortably raise a fourth kid, but be rejected by an agency.",
                  "id": 256,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "....Neither is pregnancy. Let alone a 5th caesarian section...",
              "id": 257,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "You're correct that adoption isn't a possibility for everyone, however, OP hasn't indicated that it wasn't a possibility. Additionally, while the process is lengthy and difficult if OP and SO seriously wanted additional children, it is a possibility along with frozen eggs for surrogacy. However, even that can be difficult.",
              "id": 258,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Or maybe get some eggs frozen so if OP does change her mind there is still the option. Maybe surrogacy since if seems OP has some really tough pregnancies.",
          "id": 259,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 232,
      "content": "NTA\nYour body to do with as you wish.\n\nYou have 2 children with a third on the way and feel that’s enough. Your hubby cannot stop you and TBH getting the tubes tied during the Caesarean is the best time to do do it when it can be done easily without having to make further appointments for the sterilisation.\n\nTell the surgeon to do it.",
      "id": 260,
      "comments": [
        {
          "score": 27,
          "content": "This should be higher up than it is, because it’s actually not an additional surgery if you’re getting the Cesarean section; it’s done after the baby is delivered and they’re putting everything back to rights. I had my tubes tied after my third C-section, and it honestly didn’t take any longer for a section + tubal ligation than it did to deliver the other two kids.",
          "id": 261,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This. \n\nIt is a minor surgery if you're already having a c-section.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I had my tubes tied after my second csection. It took maybe 5 extra minutes and I noticed zero difference in my recovery.",
          "id": 263,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}