{
  "post content": "Last Friday I made plans with a girl that I met on Bumble to meet up and go kayaking as a first time hangout. There wasn't much prior discussion as to what either person was interested in or looking for out of the meetup. It's worth noting that both her profile and mine indicated the \"Don't know yet\" category as to why we were on the app. \n\nSo we get around to hanging out and get on the water. Everything is good, things are very flirty but also fun. It certainly all felt normal, natural and cool. We made references to a show we both knew quite a bit of and initially bonded over when chatting through the app. \n\nEventually, it starts to get dark and we decide to head back to land. As we're headed back over, the topic of \"well what are you looking for?\" finally rears its gnarly head out. She talks about how she had just gotten back on \"dating apps\" and realistically wasn't all that sure. I explain how I'm still relatively new to the area (like a year) and don't see my current situation as anything permanent. This goes over fine and just about offers to introduce me to her friends in the area. \n\nAs we get back on land and begin to load up the kayaks on her car, the conversation comes back to being friends. She nearly blurts out \"what about friends with benefits?\" to which I indicate that I'm not opposed but wouldn't want it to conflict with anything further. Things get the awkward, first time meeting question of whether or not to kiss the other person. We share a clumsy kiss leading to a second.\n\nAfter that, we head our separate ways and I get back. The discussion shifts into a bit more of a hookup or certainly a fwb status. We exchange a nude each to which the response turns into how we should have gone home with one another that evening. Come the next morning, I play it cool but talk about trying to make plans to hangout again. She gets back to me a bit later in the day and proceeds to say \"I don't want to be friends, and I don't want to hook up, I think I want a relationship\". \n\nNaturally, my instincts go to think that I've messed something up and so I ask if there's anything I've done wrong or the like. She tells me no and proceeds to say that everything that transpired was a way of her past that she was over and trying to move past. OK, I get that. I tell her that its cool but I don't understand why friends move off the table, after she explicitly said that \"it's always good to add more friends\". \n\nNow, I should mention that meeting up with this girl was like striking gold. She was cool, genuine (or so I thought) and we had a lot of good stuff in common. So, while I wasn't fully open to the idea initially of dating, I extend the olive branch because I was genuinely wowed by her (for this, I'm sure I'm the A-hole). I get a \"lemme think about it\" which ultimately led to \"I don't want to pursue anything\". \n\nSo now I'm sitting here, after a whirlwind weekend of all of this, asking myself AITA for just trying to be friends and things moving in a weird way?",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "NAH\n\nI mean you're both looking for different things, but I'd personally say reading the way you talk about her I think that letting this one go sounds like a mistake. I say change your plans and date the girl.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "Well I tried to offer the olive branch and say \"hey, I'm cool with trying to date\" to which I got the \"I'm not interested in pursuing ANYTHING with you\" which meant even a relationship soooo",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "Sucks mate. Some things just weren't mean to be then. Still no assholes here, dating sucks, but it's worth it in the end.",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NAH. She isn't looking for friends or a hookup, she's looking for a relationship. You're not looking for a relationship. I'm not sure how this new fangled bumble works in terms of saying what you're looking for, but whatever the case there's no obligation for you to start a relationship with her just like there's no obligation for her to want to be just friends with you or hook up with you.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Your not the asshole. You tired to be as upfront and honest as you could and she either wasn’t the same with you or quickly changed her mind and couldn’t handle not getting exactly what she wanted when she wanted it. I’m sorry you feel that you lost out on a connection with this woman but if this is an accurate representation I think your better off. If she changes her mind and feels that quickly from friends to fwb to relationship to I hate you I sounds like an relationship would have been a lot more of the same. Best of luck Sir.",
      "id": 6,
      "comments": [
        {
          "score": 1,
          "content": "Yes, that’s what I gathered also.",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\nLast Friday I made plans with a girl that I met on Bumble to meet up and go kayaking as a first time hangout. There wasn't much prior discussion as to what either person was interested in or looking for out of the meetup. It's worth noting that both her profile and mine indicated the \"Don't know yet\" category as to why we were on the app. \n\nSo we get around to hanging out and get on the water. Everything is good, things are very flirty but also fun. It certainly all felt normal, natural and cool. We made references to a show we both knew quite a bit of and initially bonded over when chatting through the app. \n\nEventually, it starts to get dark and we decide to head back to land. As we're headed back over, the topic of \"well what are you looking for?\" finally rears its gnarly head out. She talks about how she had just gotten back on \"dating apps\" and realistically wasn't all that sure. I explain how I'm still relatively new to the area (like a year) and don't see my current situation as anything permanent. This goes over fine and just about offers to introduce me to her friends in the area. \n\nAs we get back on land and begin to load up the kayaks on her car, the conversation comes back to being friends. She nearly blurts out \"what about friends with benefits?\" to which I indicate that I'm not opposed but wouldn't want it to conflict with anything further. Things get the awkward, first time meeting question of whether or not to kiss the other person. We share a clumsy kiss leading to a second.\n\nAfter that, we head our separate ways and I get back. The discussion shifts into a bit more of a hookup or certainly a fwb status. We exchange a nude each to which the response turns into how we should have gone home with one another that evening. Come the next morning, I play it cool but talk about trying to make plans to hangout again. She gets back to me a bit later in the day and proceeds to say \"I don't want to be friends, and I don't want to hook up, I think I want a relationship\". \n\nNaturally, my instincts go to think that I've messed something up and so I ask if there's anything I've done wrong or the like. She tells me no and proceeds to say that everything that transpired was a way of her past that she was over and trying to move past. OK, I get that. I tell her that its cool but I don't understand why friends move off the table, after she explicitly said that \"it's always good to add more friends\". \n\nNow, I should mention that meeting up with this girl was like striking gold. She was cool, genuine (or so I thought) and we had a lot of good stuff in common. So, while I wasn't fully open to the idea initially of dating, I extend the olive branch because I was genuinely wowed by her (for this, I'm sure I'm the A-hole). I get a \"lemme think about it\" which ultimately led to \"I don't want to pursue anything\". \n\nSo now I'm sitting here, after a whirlwind weekend of all of this, asking myself AITA for just trying to be friends and things moving in a weird way?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH You're moving at a pace that's comfortable too you and she knew what she was getting into.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH\n\nBut is sounds like you two are overthinking things.  There is no need to label things on the first date.",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. You are not obliged to be in a relationship with anyone. Your life. Your choice.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH.\nDon't go into something you don't want to, and she shouldn't either. You're not an AH for wanting to keep it at friends, but she didn't think that was an option after sleeping on it. It's just the way it goes. \n\nA bit of a shame, though, since you two seem to be excellent at communicating and actually hit it off. Sometimes the timing just isn't right.",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "I'm just bewildered still about how she immediately wanted to cut ties after this date. Especially with how well we hit it off. It just makes me feel like I did something wrong and I'm having a hard time shaking the feeling.",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": "I suspect it might have been the opposite. She really liked you and wanted to give it a serious go instead of something casual. She talked about having a history of casual relationships which she wants to step away from. So you got the choice of dating or nothing because that's what she was willing to give, not because you made a mistake.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "She sounds like she switched what she said she was looking for a lot? And you tried to adjust but it took a second. I wouldn’t worry about it. NTA.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Couldn't follow this whatsoever.",
      "id": 17,
      "comments": [],
      "relation": "No"
    }
  ]
}