{
  "post content": "Throwaway because my sister knows my account.\n\nContext: I (16F) am really into Harry Potter and I recently built the Astronomy Tower and the Hogwarts Express with two Lego sets. We have 4 bedrooms in my house. My two younger sisters, my parents, and I all have our own. For reasons I would rather not specify, my room is busy with another person. I slept with my youngest sister (5F) at first because she has 2 beds on her room. I slept terribly those 2 nights because the air conditioner didn’t reach my side and I couldn’t lower the temperature because of her, so I was a sweating mess.\n\nLast night, we all said goodnight and prepared to sleep, but I first asked my mom if I could sleep with my sister. She said yes. (Note: we have already slept on each other’s rooms without asking permission so I thought it was fine) My sister got mad and threw a tantrum, I was silent the whole time until my mother got sick of my sister’s complaints and blew off.\n\nDuring her anger, she slid her arm in front of my Lego building and made them fall and break into pieces. My heart broke because it took me a lot of patience. After that, both of my parents sent us to sleep. Yes, in my sister’s room. My sister started crying saying that she knew it was her fault, but I should have just sucked it up and slept all sweaty.\n\nThis morning, I was ignoring my mother until I eventually told her I was pissed off about the Legos. She apologized but I said “I won’t forgive you until I see both sets are just like I left them, and I won’t rebuild them, so its up to you.” \n\nShe got mad that I was being “cynical” and is now ignoring me too. My sister thinks I went too far but I think it was fair. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 34,
      "content": "Clarification: why are you mad at your mother? I missed what she did wrong.",
      "id": 2,
      "comments": [
        {
          "score": -25,
          "content": "She knocked both of my already built lego sets to the ground even though I wasn‘t the one complaining.",
          "id": 3,
          "comments": [
            {
              "score": 39,
              "content": "Your mom broke them? From the way you wrote your post it sounds like your sister broke them",
              "id": 4,
              "comments": [
                {
                  "score": -6,
                  "content": "It was my mom, sorry if the post was unclear. She got mad because of my sister’s complaints and since I’m the older one I got most of the anger.",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Okay. That does make your anger a little more understandable. Your mother has apologized. Maybe you could rebuild the Legos together. My son used to love Lego and we spent some happy hours building the large sets together (the Star Wars Death Star, the Taj Mahal, and several others). If you worked together you wouldn’t feel like you had to fix it yourself, and you and your mother might have some nice bonding time. Just a suggestion.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 24,
      "content": "YTA- girl its lego, you pull those suckers apart and you rebuild stuff. She didn't break it, it just came apart and can be put back together.  If you already had permission to sleep in your sisters room then you only asked to annoy her.  Sleep on the couch if your so worried about being sweaty.",
      "id": 7,
      "comments": [
        {
          "score": -1,
          "content": "Her mother deliberately destroyed something that she worked hard on because her sister was complaining. As someone who has spent days on the same giant lego sets that OP is talking about it takes a lot of time and energy putting it together just to have someone break it because they are mad at someone else. NTA OP your mother and sister are. Also did you dad do anything during this because you haven’t mentioned him and that is not something he should have let slide",
          "id": 8,
          "comments": [
            {
              "score": 13,
              "content": "I dunno if it was deliberate. I didn't even know that it was the mom who broke them until I saw OP's comments.\n\nAlso, if the sister doesn't want OP in her room, why is she forced to sleep with her? I don't understand this post at all.",
              "id": 9,
              "comments": [
                {
                  "score": 4,
                  "content": "OP said on a few other comments that it was on purpose and her mom looked right at her before knocking them off.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I didn't check the comments. It wasn't in the OP. Honestly the post was confusing to me.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23,
      "content": "ESH it sounds like the energy in your house is just… a lot. You all sound so angry at each other.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "But did she knock them down on purpose? or was it accidental?",
      "id": 13,
      "comments": [
        {
          "score": 8,
          "content": "On purpose, she was literally making eye contact with me while doing it.",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "NTA then, if it was accidental it was still wrong because it shows a lack of control from the adult in the situation but done out of spite is a million times worse, I'm sorry about it, just keep in mind you might need to build them back yourself because it sounds a lot like your mom will not do it and you do really need your own room back.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA but I think we need more information. Your wording was quite confusing. \n\nSo you are forced to stay with your younger sister (5 years old), but have to ask her? Or is this a different sister?\n\nIm sorry you will have to rebuild your lego sets. It sucks, but building is part of the fun. Not a bad life lesson. Some times things fall apart and it isnt your fault, but you still have to rebuild.",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "YTA. You can't break Legos.",
      "id": 17,
      "comments": [
        {
          "score": 4,
          "content": "It was the mum that broke it. In a rage",
          "id": 18,
          "comments": [
            {
              "score": 3,
              "content": "Sounds like a bunch of bratty kids all around. Knocking Legos off of a shelf is small potatoes. I also tend to take people's accounts of what happened with a grain of salt.",
              "id": 19,
              "comments": [
                {
                  "score": 2,
                  "content": "Abusive is what it is. She's the adult. Throwing a child's creativity across a room because she is angry is abusive",
                  "id": 20,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You're adding to the details. Mom knocked them off of a shelf. The OP didn't say she threw them across the room.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Wait why is everyone saying y.t.a. That was pretty shitty of your mom to do.",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "ESH. A simple request should not have resulted in a tempter tantrum. If I was your mom I would ask if we could build them together as an apology.",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I might be the asshole because I could build them again but I don’t think its fair. Besides, my sister says I am the AH so I want an unbiased opinion.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 24,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA. They’re legos. They go back together. And tbh if you had given me that ultimatum, it’d be radio silence from me and *possibly* a trash can full of legos. She is the parent. She brought you into this world, changed your shitty diapers and (I’m assuming) keeps a roof over your head with a kitchen full of food. You are whining over legos. You are not the same. For clarification your very existence is due to your parents. Unless your parents are selling your school books for meth while you fend for yourself, buck up, treat your mother with some respect and clean up your *toys*.",
      "id": 25,
      "comments": [],
      "relation": "Attack"
    }
  ]
}