{
  "post content": "I (25M) am quickly rising in my industry and I've definitely been noticed in industry specific magazines/websites, to the point of becoming known in it. Can't exactly say what the industry is, but I'll say that it's NOT entertainment related. Regionally this industry is quite known and important.\n\nAnyway I was interviewed by one of the websites which would publish my interview in print too. They asked me many questions but one of them asked about my experience in High School.\n\nLong story short, I fucking hated High School. I was an Ugly Duckling so High School represented a tough time. I was picked on a bit. Well I said in the interview \"Honestly? My High School sucked. Teachers sucked, every student I came across there, except the 2 friends I had were cruel too. Terrible terrible people. I succeeded because of my own personal power and strength\"\n\nWell this interview got around my hometown and a girl (25F) I knew from High School, who was one of thr condescending girls to me and who would call me names messaged me on Facebook. She said that my interview was unfair and lies. I asked her how was my experience a lie, she said that my behaviour didn't exactly lend itself to kindness.\n\nSo I looked back at my old Facebook posts and it was true that I did come across as the iamverysmart annoying type, however that doesn't excuse or justify being mean to someone so I responded back to her \"I've noted your objections, but I ain't retracting or changing anything. Deal with it\" and she responded calling me fucking asshole.\n\nI looked at her profile and it doesn't seem she did much with her life. I just went on with my life but I got some more angry messages. I'm still not gonna change it. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 76,
      "content": "ESH.\n\nYou're an asshole because you sound like a smug-self-centered douchebag with comments like \"I succeeded because of my own personal power and strength\" and \"it doesn't seem she did much with her life\".\n\nThey were assholes if it's true that they bullied you.",
      "id": 2,
      "comments": [
        {
          "score": -51,
          "content": "The thing is, its true. I dont credit teachers or my parents, because they were useless.",
          "id": 3,
          "comments": [
            {
              "score": 60,
              "content": "> The thing is, its true. I dont credit teachers or my parents, because they were useless.\n\nThe fact that you're completely oblivious to the douchiness of dropping a comment like that and the fact that you're selectively responding to my comment with further self-aggrandizing rationalizations makes me think that you're a narcissist.\n\nAgain, ESH with emphasis on YTA.",
              "id": 4,
              "comments": [
                {
                  "score": 9,
                  "content": "To be fair, while I agree OP sounds like a douchey narcissist, without knowing all the facts you can't say whether or not he's totally self-made, it does happen.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5,
                      "content": "> To be fair, while I agree OP sounds like a douchey narcissist, without knowing all the facts you can't say whether or not he's totally self-made, it does happen.\n\nI've never questioned that?",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -40,
                  "content": "I'm not oblivious it's just the truth....only I am responsible for my own success. I put in the work. Noone helped me, therefore I get all credit.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 24,
                      "content": "> I'm not oblivious it's just the truth....only I am responsible for my own success. I put in the work. Noone helped me, therefore I get all credit.\n\nThe fact that you're once again selectively responding to my comment with further self-aggrandizing rationalizations makes suspect narcissism even more.\n\nNarcissists are almost completely unable to see their flaws or how they are partly or fully at fault, and are attracted to speaking of themselves in flattering ways.\n\nYour behavior in this thread is textbook narcissism.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "From your statements here I agree with the girl that your personality does not lend itself to kindness. If you think that everyone you’ve ever encountered - students, teachers, parents - are all assholes, maybe the common denominator is you. \n\nAlso “I noted your opinion but won’t be changing it” also reads as iamverysmart.",
              "id": 9,
              "comments": [
                {
                  "score": -9,
                  "content": "Being iamverysmart doesn't justify unkindness.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 15,
                      "content": "It depends. Iamverysmart can show a lack of social understanding, condescension, making others feel small or worthless, constantly praising yourself at the benefit of others. All those things are unkind.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Doesn't justify kindness either. Reap what you sow.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 47,
      "content": "This reads like a revenge fantasy written by a pissed off teenager in detention, and smells like a shitpost.\n\nYTA",
      "id": 13,
      "comments": [
        {
          "score": 10,
          "content": "Lol no kidding. It seems really contrived, and if it is somehow real then OP is absolutely an asshole.",
          "id": 14,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Reminds me of that super whiny Taylor swift song",
          "id": 15,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 33,
      "content": "I was gonna say nta, but you lost me in the final paragraph. Pointing out that it looks like she “hasn’t done anything with her life” makes it seem like YTA. You guys are only 25 and how can you really tell anything from stupid-ass Facebook. This last part really rubbed me the wrong way",
      "id": 16,
      "comments": [
        {
          "score": 9,
          "content": "YTA I just wanted to say this. I was 100% on board until that last little snipe he had to get in.",
          "id": 17,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22,
      "content": "YTA — Your description, here in the post, of high school sounds like a perfectly reasonable account. You describe high school as a tough time and how you didn’t fit in and had a tough time. However, what you describe as responding during the interview is quite different. That account externalizes all of the blame for the time into others’ actions and character. \n\nThere is a huge difference between “I was picked on a bit” and “everyone except two people were terribly cruel”. A huge difference between “it was a tough time for me” and “all my teachers and classmates were terrible people”. \n\nI think YTA for painting everyone in such a broad and uniformly bad light and making your comments about how they were bad rather than about how you felt about the time. You are free to discuss specific issues or incidents, but it simply isn’t actually possible that everyone at your high school was “terrible”, or that absolutely everyone sucked. It is possible you feel this way, but that is an effect of your memories of the time—your experiences of school—not their reality of being terrible. \n\nLastly, you can describe your success as being your own (as being a response to how badly you felt in school, even) without tearing everyone else down. Furthermore, I don’t think it’s particularly relevant how the people who have critiqued your description have lived their subsequent lives — especially with regard to your judgment of their level of “success”. That also reads as quite a dickish thing to say.",
      "id": 18,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "Hard to say...you're entitled to your opinion but you could've been more diplomatic.  Just because you had a shitty experience doesn't mean everyone there was an AH, teenagers aren't exactly known for their great judgement and even you said looking back you came across as a smart ass. Either way, as you said, doesn't mean bullying is warranted, so I guess I'll say ESH",
      "id": 19,
      "comments": [
        {
          "score": -7,
          "content": "Agreed teenagers aren't the best, but I don't forgive them. They're not entitled to my forgiveness.",
          "id": 20,
          "comments": [
            {
              "score": 8,
              "content": "I'm not saying they are, but you could've gotten your opinion across in a less inflammatory way.  \"My high school experience was bad(or sucked if you'd prefer). With the exception of a couple good friends, I was bullied and there wasnt nearly enough pros in that school to balance out the cons.\" \n\nYou can't really expect not to get some blowback when you trashed it the way you did. Maybe you're NTA but people are protective of their hometowns, you shouldn't be surprised that people were upset.",
              "id": 21,
              "comments": [
                {
                  "score": -8,
                  "content": "I come from the same hometown, and view it with disdain. I guess because I now live in a major metro city, I just don't care for my hometown anymore.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yeah but the point isnt how much better off you are now its that you upset other people by your words and whether or not its fair that they're upset.  It's hard to say it's fair to put down people as hard as you did and then come back confused as to why they're upset.\n\n I said people in general are protective of their hometowns not you are, because you obviously aren't.\n\nWhere you live now has nothing to do with how you view your hometown, your hometown experiences do. I live in a major metro area now too opposed to my hometown but I still view it was fondness.  You had a bad time growing up there so you chose to move on and feel better looking at it with disdain.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "This is a sub for people willing to reflect themselves and to think about their mindset and behavior.\n\nReading your comments, you are appearantly not able or willing to do so. Thus, it seems like a confirmation seeking gone wrong.\n\nPlus, if you are a person of public interest, you should express yourself in a more diplomatic and mature way than you did on that interview. Such statements are not only AH, but will also damage your career in the long run.\n\nYTA\n\nYour comments do read like you are still in high school.\nYou may seek for professional help to overcome your past or you may end in a lonely, dark future.",
      "id": 24,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "ESH you CANT change it now, that’s the thing about the press. While I sympathize that your high school experience included bullying, which is never ok, you yourself admitted to not being very nice either and you kind of sound like a dick when you say things like “I succeeded against all odds in spite of my high school” blah blah blah. No one likes a whiny Tina sitting up on her high horse. Try to be more humble or at least try to SOUND more humble. \n\nIf you’re truly going to be in the public eye, stop responding to messages on Facebook from people who were mean to you or who are taking issue with literally anything. Don’t take the bait. And let this be a lesson to you that two wrongs do not make a right because it this exact situation it leveled everyone out and you are just as much of an asshole as her.",
      "id": 25,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH the hometown girl for being a former bully and you for being totally lacking in emotional maturity. you're not obligated to change it, but unless high school experiences are relevant to your field of work that was a softball question and you should've just given a bland statement about how it wasn't great. i'm guessing the vast majority of people that read the interview didn't give a shit about your high school experience.",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Dude, I was an inbetweener at school too, get over it. All you had to say to that girl was “it’s in the past I really don’t think that much into it, but I had to answer the question and that was my honest answer” but instead you had to give her a rude response. \n\nYou’re not TA for saying what you did about the school, YTA for your response. Why are you going to let an argument happen over something that happened in school? You don’t have to be over it or forgive her, just move the fuck on.",
      "id": 27,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "SHPO get out of here with this shit.",
      "id": 28,
      "comments": [],
      "relation": "No"
    }
  ]
}