{
  "post content": "\n\nTitle sounds messed up, but I'll, give background.\n\n2 months ago I (F16) was diagnosed with diabetes. Yeah, it sucks, not going to lie. Ever since I was a kid, I was obese. I decided that since I'm earning my own money, I can buy my own healthy food. I'm saving also up for a bike. I walk/jog almost everyday and since I found out I had diabetes, I lost 8lbs!\n\nI was proud of myself. Not sure if 8lbs is good for 2 months, but I am happy with it.\n\nI told my mom with a smile on my face, and she said, \"Why are you trying to lose weight now? You already got diabetes. It doesn't even matter and you'll probably give up.\" (Not verbatim, but that was the jist and now looking back she was probably joking).\n\nWell, that made me cry and break down. \n\nA week and a half later, my mom announced to our family (at a birthday party) that she was going to quit cigarettes for good. I remember what my mom said to me so I laughed to my sister and said, \"no she isn't.\" \n\nWell, my aunt overheard and told my mom, and my mom came up to me, really mad. She confronts me and I said, \"you've been smoking for 12 years now, the damage has been done, why quit now?\"\n\nNow, I would never say that in private and I only had confidence because we were in a public area. She couldn't do anything to me, so she started to cry. Everyone called me an asshole for making her cry and ruining the party.\n\n\nI know what I said was fucked up and I didn't really mean it (I told her this afterwards, but didn't say sorry), so AITA?",
  "id": 1,
  "comments": [
    {
      "score": 216,
      "content": "First of all, congratulations on the weight loss! Eight pounds is a significant amount of weight. Go to a gym and pick up an eight pound weight. It’s pretty heavy. You’re addressing your health very intelligently and I’m proud of you. About a pound a week, give or take, is exactly what a young woman your age should be losing and that’s exactly what you’re doing. Keep it up!\n\nYour mother was nasty to you and she was also wrong. Diabetes doesn’t have to be a life sentence. You can not only manage it but reverse it. Losing a lot of weight and eating sensibly is the way you usually get your blood sugar levels down. Since you’re a minor, I’m surprised that your doctor didn’t tell her that. If you keep up your health routine, your A1C levels will probably be down significantly and may even return to normal level. So, your mother wasn’t even correct in her little jab. If she was joking, all I can say is that she has a lousy sense of humor. Her job is to be a supportive mother, not a stand up comic.\n\nNo, you shouldn’t have said what you did at the party but I see why you did it. Ignore everyone else’s judgment: they don’t know the backstory. \n\nI usually don’t say this but I don’t think you owe your mother an apology. It was good for her to get a little taste of her own medicine. Now that arrows have been slung on both sides, just let it go. Both of you were wrong so ESH. But, your mother was a lot more wrong than you were.\nShe’s the adult.",
      "id": 2,
      "comments": [
        {
          "score": 33,
          "content": "Not entirely true. If she has type 2 she can reverse it but because of her age she might have type 1 (and actually has nothing to do with being obese) which can’t be reversed.",
          "id": 3,
          "comments": [
            {
              "score": 33,
              "content": "Because she mentioned her weight, my thinking was Type 2. Maybe she’s just assuming. So far, whoever her doctor is seems like he’s got pudding for brains because she didn’t seem to have all the facts and her mother certainly doesn’t because she let that nonsense spew out of her mouth. The patient shouldn’t leave the room without knowing everything pertinent about their condition.",
              "id": 4,
              "comments": [
                {
                  "score": 12,
                  "content": "I get it, I just wanted to clarify because a lot of people lump us together and believe a “cure” for type 2 is also a cure for type 1s. \nHer doctor most likely told her she’s just giving us a simple back story, you’d be surprised at how many parents are educated on it and are still ignorant or like op said, she was just “joking”",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "A very well written and thoughtful comment, I agree completely !",
          "id": 6,
          "comments": [
            {
              "score": 6,
              "content": "Thank you. That’s sweet.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": "Agree with all of the above, but also what kind of gym has 8 lb weights lol",
          "id": 8,
          "comments": [
            {
              "score": 7,
              "content": "Ones with yoga studios or similar tend to have lighter weights, though I usually see 5/7/10 sets",
              "id": 9,
              "comments": [
                {
                  "score": -2,
                  "content": "Exactly, I’ve seen those but never 8 lb",
                  "id": 10,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I’ve been working out for the last 13 years and I’ve seen 8 lb weights at all 6 gyms I’ve been a member at",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Every gym I’ve ever belonged to had 3, 5, 8 and 10 lb weights along with the heavier ones.",
              "id": 12,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 69,
      "content": "NTA. I'm not even giving an ESH because you said it in public. She's your mother and had no right to put you down like that, even as a \"joke.\" You're only 16, and I think instead of joking, she needs to consider what *she* did to contribute to your condition. Also, just some fun facts:\n\n* Depending on the nature of your diabetes, it *can* enter remission (or at least be managed more easily) with diet and exercise, so long as it's monitored properly by your doctor.\n* 8 pounds is *excellent* for 2 months. Hell, I would have said 2 pounds is excellent for 2 months. Keep it up! (Don't be discouraged if you ever hit a plateau, that's apparently normal. Jordan Syatt has a YouTube video about it)\n* 15 years after a person quits smoking, their lungs will be virtually the same as a non-smoker's. So there is definitely a reason to quit even after smoking for 12 years.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 14,
      "content": "NTA \nHi, type one here, any changes you make are helping, so congrats! There seems to be a lot of incorrect information here about diabetes (more than one type people!) so please only listen to what your doctor says. \n\nYour mom is the asshole because she’s your mother and should be doing nothing but supporting your positive changes. Your a teen with a chronic illness, was it cool to say? no, but your a kid.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "I'm gonna say NTA. I don't understand the E S H judgments cause you're a kid with diabetes and she's a MOTHER",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "ESH, you should be supporting each other and building one another up.  I dont know what type of diabetes you have but type 2 can be reversed.  Smoking for 12 years is bad but limiting the future harm to your lungs is a good thing.  I suspect theres an underlying issue between you two that you need to address if you want any form of relationship in the future",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "If it's real. NTA, you handed her back the pile of shit she gave you. \n\nYour mistake was saying this publicly without onlookers knowing your reason for hitting her with that attitude. Had others known you would have saved face.\n\nScrew anyone who comes on here and says you gotta respect your parents. Children do respect their parents until the parent stops treating their child like a person. Then all bets are off.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "I mean. It was petty of you for sure. You did an eye for an eye. Also your mom doesn't sound educated on diabetes. If you follow a nutritional diet meant for diabetics it is reasonable that your diabetes could go away. Ive had 4 friends get diabetes change their diets, lose weight and exercise it changed their life. But Im going with yta. Because it was petty. But sometimes it's ok to be an asshole.",
      "id": 18,
      "comments": [
        {
          "score": 0,
          "content": "Diabetes never \"goes away\". It can go into remission, the symptoms can fade, but it is permanent. \n\nAlso, ESH, but not a big deal.",
          "id": 19,
          "comments": [
            {
              "score": 5,
              "content": "Diabetes is a condition that can be reversed. If a person gets their A1C levels into a normal, non-diabetic range and keeps them there, the person doesn’t have the condition of diabetes anymore, for all intents and purposes. A doctor can take you off insulin or whatever you were taking.",
              "id": 20,
              "comments": [
                {
                  "score": 1,
                  "content": "Only type 2 can go into remission. Everyone here is talking about diabetes reversal but you can't lump all types into one name of \"diabetes\".  Just chiming in because all the other types cannot go into remission (reversal) and not too many people seem to understand this.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Well, I can’t speak for anyone but myself but I do know the difference. But, OP seemed to be indicating that she has Type 2 based on some of the things she said in her post.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "And relapses in those cases is incredibly common and very easy, and once done is far more difficult the second and third times around. You may not have the symptoms or ill effects of the disease, but you very much still are diabetic.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -1,
              "content": "You're right there is no cure. But it can be reversed and maintained without medication with hard work.",
              "id": 24,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah. I know that. I'm there. Still doesn't \"go away\", it is constant work to maintain and not relapse. And those relapse symptoms are worse than prior to treatment.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": -1,
              "content": "What is “ESH”?",
              "id": 26,
              "comments": [
                {
                  "score": 2,
                  "content": "ESH = Everyone Sucks Here\n\nAka both sides are assholes",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "...read the rules of the sub?",
                  "id": 28,
                  "comments": [
                    {
                      "score": 3,
                      "content": "As the great American philosopher Homer J. Simpson said more than once, “D’oh!!!”",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "I would say e s h but considering your age and the back story, NTA.\nYou are hurting and maybe should address your issues with your mom separately or in therapy (and I highly recommend speaking to another family member about what happened so they can be supportive of you and your needs).\nCongrats on loosing the weight!\nKeep working hard and working with you doctor to make safe adjustments to your lifestyle to ease things. There’s different types of diabetes which all come with their own set of needs and possible things to help, but good nutrition and exercise helps everyone regardless!\nBe proud of you.",
      "id": 30,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH\n\nTwo wrongs don’t make a right. \n\nYou both should be proud of the positive changes you are making in your life without having someone bring you down!",
      "id": 31,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "ESH. making her feel like you did may feel like justice to you but really it just makes you suck too.",
      "id": 32,
      "comments": [],
      "relation": "No"
    }
  ]
}