{
  "post content": "I’m 33 and I had a serious drinking problem since a young age. My dad was an alcoholic so booze never lacked in our house. It nearly killed me when I was only 27 and was in the ER for alcohol poisoning. \nIt was too close a call and after that things had to change. With my wife’s support, I went to rehab and proud to say I’ve been sober 5 1/2yrs. \n\nMy flatmate invited our friends over yesterday. It was 7 of us in total, including his friend, “Mark.” I’ve met Mark maybe 3-4 times over the last 2 years and while we’re “friendly” i honestly don’t know him that well. But you can tell he’s a party-guy. Likes to get loud, take shots, makes gross comments sometimes, etc.\n\nMark brought several cases of beer and a bottle of tequila with him so everyone was drinking and having a good time. \n\nMark kept offering me drinks the entire night, which I’d politely decline. It’s like he made it his personal mission to get me to drink by egging me on, saying everytime he sees me I’m either drinking a soda/water and it’s okay to let loose sometimes. He resorted to teasing me into drinking, calling me “princess”; I don’t know what that had to do with not wanting to drink.\n\nAll my friends there knew what I was like before, how bad my drinking was so they kept trying to steer the conversation so he’d forget about me. But every now and then he’d hand me a shot glass or a beer and would not let it go even after telling him yet again that I didn’t want to drink. \n\nMy wife became uncomfortable with his behavior (I think she was worried I’d actually drink). She grabbed the shot glass from me, dumped it in the sink and told him to stop it already. He looked between us and grinned like he “understood now”. \n\nMark joked that maybe we should get my wife drunk first, then that’ll get her to loosen up the leash she has on me. I’ll admit, that made me see red. I got in his face and told him, “actually I don’t drink because last time I did I almost f*cking died so unless you want me puking everywhere and having seizures you should shut up and leave my wife out of this.”\n\nWiped the smile off him real quick and he apologized. The rest of night went on and he finally left me alone. \n\nOur flatmate did confront me in the morning because he thinks I was too honest with Mark and it wasn’t his fault he didn’t know; he was just joking around and I made him feel bad. Our other friends agree he was being too pushy and deserved being told off, my wife agrees so he’s the only one right now that’s taking Mark’s side.\n\nHe said I could’ve ignored him until he gave up instead of bringing up an uncomfortable truth from my past. \n\nNow yes I could’ve just told Mark the truth without full details but felt that’s none of his business and a “no” should’ve been enough. \n\nI only got carried away when he decided to include my wife in his jokes. So yes I am wondering if I was a bit of an a-hole for what I told him instead of keeping the peace.",
  "id": 1,
  "comments": [
    {
      "score": 23273,
      "content": "NTA. No is a full sentence. Mark was being pushy and an aashole. Peer pressure isn't cute when your teenagers and its especially ridiculous as adults. He disrespected you by badgering you to drink and he disrespected your wife. No one needs a reason to not do something but since Mark clearly wasn't going to stop pushing you you were well within the right to tell him exactly why you didn't want to drink.",
      "id": 2,
      "comments": [
        {
          "score": 7627,
          "content": "removed",
          "id": 3,
          "comments": [
            {
              "score": 5378,
              "content": "https://youtu.be/pZwvrxVavnQ\n\nThis is my favorite example. It uses tea for an example of consent for sex, but really, it works for anything.",
              "id": 4,
              "comments": [
                {
                  "score": 758,
                  "content": "this used to be on my clipboard thank you for giving this thread this beautiful video",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 727,
                  "content": "Honestly that video is fantastic. As a British person the use of tea as a metaphor is hilarious, but gets the point across so incredibly well.\n\nOP is of course NTA",
                  "id": 6,
                  "comments": [
                    {
                      "score": 312,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 200,
                  "content": "\"And on that note, I'm going to make myself a cup of tea.\" Is that a masturbation joke?",
                  "id": 8,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I was thinking that too. I'm fine with the Thames Valley police media guy cracking off a crafty one after making a video, but did he really need to tell us he was going to do so?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Exactly! I was thinking, now does he actually mean tea, or...?\n\nEither way, loved the whole thing from start to finish.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 87,
                  "content": "I’ve been meaning to add this video to my “save” list, but I couldn’t remember it. Thanks for sharing it and letting me save it.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "That video gave me a good laugh, but also..very informative and super simple for people who seem to get confused about consent which should not be confusing at all and require a video. Love it!",
                  "id": 12,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I feel so horrible for laughing!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "That video's hilarious. It was shown to my Basic Training flight during our sexual assault prevention class, and tea became a bit of a running joke after that.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I love this video as well, consent explanation for dummies",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This was brilliant!",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "100%! My college used to show this to the freshman, and when they stopped, we made sure all the band freshman saw it anyway. And there was never any issues at a single band party that I attended with people trying to pressure others to drink. It was \"Hey you wanna do a shot?\" \"No thanks, I'm drinking water tonight.\" \"Cool\"",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That is one of the best things I’ve ever watched.  They covered like every possible scenario.  Effective, and also humorous.\n\n“Unconscious people don’t want tea.”\n\nI could also listen to that guy read the dictionary and I’d be happy.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1052,
              "content": "NTA. Makes me think it’s Mark who is the alcoholic. I’ve met many addicts who crave validation, and find the idea of others willingly choosing not to partake as threatening the fantasy that it’s the best possible way of life.",
              "id": 19,
              "comments": [
                {
                  "score": 665,
                  "content": "A someone who doesn’t drink and never has, I get this a LOT.  The amount of people who seem to feel threatened or judged simply because I chose not to drink and they do is astounding.\n\nI’ve had people get openly upset with me over the fact that I don’t drink.  I’ve had family members pressure me for years to drink “just this one time”.\n\nThey can’t comprehend that I have no desire to drink.  They assume I’m resisting some kind of temptation.  They can’t reason that I don’t need alcohol to lower my hibitions.  That if I want to do something, I’ll do it without the crutch of being drunk.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 1057,
                      "content": "I call it \"ruining the average\". \n\nThey drink. They drink *a lot*. They drink every weekend to excess, and hey, on \"special occasions\" under the week, too. \n\nAnd it's fine. \n\nEverybody drinks! Drinking is part of being social, and drinking to get drunk is part of party culture. And if they are drinking a bit more frequently, a bit more heavily than others, well, that's just them being the heart of the party, the party animal, the guy or gal who knows how to have a good time. They are just on the higher end of \"the average\".\n\nAnd then you, or I, come in. And ... we don't drink. And we don't drink despite not having a \"legitimate reason\", like being the designated driver, like being pregnant, like being of a prohibitive faith. We just don't want to, and don't really feel we *have* to to have fun, either. \n\nAnd that's terrible. For them.\n\nBecause suddenly here we are ruining the average by introducing the concept of \"not drinking\". Suddenly not *everybody* is drinking, unless they are forced to not drink by circumstance. The low end isn't \"getting slightly drunk\" anymore, with the higher end being \"blackout drunk\", suddenly the low end is being sober. And in this new spectrum, their excess looks all the more extreme. Because when there's the option to not drink, isn't there also the option to drink *less*? Because if you introduce the concept of being social and having fun *without* being drunk, doesn't that put into question a culture that insists that being social means you have to always be drinking at social outings? Because if it's possible and enjoyable to not drink, is their copious consumption of alcohol less loveable character trait and more indication of, perhaps, a problem?\n\nAnd that's where that missionary zeal comes from. We have to be converted, we have to be brought around, we have to become the \"everybody\" that is drinking. Because hoping to bully people into being part of the status quo, to validate drinking culture, is easier than to take a good, critical look at one's own behavior.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 185,
                      "content": "That part that you said about resisting temptation hit home for me. Whenever people hear of a religious person, particularly a Muslim, choosing not to drink, they feel distanced from them or are super curious and sometimes weirded out as to why you'd stick to that rule and choose not to drink ever\n\nLike I don't have to validate my reasons or choices for anyone, and you're not gonna help me get out of the \"cage\" of religion by showing me or telling me how good drinking, eating pork or whatever else feels \n\nPeople should just respect other people's choices, whatever their reasons for them are. If they don't affect you or your freedom, they're none of your concern",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 129,
                      "content": "Ditto here. I don't drink alcohol mostly because I don't like the taste. Beer tastes like yeasty raw bread dough. Other liquors have a horrible taste, even mixed in with fruity or minty things to make them taste good. I don't even like wine because it has a bitter taste.\n\nThis has annoyed people to no end throughout my adult life. When I politely decline a drink and have a soft drink or water instead, it's like everyone else has to question or have an opinion on my choice. \"What!? Why not?\"...\"Oh come on, just one beer/glass/drink won't hurt you\"...\"It's ok to loosen up a bit!\" And now I'm the talk of the gathering because everyone has a personal goal to get Scarlett to drink alcohol.\n\nI get the same thing with my food choices. I have several food sensitivities related to my seasonal allergies, plus I'm very picky. When I'm offered a food I'm supposed to avoid or don't like, I politely decline...and then starts the same discussion. \"What?! Why not?\"...\"What do you mean you don't like <insert xyz food>?!?\"...\"Just try a bite, you'll love it!\" Irritation ensues and then increases the more I decline, and a previous non-issue is now a huge issue that involves everyone.\n\nWhy do people get so offended when others decline to eat or drink something they don't like?",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 110,
                      "content": "It happens the same to me and I have always hated that kind of people that seem to think that me not drinking is some kind of attack to their drinking habits.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "My sibling stopped drinking due to medication, and it's amazing how much of that side of family really seems offended because they just go- No Thank you, and refuse to say why they won't drink.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "I'm someone who does drink and still gets shit on for the times I don't. One time I went to brunch with some family and they all got bloody marys and mimosas while I really just wanted coffee. They straight up interrogated me about it, like, \"Why don't you want a drink? What's wrong? Come on, just one mimosa!\" I had to make a comment like \"No wonder my dad is in AA with family like this.\" That did make them consider what the fuck they were doing and they apologized but it shouldn't have happened in the first place!",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "The fact that it’s so normalized to drink as much as most people do is frightening. I don’t know why it’s such an issue to be sober? I’ve been sober for many many years now and don’t see why it’s so unacceptable for most people to BE sober? There’s a million reasons not to drink and people who badger you to drink with them deserve none of them.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "I choose not to drink or do drugs etc because literally my entire family on my father's side were alcoholics, and not the functioning kind. Since I'm a woman I don't get as much shit for it as I've seen some men get, but it's still super frustrating when people badger you to drink. Why? Why do I need to drink for you to feel better? Why can't you just enjoy your drink without needing to push it on others? Such a strange behavior.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "I tell people that I am allergic, which is true, and they still would push drinks on me.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "I used to say I can't drink because of medication just to not deal with this bulshit. And I found that many people act as if my mother died or I had a deadly illness when I say I can't drink. Like it's a tragedy. It's so weird.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "I'm an alcoholic and alcoholics love it when everyone is drinking and getting drunk.  That way we don't stand out.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yeah, I used to be around people like that a lot. They put a ton of pressure on me to drink with them, and it was a *constant* thing. I'm careful with how much I drink (I'm tiny in comparison, and I have medical issues), but they'd push like hell. Like it was some kind of insult that I either didn't drink or limited my intake to one beer.\n\nThe head of the group was just relentless, and yeah, I'd put money on him and his inner circle having a serious problem with alcohol. More than once I watched them drink to excess, every event we did had to include heavy drinking, and it really created a group with a cavalier attitude toward alcohol (we had multiple events or parties where people didn't remember what happened the next day).\n\nThere were some scary moments, too, but this comment is too long already. OP, NTA. Good luck on your journey.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "This is exactly the type of alcoholic I was while drinking in public. It was embarrassing to be on my fifth drink while everyone else was on their second, so I’d try to pressure people into having more.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Came here to say this\n\nThere was an AITA this time last year about a guy who was pissed that his wife's company prohibited alcohol at their holiday dinner. His excuse was that \"I'm sure other people want to drink, too\" All I could think is that the dude was a massive alcoholic if he couldn't have a three hour meal without booze.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I figure alcoholics might like drinking in a crowd so they can tell themselves an excuse besides being addicted.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I don't know. A lot of Brits seem to consider drinking an essential part of life and are made very uncomfortable by non-drinkers. Put them on the Canadian Prairies where there's immense stigma against public drunkenness and you get some fairly intense and unexpected culture shock.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 266,
              "content": "Also, OP's flatmate is somewhat TA too. \n\nI've considered how much he may or may not have seen of Mark's behaviour, which would affect how justified he felt OP's reaction was, but OP has obviously explained since then and to describe it as being \"too honest\" is ridiculous. \n\nThe sheer lack of empathy to OP's situation is a bit worrying.",
              "id": 37,
              "comments": [
                {
                  "score": 152,
                  "content": "Yeah, the fact that they are more concerned with Mark’s feelings than OP is concerning.\n\nAnd if they’d wanted to spare Mark the embarrassment, they could have put a stop to it way sooner.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Exactly. I feel like a firm “Would you just drop it?” or “Leave him alone“ from the flatmate or any of the other friends would’ve been both appropriate and helpful; Mark was badgering the OP and that would’ve annoyed me no end. If Mark had been pestering a female guest to kiss him I’m pretty sure someone would’ve said something; this is not all that different and some bystander intervention could’ve shut this down as well.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "My feeling is that it's not so much that the flatmate is worried about Mark's embarrassment, but rather how Mark's actions reflect on the flatmate as his friend and the person who invited him over. He's trying to say that OP took it too far, because if OP overreacted, that means that what Mark was doing wasn't that bad and the flatmate doesn't have to feel judged by the company he keeps.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "OP did say that the rest of the party tried to steer Mark away from sharing drinks every time he would get pushy. Seems like *everyone* was trying to defuse the situation peacefully and Mark kept pushing until OP got aggressive.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Yeah because the friends tried to deal with it politely they aren't AHes for ignoring it as in some other posts.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Steering away is not the same as pulling him aside and having a quiet word about it. Any of the friends could have clued him in and allowed OP to avoid direct confrontation with the whole story.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Anyone worried about the having multiple guests during a pandemic.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Not everyone is in the same country, state or town or under the same lockdown rules. Edit: there were 7 people and at least 3 seem to live together.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 31,
                  "content": "Part of me feels like the flatmate is a bigger AH than Mark. As rude, shitty, and inappropriate as Mark's behavior was, at least he stopped and apologized when he was called out. The flatmate doubled down on Mark's behalf.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 184,
              "content": "Exactly, the reason shouldn't even matter. When I was pregnant and not ready to tell anyone yet it was extremely difficult to come up with an excuse that would make people stop offering and stop assuming. The best ones proved to be \"sorry, I had a terrible headache all day, had to take meds and it finally went away at least a little bit to be able to come here, don't want it to come back full force\" and also \"sorry, me and my husband got so drunk two days ago and I was so awfully hungover I still feel queasy only thinking about it\"...  \n\n\nBut it totally sucks, you **shouldn't even have to** make excuses.",
              "id": 47,
              "comments": [
                {
                  "score": 112,
                  "content": "I waited tables pre covid and distinctly remember waiting on a group of ladies where one was secretly pregnant. She got to the reservation early and told me that she was expecting but didn’t want her companions to know. She knew they would hound her about it if she refused to drink so she asked me to bring her mock-tails in secret (nonalcoholic drinks that look like cocktails) so they wouldn’t bother her. Like this poor lady felt like she had to announce her pregnancy to a random server instead of just saying no to a drink without awkward questions.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Tbh it might not have even been the drinking thing but if she had suffered losses or fertility issues and her entire group of friends was aware, maybe she didn’t feel like dealing with the questions and anxiety of an early pregnancy. I’ve been there and sometimes you just don’t want to get everyone excited knowing there is a slim chance the pregnancy will result in a baby at the end.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "If your friend who usually drinks suddenly stops, there's gonna be speculation with pregnancy probably topping the list. If you really wanna keep the pregnancy a secret, it's a pretty good strategy.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "that is heartbreaking, thank goodness you could be there for her!",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I feel that. Luckily our friends all live a distance you can justify driving to so on those occasions one of us hasn't been drinking (because work, pregnancy, sports requirements) they've been designated driver. Wave car keys in drink pusher's face and shrug, and change the subject. \n\nBut as you say, no thanks should be sufficient.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "This. Offer it to them once and if it's a no, don't follow it up with a \"why?\" but an offer of a non-alcoholic drink or water. Really simple stuff. \n\nNTA",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I hate how pushy people get when you tell them you don't / can't drink.",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "NTA. In fact, you deserve a shiny gold star for giving Mark a sorely needed lesson on why you should never push someone to drink alcohol. Your flatmate is completely wrong. People like you should always have the courage to say why they can't drink. You showed both honesty and courage!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I like to drink and make sure everyone around me is having a good time. On that note drinking doesn't always = having fun. However most of the time being forced to drink = not fun. \n\nMy cousin and I are the same age and lived together during most of our 20s so we had a lot of fun. One summer I got a huge cabin with some friends. She showed up with her boyfriend and we were all having a great time. Lots of our friends were offering her a drinks and she kept saying no. They'd tell her they could stay the night so she could drink and she kept saying no. It was constant. I don't know why I got so protective (yes I was tipsy) but I said \"Hey! My cousin said no! So that means no!\". Lol needless to say they quit bugging her. Well now I have an adorable nephew.... she just wasn't ready to tell everyone she was expecting.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 692,
          "content": "I learnt years ago, if there's someone who doesn't drink, there's generally one of 4 reasons\n\n1: religious or cultural \n2: medical, like an allergy, or it affects meds they're on\n3: just don't like the flavour or the effect (both my mum and brother in law are this)\n4: drinking problem in the past.\n\nAnd you know what, none of those 3 stories are fun or interesting at a party and the 4th tends to get real heavy real quick.",
          "id": 57,
          "comments": [
            {
              "score": 349,
              "content": "I made the decision not to ever drink again when i became a mom. It just feels wrong to me (other people can make their own parenting decisions yadda yadda). \n\nMy bfs parents keep saying I'll drink again, but I really just don't want to... I used alcohol as a crutch because I'm painfully awkward in social situations (especially around his parents), and it killed my sense of smell around smokers, which was nice. But now with my baby, I can't be around smoke now anyways, and my daughter deserves the best version of me.",
              "id": 58,
              "comments": [
                {
                  "score": 142,
                  "content": "I like that last line, about your daughter deserving the best version of you. That's awesome. You have my respect for putting your daughter before yourself like that. Forget what the naysayers say. You do what you think best for your family. Take care internet stranger. :)",
                  "id": 59,
                  "comments": [
                    {
                      "score": 31,
                      "content": "You're so sweet :) thank you!",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "[deleted]",
                  "id": 61,
                  "comments": [
                    {
                      "score": 17,
                      "content": "That's so true - it's honestly pathetic imo. And like the benefits far outweigh being less anxious around them tbh. Like, I've lost a tonne of weight, my hair is hecking healthy looking, I can be 100% present with my baby. No need to pump and dump lol. \n\nWhen I'm anxious around his parents now, i just talk to my baby lol. She gets me :p",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I also stopped drinking for my daughter, screw whatever your bfs parents say. Good for you💜",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I've always figured I'll stop any casual drinking if I have a child.\n\nI may allow myself to have one casual drink in the right circumstances when the kid's older and I know they're in a safe environment, but I would at least remain teetotal while they're still too young to fend for themselves.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah that's a good idea. It makes me sad seeing kids interacting with their inebriated parents. Like, it's not just about safety, it's also about setting a good example, I think.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I got sober when I was pregnant with my first. Than I got drunk one night before he was a year old and wanted to die. \n\n10/10 do not recommend getting drunk with a little one who likes to run around at the crack of dawn.. lol \n\nBut now that my boys are older, I am a social drinker. I keep a little alcohol around the house but drink maybe every 6 weeks or so and have at most 2 drinks. My husband drinks a beer every couple of nights. \n\nWith our drinking habits and being truthful about our past issues with drugs and alcohol, our children don't really question drinking or drug use. \n\nOP... NTA",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "If it feels wrong for you than it is wrong for you. You have figured out that you don't need alcohol to have a fulfilled life, and the people in your life should respect that. I think your ability to recognize this it says a lot about your love for your daughter. I also hope you push your Bf to stand up for you. My whole family are big drinkers but I drink at most 20 beers in a year. It is always the more mature members of my family that respect my ability to choice for myself, and it is always the asses that tell me that I'll be like them one day.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Watching my bro&SIL I came to the conclusion that drinking and parenting do not mix.  \n\nDrinking is fine as long as they are not actively parenting. But I would refrain from even a beer when our cat was sick, in case I had to be the responsible one, or drive him to the Vet. How much more important is that for a kid to always have a sober parent around?",
                  "id": 68,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Exactly.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "Theres also a 5th reason: they just dont want to",
              "id": 70,
              "comments": [
                {
                  "score": 63,
                  "content": "Maybe \"they just don't want to in that time\" too. It's totally possible to enjoy the taste, have a drink when you feel like it, and not wanting to drink today because... whatever. \n\nThis happens with me a lot. Somedays I don't want to drink. It's amazing how some people just can't relax when they're drinking around people who don't want to drink at that particular time.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I either volunteer to be the designated driver in that situation or I say I'm driving even if I walked or took a Lyft there.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Isn't that the third reason?",
                  "id": 73,
                  "comments": [
                    {
                      "score": 90,
                      "content": "It's fully possible to enjoy the taste, but still decide that your life is better without.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Not necessarily.   \nI like pizza, but sometimes I just don't want to eat pizza.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Not quite, but I think rule 5 should replace rule 3. The it covers people who don't drink for health reasons, driving reasons, taste reasons, effect reasons and just don't want to reasons.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "6th: on a diet.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 87,
              "content": "I’m in category 3- I’m incredibly fussy with all food/drinks and I’ve never liked the taste of any alcohol. People will occasionally ask why I don’t drink/if I’ve ever tried alcohol (yes- but I didn’t like it!) and then they leave it alone. Close friends do sometimes tease me for how picky I am with food but in a very good natured way and never try to force anything on to me.",
              "id": 78,
              "comments": [
                {
                  "score": 54,
                  "content": "Friend! Comrade! Fellow category 3! Fellow picky eater! (Is it clear how rare it is I meet another category 3? 😅) \n\nFor me, it’s not only category 3, but also alcoholism runs in my family. Even if I did like the taste, I’d really rather not risk it.\n\nOP NTA.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 20,
                      "content": "This is exactly my reasoning too. It tastes disgusting to me and also both of my parents are alcoholics so I'd rather not travel down that path. \n\nI also don't like the feeling of being drunk/tipsy.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Another category 3 plus picky eater!\n\nI'm at the point in my adult life that if I plain don't like a food/drink or it's on my list of foods/drinks I'm not supposed to drink (I have several food sensitivities related to my seasonal allergies, supposed to avoid these as much as possible), I'm not going to be forced into consuming it by anyone. Period. I'm polite about it, I don't care if everyone else in the room is eating/drinking it, but I will not be.\n\nMy family and close friends know and don't care, but hot damn, this seems to rile other people up. You're not responsible for procuring or preparing my food/drink, why on earth does my preference offend you so much?",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "手机号码归属地查询 2019手机号码段大全-号麦网手机号段查询网\n号麦网手机号段查询网提供最新手机号码列表，最新移动、联通、电",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I also choose not to drink because of a family history. My father was an alcoholic, and so was his father - and my grandfather died from it. (The cigarettes got my dad before the alcohol could.)\n\nThe smell of any kind of alcohol is incredibly noxious to me. I would never be able to get it close enough to my mouth to try the taste.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Waving hand here!!! I do get more flak for being a picky eater than for loathing beer and wine (I can handle mixing vodka with my preferred soft drink and sweet coolers). \n\nI do NOT understand why people feel so invested in what I do and do not enjoy the taste of. Seriously, if I don't ask you to cook for me or pay for food I didnt eat, why does it matter to you!!!!",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 72,
              "content": "Great answer. I was recently at a friend's place for a birthday and his house mate's daughter was there. She looked really young but I was told at the start of the night she was actually 19.\nWe were having a laugh playing drinking games and it was very obvious that she wasn't drinking. None of us said a word, just included her and let her nominate people for shots when she lost a game. I was told at the end of the night that she was born with foetal alcohol syndrome and that's why she doesn't drink. A great reminder that you DON'T FUCKING HASSLE PEOPLE about their choices.",
              "id": 85,
              "comments": [
                {
                  "score": 5,
                  "content": "And here she would be technically underage. Some people do get hassled for not drinking even when they're underage.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 8,
                      "content": "UK here.",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "I was out at the pub after school years ago, and one guy bought shots for everyone. I told him I didn't drink, so he changed my shot for a slice of cake.",
              "id": 88,
              "comments": [
                {
                  "score": 18,
                  "content": "Thats a real friend. Cake for the win",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "What a class act! \n(And I do drink, but if you offered me a slice of cake or a shot, I would definitely be taking the cake instead!)",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "I’m #3, with a drop of #1 added. I like the flavor of wine and beer, but I utterly despise the physical and psychological effects alcohol has on me. So, I’m always keeping an eye open for no-alcohol beer and wine. \n\nReason #1 is because I practice Buddhism and have found the fifth precept to avoid intoxication to be personally very helpful. (Precepts aren’t commandments or rules as much as they’re guidelines. Your personal beliefs or lack thereof may vary, of course.\n\nI should include Reason #2 because, well, alcohol and antidepressants aren’t the winning combination I need in life.",
              "id": 91,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "And 5: had parent(s) with a drinking problem, and saw way too much crap growing up.\n\nThat's why I won't drink.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I'm usually number 5: I like to drink when I feel like it, but sometimes I just don't feel like having a drink. No particular reason, just like sometimes I don't feel like having peperoni on my pizza. People don't seem to understand though, and as a woman I was often teased for probably hiding a pregnancy.",
              "id": 93,
              "comments": [
                {
                  "score": 13,
                  "content": "Same here. I drink - in fact my quarantine project had been learning to mix cocktails! - but often enough, I just don’t feel like having alcohol. \n\nFor example, last night, I made a cool Thanksgiving rum punch. It was super yummy and I had a glass, but after that, I was just digging the regular spiced cider. It happened to be more of what I was in the mood for.     \n\nI usually get around any peer resistance by being (genuinely!) over-enthusiastic about whatever alternative beverage I happen to be craving at that moment: “No thanks, but I would KILL for a Pepsi/coke/cola, if you have that. I want massive amounts of cold caffeine and sugar injected straight into my veins as soon as humanly possible.”",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Reminds me of when I was at a conference, taking some meds for my heavy jetlag and a professor from another University offered me alcohol. I refused, he asked why and I said, that I took some pills since I felt unwell and he actually responded with \"You know what? When I take medication, I **always** drink because that often causes fun side effects!\".  \nI was speechless.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Being the only one who didn’t drink on my course at uni in UK was an experience. *They* would keep bringing it up & when you would explain you don’t drink because of religious reasons they would take it upon themselves to debate it or act like I’ve put the issue on them. \n\nI don’t drink, let it go.",
              "id": 96,
              "comments": [
                {
                  "score": 9,
                  "content": "Smug atheist and pushy drink person are the worst combo.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Then they act like you’re the weird overly religious one when they literally force you into the conversation. \n\nI’m just waiting for my turn to see the tutor about my dissertation Andy!",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I'm not sure there's anywhere with a bigger booze culture than UK unis, that must have been pretty difficult.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "NTA. \n\nThe above, plus: when he kept pushing I might have considered throwing him out. He was a guest in your house...",
          "id": 100,
          "comments": [
            {
              "score": 119,
              "content": "I was thinking the same. One of my closest friends is a bit over a year sober (I actually want to say almost 2 yrs, yay her!), and she has talked about how many \"friends\" she lost over quitting several things that she was abusing. As a personal choice I dropped several mutual friends of ours because they did crap like this. I watched another ex-friend drink herself into a miscarriage after quite a few hospitilizations for severe problems caused by her drinking. I was the only person willing to not serve/drink with her during her pregnancy and after. I believe she is now sober. \n\nMy point is, I have 0 tolerance for pushers/enablers because it literally wrecks lives and kills people. I honestly can't stand to watch it, it disgusts me to watch people push drinking/drugs (or even just stand by/drink with) people who clearly have a problem, because not drinking/partying and seeing others choose not to makes them uncomfortable. I am totally ok with people choosing to do those things, and I drink myself still (heavy drinker for yrs, verging on alcoholism) I drink in front of the close sober friend, and she is aware and ok with it, but I have told her I will never be the reason if she ever breaks her sobriety.\n\nSorry for my rant, but I feel strongly about this. I have experienced how deeply ingrained recreational partying is in US society, and again totally fine with people who do, many of my friends do, it is not a judgement on the drinking/drugs. But we HAVE to normalize people choosing to not do those even in party atmospheres. Even if it isn't a choice made because they have a problem, saying no to things you are uncomfortable with or don't like should be acceptable and defended from AHs like Mark. Dude is toxic at the very least, and I'd go as far as misogynistic for the attitude when he thought it was the GF \"running things\". I literally can't think of anything nice to say about this guy, he sounds awful.",
              "id": 101,
              "comments": [
                {
                  "score": 23,
                  "content": "The weird thing is, I went to rehab for my cannabis addiction (1 year, 8 months, 2 weeks sober yay!) and when someone who is unaware of my past offers me a blunt and I say \"No I don't do that anymore\", nobody ever goes \"Oh come on, loosen up a little, it's fine, have some\" or anything like that for the rest of the evening. But for some reason a lot of people seem to act as if not drinking (anymore) is completely unreasonable.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Comgratulations on your sobriety! And yep. I can say my drinking is now mostly smoking/edibles, but it still is a problem for some, and even when I was a heavy drinker, I do not get the pusher mentality with alcohol. I started during an abusive relationship, and my dependency on it was almost at a scary level. On some levels with a lot of people, alcohol is flat out a drug, and should be respected as such. Your fun/comfort is never more important than another person's health or mental wellbeing.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "As someone who was sober for a year and relapsed due to behavior like the one in this post, *thank you* for being the friend that supports health and sobriety.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "I know kids who know better than to press someone like this. It’s wild to me that a grown a** man made it a point to damn near force a drink down OP’s throat. I’m glad your wife and friends actively tried to support you through this moment! I like your wife and she sounds like keeper. \n\nNTA, OP and congratulations on 5.5 years of sobriety!",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "I don't get why people need a reason for someone NOT drinking.\n\nHere's my reason:I DON'T LIKE ALCOHOL, I DONT ENJOY IT. That's it. \n\nBut people can't seem to accept a thirty something woman doesn't drink because she doesn't like it. It seems like you should have a VALID excuse for it, like being on medication, being pregnant, driving or being an alcoholic.\n\nMy husband doesn't drink, neither do my parents, or his mother. But when we go out and meet people that don't know us that much they keep asking why. We don't like it!  No deeper, traumatic reason.\n\nSince we're a family some end up thinking there might be a religious reason. Dude, were atheist. WE.JUST.DONT.LIKE.IT!",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": ">he was just joking\n\nIs the clue.  It's not a joke if it's not funny. The flatmate is a jerk enabler to Mark. \n\nNTA",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "NTA, Idk why you didn't just ask him to leave... I get that you didn't want to hurt the guy's feelings initially, but he didn't seem to care about yours.  He should've backed off at the first \"no thank you\"",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Being embarrassed because you realize you were pushed when you shouldnt is an appropriate natural consequence.  Hopefully this will teach him a little lesson about not taking no for an answer",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "How have I never heard \"No is a full sentence\" before? That's such a great point.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">you you were well within the right to tell him exactly why you didn't want to drink.\n\nAnd honestly? Mark and the flatmate should just be glad that that's *all* OP did!!! Mark consistently bothered OP over and over again and refused to accept no as answer, even resorting to petty insults disguised as \"jokes.\" He's lucky OP didn't completely lose his shit on him and kick him out of the house, *especially* after bringing OP's wife into it. Flatmate says its not Mark's fault because he didn't know, but him not knowing anything about OP is *exactly* why he should have just shut up and minded his own business from the get-go. OP, you're sooo NTA, and seriously if flatmate doesn't drop this whole thing, he really needs to get gone too.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4834,
      "content": "NTA. The only person who made Mark look bad was Mark, and he should be embarrassed by his behaviour. My partner is an ex alcoholic and I have never heard her have to explain more than, no thanks I don't drink. It's common decency to just back off if someone says no to alcohol/cigarettes/drugs/anything.",
      "id": 112,
      "comments": [
        {
          "score": 1696,
          "content": "OP’s flatmate said he could have just ignored Mark. But that’s exactly what OP did, *repeatedly*, and Mark kept pushing it. OP’s response was completely reasonable.",
          "id": 113,
          "comments": [
            {
              "score": 808,
              "content": "Op's flatmate is a spineless coward.",
              "id": 114,
              "comments": [
                {
                  "score": 119,
                  "content": "And he should rethink who is he friends with. I can't believe he actually took Mark's side on this.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Well they had a party in the middle of a pandemic so the whole lot might need some examining, OP and all.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "You are absolutely right, and the conflict avoidance of the others in this situation baffle me. After the first few times, they should have helped quickly shut him down. I dont understand 'gently guiding the convo away from Marks harrassment. Or ignoring the stupid princess nickname. The guy sounds annoying af.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Also Mark seems like the kind of person to spike OPs drink so they end up consuming alcohol",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "His roommate also said ‘he didn’t know’ but he knew that OP didn’t want to drink and that’s all he fucking needed to know.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "I think the flatmate could’ve easily told Mark the info about you being in recovery in private the first time he ever offered you alcohol.",
          "id": 120,
          "comments": [
            {
              "score": 244,
              "content": "Mark isn't owed a backstory on why OP doesn't want to drink. Mark is still a AH for not accepting the first \"no\" and moving on with his life. Flatmat might even be considered an AH if he did take Mark aside to explain OP's past because that is not his story to tell.",
              "id": 121,
              "comments": [
                {
                  "score": 40,
                  "content": "I'd rather be an AH for being over protective, then an AH coming down on OP for no reason.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 110,
          "content": "Mark was embarrassed and apologized. It's the flatmate the one that doesn't seem to grasp the extend of misbehavior of Mark. That's what amazes me the most",
          "id": 123,
          "comments": [
            {
              "score": 61,
              "content": "Right. Mark was being an AH but he did all he could do in the moment, which was to apologize immediately and knock it off.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Serious question, when would you say it is okay to ask?  I think it's just how you ask.  I hope Mark really learned something.",
          "id": 125,
          "comments": [
            {
              "score": 88,
              "content": "It’s not ok ask to ask why ever. For example if I am pregnant I’m going to say no to a drink, but I have had a lot of early miscarriages so I’m not always ready for people to know I’m pregnant yet. \nOr someone could be in the beginning stages of recovery and may be embarrassed by the whole situation. They may give in to drinking just to get the questions to stop. \nOr they could be on medication for a health problem that not everyone knows about and they don’t want to discuss. \nIf you say “hey want a drink” and they say “no”, that’s the end of the discussion. \nLike say you offered me a cookie, and I said “no” I have found that most people just let that go. But for some reason when it comes to drinking people dig in. It’s annoying.",
              "id": 126,
              "comments": [
                {
                  "score": 7,
                  "content": "I think it's ok to ask a friend who you know doesn't drink when there's no alcohol involved. You're right that there's no time that asking is ok the first time. But if you're just getting to know someone, and they don't drink, it's ok to bring it up without alcohol around.\n\nI've had this conversation with established friends and they've always been extremely supportive, even if they didn't realize I had a problem.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Exactly. \"Out of curiosity, do you mind sharing with me why you don't drink alcohol? Is it all the time or in certain circumstances? Are you okay with me drinking around you?\" are all valid ways to be a good friend and make a person more comfortable.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "When you are closer friends with the person and they begin to talk about their past experiences or perspectives on alcohol.\n\nIf someone says \"no\" to you offering them something, there is no reason to ask them why. You are offering soemthing to be polite, generous, friendly - once you have offered, then your goal is achieved. If they say \"yes please\" you give them what you offered, if they say \"no thanks\" you say, \"ok, can I get you anything else?\"\n\nThe end.",
              "id": 129,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I kept thinking while I was reading that if this is how bad Mark is to a stranger about not wanting a beer how the hell is he about someone not wanting to have sex with him. This guy is dangerous and breaking down people is part of his personality. Why are they friends with him and accepting this behaviour.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1832,
      "content": "NTA\nObviously mark wasn’t going to stop offering drinks and pressuring you into it,\nWouldn’t be surprised if he tried to trick you into drinking as well,\n\nIt’s a good lesson from him and maybe he’ll learn with other people \n\nCongrats on the sobriety",
      "id": 131,
      "comments": [
        {
          "score": 679,
          "content": "This. My husband had his drink spiked once by a co-worker that insisted on him having alcohol. The reason he doesn't drink is he hates the taste (and smell) of alcohol so I'm not sure how she thought he wouldn't notice the odour before he took a sip...\n\nEdit: Just checked with husband and there's a detail I missed out that makes this sooo much worse. He was the designated driver for everyone at the outing!!\nShe spiked the drink of the freaking DD.",
          "id": 132,
          "comments": [
            {
              "score": 420,
              "content": "Holy cow! Did the coworker get in trouble? That’s illegal, not to mention super unethical if it was in a work environment",
              "id": 133,
              "comments": [
                {
                  "score": 419,
                  "content": "Nope, they were at a pub on a work party outing thing (so technically outside work hours). Co-worker offered to buy the next round of drinks, my husband asked for a regular coke and she brought him a rum and coke on purpose. \n\nThis co-worker was a woman I hated in general, not just because of her questionable behaviour but she was a known homewrecker (started an affair with some married guy in the same office building, ended with him divorced and her throwing him to the curb because she didn't want to deal with his divorce drama). I didn't once think my husband would cheat on me at all, but I hated that she saw his relationship status as a challenge (she would flirt with him all the time).\n\nI only attended a single work outing as my husband's plus one - she stared daggers at me all night while I sat by my husband.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 205,
                      "content": "What a crazy woman. Did HR get involved with the divorce situation?",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 96,
                      "content": "Honestly? I would not be surprised if she where trying to get him drunk enough to assault or rape him.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Oh, that’s interesting - in the UK, any work-related event (even just drinks with colleagues after work) comes with the same interpersonal responsibilities as if you were still in the office. I mean, in practice obviously almost nobody acts the same, but it’s useful to know if things go to far. People can bring cases for sexual harassment in a pub by a colleague.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Imagine how that would have went with a dry alcoholic",
              "id": 138,
              "comments": [
                {
                  "score": 60,
                  "content": "I know! I was more mad that his other co-workers expected him to laugh it off because \"it's not that serious\".\n\nUmmm yes. Yes it is. It is spiking a drink. If he ordered at the bar and the bartender added alcohol knowingly when not asked to, it would be a huuuge problem. \n\nI have seen my husband fully drunk only once: after a Christmas party with the same co-workers because they kept putting more drinks in his hand. While he wasn't blackout drunk, it took a couple days for his memory to fully return from that night. Ever since then he has followed through on his promise to never drunk again.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Also, what if he had a serious medical condition that could've hospitalized him?? Even drugging people with caffeine is considered a serious offense in court!",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Damn, I’d love to read an AITA from her POV: “AITA for *slightly* spiking the drink of a coworker, who never drink and also was our entire groups DD for the night?” I’d reeeeally want to hear her desperately “justifying” herself..",
              "id": 141,
              "comments": [
                {
                  "score": 3,
                  "content": "Oh I'd love that! It's been over a year since she's worked with him and we never heard from her since (good riddance)\n\nIf you want entertainment, I'll share a tidbit from the Christmas party I was a plus one to:\n\nThe small team and some partners went bowling. We got there around the same time as she did and went to to get our bowling shoes from the desk together. I have tiny tiny UK size 5 feet. They *look* tiny. I took off my shoes to start changing into the rentals and she got visibly upset... because she was size 7 and her feet looked massive compared to mine. Of all things to get upset over... that my feet are smaller than her X'D",
                  "id": 142,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh my how *dare you* have more dainty tiny delicate feet than her! She sounds like a *delight* to be around...............",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I thought that maybe one of the friends should have taken mark aside and told him too personally. Mark wouldn’t have stopped until he knew.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1006,
      "content": "NTA\n\nThe first time he called you a princess or tried to push alcohol on you he was a bit of an asshole.\n\nWhen he continued to push alcohol on you after that point he graduated to being a proper asshole.\n\nUltimately, by that point if he didn't get the hint that you didn't want to drink, then the only way you were going to get through to him was by going completely overkill to get a proper reaction out of him. Anything less he would have just continued brushing off and ignoring.",
      "id": 145,
      "comments": [
        {
          "score": 400,
          "content": "Honestly, where were you friends in this? If I'd have been a mutual friend I'd have pulled him aside for a quiet word",
          "id": 146,
          "comments": [
            {
              "score": 321,
              "content": "That was my first thought too. “Hey, dude, shut the fuck up. He doesn’t drink anymore, leave him alone.”",
              "id": 147,
              "comments": [
                {
                  "score": 34,
                  "content": "I think that's a bit of an awkward response to give, honestly. \"He doesn't drink anymore,\" alludes to the issue in a really blatant way, and especially with the way that OP dodged telling him about this, it's likely a very personal one. I could understand why people might not say anything if they thought that they were at risk of revealing information that it's not their place to disclose.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 32,
                      "content": "\"Mark, he didn't say he *isn't drinking*, he said he **doesn't** drink. Stop being an asshole to my friend or I'm gonna call you an UBER.\"",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "Honestly if I knew someone was coming to my house with/for drinks and someone else there didn’t drink I’d tell them before head just so there aren’t any awkward moments tbh. Like no need to go into detail, just “hey heads up X doesn’t drink”",
              "id": 150,
              "comments": [
                {
                  "score": 78,
                  "content": "Unfortunately that doesn't always work. I've been in the same situation, but it's my husband's friend. I cut out drinking because I have terrible kidneys, and traumatic childhood with alcohol. We would go over there to hang out, and he'd act like I personally offended him for not taking shots or drinking. He KNOWS I don't drink, he's known for a long ass time I don't drink. But every time we see him he hounds me until my husband has to get involved and tell him to back off me. \"I thought we were all going to have a good time tonight!\" While looking straight at me. I've stopped going over and he doesn't understand why. There's more why but that's a big reason.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 41,
                      "content": "[deleted]",
                      "id": 152,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "That is exactly what I would do as well.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "OP said that the group would try to steer Mark away from getting OP to drink. They probably didn't want to be confrontational about it, which is understandable.",
              "id": 154,
              "comments": [
                {
                  "score": 13,
                  "content": "No. They knew Mark better and they knew OP. They had a responsibility to say “knock it off. OP doesn’t drink.”\n\nTheir silence was complicit as Mark harassed and teased and made ugly implications and then looped OP’s wife into the harassment.\n\nThe entire lot of them are assholes. OP and his wife were innocent.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 14,
                      "content": "The friends probably didn't want to reveal any information that OP wasn't ready to reveal. Telling someone why you don't do something can be extremely personal. It wasn't their information to divulge. They tried to get Mark to leave him alone.\n\nThe friend siding with Mark is clearly an AH but the other friends did try to help in one way or another.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Probably were taking cue from OP not explaining to Mark \"why\" OP won't drink and respecting that OP did not want to have it explained to Mark. Even then, taking Mark aside to quietly explain that what Mark is doing is super rude, no matter what OP's actual reasons are, and that he needs to drop it pronto should've been okay.\n\nBut maybe they erred on the side of caution  by trying to instead steer the conversation away fron alcoholic drinks. The temptation was probably too great to quickly set Mark straight by explaining that OP could possibly be a former alcoholic and thus revealing OP's past anyway.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "“It’s not his fault he didn’t know”\n\n“Ok, well why didn’t you tell him, then??”\n\nOP, your “friend” is an AH as well. If he didnt like how you explained it, he should have said something himself. NTA",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I don't think it's anyone's place to share OP's history other than OP. My husband is a recovering alcoholic. It's his choice whether or not to explain why he's declining to drink.",
              "id": 159,
              "comments": [
                {
                  "score": 4,
                  "content": "I may have been too euphemistic. I mean going 'Mark can I borrow you for a second....Will you knock it off?' and then whacking him on the nose with a rolled up newspaper.",
                  "id": 160,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 712,
      "content": "NTA mark is a major asshole tho",
      "id": 161,
      "comments": [
        {
          "score": 165,
          "content": "Honestly so is this guys roommate,  and to a lesser extent his friends who just sat back and watchedit all happen without speaking up. Why is he sticking up for the biggest asshole at the party? \"Just ignore it\" is the advice people give when they dont actually give a shit. What a schmuck",
          "id": 162,
          "comments": [
            {
              "score": 35,
              "content": "I agree with that to an extent. When things like this come up, I'm sure the reason why is at the forefront of their minds, and that's no doubt a very private thing, and bringing it up isn't their decision to make. They could probably not allude to why OP might not want to drink, but the reason why is probably a really overwhelming thought, and some people might just choose not to say anything vs inadvertently revealing someone else's private information.",
              "id": 163,
              "comments": [
                {
                  "score": 22,
                  "content": "I think that's a good point that I didn't quite think of, so thank you for the extra perspective. And I agree it doesn't have to be \"hey stop because ______\" it could just be a \"seriously man give it a rest\" or \"this isnt worth the headache bro just leave him be\" just to show the power in numbers",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "So, go to OP and say \"Mark's being a total douche. I don't want to say anything you don't want me to say, but he's an idiot and should back the fuck off. How do you want me to handle this?\"",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 535,
      "content": "NTA. How has Mark and your flatmate not realized that “no means no”? You should not have had to keep declining once you said no the first time, and you didn’t owe him or anyone else an explanation. He crossed several lines and you responded by being blunt, which was the obviously only way to get him to stop.",
      "id": 166,
      "comments": [
        {
          "score": 209,
          "content": "Seriously, I got some major assault-y vibes from reading how pushy Mark was in this situation. What a creep.",
          "id": 167,
          "comments": [
            {
              "score": 176,
              "content": "Right? It creeped me out to hear him “joke” about getting his wife drunk to “loosen her up”. Made me think he’s probably used alcohol to try change the choices of other women who have denied him something.",
              "id": 168,
              "comments": [
                {
                  "score": 104,
                  "content": "Yeah. \n\nDefinitely getting the creepy “a no is just a yes that needs convincing” type vibes off this Mark guy. \n\nOP is NTA.\n\nMark however is definitely an AH.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "yuuuup, the toxic masculinity in this (calling OP \"princess\" for not drinking, saying his wife has him on a leash) is just one more assault-y red flag on this pile of red flags.\n\nIf I was at a party with this guy, I would be watching his every move to make sure he didn't try to bring one of my girl friends home with him, touch anyone, or do anything besides going straight home and passing out.\n\nETA: I hope OP sees these comments. His friend's roommate could very well be a sexual predator and it's necessary to keep an eye on him to make sure he doesn't assault someone.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yea, ew!",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 399,
      "content": "Nta mark is. I hate people like him! Take fcking hint!!",
      "id": 172,
      "comments": [
        {
          "score": 71,
          "content": "No isn’t even a hint. It’s a fucking no! Mark is a dick",
          "id": 173,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 207,
      "content": "Mark sounds like a total dick, but he apologised and stopped at least.\n\nIt doesn’t even sound like your mate is on Mark’s side because Mark apologised and stopped so even he realised he was being a dick\n\nJust seems like it’s this ‘mate’ is out on his own trying to defend untenable behaviour, and I’d wager that what he’s actually upset about is “you being honest and reacting to my guest being a dick made me feel uncomfortable because I feel vicariously responsible for my friend’s social comfort to the extent that I’m willing to let you be treated like shit as long as it’s not creating any discomfort for me”\n\nMark was being a dick. Mark feels bad because he knows this. It’s socially appropriate for Mark to feel bad about his actions in this scenario. Feeling bad will lead Mark to reflect on what he did and will probably make him reconsider him acting this way again. It doesn’t make him a totally unsalvageably terrible person, it means his behaviour wasn’t kind or reasonable. Your friend’s need to never have Mark feel bad even when it’s appropriate isn’t going to help Mark grow and learn from these situations. \n\nSo yeah NTA, I’d even say at this point that Mark isn’t the asshole anymore, but your mate needs to reassess how he’s handling this. \n\nIf you want some language to go back to your mate with, here’s what I’d say: \n\n“Mark was being rude all night. It’s common knowledge that some people can’t or don’t drink for private reasons - alcoholism, medication, pregnancy, religion. No one should have to disclose their private information in order to not have booze forced on them. I think you can agree that’s reasonable. I think it’s a normal and healthy response that Mark feels bad about his actions - maybe he’ll be more mindful of people’s circumstances before acting like that again. Last night you didn’t step in when your guest was repeatedly rude to me, which is on you. You could have pulled him to one side and asked him to leave it be, but you didn’t. Your discomfort at a slightly awkward social situation doesn’t outweigh my right to feel safe and not have my recovery threatened in my home.”\n\nThis is a point of personal preference (and I certainly wouldn’t say an obligation) but if I were you I’d consider whether there is some language you’re comfortable with using about drinking earlier on in situations like this so you’re not getting to the point where your night is being ruined and you and your wife are anxious and upset. Like if you’re offered a drink a second time you could say something then to signal that you don’t want to be asked. \n\nIt could be “I’m in recovery so I’d prefer if no-one offered me a drink, thanks” but also if you’d rather not disclose that (totally reasonable) then “I can’t drink for medical reasons - I’d don’t want to go into it but I’m sticking with the soft drinks”",
      "id": 174,
      "comments": [
        {
          "score": 46,
          "content": "I agree that OP is NTA at all, but sometimes it helps to have a reason tucked under your belt for just in case. Pushy assholes are sadly frequent, especially at parties. Not that you ever owe anyone a reason, and a \"no\" should absolutely be reason enough, but if comfortable with it, an added \"no thanks, I'm teetotal\" or whatever can help. My uncle doesn't drink alcohol, solely because he hates how it makes him feel, and he usually just says \"no thanks I don't drink\" and that's \\*usually\\* enough, even if some people love to ask the ol' \"why?\". \n\nAlways reminds me of the old Jim Gaffigan sketch: [https://www.youtube.com/watch?v=EIQ4nOvCkVc](https://www.youtube.com/watch?v=EIQ4nOvCkVc)\n\n\"You don't use mayonnaise? Why? Are you addicted to mayonnaise?\"",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "If someone think they need to push another person to drink, even though that person repeatedly said \"no\", that's an asshole. Doesn't matter if he was sorry afterward. He was pushy and being a sexist asshole to OP's wife as well.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This is a great response. I have in the past been a \"Mark\" to a lesser extent and been told off in a similar way. Immediately realized I was TA, apologized (like Mark did) and took that into future situations and thought twice about how I was acting. Helped me to grow and I hope OP helped Mark grow up a bit too.\n\nAgree that it's great to have an up front response like the one Faybie17 recommends. This makes for a much less awkward situation and less of the night uncomfortable. There's no need to let Mark take it all the way to insulting your wife.\n\nPeople generally aren't trying to be mean and make your night crappy, they just want everyone else to let loose and have a good time. You can early on let them know that you're having a good time and don't need/want booze to do it.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 167,
      "content": "NTA. I don't understand why some people are afraid to drink with someone sober. He didn't stop when you asked him politely so he had to hear the \"uncomfortable\" truth.",
      "id": 178,
      "comments": [
        {
          "score": 62,
          "content": "Drinking with the sober makes your own alcoholism all the more glaring.",
          "id": 179,
          "comments": [
            {
              "score": 5,
              "content": "Ding ding ding!",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "We have a friend who doesn’t drink so we just don’t offer him any. He is fine with us drinking around him, and whenever he is over I make sure to have his favorite iced tea in the fridge. It really isn’t a big deal!",
          "id": 181,
          "comments": [
            {
              "score": 9,
              "content": "Pre COVID we did game night regularly with a group.  It's never a big deal who drinks and who doesn't.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 136,
      "content": "NTA, Mark was repeatedly trying to get you to drink... that's not cool. Nobody should be forced to do anything.",
      "id": 183,
      "comments": [
        {
          "score": 4,
          "content": "Exactly and then joking about getting his wife drunk?? The fuck??",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}