{
  "post content": "I (27m) have been living with my girlfriend (29f) for several months now. For the most part things are really good and I plan to propose soon and hopefully have at least a couple of kids with her.\n\nHowever we've run up against a conflict.\n\nShe's an absolute morning person. I hate mornings. By the time I force myself out of bed in the morning and into the shower she's already been up for at least 30 minutes--even though she has to be at work later than I do--and is at the stove making breakfast. She likes a huge breakfast in the morning. She usually has eggs, either French toast or pancakes, hashbrowns or breakfast potatoes, and sausage or bacon. Sometimes on weekends it's ham or steak. She eats almost nothing for lunch and usually has a smallish dinner but she loves a huge breakfast.\n\nMeanwhile I only ever have cold cereal for breakfast, or MAYBE if I'm feeling really ambitious some instant oatmeal and orange juice. I only even start to come alive halfway through my second cup of coffee and definitely don't feel like cooking in the morning.\n\nHowever my girlfriend obviously does. So recently I asked her if she'd start making breakfast for me, too. She asked if we were going to trade off and if I'd sometimes make breakfast for her, too. I told her \"no\" but reminded her that I do often make dinner for her. She said that since we trade off making dinner we should trade off making breakfast, too. I told her that there is no way I'll ever be able to muster that kind of energy first thing in the morning, but that since she obviously can that she should just make me breakfast too. I said that it would take next to no extra effort on her part to throw in a couple more eggs, strips of bacon, an extra portion of hashbrowns, etc since she's already doing it for herself, anyway. But it started a fight, with her saying that it wasn't fair for me to expect her to think of me in the morning since I don't do the same for her.\n\nShe seems to think that her making breakfast for me should figure into our division of labor and that I should do something extra in return. But I think that since she makes a huge breakfast for herself every morning anyway that throwing an extra portion of whatever she's making on for me would take next-to no effort on her part, so why should I have to do more for her in return than I already do?",
  "id": 1,
  "comments": [
    {
      "score": 55866,
      "content": "YTA LMFAO  \n\n\n\"Oh so we'll take turns making breakfast for each other? :D\"  \"Oh.. no you'll just make food for me, it's no extra effort for you anyways\"  \n\n\nThe CHEEK on you.",
      "id": 2,
      "comments": [
        {
          "score": 46189,
          "content": "Dude should have offered to make dinner every night in exchange for breakfast every morning from her.",
          "id": 3,
          "comments": [
            {
              "score": 11903,
              "content": "Right? The only way I could see this as N T A is if OP was down to make dinner as often (or in my personal opinion, more often) as the GF makes breakfast.\n\nC’mon OP. Obviously you’re aware of the energy required to do shit like make breakfast in the AM so you should be *at least* willing to reciprocate later in the day. Shit, I’d be tucking her in, kissing her goodnight and reading her a bedtime story if I could wake up to MFing bacon and eggs *some* mornings.\n\nEdit: To follow - why is the “extra work” for you (or her) in meal-making a transactional “should I, shouldn’t I?” situation, OP? I think in a healthy relationship, you could jump any opportunity to improve your SO’s life, be it rushed mornings or later at night. Especially since you’ve said it’s “no extra effort” to make you a breakfast alongside their own, it should be no extra effort to consider your partner as well. Also added YTA.",
              "id": 4,
              "comments": [
                {
                  "score": 6550,
                  "content": "I kept waiting for the “I make dinner every night”, but turns out he is just YTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3709,
                      "content": "I'd accept non dinner exchanges. My partner does 98% of the cooking, In turn I do 98% of the cleaning. Sure it's not much more work to cook for two rather than one, but it is more work, and OP isn't willing to offer *anything* in return? OP is the AH.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "This kid is absolutely not relationship material at all and she just be single. More people should he single instead of forcing relationships that they clearly aren't cut out for.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "“I often make dinner for her too” implying she also cooks dinner a lot, took me out!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "But but but he's also going to gift her a proposal!  /s",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "He is YTA. I also hate the idea that cooking for two is as as easy as cooking for one. Unless two\npeople like the exact same thing prepared the exact same way, it isn’t. I had this same argument with my partner, and fell for the logic that it would be easy and I’d be petty for saying no. But first, it is actually more dishes and prep and cleanup and, second, it’s the mental awareness to be thinking of her preferences and how she likes her eggs cooked and what she would like with them and how done she wants her toast and all the other things. People, even people who say they are happy with “whatever” are actually pretty particular. It took two weeks before I was basically making two separate breakfasts. \n\nBut I was making breakfast anyway, so it’s not a big deal, right?\n\nAnd it still wouldn’t have been except this happening everywhere. If I’m doing laundry could I do theirs too? It’s just…grows.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "That’s what got me he didn’t even offer anything in return and when she brought it up it was like that shouldn’t even be a consideration to him.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Same here I was like he'll say it any second now but nope. OP YTA",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Right? He could have at least offered to do all the dishes  or cover more of the rent. Offering more of anything would be better",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1667,
                  "content": "There are so many possible compromises OP could have offered. He could have offered to make more dinners, or to make breakfast on their days off (when it can happen after he's had a chance to wake up a bit), or to pick breakfasts where the prep can be done the night before when it's his turn.\n\nHe's not even making a *gesture* towards reciprocating. Just taking her work completely for granted.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 642,
                      "content": "I think I could sympathize more with OP if they had offered, or even considered to do something as replacement for breakfast from their SO.\n\nHowever, the entire last paragraph of their post reads their relationship as transactional - or at least that way from OP’s point of view. That’s not a healthy way to pilot your relationship, OP. Love/relationships and their intrinsics shouldn’t be a chore.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Hopefully he doesn’t propose.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "He's looking for wife service out of a girlfriend subscription.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Or he could have fucking *asked nicely* hahahaha",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 325,
                  "content": "Make dinner just about always. (unless something out of ordinary happens sachedule-wise or something) Then up your dinner game heavily to even things out duty-wise. Making some dinner that's more like elevated than just basic usuals could def help make things happen more effectively/evenly. Seems like the verbage used was a bit YTA-ish... But I don't hate the \"you do breakfast I'll do dinner\" concept if executed respectfully... Granted I live alone, and my last ex I lived with had an eating disorder... So I can't say I have a ton of experience in this department.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 237,
                      "content": ">But I don't hate the \"you do breakfast I'll do dinner\" concept if executed respectfully...\n\nJust about anything can factor into the division of labor in a healthy relationship if both people are genuinely ok with it. You even get happier outcomes if instead of trying to be too literal about 50% of everything you divide things by the tasks people prefer. If one person hates cleaning the bathroom and the other hates doing laundry, you'll both be happier dividing according to the tasks you don't mind and appreciating that your partner does the thing you hate. \n\nIn this case, what's broken is they have a 50-50 split for a communal meal and OP's gf is probably already not to thrilled about being on her own every breakfast, but OP went from \"not around so it's not in the division of labor\" to \"hey how about you do 100% of this thing.\"",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I would think even suggesting: \"*If you toss in extra for me for breakfast, I'll do all the breakfast cleanup*.\"(because he'll have had time to wake up)",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Agreed. It sounds like you and your ex had good communication and expectations on how food gets on the table. I think OP could benefit from this point of view!",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "This. \n\nWhen I’m sitting on my ass and my SO is upstairs working, I make an effort to care for him and start his coffee and cook up some eggs. I, however, do not eat breakfast most days. \n\nI do it because I love him and he is my partner. \n\nHe doesn’t ask me to do this and doesn’t ever expect it and it’s honestly nice to be able to do something to show care and affection for your partner. \n\nIn return, when I’m plastered to the couch come 7 pm when his work day ends (3 hours after mine), he generally offers to make me dinner. \n\nIt all evens out in the end. \n\nOP is being selfish and feels entitled to her non-refundable time. Makes you wonder why he wants to wife her up in the first place.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "\"(or in my honest opinion, more often)\"\nAgreed And OP YTA but why more often? Not attacking, just curious",
                  "id": 24,
                  "comments": [
                    {
                      "score": 30,
                      "content": "OP already acknowledged how it takes more effort/energy to make breakfast in the morning compared to dinner (or lunch) for them compared to their GF. In my personal and subjective opinion, I agree. It would be much harder to cook a full and delicious breakfast in the AM for two, than a full and delicious breakfast in the PM for two.\n\nSo, if I (personally, akin to OP’s stance) would expect breakfast some mornings with bacon or eggs from my SO, while being aware of how that energy is spent differently between us, I would *at least* be making dinner for us two most nights",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "[deleted]",
                  "id": 26,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Good man! Sounds like you deserved each other.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Exactly. She’s not your damned maid, and this isn’t a four star hotel. Get your lazy ass out of bed and try HELPING her make breakfast, you lazy git!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Cue the “but I work all day and I’m tired” whine.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 991,
              "content": "Yes. Because dinner is the other way around (in terms of who’s eating a lot vs. not much), so every time she makes dinner she’s cooking primarily for him. Yet when it’s him that would be cooking more for her, he thinks it’s an automatic No.",
              "id": 30,
              "comments": [
                {
                  "score": 342,
                  "content": "THIS.  Also, I'll bet that OP will be one who asks for eggs to be a certain way, and not to make french toast because he prefers pancakes, and please make sure there's OJ every day from now on. Etc etc.  So yes, GF can probably see that if she agrees, not only is it extra time and effort, but she'll have to start catering to his preferences etc as well. YTA",
                  "id": 31,
                  "comments": [
                    {
                      "score": 336,
                      "content": "Yeah, there's something about the fact that his girlfriend immediately asked if he would be helping, at all, that makes me think she's not as close to the proposal and kids point as he is...\n\nshe clearly sees what he's all about, and calls it out...  he's over here thinking everything is perfect...",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "And I bet (given that he is not a morning person) he'd expect her to wake him up when the food is ready and be grumpy that he's been shaken awake to eat the meal that she prepared, all while her own breakfast gets cold.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 632,
              "content": "This! How incredibly easy would it have been to offer a fair trade instead of expecting her bangmaid services? OP is a floppy turnip.",
              "id": 34,
              "comments": [
                {
                  "score": 39,
                  "content": "Floppy turnips are the worst. The worst!",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Hahahaha this is the best insult I’ve seen in a while",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "r/rareinsults",
                  "id": 37,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I love rare insults, especially the Scottish ones.\n\nJust my personal opinion, but the Scottish are some of the most creative and colourfully original -not to mention highly descriptive- when it comes to insulting others!",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "I’m going to use floppy turnip. This is excellent.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "FLOPPY TURNIP! the best wholesome insult in the history of the english language just sitting here, and me with an expired wholesome award?! well, take this instead. 🏆😂🙌",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Lol! I have a new insult I'm adding to my repertoire! Thank you!",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I love the \"floppy turnip\" 😂 and I agree. My rule in my house is if I cook dinner, you do the dishes. I commented that OP could do breakfast dishes as well as dinner of the same effort each night as a trade off. \n\nPersonally, I'd have no issue cooking my partner breakfast if I was a morning person. But I know he'd be appreciative, accept what I've given him, even if some is burnt or not great haha, not say anything about the quality and do dinner. \n\nSounds like the gf here is sick of picking up slack if that was her response and I understand that. I also think that, if OP isn't a morning person (neither am i) he should get up earlier to wake up and put the effort in as well",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 386,
              "content": "Logic AND decency? You sure are asking a lot of these adults!",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "Or the dishes at least",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "That was my first thought. She ain't gonna yes if this is his compromising skills 🤦",
              "id": 45,
              "comments": [
                {
                  "score": 22,
                  "content": "She *shouldn't* yes if this is how he compromises.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I love the “I often make dinner for you” line when they share dinner duty 50/50. Yeah man, she knows you make dinner half the time. That’s why she asked you to make breakfast half the time too",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "My boyfriend makes breakfast for us every morning and in exchange I make us dinner every night. Its super unfair you'd expect her to do more with little to no return. \n\nYTA, Op.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "This would be the best deal. I'm a morning person so when dinner rolls around, I'm usually not in the mood to cook anymore. I do cook, but my hearts not in it. I make amazing breakfasts, though!",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Or, if he didn't want to do that, just shrug and say, \"Okay,\" when she said she doesn't want to do it without some sort of exchange.\n\nAsking for him to pick up some extra effort if she's going to is reasonable.  Floating the idea and then moving on without rancor when the proposed exchange is something you're not willing (or capable) of doing is reasonable.\n\nExpecting her to pick up extra effort with no reciprocation AND THEN getting *huffy* when she won't do it is a problem.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3893,
          "content": "YTA. These kinds of posts always make me sad with how transactional the relationship is and then they tell you the actual division of labor and I don’t feel bad anymore. \n\nOP if you want her to put in extra effort to make you happy by making breakfast and make your life easier, where are you putting in extra effort just to make her happy and make her life easier?\n\nDon’t expect someone to give 110% and go out of their way to do extra stuff for you if you’re not gonna do the same.\n\nThanks for the awards! 😊",
          "id": 51,
          "comments": [
            {
              "score": 1647,
              "content": "Yeah I’m thinking there’s more to this because I would do it for my boyfriend if I was already cooking for myself because I don’t automatically think about what’s in it for me. So I’m wondering if the division of labour is all falling to her and she’s trying to set boundaries. Obviously just speculating, but it sounds very transactional and that’s not a healthy foundation for marriage and kids. If OP’s idea of a wife is someone who waits on him hand and foot, then he needs to learn now that’s not for her and how to be an equal partner before kids are even on the horizon.",
              "id": 52,
              "comments": [
                {
                  "score": 777,
                  "content": "Honestly the fact that they are using the terms and ideas of labor equality in their daily, it makes me think they have had discussions around this subject before… someone in this relationship has caused this to be a “thing” right? Makes me think she is making boundaries or might have had issues with OP originally. “You’re already washing and folding your own clothes, why not mine too” 😂",
                  "id": 53,
                  "comments": [
                    {
                      "score": 117,
                      "content": "Meh I don't know if I agree that one of them had to make this a Thing for it to be discussed. I was single for a long time and most of my friends were married so I saw what their division of labor looked like and knew I wouldn't be happy doing most of the housework no matter what the career situation looked like. So I thought up a few trade off chores I thought made sense. My husband agreed and we discuss and negotiate as life circumstances change. \n\nBut having said that, we for sure are more interested in loving each other and showing care for each other than making certain we both feel is equal.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "You just reminded me of a college BF who constantly snuck his dirty clothes into my hamper so I would unwittingly wash them. \n\nFucker.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Considering OP used language like \"should\" instead \"could\" I think I know who the culprit is.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "YTA OP. The whole scorekeeping thing is highly unfortunate, and other commenters are right -- this must be an existing, unresolved issue. A happy GF wouldn't have a problem adding OP to the breakfast routine, if it didn't feel like some entitled or unreciprocated thing. I feel the facts are not all in, based on her reaction.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 274,
                  "content": "Yes, exactly. My husband does ALL the cooking and loves to cook for me and our son. We don’t have any division of labor outlined (sometimes he cooks and cleans!!), but we both always contribute whatever we can to the household and enjoy doing for each other. It feels good and fair. And we always thank each other or show appreciation for each other. If OP isn’t contributing in any meaningful way, then no wonder his partner doesn’t want to do anything extra for him.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I have an extremely flexible schedule and as a result I try to do all of the housework and errands and crap Monday through Friday so we can enjoy time together as a family on the weekends.  Not once do I think: I did everything all week, I should be allowed to stay in bed all weekend. \n\nWhy? Because I'm not a fucking child.  YTA.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 627,
              "content": "YTA OP. \n\n> These kinds of posts always make me sad with how transactional the relationship \n\nSee I remember a video about this, someone asked how much should he given in a relationship and all said 50/50 until they got to this old lady and she went \"50/50 is only putting in half in, you both give 100% or there is bitterness'\n\nI never liked the idea of 'if you do this, I do that\" it should be 'I wanna do this' \nPeople just wanna act like relationships are a video game, almost scared to give more and wonder why bitterness happens and the relationship fails. But people seem to be more selfish than giving, I learnt that on Reddit, more what can you do for me, than what can we do together to make it better.",
              "id": 60,
              "comments": [
                {
                  "score": 282,
                  "content": "I like to view it as 75-75. Because sometimes you CANT give your all, and a lot of people (especially oldest children and girls) didn't learn how to LET someone take care of them, and sometimes the best thing for you is to let your partner take care of you. But you both have to be giving more than \"your half\" in order for your relationship to grow and progress and show that you love each other.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 73,
                      "content": "> But you both have to be giving more than \"your half\" in order for your relationship to grow and progress and show that you love each other.\n\nI fully agree with you. I think the 50/50 idea really ruins and confuses people in relationships but I do like your way of putting it too. More than half is needed.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I have explained it this way. It has to be 100-100. There are times that you can't give 100% though. There will be times of illness, work obligations and some other things will happen. This is when your partner has to step up and give extra. Sometimes you give 100% sometimes you have to give 130% because life happens. Just remember to give extra when you can in \"repayment\" because you do not want your partner to think you are using them, or get burnt out so they become so stressed and ill because they can't get a break.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": ">it should be 'I wanna do this' \n\nReminds me of a line from The Breakup, where Jennifer Aniston tells Vince Vaughn that she wants him to *want* to do the dishes, and he's like, that's insane why would anyone *want* to do the dishes, doing the dishes sucks. But it's not about her needing a guy who likes doing the dishes, it's about her needing a guy who is happy to share the workload with her (which iirc, he wasn't really doing at that point in the movie but it's been a while since I saw it).",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Love the give 100% bit.  My husband and I have a relationship that feels transactional a lot… from bills to cooking/cleaning and that can cause resentment for sure.  We had a heart to heart recently both admitting our arrangement worked, until it didn’t.  You have to make a conscious decision to celebrate each other",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "I've noticed that too - these \"relationships\"  are more like a business transaction than two people that care about each other.  Every little action needs to be \"tit for tat\".",
              "id": 66,
              "comments": [
                {
                  "score": 457,
                  "content": "\nThe trouble is that with cultural norms and assumptions, so much falls to the women just by default, despite  working full time and not having a time machine to magically have more hours in a day than the men. It has to come down to a measured approach to keep things balanced. I e had two serious long term relationships and both have had a LOT of resentment because I was *the women* so it’s my job to keep the household running, and make all the food plans, and do all the upkeep and domestic work, both physical and mental. If I’m working less? Yes absolutely, if I work more? GTFO with that bullshit.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 246,
                      "content": "THIS! I'm single by choice but in the vast majority of relationships of friends/family its ALWAYS the women who end up with the short end of the stick. With men making excuses such as they do this and that (uh - only when they feel like it) AND often insinuating to the women that family doesn't keep score on who does what. SMH. And OP is YTA.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 114,
                      "content": "Yes. This is true th point where even the perception of labour division is skewed. I remember they basically did a survey/study where they asked men how much they did at home and even the men who thought they were doing more than fifty percent of the work at home were almost always actually doing way less than fifty percent.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "In her book *If It Was Easy, They'd Call the Whole Damn Thing a Honeymoon*, Jenna McCarthy tells the story of a boyfriend who complained that the switch plates were dirty.   She asked him if he was licensed to operate a sponge in the state of California.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yeah, I think there's a difference between scorekeeping and expecting an equal division of household and mental labor. Scorekeeping or transactional relationships are like...keeping track of the monetary value of the gifts you give someone and expecting an equal or greater value in return, not \"if you want me to do more work, then you should also do more work so I don't end up doing everything. I like cooking and you don't, so you should clean more.\"",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I have way too many millennial friends that somehow put up with this in 2022. They do 90% something of all the housework because their boyfriends just never learned and they're really bad at learning...\n\nMy grandparents & parents have all split chores as long as I've existed depending on strength, likes, schedules etc. If you're an actual mature & supportive couple doing math in regards to this shouldn't be necessary. But here we still are in 2022 and I'd happily make a list and give it to a friend who could use one.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "So agreed! Relationships aren't jobs. When each person truly cares for the other, each shouldn't mind doing something extra once in awhile because it will, at some point, be returned. Or should be. An exact 50/50 split of tasks is unrealistic to achieve, but at times one partner will be doing more based on circumstances, and at other times, the other will do more based on circumstances. It's ebb and flow, give and take. It's never going to be 50/50 all the time, forever. People need to be flexible. For example, I have a chronic illness. When I feel good, I love to cook and cook dinner most of the time. When I'm not feeling well, my husband cooks. It might just be hot dogs or spaghetti, but he gladly does it. I love to cook, so I don't mind doing the majority of it most of the time. He and my son clean up after dinner. To me, that's a fair split, even though it takes more time to cook. I don't mind.\n\nI suspect the issue here is that the OP isn't pulling his share the majority of the time. Or he is, and she doesn't see it. They need to talk about more than the breakfast cooking.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 8,
                      "content": "This isn't once in a while. This is every weekday, and not because he can't but because he's too lazy to get up earlier. Nobody likes waking up for work, dude.",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "The trouble is that often the one being asked to shoulder a burden just ends up with more burdens. She needs to see if he is willing to take over something else because it says a great deal about his character.\n\nHe is dismissive of what it takes to cook breakfast. Of course he can't get up to make his own but it is no effort for her to make his breakfast. Of course it is effort to make his breakfast. The fact that he is already dismissive means he won't appreciate the effort. He is already taking it for granted and she isn't even making breakfast for him.\n\nHe needs to show that he values her by valuing what she does for them and trying to reciprocate. If she doesn't feel valued, and this request doesn't sound like he values her, then the relationship won't last.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "That’s just it. Relationships ARE transactional. Relationships are all about give and take. A successful relationship requires a mutual balance of give and take to fully succeed. When you have a relationship where one partner is constantly taking and not giving or only giving a little while the other is constantly expected to give without much if any take, it breeds anger and resentment in the heart of the one who is constantly expected to give and give and give some more while the other “partner” only takes and takes and takes. That is not a partnership and eventually the relationship will fail if changes aren’t made and the taker learns to actually be a true partner to their partner.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Only fools don't make chores transactional in any kind of relationship. Because if you depend on goodwill and love, you know the division of labor is going to topple the minute you are getting into an argument, or that time when you try to discuss how to do something better and yes, when you have kids and/or one of you stays home.Since this is a love-relationship, one would gladly take on all the chores when the other is sick or very busy. One might even do those extra eggs and hashbrowns, if your partner makes you feel loved by doing similar \"labors of love\".\n\nBut every relationship I know that did not negotiate things clearly fell into super gendered roles when the romance mellowed out, and you bet the \"if you love me, you would do this\" faction had soooo many fights about this.\n\nI watched them closely growing up, and I learned to sit down like an attorney with anyone I moved in with.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I read the first sentence and was worried, because all relationships are transactional - you give love you get love is the most wholesome version. But you got there with the \"what is he doing for her\" part",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "So very true.\n\nIf he's like this now, she might be wondering how marriage and raising children will be with OP, and how unfair the division of household labour will become.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1349,
          "content": "I’m sorry, but what kind of asshole makes breakfast spreads like that for one when more than one person lives under the roof? It really isn’t much more work. I couldn’t imagine going through the hassle of making eggs and bacon and not making a plate for my gf.",
          "id": 80,
          "comments": [
            {
              "score": 1478,
              "content": "Oh I absolutely think it’s bizarre that she’s not doing that. I just think his entitlement about it and the way he asks is even worse.",
              "id": 81,
              "comments": [
                {
                  "score": 462,
                  "content": "I sense it's two selfish people who got together or this is just a cover with a wider issue",
                  "id": 82,
                  "comments": [
                    {
                      "score": 842,
                      "content": "I don’t think she’s selfish. If I had to guess, she picks up most of the chores, and he doesn’t put as much effort in chores or cooking as she does. If they were in an equal relationship and got along well, she wouldn’t have a problem throwing some extra breakfast in the pan for him. His request was probably just one more fucking thing throughout her day she has to do for him.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "This. There's more going on here than her making breakfast for him while she's making it for herself. He sounds entitled.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's weird but my hunch is she has good reasons. This is probably not the first time so she might have a little resentment over their un-even workload. When I was in an abusive relationship & was being taking advantage of, I used to do shit like this all the time 😂 it just adds to the toxic dynamic. It always takes two.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 572,
              "content": "As someone who cooks, you say oh well it’s just two extra eggs or extra bacon. All those things take time and if you have a rhythm going for just cooking for one, it can 100% be thrown off by adding extra eggs or bacon. \n\nFour eggs disperses the heat in the pan so then your eggs take longer to cook. Also what if they like their eggs cooked to different temps. \n\nFour slices of French toast or four pancakes can’t all fit in one pan. He is not asking for something simple when you look at the actual timing of cooking for 1 vs 2.",
              "id": 86,
              "comments": [
                {
                  "score": 244,
                  "content": "It seems like a lot of people here don't understand physics. Making a larger breakfast will take time off her morning routine, all this so bf dear can sleep more and not shoulder any extra chores to compensate for her time. He can't compromise? Then he's demanding.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Right! He wants to sleep in or wake up slowly. I respect that. What about what she wants? What if that extra fifteen minutes a morning to feed you as well was her time for reading a book, or relaxing before work? Is her leisure time less important than his just because she wakes up earlier?",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 120,
                  "content": "Yeah it potentially means bigger pans that take longer to heat up etc. Things are rarely as simple as people demanding make them out to be.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "And then is he going to be ready to eat when the food is? I’m imagining that he because he struggles getting ready in the morning, he’ll be late to breakfast, the food will be cold, and he’ll complain. And want her to cook on his timeline in the morning, not hers, so that he has piping hot food.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 58,
                      "content": "YUP exactly what I was thinking. He can't possibly get out of bed to cook a breakfast, but he can pop right up to eat a hot breakfast when it's ready? That would be awfully convenient. If he's as ineffectual in the morning as he claims, he's going to get a cold, rubbery breakfast whenever he can be motivated to come downstairs... and nobody would want that every day.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Ding ding ding! This. I like to make over easy eggs. The time it takes to flip 4 eggs vs 2 can make the difference between a nice runny yolk and a hardened center, if you don't know what you're doing. It's not impossible, it's not even \"hard,\" but it's not as easy as \"throwing a couple extra on there.\" \n\nIt's not like doubling a muffin recipe where you just measure and pour more ingredients. Hot pan dishes require specific timing and pan space. YTA YTA YTA",
                  "id": 92,
                  "comments": [
                    {
                      "score": 6,
                      "content": "And this doesn't even cover the extra time if OP is a scrambled egg person whereas if GF is an over easy egg person. You can't cook them together in the same pan, and if you cook them separate, you either dirty two pans, or whichever one you finish first is going to taste worse (scramble will get cold and rubbery, or your over easy egg will not be perfectly runny and the edges will be cold and gross).",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "THIS. I was feeling this way every time OP inferred just a \"little extra effort.\"",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I'd be thrown off time wise just getting the extra eggs out of the refrigerator. It's easy to grab two eggs, but I'll have to take the whole carton out to get four without risking having a bad start to the morning.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I was going to say something similar but you’ve explained it already and better than I was going to. \n\nLike maybe she cooks the bacon at the same time as something else, like the hash browns or whatever. But now she’s suddenly cooking twice as much bacon and there’s no room in the pan for the other thing, so she has to cook them separately and keep the bacon warm in the meantime.\n\nIt’s isn’t too much extra effort if you’re making like oven chips and battered fish or chicken for dinner, sure, or a soup or stew - you’ll have to cut a bit of extra veg maybe. But something with as many moving parts as a fry up? You’re going to end up taking nearly twice as long.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "THANK YOU. So annoyed at all these people saying \"it's five minutes\", \"it's hardly any more work at all\", making pancakes in my household literally takes so long that we eat them while we're cooking, because you can only really do 1 or 2 at a time.\n\nLike, best case scenario, everything girlfriend eats from breakfast comes from a packet (bacon sure, but also easy quick pancake mix, premade hashbrowns or precut potatoes, premade french toast), and even then you may still have to do multiple batches because you can't fit it all in one pan. Doing it as a nice thing for my partner on a Sunday morning, as a one off? Absolutely! Feeding him every morning while he helps not at all? I am not your mother, feed yourself. I love doing things for my partner but the entitlement of OP is just hair-raising.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Also, it is different if you do it for yourself because you want to, or if you know someone is expecting you to do thus, is counting on you otherwise he'll go hungry and from what OP describes he wouldn't plan one second for preparing something for himself but completly relying on his gf. Strings are attached. \n\nIt is different if you know now you gave to get up and prepare this breakfast...",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 380,
              "content": "Some one who obviously top loads during breakfast and then “eats almost nothing for lunch and usually has a smallish dinner.” She’s not making a huge breakfast for no reason. She’s making a huge breakfast because that’s when she eats.\n\n> It really isn’t much more work. I couldn’t imagine going through the hassle of making eggs and bacon and not making a plate for my gf.\n\nFirst you call it that not that much work, then you call it a hassle. So which is it? Seriously if you think making one plate for yourself is a hassle, then making another set would be a hassle too.\n\nNot to mention she’s not making just eggs and bacon, but hash browns and pancakes, To make a breakfast for two of those items would mean OP would be awake, having coffee, just watching, probably picking at the food she has made while she makes the rest. Because guess what it ***is*** that much more work to make a **4 course breakfast** for more than one person.",
              "id": 99,
              "comments": [
                {
                  "score": 43,
                  "content": "I agree whole-heartedly. I'm always surprised in these things that people don't seem to realize that doubling the food you make in a large breakfast adds both time and dishes. Eggs, bacon, pancakes, and hash browns are typically all made in frying pan/skillet. It's pretty easy to do two eggs and 2-3 strips of bacon in a single pan at the same time, but not four eggs and 4-6 strips of bacon. Likewise, pancakes and hash browns for one, you can likely fit in a pan at the same time, but if you're doubling the food, it's going to be much harder, especially with the pancakes. You end up having to either use twice as many pans or you have to do twice as much time so that you can cook everything in sequence.\n\nThat said, it seems like there was a pretty obvious compromise that hasn't been mentioned, which is that OP does all of the breakfast dishes. But I'm guessing his \"not a morning person thing\" extends to waking up a little bit earlier to get ready so that he has time to do dishes in between eating breakfast and going out the door.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 22,
                      "content": "That or he cooks all of the dinners from now on AND does all of the dishes after dinner, since you’re correct in that even if she did cooked him breakfast every morning it’s highly unlikely that he would wash the dishes.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "And in the meantime she's lost that happy half hour she had to herself AND now Old Grumpy has stumbled to the table and made her morning all about him. Ugh",
                  "id": 102,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yes!! I was thinking the same thing. She may use the half hour as her alone time to do something for herself.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 323,
              "content": "Are you missing the part where OP wakes up later?! She would have to basically eat her breakfast and then cook another breakfast for him after she's done with hers and he's acting like is he _owed_ this while he can't even be bothered to cook dinner for her more often in exchange.\n\nOP, YTA.",
              "id": 104,
              "comments": [
                {
                  "score": 131,
                  "content": "I'm not on the OP's side at all...but reheating already cooked food is a thing.  That said, I wonder if the OP can't even be arsed to reheat already cooked food. \n\nI wonder if the staggered meal times between the two of them is going into the girlfriend's calculus.  When it comes to dinner, I'm guessing the two of them sit down and eat together. In such a case the labor of meal preparation comes with a reward--quality time.  But if the girlfriend is expected to prepare food without the benefit of quality time, I can see how she'd feel like that's a different kind of chore.  A chore you'd give to a bang maid.  \n\nIf I were advising her, I'd point out to her that she's in red flag territory. A guy who wants to have kids but is completely useless in the mornings isn't likely to be winning Dad of the Year awards. So she's right to be taking a stand.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Idk about you but I'd rather have cereal than reheated pancakes or worse, eggs.",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 239,
              "content": "I agree. When I’m making a breakfast like that it’s for the whole house 🤷🏽‍♀️. I don’t keep tallies but everyone is different. Agreeing to cook dinner every night should be a good comprise.",
              "id": 107,
              "comments": [
                {
                  "score": 164,
                  "content": "Or clean up after breakfast.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 203,
              "content": "Someone who's partner sees them as nothing more than what they can do for them. OP is entitled and clearly doesn't think about his partner and the partner shouldn't go out of their way to do things for OP when OP doesn't do anything solely for her",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I'm not sure if you were being sarcastic, and obviously we don't know their situation. But one (of many) possibilities on the table is that GF intentionally wakes up in time to start her day right, and that the daily breakfast is part of her self-care routine for mental sanity. Living with OP, sounds like she has to find or create it somehow. For all we know, she's not even actually a morning person? Waking up 30 minutes earlier than him doesn't give me that impression.   \n\nBut in all seriousness... if (hypothetically) most of the responsibilities/tasks are falling to GF, she could very easily face burnout from living with a transactional and unappreciative partner. Making herself breakfast sounds like the nicest thing anyone does for her.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "It’s not about the breakfast.",
              "id": 111,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I mean, it's completely different, imo. I can make sausages/bacon and eggs in one pan, throw a frozen hashbrown in the toaster oven, and make myself one round of french toast in a second pan. Doing it for two takes almost twice as long since most of those things aren't prep-heavy, most of the time is spent doing the actual cooking. So I'd have to do a second round of cooking (or I guess buy an extra set of pans and have all four going at one time, which is harder to manage than two).\n\nIf this is her routine, he's basically asking her to get up an extra 20ish minutes early to make him breakfast, and I don't think that's fair.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I think it's very likely OP is exaggerating the \"spread\" that is being produced.",
              "id": 113,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 587,
          "content": "Right? It sounds like the guy didn’t even offer to clean the dishes. I’d say no too. This woman should not have kids with this guy. Imagine how many “no extra effort” things she’ll be “asked” to do then.\n\nOP is TA",
          "id": 114,
          "comments": [
            {
              "score": 399,
              "content": "\"Why don't you do the laundry? You're at home with the kids all day its no extra effort! You're staying how with the kids- you can cook dinner too! The kid will be nappping by then, so you'll have the perfect break to make dinner. How about you do bath and bed time? The kids have been with you all day, I'll just wind them up... \"",
              "id": 115,
              "comments": [
                {
                  "score": 134,
                  "content": "Good, the wind me up is so triggering for me. Ugh",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Just reading this made me want to throw up.",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "She may as well cook every diner, since she's cooking anyways!",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "But he wants to at least have a couple of kids with her. He’s a good guy, right?/",
              "id": 119,
              "comments": [
                {
                  "score": 30,
                  "content": "Yeah I cringed at that statement too. It felt icky tbh",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "He's auditioning her to be his wife and using breakfast as the barometer.  But oh no, he won't trade off dinner with her?  He tried to pull a fast one on her and it backfired beautifully.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "That statement confused me. \"At least\" means, she's \"good enough\" in his perspective for \"at least a couple of kids\"? And the next/better Level would be someone he would like to have \"many many kids\" with? Or maybe she turns out to do well enough at the \"couple of kids\"-level, that he  considers her \"worthy\" to have a lot of kids with? The way he worded that really doesn't sound as if he sees her as a person/someone, who has a say in any of this.",
                  "id": 122,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "Good catch. It’s like she owes him her extra labor bc he’s decided to offer her the extreme privilege of marrying him and popping out several of his spawn. Why shouldn’t she do more work since her reward is him. /s",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Hopefully, she can already tell and that’s why she’s hesitant about constantly making him breakfast. Too bad OP didn’t take the hint.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "He should have led with dishes! This makes the most sense. She's made a lovely breakfast while he's waking up and getting caffinated and then he cleans up. The fact that he didn't think to offer this and she felt the need to bring up division of labor after so soon moving in together is an indication that Op is inconsiderate in other ways too when it comes to keeping up with his fair share of housework. The way the issue is raised has an entitled vibe to it. \n\nOp, YTA. Offer to make her dinner every night or to do all breakfast cleanup if you want someone to make a meal for you every morning. Your argument is horseshit in a partnership, we all do things we would have to do 100% on our own if a partner wasn't around, the point of being in a partnership is being able to divvy up certain responsibilities.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 433,
          "content": "Excellent use of the word cheek. 10/10.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 323,
          "content": "He kept reiterating **no extra effort** and that's so ignorant. Extra things take extra time OP! You're being entitled \n\nYTA",
          "id": 127,
          "comments": [
            {
              "score": 37,
              "content": "It’s no extra effort except somehow he could not possibly muster the energy to do it himself…",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "My favorite is that he says it's so hard for him to wake up and cook breakfast, but it wouldn't be ANY extra effort for her. Delusional much? OP you already know YTA, but have another because you're so entitled and unwilling to do the same for your gf that you're asking of her.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 196,
          "content": "Agreed!\n\nAlso, in my household, it’s everyone for themselves for breakfast and lunch. I make dinner every night — every single night. So, everyone can figure out breakfast and lunch for themselves or someone else take over. \n\nAnd, OP, at your age, if you can’t get up in the morning, time to reassess your sleep schedule.",
          "id": 130,
          "comments": [
            {
              "score": 102,
              "content": "OP is still an AH, but some of us have sleep disorders or chronotypes incompatible with society, y’know. Some people will *never* be alert in the morning.\n\nETA - I DID say that OP is still an AH. I can understand sleep inertia in the morning, but his demand/entitlement for a cooked breakfast *every day* with nothing to offer in return is a bit much, to put it kindly.",
              "id": 131,
              "comments": [
                {
                  "score": 43,
                  "content": "then you work with that. You make overnight oats, or prep a bunch of hard boiled eggs in advance, or sous vide eggs to be ready for the morning, or get precooked bacon so you can just nuke it for a minute. If OP's not happy with their breakfast routine, and the girlfriend isn't up for doubling her breakfast-making time in the mornings, then OP's gotta figure that out themselves.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Just wanted to chime in and agree on this one. I have what I suspect is a circadian rhythm disorder, and I have never functioned worth shit in the mornings. \n\nI just try to make up for it by doing helpful things later in the day when I’m functional, and there’s a standing agreement between me and my husband that expectations are looow for me in the morning, lol. (I also make no demands in the morning.)",
                  "id": 133,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Exactly. There's nothing especially virtuous about *morning* functionality or productivity (other than that being the expectation of morning people). Not being a morning person is fine, you still have the rest of the day to get things done!",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "I make breakfast for my wife every morning (bacon, eggs, toast, etc…) and even I think this dude is an AH",
          "id": 135,
          "comments": [
            {
              "score": 5,
              "content": "Hubby makes the bacon, I do eggs & bread & I clean up. More efficient as I can prep etc. while bacon sizzles.  He makes GREAT bacon; it's a win for me!",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "And he even closes saying \"why should I have to do more for her in return than I already do?\" I think that says it all. If he's not willing to do more for her... why should she do more for him?",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Hey now don't be upset he's super tired in the morning:(",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23775,
      "content": "YTA. You should make dinner every night if you want her to make you breakfast daily.",
      "id": 139,
      "comments": [
        {
          "score": 8119,
          "content": "He'd probably make a can of soup and still manage to leave a sink full of dishes.",
          "id": 140,
          "comments": [
            {
              "score": 1228,
              "content": "That's brilliant. Probably true as well.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 475,
              "content": "Lol…that is so true. I have watched my husband make something so simple and create a pile of dishes.",
              "id": 142,
              "comments": [
                {
                  "score": 177,
                  "content": "My bf and I just recently moved in together and I had to have a talk about this lol. Like how has 1 extra person increased the dishes 10 fold? Oh, because you’re using 4 different spoons to stir the pot. Could we not?",
                  "id": 143,
                  "comments": [
                    {
                      "score": 86,
                      "content": "Omg, my partner breaks out the large cutting board, 2 knives, a whisk, and multiple bowls to make toast.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "This is exactly why I'm against the \"I cook, you clean\" thing that people love to throw around for the division of housework. Nope, you cook and you clean all the pots, spoons, cutting boards, migs, knives, plates, vases you use. I cook and I will clean the one pot and spoon that I used.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 361,
              "content": "once in elementary school I was talking to the youth care worker. she was asking some questions about my family and asked if my dad was a good cook for some reason, can’t remember why. anyway, little kid me perked up, ready to show her how amazing my dad was, and said, “yep! he makes realllyyy good soup!”\n\nwhen she told me that soup wasn’t very hard to cook, I defended him by saying that he mixes multiple soups together to make one. was pretty damn impressive to me",
              "id": 146,
              "comments": [
                {
                  "score": 41,
                  "content": "Which soups would he mix together? There’s nothing wrong with taking simple and easy routes if they’re effective.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 42,
                      "content": "cream of celery, chicken, broccoli, ect. creamy.",
                      "id": 148,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 765,
          "content": "This is the most obvious compromise. GF makes breakfast OP makes dinner. \n\nRelationships aren't tit for tat - it's each partner playing to their strengths. OP isn't a morning person so asking him to make breakfast half the time isn't realistic. As long as the overall division on labour in the Relationship is fair its fine",
          "id": 149,
          "comments": [
            {
              "score": 383,
              "content": "[deleted]",
              "id": 150,
              "comments": [
                {
                  "score": 272,
                  "content": "I picked up on this too and I also think it’s odd. I’ve been with my partner for over a decade now but when we first moved in together we had fun “playing house”, cooking for each other, doing each others laundry, picking up the place together… it was all foreplay lol. \n\nI know every relationship is different, but this one kind of sounds like ESH. Like if the person I love and live with is hungry and I’m already cooking, then there’s no question that I would make some for them too, any meal, any day. Plus, sharing a meal is a great opportunity for quality time. I would def expect my partner to continue contributing to the household in other ways, (maybe I put this little breakfast favor in my pocket and pull it out when it’s time to take out the garbage or shovel the sidewalk) but the transactional tone of this conversation just feels so awkward to me. \n\nAnyway, good luck OP on your breakfast negotiations",
                  "id": 151,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I feel like this too. I don't count what each of us do but I quickly recognise an imbalance and start giving my husband jobs to do until he gets his butt into gear.\n\nHe also makes my morning coffee most days because I am not a morning person and that yummy hot coffee is usually all the motivation I need to get out of bed.\n\nI've also never cooked something for myself without offering it to everyone else. And when there is only two of you it's even easier. ESH they need to be a proper partnership that works together, not flatmates doing tit for tat.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Agreed, it's funny to see people in here talking about OP making the relationship transactional when that's what this sub does constantly. The sorts of petty behaviour this sub frequently encourages is everything wrong in relationships.\n\nOP definitely needs to offer something if he wants to enjoy cooked breakfasts every morning. However cooking every dinner is unreasonable, dinner takes significantly more time, effort and preparation than a couple eggs and some bacon thrown on a pan.\n\nA really nice lunch is far more comparable.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Yup, you nailed it. She's got her routine, and he's got his. They're a bit mutually exclusive at the moment, they'll either learn to merge cooperatively or this relationship will fail.\n\nMy wife for example wouldn't think twice about throwing a few extra things in for me. It'd be weird for her to make something just for herself without even thinking about me.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Yeah this. If I was already doing it then I would just do it. I wouldn't even expect anything in return for something I'm already doing.",
                  "id": 155,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "My purely speculative guess is that she hasn’t offered to do this because the division of labor is already not equal. It’s like that job where you can NEVER do something extra because you’ll be stuck doing it forever and ever and it’s just expected and you get nothing in return, not a raise or even acknowledgement. \n\nOr it could be that there isn’t an unequal exchange but that they just split everything evenly, to a painful extent, and just never offer to do extras for each other (see: keeping score). And now all of the sudden he’s trying to change that but in a weird manipulative way that only sees her doing something for him.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I'm not a morning person. My partner is. It took a while for him to realise its not laziness. Probably a bit of that going on",
                  "id": 157,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 290,
          "content": "I can't believe this didn't occur to him as a compromise.\n\n\"There is no free...\" breakfast.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 167,
          "content": "I bet if she wouldn't make dinner, he would make dinner for himself. So what if she walks in and say \"GmHey, you already make dinner, why don't you make also something for me? To add another steak isn’t more effort! You are cooking anyway!\" This is the same as he does with the breakfast.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 77,
          "content": "I'm one of the laziest people out there but I still make my own fucking breakfast.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "This is the answer! Give and take OP.",
          "id": 161,
          "comments": [
            {
              "score": 15,
              "content": "Or \"can you make breakfast and I'll clean up after?\" \n\nLike, I get not being completely functional early if you're not normally a morning person, but that doesn't mean you don't have to put *any* effort in",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "At the very least second breakfast. They can trade off on elevenses.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "So obvious.\n\nWait until he one day had kids, lol. Better figure out how to be a morning person.\n\nYou can't negotiate with those little terrorists.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "yeah the comment of “i sometimes make dinner for you!!” is so fucking funny because that implies she does 50% of the time or most the time hahahaha",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22931,
      "content": "You’re talking about proposing and kids. \n\nWill she Never get a morning off from kids because you hate mornings?  She’s already up so she should be the one to pack bags and lunches and cook Everyone breakfast?  She’s breastfeeding so you never need to cover the night wake ups?  She’s home earlier “often” and that’s the person who starts dinner and picks up the kids and deals with the homework but you’re totally doing 50/50. She’s washing her clothes anyway so it’s no extra effort to put yours in - then fold them and put them away cause she’s doing that for the rest of the load right? \n\nIt sounds like she already feels like she’s doing more and now you’re asking for something else.  If it would require effort and energy for you to do it, it requires effort and energy for her to do it. This may be a small amount of additional energy for this one thing but it makes me wonder if she’s already feeling that she’s putting out significantly more effort for household duties as it stands.\n\nEdit - thanks for the awards!\n\nOh. And YTA",
      "id": 166,
      "comments": [
        {
          "score": 3423,
          "content": "My thoughts exactly. I was never a morning person but I learned to get moving and take care of my kids. He better rethink marriage if he thinks this excuse will work. OP is the TA and better grow up soon!",
          "id": 167,
          "comments": [
            {
              "score": 1054,
              "content": "I wouldn’t be surprised if OP has trouble getting out of bed in the mornings because he regularly stays up till the wee morning hours. If so, then once he has kids he’s going to have to learn really fast how to go to bed at a reasonable hour.",
              "id": 168,
              "comments": [
                {
                  "score": 533,
                  "content": "I’m in bed by 10:00 every night. Get my 8 hours then I’m up a hair before my toddler usually wakes. Still hate mornings, still feel like crud for the first 90 minutes. OP is TA for his attitude - we don’t need to come up with other reasons to judge him.",
                  "id": 169,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Yeah some people just aren’t morning people no matter how much sleep they get. It’s just a case of pushing yourself through it when you have responsibilities, and that includes putting in effort to make breakfast instead of relying on your other half to do it *every* morning. \n\nI can’t help but think of all the mothers out there who only get breakfast made for them on Mother’s Day and it’s such a “special” thing to do. Well, how about making breakfast for them regularly? I think that would be more appreciated.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 138,
                  "content": "Yeah, and if that is not the case, and OP is going to bed at a reasonable time, OP should get a sleep study done.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I was never a morning person for decades, but then I hit 50 and it all flipped. Now I have difficulty sleeping past 8 to 8:30 am. So don't be surprised if that eventually changes.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 9,
                      "content": "That's not surprising, [sleeping patterns tend to change as we age](https://medlineplus.gov/ency/article/004018.htm). \n\nThe conventional wisdom used to be that older people simply needed less sleep. Some sources used to claim (and some still do, I'm sure) that this was because a lot of our \"repair processes\" happen during we sleep (which is true), and obviously the body does less of all of that as we age, so less repair = less sleep. More recent research, though, shows that's not really true: older people *need* as much sleep (if not slightly more, because the repair and regeneration that *does* happen can take longer and be more resource-intensive), but often have a harder time *getting* it. They wake up more often, sleep less deeply, and wake earlier in the morning. \n\nI’ve seen conflicting research as to why many older people *feel* like they need less sleep, even when they (in the studies I’ve seen) objectively benefit from more than they normally get. One suggested the “things” that tells us when we need sleep and make us sleepy may function less effectively as we age.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1019,
          "content": "I think he said that so Reddit will be like, \"look at that great guy thinking to put a ring on it\" like dude overthinks his value in his relationship and thought we'll pat him on the back for it. \n\nDude, you not the prize you think you are.",
          "id": 174,
          "comments": [
            {
              "score": 234,
              "content": "[deleted]",
              "id": 175,
              "comments": [
                {
                  "score": 91,
                  "content": "Holy shit, I didn't even notice the post is *2 hours old* already. It's that obvious!\n\nYTA OP!",
                  "id": 176,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 134,
              "content": "The way he phrased it as a smart obvious move and not, I don't know... a well thought decision based on love and mutual respect, I knew from there he was gonna be TA\nIt felt like \"yeah I plan to lock her up ASAP as she's a good bangmaid\"",
              "id": 177,
              "comments": [
                {
                  "score": 12,
                  "content": "That's why he moved in with her!  All he wants is someone who will cook and clean for him because he doesn't have the energy to get up in the morning.  I wouldn't have thought him an a-hole except for when he rejected the suggestion about trading off dinner and breakfast.\n\nSomeone is not automatically a morning person; you train yourself to be one.  I'll admit it right now that I move slow in the morning.  The way that I got myself re-acclimated after being up early during college  was after my mom came home from the hospital after having major surgery.  \n\nHowever, as an adult, it's up to me to have my belongings for work packed the night before, food ready to take with me in the morning, and set an alarm so I can be up.  Relying on everyone else to get *me* going in the morning is not my responsibility.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 856,
          "content": "I cannot upvote the enough. I have a child with a non-morning person, and even though I AM a morning person, I haven't had a weekend morning in 3 years where I wasn't the one making her breakfast or getting her dressed or taking her to the playground before it gets too hot. I'm a SAHM so I don't mind doing the day-to-day chores during the week, especially now that she's in school, but damn if I don't want just one Saturday every couple weeks where I'M the one that gets to lay in bed and watch TV without taking care of someone else. This is literally the only point of contention in my marriage but because it covers such a long period of time, it gets to you in a huge way. OP, YTA because it should be 50/50 in a relationship. If you want breakfast that means you take FULL responsibility of another chore. That includes the mental labor. So if you take dinner, that means you have to budget, plan it out, buy the groceries, and then cook and clean up. Maybe if you're lucky, some days she will do the dishes because she loves you. But if all you do is take in a relationship, she is going to get sick of your shit and leave.\n\n&#x200B;\n\nEdit: Wow I hardly ever comment on AITA so thank you for all the love and the award!",
          "id": 179,
          "comments": [
            {
              "score": 127,
              "content": "Sending you so much love and appreciation. Having a toddler morning person is no joke. Bless you for dealing with it daily. \n\nOur kid wakes up full of smiles and sunshine at the crack of dawn. I still can’t figure out how she does it. She definitely got it from her dad and between the two of them, I feel like an absolute toad each morning. I’m not awake for at least another hour even if I’m staring them in the face.\n\nHopefully, your partner catches on real quick so you can get a few dozen mornings of sleeping in. Maybe a few hundred.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "I also have children with a non-morning person (mostly due to his work schedule) and while I'm not naturally a morning person, it still comes easier to me. That means I've been forced into the morning person role of parenting for years. It's easier now that they're old enough to not need me the minute they wake up, but fuck I hate waking up at 6am every day for school, and at 6am almost every weekend because my circadian rhythm is practically engraved in stone at this point. Maybe I want to sleep in occasionally. Maybe I'm tired of always being the one to put the kids on the bus in the morning. It doesn't always feel fair. But I make it work because I understand that my husband's job doesn't always have the most reasonable scheduling and the brief times when his schedule lines is better with mine and the kids, he has no problems helping out in the mornings so it's not an unwillingness on his part to share the labor, just scheduling. Our compromise is that if I have to handle all the morning routines, he is handling all the night routines. If I'm waking them up, picking clothes, packing lunches, finding homework, and waiting in the cold for the bus at the crack of dawn, then he is making sure they get washed, get into jammies, brush their teeth, find their missing stuffed animal they haven't mentioned in days, reading bedtime stories, and making sure they actually stay in bed. \n\nIf I'm in charge of starting the day, he is in charge of finishing it.",
              "id": 181,
              "comments": [
                {
                  "score": 14,
                  "content": "That's a fair balance, and I think it's so important for dad and kids to have their own special routines together outside of other playing times! Our daughter is 3 and going through a phase where she WILL NOT entertain the idea of her dad putting her to bed, so that also falls on me BUT since I have to do that, my husband cleans the kitchen every. single. night. after dinner to the standards that I've set so it balances out in my eyes!",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "If all you want is a Saturday once in a while where you aren’t in charge… is this something you can ask for? It seems eminently reasonable.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "when I was 5 my mom picked a cartoon I liked that came on at 8:00 Saturday mornings and told me not to wake her up until that cartoon ended. \n\nGranted 8:30 is still early but at least I didn't bother her earlier than that.",
              "id": 184,
              "comments": [
                {
                  "score": 8,
                  "content": "i think when she’s older and can pour some cereal for herself we will definitely implement a system like this 😂",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 243,
          "content": "I had to look so far down to see anyone else who understood this the way I do. Maybe because I’m a mom. But damn, this “I don’t do mornings” thing is starting way too early. \n\nOP, get your lazy ass out of bed and force yourself to be productive. Your whole post was an excuse, not reality. \n\nI get it. I’m a morning person. Many people I know, with whom I’ve lived, are not. But life happens. They get up in the morning and suck it up, just like I stay up later than I’d like. It’s called being an adult.",
          "id": 186,
          "comments": [
            {
              "score": 26,
              "content": "I don’t think the morning part of it even matters that much. All he had to do was offer to do something to help her out and take on more labor somewhere else. The dude’s an entitled ass. She even tried to help him out by suggesting he do that since he’s too self centered to think of it in his own, and he still refused.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "One more little thing is never actually one more little thing. \n\nI like that he argues that he “makes dinner” and still obliviously posts her response that dinner is split 50/50. I’m gonna guess many of the things he “helps” with around the house are actually a similar split.",
          "id": 188,
          "comments": [
            {
              "score": 15,
              "content": "He said he makes dinner 'often'...which actually sounds like less than 50% to me, or else he'd have been more specific",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I do the bare minimum, why isn't she lavishing me with praise and offering to do it all?",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 111,
          "content": "And because she’s doing this work with the kids, it all leads into “you’re better with the kids so…”",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 92,
          "content": "This 100% sums up my marriage with my STBX husband. Note how I say ex there. OP better make some changes.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I totally agree",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "He gonna lose her",
          "id": 194,
          "comments": [
            {
              "score": 21,
              "content": "Those imaginary kids are gonna stay imaginary",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I was thinking about alllll of that as soon as he said he wants to propose. And in my head I'm like she's gonna say a big fat NO",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8872,
      "content": "I’m trying to understand because I didn’t get it.\nYou want her to maker breakfast for two in the morning because you don’t have the strength to but it’s not supposed to count as a chore like the rest?",
      "id": 197,
      "comments": [
        {
          "score": 2155,
          "content": "But don't you see, it's \"next-to no effort on her part\" 🙄  \n\nOP, you are massively undervaluing your GF's labor. If you marry and have kids w/o adjusting your attitudes, it will end in divorce or a miserable, resent-filled partnership.",
          "id": 198,
          "comments": [
            {
              "score": 339,
              "content": "THIS. And honestly I believe if OP were really contributing to the relationship his GF likely wouldn't have minded making him BF. BUT I get the sense she's already feeling he doesn't do his part and therefore her reaction.  OP needs to step up, like my dude get creative! Find a compromise that works because I'd be doing a lot for someone who'd make me breakfast like that every day. YTA",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "Even if she did go out of her way to make him breakfast what’s the guarantee that the kitchen will be cleaned up? Dishes washed and put away same with the dishes that he used for his meal? I’m 100% sure he would leave the dishes dirty and if she would call him out on it he would pull the “well you originally took everything out to make breakfast for yourself” card and won’t clean up after himself.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "The way OP wrote “I can see myself proposing soon and having at least a few kids with her” says *a lot*.\n\nYou don’t get married because you kinda like the person you’re living with and getting married is something you do because you’re bored and you got nothing better to do or if you’re boyfriend/girlfriend is convenient to have around.\n\nYou get married after building a solid foundation to a relationship of clear communication, trust, and knowing that both of you will change over time (among other traits).\n\nIf OP and his girlfriend can’t get over this, I’d say they should live away separately and then assess if they’re relationship is solid enough to live together again and make the house, the place where their partner is, a True Home.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 485,
          "content": "[removed]",
          "id": 202,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 170,
          "content": "And once they are married and have kids he will expect the kids to just be lumped in with that morning “nicety” as he continues to “do dinner sometimes”. Some of these Asshole posts are mind boggling with how oblivious they are",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "Just make me breakfast too, it's no extra effort.\n\nNo I don't want to make breakfast myself. It's too much extra effort.",
          "id": 204,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5692,
      "content": "YTA. If you want her to cook you breakfast every morning, you should cook dinner every night.",
      "id": 205,
      "comments": [
        {
          "score": 2026,
          "content": "Especially since it sounds like she doesn’t eat much for lunch/dinner… how much extra work could it be OP? You’re already presumably feeding yourself for dinner, just make extra for her for dinner.",
          "id": 206,
          "comments": [
            {
              "score": 678,
              "content": "Right? I mean, he’s already up and making dinner…how much extra work is it to add a bit more meat and veg? Next to no effort, according to OP.",
              "id": 207,
              "comments": [
                {
                  "score": 28,
                  "content": "Funny enough I would argue that it's usually easier to make dinner for an extra person than breakfast for an extra person assuming they don't have a restaurant flattop",
                  "id": 208,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 147,
              "content": "Yeah and OP's a night person so he always has extra energy in the evenings, it's just an extra portion right OP?",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "Sounds like the perfect solution right here, OP!",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Second this! OP sounds lazy and entitled.",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "For real. With his logic it will be easy for him since he is not a morning person",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "OP I think the thing you’re not considering is that she already cooks breakfast 100% of the time and dinner 50% of the time. So\nshe cooks 75% of her meals and 50% of yours. She sucks it up because you don’t eat breakfast. But now you are saying that you want to eat breakfast without having to help her out with the cooking. So she’d be cooking 75% of her meals and 75% of yours. I agree with others who say you’re N T A to have asked, but YTA for refusing to acknowledge the imbalance in the current arrangement, and the even bigger imbalance in the arrangement you’re suggesting. If you want a fair partnership you have to carry half of HER load, not just half of yours.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4518,
      "content": "If waking up 30 min earlier and helping make breakfast feels impossible—and you somehow think you’ll have kids someday and preserve this childish preference—then YTA.",
      "id": 214,
      "comments": [
        {
          "score": 716,
          "content": "Yep, sounds like the kind of person who will trade off the little he does so he doesn’t have to ‘babysit’ his kids",
          "id": 215,
          "comments": [
            {
              "score": 138,
              "content": "Lol I often hear that the whole babysitting his kids \n\n\nUm no you had sex and had a baby it's called a full time job........seriously so cringe like it you don't want to be a parent it's called get a vasectomy and don't have kids and he's already complaining about getting up early fuck I hate ro think how he's gonna deal with a baby crying at all hours it for sure will be a rude awakening",
              "id": 216,
              "comments": [
                {
                  "score": 10,
                  "content": "100% he will be the kind of guy to say \"she is already getting up to do the breastfeeding, it's next to no effort to do the changing too\", and wham now you have one partner doing all the night duties and resentment will build faster than he can say 'child support'.",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "\"You're already breastfeeding them, how much more work is it to also change their diaper and get them back to sleep every night? I have to get up for that and I'm grumpy when I'm tired\"",
              "id": 218,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "Exactly. He’ll be snoozing while she’s trying to cook for everyone, with a fussy baby holding onto her leg and their older toddler yelling from the bathroom, “Mom, come wipe me!”",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yeah I'm surprised by the number of other adults responding here that even though he's an AH, they seem to understand the fact that he's \"not a morning person.\" Look, I'm not a morning person in that I don't bound out of bed everyday at 6AM happy. Which I get that some people do. But I think in general MOST people aren't \"morning people.\" So to be a full grown adult pulling the \"I can't, I'm not a morning person\" card just seems immature. None of us are, dude. But we get up anyway.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Yeah you can't sleep in with kids unless you're a real ___.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "That’s kinda what I was thinking too. I know myself, I know i’m fairly incapable of waking up super earlier like OP- this is (one reason) why I know having kids is not a good option for me! It’s a hard reality, but if more people realized that they won’t be a ‘good’ parent, there would be a lot less lonely and neglected children out there.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yea OP should probably not have kids.",
          "id": 223,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "As someone with ADHD who is legitimately anxious about how I will one day wake up for kids-\n\n\n-I'd offer to do the dishes after. It's not that hard, OP! We play to our strengths!",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Breh. Just take care of both the kids this morning, its not a big deal you are already taking care of one. /s OP you're an asshole and you need to understand mental load before you persue this relationship as seriously as you talk.",
          "id": 225,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2830,
      "content": "Ah, I remember the early days of counting up all you do and all they do. The worst part, but natural to have to get past.\n\nMy problem here is your unwillingness to try. Or to say, is there anything else I could do because I'd appreciate it so much even if you could make me a breakfast every once and a while.\n\nAlso that you think it's going to be 0 less effort. Not true, nor is the cost.\n\nThere's bound to be a way to sort it but it's about your attitudes.\n\nGood luck.",
      "id": 226,
      "comments": [
        {
          "score": 2132,
          "content": "Bruh, it's even worse. Someone asked if OP helps in other ways and he said he \"makes the bed and does yard work\" (so basically, he does nothing because making a bed takes like a minute, and yardwork is not daily), and he said that his gf cooks dinner most of the time because she gets home first. So, basically, his girlfriend is doing all of the household work on top of having a job.  \n\n\nHe sounds like he puts next to 0 effort into help and expects his gf to do even more than she's already doing. I understand his gf looking for a trade-off in this case because she's probably tired of doing most of the work.",
          "id": 227,
          "comments": [
            {
              "score": 940,
              "content": "Yea, he has a great life where he doesn't do much. That's why he wants to marry her.",
              "id": 228,
              "comments": [
                {
                  "score": 521,
                  "content": "So they can have a couple.of.kids that she will have to take care of.",
                  "id": 229,
                  "comments": [
                    {
                      "score": 224,
                      "content": "Looks like she already has one, so a couple more couldn't be much more work right?",
                      "id": 230,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "Gotta really lock down the free ride and make it super hard for her to leave.",
                      "id": 231,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 314,
              "content": "But he plans to propose soon and have at least a couple of kids with her. That has to account for something! /s",
              "id": 232,
              "comments": [
                {
                  "score": 164,
                  "content": "The way he wrote that hit me kind of funny but I’m not sure why.",
                  "id": 233,
                  "comments": [
                    {
                      "score": 185,
                      "content": "Same. It came off as callous to me, as if she was chosen from a rack of potential women to check this part of his life off his “to do” list.",
                      "id": 234,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 40,
                      "content": "The “have at least a couple of kids with her” phrasing made it look to me like there was more in his life to come after that. Like there might be more kids with someone else later? He probably didn’t intend it that way but it looked strange, just giving the early steps not the long term.\n\nCertainly Mr. I-Can’t-Do-Anything-In-The-Morning-Except-Eat shouldn’t be having kids with anyone until he can get himself out of bed in time to pull his weight.",
                      "id": 235,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "He mentioned having kids the same way I talk about buying some potatoes for the week",
                      "id": 236,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Because it's so casually thrown out there, and you know he's going to do about 5% of raising them.",
                      "id": 237,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "That he led with it, says it all. Dude thinks: \n\n1: all men are - or at least HE is - superior to all women, therefore they should be so lucky that he is wiling to marry one, so boy does she ever owe him for that, and good luck to her ever working off such a huge debt. Making him breakfast every day is a DROP in the OCEAN compared to that\n\n2: we will congratulate him for being so amazing, and automatically take his side no matter what he says next",
                      "id": 238,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "wonder if they talked about that yet. Sounds like OP wants a wife that does all the house hold chores and raises kids. She may not be on the same page there",
                  "id": 239,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 307,
              "content": "Oh FFS. She hardly eats dinner but she’s usually making his? This explains why he’s gotten so entitled, I suppose.",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Making the bed isn’t even a fucking chore.\n\n\nI bet I can guess who’s responsiblefor \n\n- Stripping the bed, \n- washing the sheets \n- then remaking the bed",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Okay this changes so much for me. I hadn’t seen this in any of the other top threads so I thought people were being a little harsh. I wouldn’t think much of asking the same thing from my partner but I haven’t shoved all the other house work onto them either. I’d be pretty shocked to get such a cold response so I was thinking there has to be more to this story about their division of labor. Thanks for filling in the gaps.",
              "id": 242,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "He makes the bed because he’s still in it when she gets up so she can’t. Quite possibly she’s done what she can so it’s only his side he’s talking about. \nIt sounds a bit like every single thing he does is massive and should be applauded but it “comes easy” to her so they’re basically putting in the same amount of work…",
              "id": 243,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Ooof, yeah. \n\nIf I'm making breakfast for myself, I usually throw some extra on for my partner. It's nbd, but my partner also contributes a lot to household chores. We don't get into these pissing matches over who does what because we're both involved in home upkeep and daily life chores. \n\nGf is salty because he's not pulling his weight, otherwise I doubt she'd be bothered to make him some breakfast along with her own.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 134,
          "content": "This advice will double the length of any serious relationship.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "Yep .. who buys the breakfast supplies? Why can’t you buy ready made breakfast meals, like I another non morning person, so you’re not eating cereal? Is it up to her to come up with even the idea of how to feed you? Talk about laying the mental burden on someone else because you don’t ”have the energy” to find a reciprocation for this act of service you are requesting.",
          "id": 246,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "The fact that his GF responded with asking what will he do in return, makes me think she “know his number “ and is well aware his asking more and giving less.  Good for her not being a doormat. \nInstead of thinking, wow she is really helping me with my morning, let me do something helpful in return, he is automatically looking for a way to help less.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2309,
      "content": "You are not an asshole for asking. You are absolutely an asshole for insisting after she made a very reasonable suggestion. You already share dinner cooking responsibilities, so it is perfectly reasonable to request the same for breakfast. You just want to take advantage of the fact she is up. And no it isn't just slapping down some extra food. All the planning and prep work also changes. So no, it isn't just slap on a couple of extra things and call it good. If you don't want to share in that work too, then I don't blame her at all for turning you down.\n\nYTA",
      "id": 248,
      "comments": [
        {
          "score": 418,
          "content": "Also cleanup is a bit more, agreed.",
          "id": 249,
          "comments": [
            {
              "score": 307,
              "content": "I would consider it fair if OP did all the clean up for breakfast.",
              "id": 250,
              "comments": [
                {
                  "score": 116,
                  "content": "This, yeah. My GF and I trade cooking and cleanup. In OP’s case, him taking over the cleaning could well make up for the added effort it costs his GF to make breakfast for him as well as for herself.",
                  "id": 251,
                  "comments": [
                    {
                      "score": 9,
                      "content": "That is literally how my husband and I split duties. I cook\n He cleans. The end.",
                      "id": 252,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "Right, the \"throw on a few more eggs\" and whatnot is such a ridiculous premise. If she does this daily, she has a system: how much food she goes through in a week, what goes in what pan, when to start each item so they're ready together, etc. Unless they have a Waffle House style cooktop, it definitely changes her process to cook for a second person. Is OP going to help buy more food, or feel entitled to make requests? If she has to reuse a pan in order to accommodate him, is OP going to expect to eat the fresh food while she keeps cooking? \n\nEven if everything else in the division of labor was perfect, OP is TA for dismissing her work as nothing and then expecting her to go out of her way for him.",
          "id": 253,
          "comments": [
            {
              "score": 8,
              "content": "And like eggs and bacon may be relatively simple but when you go into pancake and french toast territory that definitely requires more work and planning to make extra",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Fact that he doesn't understand this makes me wonder what sort of dinner he's preparing for the both of them. The microwavable kind??",
          "id": 255,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "If its no effort for her to just cook more, why is it so much more effort to offer dinner every night? Like it’s no big deal cos he’s more a night person and it’d be just chucking extra food into a pan? He is absolutely TA.",
          "id": 256,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1967,
      "content": "Idk I mean I would never cook food in our house while my boyfriend is home without offering to make some for him. But at the same time something about your attitude in this post makes me think she has her reasons for not wanting to do something nice for you. The thing you’re asking for is generally reasonable but your whole tone about it is weirdly entitled and annoying. \n\nDoes she agree that things are really good in your relationship? I’d be questioning that assumption right now if I were you. A person who feels loved and happy in their relationship is generally glad to do something like this for their partner. The fact that she went to asking you to do something to balance it out makes me think there’s an imbalance in other parts of your relationship. Either that or she’s just very transactional about things. Hard to give a judgement on this one without knowing the people and relationship involved better.",
      "id": 257,
      "comments": [
        {
          "score": 726,
          "content": "Yeah I was immediately like - these people actually do not like each other.",
          "id": 258,
          "comments": [
            {
              "score": 12,
              "content": "Yup.\n\nI get that feeling about so many threads here though, it makes me wonder whether \"liking each other\" looks different than I would expect for most people.",
              "id": 259,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Ya maybe unpopular opinion here but. If I was making breakfast for myself I would just automatically make some for my husband. I wouldn't even think of NOT doing it. It seems like she doesn't like him that much.",
              "id": 260,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 292,
          "content": "Was thinking the same. I would never say no to making my husband breakfast if I was already doing it and he was asking. But he’s a responsible adult who shares responsibilities in our home equally and would happily step up to take something else off my plate without being asked if I was doing it every day. I do most of our cooking and it would be weird not to cook for both of us. I’m not sure these people even like each other.",
          "id": 261,
          "comments": [
            {
              "score": 17,
              "content": "For me, it's the expectation. Yes, he technically asked, but it sounds like it wasn't so much a question as a demand. I happily make my partner breakfast whenever I'm making some for myself. But if he insisted on me doing it every single morning so he could sleep in? I don't think I'd be as amenable. \n\nThis post makes him sound entitled, like next it won't be enough that she cooked him breakfast: she plated hers, why can't she plate his and have it waiting on the table, too? She's already pouring a cup of coffee, why didn't she pour him one and have it waiting next to his plate? I know that's reading a lot into the post, but something about it just rubs me the wrong way.",
              "id": 262,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I'm with you. If I'm making any kind of food, I'm offering to make extra for my partner. My partner contributes towards our household chores, so it's not a big deal to me. \n\nBuuuut, based on some other responses here, it seems that OP doesn't contribute much in his household. That is why the gf is being salty and expecting something in return. She's already doing everything by herself and is trying to use this opportunity to push him into helping.",
              "id": 263,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "I felt the same tone with the post. It’s almost like he creates more work for her in the relationship and she’s trying to put up a boundary with him. i think that if he was already picking up responsibilities elsewhere she’d be willing to do this. \n\nA healthy partnership has both people creating solutions to life’s obstacles and both adults actively adding their value to the relationship to make life more simple for one another. \nTheir dynamic seems like he wants to be taken care of but won’t reciprocate and if asked he will make excuses or justify his way out of stepping into the adult role of caring for his partner.",
          "id": 264,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Came here to say this. Of course if I was making myself breakfast every morning, I would make some for my partner if he asked. I can’t figure out why I wouldn’t so this screams to me that the GF is definitely unhappy in the relationship.",
          "id": 265,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "perfect response honestly. \n\nboth of them have a transactional attitude. \n\ndoesn't sound like a healthy loving relationship.",
          "id": 266,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "It sounds like from other posts the bf makes the bed and does some yard work.  Sounds like gf does everything except a few dinners. She’s not wanting to raise a child but have a bf the way it sounds. Op sounds like he’s wanting a mom not a relationship",
          "id": 267,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Exactly - it was his tone that got me",
          "id": 268,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Thank you for putting my thoughts into words. As a morning person, I’m usually up before anyone else (when I’ve had roommates).  I usually have a meal shake for breakfast, but if I were inclined to cook up a mess of eggs, I’d be more than happy to cook more for others, especially if they were known to not be as perky in the morning.  (I’ll even start a pot of coffee for the house when I don’t drink coffee.). So if my significant other needed my help to prepare more breakfast to help him out, I cannot imagine not just agreeing to doing it.  Unless there was something about the request that made me feel like I was being taken advantage of.  Then I’d have to wonder, why am I still in this relationship?  If I were having these feelings, I sure as heck would not be remotely considering making a commitment and making babies with this guy.  Years ago, I dated a sociopathic narcissist.  (Learned what one of those were based on my experience with him.).  I had to have surgery during our time together.  He called from work to check on me and to see if I needed anything.  At the time, I had run out of dog food for my dog.  I didn’t want to ask, but I was still on bed rest.  I asked if he could stop at the pet store after work for me.  I would pay him back.  He hesitated then complained that he was too busy at work and asked me why I couldn’t just do it for myself.  The phone call ended soon after.  I immediately regretted even asking.  At that point, I had to strategize how to get myself up and put together enough to run an errand.  Doubled up, I made my way out of the bedroom.  I remember to this day looking at my dog and telling him, “if I’m stupid enough to marry him and get pregnant with his kids, I swear you’re going to have to drive me to the hospital.” That’s when I allowed myself to admit I was dating a very selfish person and it would only get worse from here.  I was able to extract myself from the relationship safely and never looked back.  Not saying OP is a narcissist but you are right that something is going on for the GF to be counting chores.  OP needs to get a better reading of how GF sees their relationship and how well things are going.",
          "id": 269,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Absolutely true. Great comment. There’s more going on here",
          "id": 270,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Couldn't have said it better myself. I feel like the girlfriend probably realises she does everything, is tired of that and is trying to get him to do more, compromise.\n\nThe issue is more than just adding a few more eggs to a pan here.\n\nHe could offer to do the dishes daily, he can offer other things. But his tone throughout makes me side with the GF unless we learn more, and I vote YTA.",
          "id": 271,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1475,
      "content": ">so why should I have to do more for her in return than I already do?\n\n\n\nBecause you are asking her to do something for you. Like, obviously you should offer do something for her too. If she makes breakfast every morning you do dinner every night, or some other mutually agreed upon task. YTA",
      "id": 272,
      "comments": [
        {
          "score": 666,
          "content": "This guy legit told his GF in so many words _\"I'm super fucking lazy so you should do it because I'm super fucking lazy\"_ with a straight face. \n\nYTA OP, you actually think being a lazy arse is a good enough reason for someone else to pick up your slack.",
          "id": 273,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "The rate at which this guy KEEPS TRACK of things they do for eachother is sickening. She should leave his selfish ass.",
          "id": 274,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}