{
  "post content": "My three kids all have graduations this week.\n\nOne high school, one elementary and one preschool. \n\nMy high school son Liam said he has zero interest in going to his younger brothers' graduation because it's \"lame.\" I said his brothers are going to his and it's more work for them to go than for him to go to theirs.\n\nYesterday he said he's still not going. I said okay then you're not going on your senior trip to the Bahamas next week. He walked away without saying a word and went to his mom's. His mom then texted me about my being petty. I told her to mind her business. This has nothing to do with her. This is between our son and my other sons (half brothers to Liam).\n\nI texted him information about the graduations and haven't heard back. If he doesn't show up then I'll cancel his little school trip. He can go to his mom and she'll lie about how she doesn't have the money.",
  "id": 1,
  "comments": [
    {
      "score": 25306,
      "content": "YTA.  That is a HUGE overreaction.  And preschool/elementary \"graduations\" are insufferable and completely unnecessary.",
      "id": 2,
      "comments": [
        {
          "score": 6359,
          "content": "Ugh, THANK YOU- I just barely think people should tolerate middle school graduation. Ridiculous...",
          "id": 3,
          "comments": [
            {
              "score": 4636,
              "content": "I totally disagree... Middle school graduations are insufferable too. \n\n\"Congratulations, you did something you legally had to do\"",
              "id": 4,
              "comments": [
                {
                  "score": 2460,
                  "content": "IMO, all graduation ceremonies are insufferable. Worse than funerals. Boring and dry. Send me the diploma; I’ll be at the bar!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1282,
                      "content": "My one son graduated high school in 2020. Only 10 students at a time, with 20 parents spread out in the auditorium. It was the best and quickest graduation I ever went to.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 375,
                      "content": "At least high school grad means u are done with mandatory schooling now... All others are a waste of time",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "I skipped my college graduation.  I went to a huge university and it was going to entail sitting in the sun for 4 hours so that they could announce my entire class, we'd stand up and sit back down.\n\n\"Here's my mailing address.\"",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "I got a BA, Master and PhD and did not attend any of the graduations.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "13 year old: just send me my diploma! I’ll be at the bar!",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Yup. I have to wonder if she's even asked if the younger brother cares that his older brother isn't going. I suspect that if she offered to let the younger brother not go to the older brother's graduation, he'd be quite happy with the exchange.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My thoughts exactly. I'd honestly rather go to the DMV than a graduation.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My parents made me go to mine, both hs and college. I still want those hours back.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I skipped my college graduation bc I didn’t want to sit through that nonsense. Highly recommend.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Right! Even HS graduation ceremonies are brutal.   90% of US kids graduate HS.  It’s really not rare or exceptional.  On top of that half of us adults read at an 8th grade level or below by OECD metrics so it’s not a huge marker of proficiency either. \n\nI’ve never understood why it’s celebrated as an achievement.  It’s like a collective quinceanera to celebrate adulthood before the real world kicks their teeth in.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Really. If you don't pass grade 12 here you can't attend the ceremony.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Right. The comment was about middle school... Kids legally cannot drop out of school in the US until after middle school age.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "My board now refers to all elementary or middle school \"graduations\" as \"leaving ceremonies\".  Because let's be honest, the kids are getting moved to the next grade whether they did anything or not.\n\nDon't even get me started on pre-school or kindergarten \"graduations\".  Cute, but meaningless.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I think Middle school graduations used to have a place, but not really anymore. When I finished eight grade, I'm pretty sure there were kids that \"graduated\" with me who's parents had not made it past the eighth grade and they were legitimately proud their kid had gotten a better education then they had. Granted, that was 20 years ago. I don't think there are any kids \"graduating\" middle school today who's parents were not legally required to get an eighth grade education.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Right? I never heard of any other graduation besdies high school and college until a few years ago. Ridiculous and waste of time.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "The OP is a major YTA, seeing their comments, they are not accepting criticism then why post here. ?  \nsucks for the son that he still has to depend on them",
              "id": 21,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I find all graduations insufferable. So insufferable that I didn’t even go to my own doctoral graduation.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "There are these two white ladies on TikTok that talk about everything they hate and their disdain for these type of graduations just popped up. They are vicious and hilarious.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1456,
          "content": "Agreed, they are that.  But it is a family activity and he should attend.  Especially if he expects Dad to pay thousands for a “completely unnecessary” trip to the Bahamas.",
          "id": 24,
          "comments": [
            {
              "score": 1703,
              "content": "> family activity\n\nIt feels like that's probably the real issue. Dad trying to force the new family on him. We're talking a 7 year school age difference.",
              "id": 25,
              "comments": [
                {
                  "score": 1592,
                  "content": "My little sister and I are 7 years apart, but I was a super proud teenager attending her graduation and seeing her happy that her big sister attended. \nNot sure why reddit is so selfish. \n\nWe are ofcourse missing context since it is a blended family which might impacted OP's son's choice.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 862,
                      "content": "My sister and I are 15 years apart. I went to her pre k and recently her high school graduation. And I cried my butt off at both. I’m guessing he doesn’t have a bond with the sibling or he’d probably want to go.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 136,
                      "content": "but its not selfish to force someone to go to an event they dont want to?",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Reddit is always selfish, especially AITA.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Me and my sister are 12 years apart and I was proud as fuck to see her graduate and of course screamed/cheered the loudest when her name was announced! Gotta embarrass her somehow 🤣",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Same. I took a bus home from college for the weekend to attend my half brother’s 5th birthday party. There’s a picture of him and I at the bus terminal that’s still my favorite of the 2 of us. I also went to his preschool and kindergarten graduations, so I don’t get the big deal.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yeah my sister is 8 years younger than me and i traveled an hour to attend her last middle school choir performance and her 8th grade graduation and I was a proud as hell sister. My brother is 10 years younger and I pestered my mom to make sure I had a ticket at his prek graduation. I’m not sure if it makes you an AH to not want to go, but I don’t get these “ugh it’s a total waste of time no one wants to be at these things”. Like no, I love my siblings and I want to see them accomplish things lol. And prek graduations are especially adorable. All those precious lil babies in grad gowns and singing stupid songs together? Absolutely cute and fun",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "my little brother and i have a 10 year age gap and im fuming that im gonna miss his first day of school next year because of my school hours starting earlier than his will. and hes my half brother.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "My brother and I are 5 years apart and he only came to any of my graduations because we got ice cream after\n\nIf my grandparents hadn't funded me getting a cap and gown, I wouldn't have shown up to my own graduation!",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Out of town trip that was planned and saved for makes it a pretty simple decision.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "26 years between me and my youngest, and I've been there for everything from the smallest things to my one brother passing out of the army 200 miles away.\n\n2 of them are half-brothers too",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 188,
                  "content": "[deleted]",
                  "id": 37,
                  "comments": [
                    {
                      "score": 15,
                      "content": "honestly, I feel like the blended family bit might be really important here. I'm 6 years younger than my brother, my dad has two other kids (one girl that came before me, he was never in her life, and a boy that came several years after me) and I gladly went to my brother's highschool graduation but would never dream of going to my dad's other son's especially if I didn't know or wasn't even considered family by the kid.   \n\n\nI feel like OP's son and his dynamic with elementary kiddo and preschool kiddo is a big left out thing here. I still feel like OP would be wrong even if they did have a good dynamic.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "My siblings are 9 and 10 years older than me; while there was a little bit of resentment over perceived favouritism when we were young, as adults they're my biggest allies and closest friends.",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "We're they from a different mom who is hated by the dad?",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 165,
                  "content": "I’m 10 years older than my brother and literally took off work the other week to go to his high school graduation so really not that hard to do as a teenager with no real responsibilities…",
                  "id": 41,
                  "comments": [
                    {
                      "score": 74,
                      "content": "Oh come on HS graduations are a real thing but preschool lol this nonsense doesn't exist in most countries.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Because you presumably care about your brother. This was very obviously not a happy split between the parents and he spends time (how much, we don't know) at both houses. Forcing your teen to go to a graduation of a baby half-brother just screams forced family time being a common theme. Blended families can be tricky, especially in contentious situations like these parents were in.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Half brothers, so same dad- not a new family if ones graduating elementary school.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 24,
                      "content": "OP's son* is split between two households, it very likely feels like a new family.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Good call.  Imagine that!  A high school senior not wanting to attend a preschool graduation of a half brother he probably doesn't even like, probably with a stepmother that he doesn't like.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The kid's resistance may also be a symptom of this guy's parenting. My guess is this isn't the first time he  has used manipulation and force to get what he wants. Luckily, kiddo has almost made it out. I wouldn't be surprised if OP is on reddit in a few years asking why his estranged son won't talk to him and how to make him come to christmas dinner.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 4,
                      "content": "> The kid's resistance may also be a symptom of this guy's parenting.\n\nThat'd be my guess. OP isn't expounding on the situation because he knows how it'll make him look.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 548,
              "content": "If dad already agreed to pay for his son’s celebratory trip (which is occurring because the son is completing a giant accomplishment by graduating) but is now trying to use it as leverage to manipulate the son into attending a “family activity” then that just speaks to the dad’s lack of respect and integrity to uphold his agreements. He doesn’t get to blackmail or bribe just because he’s the wallet.",
              "id": 49,
              "comments": [
                {
                  "score": 95,
                  "content": "I have a sorry excuse of a mother like this. Guess what, I don’t talk to her. Of course there was more to it than going back on her word even when I made her sign a promise “contract” stating that I can actually go skiing, something I got for my birthday but it was still used as leverage days before the trip and made me super anxious and resentful. So if OP is anything like my mother, he should get his shit together and 1) understand that not everything that’s important to him will hold the same value for his kids and 2) he has to come up with better ways to convince his child to attend a not necessarily very pleasant event.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "He does... until he doesn't and is going to be VERY surprised when that happened. Or that his son expects MONEY to even see his dumb face once a year.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Agreed. And also, you can't force affection between siblings. It only leads to resentment. Would it be nice if older bro wanted to go to the graduations? Sure. But there's no point in pushing it. If Dad leaves it alone, he might get closer to the younger kids in a few years when he's more mature and less self-involved. Forcing the issue is only going to drive them apart.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 304,
              "content": "Not even remotely the same.  At those ages, the graduation ceremonies are for the parents.  It would be a nice gesture for the brothers to come or to do something nice in return, but OP’s reaction was unnecessary.",
              "id": 53,
              "comments": [
                {
                  "score": 180,
                  "content": "Idk. My 11yo just \"graduated\" elementary school. It was a big deal that her 24yo sister was there supporting her. They both were very proud of each other. Agree about the overreaction though.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 78,
                      "content": "Of course!  If the whole family wants to come and make it a special moment that’s wonderful.  But pressuring siblings to come is ridiculous.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Geez how is this even a thing? Supporting in what? I am glad this nonsense doesn't exist in most countries.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 263,
              "content": "But dad grabbed the most hurtful thing that is truly unrelated to punish him with. Consequences shouldn't be this drastic & hurtful.",
              "id": 57,
              "comments": [
                {
                  "score": 168,
                  "content": "Plus pick a fight with the mother of this child. Sounds like he really doesn't like her and expects her to pick up the whole tab for the trip herself now.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 212,
                      "content": "Sounds like he used this trip as a power play instead of the graduation gift it was meant to be.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 257,
              "content": "It sounds like this is Dad's second family. He needs to let his son be part of this on his own terms rather than forcing him.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 193,
              "content": "So because he doesn't want to do a stupid event such as childrens graduation, he should lose a vacation worth *thousands*?  Cool, OP will just never see his son again.  OP sure showed HIM!",
              "id": 61,
              "comments": [
                {
                  "score": 17,
                  "content": "Why not turn this around? How stubborn is the son to walk away from a trip worth thousands for a 2-hour activity for a sibling?",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I mean....your comment really underscores how petty the child is being here...not the dad.",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 145,
              "content": ">>If he doesn't show up then I'll cancel his little school trip. \n\nDo you not literally hear the condescension in OP’s words?  \n\nThis is all about dad controlling his oldest son & trying to force his a relationship between his oldest & youngest.  \n\nNo senior in high school wants to go to a middle school or kindergarten graduation.  The oldest didn’t choose to have those kids - his dad did.  And those “graduations” only came into existence a few years ago after the party supplies industry threw their marketing dollars into creating them.  PARENTS don’t even want to go to the makeshift “graduations” that are nothing more than glorified awards ceremonies repackaged into a “graduation” so the party supplies industry can sell more of their garbage.  \n\nDad is an ignorant controlling ass who needs therapy so he stops looking at his oldest as a pawn or plaything he can control.  \n\nSon needs to work on getting financially independent from his controlling father so be can be out from under this sadist’s thumb.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "Pre school and elementary school graduations are stupid because the kid is going to go on to the next grade. It’s not only expected, it’s required. It’s not required to graduate high school.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "The money was already spent. \n\nThis is retroactively applying or changing conditions after the fact to control behavior.",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "The way the dad is acting as soon as this kid turns 18, which is probably not that far off, forget family activities,the kid is going to go NC. The dad is forcing/ blackmailing his kid to attend these graduations that’s shitty and so YTA. His tone, telling his ex to mind her own business he sounds like the biggest AH. News flash OP her kid, her business. You can’t force the kid to have a relationships, or want to attend these events. It’s going to backfire big time. Also the dad should only paid for the trip, so he can get something out of it? How about doing it, for the son, as a grad gift?",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 362,
          "content": "seriously! I don’t even wanna go to my kids elementary school graduation😩 I didn’t even want to go to my own.",
          "id": 68,
          "comments": [
            {
              "score": 185,
              "content": "It's crazy that they do these graduations. The first one I had was middle school and I suspect they do those because that's the last one some of the children are going to have. I definitely never attended any of my sisters' graduations (and they didn't attend mine). \n\nI'm sure that preschool and kindergarten graduations are cute, but I'm not sure what accomplishments are being celebrated that require much older siblings to attend. \"Congratulations! You got used to a school environment and only ate two crayons!\"",
              "id": 69,
              "comments": [
                {
                  "score": 78,
                  "content": "There’s literally no accomplishment being celebrated. \n\nThe only graduation I remember is my eighth grade graduation (I didn’t go to my HS graduation, didn’t care enough) & I remember the music teacher of all people saying something like “You all need to take this seriously, studies show that this is gonna be the only real graduation Many of you have!”\n\nand I remember looking at her the way I’m looking at OP now 😂",
                  "id": 70,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I don’t think that’s totally fair, if you don’t feel it’s an accomplishment worth celebrating for yourself that’s fine but I do think it’s important to celebrate completing a big life step when young! I still remember my kindergarten and elementary graduations and how proud I felt even though school was easy and fun for me then and I didn’t objectively “work” that hard. I would have been crushed if my family wasn’t there, and I was happy to show up for my younger sister’s ceremonies. Sure they’re painful but you don’t do it for fun you do it to show support to a little human so they carry that with them. \n\nThat being said I think there is probably a reason why this kid doesn’t want to go to celebrate his siblings, especially with what is mentioned about parental dynamics. I don’t think there’s enough info here to make a solid judgement",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "It is nuts, in my child's school (Europe) they do a party in class during the last week of school and take some pictures. Parents aren't even invited, it is not made into a bigger deal than necessary. There is no accomplishment at all, just the early stages of the participation trophy culture we are now living in.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": ">\"Congratulations! You got used to a school environment and only ate two crayons!\"\n\nExactly!!!",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "That only ate two crayons comment took me out….thank you for that",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I didn't have one? I feel like these graduations for every tiny school stage are a thing that has been recently implemented? I do not remember them being a thing when I was a kid.",
              "id": 75,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 274,
          "content": "Honestly, I was thinking \"maybe his brothers are in middle school?\" But a preschool graduation??? The only way I'd go to one of those is if I wanted to. Like if my brother had a kid and lived in-state, but expecting someone to do something they don't want to do \"because family\"?? \n\nSir, actually scratch that because OP doesn't deserve that title, but basically holding a potentially $1000+ trip vs a preschool graduation that is entirely stupid as an ultimatum to get him to attend the (really stupid) graduation? 🤦 like, I get it, family and whatever, but have you ever considered asking him how he feels about it or why he doesn't want to go?\n\nLike, yeah, teenagers don't like being dragged to those, but have you found out if he has a legitimate reason beyond \"it's stupid\"? Instead of immediately dangling something expensive over his head?\n\nYTA, I have family that act this way. Instead of actually talking to me, they dangle being able to get home from college over my head when I ever so slightly piss them off saying \"you need me, I don't need you.\" I wouldn't be surprised if you're just like that OP.",
          "id": 76,
          "comments": [
            {
              "score": 15,
              "content": "I went to my kids preschool grad. But it was literally the kids dressed up in a walking parade with paper crowns they made, they did a concert (it was a music/art focused preschool), and we had a potluck dinner.",
              "id": 77,
              "comments": [
                {
                  "score": 8,
                  "content": "That sounds very cute, I'm sure you found it fun! \n\nKids personally aren't my thing so I'd only go if I truly wanted to, like if I had a niece or smth. Even then, it would be circumstantial. I wouldn't drive 3 hours to attend one, but I would go if it were in the same state.\n\nPreschool is that one territory where it isn't exactly seen as huge?",
                  "id": 78,
                  "comments": [
                    {
                      "score": 30,
                      "content": "It was cute. But if it wasnt MY KID....HELL NO. I didnt even ask my bonus kid, who was in highschool at the time, if he wanted to go. Heck, her DAD didnt go (he was working), just me. The people who get all serious and weird about graduation from preschool, elementary, etc...they honestly freak me out a little.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "My daughter's pre-K had a graduation ceremony. We skipped it and I took her out for ice cream and let her pick out something at the mall (she chose a sundress with pineapples on it, toys were an option but she loved that dress). \n\nPersonally I think we had more fun.",
              "id": 80,
              "comments": [
                {
                  "score": 2,
                  "content": "As you should, ice cream and shopping sounds more fun. 😂",
                  "id": 81,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Funny story, she loved that dress so much I went on the website and was able to get the next three sizes up. We're on the third one now and it's going to be a sad day when she outgrows it, or wears it out completely, whichever happens first.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 179,
          "content": "My elementary graduation was during school because...nobody cared. Same with middle school.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "Said like someone who wasn't preschool valedictorian",
          "id": 84,
          "comments": [
            {
              "score": 74,
              "content": "No I only got an A- in fingerpainting.",
              "id": 85,
              "comments": [
                {
                  "score": 17,
                  "content": "My preschool college application was a fingerprint pastiche of Jonathon Swifts criticisms of 18th century mores",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I got an A+ in nap time. All time snub.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "This is the most under rated comment in the thread. Gold star for you! 🌟",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 78,
          "content": "The only child graduating is your oldest. I’m sorry but preschool, elementary and kindergarten graduations are absurd.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "*It’s not a graduation! He’s moving from the fifth grade, to the sixth grade!*\n\n*It’s a ceremony!*\n\n*It’s psychotic! We keep finding new ways to celebrate mediocrity!*\n\nThe exchange that popped into my head when I read this.",
          "id": 90,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I’m a mum of young kids and I have to agree with his son, pre-school graduation is lame! It’s meant as something lighthearted for the parents, why on earth would you subject your older kids to it, then to over react like this, wow! YTA",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "My 12-year old cousin has worn a cap and gown more than I have, and I have a Master’s degree. I was born before the PreK/K/Middle School graduation era and only wore them for my college graduation. Would’ve for grad school, but, 2020. It’s insane.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9335,
      "content": "Damn another succinct YTA post where there is so much under the surface it may as well be an iceberg",
      "id": 93,
      "comments": [
        {
          "score": 1646,
          "content": "yeah this is SO clearly about step kid drama lol",
          "id": 94,
          "comments": [
            {
              "score": 487,
              "content": "The step kid stories have been delivering good stuff on this sub recently, we eating good",
              "id": 95,
              "comments": [
                {
                  "score": 29,
                  "content": "I’m so glad my parents never forced step siblings on me. Sounds awful",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "for real, just watched the latest vanderpump rules reunion and I’ve been thirsty for drama all night, it’s wonderful",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "It's not step, dad says they're half siblings, all his bio kids.",
              "id": 98,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "Where did it say anything about step-son/dad?  Sounds like all these are bio relationships even with the half-brothers.  Did I miss a reply or something?",
              "id": 99,
              "comments": [
                {
                  "score": 43,
                  "content": "[deleted]",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Half-siblings can still feel a bit different.",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Gotta love it when separated parents use the kids as reasons to be passive aggressive to each other",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "We’ll get another post in a year that their son cut contact with them and they don’t know why.",
          "id": 103,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "I agree. My ex (my children’s father) used to pull stuff like this and my second oldest stopped replying to his text so his father stepped it up and cashed in his college plan. That was in 2013 and my son hasn’t spoken to him since. My daughter was a year younger and the same exact thing happened. It’s crazy, he didn’t learn anything the first time. The youngest is 6 years younger and definitely benefits because she knows he’s on his best behavior so it doesn’t happen with her.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Exactly. Forcing a relationship will only make the teen resentful. YTA.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "It's so much of an iceberg it killed Dicaprio and Celine Dion wrote a song about it.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6782,
      "content": "YTA a teenager has no interest and no business at an elementary graduation - that’s for parents and that student. You sound completely controlling and like someone whose going to have adult children go NC.",
      "id": 107,
      "comments": [
        {
          "score": 3982,
          "content": "My 5th kid had K graduation last year. Her 4 teenaged siblings, her 1 younger sib, and 4 (adopted) Aunties came. \n\nIt *was* lame- but we all showed up to support her bc we love her. We had fun and she knows we have her back. \n\nThere’s no reason to just assume that an older sibling doesn’t want to or shouldn’t need to be there for younger ones. This thinking astounds me. \n\nLame or not, there are a few things we do in healthy groups, family included. Spending 2 hours being there for your brothers isn’t asking too much. It’s honestly not. \n\nYounger siblings are annoying af but they’re still siblings and they’re still humans.",
          "id": 108,
          "comments": [
            {
              "score": 1072,
              "content": "Yup. My teens are going to their sister’s elementary graduation. Because that’s what siblings do.",
              "id": 109,
              "comments": [
                {
                  "score": 499,
                  "content": "My kids went to each other’s events and I didn’t have to threaten them, because I like to think I didn’t raise A Hs. Liam sounds like a treat. \n\nYou can definitely see the Reddit teenagers here roaring to y t a judgements.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 908,
                      "content": "Uh no, 30 year old parent here with teens who understands that sometimes teenagers don’t want to do family stuff and that’s okay. They are their own people and you have to treat them with respect and not threaten to take something like this for something so silly",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Yah, no. In my 40s with 2 teens and a 5yo and I find anything other than high school and college graduations ridiculous. If even I don’t want to be there, why would I force my kids to attend?",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Aren't you presuming that everyone here has that same relationship that you and your family does?\n\n\"Because I like to think I didn't raise assholes,\" sure, that or your children are too afraid of you to be completely honest with you. For now.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "I’m pushing 40. There’s a pretty big difference between my bond with my siblings and my bond with my step siblings. You can’t ignore that. \n\nI get along with my step sibs well, but if my mom had tried to force me to? It would not go over well.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I’m 35 with no kids, I think op is the ah because they insisted on signing off with “then he can listen to his mother lie about money”. \n\nIf the whole point is that op thinks their kid is being a jerk, and they end by calling someone else a jerk… either op is surrounded by jerks or they need to try engaging in self reflection.",
                      "id": 115,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "40+ years old, and OP is still the AH here.\n\nHis brothers aren’t old enough to actually care if he’s not there, especially if he acknowledges them in some other way for this ridiculous “graduation” ceremony. If the teenager can’t or won’t do that, then forcing him to the ceremonies isn’t going to accomplish anything.\n\nFor that matter, the younger kids don’t necessarily need to go to the graduation. Again: they’re too young to understand the importance of it. In their experience, Liam is walking across a stage for doing things like cutting paper and making play-do turtles. \n\nYTA, OP. You can’t force a relationship. Tell him you’d like him to go as a show of support for his brothers and let him make the choice.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My kids are all grown up and are close to me and their siblings. They didn’t attend their siblings’ graduations, except by choice, to the oldest’s university graduation. I think that OP is being heavy handed with this threat and it will backfire. Family is important but so is respect (and graduation ceremonies are rather boring.) Maybe have a celebration at home later for family to attend?",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "\n\n>You can definitely see the Reddit teenagers here roaring to y t a judgements.\n\nno, you can see the people who know that preschool graduation and elementary graduation are the most pointless things in existence and aren't going to fault teenagers for not wanting to go. I'm fucking 30 and wouldn't go to one. the five year olds couldn't care less.",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": ">You can definitely see the Reddit teenagers here roaring to y t a judgemen\n\nSounds like it's Dad's second family and he's trying to force the kids to get on. Threats are not the way to foster good relations between them. I say this as a non-teen from a family who would happily attend each other's preschool graduations, if they were a thing here (Ireland)",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Ok boomer. So a father here who hates his ex 10x more than he loves his son, to the point that he's happy to ruin his son's trip and make his son miserable because it might make his ex pissed and make her pay money is a great guy.\n\nBut his SON is the problem here. Yeah, sure dude.",
                      "id": 120,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 121,
                  "content": "Right?! I went to my cousins’ kindergarten graduations 20+ years ago and they were so adorable. I would have been upset if my aunt and uncle didn’t think to invite me. They would have understood if I didn’t go, but why assume that I would have hated it just because I was a high schooler ?! Some people enjoy attending events for their younger family members!",
                  "id": 121,
                  "comments": [
                    {
                      "score": 7,
                      "content": "And some don't, therefore they must be punished in dramatic fsshion.",
                      "id": 122,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 114,
                  "content": "If it’s the preschool graduation, I feel like he shouldn’t be required to go. I’m the oldest of 4 siblings, I went to a lot of graduations/recitals/etc. because that’s what supportive families do, but I feel pretty confident in saying preschool graduations are stupid. It’s not an accomplishment, and they very likely won’t remember. For a fifth grade graduation, I fully would expect to power through the “lame” ceremony and wouldn’t have even considered that I could just.. not go? \n\nI wonder if there’s some other family dynamic at play here (like resentment about younger half sibs that may have resulted from affairs, etc.) or just standard teenage surliness.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Their little brother feels proud about it. That’s the point.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Regardless of how you're glossing over the entire array of personality types and family dynamics that affect how people relate to their siblings or whatever else might be going on in their lives that promote this kind of \"support\". You're glossing over the difference that this teenager is graduating highschool, I don't know if you remember yours but the entire week beforehand as well as afterward were completely focused on that event, all the preparations, finishing up of class work and exams, celebrating amongst smaller groups, trips and events and parties afterward; where is this adult who has just graduated supposed to find the time? You really expect someone to take seriously the \"graduation\" from preschool and elementary school when they've just hit the milestone of becoming an adult and have adult things going on? \n\n  \nNever mind that in some areas and districts there are different grade separations and institutions. How trivial is it to \"graduate\" elementary school when in one area that's finishing 8th grade and moving onto highschool, and in another it's finishing 5th grade and moving onto middle school, and in others it's finishing 7th grade and moving onto junior high? The \"graduation\" is literally an arbitrarily distinct grade change depending on which system your district uses, never mind that if a student switched districts 3 times they could \"graduate\" elementary school 3 times. It's a joke, it is not an accomplishment. Celebrate as much as you like, but don't make a 12th grade student sacrifice on goings in and around their very real life moment for their pre-school and elementary school half siblings if they don't want to.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "You can't make a human love or care about another; siblings or not. This is a setup for resentment towards both the dad and younger siblings.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "These are all half siblings with a large age gaps and the oldest likely never “bonded” with the two younger ones.   \n\nPutting a blanket statement of “that’s what siblings do” is forcing a major pre conceived traditional label on their relationship.   the way the eldest might feel towards this part of his family may not be the way the father and step mother wish or try to paint the family as this perfect melded greeting card life.     \n\nIf the father is reacting this harshly and childish over this, I could only imagine what a normal living condition is like when the eldest has to spend time in that house.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 473,
              "content": "Half siblings. Some people have great relationships with their half siblings and see them as their ‘real’ family, for others the half siblings are the ones that get favoured by the parent and step parent (not the half siblings fault but it makes it hard to have a relationship). We dont know what the situation is here. The son might have a good reason to resent these kids.",
              "id": 128,
              "comments": [
                {
                  "score": 276,
                  "content": "I’m pretty sure this is the actual answer here. Dad has a lot of animosity toward his ex, taking his digs in here. Dad has a whole second family. Perhaps Liam has some feelings about the end of his and the start of this one and how he is expected to think of his generationally younger half siblings. It sure sounds like new wife is the person dad is trying to impress instead of understanding that his 18 year old son doesn’t give a rip about these other meaningless (to everyone except mom and dad) graduations.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Exactly. And holding this trip over the kid's head points to all kinds of family dynamics best avoided. And I hope the teenager will continue to avoid them.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 13,
                      "content": "And he didn't communicate to the kid he would lose the trip if he didn't agree to go. He sprung it on him AFTER he said no the second time",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 230,
              "content": "I feel like the difference comes down to family dynamics, and yours and this kid's are probably different is the sense I'm getting.\n\nI'm 19m with younger stepsiblings that I usually try to go for the stuff for because I want to, but \\*not\\* because I have to. The way our family blended, I was able to more or less grow together naturally, and it sounds like your family also has a more natural relationship too. And when I can't make it to their stuff (because I have my own life), it's understood, like I just unfortunately missed my younger stepbro's hs graduation because I had to come back to school for a research grant. And it wasn't a big deal, even though everyone (myself included) was bummed it didn't work out.\n\nWhat the age gap and the fact that original mom are divorced is making me smell is that this is some sorta fantasy \"happy family\" thing the dad is pushing, where he probably tries to just force the kids together. Kid's probably acting out on principal because it's a control thing, not because going to the sibling's graduation is actually such a big deal",
              "id": 132,
              "comments": [
                {
                  "score": 31,
                  "content": "Yeah, I think many of these people don’t realize that not everyone has the same relationship with family that they do. I’m 22m, I got step siblings and half siblings. If someone’s not around me at this exact moment, I probably won’t say shit to them or think about them lol.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah I'm by far older then my youngest full brother and I loved doing things for him because I love the little shit. But with my older half brother I have never expected to come and participate in things for me because it was always messy growing up. Doesn't mean that I ever thought he didn't love me.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "> she knows we have her back.\n\nHow did she not know that without the lame-ass graduation ceremony?  It shouldn't require performative misery.",
              "id": 135,
              "comments": [
                {
                  "score": 64,
                  "content": "By going to her events and taking an interest in her life.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 103,
              "content": ">\"There’s no reason to just assume that an older sibling doesn’t want to \"\n\nWhich he clearly doesnt want to..\n\n&#x200B;\n\n>\"Lame or not, there are a few things we do in healthy groups, family included. Spending 2 hours being there for your brothers isn’t asking too much. It’s honestly not.\"\n\nSo which is it, can he not choose to go if he doesnt want to, or not?",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 53,
              "content": "My elementary graduation was awesome.  There was some big drama with the class moms and the dads took over.  Bunch of blue-collar, working men took the day off of work.  They held it at a park and brought propane grills in their pickups.  We got hotdogs and chips for lunch and played at a park all afternoon.",
              "id": 138,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "i dont remember if my brother (2 years younger) came to my HIGH SCHOOL graduation let alone preschool or elementary. I went to a school event I absolutely had to attend, and only cared about how long I had to sit in the chairs before I was allowed to talk to my friends. \n\nDad's the asshole for assigning unnecessary importance to a preschool \"graduation\" and then turning the trip into a conditional gift.",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": ">\nThere’s no reason to just assume that an older sibling doesn’t want to\n\nNobody is assuming anything. The older son said he doesn't want to go. If attending the graduation ceremonies is the only way for him to be a supportive sibling, then there are bigger problems in the family dynamic. OP using the trip as ransom doesn't fix anything and is probably actively making the older son dislike the younger kids more.\n\nWithout any more info on how the family works than what's been provided, OP is clearly TA.",
              "id": 140,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "What is healthy about guilt-tripping and financially manipulating your teen into doing something",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "You are assuming they have a healthy family life. And by the looks of the responses from OP,  they 100% do not.",
              "id": 142,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Not to mention the swipe at his ex about money.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "... Do you think the younger kids have any interest in being at the older ones graduation?",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4523,
      "content": "\"If he doesn't go then I'll cancel his little school trip\"\n\nYTA, your wording throughout this, and especially in this quote, comes off as extremely condescending. This trip obviously means something to him and you're sitting here holding it over his head that he can't go if he doesn't show up to an elementary school graduation. He's a teenager, he's not going to care about something like that and forcing him into it even after he voiced not wanting to go is going to cause him to pull away from your guy's relationship.",
      "id": 145,
      "comments": [
        {
          "score": 904,
          "content": "Honestly I was all “esh but the younger kiddo” until that line. Like. Wow. Way to be dismissive af.",
          "id": 146,
          "comments": [
            {
              "score": 849,
              "content": "I wasn’t thrilled with how he said his sons mother needed to stay out. It’s her son too… Jesus.",
              "id": 147,
              "comments": [
                {
                  "score": 630,
                  "content": "\"She'll lie about how she doesn't have the money,\" yeesh.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 218,
                      "content": "Def sounds like a dad bitter about paying child support.",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 98,
                  "content": "I’m willing to bet he only said stay out of it because she disagreed. If she agreed with him he would absolutely use that to his advantage.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 613,
          "content": "The fact the kid just walked away without a word. Poor guy has been around the block and knows reacting isn't worth it. Edit: typo.",
          "id": 151,
          "comments": [
            {
              "score": 250,
              "content": "This guy seems like a massive AH.  Poor kid was probably expecting something like this, so he wasn't all that surprised.",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "exactly, when it’s really “a little graduation” he’s trying to get his son to attend",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "Plus the way he talks to his sons mum is just plain rude. Not coparenting in a helpful way.",
          "id": 154,
          "comments": [
            {
              "score": 71,
              "content": "There's probably a laundry list of communication issues that OP has managed to dodge resolving or working on. Poor kid.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "Yeah i read that line and i was like\n...you sound like a mustache twirling villain and you're seriously asking if you are in the right here??",
          "id": 156,
          "comments": [
            {
              "score": 11,
              "content": "I'm going out on a limb and saying the eldest son is with Wife #1, and the two younger, favored sons are with the current wife.",
              "id": 157,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "He s 18 , wait till he goes NC and op starts wondering why?! YTA and a huge one.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "You're so right on him seeming extremely condescending. \"Prestigious Lion\" wants to know if he's TA. I saw that and laughed so hard that I cried. Prestigious Lion. Bahahahaha!!!!!!!  \n\n\nYTA",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "All of his comments have cemented my YTA vote.  This dude is insufferable.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Especially canceling a once in a life time trip. His son can go on other vacations but none will ever be high school graduation with people he may lose touch with. If OP insist on punishing there are other things. I personally don’t think he should be punished but OP seems determined to make his sons life miserable for a kindergartner graduation. I’d let him skip the graduation but maybe insist on going to a family dinner after graduation.   Sitting for a couple hours with a bunch of loud kids sounds miserable to me but the 18yr old can always sit through a family dinner if OP is hell bent on making him participate",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Yeah, this is about a grown adult feeling so threatened by a teenager that he has to belittle him.",
          "id": 162,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3070,
      "content": "YTA, but like bigger picture too. What lesson are you teaching your son by canceling his trip? My way or the highway? Resent his family? Mom's a liar? \n\nSounds like he might get more satisfaction sticking it to you and missing his trip. Have you asked yourself why?",
      "id": 163,
      "comments": [
        {
          "score": 722,
          "content": "Thats dAdS tHe bOsS, of course!",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 348,
          "content": "They are half brothers. They mean nothing to him. So that boy is going to go NC and never coming back.",
          "id": 165,
          "comments": [
            {
              "score": 157,
              "content": "You know some people love their half siblings.  My brother (half brother ) is 10 years older and came to my events when he could.  We are close",
              "id": 166,
              "comments": [
                {
                  "score": 333,
                  "content": "[deleted]",
                  "id": 167,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 108,
                  "content": "That is awesome. However there are many folks who loathe their step siblings/parents and trying to force closeness on them only makes it worse.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Half siblings, not step siblings.",
                      "id": 169,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Yes, but this post shows how to breed resentment within the family. You cannot *force* someone to care about their half siblings.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Some do and some don’t, I have half siblings I could give one less damn about. We are not close.",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "That's great. Yes, it does happen, we're not saying that it's not a thing. But if Liam was close with the younger boys, he wouldn't have to be threatened in order to go to their \"graduations\".\n\n I can see this going one of two ways.. Either A. he's going to go and be miserable and possibly make everyone else miserable or B. he's not gonna go, OP will cancel the trip and Liam will resent OP for years and their relationship will be strained.\n\nThe fact that Liam simply walked away at news like this, tells me that he half expected this temper tantrum that OP is throwing and that this is a typical reaction from OP. Based on that and his comments about his ex, Liam's mother, it seems to me that he prioritizes his new girlfriend/wife/relationship and their kids over Liam. \n\nI'd even go as far as to speculate that maybe, OP left Liam's mom for the mother of the younger boys, maybe even cheated on Liam's mom with her. I feel like there is some sort of resentment here between Liam and OP and between Liam and the younger two. Something else is going on here.",
                  "id": 172,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "My half siblings (15-20 years older) came to every graduation, every school play, every dance show. With flowers. Y’all need a hug.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 298,
          "content": "Liam was already a teenager when dad decided to have two kids with someone who isnt Liams mom. This is a fact. Im giving no speculation about their circumstances because thats not cool, but the math is pretty simple. I would guess the dynamic has something to do with dads overreaction.",
          "id": 174,
          "comments": [
            {
              "score": 155,
              "content": "I was wondering how the little kids could go to all of liams’ graduations when they probably weren’t born yet. But he tell Liam that the little ones went to all his graduations. At best they were babes in arms and were dreaming of getting fed the whole time",
              "id": 175,
              "comments": [
                {
                  "score": 123,
                  "content": "[removed]",
                  "id": 176,
                  "comments": [
                    {
                      "score": 29,
                      "content": "“Learn to ejaculate responsibly” should be a battle cry",
                      "id": 177,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "It don't think it said that the kids went to all of Liam's graduations but rather that they were all going to Liam's. Every kid has a graduation ceremony this year.",
                  "id": 178,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Graduating high school= 17 or 18 year old\nGraduating elementary= 11 or 12 year old\n\nSo OP's oldest son was between 5 and 7 when his half brother was born. That's a few years away from being a teenager, and this is a fact. Your math is trash.",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My parents were like this and i still resent them as a grown ass adult.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2212,
      "content": "YTA, enjoy him immediately going no contact with you if this isn't already the beginning.",
      "id": 181,
      "comments": [
        {
          "score": 641,
          "content": "Kind of hilarious that OP doesn't see the writing on the wall. Kid is at the point, where he knows it feels better to not cave in, than get the luxury.",
          "id": 182,
          "comments": [
            {
              "score": 371,
              "content": "Yeah, he’s gonna skip the trip and not be manipulated and never speak to dad again. The older they get, the less control you have and (ideally) the more influence you have. Naked power grabs like this erode what little influence dad has. You’re gonna want to hold that  influence in reserve for genuinely important things, like safety. Blowing all your reserves over an elementary graduation is just poor tactics. \n\nAnd he doesn’t even say if his son cared about his half siblings attending. I’d bet quite a bit that he doesn’t care about that at all. I never wanted to attend my graduations, and only went to celebrate my parents.",
              "id": 183,
              "comments": [
                {
                  "score": 277,
                  "content": "I mean, I know I'm not the only one getting \"new family, new priorities\" vibes from OP.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 160,
                      "content": "100%. Dad wants him to see his half siblings as siblings, and he’s clearly not ready. You can’t force that stuff.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I mean he also CLEARLY harbours some resentment against his ex because sjeez the way he talks about her.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I’m frankly getting the vibe that OP is deliberately winding the kid up and playing mind games so that he can play the self righteous victim when the kid drops contact. Then he can avoid paying for college and have his shiny new family without his inconvenient older kid messing it up for him by continuing to exist.",
                      "id": 187,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "THIS. My mom was very similar to what OP sounds like and guess who I stopped having a relationship with after I moved out during my grade 12 year.",
              "id": 188,
              "comments": [
                {
                  "score": 7,
                  "content": "High-five for being NC with moms!",
                  "id": 189,
                  "comments": [
                    {
                      "score": 4,
                      "content": "🙏",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">Kid is at the point, where he knows it feels better to not cave in, than get the luxury.\n\nYeah, he's really showing his maturity!",
              "id": 191,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 198,
          "content": "I never spoke to my father again at 19 it's simple. You decided to have more kids they are not your son's priority nor should they be. Also they should not at that age be at a highschool graduation. The priorities you have scream loud and clear he is old family while you cater to the new family. Also the fact you take pleasure in his mother treating him poorly on its own makes you the biggest ah this year.",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "My ex brother-in-law pulled crap like this. My niece hasn’t spoken to him for 6 years. Good luck with your control issues and cluelessness.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2044,
      "content": "[removed]",
      "id": 194,
      "comments": [
        {
          "score": 138,
          "content": ">Preschool graduation is stupid.\n\nIt's adorable, for the parents of the kids.",
          "id": 195,
          "comments": [
            {
              "score": 93,
              "content": "And only the parents (maybe grandparents). I guarantee the younger sibs could not care less and won’t remember if he was there or not. Why can’t the dad plan a celebration dinner instead? God save me from another preschool graduation but I’ll show up for pizza",
              "id": 196,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "yes, and painfully stupid in the eyes of an 18 year old",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "It's not exactly like the kid is being asked something ridiculous.  I think preschool graduation is ridiculous as well, but he's being asked to organize it, just stand there like he cares for an hour and clap for a minute.  I think it's fairly reasonable to expect your son to be a part of family moments, even sort of stupid ones.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1533,
      "content": "I'm gonna be brutally honest here...\n\nYou don't care.\n\nAll of these YTA votes and you're arguing with every single one about why your stance is right. \n\nYOU came here for an opinion. You got one you didn't like, and you're doubling down, because you don't actually care what other people think.\n\nYou've taken this same approach to your son. You want him to follow YOUR rules, no questions asked. He's 18, of course he's not gonna be happy about going to a little kids graduation. But instead of talking to him like an adult (or even like a person you actually respect) you immediately put an ultimatum on him. Absolutely NOTHING in your post says anything about your children's relationships with each other, you seem to be trying to force a relationship that isn't there. Especially given that they're half brothers, there seems to be quite a bit of an age gap, so Liam was around for a while before the other two came around. Plus the clear disdain you have for his mother... None of his behaviour is surprising.\n\nUltimately you're gonna do what you want anyway. But you'll only have yourself to blame when Liam stops speaking to you 🤷‍♀️",
      "id": 199,
      "comments": [
        {
          "score": 501,
          "content": "I especially love the part in the post OP calls a senior trip to the Bahamas a \"little school trip\". Tells you everything you need to know about the mentality there, and the (ETA) base of the delusional comparisons of graduating High School to graduating Pre School.",
          "id": 200,
          "comments": [
            {
              "score": 36,
              "content": "Yep. His tone is sarcastic af.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "> Plus the clear disdain you have for his mother...\n\nThis is honestly half the problem.  \n\nI'm sure he pulled some similar bullshit trying to control his ex wife, leading to the divorce.  OP is obviously clueless about how to have any real relationship and refuses to admit,  even to himself,  that maybe he's being the problem. If he doesn't get counselling his current marriage might also dissolve.",
          "id": 202,
          "comments": [
            {
              "score": 17,
              "content": "He should not be making any more kids",
              "id": 203,
              "comments": [
                {
                  "score": 13,
                  "content": "Well, duh. But that's kinda like saying we should shut the barn door after the horse bolted.",
                  "id": 204,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 138,
          "content": ">Plus the clear disdain you have for his mother... None of his behavior is surprising.\n\nEveryone is overlooking this. He obviously doesn't like Liam's mother and is just downright garbage talking about her. I don't care how much you hate your ex, it's between you and said ex, not your children.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "Yeah OP is going to reap what he sows.  A big bunch of nasty.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "This op is the type of person that probably won't even care when his son goes NC.  He'll tell his friends some bs story about why he doesn't have a relationship with his son and not really give a single F about it.",
          "id": 207,
          "comments": [
            {
              "score": 64,
              "content": "OP has smugly commented that he believes the son won't go NC because he wouldn't make it out on his own. He's relishing in the feeling of control over him.",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Makes me wonder if he can even legally forbid him from the trip in the first place. He's an adult. The dad has no control over him anymore by that point, unless the dad is supposed to be the one to pay the fees for the trip or something.",
          "id": 209,
          "comments": [
            {
              "score": 12,
              "content": "And odds of dad getting money back at this point is slim",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "OP kinda sounds like a narcissist in that regard, nothing he does can every be wrong, its everyone ELSE who is wrong!\n\nI agree though, sounds like Liam is gunna go NC pretty soon after he's able to just not be in his dad's house. He said in a reply somewhere that his ex wife wouldn't let Liam stay there and then badmouths her.....pretty sure, based on his replies and how he treats his son and his ex, we can all come to the same conclusion on why his marriage ended.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Very well said.  OP is so dismissive and \"my way out the highway\"....",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "You know, after doing some reading and looking back over the post + comments OP has made, I'm starting to change my mind from NT/A.\n\nI've been the \"other\" kid and have a large gap between myself and my half siblings, and I was thinking about how his siblings might feel since they likely only know him as their older brother and love him as such. While I was treated like shit by my dad and stepmom and went no contact, I never felt that way about my half siblings. Our family was very poorly blended, I was just a burden my father was obligated to take care of and a reminder/punching bag to my stepmom, but my siblings were always just that: my siblings who I love.\n\nI was thinking about the younger half siblings feelings in my original comments. I do still think that going would be beneficial to them and that it'd be a positive memory for them to have their older siblings show up and support them, but I wasn't looking at OP's behavior as a whole or taking his tone into account. \n\nOP might \"win\" this battle, or he might lose it, but either way, this runs deeper than graduations. Is the kid entitled to a trip to the Bahamas? No, but I feel like either way, this relationship is going to turn no contact from whatever factors that have led up to this bitterness between them. This is less about this specific situation and more about how he's treating/talking about his eldest as a whole. These sorts of problems and attitudes don't develop overnight. I'm not even sure if this relationship can be repaired or if the oldest kid is going to bolt the moment he can.\n\nDo I think older bro should go and support his younger siblings? Yes, they likely don't understand why older bro and dad don't get along and want their sibling to celebrate with them. I would like to think that they at least should feel supported and loved by their older brother and that big bro cares. But I can see why he might not want to now that it's \"non negotiable\"\n\nBut in the bigger picture, OP probably has been treating his eldest this way for a while, and now that eldest kid is an adult, graduated, and on the edge of Independence, he's putting his foot down and done playing games or having things dangled over him. It's very much a possibility that he does love his younger half siblings, but he's making a point that he's no longer going to be forced to do things. Abusive parents can love bomb and give gifts one day and be absolutely vile the next. \n\nWithout his kid to chime in his side or knowing how OP's family functions from a neutral POV, this post is pretty biased against the son to paint him as an entitled brat and I failed to read between the lines. \nI'm sure my own abusive parents would paint me in a poor light as well and call me undeserving and ungrateful if they were asked.\n\nFor that, OP is the AH.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1294,
      "content": "YTA. It’s an elementary school graduation, it’s not that serious.",
      "id": 214,
      "comments": [
        {
          "score": 34,
          "content": "And its a very new thing. My nieces didn't go theirs because they themselves thought it was stupid and asked my sister to not make them do it. They would rather go camping and huckleberry picking. So when school gets out for the last day this week, they're doing that",
          "id": 215,
          "comments": [
            {
              "score": 4,
              "content": "What's your definition of very new? Because I definitely had one in 2002. it was dumb, but we had them",
              "id": 216,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1178,
      "content": "YTA\nWhy would you even consider bringing an 18 year old to an elementary or preschool (!) graduation? Or bring a preschooler to a high school graduation? Not all events are suitable for all ages. And what's all the bad blood between you and his mother got to do with anything? Let him be.",
      "id": 217,
      "comments": [],
      "relation": "Attack"
    }
  ]
}