{
  "post content": "AITA for being upset that my sister always tried to take the spotlight\n\nI (23) have a younger sister (21) who has always been the spotlight of attention wherever we go. Before she got plastic surgery I would be called pretty and have guys who were interested in me, however, after she got her nose and lips done it’s as if every man on earth has only eyes for her. Not only that but my friends keep talking about how beautiful she is. I know I sound jealous, because I am to a degree even though it’s difficult to admit. I usually don’t have a problem with it while it does suck at times. \n\nMy birthday is this week and I’m throwing a big party with all of my friends and classmates from uni. This whole week long she has been telling me and asking me to let her wear a specific champagne colored dress to my party. The whole thing is casual, no one is going to dress up and this is a very fancy dress. Also the fact that this was my dream dress that I wanted to buy for myself but couldn’t because I didn’t have the money for it, and her knowing this bought it for herself. Now she wants to wear it and she keeps saying “I’m going to steal all the attention to myself at your birthday” in a “joking way”. She has repeated it 6 times over 5 days while I repeatedly asked her not to joke about it because it hurts my feelings. She keeps telling me that me getting upset at her for making that joke is not normal and just shows how insecure I am. \n\nShe’s not speaking to me now and said that she won’t attend the party at all, I don’t like fighting with her because besides this stuff we are super close and love each other. I’m not sure if she’s just being an asshole or it’s just me being insecure. Should I apologize? I do want her to come to my party and have fun together I’m just not sure how to tackle this.\n\nUpdate; My sister came crying to me this morning saying that she doesn’t want to fight and that she understands why I got upset. We talked about how this was brewing for a while now because of smaller issues building up. She assured me that she would never wear that dress because that would be embarrassing and mean but that she was just trying to annoy me like sisters do and it got out of hand. I want to thank everyone for their kind advice, especially the ones with siblings who put it more into perspective! We had a really good talk and we’re planning the party together now :)",
  "id": 1,
  "comments": [
    {
      "score": 184,
      "content": ">She has repeated it 6 times\n\nOP, typically, when a joke doesn't land the first or second time, one tends to drop it. \n\nI think it's safe to say that your sister is delighting in this particular possibility. \n\nNow, before I cast judgement, I'm going to call attention to your own words- \n\n>Before she got plastic surgery I would be called pretty and... \n\nOdds are that she's been jealous of you this whole time and is suddenly feeling drunk on her own self-confidence and public perception. *Your* looks haven't changed as a result of *her* getting plastic surgery. Odds are you're still pretty. \n\nOdds are also strong that you were feeling unthreatened and more confident before she got her plastic surgery. \n\nSo, **ESH**. I think you need to talk to your sister about your feelings and hers. I'm certain she felt overshadowed by you and that's contributing towards her actions now, I'm also certain you're probably feeling less confident and that's radiating off of you, which only adds to your perception she's stealing the spotlight.",
      "id": 2,
      "comments": [
        {
          "score": 77,
          "content": "I think it might stem from academic insecurity as I have always had more success in that regards and also the fact that our mom always made a competition out of everything between us. But yeah I feel the same way, the way she jokes about it- her face lights up. I don’t care about her being annoying as much as the fact that she tries to gaslight me into believing that I’m the weird one and insecure for being annoyed. This is supposed to be my birthday but now I’m dreading it because of her, sisters aren’t supposed to do that. But at the other hand I do admit that I’m jealous at times, so I’m not sure if it’s also my fault argument wise.",
          "id": 3,
          "comments": [
            {
              "score": 47,
              "content": "You can be jealous *and* she can be rubbing your nose in it. \n\nThey’re not mutually exclusive possibilities.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "You are doing your very best to deny that your insecure little sister is rubbing your nose in the results of her surgery. But she IS, and it's really snotty of her. The fact that she repeats and repeats and repeats her nasty lines over and over shows that she has little imagination and is resting securely in her cruelty. or attempted cruelty.",
              "id": 5,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Here’s the thing. Beauty doesn’t last forever. \n\nIt does sound like your sister is jealous of you academically. It may be that, somewhere, she realizes the above. It’d probably be best to completely ignore her, when she starts up on that. Pretend she didn’t say anything, or that you didn’t hear. Then change the topic to something completely different. \n\nYou reacting is what keeps it interesting to her. Don’t react at all, and she may realize her old tactic for upsetting you isn’t working. If nothing else, you ignoring her will frustrate her. If she gets worked up, just give her a look and walk away. Ignoring someone who’s acting up wanting attention, depowers them in turn. You ignore kids having a temper tantrum. Ignore your sister when she acts up too.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 101,
      "content": "NTA\n\n\"Just a joke bro\" is the most tired shit on this planet \n\n>She’s not speaking to me now and said that she won’t attend the party at all\n\nDon't threaten me with a good time!",
      "id": 7,
      "comments": [
        {
          "score": 11,
          "content": ">She’s not speaking to me now and said that she won’t attend the party at all\n\nDoesn't this solve your problem OP, uninvite her. I know you say she is your sister and you two are close but think long and hard here, she puts you down, compares herself to you, buys your dream dress for herself, gets plastic surgery, are you sure that you two are close or is she really just pretending to be close to keep you around so she can keep \"winning\" whatever competition she thinks the two of you are in.\n\nAlso, I wouldn't bring any boyfriends around your sister because I wouldn't put it past her to try and steal them for herself to win again.\n\nOP, please think long and hard because it sounds like your mum isn't the only one putting you two into a competition against eachother.",
          "id": 8,
          "comments": [
            {
              "score": 4,
              "content": "That part with the boyfriends, as much as I hate to say it.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 55,
      "content": "NTA - Her \"joking\" that she is going to steal all of the attention once would have been fine. Not a funny joke, but whatever. Her repeating it several times, even after you asked her to stop, is her purposefully trying to get a reaction out of you. Same with her buying a dress she knew you wanted and then going on and on about wearing it to your party. And same with her now giving you the silent treatment. She wants you to feel guilty so you beg her to attend the party. Or she wants you to ban her from the party so she can play the victim and tell everyone how jealous and insecure you are. She would probably fine with either outcome.\n\nShe sees attention from others as a competition she is in with you and she is not going to be happy until you acknowledge that she \"won\". She probably has some pretty deep rooted insecurities and thought getting the attention she is now would make those go away. But it hasn't, so now she thinks she needs your attention/acknowledgment. She probably isn't getting the big reaction to her new look that she was getting initially so she is trying to create drama/interest to get some of that level of attention from other back. She is chasing external validation when what she needs is to learn to be happy/confident with herself. \n\nYou are not obligated to play into your sister's games and bids for attention, especially when the ways she is doing this is making you feel bad and you have told her that. \n\nWait your sister out. Right now she is still invited to the party and she can't claim otherwise. You do not need to beg her to come. I am guessing she will eventually say something to you like \"you don't even want me there\" - just say \"of course I want you there, but it is entirely up to you if you want to attend\". Don't engage further than that. \n\nIf she starts up with the \"jokes\" about stealing all of the attention again, just say \"that's a weird thing to do at someone else's birthday party\" or \"ok, that's fine\". \n\nAs for the dress. If she wants to wear a fancy dress to a casual party. Let her. This is all about getting attention for her. She either gets it by wearing the dress or she gets it by telling everyone you wouldn't let her wear it. Don't let her manipulate you into being part of that narrative. If she asks about the dress again, just say \"its a casual party and you will be dressed fancier than most people, but wear whatever will make you happy\". Believe me, she may get attention for how beautiful the dress is at the beginning, but eventually people are going to be wondering to themselves why she is so dressed up.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 16,
      "content": "NTA, and hire security to turn her away when she shows up in your dream dress.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 16,
      "content": "NTA\n\nLet her words have consequences. The party will be better if she is not there.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA and why was she even invited in the first place? You don't get along and she sounds selfish and attention seeking. Plus she's extremely insecure so she's a hypocrite as well. I would definitely keep her away because she will try to come wearing that dress.\n\nIn general, I would keep as much distance as you can from her. After you build up a life surrounded by people who love and support you, and who don't compete with you, you'll gain self-confidence and her antics won't bother you as much because you'll see how vapid they are.",
      "id": 13,
      "comments": [
        {
          "score": 6,
          "content": "We are very close next to what happened, besides this I would say that we don’t have any problems whatsoever. I would really love for her to come as we always have a good time, but it’s just upsetting that she knows that what she’s saying is upsetting and keeps doing it.",
          "id": 14,
          "comments": [
            {
              "score": 10,
              "content": "People you are close to do not treat you like this and will hurt anyone that tries. You feel close to your sister, but she isn’t close to you. Major narcissistic flags. I speak from misguided loyalty and experience. You can still love her, but know her for who she actually is. Protect yourself, your self image and worth.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "How your sister is acting is not loving. You tell her that something she is saying is hurting you and she keeps doing it. It is probably for the best that she does not come to the party because she IS going to try to steal the spotlight and make the party all about her. That is not a question, she has told you that is her plan. And you shouldn’t have to worry about this at your party. Just have fun with your friends. Go low contact with her for now, and have a chat with her after the party. NTA",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA. I don't see the downside of her not attending your party. Call her bluff, formally uninvite her. You aren't conjoined twins, you can do things without her there trying to one up you.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "I can understand why you feel the way you do, she's acting out for a reason and it will catch up to her eventually. She's getting under your skin for a reason, possibly on purpose. I can almost guarantee that at some point in her life, even this moment she is also jealous of you. My sister and I are the same age and ran into some of the same fights as you when we were young. It's great being that close in age but it can also be frustrating.   \n\n\nI don't think AH here because you've told her how you feel, your feelings are valid and she won't recognize that.   \nAnd besides the attention she is getting isn't necessarily the best kind of attention, I would rise above that, always be yourself.",
      "id": 18,
      "comments": [
        {
          "score": 2,
          "content": "Thank you for your advise, being sisters close in age can be amazing but also very frustrating at times like you said :)",
          "id": 19,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA tell her it is best she doesn’t come to the party so you aren’t worried about her stealing the spotlight in her attention seeking outfit. Ask her to celebrate with a lunch out for just the two of you.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    }
  ]
}