{
  "post content": "I had a party at my house last night. I have an antique slot machine from the 1940s that is in absolutely spotless and working condition in my living room. My step grandma was a show girl she she got it while dating a count room guy prior to meeting my grandpa.\n\nOver the years people have played it and maybe won a few quarters here and there. Maybe a max of $50 at a time. As far as I know the jackpot was never hit on it so however it works there was probably about $700 in the jackpot reserve that had built up over the years. I’d never bothered to have it cleaned out since it just seemed like a fun novelty. \n\nWell a friend’s friend hit the jackpot last night. I was fucking floored when he legit thought he could keep my ~$700. His case was hed been playing with his own money and I would have kept his quarters. My argument  was I’d be happy to give him his quarters back if he’d asked but I’m not a casino and while I’m not destitute, I can’t afford to give someone $700. Argument caused the party to wind down and one of my best guy friends basically told the guy he’d be in real shit if he tried to leave with the money but the guy left threatening to come back with the cops and sue me in small claims court. I have no idea if that was realistic but no cops came back. \n\nSo was I the asshole for nor letting him keep the money?\n\nEdit: sorry guys I can't answer such witticisms as \"why are you so shity?\" because I've been banned.\n\nEdit2: wow since I’m a “baby gangster” who has been running an “illegal gaming operation” (both things that have been said) I might as well just go whole hog and start running guns and pimping underage Andean alpacas to people who would pay for the privilege. I’m really that bad? I just thought I had a cool thing my step grandma got by banging a dude from the count room.\n\nEdit3: gotta address this one directly:\n\n>If this was really last night, give it a week or a month and see how many friends, especially mutual friends, are no longer talking to you. Forget our votes, listen to those. Also forget small claims, you need to worry more about hearing from your state's gambling commission.\n\nIf the moderators allow me to update, I will ABSOLUTELY update and tell you how many friends I’ve lost. Almost everyone  (including the friend that brought the “winner” thought he was being a total asshole for the way he was down on his hands and knees scooping up quarters off the floor to put in his pockets. And he was lying about much he put into the machine too (he said $75–who the fuck walks around, nuch less even get $75 in quarters—when going to a party at a strangers house). In addition, I will gladly, gladly call our state gaming commission (AZ) and ask what trouble I might be in. I will also update on that when I can. People CAN’T be this dramatic in real life...I’m a ducking instagram influencer for my job, the phoniest, most vapid, saddest job a person can have right now and I’m still blown away by some of these comments. Call me YTA all you like, but don’t be stupid and claim to have knowledge you don’t  in the process.\n\nEdit4: well I was banned for joking around, other people have bad posts calling me a cunt up for over an hour.  Makes INFO hard but I’ll try to explain my thinking on the money in the machine and why I can’t “afford” to give it to him. \n\nSay you have a change jar, has $100 in it. Your good friend asks to borrow $25, for parking, you'd say yes right? Another friend says wow, that’s cool I have $1.25 in my pocket, can I donate to your change jar? You’d say yes. Now let’s say a guy you’ve never met says “hey I just put .80 into your change jar, now I’m taking the whole thing.” You would say no. It’s how I’ve always seen the slot machine as huge change jar for all my close friends to use. I’ve given people quarters to play, I’ve taken a quarter here and there from people who wanted to see it work. I’ve taken in maybe $100 over five years. Maybe. That’s a nickel a day. that’s not a freaking illegal gambling operation.\n\n\nEdit5: a good question:\n\n>INFO Did he explicitly ask if he was allowed to play it, and keep what he wins? If no then he played it without permission, you aren't running a casino.\n\nNo he did not, the first time I ever saw or spoke to him was when he was on his hands and knees picking quarters up off the floor slamming them his pockets.  I don't mind if people play it, I even give people quarters to play it (since no one has change anymore) but he did not ask.\n\nEdit6: another good question\n\n>Also, need more info. You stated that other guests have won small jackpots in the past (max $50). Did you let them keep it? If so, why are you making a double-standard here?\n\n\nI would have let him keep $50-100 (he certainly got away with some in his pockets) but he was such an asshole right away that he didn't give me the chance to come to any sort of deal. Most everyone at the party just wanted him gone. I do feel bad and maybe my guilt over the apparent double standard is why I'm asking here. But I do feel as though had he been even slightly cool and not threaten cops or lawsuits I wouldn't have been backed into a corner.\n\nEdit7: \n\n>INFO\nWe need to know where the money came from. Did the money in the machine come from YOU putting it in or playing the machine\n\nSo this is all guess work based on what my grandma said the jackpot could hold (there's a window that shows the coins in rhe jackpot, the space behind is about the size of a big shoe box). She said it gets full at $800. It was more than half when she and my grandpa gave it to me, I always guessed $500. In five years it's now 7/8ths full. I play it from to time to time so I'd say $100 of that is mine and $100 is friends. I think the jackpot and normal pay outs come from different boxes so last night was the last night I've ever seen that window empty. I know nothing of the machine or how it works or how to change settings so I may be so wrong and a slot machine \"nerd\" could correct me if I'm way off base.\n\nEdit8: this is the best yta take so far and I can't let it get buried.\n\n> I really hope you get into some serious legal trouble and then you’ll wish all you lost was several hundred and not thousands including jail time.\n\nEdit9 (at 5:45am, gotta work): you guys are really cracking me up. I love the comments that say \"your edits make you YTA! Alone. Where did the money come from btw?\"  I truly can accept the YTA votes but so freaking many of them have basic facts wrong.\n\n1. I wasn't profiting off this machine. I've literally never opened it up and taken a single coin out.\n\n2. I can't afford to give a random dude $700. I don't need it now, but I have savings account I don't need it now either but I might some day. And now I've found out that some of the quarters that my grandma had from the 50s or 60s might actually be silver. So good thing I hung onto them right ? (I can't wait for the \"you're a stupid thot\" rationalizations to come from this one). \n\n3. I never cleaned it out because honestly I like the way it looked with the coins in the window. This thing is enourmous and built with casino security in mind so it was in fact, a great piggy bank. \n\n4. Some nice NTAs have suggested I have a bowl of quarters a for people to play. I actually in effect did that because 80% the time people who wanted to play didn't have change (I got it five years ago) so I always had quarters around, maybe just not right by the machine. \n\n5. As an example, Over the years it's mostly friends kids who want to play. I had a very precocious 9 year old once come over with his $20 of money truly expecting to get the jackpot. He was heartbroken when he didn't win (I might have given it to him since he was so cute) but I gave him a $20 silver certificate my step grandma had given me (acquired ny dubious means no doubt) and that kid was thrilled. so I always, always give people money back if they ask. I never intended to profit off the machine. No one has ever made a big deal of it before (save the 9 year old).\n\nEdit10: this dude wins the comments, for all time:\n\n>I bet u look like jared fogle or some shit\n\n😂😂😂😂😂😂😂😂😂😂😂\n\n\nEdit 11: sooooo the plot thickens, thank you to some very helpful people who own slot machines who DM'ed who were also able to suggest experts in my area, I was able to call a local person who works on antique slot machines. My slot machine is highly customized but it's based around a pretty well known model from that era (don't want to say exactly because only a few of them exist anymore) and he said I could tell right away if the machine was broken or had been tampered with. In my very, very, very amateur job of checking it over it does appear that this little piece is either broken or misplaced. So it looks like this piece of shit \"guest\" actually broke my machine to steal my money. There wasn't a jackpot at all. I don't have confirmation of this until the repair guy is able to come later this week but it looks like that's what happened. The guy said there's an outside chance that if that piece was broken or tampered with that it was an accident but he wouldn't bet on it.  I still don't care if I'm YTA till the cows come home, posting here has probably allowed me to get to the bottom of this. And fuck that guy.\n\n\nEdit 12: well the amazing and level headed moderators of this sub just ever so politely informed me that I will not be allowed to update this post. So the short story is the \"winner\" almost certainly was hitting the machine and caused the jackpot to spill out. So had I been a real casino I would have enacted the \"malfunction voids all pays and plays\" clause. So yeah, I was totally in the right. Fuck this sub. Fuck the moderators. And fuck those of you on your stupid high horse. Most of you however were cool.",
  "id": 1,
  "comments": [
    {
      "score": 15450,
      "content": "YTA -  You left money in the machine knowing people might win some of it. You were perfectly fine letting people use it as though it were real and keeping their money if they didn't win and let the jackpot build and now that someone actually won you don't want it to be real anymore.",
      "id": 2,
      "comments": [
        {
          "score": 4104,
          "content": "I think this is the best comment here. Originally I was going with NTA because I thought it was a bit tacky for the friend to think he should get a payout from a novelty machine that’s in someone’s home. But I think you’re right and I agree with YTA. OP knew there was a possibility of someone hitting the jackpot eventually and never made it clear with his friends what his expectations were if anyone ever hit it. And if he never intended to pay out any winnings then he should have had a policy in place where he gives people their losses back instead of keeping their money.",
          "id": 3,
          "comments": [
            {
              "score": 1231,
              "content": "The playing “no more than $50 at a time” made me definitely reconsider. I wonder how many years OP has had the machine because that could very well have all accumulated while they owned it.",
              "id": 4,
              "comments": [
                {
                  "score": 1094,
                  "content": "I think the $50 figure was the upper limit of winnings at one time, not quarters input. If people are dropping 50 bucks at a time playing this thing, you would be a real asshole for not giving them the payout.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 264,
                      "content": "Right?! And now that I think about it $50 in winnings at a time let’s say over 3-4 times over a few years? That means quite a bit of money has sunk into that machine. Either way it sounds like this machine might have gotten some heavy use. \n\nI could see maybe sort of understand not being stoked on paying out $700 in winnings to say, a total stranger/first time visitor to the home. But even then...it’s really on OP to better manage that machine if $50 transactions (in or out) had happened honestly ever. That’s a lot of money on the table!! \n\nIt’s maybe comparable to having people over for a betting pool (like fights, Superbowl, etc) but then the house keeps all the winnings.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 179,
                  "content": "[According to this comment from OP, $500 was already in the machine at the time of purchase/transfer.](https://www.reddit.com/r/AmItheAsshole/comments/cm0bft/aita_for_telling_a_friends_friend_that_he_couldnt/evz9ogt?utm_source=share&utm_medium=web2x)",
                  "id": 7,
                  "comments": [
                    {
                      "score": 235,
                      "content": "Wow, OP was dumb for not taking it out then.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 141,
                      "content": "Then OP should have removed it before allowing people to play.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 214,
              "content": "It's an awkward social problem. If I won, I would feel really awkward taking the money. I have a small novelty coin dropper that uses pennies. If one of my friends wanted to take the pennies they 'won' it would be a bit weird I think. \n\nThe money in it is sort of OP's, but at the same time, it's only accumulated because other people have used it. \n\nI think I would share it....I wouldn't play it expecting to make hundreds from it, I would play it for fun, with the money I put in going towards costs of the host hosting such an event",
              "id": 10,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "Agreed. After I buy my own home, I want to have a game room with mostly arcade games: air hockey, foosball, skeeball, a couple of pinball machines. I will also have one of those electronic \"gambling\" machines (with the dogs and diamonds) and a couple of video poker and slot machines.\n\nNone of the machines will accept currency. They will be fitted with game token accepters and I will have a supply of tokens people can use to play them. No cost to play (since only my friends are coming over anyway) and no prizes to win. Just tokens to keep score.",
              "id": 11,
              "comments": [
                {
                  "score": 16,
                  "content": "I dont know you but can I be your friend?",
                  "id": 12,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Sure. Bring over beer and pizza once in a while though! 😊",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "I had expected to be NTA since I had assumed the money was leftover from before they bought it, for some reason lol. Didnt think about the possibility that it was money built up over the years from friends",
              "id": 14,
              "comments": [
                {
                  "score": 82,
                  "content": "$500 was apparently in it. So $200 from friends/family over years.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I have a strong feeling they estimated the 700$ jackpot, and just knew there was at least 500$ from its initial purchase.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It’s their private residence and their antique, their house is not a casino. My buddy has a pinball machine that still needs quarters and spits out tickets. Am I suddenly going to be in the right if I demand something for the tickets I get out of his machine next time and start claiming that bc he owns a pinball machine he should have to honor arcade business  rules? Of course not. This dude went into his friend’s friend’s house and made an ass of himself. She’s not running a casino, he chose to feed money into what amounts to an antique game in a private residence then demand that casino rules are applied to it. It’s a glorified piggy bank at that point, and she never held a gun to this dude’s head to force him to play the game, nor did she promise he’d win money. She’s NTA, he is.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "We have no idea how much op knew about the inner workings of the machine and how much was in in. \n\nIt sounds like people at parties had fun dropping a few quarters in and occasionally winning a few dollars back. He even said he routinely gave people quarters to try it. It's perfectly reasonable for op to not be ok with emptying hundreds of dollars out of this thing.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah, the guy filling his pockets with quarters at a strangers party is totally not a weirdo or an asshole! /s\n\nShe never made it clear but normal people don't expect a payout going to someone else's house. \n\nsHe sHoUlD hAve a PoLiCy iN pLaCe\n\nIt is a god damn game. People played a game in her house without asking. The entitlement here is unreal. If I watch an interactive TV  show in your house that tells me I should take your TV and run with it, I'm sure you'd be totally fine with me doing that because you let me in your house, it's your machine and you didn't make the rules clear. Right?",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "To be fair, it was a friends friend who he didnt know. And said the first time he saw him was him stealing his money off the ground. \n\nHe didnt really have  a chance to explain.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This is so funny to me. He's supposed to have a \"policy\" in his own house, like he's going to have an HR department or something! 😂\n\nThe policy in my house is: Everything in it is mine.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Policy in place?  It's a slot machine in his own fucking house.   No guest can walk into your home and expect ownership of anything, let alone 700 in cash.  The dude tryna take the $700 is a greedy twat and should be ashamed of himself, and anyone who is calling out OP should feel the same.  NTA",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1067,
          "content": "No way. The friend was GUEST. A home is not a casino. The friend was stealing money from the home owner.\n\nWhile it should have been clarified upon entering the home, OP is NOT required to pay out. Whatever folks put into an old machine is their choice.\n\nThis friend has now ruined in for ALL the others who enjoyed going over there and playing with a vintage machine. The friend is TA.\n\nMy father has tons of these machines. Jackpots have been hit. NO ONE expected to walk away with the earnings because they aren't entitled schmucks. They are true FRIENDS.",
          "id": 23,
          "comments": [
            {
              "score": 10,
              "content": "ppl in this thread are wild you’re totally right",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Thank you. My friend has one as well. NTA. No one would think of taking the winnings",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I think its interesting that this was a friend of a friend.",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Right? I have  arcade machinesser on free play, if a friend  managed to get an old token  to fall out I'd let them keep it, but if I forgot  to clean a quarters bin, I wouldn't  let them take  it.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah, I think most people would play something like that just for the novelty and the fun of it (I know I would.) If you put in a couple quarters and get a few dollars back, then great. But if you don't win, you walk away being content with the unique experience. That is actually the attitude you should always have when using a slot machine, whether it is at a working casino or just screwing around at a friend's house with an antique.\n\nEdit: autocorrect",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 890,
          "content": "Also, this line kind of showed what kind of person OP is:\n\n> while I’m not destitute, I can’t afford to give someone $700.\n\nMaking it sound like she's having to write him a check or open her wallet. The money was put there by others, not her. It sounds like she was barely aware that the money was even in there. She's not being asked to \"give\" anyone anything.",
          "id": 29,
          "comments": [
            {
              "score": 173,
              "content": "Yeah, I'm still a bit confused...\n\n>one of my best guy friends basically told the guy he’d be in real shit if he tried to leave with the money\n\nImplies that the money came out of the machine and the guy had it in his hand. But other parts of the story, and my understanding of how the jackpot works in modern casinos, implies that the money would need to be given to the winner by OP.",
              "id": 30,
              "comments": [
                {
                  "score": 509,
                  "content": "It's an antique. My understanding is that it is literally filled with $700 of quarters.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 119,
                      "content": "How much space do 2800 quarters take? That feels like a large amount.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "*nevermind to my original comment, OP did say that the machine spit out quarters in their comments",
              "id": 33,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 371,
          "content": "I almost agreed but OP said that she gives back anyone's change when they asked for it and pays out most of the smaller amounts. It's not a legit mode of gambling, just a home decoration that people find entertaining because cmon how many people do you know with antique slot machines sitting in their house? OP also mentioned in another comment that about $100 of the money came with the machine, and an $500 from just her family playing with it. This money is absolutely not that guy's. People willingly left their small change with OP by not asking for it back and though OP doesn't actively use it for cash, it still becomes OP money in there when she pays back the change. In what part did she omit the truth? Seems pretty straightforward: play because it's cool, ask for change back or don't. Maybe OP will do a payout if she's feeling nice. That's it. It's not a scheme. Where's the lie or omission?\n\nedit: OP has updated that he didn't even ask to play",
          "id": 34,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 259,
          "content": "Exactly, you can't just keep peoples money when they lose but not pay out when they win.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "It’s his house and his rules they’re not at a casino NTA",
          "id": 36,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "But it's not in a casino. People are at his house messing with his shit, there should be no expectation of taking that money.",
          "id": 37,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "I'm willing to bet my left nut that all the people saying \"YTA\" would feel very differently on the matter if it was their slot machine.",
          "id": 38,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "NAH - I'm sorry but I have to disagree. After reading some of OPs replies, OP stated that most of the money inside the slot machine was before he/she inherited the slot machine. OP was unaware of the money, the slotmachine was mostly played by the grandparents and their friends. In the last 70 years the slotmachine never hit the jackpot. \n\nThe slot machine is being used as a novelty item, not a gambling machine. She/he is not running a casino and/or advertising to use the slotmachine to gamble and make money. \n\nSorry, but if I was a quest in somebody's home and they were so kind to let me use a antique vintage slotmachine. I would not expect to keep the money. A few quarters or 50 dollar ones every few years is something completely different than 700$.\n\nI get it can be a little bit confusing, I feel like OP should have made it clear they can't keep more than x amount of winnings. But I feel like NAH, and it is just a misunderstanding.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "A quarter and a 700 dollars is a big difference, NTA, he even offered to give his quarters back, that was extremely polite of him. Your high if you think someone playing a slot machine for fun should be able to take someone else money when they win, regardless its not their money to take.",
          "id": 40,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11442,
      "content": "NTA - I don't usually post in here, but seeing everyone claim you are the asshole for *not* giving this dude $700 seems **asinine** to me. He could not have had the same expectation here as he would in a real casino of winning a bunch of money– I doubt it is even legal anywhere in the US to do that, so why would he expect it at some guy's house? You weren't exactly smart about this (or previous times), but you're not the asshole for not giving him $700.\n\nI *am* assuming that you didn't rack up the $700+ from other peoples' money. If so, then you are running an illegal casino and not only do you owe that guy the $700, but you're also treading thin ice that the cops don't bust down your door.\n\nIn the future– don't let people play with their own money. Clean the machine out, and let people play using *your* quarters. There will never be hard feelings that way.",
      "id": 41,
      "comments": [
        {
          "score": 5734,
          "content": "I totally expected to see NTA and was so suprised. It's in his own home, it's a fun little novelty item passed down by grandparents. If I went into anyone's home I would never assume I could win money off of their shit, I'd play a few quarters for fun. It's crazy how entitled these people are",
          "id": 42,
          "comments": [
            {
              "score": 2199,
              "content": "Yeah this thread is ridiculous. I guess since OP doesn't mind giving out the occasional $50 she (guessing it's a woman since they clarified that it was a male friend that told the person he better not take the money) should just put a sign up saying it's just for fun and the most they will receive is $50 even if it hits the jackpot. My grandma had an old gumball machine and people would put quarters in there just to see the gumball roll down, then they'd throw away the gum since it was stale. It's novel. That's the whole point of both machines.",
              "id": 43,
              "comments": [
                {
                  "score": 1240,
                  "content": "Yea. She was willing to let friends walk away with $50 (of mostly her family's money) in the past so now she's an asshole for drawing the line short of $700. \n\nSo much irrational entitlement in this thread.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 482,
                      "content": "People keep repeating the $50 thing but I’m not even sure that’s true. She never specifically said anyone kept the money. She just said that’s the most anyone ever won before. Which could just mean that’s what the machine said they won, just like the machine said this guy won the jackpot, not that anyone actually kept it. But I don’t even think the amount matters. Whether it’s $50 or $700 no one should reasonably expect anything other than their money back. It’s a novelty, as others have said.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 56,
                      "content": "I see it happen alot in this sub and I wonder who these people are that write some of these comments",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "So much irrational entitlement on Reddit\n\nFtfy",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "[deleted]",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 181,
                  "content": "[deleted]",
                  "id": 49,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Shit I hope they don't get her. Shouldn't be too hard to find the grave though I guess....",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 470,
              "content": "I know right? It’s nuts to believe somebody tried to kept money that they “won” at somebody else’s house.\n\nIt’s like pokemon or zelda game where you just look into people garbage inside their houses and find “treasures”\n\nPeople are saying that OP is the asshole for letting people play in first place, but as a guest in spmebody elses house playing with something, I would assume that letting me play is a courtesy already and would spend my money knowing that I would not get it back",
              "id": 51,
              "comments": [
                {
                  "score": 174,
                  "content": "I had a neighbor with a novelty slot machine, when I was 7. Even at that age I had ZERO expectation of a payout. It was fun for the fun of it.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 5,
                      "content": "You have to wonder why anyone would ever go here for advice when even 7 year olds have better social graces than a huge chunk of this sub.",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 322,
              "content": "Entitled enough to take it to small claims court. That asshole \"friend\" is willing to pay for a lawyer for $700 that hes obviously not entitled to bc it's not a real casino. Cant believe people are calling op the asshole here. OP just letting people have fun with her machine, its not like people are putting dollars or tens of dollars in there.\n\nEdit: apparently you dont need a lawyer for small claims court, but nonetheless, to go that far out of your way to demand 700 dollars from a friend shows alot of shitty character",
              "id": 54,
              "comments": [
                {
                  "score": 18,
                  "content": "Just to clarify, many states you don't need a lawyer in small claims, and in some states you **can't** have a lawyer in small claims.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Oh I see. I'll edit my comment",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "It's gonna vary by state, but Gambling generally can't be sued over.\n\nhttp://www.aabri.com/manuscripts/131679.pdf",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "FWIW you don't need a lawyer for small claims court.  It's often like a $20 filling fee and that's it.",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "THANK YOU\nJesus christ, everyone keeps calling OP an asshole because they assume she allows people to sometimes take their winnings from a novelty machine, as if they cannot grasp the difference between $50 and $700. As someone said above, it doesn't have to be a black and white issue. If I won $700 on a machine like that, I wouldn't just assume I could keep it.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "Yes, this is one of those times where it seems like the general consensus to me is completely and utterly wrong.  You don't go to someone's house and take $700 for fun off a novelty machine",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Yeah everyone's comparing this to a casino but it's obvious that OP wasn't going in and taking the money out that was put into it, so it doesn't make sense to argue from the risk vs reward angle that would make sense for a casino. I initially thought that was old money from the 40s that was more sentimentally/historically valuable for OP than anything.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "The entitlement is insane in this post. I can't fathom how these morons think they could keep the money, and that op is the asshole.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Thank God, perusing the top comments in here now made me feel like I was taking crazy pills (especially after all the edits from OP, but still!) Absolutely 100% NTA.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This sub is full of children.",
              "id": 64,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I feel like they were using it as the cool antique version of a jar that says “beer money” that people can drop some change or a few bucks in to help the host.  Except sometimes it pays out as a fun surprise.  Also the idea that if she hasn’t needed this $700 until now then she can afford to lose it is absolutely absurd.  Not everyone lives paycheck to paycheck.  Some people have savings accounts and emergency funds.  That doesn’t mean they can just throw $700 away in a lavish gift without it having an impact on their financial wellbeing.  If she was using this thing as a fancy beer money contribution jar/piggy bank/novelty conversation piece, that is her prerogative.  It is her machine, and guests choose to play it or not.  The fact someone thought they could keep almost a grand of the hosts money is just bizarre.  That is like the guy who grabs a mostly full bottle of the hosts whiskey when they leave the party.  Just because the host may be providing refreshment and entertainment, doesn’t mean you get carte blanche.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 922,
          "content": "NTA - the responses in here are insane. The thing is a novelty in his home. This isn't a game of poker or betting on horse races among friends, it's a gimmick and novelty in his home. I think none of you have ever gambled before.\n\nIf he let's friends take some winnings home that is his choice and a gift from OP. He isn't running a casino, it's a damn gimmick and he can run it how he pleases.",
          "id": 66,
          "comments": [
            {
              "score": 193,
              "content": "I’m pretty sure most of the adamant YTA comments are coming from hardcore high stakes gamblers, maybe even minor or major gambling addicts? Anyone who sees or hears “slot machine” but not “vintage novelty inherited slot machine that my friends would screw around with for fun over the past 5 years” then they don’t realize it is NOT about money. It’s not something I personally would ever expect to take any winnings from, and OP said she’d give quarters when someone didn’t have them so it’s not like she’s in business as a casino. If anyone thinks OP *owning* this machine means that she’s signed a non-verbal contract that she’s accepting quarters for gambling I *do not think OP was aware of that contract*. Everyone saying OP is the asshole because she owned something that anyone would like to see work and some guy (apparently some guy she barely knew through a mutual friend) hit the jackpot and then basically throws a tantrum because he saw the lights and heard the bells and thought he was in Vegas and threatened to SUE because he couldn’t keep $700???? That’s almost a solid G and whether the “rules of slot machines” said that he should get to keep it or not it’s something she was not expecting to lose a secret piggy bank over. Whether she intended to empty the machine or not, whether she let someone win $50 in quarters or not, to some people $700 is soooo much money the thought of letting someone walk out the door with it when you didn’t even know you had it would be like letting someone buy an antique heirloom that had accidentally been put out as part of an estate sale. All you say is “I’m sorry I made a mistake that item is not for sale I’ll give you your money back” because it’s something you own. \n\nAs someone said, it’s a toy in OP’s house that has always had kind of arbitrary rules at OP’s discretion, because she owns the machine and it’s NOT a formal gambling tool anymore. It’s a novelty amusement. People need to stop reading this like OP is a thief just because they would have wanted to win $700 last time they went to the casino or had a poker game with their friends. The thing about gambling with friends is that some people are fine playing high stakes and some aren’t. The friendship should come first. If everyone is in agreement “we play to win and we pay up if we lose” then that’s the game everyone agreed on. If my friends all played with chips and then one of them, when they win, demands everyone pay out the amount they would have won, that guy would be the king of assholes. \n\nOP was playing no-stakes (as in refund, supplying quarters, not intending to profit off the machine at all) and her guest wanted to keep his high-stake winnings. I would say NAH before anything, because OP and the guest were not playing the same game. He saw a slot machine and didn’t consider the person who owns it isn’t a casino. She has a slot machine and didn’t consider anyone would keep $700 if they won it out of her grandma’s novelty antique. But the guy threatening to sue is like a male-Karen moment (Kenneth? Karl? Kranston?) so, yeah, NTA.",
              "id": 67,
              "comments": [
                {
                  "score": 16,
                  "content": "[removed]",
                  "id": 68,
                  "comments": [
                    {
                      "score": 15,
                      "content": "[deleted]",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Thank you! 100% this, NTA, not by a country mile.   \n\nWtf is wrong with these comments, I don’t even know if it was stated but just because the machine had a “jackpot” doesn’t mean it was actually full of $700 worth of quarters.   \n\nSo what, OP has to now come up with *seven hundred dollars they don’t actually have* because some jackass doesn’t understand the difference between a toy in someone’s living room and a casino?   \n\nJfc, I’m disappointed in this sub today. I wouldn’t give that guy any money either.    \n\n**OP isn’t running a casino**, ffs, that guy was way out of line demanding a payout over a toy.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I feel the same way! Some of the responses in this sub really make me wonder if I have a wildly different view on morality than your average person. \n\nI wonder how many of the upvotes are people who agree with the comments and have the same sense of entitlement and how many are people who just upvoted because it’s a seemingly reasonable response that’s already highly upvoted. I know that I did the latter before reading the NTA comments that I agreed with more.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 355,
          "content": ">I am assuming that you didn't rack up the $700+ from other peoples' money. If so, then you are running an illegal casino and not only do you owe that guy the $700, but you're also treading thin ice that the cops don't bust down your door.\n\nI think that assumption is the difference in how people are voting, most people voting YTA think the $700 was accumulated from people playing the machine over the years.  And assuming OP hasn't been giving people the change to play with or back.",
          "id": 72,
          "comments": [
            {
              "score": 287,
              "content": "I completely agree. It's between that and the intention of the other guy. I think people are imagining people are going to the bank to take out 5 rolls of quarters to sit at this machine expecting to win.\n\nI'm imagining a group of well-enough-off people drinking beers and occasionally putting spare change in a friend's slot machine for the novelty. If a friend of mine had a slot machine like this, I'd have no problem throwing in a couple bucks to see it work with no intention of gaining money.",
              "id": 73,
              "comments": [
                {
                  "score": 151,
                  "content": "Also you are at a party hosted by that person, presumably eating their food and drinking their alcohol.  What is $2 in quarters to see a fun piece of history in action when they may have spent $100+ to host everyone?",
                  "id": 74,
                  "comments": [
                    {
                      "score": 6,
                      "content": "And probably 1500$ to purchase the machine originally",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This is the exact problem.  \n\nIf someone assumes all the money in the machine came from OP, or says that the money in the machine belongs to OP for some other reason, they vote NTA.\n\nIf someone assumes he money came from other people playing the machine, or don’t consider the money to belong to OP, then they vote YTA",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 264,
          "content": "Thank you. The expectation that an antique slot machine in somebody's home has obligations to pay out is ridiculous. It's not an actual casino. The owner has zero obligation to anybody who plays it.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "I completely agree. \n\nI’m sure the other guy must be really disappointed, but that’s only because he misunderstood basic social cues, not because OP ”shortchanged” him!! \n\nIf you go to someone else’s house and put a few quarters into an old machine for fun, you can’t treat it the same way that you’d treat something more “official”.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Agreed. The guy trying to claim the money is just tacky.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Finally someone here saying this. My friend had an old slot machine in his house too, and no one ever tried to take anything they won, they would just put it in the jar next to the machine so everyone could play for free. Now, it's a little different because this person was using their own money to play, but maybe just give the guy 50 bucks, not 700 dollars. That is insanity.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "You don’t get in trouble for having a gambling machine st your house. He’s not a fucking casino.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "agreed with this comment, i can’t believe how many YTA’s there are. it’s a fun novelty toy for get togethers, not a real casino smh",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Agreed! I would never assume using my own quarters to have casual fun on someone’s machine in their basement would lead to big earnings. And if it did, I would never feel right taking it! A couple quarters to have fun, sure! But if I want to win big I would go to a casino. I was thrown by all the YTA responses.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5981,
      "content": ">Over the years people have played it and maybe won a few quarters here and there. Maybe a max of $50 at a time.\n\nThis reads like you normally let people take their winnings and people play with their own money expecting to be able to take the winnings. You randomly decided not to let your friend take the winnings this time because you decided it was too much money. \n\nYou are absolutely a gigantic asshole here. YTA",
      "id": 84,
      "comments": [
        {
          "score": 3213,
          "content": "What? There’s a huge difference between people winning a couple dollars or $50 versus someone getting $700. That doesn’t make them the asshole wanting to figure out what to do with the money. \n\nOne is part of the novelty. The other is a serious amount of money",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "[removed]",
          "id": 86,
          "comments": [
            {
              "score": 16,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/wiki/index#wiki_1._be_civil). Further incidents may result in a ban.\n\n[Full rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index) | [Expanded Civility Info](https://www.reddit.com/r/AmItheAsshole/wiki/becivil) | [\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 87,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "It’s a novelty in this dudes living room. You’re damn right he randomly decided $700 was too much and $50 wasn’t. That’s his right, and I think most of us would do the same.",
          "id": 88,
          "comments": [
            {
              "score": 5,
              "content": "First time I've seen people argue someone is an asshole for not committing what is probably a felony",
              "id": 89,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "However it wasnt even his friend so...",
          "id": 90,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5948,
      "content": "NTA, you're not a casino.\n\nAnd for all the people basically complaining that he robbed his friends blind:\n\n1. He got 700 bucks over the years. If we assume that he has been doing this for 10 years (number courtesy of my ass), he got a whopping 20c per day out of it, shared among all the friends who used this machine over the years (damn, what a greedy SoB he must be! /s ). And that's just me being generous, it might just as well have amassed over the span of 70 years considering the age of the machine.\n2. OP's behavior indicates that he never intended to cash in on the little treasury; otherwise he would have cleaned it out regularly. In fact, I am under the impression that he would probably have died with the machine still holding the money had this not happened. And considering that he didn't stop people from leaving with 50 bucks, him clinging to all the money also didn't seem to be the intent. At the end of the day, he just didn't want some rando to leave his home with 700 bucks - not an unreasonable request if you ask me. \n3. He might just as well have had an 80s arcade in his home and people would have played it for the same reason (have some harmless fun without thinking to much about the quarters they're burning). What would have been so different about this if we remove the possibility of the jackpot?\n4. And for him not making it abundantly clear that he wouldn't just allow people to waltz out of his home with a small fortune. There is such a thing as a \"reasonable person standard\" - and a reasonable person would not have expected to get 700 bucks from a guy whom he didn't have a bet with, who wasn't a casino and who didn't even know him, just because he was lucky when it came to pushing a button.\n\nEDIT: I am not kidding, some people literally accuse OP of \"stealing from his friends\" and \"having a moneymaking scheme going on\" (with his friends probably never expecting *any* kind of notable payout). I mean, seriously?! A few tens a year is a moneymaking scheme and theft to you?",
      "id": 91,
      "comments": [
        {
          "score": 1407,
          "content": "You've swung my vote by making a well reasoned argument, thank you! NTA.   \n\n\nWould have been wise for op to clean it out before having friends play with it, but, hindsight and all that.",
          "id": 92,
          "comments": [
            {
              "score": 260,
              "content": "I don’t see why they should have to clear it out before anyone uses it. Would you expect to keep a friend’s money in this scenario? I certainly wouldn’t. It’s obvious that money’s been built up over years, I’d just be stoked with the accolade of having hit the jackpot.",
              "id": 93,
              "comments": [
                {
                  "score": 54,
                  "content": "One hundred percent this! They \"won\", and that's awesome.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "I know right. I can't believe the reasoning for the top comment being YTA is that \"you were fine keeping quaters\" Like hell yeah drunk and high people love to see that shit light up, it's a fun game. Like she was only letting people play to collect their money. Unbelivable.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Also, most of those quarters could have been OP’s, considering it’s their toy in their house for years.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Not even a friends money, a stranger who you don't even know. \n\nAnd the people who play it for 25ct when they visit, certainly don't do it expecting to win the jackpot. I'm pretty sure most people do it just because the audio-visual-haptic experience of playing the thing is worth 25ct to them at least.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Dude even if someone was like \"no please take half\" I'd be all nooo.  You didnt invite me to hour party so I could take your money. \n\nPeople are being v weird . I cant imagine they have ever been to a friend of a friends house.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 873,
          "content": "It took WAY to much scrolling to find this reasonable comment. \n\n\nThis post highlights everything wrong with this sub since it skyrocketed in popularity.    People responding emotionally as if they were the guy who “won” the jackpot without ever considering reality",
          "id": 99,
          "comments": [
            {
              "score": 356,
              "content": "Pretty much this.\n\nAny thread where the OPs doesn't come off as totally pristine usually devolves into a yta-fuckfest; instead of considering that maybe, just maybe they might *still* have a relatable reason for acting the way they did. This lack of ambiguity tolerance is baffling.",
              "id": 100,
              "comments": [
                {
                  "score": 177,
                  "content": "Seriously. \n\nThis is literally the perfect sub for that kind of ambiguity and actual in depth discuss. \n\nBut no.  Can’t be reasonable here",
                  "id": 101,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I suspect we're either dealing with a disproportional amount of  teenagers or gamblers here.",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "[deleted]",
              "id": 103,
              "comments": [
                {
                  "score": 6,
                  "content": "I hate when people bring the law into this. This isn't a legal advice sub, no one's asking about legality. The law has not ever, doesn't, and never will have *any* bearing on morality.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Seriously.   It’s horrifying how many people don’t understand that though",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "I’ve only found this sub by chance but god damn, it’s obvious whenever a thread goes one way. There was this guy people were calling an asshole because he didn’t want to suddenly reconnect with his 25 year old daughter, who gave up visitation rights to him years ago, and clearly wanted to now be financed by her real and rich dad. Completely ignored the fact that her mom and step dad could have supported her, and how she had several years in college to reach out to him prior to some random surprise party. Also ignoring how this guy has a new daughter with someone else now and gave up any desire for a relationship with this eldest daughter who abandoned him.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 642,
          "content": "[removed]",
          "id": 107,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 434,
          "content": "Agreed. There's also the fact OP has stated 500-600$ has been from family playing it over the decades (I mean it's been in the family since the 40s). So the fact people are making it out as all the money has been from friends makes them wrong.\n\nIt's incredibly baffling to me the amount of people against OP. \n\nNTA so much. Any reasonable adult would realise it's a NOVELTY and just for the experience. I would assume any winning would go back in to the machine because my friend is not a casino.",
          "id": 108,
          "comments": [
            {
              "score": 25,
              "content": "Exactly , the fact he let someone keep 50 bucks is already kinda nice. I think the only the he probably should’ve done is just keep a little jar of quarters or something next to it to help imply “ hey this is just something for fun I’m in no way looking to profit and also not looking to really pay out” but it should be kind obvious to anyone using an antique slot machine that it’s a novelty item. Op is NTA but I think this post is more deserving of an ESH for the the sheer stupidity involved .",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 85,
          "content": "Put it into words perfectly",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I know tons of people with 80s arcades in their homes, they rig them to play for free or have their own tokens.",
          "id": 111,
          "comments": [
            {
              "score": 12,
              "content": "I've known a few people who had them and didn't bother changing it from needing quarters.",
              "id": 112,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "Yea this really is the best response. Absolutely mind-blowing that it isn't higher. People are crazy.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I'm excited for this to go down as one of the most polarizing AITA's in a long time. I'm floored that so many people are siding with the friend-of-a-friend yutz who thinks they have some weird legal right to a novelty payout at someone's house",
          "id": 114,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "NTA I dont even want to explain anymore because Ive already been banned in the past for going \"against the flow\" and getting angry. Even though others were flaming me for my opinion in the same \"angry\" way",
          "id": 115,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "NTA. \n\nMost people at AITA are none better than people at relationshipadvice. Over dramatic and useless.",
          "id": 116,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1911,
      "content": "ESH, but you to a lesser extent. You had a slot machine at a party, and people put their own money into it - you should have made it clear that it wasn't technically \"playable.\" Keeping $700 in it is nuts. You can't afford to lose $700, but you \"never bothered\" to get it out because \"seemed like a fun novelty?\"\n\nThat said, it was your home, not a casino, and as soon as you told your guest the jackpot wasn't up for grabs he should have laughed it off. Threatening to call cops and take it to court is just embarrassing.\n\nPut a sign on the slot machine to say \"all jackpots are the property of the owner.\"",
      "id": 117,
      "comments": [
        {
          "score": 9,
          "content": "Dude he is already throwing a party for everyone, he shouldn’t have to worry about petty shit like hiding quarters. Poor person will probably never want to host a party again because of people like you and this dude trying to walk away with 750$ in quarters.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1270,
      "content": "NTA you're not a casino.\n\nThat said, you should not have kept so much cash in there really as it's kind of predictable that someone would feel possessive of the cash from a win.",
      "id": 119,
      "comments": [
        {
          "score": 304,
          "content": "I think he was okay keeping the cash in there. That was probably an awesome sight and hilarious for the party to see the waterfall of cash. If the player hadn't been a tool it would've been hilarious and talked about for several parties.",
          "id": 120,
          "comments": [
            {
              "score": 288,
              "content": "[deleted]",
              "id": 121,
              "comments": [
                {
                  "score": 181,
                  "content": "Yeah it would never have occurred to me to keep the money. I’d think “whoa that was exciting, I got to see the jackpot sequence on this cool old machine!” then start awkwardly looking around for who I was supposed to give the money back to.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 141,
                      "content": "Exactly, in what world do you expect to keep the cash from someone's novelty machine? That's like expecting fine dining when you go to someones house for a dinner party, or worse thinking it's okay to take the money out of a wishing fountain.\n\nYou're a guest in someones home and I don't think people here seem to recognize how to be polite in someone's home.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "It's all in QUARTERS! I can't imagine carrying $100 in quarters, much less $700.",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "Yeah, a fun guest would have been like, “Woohoo!  Drink are on me, everyone!”  Then laughed with all the guests.  When he tried to give all the money back, OP could have said they could keep some for the fun of it, then dump the rest back in the machine for everyone to play with.",
              "id": 125,
              "comments": [
                {
                  "score": 13,
                  "content": "This is exactly how I imagined that playing out with well adjusted adults present.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Id expect we would dump it all back in so it could keep giving out prizes",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Idk if I was there fucking around with a friends slot machine I think 50+ years of money spilling out would be super fun and exciting, but I DEFINANTLY would not expect to keep any of it, because who does that? If I think it'd be fun to put a dollar in an old slot machine I'm not entitled to 700$ of my friends.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 874,
      "content": "NTA also this is a really good post the people are split on this one I hope it makes front page",
      "id": 129,
      "comments": [
        {
          "score": 187,
          "content": "Yeah, finally some good fucking content on this sub",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I imagine the YTA folks are putting themselves in the winner's shoes and the NTA folks are putting themselves in OP's shoes haha.",
          "id": 131,
          "comments": [
            {
              "score": 16,
              "content": "Exactly what I was thinking bro. If I were in OPs shoes there’s no way in hell youre getting that 700 dollars lmaoo",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Which is why imo all the YTA folks are huge assholes",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "It did, by the way. That’s where I found it.",
          "id": 134,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Yeah i deff agree this one is quite the hard one.\n\n On one hand i would be pretty pissed if someone showed me their slot machine and let me gamble and apparently gave other people their winnings only for me to win big and for them to say \"oh how much did you put in, ill just give you a refund\" if they even said it that nicely.\n\n But on the other hand the dude who won seemed like someones plus 1 which is **super** presumptuous of them to try and hold OP to something they never actually agreed to (like if they were playing poker.) and to act like they *earned* the 700 bucks as opposed to settling for 20 bucks or something because you helped clean out their machine and were lucky. \n\nIm a bit unsure but OP is apparently banned which is quite depressing to say the least.",
          "id": 135,
          "comments": [
            {
              "score": 11,
              "content": "I look at it like this. I’m sure the guy wasn’t going to that party and playing that thinking “I cant wait to hit that jackpot 😈😈” it was most likely for fun so he really shouldn’t feel entitled to this 700 cause let’s be honest this is reality. I say 95 percent of this sub wouldn’t give up 700 dollars from their own machine on the principle of being nice.",
              "id": 136,
              "comments": [
                {
                  "score": 5,
                  "content": "yep, thats for damn sure",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 801,
      "content": "NTA\nYou aren’t a casino, and I doubt he was playing on it expecting to see a payout. And it’s your property. It’s just a fun machine to play on to pass time. It’s not like you told him there was tons of money in it and he then spent a lot trying to hit jackpot without telling him he wouldn’t get to keep it.\n\nBut honestly, keep the machine cleared out. This entire issue could have been avoided.",
      "id": 138,
      "comments": [
        {
          "score": 142,
          "content": "> But honestly, keep the machine cleared out. This entire issue could have been avoided.\n\nThis was my first thought as well.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 745,
      "content": "NTA wtf can't believe someone would think otherwise. Its YOUR machine in YOUR house. You let other people keep their winnings because it was relatively small and you were being a good sport about it. For those who disagree imagine if your at a friends house and he has a slot machine. Would you really be putting in quarters as a hope to win money or just playing with it cause it's a fun novelty.",
      "id": 140,
      "comments": [
        {
          "score": 232,
          "content": "apparently everyone is an avid gambler at the sight of a slot machine",
          "id": 141,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "yeah not only that but this guy seemed to be \"a friend of a friend\" which makes this come off super cunty of them by trying to hold the host to rules she never actually agreed to.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 610,
      "content": "[deleted]",
      "id": 143,
      "comments": [
        {
          "score": 157,
          "content": "Smh... \"He put in his own money\".You couldn't buy a few beers with those quarters, OP is probably at a loss for hosting the party in the first place. Entitled people everywhere....",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}