{
  "post content": "Hi Reddit.\n\nI don't want to go to Christmas this year. I'm a 30 year old and have been unemployed since 2019, but my wife makes enough money to keep us afloat. My family does a gift exchange every year, but it has always been extremely limited due to our financial positions. Normally we just get each other a simple gift or a gag gift, and something for our mom.\n\nThe cast here is my mom, Sister 1 and her family (2 children, husband), and Sister 2 and her family (2 children, husband). Some years ago the \"agreed\" upon gifting routine changed. Each kid would pitch in a few bucks to get mom a combined big gift gift, and the grandkids (my nibblings) would get presents. This would take place on the first Christmas I shared with my soon-to-be wife. It kind of sucked. Each household received gifts except for mine, because I don't have children. I'm 30, Sister 1 is 33, Sister 2 is 36. Their kids are 2-8 years old.\n\nThen for Christmas 2019, I sent a group message explaining that my then-fiance and I felt very left out the previous year. I suggested that they get my dogs gifts. That didn't happen.\n\nSo for Christmas 2020, I sent this message when Christmas talk came up in the family chat.  \n>So time for me to be a debbie downer. Last year [Fiance] and I were pretty obvious about feeling left out and suggesting our dogs got some gifts. Gave sizes, favorites, etc. That didn't happen at all and we felt pretty bad about being left out. Each other household got to take home gifts. It sucked.\n\nI was laughed at, gaslit about not ever mentioning it, and told, \"We don't even buy gifts for our cat lol.\"\n\nThe last thing I said about the topic was November 23rd.\n\n>Which is why we don't hold it against anyone from last year, but in the interest of not feeling left out and hurt we headed it off at the pass this year. I don't appreciate being laughed at about it, though. It's out there now, you know how we felt about last year, and are planning for the same thing this year.\n\nSpoiler alert: Every household went home with gifts last year, except for mine. It sucked. My fiance and I spent over $200 between the 4 kids and my mom, and received no gifts. No one knows it, and I doubt I will ever share with my family, but my fiance cannot have children. We might adopt later in life.\n\nSo after three years of feeling depressed after Christmas, even after telling them about it, I don't want to have it happen a 4th time. Once Christmas plans are mentioned this year, I will simply tell them I won't attend. We can visit friends or have our own celebration. My fiance thinks that's a bad idea, because they are my family, and apart from this whole issue, they're not terrible.\n\n\nedit: I had confused myself a bit, and tidied up the post to make some more sense. This started in 2018, not 2019. Between quarantine and unemployment, my long-term sense of time is messed up.",
  "id": 1,
  "comments": [
    {
      "score": 90,
      "content": "ESH. It does sound frustrating and disappointing to be left out, but asking them to buy your dogs gifts was a bad idea. Your siblings appear to have come up with a Christmas celebration that meets their needs without taking into account that there's a 3rd sibling. \n\nIn the end, I suspect it will be your mother who pays the real price for this rift.",
      "id": 2,
      "comments": [
        {
          "score": 26,
          "content": ">  I suspect it will be your mother who pays the real price for this rift.\n\nShe lives alone, and is no more than 5 minutes away from the other 3 of us and we all see each other at least a few times a month. But you're right - Christmas morning she does feel very lonely.",
          "id": 3,
          "comments": [
            {
              "score": 28,
              "content": "I may have missed something, but why don't you go over to her place Christmas morning or have her over to yours?",
              "id": 4,
              "comments": [
                {
                  "score": 23,
                  "content": "That's something I would 100% do if I go ahead with skipping the main event in the early afternoon. But there would still be drama over me missing that.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I think you found your answer. \n\n\nAnd if at all possible - don't play into the drama. The other siblings can go pound sand.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Why not arrange a gift exchange/Christmas breakfast with just you/your mom/your fiance. Start your own little tradition.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 41,
      "content": "Soft YTA: if the only reason youd want to see your family is for gifts, thats kind of crappy. Im in the same boat as you, broken baby maker, and my family has the same kind of winter holiday reunion where only the kids get gifts. My family knows im super dedicated to my pets BECAUSE I can't have kids. I would still never expect them to buy my pets gifts or not go because i felt butthurt that my household is the only one not being gifted. The point is getting the family together, not just getting stuff.",
      "id": 8,
      "comments": [
        {
          "score": 54,
          "content": "I honestly get why OP feels left out. They’re not saying they need hundreds of dollars spent on the animals, but even twenty bucks on the pets gives them something to unwrap and feel part of  the tradition. \n\nI’m in my 30’s and childless/single and my mom gets me socks, underwear and like one or two fun gifts (maybe a book I wanted or a hat or something) and sometimes one little thing for my cat. If I just sat there while my nieces and nephew opened presents, it would hurt a little. Now I have two siblings who are also childless, so maybe it wouldn’t be as bad as OP being the only one left out if we all were. \n\nIt’s not about monetary value or receiving shit as much as it is being thought of. Especially when you expressed that this hurt and you were laughed at for it. Every family is unwrapping presents and they just sit there. \n\nFuck, my mom got my dad a present for Christmas once when he came over - and they’d been divorced for over twenty years. It’s just nice for everyone to have something to unwrap even if it’s some treats and a toy for the dog.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I have a very consumer-driven family. My mom's favorite pass-time is browsing hobby lobby, buying things at walmart, and returning things to walmart. She rubbed off a lot of those traits onto my sisters.\n\nOur holiday party tends to have 3 parts. We each cook our part of the meal at home and then bring it to my mom's for finishing touches while we chat, eating the meal, and then the gift exchange.\n\nIt's not the only reason we want to see them, but being left out of the final activity sucks a lot. There's a lot of joy and excitement that the parents get watching their kids open a gift. My wife's mom sends us gifts for our dogs, and we get the same thing when we help our pups open them.\n\n\n^^edit: ^^my ^^mother ^^in ^^law. ^^That's ^^a ^^new ^^term ^^in ^^my ^^life, ^^trying ^^real ^^hard ^^here. ^^lol",
          "id": 10,
          "comments": [
            {
              "score": 16,
              "content": "I say NTA.\n\nYou need to pose this differently. The words you're using, \"feeling left out\" etc., are not getting across what you need to. It is striking folks as childish and greedy and petty. What I'm actually reading, though, is that you're asking your family to show you a form of love and value.\n\n\"Stuff\" and \"gifts\" aren't how everyone feels and shows love, but for some folks gifts are extremely important. What you seem to be asking is for your family to demonstrate a kind of thoughtfulness and reciprocity that would be really meaningful to you, but your word choice is just rubbing everyone the wrong way.\n\nI'm really not sure you can pose this to your family in a way that \"clicks,\" for them - but you can try. Maybe...\n\n\"I know I have brought up before that come gift giving time I feel left out. I've actually been reflecting on this a lot since nothing has changed. I'm trying to be introspective about why this matters to me, and I think I have an answer. When I gift things to the kids and to mom, I feel love for them. I look forward to seeing their joy, and it's very meaningful to me that I can demonstrate how much they matter to me. I’ve realized that what I feel *for* people when I give gifts is what I feel the same *from* people when receive them. It doesn't really matter if it's a big gift or a little gift or a gift for the dogs - the physical token that I've been thought of gives me the warm and fuzzies (odd as that might sound) and it turns out is pretty important to me. While I realize that shifting to a model of kids getting presents isn't that abnormal, I was wondering if we could reassess our gift giving and maybe find a way to add this method of showing love and care back into our holiday tradition for me as well? I'm open to ideas - it doesn't have to be gifts for the dog. Maybe a secret Santa amongst siblings and spouses with a $10 limit could be fun?\"",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I get where you're coming from - and I also buy for the special dogs in my families' lives. I think NTA",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "YTA. But your dogs can't open gifts. Why can't you enjoy watching your nieces and nephews love opening the gifts you got them? It's not like your sisters are getting gifts and leaving you out. The children's gifts are for the children, not your sisters, whereas I feel that your instance that your dogs get gifts is really for you, not your dogs.",
              "id": 13,
              "comments": [
                {
                  "score": -15,
                  "content": "Right! Christmas is for kids. And honestly I love giving gifts way more than getting them. I love to see my niece's faces light up and think the gift I got them was awesome. I have a baby and my nieces are 11 and 9, 12 and 10 by this christmas. For all the years I didn't have a kid I did not care at all about getting presents. I even went over on christmas morning and got to see them open all their presents. To be fair though, my mom still does stockings for all of us, which as an ADULT, is plenty",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 21,
      "content": "I am going on a limb and saying NAH. \n\nListen, I am not buying Christmas gifts for my siblings dogs. And I would not appreciate the comparison between my actual kids and your dogs. So they are not AH for not buying your dogs presents. \n\nChristmas is not about getting back what you put in. Don’t you care about your niblings? Don’t you want to get them something? THAT should be the reason you get gifts. Not to make it fair. \n\nHowever, it is heartbreaking to not be able to have children and watch others celebrate with theirs, but nobody is at fault for that. \n\nI get your frustration, but I think the dog gifts are unreasonable. If you feel that strongly about it to miss Christmas with your mom- go ahead, but you are only punishing her for it.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 17,
      "content": "Wow, yeah YTA. \n\nThe siblings got together to keep costs down and decided to do a Christmas where only kids get gifts, and then everyone pitches in on a gift for mom because they love her so much. \n\nAnd you're pissed your \"household\" has no gifts? \n\nIt sounds like they value family time, want to make it magical and memorable for the kids, and genuinely appreciate their mother. \n\nYou're so insanely materialistic that you need to go home with gifts otherwise the holiday sucked? While everyone else enjoys togetherness you need *stuff*.\n\nYes. You are absolutely TA here. \n\nAppreciate the fact that your in laws aren't hung up on getting stuff, and just want to be together. Because otherwise you'd have to pay for gifts for everyone, instead of just a couple of kids' toys and something for mom.",
      "id": 16,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "INFO - Is there a reason why you won't tell your family that you aren't having biological children? Sure you aren't getting gifts. But neither are your siblings from the way I'm understanding the situation - their kids are. So maybe they feel like, without knowing you aren't having kids, that it's just a matter of time until they're buying gifts for your kids too.",
      "id": 17,
      "comments": [
        {
          "score": 10,
          "content": "Because we still might be able to have kids. My wife would be a high-risk pregnancy for reasons, but therapies and procedures are always developing. Also, my wife comes from a much more private lifestyle, she would never share medical information with anyone but her own mom.\n\nTowards your second question, it's satisfying and exciting to see your kids open a gift, even if its not for you. I get the same excitement watching my dog explore a new toy I got for her. The experience for the adults is the same, even if the gift isn't for them.",
          "id": 18,
          "comments": [
            {
              "score": 12,
              "content": "I guess? I think maybe some people just don't see Christmas/family holidays as moments that have to be all about equity and feeling included. If you're there, you're included. Does it stink that they laughed at your suggestion to get a gift for the dog? Sure. But for a lot of people it's comical to get pets Christmas presents because they are not equivalent to children. Don't you derive pleasure from watching your nieces and nephews get excited opening presents that you bought? Are there other family issues that are rolling into this one? Because this, from an outsider's perspective, frankly feel, really minuscule.\n\nI mean if you think all of that is worth potentially causing a long-term rift between you and your family, by all means start a new Christmas tradition. You shouldn't feel left out on what is supposed to be a nice family holiday. But it very well might cause said rift.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "How come you do not enjoy seeing the kids open presents from you? Honestly you really don't enjoy watching presents from other people to your kids because you are just thinking \"great, even more crap\". I love watching people open the presents I spend a lot of time thinking of the perfect one. They are getting nothing out of it as parents.",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "NAH\n\nIf you agree to a kids and mom gift exchange, and you don’t have kids, you don’t get gifts. \nThere’s nothing wrong with not wanting to participate in a gift exchange. \n\nAre they even gifts if you are expecting gifts in return?",
      "id": 21,
      "comments": [
        {
          "score": -4,
          "content": "This was very much a, \"My way or the highway\" situation. One sister said its what she was doing and before I had time to interject, there was already a group consensuses.",
          "id": 22,
          "comments": [
            {
              "score": 10,
              "content": "Again, you can decline. There’s nothing wrong with not wanting to participate. But, getting upset about something for which you agreed, isn’t productive. \n\nGift giving isn’t quid pro quo. It’s not a gift if you have expectations of something in return.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "YTA, if I'm getting this right- only the kids are receiving gifts & you are mad because you don't have kids.",
      "id": 24,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 13,
      "content": "I think NAH. I think that rather than not attending, maybe just say that you don't want to buy gifts? Idk, if it's just kids getting gifts, then I would think it was strange for someone to ask for gifts for their pets. I go to many family functions where my family doesn't get gifts(even my kids may have to watch others get gifts because it's not our immediate family, but still our family) and it doesn't bother us. We don't go for gifts, we go for the time with our family. But I'm also the first to tell everyone don't get us anything because we aren't getting you anything.",
      "id": 25,
      "comments": [
        {
          "score": 12,
          "content": ">We don't go for gifts, we go for the time with our family. But I'm also the first to tell everyone don't get us anything because we aren't getting you anything.\n\nFor real. \n\nI have a four generation family. A while ago my parent's generation decided to only get gifts for the kids and their own parents. \n\nBuuUUuT 20 years later, us kids are grown and we all have our own kids, so now only Great Grandparents and their great grandchildren get gifts. It's all about the joy of watching little kids get a present, and honoring the people who caused all this to happen, lol. \n\nWe exchange cookies, and kids play, the parents all laugh together, the grandparents reminisce (and laugh a LOT) and the great grandparents preside over the whole thing like royalty, with grandma always making a short toast and crying because she's so happy, lol. \n\nI'm not there to bring more toys home. I'm there to be with family at Christmas, because Christmas gatherings just feel different than just dropping by to bring the great grandparents some lunch, you know?",
          "id": 26,
          "comments": [
            {
              "score": 4,
              "content": "Love this comment! This is what Christmas is about, not spending money",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "YWBTA. Softly.\n\nChristmas is about more than gifts. It’s about spending time together as a family. And it’s ridiculous to expect people to give your pets gifts just bc you don’t have kids. It’s extremely common to only buy kids gifts at Christmas. You can get joy from watching your nieces and nephews open the presents you got them. An alternative would be a name exchange, where each person draws one name and buys for that person. I understand you feel left out, but in most cultures and families Christmas and gifts are designed  for kids. I doubt they are “excluding” you in purpose.\nSince you don’t feel it’s fair, please offer solutions  that you’re comfortable with (that don’t include them giving your animals gifts....)",
      "id": 28,
      "comments": [
        {
          "score": 9,
          "content": "I honestly don’t get why everyone is so weird about giving the pets gifts. \n\nIt’s not about kids being equivalent to dogs. It’s about letting OP still participate in a family tradition. It would literally cost these people five dollars to get a dog something JUST to be thoughtful to OP. \n\nOf course my mother doesn’t think my brother’s kids are the same thing as my cat or my sister’s (who can’t have children) pets, but she makes an effort to get them a little gift anyway. We never even asked her to. And my mom is not a big animal person at all. But she knows they are important to us. \n\nI honestly don’t get that much joy from watching my niblings open gifts. I don’t know OP’s situation, but these kids are so ridiculously spoiled that there’s nothing I could give them that would matter anyway. I still love them and care about them. But when you’re spending $25-$75 a kid and they already all got their new iPads and apple watches and concert tickets that morning, it’s hard to think they give a shit. Which I’m not complaining. They’re nice well-behaved kids, but come on. You can’t compete with that.\n\nI started just giving to their college funds. They’ll thank me when they’re 18.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "Info: did your siblings receive gifts or was it just the kids?",
      "id": 30,
      "comments": [
        {
          "score": -1,
          "content": "Each family unit exchanged gifts at home before the big party. So Sister 2 and her husband exchanged gifts privately, as did me and my fiance, etc.",
          "id": 31,
          "comments": [
            {
              "score": 12,
              "content": "[deleted]",
              "id": 32,
              "comments": [
                {
                  "score": 0,
                  "content": "Correct. I told the group chat that they can get my \"fur kids\" a gift if they'd like, so we could be included. The only people opening gifts were the children (Or rather, the parents on behalf of the children. Toddlers aren't good at boxes)",
                  "id": 33,
                  "comments": [
                    {
                      "score": 23,
                      "content": "[deleted]",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}