{
  "post content": "Ok so I'm in middle school and have 2 sets of friend groups one I'm starting to slowly drift away from but I am still close with 3 of them. Anyway I'm big on indoor skydiving as in I have more then 5 hours clocked in the chamber that's just minimum most likely more. \n\nSo the place I indoor skydive has 3 options.\n\n 1 buy it when you get there (least amount of time able to buy) \n\n\n2buy a ticket then go whenever you want (still provides a good amount of time) \n\nAnd 3 schedule a class which gives the best amount of time.\n\nSo I usually do schedule cause it's best amount of time for money. And my friend knows how big I am on indoor skydiving. So I got it scheduled in around December cause they had good deals then. And got a bunch of flights scheduled in advance. One just so happened to be 2 months away on my friends birthday.\n\nNow you would think hey just reschedule it right? Here's the thing that sucks if you book in advance and it's a private session you cant reschedule which is one the thing you sign when booking in advance. The only way you can reschedule is unless you do it within a month of the reservation. And I wasn't told the final details until about 2 weeks before the party.\n\nSo I told him and he got pissed (which is very unlike him) and we got in an argument. After 5min unsaid i dont really feel like talking about this and he agreed. The next day we talked and he said he was sorry and was already in a bad mood. But he added I was an ass hole for choosing not to go and to go to a hobby instead. I explained to him what I explained above and also said I still got him a gift (I was going to). So now I have to choose between a +300 dollar lesson or his birthday. \n\nSo after the argument and my lesson I'm really considering not going so wibta?",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "NAH/INFO. It's reasonable for you not to want to forfeit a $300 class. It's also reasonable for your friend to be upset that you can't make his party. Even if you explained it, he probably heard \"I'm bailing on you because I would rather to skydiving\". \n\nIt depends on how close of a friend he is, and also how much you value his friendship. If he's your best friend you've known since you were 5, I would say this is kinda shitty. If you're not super close, it shouldn't be a big deal to not make it. \n\nWhy don't you schedule a time close to his birthday to take him out somewhere and hang out just the two of you? Like go out to a movie or bowling or something, and make sure you let him know before that you have a previous commitment on his birthday but still value his friendship and wanted to do something special.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Exactly what I was going to say.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "Don’t mean to put you down at all but this is some childish shit. You already had plans, it is what it is. NTA.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA. y’all sound young",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA but check with the company. Sometimes they really don't care about rescheduling. Explain your conflict and that you're going to plan around it but do they have any ability/willingness to move the day.",
      "id": 6,
      "comments": [
        {
          "score": 3,
          "content": "Yah I think we really should look into that🤔🤔",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. This guy has no right to guilt trip you. Go skydiving.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA! \n\nYour ‘friend’ is the asshole for prioritizing his birthday party over your indoor skydiving thing. You’ve made it very clear that it would cause more issues to reschedule and cancel, and he should be understanding of that. You’ve had your plans for a long time and a true friend would be understanding of that. This is something that you are clearly passionate about and it’s a shame that your friend can’t understand that. Don’t let your friend’s selfishness guilt you into feeling like your hobby is unimportant.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOk so I'm in middle school and have 2 sets of friend groups one I'm starting to slowly drift away from but I am still close with 3 of them. Anyway I'm big on indoor skydiving as in I have more then 5 hours clocked in the chamber that's just minimum most likely more. \n\nSo the place I indoor skydive has 3 options.\n\n 1 buy it when you get there (least amount of time able to buy) \n\n\n2buy a ticket then go whenever you want (still provides a good amount of time) \n\nAnd 3 schedule a class which gives the best amount of time.\n\nSo I usually do schedule cause it's best amount of time for money. And my friend knows how big I am on indoor skydiving. So I got it scheduled in around December cause they had good deals then. And got a bunch of flights scheduled in advance. One just so happened to be 2 months away on my friends birthday.\n\nNow you would think hey just reschedule it right? Here's the thing that sucks if you book in advance and it's a private session you cant reschedule which is one the thing you sign when booking in advance. The only way you can reschedule is unless you do it within a month of the reservation. And I wasn't told the final details until about 2 weeks before the party.\n\nSo I told him and he got pissed (which is very unlike him) and we got in an argument. After 5min unsaid i dont really feel like talking about this and he agreed. The next day we talked and he said he was sorry and was already in a bad mood. But he added I was an ass hole for choosing not to go and to go to a hobby instead. I explained to him what I explained above and also said I still got him a gift (I was going to). So now I have to choose between a +300 dollar lesson or his birthday. \n\nSo after the argument and my lesson I'm really considering not going so wibta?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. this is just a decision you have to make, either way, whatever you choose, you should enjoy 100%. Your friend can celebrate their birthday with you separately and if he’s having a party it sounds like he has other people to hang out with. Still, you have the option to call the skydiving place and ask if you could reschedule.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    }
  ]
}