{
  "post content": "My wife (27F) and I (30M) have been married for 3 years, together for 4. She recently started an internship for the next two months on the other side of our large metropolitan area that takes 1 hour to get to via mass transit (at worst 1:15 and Google says at best 40). I usually take the bus to work, which takes me about 15-30 minutes. We have a car, but she doesn’t drive yet. The internship leads to a potentially lucrative career for her as well as she progresses up the ranks in a few years (200K+).\n\nFor the first two days this week, I drove her to her internship. This took away about an hour+ of my sleep (30 min drop off, 30 min to work, 10 min walk), and cost us $15 in parking (she also had to commute back via mass transit given I’m at work). I am a very poor sleeper in terms of times / hours (average probably 4-6 a night so every hour matters in my opinion). I admit this is my fault as I stay up too late (reading, gaming, random chores, tv) and I do not have a great sleep schedule. I also do reasonably well at my job, making around $250K+ (context later). So instead of waking up at 730, I had to wake up at 630 to take her. And even that one hour less of sleep made me feel awful during the day and I couldn’t concentrate (and my job involves me thinking all day). I felt it affect my performance.\n\nI initially suggested she just take mass transit to work, and just leave earlier because I need my sleep. She countered with just take me to the main station hub, which is just 5 min away (her walking would take 15). I said that still disrupts my sleep and doesn’t really solve the issue - I want my sleep to be productive at my job.\n\nThis is where the emotional blackmail started which included\n-crying\n-“I can’t believe my own husband won’t do this for me”\n-“Why are you even my husband then”\n-threatening “I’ll do what I want” when I try to find a solution\n-cold shouldering / ignoring now\n-“my own husband”\n\nKeep in mind, I’m trying to be reasonable / rationale and not get emotional, but I do say she is emotionally blackmailing me. I probably got somewhat emotional / loud in the argument as well - “my one hour is worth less than $25 to you”.\n\nMy ultimate solution was why don’t we just get an uber? It would cost $20-$25, allow both to sleep more, she could leave as she wanted, and it’s safer (mass transit can be sketchy here) and quicker. At most it’s for two months as she will hopefully start driving soon and we can afford it. However, she wants to save $$$ (which I sincerely appreciate cause we are single income right now) but I’d rather be able to think straight and have her have a safe, quick commute.\n\nOr, should I just suck it up given it’s only two months and fix my sleep schedule overnight (which has been messed up now for 3+ years). I really do value every hour (I have massive bags under eyes).\n\nTLDR: AITA? wife and I fight over morning commute. Emotional abuse / blackmail / manipulation - is it there? What is the solution? We are both stubborn.",
  "id": 1,
  "comments": [
    {
      "score": 49,
      "content": "You can’t say you *need* that hour of sleep when you refuse to go to bed at a reasonable time. Stop using that as an excuse. \n\nESH. She shouldn’t be expecting you to drive her, but your excuse really sucks.",
      "id": 2,
      "comments": [
        {
          "score": 13,
          "content": "This, she should learn to drive or get a license. The Uber solution is a good compromise/solution.\n\nHowever, no one cared for your \"I have a messed up sleep for 3+ years,\" because that has NOTHING to do with the situation and is on you. But that kind of makes you seem like you just give excuses.",
          "id": 3,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Here it is! \n\nESH",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 37,
      "content": "NTA.I was leaning on E S H,but there really isn't any reason why she is entitled to you driving her when she can walk,or she can get an [uber.](https://uber.It)She's manipulating you,yes that is emotional abuse.She can either learn to drive,or she can get a uber her choice.\n\nShe really shouldn't be demanding the breadwinner in the relationship get up early to drive her to work,because she can't drive.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "I can’t believe she’s worried about saving the cost of Uber when he makes $250k. Wtf?",
          "id": 6,
          "comments": [
            {
              "score": 1,
              "content": "Well my parents make more.and my dad still wears the same 5 pairs of socks he bought 8 years ago to save money.When you grow up dirt poor you really appreciate the worth of money.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 25,
      "content": "NTA. She knew when she took the internship both its location and the fact that she doesn't drive. And while she is well within her rights to remain a non-driver, that has some natural consequences, including a necessity to figure out mass transit and carpooling options.\n\nYou've made multiple valid suggestions. She is an adult, and it's time for her to figure out what is going to work for her, without demanding that her husband give up 5 hours of sleep each week.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 25,
      "content": "You value the hour of sleep when it would mean helping her, but not when you’re entertaining yourself.  That’s your priorities.  You can see that’s messed up, right?\n\nOTOH, the Uber is a reasonable temporary fix.\n\nSo ESH.\n\nStart setting yourself an alarm half an hour before you need to start getting ready for bed so you can finish up what you’re doing and still get to bed on time.  You might need to set yourself a second reminder when it’s really time to quit right this minute.",
      "id": 9,
      "comments": [
        {
          "score": 4,
          "content": "You really think that her temper tantrum is on the level of him wanting to stay up? She can get her self to work like an adult.",
          "id": 10,
          "comments": [
            {
              "score": 3,
              "content": "Which is why the Uber is a perfectly reasonable temporary fix until she can drive.  But him making himself sleep deprived for entertainment and then using that as an excuse?  That’s still lousy.  Which is why ESH and not just her.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12,
      "content": "ESH\n\nYou failed to mention in you post that you wife is new to your country.\n\nYou refuse to change your habits, knowing they’re bad, and admit, due to your habits, you lack sleep, therefore have this issue.\n\nYour wife should also be able to compromise. Maybe spend some time teaching her how to drive, working toward her license. Also, is there not a way for you to drive her partial way, cutting down her travel time but also gives you a bit of extra time? \n\nAlso- not sure if your wife is from another culture, but if so, maybe think about cost and how it relates to her culture. If she doesn’t come from a wealthy background. $25 for an Uber may be hard for her to want to spend each day, or twice a day, regardless of what your take home is.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "NTA\n\nYour wife is a grown adult. She should know how to handle getting herself to her place of internship at a reasonable time without forcing you to take her because she’s too lazy to put in any effort to do so on her own. It also doesn’t sound like she works anywhere near your own job, so you’re actually going out of your way to take her to work. \n\nThe fact that she takes public transportation to get back home means she can wake up early enough to take public transportation to work as well. Emotional blackmail is a 🚩🚩🚩 because it’s just gaslighting. Your wife needs to start taking responsibility on how to manage her own life, and that includes getting to work by herself if need be. It’s not that hard to wake up a bit earlier to catch public transportation, a lot of people do it regularly it’s not that hard. She’s just being lazy.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "NTA. You suggested that she take Uber which would allow you to continue sleeping and still get her to work.  This sounds like a reasonable solution. You also said that she didn't want to take an Uber because she wanted to save money.  You said the Uber cost 20 bucks.  But you driving her cost 15 for parking plus extra in gas. So, taking an Uber is nominally more expensive. Don't cave to emotional blackmail. If you do, it just reinforces it and will set you up for more.",
      "id": 14,
      "comments": [
        {
          "score": -6,
          "content": "Yeah idk how to deal with the emotional blackmail.",
          "id": 15,
          "comments": [
            {
              "score": 0,
              "content": "Don't cave. She will learn it works  Don't yell back or get physical. Then you not only feed the fire, but your own her level. Control your response. She will eventually have to modify her behavior since you did. Couples counseling would probably benefit you both. If she doesn't want to, get yourself into dialectical behavior therapy to learn to control your own behavior",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Grey rock method",
              "id": 17,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "ESH\n\nBy your own admission, your sleep problems are of your own making and if you weren't staying up all night playing games and whatnot, you could get up and take your wife to work without it being any big deal \n\nThat said, she sounds a bit childish in the way she is arguing this one, so Ill give her some AH points as well.  Also, how did she reach the age of 27, on the verge of a $200k income and cant be bothered to learn to drive a car?",
      "id": 18,
      "comments": [
        {
          "score": 4,
          "content": "She is new to the country. OP says above.",
          "id": 19,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "INFO: why doesn’t she drive? And did you two discuss how she’d get there when she took the internship?",
      "id": 20,
      "comments": [
        {
          "score": 1,
          "content": "New to the country. I think we just assumed mass transit, but she wants more sleep in the morn and I want her safe.",
          "id": 21,
          "comments": [
            {
              "score": 2,
              "content": "Was kinda on the edge, but this made me say you’re NTA. She wants more sleep time, but wants you to wake up earlier to take her?",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "IMO NTA; you have sleeping issues and are suggesting an Uber as a compromise.  Compromise sounds good to me. Her response in the way that you worded it was about her husband being unfair rather than it being a genuine concern about money: if you are strapped for cash that is very different than just wanting to save a bit of money at the expense of your sleep. If she drove that would be a whole other thing, she can consider getting her license in order to save on Uber costs.",
      "id": 23,
      "comments": [
        {
          "score": 3,
          "content": "I mean he should definitely get his staying up too late watching tv and playing games under control. Regardless of his wife, getting 4 hours of sleep is affecting his brain. Lack of sleep is a huge contributor to memory loss/brain function/etc.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}