{
  "post content": "There's a tl:dr; at the bottom, but I feel like you can't judge properly if you don't know the whole story.\n\nSo I (M23) have a sister (F21) and two brothers (M18) & (M15). My sister is living on her own as am I, and my brothers are still living at home. But my sister keeps being messy and my parents don't know what to do about her. They messed up earlie and they're all in holes they can't get out of. My sister feels so alone, she feels like she doesn't have a place in our family. She doesn't feel included, and it saddens me when she tells me she's \"always the last to know\". But growing up, she used to either stay in her room or feel my dad's rage, but like I was like that too, but I'm trying to better things. Like my dad isn't like that anymore, and it's not easy for me to talk to our dad either.\n\nBut things between them are still very messy. My sister parties alot, and I know I can't blame her for living for life, because even tho her grades are being messy, I have to trust her to be able to prioritize. We both went to high schools that were hard to get in, so I know she's capable. Everyone else is blaming her for partying and drinking too much. Even my girlfriend \"dude, she's drinks on a monday, tuesday and wednesday!\" I want to believe she's not failing school because she parties. But that she knows when she has time to party. I know it won't help if her brother keeps telling her to not party, like that's why she never speaks to our parents.\n\nLike formally she's renting a 200.000$ condo our parents own. But having loud parties are annoying surrounding inhabitants and long story short she could be kicked out and my parents could lose all the money they've invested in the condo. She doesn't realise how lucky she is to have parents who support her economically like that is the narrative of our family.\n\nAnd in my dream it was Christmas and my mom opened a gift from her and it was an old mp3 with probably some nostalgic tunes, but it wasn't even working and my mom got sad, and then she said \"look, she doesn't even appreciate the gift. It works, It doesn't always work, but when it works it works.\" And it just broke my heart and I couldn't hold back the tears. It's 7am here in Germany but I keep reflecting. The whole dream is such an analogy. My sister pointing out my parent's emotional absence. Like they're not seeing the emotional part of her gift but focusing on the economical value of her gift. The gift's poor condition which is representing her popr condition. I never cry, I somehow only cry after I have dreams. The last time was 9 years ago when I lost her in a dream. That I was in line to cry about, but am I for this? I fear I might cry like this in fromt of her when we're both returning home for an event next week.\n\ntl:dr; I had a dream in which my sister did something bad and it hurt our mom, and I cried because the action reflects how she's messing up her life.",
  "id": 1,
  "comments": [
    {
      "score": 2,
      "content": "SHP\n\nWhy would you think a dream makes you an asshole? ",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "I'm thinking me crying and getting emotionally upset is out of line.",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "Okay well in no way is it. Sounds like you had some rough childhood experiences there that makes you afraid to process your emotions. Wouldn’t be surprised if your sister does too. \n\nFor the record I’m not a therapist though. Seeks professional help if this becomes a recurring theme. ",
              "id": 4,
              "comments": [
                {
                  "score": 0,
                  "content": "Thanks man.  My therapist doctor is in the progress of hooking me up with a specialist doctor so I think I'll tell the specialist doctor about this. Btw, what does SHP mean?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Shitpost. It is something that can be put for a variety of reason. I put it because I don’t see how anyone could consider your story making you an asshole. ",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nThere's a tl:dr; at the bottom, but I feel like you can't judge properly if you don't know the whole story.\n\nSo I (M23) have a sister (F21) and two brothers (M18) & (M15). My sister is living on her own as am I, and my brothers are still living at home. But my sister keeps being messy and my parents don't know what to do about her. They messed up earlie and they're all in holes they can't get out of. My sister feels so alone, she feels like she doesn't have a place in our family. She doesn't feel included, and it saddens me when she tells me she's \"always the last to know\". But growing up, she used to either stay in her room or feel my dad's rage, but like I was like that too, but I'm trying to better things. Like my dad isn't like that anymore, and it's not easy for me to talk to our dad either.\n\nBut things between them are still very messy. My sister parties alot, and I know I can't blame her for living for life, because even tho her grades are being messy, I have to trust her to be able to prioritize. We both went to high schools that were hard to get in, so I know she's capable. Everyone else is blaming her for partying and drinking too much. Even my girlfriend \"dude, she's drinks on a monday, tuesday and wednesday!\" I want to believe she's not failing school because she parties. But that she knows when she has time to party. I know it won't help if her brother keeps telling her to not party, like that's why she never speaks to our parents.\n\nLike formally she's renting a 200.000$ condo our parents own. But having loud parties are annoying surrounding inhabitants and long story short she could be kicked out and my parents could lose all the money they've invested in the condo. She doesn't realise how lucky she is to have parents who support her economically like that is the narrative of our family.\n\nAnd in my dream it was Christmas and my mom opened a gift from her and it was an old mp3 with probably some nostalgic tunes, but it wasn't even working and my mom got sad, and then she said \"look, she doesn't even appreciate the gift. It works, It doesn't always work, but when it works it works.\" And it just broke my heart and I couldn't hold back the tears. It's 7am here in Germany but I keep reflecting. The whole dream is such an analogy. My sister pointing out my parent's emotional absence. Like they're not seeing the emotional part of her gift but focusing on the economical value of her gift. The gift's poor condition which is representing her popr condition. I never cry, I somehow only cry after I have dreams. The last time was 9 years ago when I lost her in a dream. That I was in line to cry about, but am I for this? I fear I might cry like this in fromt of her when we're both returning home for an event next week.\n\ntl:dr; I had a dream in which my sister did something bad and it hurt our mom, and I cried because the action reflects how she's messing up her life.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, put one of the following abbreviations at the beginning of your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH. Obviously crying doesn’t make you an asshole. It sounds more like you need to vent, rather than find out if you’re an asshole. Have you tried therapy? If you’d rather stick to the ‘talking to strangers on the internet’ route, try a different subreddit. Maybe r/trueoffmychest or whatever it’s called.\n\nIf it’s any reassurance, when I went to university I went out 5 nights a week in my first year. After first year I cut it down quite a bit, but still went it a lot. My early 20s were filled with mid week nights out, and I’ve turned out pretty well. \n\nCarry on showing her your concern, because it’s possible she does have a big issue, but it’s also possible it’s just a phase that won’t affect her in later life. Just make sure she’s still focusing on the things she should be focusing on (education and work).\n\nI guess what I’m trying to say is, don’t assume it’s as bad as it looks, but definitely do your best to find out whether it is. ",
      "id": 9,
      "comments": [],
      "relation": "Support"
    }
  ]
}