{
  "post content": "We are in the process of moving into a new home. The house is more spacious then the old one but has limited rooms. It only has 3 rooms.\n\nMy wife and I have 3 daughters 16yo/14yo/12yo and one son 10yo. The problem that's been tearing the family apart right now is that my 16yo daughter is refusing to share a room with her 2 sisters, She wants her 10yo brother's room. Her argument is that her brother is too young to have his own room and that she deserves more privacy and space since she's the eldest. Thing is we, as a family always give the boys their own rooms no matter the age while the girls share a room together. This method has proven to be workig cause girls naturally share while boys don't and they fight a lot. \n\nMy daughter threw a rage fit and got my wife involved. My wife called me unreasonable for thinking it's fair to make the 3 girls share one room while our son gets an entire room for himself, and he's the youngest!! So he's the one with the \"least\" privacy. I told her that it's been like this for years and just cause we're moving into a new home doesn't mean things have to change, to be honest part of me is thinking that my 16yo is doing this simply because she's against the idea of moving in the first place and is looking for excuses to not move in to the new home, my wife argued that moving our 12yo daughter with our 10yo is the best compromise, but my son won't accept this and I already know that. all I'm looking for is for everyone to be happy and comfortable and to my understanding, my daughter was fine with sharing a room with her sisters then, why Change her mind now?. My wife still sided with her and said that I should be careful because the girls are beginning to sense some sort of favoritism towards my son which isn't true at all. but it's all about what we're used to and what is the norm in the family,\n\nThey're both not speaking to me and are acting somewhat hostile towards me.\n\nETA for those who are saying I was in the wrong for buying a 3bedroom house, well our financial situation isn't the best right with everything happening in the world and real-estate prices getting higher and whatnot. Also, those who are saying I'm favoring my son, I'm not, I treat him the same as his sisters in pretty much everything and I 100% guarantee it, I accept my verdict nonetheless but still wanted to make few points clear. Thanks anyway.",
  "id": 1,
  "comments": [
    {
      "score": 27170,
      "content": "YTA for choosing a house that cannot meet your family's needs. Did you not count up your children when you were looking at houses?\n\nOf course adolescent girls shouldn't have to share a room with a boy. \n\nOf course your oldest,  at 16, wants some privacy.\n\nOf course she's pissed off that her brother gets his own room while all 3 girls are crammed into one room. \n\nYou created this situation. \n\nIs there a basement, covered porch,  attic space or den that could be converted into a 4th bedroom?\n\nAnd since so many people seem to think I don't understand what a budget is,  I'm not necessarily talking about a larger or significantly more expensive house.  I am talking about a decision like settling for potentially smaller rooms and a less convenient location or something with less curb appeal *in exchange* for that 4th bedroom.  \"More spacious\" isn't worth it if it doesn't meet the family's needs. I am not assuming a limitless budget,  I am saying that he picked the wrong trade-offs.",
      "id": 2,
      "comments": [
        {
          "score": 8988,
          "content": "Well spoken. This is exactly it.\n\nThey're all teenagers. They all should be getting more privacy. You need to create at least one more bedroom to accommodate this.\n\nWhy on earth did you choose a house that can't fit your family??\n\nYTA.",
          "id": 3,
          "comments": [
            {
              "score": 2599,
              "content": "Or they, themself make a compromise. I grew up in a 3 bdrm w 2 older brothers. As we all got older my brother got his closest to the back door as he started getting more freedom, my middle brother stayed in the original bdrm they shared together and mymom sacrificed her privacy and gave me her room, and made the living room her bdrm, and we all compromised w that. We knocked before we entered the living room etc etc. there’s ways around this",
              "id": 4,
              "comments": [
                {
                  "score": 798,
                  "content": "Yep, we had a 2 bedroom house growing up. When we were kids me and my sister shared a room, but when we became teenagers, my parents got a sofa bed to sleep in the living room, so me and my sister could have a bedroom each",
                  "id": 5,
                  "comments": [
                    {
                      "score": 55,
                      "content": "My mom had a two bedroom apartment. I didn’t live with her full time, but my two other siblings did. My Mom had one room. My sister had the other. And my mom bought things to divide the living room in half so my brother had his personal space too. It wasn’t ideal, but it allowed everyone to have an area that was “theirs” and that’s very important for teenagers to have.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I don't know if it's reasonable to make parents give up their room but they do need to exercise some creative thinking. \n\nCan the girls get the master bedroom and the parents take a smaller room? \n\nHe says the house is more spacious - is there a space that can be used as a bedroom?  Even if it isn't strictly (or legally) a bedroom I know some places have space that can be used as bedrooms. \n\nFor example, I had a friend in HS who wanted a bit more space. Her parents let her take over their basement. It wasn't an area that could technically be called a bedroom.  But there was a door so she had a decent amount of privacy. The laundry room was down there - but her parents were fine with giving her a heads up whenever they were doing laundry. \n\nI also had a cousin who was having medical problems, it caused her to have some really bad hot flashes. So her and her husband turned the basement into their bedroom.  They had to go up a flight for a toilet and two for the shower - not ideal but they had to make due.  Since they didn't want to play favorites and allow one of their kids to move into the master, they turned it into a TV room for the kids to hang out in. Now that she no longer has those hot flashes, they have been able to move back to the master. One of their kids recently moved back in after a bad break up and has currently taken over the basement as her room/living space. Their other child is out of the house.  \n\nI have used a basement as my bedroom before too. And it wasn't even a finished one. Seriously, it didn't even have walls. Like it insulated and covered in plastic - those were the walls of my basement \"bedroom.\" I did have to share the space with my sister sometimes but I had privacy for the most part being down there. \n\n\nBasically what I am saying is that they could have a spot in the house that can be used as a bedroom even if it isn't technically a bedroom.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I remember sleeping in the space under the stairs, just so I could have my own space. I grew up with a large family.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 887,
              "content": "Op claims the house is more spacious, so it seems like there must be some extra space that could be converted into a space for the 16yo. Sometimes basements or attics are not legal to use as a bedroom. This happens to be the case where we live, but we were able to create two rooms down there where my oldest kids go to have privacy, but then they still do sleep in the same room at night.",
              "id": 9,
              "comments": [
                {
                  "score": 435,
                  "content": "Even if it isn't technically a bedroom - there's nothing stopping those spaces from being used as one. It just can't legally be called a bedroom.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "So, rando story, my friend bought a house. Nice place, a bit dated, not too bad. Then he pulled the attic pull-down ladder/stair thing and there was a bedroom up there. He said it was pretty creepy since it was literally just a drywalled box in the attic with the pulldown stairs as the only access. He called it the murder room which of course, made his friends feel all warm and fuzzy.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "The post just made me sigh in exasperation.",
              "id": 12,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6581,
          "content": "Also, the way he's explained it, if he had 2 sons, 3 daughters, and 3 children's rooms, the sons would **each** get their own room, while all 3 girls would have to share\n\n> we, as a family always give the boys their own rooms no matter the age while the girls share a room together. This method has proven to be workig cause girls naturally share while boys don't and they fight a lot.\n\nHe's a sexist asshole",
          "id": 13,
          "comments": [
            {
              "score": 7227,
              "content": "A massively sexist asshole. Girls don’t “naturally share” more than boys; they’re socialized to be more compliant and cooperative because of the sexist norms that OP is imposing. (Also worth noting — the diminished expectations of boys also hurts them. What a terrible characterization of OP’s son — that he is incapable of sharing and getting along with others.)",
              "id": 14,
              "comments": [
                {
                  "score": 2397,
                  "content": ">My son won't accept this, and I already know that.\n\nHe didn't even ASK his son, he just knows his son wouldn't accept it as a 10 yr old. Even though he didn't even bother to consult everyone in the situation, he made his son's unknown 'feelings and words' more important than his daughter's genuine distress. Not a tantrum, distress!  \n\n\n\\*\\* AND not only that, he hadn't even spoken to his wife about his plans! When his daughter \"threw a rage fit and got my wife involved\". WTF man... you just make the decisions for your family without any consultation? YTA YTA YTA",
                  "id": 15,
                  "comments": [
                    {
                      "score": 561,
                      "content": "It sounds like the oldest daughter won't accept sharing a room either. Funny how her option doesn't seem to matter at all to OP.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 426,
                      "content": "I love in OP’s update where he says he treats his kids equally when objectively by his own admission he does not.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": ">boys don't and they fight a lot.  \n>  \n>My daughter threw a rage fit \n\nI love this pair.  Boy((s)?) get what they want when they are aggressive, girl gets less if she's aggressive.  Even with just one boy.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 646,
                  "content": "[deleted]",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 90,
                  "content": "Notice that when the eldest is upset and doesn’t want to share a room, he says no. But when the wife says the 12yo sister should move in with the 10yo brother, OP is all “my son won’t accept this” so he gives into his son. WHAT is the difference between The eldest DAUGHTER and the youngest SON not accepting it? It’s the gender. \n\nFuck OP and his misogyny.",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 53,
                  "content": "Also if they've always had 3 bedrooms I strongly suspect the oldest was likely forced to move in with her sisters the moment he popped out a son who needed his own space and she is now finally realizing how sexist the whole arrangement was from the start.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 23,
                      "content": "This almost certainly EXACTLY it.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "OP THIS THIS THIS is why YTA.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "This man has obviously never been in the military or any single gender bunk housing. People share more when they live in close quarters. It’s that simple. OP YTA & a dumbass.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1077,
              "content": "And wrong. My sister and I fought so much as kids in our shared room.",
              "id": 25,
              "comments": [
                {
                  "score": 483,
                  "content": "So much this. My sister and I were constantly at each other’s throats until we moved and had a room each. We grew super close after that.\n\nGirls don’t share any better or worse than boys. Seeing that with my own kids now.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 79,
                      "content": "My guess is OP probably thinks that because he never forced his son to share anything unlike his sisters. Thus sisters know how to share, overly so, and the boy doesn't think he should have to.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I knew someone with a SEVERE phobia of spiders that was single handedly waging war on their basement’s insect problem just so she could not share a bedroom with her little sister anymore",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yup, I had exactly the same experience. Fought constantly when we shared a room. But having our own space allowed us to be so much closer and develop a deep friendship. Adolescents especially need privacy and space.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I have 2 brothers and 0 sisters and I can say my friends who have sisters definitely fought more than we did, especially if they were sisters who had to share a bedroom.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2285,
          "content": "Don’t forget the doubled-down edit, “those who are saying I’m favoring my son, I’m not, I treat him the same as his sisters in pretty much everything and I 100% guaranty it.” \n\n*Gestures broadly to their own post* CLEARLY NOT.",
          "id": 31,
          "comments": [
            {
              "score": 689,
              "content": "Look at the ages of the kids -- OP clearly kept having kids until at least one came out with a penis.\n\nIf #4 had been a girl, too, he'd be asking if he was an AH for making FOUR girls share a room while his fifth got his own.",
              "id": 32,
              "comments": [
                {
                  "score": 71,
                  "content": "My exact thoughts!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "sad thing is he’s probably been socialized to accept patriarchal favouritism as the status quo rather than an imbalance. this mentality definitely extends into other areas of their lives, and his daughters (even his wife) will likely resent him for it.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 43,
                      "content": "I mean by his own admission his wife is already trying to call it out and is angry, but he just dismisses her and her “lady feelings” because “this is how MY FAMILY has ALWAYS raised BOYS”.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 297,
              "content": "Yeah the fact that OP is fixating on refuting the favoritism comments instead of answering any of the other questions asked is extremely telling. \n\nI, for one, think it’s very relevant that we know exactly how the house is more spacious even though it has fewer bedrooms. I suspect there is more space (like an office or finished basement) but OP has already decided that space is for his own use.",
              "id": 36,
              "comments": [
                {
                  "score": 48,
                  "content": "The individual (bed- / shared) rooms could be bigger. In that case I'd really be looking at options to add some walls, which can be easy enough to DIY.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 60,
                      "content": "Very true. One could even add temporary walls or dividers. That would be a great compromise. Too bad OP doesn’t seem interested in real compromises.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "The 3 br house my spouse and I bought has exactly this feature. The original owners sectioned off a third of the family room as a fourth bedroom for their oldest son. It doesn't have a closet, so it doesn't officially count as a bedroom. It's now my craft room and pandemic-home-office.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "I suspect they’re leaving out a *lot* of things. YTA (I don’t think I had made a judgment yet.)",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 68,
              "content": "\"I accept my judgement but reject the core premise of the judgement.\"",
              "id": 41,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 63,
              "content": "His reasoning for why the compromise option of having the 2 youngest in one room and two oldest in the other is that his 10-year-old son will not accept it... but his eldest is somehow the one who's being unreasonable?  \n\n\nIt's what they're used to and it's the norm in the family... just because it's the norm doesn't mean it's not wildly unfair and sexist. His son's already showing signs of being raised to be an entitled sexist asshole.",
              "id": 42,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "It's ok because in his family his sisters had to share while him and his brother got to have their own rooms. It's not favoritism, it's tradition! One that he himself benefitted form so let's not think too deeply about the logistic of it.",
              "id": 43,
              "comments": [
                {
                  "score": 21,
                  "content": "It’s bullshit is what it is. I feel really bad for his daughters. *And* his poor sisters, come to think of it.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": ">CLEARLY NOT.\n\nNo idea why, but I read this in Ross Geller's indignant voice, haha!",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "But he 100% guarantees it!",
              "id": 46,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1648,
          "content": "> This method has proven to be workig cause girls naturally share while boys don't and they fight a lot.\n\nOP is also an asshole for writing this.\n\nRaise your fucking boys better, jesus christ. Clearly your family has no minimum standards for proper behaviour in boys because they're SPESHUL. Clearly this poor parenting you got is why you're in this situation now.\n\nMy sister did not share. She verbally abused me and made me cry a few times a week.",
          "id": 47,
          "comments": [
            {
              "score": 479,
              "content": "Of course OP likes this way HE benefited from it as a child and never learnt to share because HE didn't have to. Girls aren't better at sharing they are just expected and forced to. Well time for OP and his son to learn.",
              "id": 48,
              "comments": [
                {
                  "score": 44,
                  "content": "Good idea, mom should kick OP into the son’s room",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "I'm an only child so I couldn't say anything reasonable about that but judging from sleepovers with with friends who had sisters,  nah, girls don't share better.",
              "id": 50,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "But boys will be boys!\n\nUgh :(",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1091,
          "content": "Split the master bedroom in two and give the other half to the son.",
          "id": 52,
          "comments": [
            {
              "score": 484,
              "content": "I had a friend in school whose parents did almost this. They had a 3 bed house, split the master in half & the next largest room in half. It was cramped but everyone got their own space. A 16 Yr old would rather have their own tiny space than share a massive space! In fact any kids would!",
              "id": 53,
              "comments": [
                {
                  "score": 24,
                  "content": "curious, how did they go about splitting the rooms? what did they use for borders or walls??\n\nalso 1000% yes. privacy is so incredibly important for developing adolescents’ brains, without it can come huge anxiety of never feeling like you can completely relax alone.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I knew a family growing up that did this. It was a 4 bedroom house & they had 2 sons & 2 daughters. The boys each had their own room, the parents had the 3rd bedroom, & the 2 girls split the master bedroom.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "But OP is a boy and boys don't naturally share /s",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 513,
          "content": "This op YTA, since you already bought the house, if the master bedroom is considerable bigger maybe you could place the 3 girls in there and get privacy divisors or something. But cramming 3 girls in one room was really poor planning on your part.",
          "id": 57,
          "comments": [
            {
              "score": 52,
              "content": "That's a really great idea especially bc teenage girls bathroom needs.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "My next door neighbors did this for their girls when I was a kid. It worked out really well, and I was jealous of them.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "We have three girls in the master bedroom with a private bathroom. It isn't ideal, but we went through unforseeable financial hell after they were all born and could no longer afford the bigger house we were intending to get. \n\nIkea makes these huuuge cube shelf things that work great as room dividers - especially if you put a backing on them, and we are going to get two to divide the room, half for the eldest girl, half for the younger two (well more like 1/3 and 2/3), but it'll be set up so everyone can still see the TV from their beds. \n\nBelieve me, I hate this. This isn't the future we planned. But there are ways to make room, especially if there's a larger master bedroom.  I've also seen cool ideas for loft beds that are walled off for more privacy, things like that. \n\nI was hoping we could convert our enclosed patio into a bedroom but it remains to be seen if we can afford it even if we do a lot of the work ourselves.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Exactly. My guess is the house is larger because they have a \"super sweet\" master bedroom. Well, dummy, guess who should get that room for the next 4 years? ( and it will only be 4 years until the 16yo & 14yo are adults! So then he can play musical rooms & get his master back!)",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "well let me express my view on the 4 children thing\n\nits pretty clear that op is playing favourites and maybe he had 4 children just cuz he wanted a boy clearly op YTA",
          "id": 62,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "Or even dining room….",
          "id": 63,
          "comments": [
            {
              "score": 32,
              "content": "Or garage.",
              "id": 64,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Gotta add that maybe the spacious areas in the house could have been offset by a house with an extra bedroom or a loft/bonus area that could have been enclosed and used as an extra bedroom. I know the housing market is out of wack right now but OP seems to think his daughters should suck it up and deal with a lack of privacy because this spacious house fits everyone else's needs but theirs.  Been there, lived from 6-18 with either a shared bedroom or a basement room with still no privacy while my father had a den, private work shop (the only private basement room), and a huge shed, but talked constantly about how I didn't understand the financial burdens he was under and should make a sacrifice of my privacy for the good of the rest of the family.  I absolutely despise my birth father and haven't talked to his selfish ass since 2004.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "This.\n\nOP, YTA.  Just because you’ve known something to always be done a certain way, doesn’t mean you have to continue doing it that way. You’re treating your daughter with a contempt she doesn’t deserve, while favouring your son based on a severely outdated sexist tradition. And I know, you argue otherwise but the fact remains that is exactly what you are doing.\n\nGirls share, but boys don’t, and that’s why boys deserve to have their own room? I call utter bullshit on that. It’s just a piss-weak excuse to continue favouring your son.",
          "id": 66,
          "comments": [
            {
              "score": 24,
              "content": "Pretty sure OP is thinking the son needs the  private room to mastubate when he's of age. Hey OP girls do it too. Everyone needs privacy to do their thing",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14422,
      "content": "YTA why have four kids that you cannot house appropriately. A 16 year old needs her own room and so do your other daughters. \n\nYour reasoning that “boys get their own no matter what” is incredibly sexist and demeaning to your almost adult daughter. You are clearly showing favoritism towards you son because he’s a boy",
      "id": 68,
      "comments": [
        {
          "score": 10413,
          "content": "The comment about how girls just “naturally share” and boys “fight a lot” really got me and screams sexism.",
          "id": 69,
          "comments": [
            {
              "score": 9831,
              "content": "It’s so amazing how boys who are taught they don’t need to share just naturally don’t share, wow. So incredible.",
              "id": 70,
              "comments": [
                {
                  "score": 700,
                  "content": "😂😂👏🏻👏🏻",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 580,
                  "content": "I came to say this. I am an adult male that need therapy to learn to share. This fucking sexist society makes us males fucking emotionally disabled. It's ruining my life.\n\nOP, for fuck sake, let your boy share a room with his sisters! Although maybe now it's too late and the boy won't want it, already a douchbag like the parents.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 44,
                      "content": "props to you for trying to fix it now though",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Idk he's only 10, he might already have toxic masculinity traits popping up but there's still plenty of time to unlearn them. He sadly probably won't unlearn them though, since his male figure is such a douche.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 65,
                  "content": "If I had an award for you, I would give it to you.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I don't know if you know this already, but apparently in the coin store, you can get a free random awards almost every day.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2472,
              "content": "I'm a woman who grew up with 3 sisters, and I can assure you girls do not \"naturally share\". I'm pretty sure throughout our teen years, a week did not go by without a big blowout fight.",
              "id": 77,
              "comments": [
                {
                  "score": 552,
                  "content": "Yea, whoever said that has never been around sisters for long...",
                  "id": 78,
                  "comments": [
                    {
                      "score": 303,
                      "content": "Don't worry, I'm sure OP doesn't spend any time with his daughters, so yeah...",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Same here. Youngest of 4, all girls. I shared a room with the sister closest in age to me for years. We HATED it. We fought constantly.\n\nI'd give her a kidney if she needed one, but I am absolutely not sharing my clothes or other stuff.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "I had to stop reading and close my eyes for a moment. Maybe the girls share because they're used to not having a choice and the boys don't share because they know they don't have to, other people will. Doesn't mean it's working *at all.*",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Exactly.  The sexism in this line make me cringe.   I feel bad for OP's daughters for having such a father.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2585,
          "content": "If I had to guess - they kept trying until they had a boy.",
          "id": 83,
          "comments": [
            {
              "score": 1367,
              "content": "Yup. The misogyny is strong with this one. I feel sorry for his wife and daughters.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "This is why our friends were very relieved #4 was also a girl, as they wanted to stop without being accused of stopping when they \"finally got it right\"",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Plus he said his son “won’t accept” sharing his room, well neither will his daughter but she’s deemed unreasonable.",
          "id": 86,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Honestly this comment had me shaking my head.....by my understanding of this, if boys fight a lot and your son would not like to share his room with someone, I'm assuming if OP had two sons priority would be given to them to each have a room and then the girls can share an imaginary space? Because I mean as long as the boys are happy and comfortable",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10903,
      "content": "YTA, when your son “won’t accept” sharing a room with his sister you defend him, when your daughter won’t accept sharing a room with 2 sisters you think she’s just being stubborn and needs to change. Your wife is right. 2 in each room is fair.",
      "id": 88,
      "comments": [
        {
          "score": 6298,
          "content": "This. Neither boys or girls naturally share. They are taught to share. Privlidge is based on age/maturity.\n\nYet OP defends his YOUNGEST not wanting to share because he is male.\n\nOP is raising an entitled jerk who believes he deserves special favors & treatment because he is male. OP is absolutely not doing his kid any favors. At the same time, OP is losing all respect from his daughters. They aren't idiots. They know they are \"less than\" to him. \n\nI'm sure it never occured to OP that the 3 teenage girls sharing a room would be a problem b/c they aren't really full human beings to him. He just didn't take their needs, wants or emotions into consideration.\n\nYet somehow the new house is roomier than the old one. So it doesn't sound like they couldn't afford a house w/ more bedrooms, it was just that there was a feature in the new house more important to OP than the sanity of his 3 daughters.\n\nOP will pay for this decision w/ a ridiculous amout of turmoil in his for probably the rest of his life. You don't spend that many years not paying attention to the fact you have 3 daughters and spoiling you son and end up with a calm happy household and well adjusted adult children.\n\nWhat are the odds that OP is in the biggest room w/ all the closet space and the 3 girls are stuck in a room ~1/2 the size?",
          "id": 89,
          "comments": [
            {
              "score": 1422,
              "content": "I agree with this. If he wants to put all 3 girls in 1 room, it needs to be the biggest bedroom in the house. YTA",
              "id": 90,
              "comments": [
                {
                  "score": 452,
                  "content": "This seems fair. Guess the girls get the master. Parents can have the girls' old room. Better get packing, OP.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "100% at the VERY least. I'm a woman and I shared a room with my brother until I hit puberty, and my parents always gave us the master bedroom. After that my mom bunked with my brother and gave me my own room.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "3 people (any gender) in one room better be a big ass fuckin room with dividers.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Exactly. I am the oldest of 5 kids. When my dad & stepmom got their first rent house it was more than enough room for them, their first born with my sister & I coming every other weekend. Well they had 2 more kids (1 planned, 1 not) and all the girls got their own room & the baby (my brother) got his own room so we didn’t get woken up by him. Us girls however got the biggest room in the house (it was even bigger than the master) so it really wasn’t that big of an issue even when we came to visit on the weekends. My dad & stepmom didn’t buy a house until they could afford to have enough rooms so no one had to share anymore. I understand that the housing market is different now but OP could have waited until 1) there was a house that was more affordable with enough rooms or 2) maybe have up some items on their wishlist to allow more space for rooms (already existing or could be built on in the future). OP is TA because he’s clearly favoriting his son solely because of the genitals he has.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 287,
              "content": "[removed]",
              "id": 95,
              "comments": [
                {
                  "score": 52,
                  "content": "You can bet your ass they do the bulk of the chores in the house (save what mom does) so a strike could be quite effective.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 104,
              "content": ">I'm sure it never occured to OP that the 3 teenage girls sharing a room would be a problem b/c they aren't really full human beings to him.\n\nWhich is why when he's upgrading his house, \"it's more spacious\", he hasn't prioritised bedrooms. Yes 3br on average are more expensive than 4br places, but if you don't focus on more spacious living areas I'm sure you can get a 4br place that's cheaper than many 3brs.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "OP is raising an entitled jerk. Like father like son the pattern continues.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "\"Neither boys or girls naturally share\"\n\nSo true. It's a learned skill regardless of gender.\n I have 6 kids, 3 boys and 3 girls. The boys are actually much better at sharing in this house then the girls are, to be completely honest. But that's probably more to do with their individual personalities then anything else. \n\nI cannot believe OP is insisting on 3 girls in one room, whilst, the youngest child, a 10 year old boy gets a room to himself. How completely sexist and illogical. \n2 kids to each room is the only fair way to divide it. \n\nIf his son isn't good at sharing, it's probably because his sexist father taught him that he doesn't have too. And it's probably even more important that he actually learn this lesson now, before he becomes a teen.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Oh, I guarantee this jerk didn’t give the 3 girls the master bedroom, like he should be doing if he is going to insist upon giving his favorite child his own room.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "> They are taught to share.\n\nOr rather, forced to share in this case. But only if you're a girl of course, because their wants and needs don't matter, but the precious son is allowed to just \"not accept\" any inconvenience.\n\nOP, you can say you're not favouring your son until you're blue in the face, but you very clearly ARE. And your wife and daughters have obviously had enough  of it, good for them! \n\nDrag yourself into the 21st century and treat your children equally, before you're left with no family except a spoiled brat of a son in a few years.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 73,
          "content": "OP is gonna have more issues when they have hit puberty YTA simply for this OP if you can’t afford to have enough rooms for your kids, then don’t have that many kids",
          "id": 102,
          "comments": [
            {
              "score": 33,
              "content": "At least two of the daughters have probably hit puberty, possibly all three, I hit puberty at like 11 or 12",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Imagine running your home based on what a ten year will and won’t accept, simply because he’s a dude. This is blatant favoritism and sexism.",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4521,
      "content": "Info: you say \"the boys\" but you only have one son. Am I missing something here?",
      "id": 105,
      "comments": [
        {
          "score": 2609,
          "content": "I think he means that if he had 2 boys, they would have a room each, and the girls would still all share one. That's why he said the bs about boys fighting.",
          "id": 106,
          "comments": [
            {
              "score": 760,
              "content": "I think he meant when he was growing up, and it always happened in his family.",
              "id": 107,
              "comments": [
                {
                  "score": 822,
                  "content": "Another comment says that op and his brother had their own rooms while his sisters shared, so I think he's saying that he would have that arrangement with his kids too since he grew up that way.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 329,
                      "content": "That’s just bullshit. I was gonna give OP the benefit of the doubt but if he said he grew up like that than OP, you’re just an ah",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 71,
              "content": "The way OP is talking, I’m starting to think that if he had two boys, they’d each have their own room and the girls would naturally share a cardboard box on the porch. \n\nHe’d probably even paint it pink for them like the A+ dad he is.",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1298,
          "content": ">Thing is we, as a family always give the **boys** their own rooms no matter the age while the girls share a room together. This method has proven to be workig cause girls naturally share while **boys** don't and they fight a lot.  \n\nI believe the 1st one is OP referring to his family (parents, grandparents, aunts, uncles, etc.) over generations  \n\n2nd one is just a sexist excuse.",
          "id": 111,
          "comments": [
            {
              "score": 115,
              "content": ">2nd one is just a sexist excuse.\n\nYUP. Clearly his family values a penis more than a vagina. Sorry to be crass, but it rings true here.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Ya, it’s CLEARLY working really well. Good job OP.",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "I don’t think *his* family history applies to the family he makes with his wife anyways. Unless, of course, she’s his sister.\n\nOP, the traditions you grew up with no longer apply. You obviously think you’re head of household, but the truth is you’re outnumbered. Better start learning how to make women happy, or your life will just get worse!",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 555,
          "content": "I read this several times to see if I missed a second son.  He used \"boys\" multiple times but there's 1 son.",
          "id": 115,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 50,
          "content": "I think  he is referencing his own family life growing up, as in the boys always got their own rooms and girls shared.\n\nIf that is the case brings out a rather sexist attitude.  People are taught to share.  Making the girls do it but not the boy is pretty sexist and enabling of a continued sexist tradition.\n\nOP YTA. For just this part alone.",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "“Only boys masturbate” type of thinking here. Super sexist bs.",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3953,
      "content": "YTA\n\nWhy did you move into a house that doesn't fit your family? You said the house has more space, so it doesn't sound like it was cost related.\n\nAlso, as a girl who was stuffed into a room with 3 other girls, no we don't share better. You are a sexist asshole and I don't understand why anyone would think that your wierd ideas are ok. I understand not wanting mixed gender rooms, but you say that if you had more boys they wouldn't have to share?? Way to tell your girls that they are worth less then the boys! \n\nThe 16yo wants her own room because she is almost an adult, with an adult body who wants to have her own space and not be surrounded by kids.\n\nGrow a brain fgs.\n\nEdit: Just adding some bits!\n\nOp said that they moved to a home that is larger overall, but lacks the needed amount of bedrooms. I am not saying he is the AH becayse he can't afford some 5 bedroom massive house. It's that he seems to have chosen to not give his daughters more space, and thinks that girls always must share while boys require more space. The issue is the sexism.",
      "id": 118,
      "comments": [
        {
          "score": 1187,
          "content": "This is the comment I was scrolling for. Why the fuck are they moving 6 people into a 3 bedroom house? If it’s not for strictly financial reasons, this is incredibly stupid to even think about doing in the first place",
          "id": 119,
          "comments": [
            {
              "score": 516,
              "content": "I'd be fuming if I was any of those girls, it honestly sounds like they picked this unsuitable house on purpose. The favrotisim is so blatant.",
              "id": 120,
              "comments": [
                {
                  "score": 199,
                  "content": "Or the logic is something equally messed up like “the kids will eventually move out so we don’t need all those rooms in the long run”",
                  "id": 121,
                  "comments": [
                    {
                      "score": 50,
                      "content": "I hadn't even thought of that, but honesty it wouldn't suprise me.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "The relief when we built another room for my teenage child was palpable, everyone needed the space. Being 3 crammed into a room is just horribly unfair",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "It's because in his mind they only need 3 rooms. He needs a bedroom for him & his wife, the daughters need one bedroom (no matter how many of them there are) and he only has one son so he only needs one more room.\nObviously if him and his son are happy that's all that matters to him.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "You said it a lot more nicely than I would have. The sexism and general levels of idiocy here are repulsive.\n\nYTA, OP.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3234,
      "content": "\"girls naturally share and boys don't\" \n\nI wish I could show you a highlight reel of my childhood. YTA.",
      "id": 126,
      "comments": [
        {
          "score": 393,
          "content": "I grew up in a tiny 2 bedroom house with 2 sisters and a brother. I was the oldest. I had to share a room with my sisters and my brother got his own room and mom slept in the living room. My sisters and I beat the crap out of each other all the time and they stole and destroyed my stuff constantly. I moved out at 17. I get along with both my sisters now but that took years. They still hate each other though, and don't speak. YTA OP.",
          "id": 127,
          "comments": [
            {
              "score": 32,
              "content": "[deleted]",
              "id": 128,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "He knows, he just doesn't care. Obviously his girls don't want to share and he is aware of it.\n\nHe also doesn't care about \"everyone\" being happy, like he claims. He only cares about him and his son being happy, because to him those are the only feelings that matter.",
          "id": 129,
          "comments": [
            {
              "score": 34,
              "content": "Oh yeah, for sure, his entire post is dripping with favoritism and sexism it was just the most ridiculous thing at that moment to me, bcz I have 2 sisters and ...  Well. We get along well. Now.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Exactly. There are definitely girls out there that don't share and boys that do. What a BS statement for all involved. First of all, it's making a mockery out of boys as if they'll never have any control to learn how to share which is an insult to their intelligence and abilities, and two it's an insult to girls by putting pressure on them to always have to be more perfect and compromising than their \"immature\" male counterparts. Some girls share, some don't. Some boys share, some don't. It's the parents who are supposed to teach them how to behave properly, not categorize their kids by what's in their pants.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2626,
      "content": "[deleted]",
      "id": 132,
      "comments": [
        {
          "score": 1871,
          "content": "He kept having kids because he needed a boy.",
          "id": 133,
          "comments": [
            {
              "score": 1099,
              "content": "My favorite part was: \"My son won't accept this and I know that.\" \n\nMeanwhile: \"My daughter is so unreasonable!\" \n\nMisogyny in its most organic form.",
              "id": 134,
              "comments": [
                {
                  "score": 79,
                  "content": "This pissed me off the most... He hasn't even spoken to his son, just made up some shit in his head about it and made in the final word on the matter. Meanwhile his daughter is throwing a \"tantrum\"... I wonder what he would call his son being upset?  \n\n\nF\\*\\*k this guy so so so much.",
                  "id": 135,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 39,
                  "content": "A 10 yo boy won’t accept this? A 10yo isn’t the parent",
                  "id": 136,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Right? And clearly the daughter won't accept it either but she's just female, so, who cares.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 546,
              "content": "[deleted]",
              "id": 138,
              "comments": [
                {
                  "score": 74,
                  "content": "Funny how they stopped having kids after the boy, just saying...👀",
                  "id": 139,
                  "comments": [
                    {
                      "score": 43,
                      "content": "[deleted]",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "Ding ding ding! \n\nSo many people keep having more kids to get \"a full set\" of at least 1 boy and 1 girl.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Knew a family like this, except they wanted a girl.\n\nThere's like, 12 boys and they finally got their girl. She's spoiled. Sweet kid, and doesn't act entitled at all, which I'm grateful for. Her brothers get the basics. Sick stuff. Idk why people are like this; if gender is a deal-breaker, just skip it and don't be a parent in the first place.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "Agreed. I had to share a room with my cousin off and on majority of our childhood and it was hell sometimes. We don't naturally share and I don't know where OP got that information from.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "the teen 100% deserves more privacy. i can’t believe it’s feasible to let THREE daughters share while youngest son has his own room. OP is a raging sexist and asshole \n\nalso me and my sister did not share at all growing up lmao we were very catty when we were young/teens",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "He kept having them till he got it right and had his boy. Notice they stopped immediately after that one showed up.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2129,
      "content": "YTA\n\nThree in one room, one in the other? Huge favouritism on display here.\n\nEither buy a house with enough rooms to house the children you have known about for more than enough years already or make the sharing fair. There’s no excuse for forcing three older teens to share a room when the child gets his own.\n\nAnd it’s absolute bullshit that he gets the room because he’s a boy or that he won’t stand for it. Here’s the kicker; your eldest daughter isn’t standing for being forced to share a room with two siblings whilst her younger brother gets a room to himself.\n\nYour eldest will be going to college/university in a couple of years, I assume. You can re-think the room distribution then if you have to buy a property that simply isn’t large enough for your family.",
      "id": 146,
      "comments": [
        {
          "score": 784,
          "content": "How about the 16yo gets a room, the 14 and 12 yo share, the 10yo gets his room. And mom and dad sleep in the living room.",
          "id": 147,
          "comments": [
            {
              "score": 237,
              "content": "This is the only solution to make this new home work. Sadly dad seems like a jerk who doesn’t care about his childrens emotional and developmental needs",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1307,
      "content": ">I should be careful because the girls are beginning to sense some sort of favoritism towards my son which isn't true at all \n\nOh it's definitely true. You want prove? \n\n>but my son won't accept this and I already know that, all I'm looking for is for everyone to happy\n\nHere it goes. Clearly your eldest daughter is not happy, nor is it fair for the GIRLS. YTA, a very hard one at that.",
      "id": 149,
      "comments": [
        {
          "score": 201,
          "content": "\"look the problem is the girl does not accept the situation, the fact that I already know the boy won't accept is not problematic at all\"\n\n&#x200B;\n\nSexist af.",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "Wife has the right idea eldest 2 in 1 room youngest 2 in the other. Anything else is BS. The economy sucks not everyone can afford what they need but this is just disgusting. Would be surprised if they have a Garage \"for parking cars\".",
          "id": 151,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1181,
      "content": "YTA - Listen to your wife as she had the best solution of having the 2 youngest share a room.",
      "id": 152,
      "comments": [],
      "relation": "Attack"
    }
  ]
}