{
  "post content": "So this isn’t like a big tea spill, but I just really feel like a huge a**hole for doing this, so I wanted some opinions.\n\nI went to community college for a term, right before the pandemic began, and I made an awesome friend. She was cool and we did a lot together. I didn’t have a job at the time because my parents insisted I should focus on classes instead of a job. But me and my friend talked about moving out of our parents’ house all the time. It was something we really wanted to do together after we got jobs and after I got my license (she won’t be able to drive due to a joint disability; she’s decided it’s not worth the risks).\n\nAnd then COVID happened.\n\nJust as I was about to get my license, the DMV shut down. I was so upset. This threw a BIG hitch into my plans to get out of the house. I’d have to wait until the pandemic thing blew over and the DMV opened again. I skipped the next term, as it was all online and I’m not good with online classes, but I stayed in contact with my friend. We even hung out sometimes (we waited until we’d been isolated for about a month and didn’t leave the house at all, and we still tried to use social distancing whenever possible). The dream of moving out together seemed far off.\n\nThen things started opening up again. HUZZAH! The DMV opened and I tried to schedule an appointment. But the DMV wasn’t doing drive tests. They called me to tell me they wouldn't be doing a drive test for a new, non-commercial license. I was even more upset than before. I’m still mad just thinking about it. I’m a very independent person, and I wanted to be responsible for myself entirely. My friend wasn’t super happy about this either, though it didn’t affect her quite so directly. We just agreed we’d wait even longer to move out.\n\nMeanwhile, I got a job! That was the best thing I could do to bring myself closer to moving out. I immediately started saving money, making sure I only spent money when necessary. My bank account was slowly but surely growing in amount and I was excited. First I could afford a car, and then, after I got my license and got myself to a financially stable point, I could move out!\n\nToday, she texted me saying she couldn’t wait anymore. She needed out. Now. I was immediately hesitant. I told her I couldn’t as I didn’t have my license or a car or even really enough money saved up to last us very long. She said she got a job though! She made 1200 a month! She had food stamps! Surely, we could do it. I just...couldn’t budge. Without a way to get to work, we would have to move back almost immediately. I wanted to be smart about this.\n\nI feel so guilty. She constantly feels like an outcast in her own home. I know she won’t tell me, but I KNOW she’s upset. Her reaction made that clear. Of course, I’d *love* to move out with her, but the timing is all bad. Am I just being a bad friend? Am I the a**hole here?",
  "id": 1,
  "comments": [
    {
      "score": 24,
      "content": "NAH. It sounds like your friend is in a bad situation and it's understandable for her to want out. You, however, are being very practical about it, and you're definitely playing it smart here. It suck for her, but it's definitely the smart thing to do right now to wait until you're sure you have the resources to do it successfully.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NAH here. You are making the right choice for you and she has a right to her feelings. It doesn't sound like she has been am asshole to you so I think everyone is acting in non-asshole ways in a sucky situation.",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NTA - you have watch out for yourself",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "Gonna say NTA.\n\nIf you're not ready, you're not ready. This is a big step that should not be rushed if it doesn't need to be.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA, Just because you can't do what your friend wants Right Now doesn't make you a bad friend. What's worse? Not being able to move for awhile longer, or moving out, failing and having to move back home? If you don't feel you are able to do it, then don't. A good friend should be able to understand and accept when you say no.\n\nIs there any way to compromise? If not then that's fine, sometimes life happens, and plans get derailed by more then expected. Anyways, good luck on getting your license when everything opens back up!",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH it’s a shame she’s stuck in a not so good situation but you’re not the one responsible for her and it’s great that you’ve got a job and are building some funds up, you’ll always need to have some money! It sucks about her situation at home but it’s not like you’re her only way out especially if she’s got her own job too. She’s not an asshole for being upset but she should have another plan too",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA. You're being responsible by not hastily moving in. I understand how she feels about wanting out of her parents house, but realistically you're totally right and making the right moves.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo this isn’t like a big tea spill, but I just really feel like a huge a**hole for doing this, so I wanted some opinions.\n\nI went to community college for a term, right before the pandemic began, and I made an awesome friend. She was cool and we did a lot together. I didn’t have a job at the time because my parents insisted I should focus on classes instead of a job. But me and my friend talked about moving out of our parents’ house all the time. It was something we really wanted to do together after we got jobs and after I got my license (she won’t be able to drive due to a joint disability; she’s decided it’s not worth the risks).\n\nAnd then COVID happened.\n\nJust as I was about to get my license, the DMV shut down. I was so upset. This threw a BIG hitch into my plans to get out of the house. I’d have to wait until the pandemic thing blew over and the DMV opened again. I skipped the next term, as it was all online and I’m not good with online classes, but I stayed in contact with my friend. We even hung out sometimes (we waited until we’d been isolated for about a month and didn’t leave the house at all, and we still tried to use social distancing whenever possible). The dream of moving out together seemed far off.\n\nThen things started opening up again. HUZZAH! The DMV opened and I tried to schedule an appointment. But the DMV wasn’t doing drive tests. They called me to tell me they wouldn't be doing a drive test for a new, non-commercial license. I was even more upset than before. I’m still mad just thinking about it. I’m a very independent person, and I wanted to be responsible for myself entirely. My friend wasn’t super happy about this either, though it didn’t affect her quite so directly. We just agreed we’d wait even longer to move out.\n\nMeanwhile, I got a job! That was the best thing I could do to bring myself closer to moving out. I immediately started saving money, making sure I only spent money when necessary. My bank account was slowly but surely growing in amount and I was excited. First I could afford a car, and then, after I got my license and got myself to a financially stable point, I could move out!\n\nToday, she texted me saying she couldn’t wait anymore. She needed out. Now. I was immediately hesitant. I told her I couldn’t as I didn’t have my license or a car or even really enough money saved up to last us very long. She said she got a job though! She made 1200 a month! She had food stamps! Surely, we could do it. I just...couldn’t budge. Without a way to get to work, we would have to move back almost immediately. I wanted to be smart about this.\n\nI feel so guilty. She constantly feels like an outcast in her own home. I know she won’t tell me, but I KNOW she’s upset. Her reaction made that clear. Of course, I’d *love* to move out with her, but the timing is all bad. Am I just being a bad friend? Am I the a**hole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    }
  ]
}