{
  "post content": "I'm 33 weeks pregnant, a little hormonal and could quite possibly be the AH here, but I leave it to the unbiased world of Reddit to decide.\n\nMy husband and I are building a bed frame as we couldn't find anything we liked in the size we need. Between us both working and having an 18 month old at home, this has been in the works for a few months. We're running out of time before baby #2 gets here and had a few days to work on it.\n\nBuilding was done and just had to assemble it.  I was drilling the holes in the frame and he was out in the garage cutting the pieces needed to support the mattress. When he was done he came in to see if I needed help, to which I said sure. I had drilled the pilot holes and was on to inserting the double sided screws (screw on one side, wingnut on the other) and was having a hell of a time.\n\nIt had taken me 5 screws and a bunch of time to figure out the settings on the drill so that it was powerful enough to sink them to the right depth, but not too powerful that it ruined/stripped the wingnut side threads. I stopped what I was doing, grabbed the drill and a screw and started to show him how I was getting it to work as needed. He interrupted saying that he'll figure it out, to which I responded that I already had worked out the kinks and this was what I had found worked best. He insisted that he'd do it his way, I'd insisted that I'm not giving him the drill and I'll do it myself if he won't even hear me out. It ended in a mini explosion resulting in me telling him to get out and leave me alone and him saying it was now my project and that I can finish it alone. He headed back downstairs and sat on his computer.\n\nI continued to work on it, but it was slow going and being so far pregnant definitely didn't help. 2 hours after I had started (about an hour after he tried to help) I was done marking, drilling and sinking screws. The argument continued, and now we're not talking because he expects an apology to be the first thing I say to him.\n\nI say that he could have at least heard me out, instead of disrespecting me by brushing me off because \"he's been using tools longer thank I have\" and not at least considering trying what I had already been doing. He says I disrespected him by refusing to give him the drill and not letting him do it his way, basically \"not allowing him to do something in his own house\". We can both be stubborn and opinionated but 99.9% of the time it's not a problem...unless we trying building something together. IMPORTANT FACT: In the past we agreed (and have stuck with it) to allow someone to do it their way and only offer our opinion if they ask. In this case I feel like it's a different situation, as he was coming in to a new task (for him) which I had already had to troubleshoot, not me butting in to comment on how he was already doing something.\n\nSo, AITA in refusing his help unless he did it my way?  I'll accept the judgement as it comes and will apologize if I'm the AH, but I don't feel like I am.",
  "id": 1,
  "comments": [
    {
      "score": 37,
      "content": "NAH. This just sounds like you're both stressed and things kinda exploded.\n\nPersonally I would have watched him struggled to do it his way, and let him figure out that I was right all along and then shrugged and said \"That was a fun experiment\" but that's just me.",
      "id": 2,
      "comments": [
        {
          "score": 14,
          "content": "Which is definitely the route I've taken before, I think I was just feeling the pressure of getting it finished tied to the fact that we had only 1 more hour of uninterrupted time left until we had to pick up our son from daycare.",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "Definitely understandable!",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "NAH you both sound stressed out. Cool down and try and talk it out later.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH however, I think a pass should be given here because you're 33 weeks in and are probably stressed and so is he. Cool down and talk things out. You guys are basically getting mad at each other over something trivial.",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "Oh, darling, this sub is not unbiased. I wanna be on your side, but if you guys had already agreed on a certain way to proceed and you went back on that then you have no leg to stand on. So, a-hole behaviour. As for your husband, he went all \"hur dur I know more than you\" and that's so annoying. ESH.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm 33 weeks pregnant, a little hormonal and could quite possibly be the AH here, but I leave it to the unbiased world of Reddit to decide.\n\nMy husband and I are building a bed frame as we couldn't find anything we liked in the size we need. Between us both working and having an 18 month old at home, this has been in the works for a few months. We're running out of time before baby #2 gets here and had a few days to work on it.\n\nBuilding was done and just had to assemble it.  I was drilling the holes in the frame and he was out in the garage cutting the pieces needed to support the mattress. When he was done he came in to see if I needed help, to which I said sure. I had drilled the pilot holes and was on to inserting the double sided screws (screw on one side, wingnut on the other) and was having a hell of a time.\n\nIt had taken me 5 screws and a bunch of time to figure out the settings on the drill so that it was powerful enough to sink them to the right depth, but not too powerful that it ruined/stripped the wingnut side threads. I stopped what I was doing, grabbed the drill and a screw and started to show him how I was getting it to work as needed. He interrupted saying that he'll figure it out, to which I responded that I already had worked out the kinks and this was what I had found worked best. He insisted that he'd do it his way, I'd insisted that I'm not giving him the drill and I'll do it myself if he won't even hear me out. It ended in a mini explosion resulting in me telling him to get out and leave me alone and him saying it was now my project and that I can finish it alone. He headed back downstairs and sat on his computer.\n\nI continued to work on it, but it was slow going and being so far pregnant definitely didn't help. 2 hours after I had started (about an hour after he tried to help) I was done marking, drilling and sinking screws. The argument continued, and now we're not talking because he expects an apology to be the first thing I say to him.\n\nI say that he could have at least heard me out, instead of disrespecting me by brushing me off because \"he's been using tools longer thank I have\" and not at least considering trying what I had already been doing. He says I disrespected him by refusing to give him the drill and not letting him do it his way, basically \"not allowing him to do something in his own house\". We can both be stubborn and opinionated but 99.9% of the time it's not a problem...unless we trying building something together. IMPORTANT FACT: In the past we agreed (and have stuck with it) to allow someone to do it their way and only offer our opinion if they ask. In this case I feel like it's a different situation, as he was coming in to a new task (for him) which I had already had to troubleshoot, not me butting in to comment on how he was already doing something.\n\nSo, AITA in refusing his help unless he did it my way?  I'll accept the judgement as it comes and will apologize if I'm the AH, but I don't feel like I am.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH\n\nforcing help on someone is an asshole thing to do",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "YTA - you guys obviously have issues working together so you made an agreement that you wouldn't lecture each other on how to do stuff.  You offered your help, he declined, you should have let it go at that.  Is he a bit ridiculous for not hearing you out?  Sure.  But you're just as ridiculous for getting all weirdly obsessive and not just letting him try it his way.",
      "id": 11,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": -1,
      "content": "ESH you both could have communicated better.  Also building stuff is stressful and to me sounds like a terrible idea for a pregnant person to do.  I think you both should have been less picky and just found a suitable bed at a store, even if you do no love it, and avoided all of this stress.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": -3,
      "content": "YTA",
      "id": 13,
      "comments": [],
      "relation": "No"
    }
  ]
}