{
  "post content": "Throwaway\n\nMy (M39) friend (M38)  recently got a service dog, its a diabetic alert dog.  The issue arises in that he wants to bring it to my house when I host hangouts/parties.  I'm not much of a dog person and really don't want it at my house.  It is a breed that sheds and I don't want to have to deal with dog hair in my house.  Also my kids regularly play in our yard and I don't want them to encounter dog poop and pee. \n\nI've spend the last 10 years in this house turning it into a place my friends, family and I could hang out.  I have a pool, I built a bar in my basement, those types of upgrades.  I offered to meet out at a restaurant or someone else's place and host less, but my house is the preferred destination among everyone else.  I have amenities that others don't and there are no expensive food and bar tabs at my place.  I host a lot during football season and other major sporting events, with some general hangouts in between.\n\nI told my friend that his dog wasn't welcome.  I offered to pay for a monitoring device he can use while at my house, but he didn't take that offer well.  He let me know he wasn't happy and recently missed our Super Bowl get together.  AITA?",
  "id": 1,
  "comments": [
    {
      "score": 34848,
      "content": "YTA. You need to stop equating your friend's service dog to pets. This is a medical assistance device. Would you tell someone they couldn't bring their wheelchair because you didn't want the wheels tracking dirt on your floor?",
      "id": 2,
      "comments": [
        {
          "score": 14332,
          "content": "I’m guessing he would.",
          "id": 3,
          "comments": [
            {
              "score": 3048,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 874,
                  "content": "This me so sad. You deserve better. So much fucking better.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Thanks 💛",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 422,
                  "content": ">  I have family who refuse to install a handrail on their insanely steep front steps because\n\nHoping you live in a city with building codes. Stop in the code department office and tell them your parents are breaking code by not having a handrail. A lot of code guys don't give a fuck and will keep you anon. They can just say they were passed by and saw it. Your parents could get fined or forced to install handrail.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 198,
                      "content": "in a lot of cases, private residences do not need to update to code unless they are having new work done on that part of the property, or in some cases, selling the property.  so if they are putting in new stairs or a side walk, then they would need to put the rails in.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "This is a private home. Building codes about disabilities wouldn’t apply.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Don't give false advice like this. It doesn't help anyone and does nothing but spread false information.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "I just bought a house and when getting insurance the first question the agent asked was, “Do all stairways have handrails.” I’m willing to bet this would be an issue with their insurance company, which would have to pay if you fell.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "yeah, I thought most places I have lived, in the states, have this rule.  excellent idea!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "In many places a private residence don’t have to meet those codes.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 303,
                  "content": ">They responded “ugh please don’t that would be super inconvenient for us.”\n\nInconvenient for ***THEM?***",
                  "id": 14,
                  "comments": [
                    {
                      "score": 25,
                      "content": "people can be so horrible \nalso happy cake day!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "It could be SUPER inconvenient when the disabled person gets injured and sues (under their homeowners insurance).",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Can they spell L A W S U I T ?",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 161,
                  "content": "Families are so clueless sometimes. My son has no depth perception due to being blind in one eye and has an intellectual disability. He also has severe anxiety. My father and stepmother redid their front yard (which has an incline) and put in these great looking giant rock steps. Think something you would see in a stream. They do look cool. No handrails, though. My son can’t walk up them. We used to just walk across the lawn. No big deal. But the bushes and plants have grown so big that we can’t get by without getting hit in the face unless we walk on the edge of the mini fish pond… literally on the edge. If we push through the plants we will damage them and that would not go well for me. So we can’t get into the house from the front. The back is a bit better but still difficult because of the steps. \n\n\nI get that it’s their yard and they need to landscape to what they want, but it would have been nice if they left a path for my son, even if it was hidden from view so it didn’t ruin the aesthetics. We rarely go there anymore and they never come to us.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 21,
                      "content": "This is why ppl should use designers and architects who.have training and experience for designing for ppl w/varying abilities.   I bet a talented resourceful landscaper maybe could have incorporated pathways to accommodate more ppl.  The design sounds exclusionary to many diff ppl",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Sounds like your family is clueless, as opposed to being total AH.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Darn, sorry that you and your kiddo face such thoughtless-ness from the people who are supposed to care.\n \nHave you considered straight-up asking your father:\n \"When you did this thing that excludes your grandson from the property, was it that you\n- realised the problems it would cause for your grandchild and chose to do it anyway\n- were oblivious to the difficulties it would cause, or\n- did it on purpose to shut us out?\"\n \nThe response might be illuminating. I wish you and your son joy and peace of mind.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 153,
                  "content": "[removed]",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 88,
                  "content": "I have disabilities of my own. That said a person's house is the one and only place they have complete control of. I also have a best friend who is allergic to animals and is always having to take medications because of other people's animals. They make him sleepy or he doesn't get to breathe easily. Our house is a dog free zone. It is the one place he can go that he doesn't have to deal with anything he doesn't want to. \n\nThat is how anyone's home should feel. Doesn't matter if they are allergic or just don't like animals they don't want them there. Can people have their one sanctuary where they can generally do what they want? \n\nFor me it is medical Marijuana. Lot's of people don't want me doing it even now that it's legal so I don't. I also don't go over there. It's their sanctuary so I don't mess with it. My mom says no sex before marriage so I never slept with a boyfriend at her house. \n\nIt's one think to expect public places to be accomodating but another thing entirely to start giving up their sanctuary where they can get away and have a place where they feel comfortable. A person's home should be the ultimate space space.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I feel like your examples are fairly different, you could easily still visit your mom's house and simply abstain from sex and likely visit the anti-marijuana homes (depending on their feelings of smokeless use/how long you're able to go without use). FWIW I'm also a medical marijuana user for chronic back pain and allergic to many pets.\n\nimo OP is totally fine to keep this policy in-place, it's cool that he wants his house how he wants it. He just has to accept that his friend will see him as an asshole. If it's worth ending a friendship over then I don't think he really sees this person as a friend anyway.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Yup, it's insane. I'm all for accommodating disabilities, but that's not an excuse to intrude on someone's home boundaries.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 77,
                  "content": "Why do you have to ever go?",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "I’m sorry for your shitty situation, but it brings a badly needed perspective the OP clearly lacked. OP needs to sincerely apologize for being such a huge AH.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "But WHY would anybody want to go there?  Who wants to go where they’re clearly not wanted?",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Omg this is terrible! I don’t presume to know anything about your life, but based on this one insight, I would suggest not going there ever! How could your own family be so heartless? At least it sounds like you have a wonderful husband!",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2032,
              "content": "It doesn't really make sense tbh if the dog sheds that much then it would be on his friend's clothes anyway. What about pet hair on other people's clothes that visit? What about other ppl's kids? Are ppl allowed to eat inside? They might drop crumbs. Oh man OP might actually have to get the vacuum cleaner out what a pain in the ass. Worth losing a friend over for sure. I wonder if farting is banned in his house too.",
              "id": 30,
              "comments": [
                {
                  "score": 1284,
                  "content": "Service dogs aren’t pets. They’re not gonna eat crumbs off the floor or jump on children. They’re working.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 471,
                      "content": "Yeah! They're very well trained and calm. And I meant all those things I said separately, like if he cares so much about pet hair, what about indirect pet wafting through his house from clothing (surely someone else he knows has pets), what about the mess that children make, his own kids and visitors and their kids, the mess that people make from eating in his house or from just existing in his space. That's why I think his rule is so dumb and hurtful to his friend.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "That dog is probably more well-mannered than OPs kids.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "They are also trained to go to the toilet at specific times and locations or to alert the owner if special provisions need to be made so his rubbish about it going in his garden is out. Incredible animals and I’m guessing would make a lot less mess than any guest at his party.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I am wondering if OP is confusing a service animal (one that has been trained for countless hours for a very specific need) and an \"emotional support animal\", AKA a pet.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "Service dogs are trained to hold their pee/poop and the owner is trained to take the dog somewhere they can toilet. Unless the owner lets the dog toilet in the guy’s yard, it shouldn’t be a problem.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Wow I didn't know that but it totally makes sense, very clever dogs with important jobs :) not that I think OP is going to listen to reason but definitely something he should know! I'm so curious if his kids play in grass anywhere that isn't his house lol",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "He doesn’t want to admit that his friends diabetes makes him uncomfortable when pigging out watching a game.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "and service dogs need to be regularly groomed, bathed etc for these reasons. They have to be as hygienic as possible (at least where I’m from) as a requirement. So OP really has 0 reason to be acting like this over some minor shedding.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "What about the people shedding?! 🤦🏻‍♀️",
                  "id": 40,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Oh no don't let OP know about skin cells!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Which he would do anyway after a party. And he can easily ask his friend to walk the service dog not allow it use the backyard.  OP needs to decide if a couple hairs are more important than his friendship. Sadly will be the hair I’m sure. I have two dogs that shed year round and I have to sweep my floors every other day in winter and vacuum the area rugs. BFD. YTA.  Why don’t you host your friends at your country club so you don’t have to sweep.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "He likely has the best vacuum to go along with all of his other awesome amenities... as someone that has had a service dog for the last 3 years, OP is a huge AH for putting his \"fancy things\" over the health and safety of his \"friend.\"",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">I’m guessing he would.\n\nYou don't understand, he spend ten years making his house **fun™.** And tracking wheels inside isn't fun.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "He would suggest to pay someone to carry him around like a princess",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Heaven forbid someone’s disability mar ops perfect oasis /s",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "OP sounds like the kind of AH that makes everyone take their shoes off to enter.",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "“I offered to hire some one to carry him around all day at the party, but his wheel chair is not welcome.”",
              "id": 48,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3000,
          "content": "Don't call him his friend, we both know he doesn't care about that guy",
          "id": 49,
          "comments": [
            {
              "score": 1531,
              "content": "Yeah, I think a lot of people are saying N A H and N T A on the basis that OP has the legal right to refuse to have a dog on his property.\n\n*But this isn't \"Am I legally entitled to do this thing?\" it's \"Am I the Asshole?\"*. Yeah, you have the legal right to refuse to have a service dog on your property. But you're still an asshole.\n\nUltimately, OP cares more about keeping his place pristine than he does about his \"friend\". Not really friend behaviour.",
              "id": 50,
              "comments": [
                {
                  "score": 366,
                  "content": "I always like to say it's fully within my legal rights to fart in an elevator but that doesn't mean I wouldn't be an a h for doing it.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "The weird thing is that yeah, it is assholey to refuse to have a service dog at your private residence barring significant distress to you (severe phobia, allergies, spouse or children with said issues)*.However THIS guy doubles down by being put out that means his friend won’t come to his Hang Out House. Like? (Also I do not know a lot about service dogs, but an old colleague’s guide dog only toileted on command while on duty and/or alerted if they really needed to go. I have always kinda assumed that is standard with a service dog?) *That said in that situation I would probably just take my house out of the running as a party destination rather than look like the asshole who barred a service dog.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "One of my pet peeves about this sub. Just because you won’t literally go to jail for it doesn’t make it socially acceptable behavior.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Thank you for saying this. I have PTSD from being argued over in every argument in childhood, and I really have trouble arguing even if it's basically a writing prompt. So, thank you again. It really means something to me.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 794,
              "content": "Seems harsh.\n\nSeems accurate.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 436,
              "content": "I mean wow, a few hours of dog hair is nothing to VACUUM, compared to when the dog is living with you.\n\nAlso if the friend is a good owner, he will pick up the poop if the dog goes in the yard. More likely he'll take the dog for his customary walk. OP, do you know that properly trained dogs know their time for walking and going? They're not like people where its anytime.\n\nYou told him his dog is not welcome.  That for many says THEY aren't welcome.",
              "id": 56,
              "comments": [
                {
                  "score": 29,
                  "content": "OP is so pretentious. He thought his money would pacify his \"friend.\" \nHe is trying very hard to convince everyone and himself that he's NTA.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Right? I mean it's \"nice\" (I use that term LOOSELY) of him to offer for the device but come on man. Yeah doggo may be his service dog for the strict purpose of his diabetes, but I'm sure he's also an emotional support dog in a way as well. Money and devices can't replace that nor can they replace the comfort of knowing ur dog knows immediately, even sometimes before u do or start to present symptoms of something being wrong. Again, money cannot and will never replace that. \n\n\nAs the commercial says \"there's some things money can't buy\" and that my dude is ur friends comfort and safety he has with his doggo beside him.\n\nGet over yourself before u lose a good friend. Bc u don't deserve him, u need to be groveling for his forgiveness and doing whatever u can to show him ur not a complete uncaring AH! \n\nYTA op. Period.",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "It's not even a seeing eye dog, cause it's difficult to see the dog pop to pick it up when you're blind. The owner can probably clean up after the pup",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This part confuse me too because I was thinking would the dog not just be picked up after like that doesn't seem like a hard thing to do why is his friend not already doing that or is he and hes just making up excuses? At the end of the day though it's not this person's dog. If the person using a service dog no longer needs them, the dog will be rehomed because it is not your dog, it is a service dog doing a job for you.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Really? So they have a schedule for when they can go and can't? I honestly had no idea. Or maybe I've just never really thought about it, but it totally does make sense. I know it wasn't the purpose of ur comment but thanks for the info.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I raise guide dog puppies and yes, they go when told to (they learn the command “get busy”). Also, the dog will signal when they need to go (not even service dogs can poop on command) so you take them somewhere appropriate. The dogs are amazing.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "True fact! He's obviously not enough of a friend to have been around him enough to have seen the dog alert. It was nice of him to toss out there that he would purchase a CGM to keep the dog hair away. Guess he's not aware that they average around $1000 lol",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I’m not your guy, buddy.",
              "id": 64,
              "comments": [
                {
                  "score": 8,
                  "content": "I'm not your buddy, friend",
                  "id": 65,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I'm not your friend, pal.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 745,
          "content": "Agreed! This is a well trained swrvice animal, not a pet, that will stay next to the owner, won't be on furniture and won't try to eat/chew on anything bc they are working. YTA",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 422,
          "content": "[removed]",
          "id": 68,
          "comments": [
            {
              "score": 22,
              "content": "OP believes the dog is trained to save their friend's life but can't help but shit everywhere.",
              "id": 69,
              "comments": [
                {
                  "score": 9,
                  "content": "And thinks diabetic monitoring devices are cheap. Dexcom receiver is $600-ish, a box of three sensors (thirty days worth) is about $450 and and a transmitter is about $300 (good for 90 days). So he wants to pay about $1300 so he doesn't have to have dog hair in his house? 😂\n\n(Diabetics, yes I know all the tricks for getting those things cheaper, but not everyone does and if he can't get a prior authorization in time for the next event it's moot. And that's not including the rigamarole of getting a script and getting it approved and waiting for the mail order, etc.)",
                  "id": 70,
                  "comments": [
                    {
                      "score": 3,
                      "content": "He probably is talking about one of these and doesnt understand that it doesnt continuously monitor \n\n://www.amazon.com/Blood-Glucose-Monitor-Kit-Glucometer/dp/B076VSN7TR/ref=mp_s_a_1_1_sspa?adgrpid=67557176373&gclid=Cj0KCQiAutyfBhCMARIsAMgcRJTjdSvmeTClipbMpLl4sMXigOsL3bbZO1n3YEKa2HZMSTwugkRLvc0aAs2lEALw_wcB&hvadid=617130689435&hvdev=m&hvlocphy=9007833&hvnetw=g&hvqmt=e&hvrand=9934817060623408561&hvtargid=kwd-301785523633&hydadcr=6719_13278911&keywords=home+blood+glucose+monitor&qid=1677213884&sr=8-1-spons&psc=1&smid=A1UJDQHYNCE0BK&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzNDRaNlJDME02UDgyJmVuY3J5cHRlZElkPUEwMjg1NTMzMTlRNk41WTZFODZIVCZlbmNyeXB0ZWRBZElkPUEwMTAzMjg5Mk9JUjhYQ0pMQ1JONiZ3aWRnZXROYW1lPXNwX3Bob25lX3NlYXJjaF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Some people can go dangerously high or low especially at a party where they are careful but may not eat great. A worse thing would be for your friend to collapse and need to go to the hospital. These dogs usually pick it up before it does an test. You could have gotten doggie bags and just asked him to pick up the poop and dog pee in the grass would dry quickly.  Also if he is a Type 1 it is genetic which means your pancreas does not work to excrete insulin know matter how good you are you can still have highs and lows through no fault of your own. Hence the need for the dog. You are right we did go on without service pets for this for a long time and many Type 1’s died early. These dogs have saved so many people alerting others waking their owner. They are highly trained and frankly probably a less messy guest than your human friends.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Ya, but he sheds, so...\n\n/s",
              "id": 73,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 347,
          "content": "He's not equating it to a pet, he's equating it to a dog that sheds, which he doesn't want in his house.",
          "id": 74,
          "comments": [
            {
              "score": 17,
              "content": "sure, but if you said that to a diabetic who was asking if they could bring their service animal to a party, you would be an asshole",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Right, so he's prioritizing a home with no dog hair over the comfort and safety of his friend. Thus he is an asshole.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Unless someone in the house has allergies, a couple of hours in the house isn't going to shed that much.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Does he know that people shed as well? I mean I know y'all have cleaned the shower drain before",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "If this is truly a service animal and not just a ESA, then the dog will never be on the furniture.  Most sit at the owner's feet.  And as for poop and pee: I'm sure friend owns poop bags that he carries on him and peeing in the yard?  Are you kidding me? I'm sure you step on grass all the time that tons of dogs have peed on and didn't even know it.  The guy isn't asking to move in with the dog, he just wants to have his medically needed dog at his side.  To get insurance to cover it, I'm sure he had to go through other solutions and prove why they didn't work before getting the dog.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "But his kids might encounter pee. Wait until he finds out what squirrels do on his lawn all day long.",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Note that well over a third of the post is used to describe OP’s house and lifestyle - well past the point of relevance. So, yes, I’d agree that intact ‘things’ are more important to OP than intact friendships.",
          "id": 81,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "“I offered to have someone carry him around in his arms so that he could leave the wheelchair at home. He didn’t want to compromise” -OP probably. YTA",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "OP is making a lot of assumptions about this dog, as well. Such as the dog will poop/pee all over the yard (service dogs are generally trained to eliminate on command whet you tell them, and Friend would presumably clean up after them), and shedding can usually be mitigated for the short term (give the dog a bath and brush them out thoroughly before going over).\n\nIf OP had the dog over and there were actually problems that Friend refused to mitigate (ex: Friend refusing to pick up the dog's poop), that would be one thing. As it is, though, OP is very much TA.",
          "id": 83,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "this! YTA, OP",
          "id": 84,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10714,
      "content": "I can tell that a lot of you are not familiar with diabetes and ways to monitor it.  There is no magic glucose monitor. The most common way is a test kit where you have to prick your finger to get a drop of blood to test.  These are most accurate. \n\nThe second most common method is a device that you stick on your arm. You wave your phone or a small sensor over it and it gives you a reading. However, this is not as accurate as the first method. My docs prefer the first. But the second method can track your glucose levels over a period of time (because it stays in your arm). I really only use this one. It's close enough for my needs.\n\nSo guest would be sitting there waving this sensor over their arm every 15 minutes or so.  It only takes a second and it's easy.  But would anyone really want to be worrying about their disease all night. If the guest has a dog it sounds like they probably have much more of a problem regulating their glucose, which happens with some people.\n\nWith the dog, guest can relax because the dog will alert them if there is an issue.\n\nEdit: Because people are taking my comments way too literally.  I know  I don't know everything. Apparently there is another kind of monitor that may be implanted or something that I don't know anything about that you don't need to swipe to monitor.  I do not have an insulin pump and I think they may be more common with people who do. \n\nI do think the dog would help the guest be more relaxed.  Though that person still must monitor their glucose in some other fashion.\n\nAnd thanks for all votes, whether up or down.",
      "id": 85,
      "comments": [
        {
          "score": 1628,
          "content": "The average diabetic tests their blood sugar 4-10 times a day. I care for a disabled Diabetic that tests hers 12x a day. When it’s low (I’m talking in the 30s) she (we) test it 6x an hour to watch it come up. There is no chance you’re a diabetic if you think someone needs to text it every 5 minutes. Realistically the friend would need to test it less than 6x during the Super Bowl depending of what they’re eating or drinking. But twice would be expected.",
          "id": 86,
          "comments": [
            {
              "score": 831,
              "content": "Came here to say this, even as a nurse in the hospital we really only test patient blood sugars like 5 times a day unless they are severely hypoglycemic.\nThat said OP is still the AH as the service dog is essentially medical equipment.",
              "id": 87,
              "comments": [
                {
                  "score": 659,
                  "content": "Here’s where I disagree.  A diabetic alert dog is basically only useful at super high or low glucose levels.  Where they can be helpful is when you live alone, or the household Is sleeping.  At a party, there’s no need for the dog.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 240,
                      "content": "I agree. Plus there's a lot of disagreement within the diabetic community about how accurate a dog is. I have a dog and he's an untrained a-hole. He sniffs my mouth long and hard when my sugar is high. Normally I already have guessed. Last week I had the flu and some form of infection. I was high constantly even though I couldn't eat anything and my dog was worried. He doesn't come with me though. There's been threads about people spending money on a trained diabetic dog and the consensus is that the money is better spent on meter that alerts your phone.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 144,
                      "content": "Based on OP's comments, it doesn't seem like they are familiar with what a hypoglycemic episode would look like, so they really can't be expected to keep watch over the friend.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 96,
                      "content": "Now days with bluetooth and cgms I NEVER test my sugars with my glucometer. I put my phone to my arm and it gives me a number. It has alarms that go off if I hit 200 or go below 70. it wakes me up all the time. He does not need a dog and a party can be super stressful for a service dog because people are dumb and treat them like pets and distract the shit out of them.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Exactly. And it’s her home. She’s within her right to ask the dog not be brought to the party.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "My kid fluctuates like CRAZY at parties due to the adrenaline. To the point her CGM can’t keep up so in my mind a diabetic alert dog is MORE useful at parties. It depends on the person",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Students take them to school and the dog alerts lows and highs throughout the day, not just extreme highs or lows.  I don't see how that is terribly different from a party (stressful environment that might cause more lows and highs btw).  I don't think there's no need.  Especially with insensitive friends like this that might confuse losing consciousness with just taking a nap or passing out from alcohol.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "It’s hilarious that you think a bunch of clueless people drinking at a party are paying that much attention to their diabetic friend.  By the time they noticed a problem, the person would probably be unconscious.  Lived with several insulin dependent diabetics, have friends o spend extended time with including traveling, and used to get contacted by neighbor next door for help.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Or in the middle of the night, because that's when mine tends to decide to randomly drop and is the reason I've considered a diabetic alert dog.\n\nThe dog can body-slam you awake. A glucose monitor or finger pricking kit can't.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": ">At a party, there’s no need for the dog.\n\nThe dog may be needed to travel to and from the party though.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Disagree… more useful at a party if he is consuming alcohol",
                      "id": 98,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "If you have to check your blood sugar 6-12 times per day and you’ve been diabetic for more than a month you need a new specialist, you need an educator, and you need to make better choices. The insulins and medications there are out now along with the understanding of carb counting should make checking your sugars more than 2-4x day unnecessarily except in exceptional circumstances.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I didn't even know they tested that much. My grandpa is diabetic and on insulin and only tests his 3 times a day (or more if he's feeling sick/light headed/dizzy) before his first meal of the day, mid day, and before he goes to bed.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1130,
          "content": "[deleted]",
          "id": 101,
          "comments": [
            {
              "score": 1978,
              "content": "[deleted]",
              "id": 102,
              "comments": [
                {
                  "score": 407,
                  "content": "It was clearly a sarcastic over exaggeration to show the blood testing equivalent of constant monitoring?  \n\nThere are plenty of type 1 diabetics who cannot feel when their blood sugar fluctuates, which is horrifying.  \n\n&#x200B;\n\nAlso, you're incorrect as well.  What the hell would the dog do if the friend became unconscious?  The dog is a preventative measure, it doesn't help if the person already gets fucked over.  \n\n&#x200B;\n\nThere's a general joke among the diabetic community that every time they get a new general practitioner, they have to teach their new doctor about diabetes, and you aren't helping that stereotype.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 387,
                      "content": ">What the hell would the dog do if the friend became unconscious? \n\nMost service dogs are also trained to get help if their handler becomes incapacitated. If a service dog ever comes up to you barking with no handler, he is trying to get your attention so that you will follow him back to his handler. If you don't follow him, he'll go to others until someone does follow.",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 73,
                      "content": "Yes! Friend might not have hypo awareness. So if they have a quick drop in blood sugar, they will pass out. Hypo awareness really varies among diabetics. It can range from a non-issue to seriously life limiting. It can prevent you from getting a driving licence etc.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "Right?? Thank you i hate when people proudly state wrong facts.",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "It really depends on the person. My girlfriend is very insulin sensitive and she can have quite dramatic changes in blood sugar, especially if she is eating and drinking and estimating her carbs. I agree that 5 minutes is excessive, but 5 times a day is wild to me. Doctors always say it, but when my girlfriend is only doing it 5 times a day, her control is dreadful. 🤷‍♀️",
                  "id": 107,
                  "comments": [
                    {
                      "score": 8,
                      "content": "She might need to have her long acting insulin adjusted. Does she keep a glucose diary and food record?",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Do you have T1? Just wondering. (Sometimes endos who don’t have T1 think they know everything about it because they have studied it.) I’ve been Type 1 since 1983 so for 40 years. I do think you should know that sometimes diabetics *do* test their bg every 5 minutes or more often. When my bg is going low/crashing, and tanking very quickly, my CGM can’t keep up. Just my lived experience. I also have 3 siblings with T1 who have had similar experiences. YMMV.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Ignorance on this thread is astounding! Also, control, insulin sensitivity, hypo awareness varies between type 1s!",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "The primary purpose of a service dog for diabetes is to alert to help avoid the patient becoming unconscious in the first place.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "A service dog can’t do much more than grab help if their handler goes unconscious. It’s not like they can administer glucose. Diabetic alert dogs actually smell changes in blood sugar and alert their handler to *prevent* them from going unconscious in the first place. They can also grab meds or food and pester their handler to take them if they’re already losing awareness from hypoglycemia. Where they’re most necessary is for people who are neurodivergent, ASD in particular, because they have trouble remembering to take care of their health and aren’t as aware of how they’re feeling to tell if they’re becoming hypoglycemic. And with celiac’s being correlated with type I diabetes, dogs can be trained to alert their handler if wheat is present. They’re not a replacement for a glucose monitor but they’re very necessary for the people who use them.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "And the most common glucose monitor on the market does not require you to wave anything. It alerts you to highs/lows that you set yourself. My daughter pricks her finger maybe once/day. She also has a diabetic alert dog because he can sense things before the monitor does, which tends to be about 20 minutes behind her actual BG. \n\nSharing misinformation does not help.",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 555,
              "content": "Except they are 100% wrong with everything they wrote.\n\nSource: I have lived with a type 1 diabetic.",
              "id": 114,
              "comments": [
                {
                  "score": 262,
                  "content": "Thank you! There is sooo much misinformation in this thread I think I’m about to have an aneurysm. 😂😂",
                  "id": 115,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Can you educate me on the misinformation?\n\nIts awesome that it is pointed out, but like why is this wrong?  I am not diabetic nor do I know anyone who is",
                      "id": 116,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Misinformation can’t give you an aneurysm! Where are you getting your medical information? (/s if that wasn’t obvious)",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Thank you for this.\n\nSigned, a type 1 diabetic with a CGM",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "100% agree. I am a type 1 diabetic. I’ve never heard of a diabetic testing every 5 minutes.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I’ve lived in the times before cgm and pumps too. You would never be able to drive if you were checking your sugar even every 30 minutes.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 300,
              "content": "This needs to be way lower. Some miseducation on diabetes management. OP NTA.\n\nFixed it for you. Source: I've had type 1 for 15 years.",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "But they're wrong or sharing misinformation on literally every point.\n\nMy Dexcom CGM (continuous glucose monitor) doesn't have any waving of a phone or receiver near it.   It transmits every 5 minutes to an app on my phone and I check it when needed.\n\nDiabetes alert dogs have been shown in studies to be MORE inaccurate than either traditional meters (finger sticks) or CGM.  The majority of dogs evaluated are no better than random chance at detecting either high or low blood sugar.   There have been several lawsuits against companies selling diabetic alert dogs because the dogs are either unable to reliably detect blood sugar fluctuations or their training doesn't allow the dog to actually be brought into public places.  \n\nAny diabetic with one has to also have and use a backup method of glucose monitoring - even if a particular dog *is* accurate in detection, as a living creature it can't be awake and working 24/7.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I dont see it, its like if I make a party and say no kids allowed.  Just because you dont have where to leave your kids doesnt mean you are entitled to bring them to the party.  You just cant come.  \n\nOf OP says no dogs in his house and you need a dog to leave then guess what, you just go to his house.  I dont get the issue here.",
              "id": 123,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 923,
          "content": "As a diabetic, you should know that he wouldn’t be checking his bs every 5 mins, or even every 15. Why exaggerate?",
          "id": 124,
          "comments": [
            {
              "score": 277,
              "content": "Yeah I thought that was crazy. As well they have ones for your arm that go right to tour phone that you don't even need to scan it. Who is checking their sugar like every 1/2 hour even?",
              "id": 125,
              "comments": [
                {
                  "score": 250,
                  "content": "It’s funny because everyone believed this and gave an award😂 its definitely not accurate",
                  "id": 126,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Because they don't care about the diabetes portion of this post, or the service animal portion, only that a dog was denied access to a party. \n\nRemember, this is the sub that called a grandmother an asshole because she didn't want to watch two large dogs, three times a week (all day and overnight) while her daughter was traveling anymore, after doing it for literal years. \n\nDog people come out in force around here. OP is NAH",
              "id": 127,
              "comments": [
                {
                  "score": 3,
                  "content": ">Remember, this is the sub that called a grandmother an asshole because she didn't want to watch two large dogs, three times a week (all day and overnight) while her daughter was traveling anymore, after doing it for literal years.\n\nlol is this the one where she didn't want to watch the dogs to watch her grandson?  And she got called and asshole.  \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/10l2hhs/aita\\_for\\_deciding\\_to\\_watch\\_my\\_grandson\\_over\\_my/",
                  "id": 128,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Exactly. Can you imagine how fucked up your finger pads would be from all that pricking. Like when you go in A&E with a severe low/DKA and they DO actually prick you every hour or so and you come out with black and blue fingertips because of the bruising.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 538,
          "content": "Yes, however while people like their diabetic service dogs (who doesn’t like a woofwoof?) they have crap accuracy with poor positive and negative predictive values.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5505410/\n\nIf he is really worried about occult hypoglycemia a continuous glucose monitor is much more accurate and much better validated and doesn’t shed.",
          "id": 130,
          "comments": [
            {
              "score": 127,
              "content": "My recently passed cat would wake me up if I was having a hypo during the night, but it's not something I would ever rely or depend on.",
              "id": 131,
              "comments": [
                {
                  "score": 8,
                  "content": "That’s so cool! Did you train them or did they just pick that up on their own somehow?",
                  "id": 132,
                  "comments": [
                    {
                      "score": 39,
                      "content": "He just learned it on his own! I’m an adult onset T1, and Elric was already an adult cat. \n\nHe was just a very good boy who loved his Daddy very much (and I miss him every day).",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My sister's cat that she had years ago would always fetch me when her blood sugar was really bad.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "Don’t you dare bring science into this discussion! /s",
              "id": 135,
              "comments": [
                {
                  "score": 31,
                  "content": "I’m baffled by the parent comment, it’s literally all wrong. I have my friend’s blood sugar as a widget on my phone, updates every minute or so… You definitely do not need a dog for this.",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "You're totally correct on this! That said I've literally never woken up to my low alarms from my Dexcom 🤦🏼‍♀️. I'm looking into a sugar pixel clock so it'll be louder now. I definitely have woken up to my asshole (non-service) dogs though, so that could be helpful!",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 271,
          "content": "While I agree with this, I am Type II, and My Father and Sister are Type I. I dont know anyone who monitors that frequently. Unless there is a problem the Type I's I know would do pin pricks 5-7 times a day (which is a lot) and with the skin monitoring they check roughly twice as often (because its 100x easier)",
          "id": 138,
          "comments": [
            {
              "score": 4,
              "content": "I’m assuming if your diabetes is to the point where a service dog is recommended, you’re not just a standard Type 1",
              "id": 139,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "The only time I (type 1) tested that often was when I was pregnant and before I had a continuous glucose monitor.  Since getting that, I can't tell you the last time I did a blood test, the CGM is more than accurate.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 248,
          "content": "You can get CGM devices that continuously monitor your blood glucose without you needing to scan a phone, and you can also get devices which will give you an alert when your blood glucose goes out of range. Some insulin pumps will even give you an automatic correction bolus if your glucose goes high. These devices are more expensive, but would certainly be more accurate than a service dog.",
          "id": 141,
          "comments": [
            {
              "score": 33,
              "content": "Generally service dogs for diabetes aren't for high glucose episodes, they're for detecting extremely low glucose levels and alerting the owner or someone around them to assist them with getting some sugar. \n\nAt the end of the day, how someone choses to manage their lifelong illness is their right, whether it's more or less accurate or better or worse to someone else. It's certainly not the OP's place to tell his friend how to manage his condition. It is, however, OP's right to decide if he wants a dog in his house or not but if he declines the dog access, he will have to deal with the social repercussions.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Those devices are definitely not more expensive than a service dog (luckily).",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I have a CGM, but I had to turn off the looping because it was causing too many lows. Even though I get alerts at night, I sleep through them for hours. I also can’t feel my lows (I’ve been 38 and felt fine). I could see the benefits of a service dog. \n\nFun story, I once went to the store and a service dog approached me and put their head under my hand (as if it wanted me to pet it). I was confused and kind of worried because I know you are not supposed to touch them. The owner came up to me and apologized saying he’s a diabetic service dog and usually only acts that way when her glucose is high. I told her I’m also T1 and checked my glucose and it was indeed high. Very cool experience.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Surprisingly, no. The dogs are in the $10K+ range, plus $1K/year of  \nbase keeping-alive costs and the often gargantuan vet bills as the  \ndog ages. A Dexcom currently costs about $400 for the receiver and  \n$300/month without insurance (assuming you’re not a type 1 diabetic  \nin the US, who can often get these for free regardless of insurance),  \nwith prices expected to sharply drop with Apple watches entering the  \nCGM market. There’s also Libre, which can cost as little as $120  \nper year. I’ll go with Dexcom to make this even remotely  \ncomparable.\n\nMorbidly: let's say  \na medical assist dog lasts 14 years, the average lifespan. At year  \n14, assuming the dog is legal and vaccinated as per European cities'  \nlaws ($115/year or $1,380 total on the low US end). The dog’s most  \nbasic necessities have been met at an estimated $1K/year or $14,000  \ntotal. Miracle of miracles, the dog has had had both spades of luck  \nand time consuming preventative treatment for the ear infections,  \nnone of the various health problems that can rack up $500+  \nechocardiograms and $100/month medications, $150+ x rays,  \n$1,500-4,000 per elbow/hip dysplasia surgeries, or other common  \nproblems … until a sudden bout of something terminal. Considering  \nthis dog is most likely a purebred labrador retriever, this pup’s  \nalready gotten an extra two years of life. Then … it’s time for  \nanother $10-20K dog.\n\n14 years of DAD:  \nminimum $25,380 with extraordinary luck  \n14 years of Dexcom:  \nFree with type 1 or many insurances, $4K out of pocket; sensors costs about $362/month and $800 for the receiver in 2006   \n14 years of Libre:  \nFree in most cases, or $1,680 out of pocket\n\nMedical costs go down; dog costs go up. Price is not a reason people get animals as  \nmedical devices – it is not cost efficient.",
              "id": 145,
              "comments": [
                {
                  "score": 6,
                  "content": "As a type 1 diabetic in the US, Imma need to to tell more about these free Dexcoms.",
                  "id": 146,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": ">There’s also Libre, which can cost as little as $120  \n>  \n>per year. \n\nI don't know WHERE you are. It's not the US. No way a Libre only costs $10 per month!!!!!",
                  "id": 147,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "They are called a closed loop system.  I've been a Type 1 diabetic for over 45 years and my control has never been better since getting a pump with that ability.  It's remarkable how far technology has come since my diagnosis in the 70s.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 200,
          "content": "My nephew was diagnosed with T1 Diabetes at 1 1/2 years old. They had a dog that would sleep with him and wake my sister up in the middle of the night, or go get her from the kitchen etc. When his blood sugar was off. It was a life saver for her as its very difficult to monitor a toddlers blood sugar well. \nI have to say NAH op is free to do what they want to in their home, however, if friend is struggling with blood sugar and feels the dog is that helpful for it, he is allowed to be upset and excuse himself also. OP needs to understand his situation and realize that they may lose this friend over this because of the inconvenience.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "I mean, CGMs (continuous glucose monitors) are a thing, and they talk to an app on your phone, sending routine updates and prompting alarms if you leave a set range. No waving necessary. My partner's sensor is on his abdomen (some people do use arms or thighs, but those locations can be less reliable and are not generally recommended by the manufacturer). It's not foolproof, but the thing alarms if it loses connection, can't get a reading, needs to be replaced... Basically it tells you loudly and incessantly if anything is wrong. An ex of mine had a CGM and an insulin pump nearly 15 years ago. This isn't new tech. \n\nOP is totally the AH here. I'd understand if he or another resident were highly allergic, and then it would be a sad issue of incompatible medical needs, but just not wanting the dog there because of a little hair? Apparently friends is a strong word for their relationship.",
          "id": 150,
          "comments": [
            {
              "score": 3,
              "content": "They are great if you have insurance (at least in the US) and can get the devices required covered.  It doesn’t work that way a lot of the time.",
              "id": 151,
              "comments": [
                {
                  "score": 5,
                  "content": "I agree, but that isn't the point I was making. The point was that there is a \"magic glucose monitor\" that works without constant finger pricks or scans or any conscious actions on the wearer's part by using a transmitter that communicates with a phone app and alerts the user when their glucose leaves a set range. Sadly not even insulin is accessible to many diabetics, but if we're going to go down that rabbit hole, fully trained medical alert dogs are the most expensive, and least available option of the bunch.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "You don’t need to prick your finger every 5 minutes absurd. \n\nYou basically test around meal times.  Where a diabetic dog can be useful (but isn’t 100%) is alerting to super high or low sugars, particularly when you aren’t awake.  A dog can’t tell the difference between a 100, 150, or 200.  A diabetic alert dog is something that be used in conjunction with blood sugar monitoring, not in place of.  \n\nNo way you are diabetic, nor have you ever been around a type 1 for any extended amount of time.",
          "id": 153,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": ">Wow this is so aggressive in its ignorance.   \n>  \n>You (wrongly) say there's no \"magic glucose monitor\". This is categorically false. But then you go on to talk about a test kit and accurately describe a blood glucose monitor.  \n>  \n>Here are some links for you -https://www.amazon.co.uk/Glucose-Monitor-Diabetes-Testing-Codefree/dp/B08G88Y3WN/ref=asc\\_df\\_B08G88Y3WN/?tag=googshopuk-21&linkCode=df0&hvadid=499313703587&hvpos=&hvnetw=g&hvrand=16119913996319877841&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9044965&hvtargid=pla-1059755659659&psc=1  \n>  \n>https://www.amazon.co.uk/EXACTIVE-Monitor-Glucose-Diabetes-Lancets/dp/B09P4ZPMNR/ref=sr\\_1\\_1\\_sspa?c=ts&keywords=Blood+Glucose+Monitors&qid=1677193826&s=drugstore&sr=1-1-spons&ts\\_id=2826247031&sp\\_csd=d2lkZ2V0TmFtZT1zcF9hdGY&psc=1  \n>  \n>https://www.amazon.co.uk/Glucose-Accessories-VivaChek-X%EF%BC%88Control-Solutions/dp/B094MW4G9N/ref=sr\\_1\\_6?c=ts&keywords=Blood+Glucose+Monitors&qid=1677193826&s=drugstore&sr=1-6&ts\\_id=2826247031 these are just 3 of the 485 results on Amazon alone.  \n>  \n>You then proceed to wrongly describe how we have to monitor our sugars. If you had any clue of what you're talking about (hint, you don't), you'd know it's not advised to test more than every 15 minutes because sugars don't change that quickly. If you're high, it's hourly because insulin takes time to work, and otherwise, it can be every few hours, or before meals.  \n>  \n>Flash glucose monitors like the one you described are fantastic, but also do not need to be scanned regularly. FMs and CGMs are all equipped with alarms to warn someone if their sugar is changing and to remind them to test.  \n>  \n>You ask if someone really wants to sit there worrying about their disease all night as if it's not something we all do, every minute of every day.  \n>  \n>A diabetic alert dog is NOT a substitute for checking your sugars with an actual meter and there is no way for a dog to report your glucose readings at all  \n>  \n>Next time you lie about having a disability on the internet to be sarcastic, at least do some research.",
          "id": 154,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7294,
      "content": "NAH\n\n\nIt's your home. You can invite whoever you want. You have a no dog rule....You actually made an effort to accommodate him. He hadn't always had this dog. So what was he doing before??\n\nHe can ask and you can say No. Obviously don't be surprised if your friendship changes or goes away completely.\n\nYou're going to get a lot of yt-a votes just because it's a legitimate service dog. But people fail to realize you can't force your dog on private homes. That is your space to do as you please.",
      "id": 155,
      "comments": [
        {
          "score": 2255,
          "content": "Wow a reasonable response, someone who read the entire post.",
          "id": 156,
          "comments": [
            {
              "score": 1316,
              "content": "Im amazed at how many people think OP is the ass here. What the hell is he supposed to do? Dog hair gets everywhere. Like what the fuck lmao. The friend survived without the dog prior, I’m sure he can do it for a few hours.",
              "id": 157,
              "comments": [
                {
                  "score": 2013,
                  "content": "Unless the severity of the disease is progressing. Dog hair can be cleaned up. \n\nGo ahead and say no, your service animals is not allowed in my house, but don’t be surprised when people don’t show up lmao",
                  "id": 158,
                  "comments": [
                    {
                      "score": 807,
                      "content": "He literally did say no, and all of his friends showed up to the party anyway. \n\nThey all knew why diabetic dude wasn't there cause OP has asked them to do more events out to include diabetic guy. The friend group is OK with it",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 222,
                      "content": "Lmao calm down. Only one person didn’t show up.\n\nAnd dog hair can’t just be cleaned up. I have a GSD and I fully understand why friends don’t want him over. Albeit these friends live in apartments so no yard.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Like there isn’t a solution OTHER than having the dog around. Lots of people deal with it without them, and in a social setting there are PEOPLE to help respond. The dog is there to help when not many people are around alone at home.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "As a Type 1 diabetic, if you're relying on a dog to sniff out your blood sugar, you're not managing your diabetes at all. There are people at the party, tell them \"if I get dizzy, I need sugar\". They should be actually blood testing too. \n\nYou should know what NUMBER you're at, hopefully around 100-110. What the fuck is a dog gonna do?",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": ">Unless the severity of the disease is progressing. Dog hair can be cleaned up. \n\n>Go ahead and say no, your service animals is not allowed in my house, but don’t be surprised when people don’t show up lmao\n\nDiabetes service dogs are not a substitute for testing. Diabetes service dogs are not necessary when in the presence of other humans. \n\nThere is no legitimate health-related concern for the friend to insist on the using the dog's service while at the party. The dog is less accurate than monitoring (which should be done even when with the dog) and the dog is less capable at providing assistance when surrounded by fully capable human beings. Diabetes service dogs are for when you are alone.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It doesn’t matter how easily dog hair is to clean up. His house and he doesn’t want it. There is no discussion. Y’all are weird and it’s frightening because you vote.",
                      "id": 164,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "As someone with a dog.... no, it doesn't just get cleaned up. You do your best but it's everywhere forever. As a dog owner you accept it but others don't have to.",
                      "id": 165,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Then the friend better be the person coming back the next day cleaning up all that hair and shit.",
                      "id": 166,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "If his diabetes had progressed he should have a better monitoring device than a service dog LOL. they only have like 36% accuracy. His friend is just mad because he doesn’t like his dog. The people in this post are just mad that he doesn’t like dogs. Dog people really think the world revolves around their dogs wow",
                      "id": 167,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 496,
                  "content": "It’s honestly not surprising considering the huge number of “extreme” dog lovers in this sub. \n\n\nThere was a post few weeks ago where a woman (OP) who dog sat her daughter’s dogs for free for years. The daughter traveled often for her job. Then OP other daughter gave birth to the OP’s first grandchild and OP wanted to spend more time with her grandchild by babysitting. The issue is the grandchild parents didn’t want their new born to be around the two dogs that were described by OP as being “Well behaved but rambunctious”. So OP tells her daughter with the dogs she can’t dog sit them anymore which made the daughter mad. The judgment here was that OP was AH.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 507,
                      "content": "Oh yeah I remember that story. I can not understand why all logic seems to vanish as soon as a dog is mentiones.\nIt's very valid to not want dogs/animals in your home. Yes it sucks for anyone with a service animal but OP tried to compromise.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 227,
                      "content": "This sub has a lot of bad takes. I honestly would never ask for advice here. I only comment to try to sway the comments (against all odds) to a more reasonable level.",
                      "id": 170,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "I’m an extreme dog lover but I’m also not an idiot ❤️",
                      "id": 171,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "That one was one of the most egregious yet. Almost every dog-related advice question here inevitably leads to \"YTA and you should rehome your dog.\" It’s ridiculous.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "i read that one before judgement finished. how the hell did that end up as AH?? free dog sitting for years and she's called an AH for ending it. just that is crazy, but she was stopping the dog sitting for the sake of her grand child!",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Dog worshippers are the worst breed of Redditor, I swear. They're always barely disguised misanthropes, too.",
                      "id": 174,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Was it? I could've sworn I saw she was voted N T A, but I do occasionally find myself digging for more reasonable responses in order to upvote/comment under.",
                      "id": 175,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "It's not dog lovers, it's people who insist that they must be accommodated everywhere and in all things. The most entitled and fragile among us demanding that they be coddled, that they never be told no.\n\nThat's this comment section, added to the self-righteousness that comes when the long arm of the state demands public businesses accommodate the same thing.",
                      "id": 176,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "im a dog lover but i also have an allergic husband, and i think ppl dont understand how hair dont just go away on the first cleaning. It stays a while. After my cat passed away, i immediatly cleaned everything and put his things away; and my husband was still feeling it for several weeks/couple of months after. especially if it is a breed that sheds a lot, and they do almost all get together at his place, it will be like if the dog lives there (hair related). Because the dog is a service animal and is well trained, doesnt mean he's well enough to stop shedding and his hair will go everywhere no matter what, at a way higher level than by cross-contamination.\n\nOf course the yard shouldnt be off limit under teh condition that the friend would clean eventual poop and the dog should be trained to pee in one corner, but... the friend has to stay in the yard too then, and the problem comes the same as leaving the dog away. \n\nOP tried to ask they hang at other ppl's place who wouldnt have a problem, but its also the friends that refused because they all prefer his house. i cant say if his proposition of paying for a medical device for the time the friend spends without his dog is realistic cuz im no doctor, but it shows good faith at least.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 253,
                  "content": "[deleted]",
                  "id": 178,
                  "comments": [
                    {
                      "score": 51,
                      "content": "You realise a service dog isn't a replacement for blood glucose monitoring? They're essentially just an alert system to let you know if your blood glucose changes when you haven't tested yet. Which is exactly what a CGM does, except a CGM is more accurate.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 137,
                  "content": "And it means guests with allergies can't come",
                  "id": 180,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Honestly, my mom wouldn't go to an event if she knew there'd be a dog in the same space (or any furry pet really) because her allergies are so bad. Immediate hives, eyes swelling so much she can't see, nonstop sneezing/coughing. Not fun for anyone there.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "not only that, if they always hang at his house because its the best, it will feel like a dog lives there for anyone that has allergies all the time.\n\nMy husband could feel my cat's \"presence\" several weeks after his passing...",
                      "id": 182,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "OP hasn't mentioned any guests with allergies to dogs...",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I am severely allergic to animals so one guest bringing a dog means I cannot attend an event!",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Well, we know reddit is full of nutters. Sometimes I swear the posts involving dogs are fake and written to see how far redditors will go to defend them.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Dog people are rabid about defending dogs. I am a cat person and can't imagine life without at least one cat, but I freely admit that they aren't for everyone and have a lot of downsides. They can be assholes, they shed, they climb things and knock over expensive antiques...I still love them, but I don't demand that anyone else does. Some people freely express that they hate them and barely get a blink. \n\nBut God forbid you don't like dogs.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "Agreed. And what if someone in his household had a dog allergy? Should OP’s family have to get sick in their own home to accommodate the dog? There is a reason that service animal laws only cover publicly accessible areas. NAH",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Also what if the service dog goes to a house of a person who has a serious allergy to dog. Who wins out in the \"medical necessity\" fight?\n\nOr what if OP was mauled by a dog and too embarrassed to tell anyone he is afraid of dogs?\n\nI think people who don't allow service animals in public spaces haven't got a leg to stand on but this is his house, he should be able to feel safe there and not have to explain why (I know it's not a saftey thing, just saying). \n\nPlus he offered a suitable alternative.\n\nI get why friend is mad, he probably feels attacked, but friend needs to check his privilege in this situation. OP is trying to find a solution that works.",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "What if he was allergic or afraid of dogs? Also, is the friend willing to pay for cleaning after the dog?  He offered multiple alternatives - spending time at other locations (didn’t hear him offering his house), buying a monitor…. It’s his home and his choice.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I’m with you. He’s in his late 30s and got the service dog recently. I’m sure he’s able to manage his diabetes for a few hours without the dog. OP has a right to refuse - he offered plenty of alternatives. Quite frankly he doesn’t need to give a reason for not wanting the dog in his house. It’s his house, and he respectfully erected boundaries and kind, unnecessary, alternative accommodations. NTA.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "not to mention the fact that he should be comfortable in his own home and if he has an aversion to dogs that is completely valid.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Yeah, I am diabetic and think this is fine.  I don't get all the YTA.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Agreed. I had to wade through a whole lot of responses to finally get to one that made sense. If someone doesn't want a dog in their house that's their prerogative and no one should be trying to force them to do otherwise. It's their home, their safe space. They are allowed to decide what makes them comfortable and what doesn't in their own home. Period. End of story.\n\nNTA",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I’m also so glad to see some common sense here! It’s OPs house ffs! People can’t seriously be that entitled that they think just because they have a service dog, they can take it into people’s private homes against the actual home owners wishes🤦‍♀️ \n\nOP made accomodations. If the friend wanted to go that bad he would use a different method for a few hours. I personally wouldn’t have one either because I have two chihuahua’s who would go ape shit! There are reasonable reasons for declining!",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 307,
          "content": "Thats the best answer so far. Every time I read a story about service dogs and private homes people on reddit just seem to ignore everything else.\n\nEven service animals are still just animals, potentially lifesaving but they shed like any other pet.\nI personally would have a problem with the smell. Dunno why but I just can't stand it. My parents used to have a dog. He passed away before I was born almost 30 years ago and I can still smell him on rainy days in what used to be his corner of the garden.",
          "id": 195,
          "comments": [
            {
              "score": 359,
              "content": "You can smell a dead dog? In a garden? From 30years ago? Outside? But only on rainy days?",
              "id": 196,
              "comments": [
                {
                  "score": 146,
                  "content": "Sounds like a ghost dog.",
                  "id": 197,
                  "comments": [
                    {
                      "score": 6,
                      "content": "That would be a good band name",
                      "id": 198,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "from  before he was born. why would you even tho l that whatever you smell is a dog you never even saw",
                  "id": 199,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "The level of unhinged shit from neurotic dog haters in here is insane",
                  "id": 200,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Sounds like that dog desperately needed something called a bath. Poor baby.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 108,
          "content": "I appreciate this response because all these yt-a comments simply ignore the fact that OP went out of their way to accommodate him because he does not want a dog in his private house. That is more than fair.\n\nUnderstood about it being a legitimate service dog, but there are other ways to test your blood sugar levels for the few hours that you go to someone else's house. Just because it's legitimate doesn't mean that everyone has to bend to their will, especially if accommodations have already been offered. \n\nI'll agree with the NAH judgement because the friend is not an AH for wanting his dog and then not coming when he was told no.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "I would never, ever pressure someone into allowing my service dog in their home. OP accommodated the best they could, offering alternatives. \n\nThe hardest lessons to learn about service dogs is that they have drawbacks as well. You have to let them out every so often, they might be unpredictable and get scared suddenly, others may not want them, etc. \n\nYou are not required to let a dog into your home just because its a service dog.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Exactly!   What was the friend doing before to manage his diabetes that can apparently only be accomplished through the presence of a diabetic alert dog?   No endocrinologist who values their medical license would advise a patient to rely on an alert dog for treatment decisions versus the trusted method of blood testing with a meter or using a CGM.\n\nTo be honest, it may not even be a legitimate service dog.   Several studies have shown that \"trained\" diabetes alert dogs can't reliably detect highs or lows and perform worse than meters and CGMs.   One study showed that only a small minority of dogs performed better than random chance at detection, and in another study, the dogs only accurately detected 1/3 of potentially life threatening low blood sugar events.   Their accuracy also plummets overnight because dogs are living creatures who need to sleep, too.    The \"certifications\" are provided only by the companies that sell the dogs.   In many cases they end up being nothing more than extremely expensive ($10-25K) pets and the diabetic person has to rely on a meter or CGM anyways.\n\nIt's entirely up to OP if they want to have a dog in their house - whether a service dog or someone's pet.   It may mean the end of the friendship, but OP is NTA for deciding they don't want the dog coming over.",
          "id": 204,
          "comments": [
            {
              "score": 3,
              "content": "https://www.npr.org/2020/02/12/798481601/the-hope-and-hype-of-diabetic-alert-dogs#:~:text=Press-,Diabetic%20Alert%20Dogs%20Can't%20Reliably%20Detect%20Blood%20Sugar%20Changes,from%20some%20of%20their%20customers.\n\nYou would be correct.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I suspect the yt-a votes come from people who don't actually own homes that are pet free.  Regardless of being a service animal, it's still a dog and not everyone wants to deal with that in their home...and this is his HOME.\n\nthe friend is 38 years old, why can't he do whoever he did for 38 years before getting the dog for a few hours while he visits?\n\nI feel like people can have sympathy for people who have service animals without forfeiting their own rights in their own homes.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "It is funny how it is more acceptable to hate kids than it is to hate dogs, esp on Reddit.",
          "id": 207,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "I agree. This is his home not a public place. However it seems pretty obvious that his friendship will no longer be the same. I don't understand why OP is surprised by his friend not coming over.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This is a good point. The dog is new. He had other options before.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I wonder if the friend offered to do yard and dog hair cleanup. Because service dog or no, having your dog shed everywhere and not dispose of your dogs feces (and rise the urine or something so there aren’t brown patches everywhere) and expect the homeowner to clean up after your dog is poor manners.",
          "id": 210,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4185,
      "content": "I am disabled and have a service dog.\n\nYou’re NTA\n_____\nYour house is your private property, service dogs of visitors have no rights there and are only welcomed with your direct permission. \n\nIt doesn’t matter your reasons why, you 100% have the right to say no just because and your friend should respect that. \n\nThere are laws protecting service dogs with access rights, but they do not apply to certain situations, and this is one of them. \n____\nI would have chosen N-A-H but your friend declined your very generous alternative & still became upset about it. As a handler, he is completely aware he can not bring his SD into a private house without permission.",
      "id": 211,
      "comments": [
        {
          "score": 2574,
          "content": "Yeah, legally NTA.\n\nBut morally, as a friend? YTA.",
          "id": 212,
          "comments": [
            {
              "score": 1347,
              "content": "Morally, still NTA, though. It’s not wrong to not want a dog in your home, especially knowing he’ll be the one to clean up after the hairs. He shouldn’t be TA for setting a boundary in HIS home.\n\nEdited: changed pet to dog.",
              "id": 213,
              "comments": [
                {
                  "score": 14,
                  "content": "Agreed, I love dogs but there are plenty of valid reasons not to allow them in your house, whether it's a pet or a service animal doesn't really matter imo. \n\nI have cats, both of them are terrified of dogs, and one of them has medical issues that are worsened by anxiety. Allowing dogs in my home (even the most well-behaved service dogs) would be cruel to my cats. Not to mention some people have severe allergies and can't be around dogs at all! \n\nI once had an acquaintance show up to my house with their service dog without asking first (they assumed it would be fine since it was a service animal), and it was awkward... We ended up hanging out outside but they were clearly shocked and annoyed that I didn't want their dog inside. After that incident, we always made plans elsewhere since they didn't want to come over without their dog (understandable), and of course I was fine with going over to their place or meeting out in public instead. But this acquaintance continued to bring their dog to other people's houses without asking or mentioning it beforehand, and it caused enough frustration that they slowly stopped being invited... It's unfortunate because people did try to compromise and accommodate, but compromise has to go both ways.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "Id argue morally the dude with the dog is TA for getting upset.  If the house allows no dogs and you need your dog with you then guess what?  You cant come to the house.  Shouldnt be this controversial.  \n\nLike if a party says no kids allowed and I have no one to take care of the kids that day then I just cant come to the party.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "what if he was allergic to dogs? Or had a strong aversion to them? \n\nSure he doesn't have a right to say anything in public, and has the option to just leave when it's in public. But in his own home? He's allowed to not allow pets (including service animals) into his home. That's why he suggested options, \"meet out at a restaurant or someone else's house\". His home is something he worked hard on maintaining and does not want to deal with dog fur, shit and pee in it.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Morally, still NTA. A service dog is still a dog. They can still shed. It'll still need to use the bathroom. OP doesn't want dog hair and poop/pee at his house and that is perfectly reasonable. What if OP was allergic to dogs? Would he still be the asshole because \"oh it's a service dog and this friend NEEDS it there!!\".",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Nope. Still NTA.",
              "id": 218,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 728,
          "content": "This isn’t “am I legally in the right,” this is “am I the asshole.” YTA",
          "id": 219,
          "comments": [
            {
              "score": 147,
              "content": "He not friends with the dog NTA",
              "id": 220,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 546,
          "content": "I have a friend with a medical alert service dog. This dog has saved her life on more than occasion. Leaving him behind would put her life at risk. Am I legally entitled to deny her entry to my house? Sure I am. But I would be a colossal AH if I did something like that. Being legally in the right does not prevent someone from being an AH.",
          "id": 221,
          "comments": [
            {
              "score": 60,
              "content": "No, there are plenty of ways to monitor BG without a service dog. If the guest can’t stand a few hours using alternative monitoring methods, then that’s on them.",
              "id": 222,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Not all service animals ahve this function. In this case it's not necessary! How are people this stupid that they conflate/compare/equate such different scenarios and health issues. This is ridiculous.",
              "id": 223,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 186,
          "content": "You don't have to be breaking the law to be an AH.",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "I think The Dude said it the best - “You’re not wrong, you’re just an asshole.”",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I agree it is his house and he is not legally obligated to have the dog in the house. My issue is the way OP refers to the service dog as this pet that will be running all over the house. The dog will be at your friends side at all times so you only need to worry about pet hair in those areas. As for going to the bathroom, I’m sure your friend would pick up after the dog. Finally, real service dogs are better trained than most kids. You should not even notice them when they are around. \n\nIt is your house so you make the call. But you might try going out to lunch with your friend and his service dog to see how it works before making the call on all visits.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "It sounded more like the rest of the friend group doesn't want to give up OP's super cool house for the alternatives.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "The decline of the generous gift is totally unreasonable. You can’t just pick up a monitoring device at CVS. it’s months of approval/training/learning curve.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I really appreciate this perspective and completely agree. OP respectfully has reservations in his own home. Very fair and has the right to have his boundaries respected, especially as he’s attempting to be accommodating",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3907,
      "content": "Your friend deserves better friends.",
      "id": 230,
      "comments": [
        {
          "score": 1222,
          "content": "Especially when OP says they have spent time making it a place to hang out with friends and family. I'd assume that includes all friends.",
          "id": 231,
          "comments": [
            {
              "score": 902,
              "content": "Just the ones who aren’t disabled,  apparently.",
              "id": 232,
              "comments": [
                {
                  "score": 498,
                  "content": "I am diabetic, not disabled.",
                  "id": 233,
                  "comments": [
                    {
                      "score": 510,
                      "content": "Some diabetics consider it a disability, some don't.  If it significantly impacts your life, I'd say it counts, but I know some people consider disability a dirty word and don't want to be included under that umbrella.",
                      "id": 234,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 280,
                      "content": "If it impacts your life enough to need a service dog, it counts.",
                      "id": 235,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "You're protected under the Americans with Disabilities Act and I don't think people are trying to cut you down by referring to people with diabetes as 'disabled' I don't think anyone's trying to make a dig at diabetics.",
                      "id": 236,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "He has no problem with his friend and no prejudice towards diabetics, as seen in the fact that he’s hosted him for years. He has personal reservations with dogs, which is his right, in HIS HOME. He’s willing to chill with said friend and said dog at many offered alternative places, but doesn’t want a dog in HIS HOME. How is this an issue? Plus, OP has been respectful. No need to attack his character",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "[deleted]",
              "id": 238,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Dunno, whay I see it he is in his rights (morally and legally) to deny his friend entry due to the dog.  Its the same as if I make a party and say no kids allowed.  If you have no one to take care of your kids then guess what, you cant come to the party.  If you NEED your dog with you in order stay healthy then guess what, you cant come to the party if they dont allow dogs.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Op's friends need to reasonably accommodate him as the host as well.  There is no reason Op's friend can't monitor his own blood sugar for a few hours using a test kit.  Millions of diabetics do it everyday, that *don't* have service animals, and I'd bet he's had to do it in other situations as well.  Op's friend has other options, but is choosing to make Op the bad guy.\n\nIf this were a business or something it would be different, but people should be allowed to choose who can enter their home and who can't, for whatever reason or no reason.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Eh his friend needs to be a better friend and realize that the world doesn’t revolve around him because he has a medical condition. Obviously it would be better if he could bring his service dog with him, but people acting like OP is an AH for having a boundary in his own freaking home is wild, especially when he’s willing to pay out of his own pocket to ensure his friend’s health is still a priority.",
          "id": 241,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2595,
      "content": "I can't believe everyone is so polarized in the comments! /s\n\nMy vote is NAH.\n\nThe people saying N T A don't understand that diabetic service dogs do perform an important service for people and aren't just for attention. A lot of people use the dogs to avoid sticking themselves to check or to alert them even faster than the monitors, since dogs can smell so well. (If you pay attention to diabetic people you can smell their breath change when they have a spike/drop, but usually by the time people can smell it, it's about to be critical) The dogs are also trained to get help if necessary, retrieve insulin/meds if the person can't get up to get them, assist with fainting episodes, etc. \n\nThe people saying Y T A don't seem to recognize that you offered a solution, and that it is your own house. You're allowed to make stipulations about dogs or pets coming over as long as you're ready to deal with your friend not coming.\n\nI love dogs, I train rescues and rehabilitate dogs for shelters. I feel very strongly about respecting when people do not want to be around dogs. This dog is a service dog and is most likely highly trained, so it may be worth seeing him in action before doubling down on your boundary. But I also think you have the right to not have an animal in your home you don't want there. \n\n**Anyone who thinks someone is an asshole simply for not liking dogs, does not pay attention to dog behavior.**",
      "id": 242,
      "comments": [
        {
          "score": 867,
          "content": "People are getting so vicious toward OP, when his two reasons are 1) doesn’t want dog hair in the his house (FAIR!) and 2) doesn’t want his kids to play in poop and pee. It’s definitely NAH, ESPECIALLY since he offered to pay for medical monitoring so his friend could still come over.",
          "id": 243,
          "comments": [
            {
              "score": 774,
              "content": "and since he’s fine with going out too, if there’s any assholes it’s the other friends who want to go to his place to save money",
              "id": 244,
              "comments": [
                {
                  "score": 570,
                  "content": "THIS. Why is this not getting mentioned at all? He’s not demanding it be at his house in anyway shape or form and he offered TWO solutions.",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 330,
              "content": "I think a lot of people are reading that he's not super fond of dogs and deciding he's TA based on that alone. For some reason people's asses get really chapped when someone doesn't love dogs.",
              "id": 246,
              "comments": [
                {
                  "score": 37,
                  "content": "I feel like if someone posted something like, “my wife has been hitting me but gets mad when I ask her to stop. I also don’t like dogs. Am I the asshole?”\n\nOP would be called an asshole",
                  "id": 247,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Yeah and people would be commenting stuff like \"she should re-home you lol\"",
                      "id": 248,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "This has triggered the Reddit subset of dog lovers too",
              "id": 249,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I get the dog hair, but the second, he probably has no idea service dogs are trained to go on command, at least just where the handler wants to, in some cases even when the handler wants to.. like if they use airplanes constantly, so the second has a solution.",
              "id": 250,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I agree, I don’t have any friends with service animals but if I did they wouldn’t be able to come to my house (nor I theirs) due to allergies. It sucks, and it’s definitely an unfortunate situation, but it’s definitely a case of NAH",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Not to mentioned so many people have “fake” service dogs (not the friend but I know a few who did it as emotional import so landlord would let it in the building or airlines on the plane). So what stops another friend doing it then etc.",
          "id": 252,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "\"Pay attention to diabetic people\" *if only people actually cared more about type 1 diabetes and the differences between it and type 2, then maybe they'd pay more attention.* I'm lifelong type 1 and sick to death of being looped into the \"diabetic\" crowd. No. When people say \"diabetic\" they think only of *type 2*. Time to start making the differentiation, like you would with the different types of cancer. \n\nAnyway, no, unless you're going up to individuals and smelling their breath from their mouth, you wouldn't be able to tell. That's all bullshit. Some T1Ds may have a sweet smell to the breath when high, but I've literally never heard anyone actually smell it.",
          "id": 253,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": ">Anyone who thinks someone is an asshole simply for not liking dogs, does not pay attention to dog behavior.\n\nMy mother got attacked by a dog when she was a child and has carried that fear for over 50 years. Little lap dogs coming and sniffing her feet is enough for her to lose her shit where we would have to calm her down.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1689,
      "content": "I have a service dog. They are medical equipment but I do understand that they can be barred from personal property.\n\nI'm going to say NAH...\n\nHowever, if my service dog can't come with me, I don't go. I have the service dog for a reason and so going out without him could mean that I am putting myself in harm's way.\n\nSo just be prepared to see less off, or depending on their viewpoint, lose your friend.",
      "id": 255,
      "comments": [
        {
          "score": 548,
          "content": "I guess this is my viewpoint too. Legally, OP has no obligation to let the dog in, and he did offer an alternative solution. \n\nBut, and this is coming from a non-dog lover, is it really worth it to make your friend feel unwelcome? Responsible dog owners clean up poop, and service dogs are well behaved. Unless there’s a serious allergy in the house, the amount of fur shed in a few hours isn’t THAT much. Dogs get their fur everywhere when they live somewhere day in and day out for weeks to months. They don’t drop that much in an afternoon (for most breeds). \n\nMy brother has dogs and wouldn’t come to see us nearly as often if the dogs weren’t included. Having dogs in my house isn’t my favorite thing, but they are well trained, and he doesn’t let them be destructive, jump on furniture, etc. I would rather see my brother than deny his dogs. Now, there are also some dogs I would not extend that courtesy to because they are terribly behaved, but that’s usually not the case with a service dog. \n\nSo is it worth it OP? Is it worth seeing your friend less? Or could you maybe give it a try and see how it goes.",
          "id": 256,
          "comments": [
            {
              "score": 77,
              "content": "I've found it best to just roll with the punches when it comes to friends & family and their personal property.\n\nI love when we're welcome, when friends & families respect his role in my life, follow the rules I've laid out (no petting, no pics w/o my say-so, no distracting), and know that when he's not On Duty (officially, he is always working) he is free to play and be silly.\n\nI love that. It makes me feel less like a freak of nature \n\nBut I respect people's personal decisions for their property. If I want to be respected, they deserve the same. I still extend invites to my home or restaurants, parks, events, etc.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "There are options here too. \n\nMost service dogs are trained when and when not to go to the bathroom, ask your friend to have the dog relieve itself off the property.\n\nThey can look in to a shed defender suit for the dogs. It's basically a stretchy suit that covers the dog everywhere except for the tail, head and paws. Would it stop all the hair from shedding? No, but it will drastically lower the amount that can shed.\n\nIf the problem was the dogs behavior, I'd understand, but to tell a friend they can't bring a life saving thing with them because it will make a little bit of a mess makes OP a bad friend.",
              "id": 258,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1202,
      "content": "As a service dog handler, NTA.\n\nHandlers are entitled to bring their service dogs to public places. He ADA protects things like stores and restaurants. \n\nYour private residence, your rules. You can ABSOLUTELY say no dogs. And you offered extra help.\n\nYes, there's no magical machine for blood glucose. But hey, buying an extra test kit, setting timers to check it regularly, keeping an eye on the friend and making sure he eats and drinks water... there's several things that can be done. Yes, service dogs are classified as medical equipment, but they're living creatures that need breaks, meaning the handler has to be able to function without them for at least a few hours a day.\n\nWith decent adult supervision in a safe space, it's perfectly reasonable for him not to bring his service dog.",
      "id": 259,
      "comments": [
        {
          "score": 431,
          "content": "I think the offer to accommodate his diabetes in a different way shows that he’s not being discriminated against. The friend and other friends who refuse to gather somewhere dog-friendly are just as much responsible for his exclusion due to the dog. Can the friend host at his home?",
          "id": 260,
          "comments": [
            {
              "score": 24,
              "content": "That's not a solution. This person can't host every event, nor should OP never be allowed to host.\n\nA diabetic alert dog is not a replacement for self-monitoring glucose levels. They're just an additional tool to help.\n\nAn active, lively party is not a good place for a dog to smell incredibly faint chemical signals in breath and sweat, and would probably be less-than-effective at a party",
              "id": 261,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "A diabetic alert dog is something you get to be used in conjunction, not replacing, regular blood sugar management.  The diabetic isn’t monitoring their blood sugar any less than they would absent the dog.  The main help they provide is being able to wake up the diabetic, so they don’t slip into a diabetic coma in the middle of night.  At a party, surrounded by people, the dog simply not necessary.",
          "id": 262,
          "comments": [
            {
              "score": 36,
              "content": "This was my thinking. Diabetic service dogs are for low blood sugar, which isn't likely to happen anyway in the setting of a snack- and beer-laden Superbowl party. And even if it did, there are plenty of people there to help the friend if he started feeling unwell. The dog is absolutely a great resource, but the friend should also be able to function for a few hours without the dog in a group setting like this.",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "This exactly! Dogs (much less service dogs) are not common in my country, and people can get by. So I don't understand the absolute need for the dog to be at his friend's house. NTA.",
              "id": 264,
              "comments": [
                {
                  "score": 12,
                  "content": "The value I really see in them is alerting you to your sugar getting too low while sleeping.  There’s no guarantee you wake up in time to catch it, so a dog is a nice security blanket, even if you have a cgm with an alarm set.",
                  "id": 265,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Exactly!\n\nI think everyone else that commented does not understand how things work for diabetics. \n\nThey see service dog and think omg why would you deny you friend that (clutches pearls), you are no friend.",
              "id": 266,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1011,
      "content": "People on Reddit so concerned about whether or not they’re assholes, they don’t ask if they’re being a good friend.",
      "id": 267,
      "comments": [
        {
          "score": 153,
          "content": "THANK YOU! In my opinion, this is less about whether OP is an AH or not and more about whether he's a good friend or not. In my opinion, he's not being a good friend. While a blood sugar monitor could help, diabetes is very unpredictable and in the time it takes for his friend to use the monitor, his blood sugar could either jump way up or plummet way down, either of which could be life-threatening. A dog is able to detect the change in sugar levels as soon as they happen, which means they're able to alert their owner to the change right away and the owner can take the proper precautions to make sure they stay safe and you know, alive.",
          "id": 268,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "You hit the nail on the head, dude.",
          "id": 269,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "Oh my God yes. What I say aloud to virtually 90% of NTA verdicts",
          "id": 270,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "AIBAGF doesn't have the same ring to it",
          "id": 271,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Legally NTA, as a \"friend\" YTA",
          "id": 272,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Best comment. What an awful friend.",
          "id": 273,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Bingo! Missing the whole “friend” vibe here.",
          "id": 274,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Exactly. Sure, OP has every right to not want a dog in his property, but to me that also means that theyd rather not be this persons friend than to make a small accommodation for his disability",
          "id": 275,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Like he is NTA if we directly answers ops wuestion(the title) but in general he is an AH",
          "id": 276,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 496,
      "content": "NTA, you understand why he has a dog and even tried to accomodate him the best you can. BUT you have every right not to welcome a dog in your house, service or pet doesn't matter. You house is not a public place, so you aren't under any obligation to have a service dog around.",
      "id": 277,
      "comments": [
        {
          "score": 131,
          "content": "I agree, dude even offered to buy him a medical device that monitors his diabetes. My mom has one, it works awesome. I love dogs, but I understand if others don't.",
          "id": 278,
          "comments": [
            {
              "score": 4,
              "content": "My friend has one that does NOT work awesome. They don't always work all the time or the dude wouldn't need a service animal. Some device he can buy from Walmart is 1000000000% not the same.",
              "id": 279,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}