{
  "post content": "I (18f) live with my dad, his wife Hannah, Hannah’s daughter Grace (20f), and our younger brother (8m). Grace really only comes to stay on the weekends since she’s in college, and this time she brought her boyfriend Issac (21m) with her.\n\nI’m biracial, my dad is white and my mom is black. Honestly I don’t look anything like my dad so most people don’t even think I am mixed. We like to joke that I got his personality instead of his looks.\n\nPeople tend to say offhanded stuff to me about how I don’t look the way they think I’m “supposed to”. I’m kind of used to it especially since my dad ended up married to a woman that is also white so like every time I’m with them it obviously looks like I’m the odd one out. I’m not afraid to correct people, but sometimes that gets exhausting and I’ll just play dumb instead.\n\nGrace and I had planned to get lunch together and her bf Issac ended up coming along with us. She wants him and I to get to know each other better since she really likes him, so I figured that’s why she brought him.\nWhile we were having lunch, my mom’s side of the family was brought up, and then Issac said that it must’ve been a shock to my dad at least for me to end up so dark since most mixed kids are lighter in complexion than I am. But then he said that at least I ended up with “good hair” so I didn’t lose out completely.\n\nGrace didn’t speak up and say anything to him about it, so I pretended not to understand what he meant and asked what was so good about my hair and what it was he thought I was losing out on anyway.\nHe got flustered and said “well you know…most girls with your skintone have curlier hair.”\nSo then I asked why he thought my hair was good just because it wasn’t that curly. He said he felt it just looked nicer. So I asked why he thought that textured hair didn’t look just as nice. He kept blubbering out excuses and digging the hole even deeper for himself, and finally Grace told me to cut it out and leave him alone.\n\nI paid for my part of lunch and left after that. I didn’t tell my dad or Hannah what happened, but it’s obvious enough that Grace is mad at me. My dad asked that she and I solve whatever the problem is, because he hates seeing us be so tense around each other.\n\nGrace ended up telling me that she was pissed because I made her boyfriend look like a jerk by playing dumb. I told her that I didn’t have to make him look like a jerk because he already was one, but she said that I drew the problem out more than necessary and made it worse than it needed to be when I could’ve just told him that he f’ed up.\n\nI mean I could have done that, but I don’t think it should be my job to, and plus I feel like it was probably more effective to get him to explain his logic outloud rather than have me tell him he was being a jerk.\n\nGrace is insisting that I should have just told him point blank, and bc I didn’t, she thinks I’m an AH.\n\nEdit:\n\nMy dad just texted me to ask if something happened at lunch with Grace’s bf so I’m pretty sure when him and my stepmom get home later, I’m going to tell him what happened since it seems like he already knows something did.\n\nAlso, I do wanna say that my reluctance about telling my dad and Hannah isn’t because I want to protect Issac or anything, it’s because Grace is my step sister and I care about her. I know she really likes this guy and I really only feel bad bc even though I know I didn’t really ruin anything for her, it feels like I did. The situation just sucks I guess.\n\nEdit 2:\n\nI ended up telling my dad and Hannah what happened when they got home, and they both told me that I did absolutely nothing wrong. Hannah said that she would talk to Grace about it, and my dad basically said that Issac was no longer welcome anywhere near our house.\n\nDad also gave me a mini motivational speech where he reiterated that I look perfect just the way I am and that colorist/texturist/racist bigots have no place in our family or our home.\n\nGrace drove back to campus a while ago so I guess Hannah is gonna call her later to talk with her about what happened.",
  "id": 1,
  "comments": [
    {
      "score": 12857,
      "content": "Hi there. I am also biracial (black and white) and was raised by my blond haired blue eyed white mom. So i can empathize with having to deal with very frequent micro (and sometimes macro) aggressions. Playing dumb is often the most effective way to get people to comprehend their own prejudice.\n\nGrace is angry because she has to either admit she is willing to accept that her boyfriend has these beliefs (unfortunately common for people to think this way), she and her boyfriend may both need to work on their own beliefs, or maybe end things (? Probably not unless this was a tip of the iceberg comment).\n\nAnyways!!! Good for you. NTA.",
      "id": 2,
      "comments": [
        {
          "score": 9038,
          "content": "OP, It is not your job to educate white people when we are being racist.\n\nIt is our job to educate ourselves and each other. \n\nIf Grace wants to point a finger, she should look in the mirror.\n\nNTA",
          "id": 3,
          "comments": [
            {
              "score": 1844,
              "content": "I love that you said that. I have a friend who is black like me, and told me how a white female at her job keeps asking to touch her hair. No matter how many times she says no the girl continues to ask. Her coworker had even said “your hair is calling me, I need to touch it”. My friend has now reached the point where she feels she should talk to her and really explain why she said no. And I keep telling my friend it’s not her job. Her coworker is a grown women and should know that no means no. And that it doesn’t matter if she doesn’t get why it’s wrong because she’s white.",
              "id": 4,
              "comments": [
                {
                  "score": 1447,
                  "content": "The most your friend needs to explain is that if the white chick touches her hair or any other part of her body, HR will hear about it.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 583,
                      "content": "I have told my friend this so many times. I would’ve been called HR. You have 1 time to ask me again after I said no. She’s just really nice and thinks that she should help this coworker better understand the situation. But it’s not our job as black people to explain it.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "HR should hear about it now.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "The first time she asked again after being told no I would have said “No is a complete sentence. If you ask again you’ll be reported to HR for harassment. Back off.”",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "HR should have already heard about it, friend is being harassed.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Actually she should explain that she already said no multiple times and she will go to HR if she asks again because at that point it is harassment.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "And also if this woman keeps harassing her about wanting to touch her hair : no means no.. Your friend was clear, and this other woman is 100% harassing her at this point, which is a big no-no in any professional environment, and HR involvement at this point would be more than justified! Hostile work environment and all that",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 115,
                  "content": "This is appalling.\n\nI used to work in a Scottish high school. We very rarely had black pupils at the school. (There is some diversity in the local population, but not a great deal. Minorities in my area tend to originate from Eastern Europe or Asia.) At one point a new boy came to school. He was French and the only black boy in the school. A lovely boy.\n\nHe came in one day with his beautiful Afro cut off. That week we had a parents' evening. The boy's mum went to see his French teacher. (Yes, when the boy was in French, he was actually concentrating on his English.)\n\nThe teacher came to see me in some distress. (I was a middle manager at the time.) The mum had told her that the boy had cut off his hair because he was sick of other pupils touching it.\n\nI still feel sick when I think of it. Goodness knows how the boy and his parents felt. :(  \n\n\nETA I also feel a great deal of shame that none of us realised what was happening.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 30,
                      "content": "That poor boy! And his parents, too, in a new country, adjusting to everything else.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "Your friend needs to report her co-worker for harassment. She can tell management that the coworker keeps asking to touch her and it is making her very uncomfortable.\n\nMy ex-wife is black and I knew better than to ask more than once about touching her hair. Honestly, I never even saw her natural hair for the first few years as she always wore braids. So, I made sure we had some kids so I could touch their hair. =D",
                  "id": 14,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Lol I’m trying to get her to report the coworker. My friend is actually wearing braids, and I think it’s the first time her coworker has seen them in person. And that’s why she keeps asking to touch them. But no means no. And I find it hilarious that your ex made you wait years to see her hair.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 59,
                  "content": "I am white, and grew up pretty sheltered, not really being aware that racism still exists. Then I got a job working with black women from many different countries and backgrounds, and saw it for myself. I was blown away. We had conversations about how racism has affected their lives, the ways they are treated that I can’t even fathom. This behavior falls into that category. Please insist that your friend speak to HR. This woman either needs to stop, or lose her job. Where I worked, there would be no tolerance for such behavior.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 32,
                      "content": "I moved into a black community as a white person and lived and worked there for almost 10 years. Like you, I was HORRIFIED with some of the things I heard and saw.  My neighbors and I would often take the subway into center city and shop, walk around, hit up a bar, etc. The way they were treated compared to me really opened my eyes. \n\nI agree - this hair bullshit falls into the category of racist crap and needs to be addressed with HR",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "my hair doesn't even know that woman and it is calling to her to go fuck herself!!",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "WHAT THE HECK. That coworker over the age of 10, right?  \nWhen I was in college, I went to Mexico on a University organized research trip. We spent a month in one of the major cities (Morelia, not a huge tourist destination), and my curly, ass-length blonde hair got a LOT of attention. But only kids begged me to touch it. A few other people asked respectfully after we talked a few times, and I usually let them because there wasn't much damage casual handling could do to my hair, unlike other natural hair types. But I've heard stories of people trying to bury their fingers in friend's afros, and it's always just...WTF? Coworker needs to grow the f up, and also learn what \"no\" means.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I'm also blown away by people who are like, \"Oh, but I HAVE to touch it!\" When I was a teenager, my family spent a month in Barbados, where the population is about 90% Black. Somehow, despite being white folks from the Prairies, we all magically managed to keep our hands to ourselves and not go around grabbing at everybody's hair. \n\nSometimes people would stare at me (might have been my long straight hair, might have been that I'm super pale) but nobody asked to touch me, let alone waltz up and start playing with my bangs. Even the little kids who were clearly just curious tended to get scolded by their parents for staring.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "When we were kids, my sister and I naturally had super-straight, super-shiny, platinum blonde hair (what older people call \"tow heads,\" although I don't know why that is). I was 12 and my sister was 9 when we took a family trip to Puerto Vallarta, Mexico, and we were *constantly* being petted and stared at by locals. Like, even the servers would touch our hair after taking our orders. It was creepy and dehumanizing and I literally had that experience for only 10 days, almost 35 years ago, and it STILL makes me shudder.\n\nTo have to endure this frequently and randomly as part of everyday life -- or to have coworkers or others who refuse to stop asking to touch? I'm impressed with the grace and fortitude shown by so many with natural hair. I think I'd carry a whistle and just obnoxiously blow into it every time someone did that to me, because they should know better. And if they refuse to do better, they should be embarrassed.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "This makes me feel so icky. Your hair is calling me I need to touch it??? People are not petting zoos! How disgusting",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Speaking as a different kind of minority (usually invisible), we don't *have* to explain, and it's absolutely fucking exhausting being asked to (implicitly or explicitly) but sometimes a short explanation really is the quickest and most effective way to shut an asshole up.\n\n\"Given that some of my ancestors were literally put in fucking zoos, Brenda, no you may not pet me like a cat.\"\n\nIt sometimes shocks people out of their entitled asshollery long enough to realise they need to *drop it*.\n\n(And then go to HR)",
                  "id": 23,
                  "comments": [
                    {
                      "score": 7,
                      "content": "My friend told her “black girls don’t like it when people ask to touch their hair” She told her that the very first time this lady asked. And it has done nothing to stop her from asking again.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "[deleted]",
                  "id": 25,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I worked in the one year old room in a predominantly white daycare. When we got a little with the most beautiful curls all the kids wanted to touch and the first day she was surrounded by the other kids. This only lasted a week as we kept reminding the kids to keep their hands to themselves and that we don’t touch friends. \nIf one year olds can get it then so can grown ass people.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Right? I was just about to make a similar comment. Who are these nutjobs going around trying to touch people’s hair? It’s just so weird and invasive. It would be like asking someone, “Hey, can I feel your skin?” Or “Can I smell your shirt?” Just WEIRD. People need to stop doing that. You’re not at the people zoo.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I'm hispanic and white. \n\nAnd this used to happen to me all the time! I have no idea why people were so obsessed with my hair! I actually had to get it thinned out, like a lot. Now I have it shaved into a Mohawk because of how heavy it gets and I got sick of thinning it out every few months. But when I was younger, people were constantly approaching and asking to or just out right touching my hair. To the point that I started wearing my hair up in buns or under hats. \n\nGah! It's so weird! I've asked to touch hair only when discussing products with the person, like hold for curls, leave in conditioners, etc. But even then, I've been pressured into touching their hair more by them, than I have out right asked to do so..  idk, it's weird to me.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I'm white and I had a mohawk for a while and the amount of people who would just touch it!! This is in the UK too where we aren't big on invading personal space. I think maybe because I'm short, and with the average 'tall punk with mohawk' you'd need a ladder to pet their hair?",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "i think thats why shes mad now, because she sees that flaw in her BF and is at a crossroads with that info.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "NTA. The boyfriend said some extremely racist trash as “a joke”. But it was predicated on racist hateful notions he has about blackness. It is **NOT** your job to coddle those people. And your sister does NOT get to tell you how to respond to other peoples racist nonsense. \n\nAnd it doesn’t speak well of your sister that she’s more concerned about coddling their racist notions than being decent towards you. \n\nYou didn’t ruin anything. His racist comments did. I don’t know if her boyfriend is a racist or not but his comments were.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "And sometimes it can be so tiring to have to do this, especially when seemingly smart people act obtuse. Sigh. \n\nNTA.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "\"Read a book or something,[...] just don't burden *me* with the responsibility of educating you. It's incredibly exhausting.\" - [Socko](https://youtu.be/oDQXFNWuZj8)",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "That's a good point. If Grace wanted OP to stop giving Isaac more rope to hang himself with, Grace had plenty of opportunity to butt in and tell him what she wanted OP to tell him. Or even change the subject and say, \"I'll talk about this to you later.\"",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Op is NTA 100%\n\nLook - it's not her job but someone should educate these types because the comments/ joke comes from a place of ignorance and immaturity. If you don't educate them they think its okay perpetuating the cycle.\n\nI grew up in a world where very few anyone with darker skin than light brown lived so I want racist I just didn't know. Thankfully when I was 20 my coworker became my befriend. He was black and he heard a lot of stupid shit I would ask. I explained I never was around so I just had questions. He taught me so much... Too much probably but it was culturally enlightening and I get a rare education that most whites could use. I looked whitish but am mixed euro and indigenous and I get comments on my looks it times a well. Of people don't speak up, we are saying its okay. \n\nI love that she did what she did because this generation thinks its okay because they are somehow more enlightened. They aren't.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP definitely isn’t the asshole. Grace is speaking from the perspective of someone who doesn’t seem to have heard “it’s not that serious” when pointing out a micro-agreesion. Having people try to find logic in there words where there isn’t is the best way to deal with these things imo.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly. She shouldn’t have even had to play dumb- grace should have said something before anyone did.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Solid mic drop",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 234,
          "content": "Couldn’t have encapsulated it any better! A lot of people think by virtue of having close relationships with people of color, that they are somehow exempt from exhibiting racism or bigotry. They think to themselves as it’s a hard line that they would never cross, until they’re confronted with people who look like them that they also care about doing that exact thing.\n\nGrace doesn’t know if she should stand on her morals or excuse his behavior because she likes him. And lashing out at you as the *cause* is allowing her to really avoid think of this.\n\n**Or,** alternatively, she doesn’t actually think it’s that bad. She thinks of you as the exception, and that things affecting the black community. Don’t really apply to you because you’re part of her family, her white family, and she does not have to deal with those things. \n\n**She has 0 frame of reference for empathy for OP,** so she’s mad at you for being mad instead of being mad at the root cause.",
          "id": 39,
          "comments": [
            {
              "score": 46,
              "content": "THIS...OP I'm so sorry because I know how much you care for your stepsis Grace. BUT she's demonstrated that is ok for her to have others say racist things. She won't speak out and she'll be upset with you if you do correct them. She's minimizing what's happened and in fact standing with the racist. I hope this dies down and she realizes how wrong her thinking and actions were. But if not, you have a sis who seems to think racism isn't a big deal, which kind of makes her racist also.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": ">Playing dumb is often the most effective way to get people to comprehend their own prejudice.\n\nI guarantee he learned his lesson because of this much more than if you just told him he was wrong and you kinda pointed out to Grace that her boyfriend may hold some ignorant beliefs.",
          "id": 41,
          "comments": [
            {
              "score": 94,
              "content": "exactly. *telling him* it's not an okay thing to say is something he can easily brush off, or say you're preachy about nothing.\n\nactually making him explain forces him to think about what he said, that's the absolute best way to highlight ignorance.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "This, OP. I am whiter than Hellmans Mayo, but Grace SAT THERE AND SAID NOTHING. She didn't jump in and say, \"Isaac, why are you insulting black hair to my biracial sister?\" or \"Isaac, my sister's skin color is beautiful.\" Instead, she kept quiet and valued this guy and her relationship with him over correcting his racist shit.\n\nGrace didn't step in to protect you (and I assume if she's been your step sister long enough that y'all are close, she knows better). She doesn't deserve you softballing some guy she might someday be bringing into the family.\n\nAlso, absolutely tell your Dad and Stepmom. They should know that Grace is siding with her racist BF. \n\nNTA",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "When Black people use phrases like \"good hair\" and \"good features\" it's a reflection internalised racism. When white people use it you leave out \"internalised\".",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I'm kind of the opposite, I was the blonde-haired, blue-eyed, pale-skinned weirdo (genetic throwback) while everyone else in my family is darker colored (mom is Hispanic, sister looks exactly like her, stepdad has black hair and brown eyes, step brothers have dark hair with blue eyes). I got a lot of \"milkman's daughter\" jokes, \"dumb blonde\" jokes (being the only blonde in the family), and \"the only reason I didn't ask for my real daughter in the hospital was because you have the family birthmark\" jokes. It doesn't feel good on any side, but holy hell my jaw dropped at OP's sister's bf's ignorant comment.   \n\n\nOP, you handled this like a champ. Polite, but also made him have to think about what he was saying, all while letting him make a fool of himself. If you had started screaming at him, all he would have \"learned\" from the incident was that you're \"sensitive and prone to overreact.\"  \nNTA.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I’ve found in every situation, rather than fighting with someone about what they’ve said, making them explain themselves and realize what they said or did is way more effective at getting them to see what they did wrong.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I find the “playing dumb” technique to be the absolute best way to handle any situation where someone says something racist/classist/misogynist/ableist/homophobic. If they truly are just ignorant about why what they said is wrong (rare), it provides an opportunity to educate. The other 99% of the time it forces them to have to explain and that uncomfortable feeling is one they won’t forget. There’s always the option to get angry and call out the behavior, but angry shaming tends to push the person even further into whichever -ism they’re into, is a safety risk if they get angry, or just gives them more to feed the stereotype (as in the “angry blank woman” or “femi-nazi” etc). Questioning can be done very calmly and sincerely in a way that forces them to second guess themselves. \n\nReally I guess that’s just a long winded way of saying well done, OP! You handled that situation beautifully!",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I’m in the same situation, biracial with a blonde-haired blue-eyed WASP mom. And you nailed the proverbial nail on the head with this comment!",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA.\n\nIt’s not on you to ease the path of people determined to be racist towards you.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3050,
      "content": "NTA and well done. Isaac was being racist, and he made himself look bad.",
      "id": 50,
      "comments": [
        {
          "score": 625,
          "content": "Exactly! You handled it brilliantly, OP. \n\nIf you told him he was being a jerk, he would just throw it back at you...and your sister would still be mad.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 447,
          "content": "This.  Have Grace read this.  Her BF is racist and he SHOULD be called out and be uncomfortable about it.  And if she is okay with having a racist BF, SHE should be called out and be uncomfortable about it.\n\nNTA",
          "id": 52,
          "comments": [
            {
              "score": 102,
              "content": "Yes, totally. NTA. You gave him a way out to apologize or explain himself. It's not your fault he didn't take the opportunity to acknowledge what he said was racist.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "Yes exactly OP handled the situation very well imo plus you didn’t make him look like a jerk he did that all on his on and one last thing but if you have a good relationship with your dad then after your sister and boyfriend go back to school sit down with your dad and explain what was said and what EVERYONES reaction at the table was I say that because your sister not saying anything to him when he made those remarks but going off on you for making him explain himself is telling and if he’s any kind of good dad he should maybe not understand where you are coming from (due to him not having the same experiences as you) but he should at least be able to empathize with you and understand your sister and her boyfriend were in the wrong - I say wait until they’re back at school so that way you can have an uninterrupted conversation with your dad and your able to explain your feeling in this matter without being yelled by you sister again \n\nAlso NTA",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Yep. OP, Tell Grace if she likes racist guys that's on her. You are going to worry about letting them embarrass themselves!",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yes. Also, if you'd just told him 'dude, you're being a bit racist' he'd have gotten all defensive, and been a dick about it too. There was literally no good way out. \n\nHonestly, the way you handled it, was, IMHO, the best, easiest way for him, to see and, hopefully understand just exactly how/why what he said/thinks/believes is wrong. \n\nThere was no good way for him to stop, once he started - and especially once he kept digging in. He can certainly apologize. 'Know better, do better.' - thats how he can grow, from here. That's how your step sister can grow from here. But you did nothing wrong. NTA.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He was bad and he should feel bad.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Really if Grace wanted it handled a different way she was right there and could’ve jumped in at any moment. She’s mad at him but deflecting it to you do she doesn’t have to be mad at him. \n\nNTA - hopefully the boy learns and improves or Grace dumps him",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1818,
      "content": "You're definitely NTA. Grace's boyfriend is a racist. It's \"diet racism\" but it's still pretty fucking racist. And Grace is the bigger asshole for not calling it out herself. OP should call Grace out for being an enabler.",
      "id": 59,
      "comments": [
        {
          "score": 381,
          "content": "I just did a spit take with my coffee at “diet racism” 🤣",
          "id": 60,
          "comments": [
            {
              "score": 133,
              "content": "[https://www.youtube.com/watch?v=xdyin6uipy4](https://www.youtube.com/watch?v=xdyin6uipy4)\n\n&#x200B;\n\n(I swear it is related to comment and not a rickroll, if it is a rickroll i legally own you £100)",
              "id": 61,
              "comments": [
                {
                  "score": 71,
                  "content": "Omg. “The official beverage of the Washington Redskins.“",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Hahaha I think I am going to use that term",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "\"Racism lite.......  Now with less oppression!\"\n🤣🤣🤣",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "I’m not black but in a sense it almost seems more obnoxious because rather than confronting or ignoring a Capital R racist, they whine and accuse people of being over sensitive or not being able to take a compliment and acting like the suggestion that they’re racist is so much worse than actual racism.",
          "id": 65,
          "comments": [
            {
              "score": 28,
              "content": "It would become “I was just complimenting your hair and saying it was nice! Why do you have to bring race into everything over an innocent compliment!” 🙄 must be exhausting to have to jump through all those hoops just to pretend they’re not racist",
              "id": 66,
              "comments": [
                {
                  "score": 2,
                  "content": "And yet they take more offense to pointing out their racism than people do when they are on the receiving end of their racist comments.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1376,
      "content": "NTA. You did him a big favor by humiliating him and forcing him to reflect on his racism. If you'd called him a jerk he could've just got mad at you and moved on. You dragged it out and he's going to keep feeling it. Maybe it won't change him, but there's a chance that it will.\n\nYou don't owe him anything, but you went above and beyond in giving him an opportunity for personal growth. Whether or not this was your intent, you were exceedingly generous.\n\nHopefully he learns from it.",
      "id": 68,
      "comments": [
        {
          "score": 982,
          "content": "Yeah I really just figure that since most people don’t like being told they’re wrong, he’d probably be more willing to understand he messed up if he listened to his own logic while trying to explain it.\n\nPlus I mean, he is my step sister’s boyfriend so it’s not like I wanted to make a scene in the middle of the wing shop.",
          "id": 69,
          "comments": [
            {
              "score": 193,
              "content": "Yes. Sometimes clueless people make racist comments and they need to be shown that by being made to explain their “joke”:\n\nThen they feel bad, and their girlfriend (your sister) might feel bad for them, but they should embrace those bad feelings! They are the natural feelings of empathy growing in their chests. Don’t stop the process now by apologizing. Just say you’re glad they see now that the comments were racist, and you hope they won’t say that kind of thing in future.",
              "id": 70,
              "comments": [
                {
                  "score": 22,
                  "content": "When I was in college, my best friend really was black. It took someone taking me aside and explaining the implications of 'proving' my lack of racism by saying it. I took it in and understood, and did better. \n\nI hope OP keeps pushing back, some of us will listen and learn.  It is NOT her job to teach us, just to call us on it.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "You did good, kid! Show them this thread",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "The person who should have explained that he'd screwed up was Grace. Grace knew what he was saying wrong, and rather than step in a gently correct him, because maybe his (inexcusable, to be clear) comments come from ignorance rather than maliciousness, she left you to handle it, and you did. In your way.\n\nPoint out to Grace that if he does feel embarrassed or bad now, it isn't because of what you did but because he actually had to hear his own bullshit out loud. It's hard to run from how wrong you are when someone makes you say it clearly and out loud. This is not a you problem, it is a him problem. \n\nIf Grace wants someone to educate her boyfriend, she should do it. If she doesn't like what he said and feels it makes him a jerk, she should reevaluate who she is dating, rather than being mad at you. It's her relationship, her boyfriend and her problem. It is not your job to educate every fool who thinks there is something wrong with curly and/or textured hair.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "NTA, it's wild to me that for so many, pointing out bd behavior is worse than behaving badly.",
              "id": 74,
              "comments": [
                {
                  "score": 23,
                  "content": "It’s a real problem.  Even people who are overtly racist or sexist tend to get away with their behavior because other people won’t call them out because “that’s just how he is”.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "The way you handled it was definitely the best way for him to understand and reflect. People don’t usually grow and change when others tell them that they are wrong without helping them understand why they are wrong or challenging their thought process. \n\nIt’s interesting she’s upset with you instead of her boyfriend.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I'm SO HOPING that there's an update where Isaac reaches out and says, \"Hey, I didn't realize I was being an asshole, but now that you made me explain my comments I realized what's wrong with them and \\[since this is my fantasy here\\] I am working to confront my racist thought patterns and work through them to be a better person. Thank you!\"\n\nOP, NTA. I am guessing Grace is also mad at her boyfriend; hopefully they can talk through it and she stops blaming you.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "> he is my step sister’s boyfriend so it’s not like I wanted to make a scene \n\nYou flagged up a disturbing issue a) about his beliefs and b) about his comfort in expressing them. You did them both a favour, but your stepsister is angry at the wrong person. She and he both need to not pass on this opportunity to reflect on themselves.\n\nHe basically said \"you're lucky you don't look too black\". In what world is that an okay thing to think and an okay thing to say? None of this is on you to resolve. They both owe you serious apologies. He for what he said and your stepsister for not shutting it down the moment he said it.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Sometimes people just don't get what it's like to be in that situation. Calling people out directly can sometimes lead to more direct aggression, more stereotypes, doubling down, or who knows what else. Hopefully, your stepsister can understand why you would choose to navigate around that and try to give him a chance for self-reflection instead.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "NTA. You did good. Please give us an update when you tell your dad. Idk why but I really want to know what his reaction is",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I feel like a distinction needs to be made between bad and clueless here. I grew up in a very white community where plenty of decent people have no idea that they are racist. They sincerely don’t intend to be and would be horrified if someone brought it to their attention.\n\nYou might object by saying that in this day and age there’s no excuse, and you’d be somewhat right. But we don’t comprehend what we can’t see. I had to see the light - it wasn’t hard and didn’t take long - but I don’t judge my small town family members for still being somewhat in the dark. They’re quite certain they aren’t racist, after all, so they accept alternative explanations. Good people can be wrong, but if they really are good people they’ll be open. As I’m sure you already know. \n\nYou probably don’t know this guy well enough to know whether this is racist racism or clumsy clueless casual racism, the kind that’s abundant in the air and drinking water in this country. The latter is curable - a little exposure will often do it. My “of course I’m not racist” family members adore my transrace adopted kids, but I’ve seen the shock of “I’ve never thought about it that way” cross their faces more than once. \n\nIt isn’t your responsibility to educate. And I don’t agree that you should have told him he f’d up - that’s not your job. But I can’t tell from your post if your sister is right and you pushed it a little too far - it may have been more effective if you’d stopped once he was sufficiently uncomfortable. Sometimes a small nudge is enough - you want to stop before he starts thinking “wow what’s her problem?” because that lets him off his own hook. \n\nNTA, by the way.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 637,
      "content": "NTA. What you did is called the Socratic method of teaching & there’s a reason it’s still practiced in classrooms thousands of years later - that shit works. Grace also needs a dose of it regarding why she thinks you have a duty to make racists comfortable.",
      "id": 82,
      "comments": [
        {
          "score": 128,
          "content": "My niece is a genius. At a mere three years of age she knows of the Socratic method. The other day we had a great discussion with her asking me 'why?' to every answer I gave.\n\nHaha no but seriously I love Socrates. That man was a genius.",
          "id": 83,
          "comments": [
            {
              "score": 3,
              "content": "My daughter is 4 and has started asking me how everything is made. If I don't know she then gets mad that I don't know. 😂 Geez kid I'm not an encyclopedia.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Why?  \n\n\n/s (?)",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This works with sexist and misogynistic “uncles” too. At least it did for me with my ex husband’s family. I played dumb and asked them to explain a very clearly sexist joke. Their floundering is still a highlight in my memory reel. I’ll likely smile at it on my deathbed… sorry, not sorry.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 540,
      "content": "NTA. If Grace wanted it just said outright, why didn't she speak up?",
      "id": 87,
      "comments": [
        {
          "score": 367,
          "content": "I guess she felt like it was my place to say something about it since he said it to me. I wouldn’t have been nice about it if I had handled it directly though so I think that would’ve just made it worse.",
          "id": 88,
          "comments": [
            {
              "score": 316,
              "content": "Silence is complicity. NTA.",
              "id": 89,
              "comments": [
                {
                  "score": 5,
                  "content": "Ayo so true.\n\nIf you're not anti-racist, you are upholding racism.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 205,
              "content": "BS. She introduced that idiot to you, she should have shut it down. He insulted your coloring and then back handed complimented your hair to make it worse. Silence equals approval at times.",
              "id": 91,
              "comments": [
                {
                  "score": 23,
                  "content": "As a non-minority it can be very difficult to know how to and how far to take the correction, so it's at least understandable to leave it to the person being wronged (not the best, just understandable)\n\nBUT if you're going to leave it to the person being wronged, you need to accept their discretion on how far to take it and you don't have the right to say \"boo hoo you made him feel uncomfortable\"",
                  "id": 92,
                  "comments": [
                    {
                      "score": 27,
                      "content": "It's easy. Hey, I don't find your comments acceptable.  Sometimes if it comes from a non POC, maybe the offending person will realize maybe they shouldn't think such things. They might think the POC is just being sensitive or they don't care. If their own start calling them out, it might help. Maybe not, but we all must work against such people.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Shit fucking take, if you introduce somebody to a minority and they start being literally RACIST it is absolutely YOUR responsibility to shut that shit down.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 49,
              "content": "She was the one trying to bring a new person into the fold. She is the one who has a dog in this fight. You lose nothing that you value by deciding you dislike this guy. *She* loses something she wants very much if he pisses off the people she wants to impress.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "There are three archetypes of people in this world.\n\nThose that do good.\nThose that do bad.\nThose that do nothing.\n\nThose that do nothing are the worst, they simultaneously are supporting those that want to do bad and standing in the way of those that want to do good. \n\nTo be silent and watch as something shitty happens to someone when you have the power to help and then you dont? sorry thats a trash human being.",
              "id": 96,
              "comments": [
                {
                  "score": 3,
                  "content": "Eloquently put. Have my upvote :)",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Sorry but this is absolving your white stepsister of allowing racism directed at you. It’s not cute and it’s just as bad as if she was directing the racism at you.",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": ">  my place to say something \n\nShe was the \"host\" here, it was her responsibility.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I get this thinking and understand how you might think this. But I do feel it’s important to ask her to stand up for you. When you speak out against racist comments, it is very easy for the offender to mentally or verbally dismiss it as “she’s just sensitive” or another dismissal. If your sister speaks up, it is a stronger defense. Plus, as others state, she’s closer to this guy. Ask her to be an ally and speak up when he and other people are jerks. Besides, you can point out that if she had said “hey, that’s not cool” or something like she had wanted you to do, the issue would have been over.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "It is the god damn year of our lord 2022. Fuck racists. Respond to that shit however you feel like or not at all. You are not responsible for making shitty people feel comfortable with their racist comments or their boyfriends racist comments. \n\nNTA",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 430,
      "content": "The “good hair” is some racist shit. He knew what he was saying, and he knew it was racist. He just couldn’t admit it because while he’s happy to be casually racist, owning it makes him feel bad, and we can’t have that, can we? \n\nNTA. It’s bad enough that casual strangers feel ok being racist to you. Having somebody you’re close to bring one to lunch, that just sucks on a while other level. \n\nKeep making them explain their “jokes”.",
      "id": 102,
      "comments": [
        {
          "score": 98,
          "content": ">The “good hair” is some racist shit.\n\nExactly.  The unsaid follow up is \"like a white person.\"  I believe he was using \"good\" to mean \"normal.\"  (Point: normal human hair is actually dreadlocks.)",
          "id": 103,
          "comments": [
            {
              "score": 10,
              "content": "> Point: normal human hair is actually dreadlocks.\n\nIs that true? How do they determine which human hair is normal?",
              "id": 104,
              "comments": [
                {
                  "score": 22,
                  "content": "They are probably referring to the fact that if you don't wash/comb your hair long enough it gets matted and resembles dreadlocks.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "I thought it was because the first humans were from Africa, and so we’re all descended from black people. All other races and colors are genetic mutations.",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "This is the biggest issue I have here, like he knew it was racist. And her immediately rushing to defend him, screams that she knows he's a racist and is still choosing to be with him.\n\nSome people are framing this like the poster was educating him, like he's just ignorant. He knew what he was saying, and Grace knew what he was like and still brought him to that lunch because she wants to stay with him",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Its so messed up. Im biracial and a bit on the lighter side but I have really textured hair. Growing up all Ive heard from people of all races are comments about how much they love the look of it. I cant imagine how Id feel about myself if I had to deal with comments like that. I think OP handled it tactfully and hopefully he learned something about his wrong viewpoints. NTA",
          "id": 108,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 261,
      "content": "NTA\n\nGrace is dating a racist. You just offered him enough room to defend his racism, or explain it and he just ended up humiliating himself. Grace thinks it's your job to protect her racist boyfriend and she's angry at you for not doing that. \n\nI think you should tell your dad and Hannah what went down, because you shouldn't have to put up with racism from your step sister/ her boyfriend.",
      "id": 109,
      "comments": [
        {
          "score": 255,
          "content": "My dad just tends to be protective of me, especially when it comes to stuff like this. He doesn’t even talk to his family anymore because they were being passively racist toward me and wouldn’t change their behavior.\n\nI’m just worried that if I tell him and Hannah, it’ll become an even bigger problem than it already is and I don’t wanna make things worse yk?",
          "id": 110,
          "comments": [
            {
              "score": 196,
              "content": "It’s not your job to protect Grace or her racist boyfriend. If she thinks what he said was ok, then she can explain why to your dad and Hannah. She can explain why she, your sister, didn’t protect you or shut him down. Just state the facts and let the situation unfold.\n\nNTA. You handled it with dignity.",
              "id": 111,
              "comments": [
                {
                  "score": 47,
                  "content": "Yes! Grace needs to be taught that she shouldn't stand by while someone makes racist jokes-- to her family or anyone. If your dad knows what happened he can make sure Grace understands what she did wrong. This isn't your problem to fix, but let the people who love you do it.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Honey, it'll only get worse if Grace chooses her racist boyfriends side over you - her sister.   \n\n\nBeing honest about having experienced racism isn't you making things worse, its you being honest about your experiences - IF things get worse it will be because of the way Grace reacts, not because of anything you've done.   \n\n\nTell your dad, he knows something is up and he's only going to worry if you don't say anything - and if Grace has a problem with you telling him she can explain to both of you why she has a problem with you defending yourself and turning her boyfriends racism into a teaching opportunity. She can also explain why its OK for you to be made uncomfortable by his racism but its not ok for you to make him uncomfortable by asking that he explain his comments.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I love you and your dad!! I love that he’s fiercely protective of you and you seem like such a lovely person! I wish Grace would have stood up for you, but she is lucky she has such a caring and mature stepsister like you! Hope she knows how lucky she is!",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It was a teachable moment and you used it well.  It's up to Issac (and Grace) to show that they absorbed the lesson.   Tell your dad that's the important part.   If Grace wants to talk about what you could have done to avoid [whatever], just tell her she could have shut him down herself and that you will not protect anyone from their own ignorance about racial stereotypes.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It should be a bigger problem, cuz Grace knew that he was a racist and still brought him. It is not your duty to protect her from consequences that she should receive cuz she's acting poorly",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "By not telling him, you’re allowing it to continue. You have to tell him sweetie. The consequences are not your fault at all.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You still trying to handle other people’s feelings gently at the expense of yourself…. Grace and Hannah should at this point be able to navigate through this BS….you already know where your Dad lands…. and your’re trying to safe Hannah because maybe she’ll defend Grace?!?",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 172,
      "content": "NTA\n\nYeah, you could have wrapped it up earlier but...\n\nGrace is dating a racist ass\n\nGrace has a BF problem.",
      "id": 119,
      "comments": [
        {
          "score": 81,
          "content": "And if grace doesn't see that she has a BF problem, then Grace is also part of that problem.",
          "id": 120,
          "comments": [
            {
              "score": 17,
              "content": "Grace is definitely part of the problem because given her reaction, she knew he was a racist and still brought him.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "She’s already part of the problem since she didn’t stand up for her stepsister when her boyfriend was saying racist stuff to her. If she expected her to just take it and has no problem dating this guy then Grace is probably also racist. \n\nNTA",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This is the comment i was looking for.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 148,
      "content": "NTA \n\nAs a person with “bad hair” I applaud what you did there.",
      "id": 124,
      "comments": [
        {
          "score": 221,
          "content": "I really hate the whole “bad hair/good hair” thing. I actually wish mine was curlier! 4c hair is literally so pretty and you can do so much with it. Idk why people are so weird about textured hair smh.",
          "id": 125,
          "comments": [
            {
              "score": 62,
              "content": "❤️\n\nMe 2! In my culture, the newer generations are getting away from calling it “bad hair” and trying to teach the older generations that this is racist and that it is beautiful all on its own, as well as that there is nothing wrong with showcasing your African roots.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I'm black with 3c hair and even I get the \"good hair\" comments and I always do what you did. Even if theyre black I make them spell it out for me. \nIt's the only way for these dumb asses to understand tbh. There is no such thing as \"good\" hair or \"bad hair\".\nNTA.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Totally agree. The good/bad hair thing is all about “traditional” beauty standards, which are outdated and racist. Personally, I have type 1 hair. It can’t hold a curl and doesn’t do anything but sit flat. I have serious envy of anyone with curls and texture. 3c, 4c hair is so amazing.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I think textured hair is gorgeous myself, variety is the spice of life and our differences make us beautiful.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "There are so many things I get to do with my son's 4b hair that I could never do with my daughters or mine. I love his hair and that he wants it long! There are also things I do with mine he would struggle with. Both are beautiful 💕.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I have wavy hair and when I was younger I always wanted it to be perfectly straight because I didn’t like how the “bumps” felt when I’d put my hair in a ponytail. So I’d constantly be redoing it. Whereas people with straight hair would tell me they wish they had hair like mine because apparently straight hair is harder to style when it’s down.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "NTA and as a person with straight hair I've always been blown away by how beautiful curly hair is. The amount of shapes and ways it can be styled is so cool! Bantu knots, braids, locks, gosh curly hair can even hold shapes I couldn't possibly dream of!!",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}