{
  "post content": "\nMy husband (31) was in the hospital for a surgery that involved anesthesia. His mom came to wait with me there but didn't speak to me because we have been having some minor disagreements. She offered me coffee but I declined politely. \n\nHours after the surgery, we were told only one person goes into the room for the day since he was still under anesthesia. From what I understand he woke up calling for his mom, the nurse asked for his mom to go in and she did. I was irritated and felt like all this waiting and stressing out got ignored. The nurse told me that he was still not fully awake and was repeatedly calling for his mom spontaneously, she was basically hinting that I shouldn't get worked up over a natural reaction from my husband but I couldn't help feel irked. I wanted to go home so I left 10 minutes later. His mom called saying she got out the room after I left so I could get time with him but instead I couldn't wait and went home. She said this was not okay and I flew off the handle for no reason, I said that her son acted like I wasn't there but she said that he can not be blamed for something he can't control and I'm just being unfair to him and putting blame on him because of a disagreement between her and I. I cut the conversation short after I sensed that she somehow blamed me for being unacknowledged and ignored. Her husband texted later saying I'm being hostile over nothing and that I should focus on my husband's health instead of acting petty but I don't think I did anything that qualifies as petty.",
  "id": 1,
  "comments": [
    {
      "score": 46701,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 26117,
          "content": "Agree YTA.  \n\nOP, when my grandmother was in the hospital she started asking for her mother, who had been dead for 40 years.  Anesthesia and pain killers do odd things to your brain.",
          "id": 3,
          "comments": [
            {
              "score": 15017,
              "content": "When my daughter went in for emergency surgery a month before the wedding she woke up asking for me (mum). Her fiancé earned huge bonus points that day for saying “of course she can go in first, she’s mum.” Daughter was so thankful I went in first so she could pull herself together a little more before he saw her. \n\nOP YTA and you need to think of others before yourself sometimes.",
              "id": 4,
              "comments": [
                {
                  "score": 4401,
                  "content": "That is sweet. I think sometimes there is no one better at comforting and coddling you for a few minutes than mom!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3541,
                      "content": "Years ago, my 3 yr. old daughter was having a tooth pulled and they gave her \"sleepy juice\". The nurse warned me that when she woke up, she may not recognize me, her mother. Sure enough, when she woke, she looked at me (like I had 3 heads!) and then her father, busted out crying for \"Daaaaddddyyy!\" I didn't let it bother me because, two minutes later, she reached out for me. \n\nOP, you should have stayed there regardless of who he wanted to see first.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "No kidding! I'm in my mid 30s and I still want my mom when I don't feel well. She lives 10 hours away from me and I still call her when I'm sick just to hear her voice, and my husband has no issue with that.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Less wholesome, but when I came out of anesthesia I tried to convince the nurse to take me down to the parking lot and physically fight me because “my nose was itchy.” I have no memory of this. It’s not like tv, you don’t just wake up completely normal.",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 52,
                  "content": "I have had three surgeries an 5 procedures that required going under. I’m a grown ass woman and every time i either asked for my Mam or called her afterwards no matter who else was with me. I also thought my surgeons were wizards on one occasion and another thought the night porter was a monster … those drugs mess with your brain and asking for your mother is a normal reaction. You’re an asshole for making this all about your stress and worry. You weren’t the patient and he was under the influence. Big YTA!",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3948,
              "content": "YTA. I’m a nurse and have heard people say some crazy things after surgery. The nurse even told you he was calling for hours mom spontaneously. He didn’t wake up and say, “I choose my mom over my wife, bring her in first.” He was yelling mom and the nurse did what he asked. If I were the nurse and his mom wasn’t present, I would have called her on the phone for him to hear his voice to help calm him down. \nRegardless of the anesthesia situation.. you’re his wife, you should never leave if you care about him.",
              "id": 10,
              "comments": [
                {
                  "score": 3419,
                  "content": "Once my bf was in a bad car accident and of all of us when he woke up he was calling for his dog, which we both find very funny now.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 2440,
                      "content": "My MIL woke up from back surgery and asked for someone named Tippy. Turns out Tippy was her childhood dog.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1759,
                      "content": "My husband would 100 percent call for his dog before me. I knew that before I married him, the big weirdo.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "I called for my cats when coming out of  gallbladder surgery.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "I also asked for my dog when I came out of anesthesia. She’s a good dog",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "My mom woke up from surgery asking about Marcus. She wouldn't relax until the nurse called me asking who the heck was Marcus. It was her dog. Who I was taking care of. I had to talk to her on the phone and reassure her before she would calm down. I went in to see her a little later and the nurse told me she had been so agitated they were about to give her tranquilizers to calm down. Later she patted her head and called me a good daughter. People are weird after anesthesia.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 571,
              "content": "This is... kind of sad... I feel sad now",
              "id": 17,
              "comments": [
                {
                  "score": 1589,
                  "content": "Don’t. It speaks to how we all treasure our mother’s comfort. That’s a testament of love, not of loss. I’m in my 40s, and my mom’s been gone for 15ish years now. When I feel like crap, I still want my mom. That’s a beautiful thing, because she loved me.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 228,
                      "content": "I'm in my 40s, and mum has been dead for 10 years this year. I miss her all the time. When I was in surgery 6 months ago I was crying because I wanted my mum. I love her, and she loves me. Present tense, because no matter where she is now, she still loves me. I believe that love can be stronger than death\n\nI'm happy for you, and for me, that we both got to experience that kind of motherly relationship.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "OP will end up posting another AITA post a few decades down the line. AITA for leaving the hospital when my son/daughter called for their partner instead of me under anaesthesia?",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "I'm in my 40s, my mom is in the hospital right now, and this just made me cry like a baby. It's so true.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "My dad called out for his mom when he was in his death bed. She died 35 years ago. OP is an insecure person. Serious YTA",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "After I came out of wisdom tooth surgery, which is a short and minor surgery, I was asking for my mom who’s been dead since I was 6 years old. I don’t even remember her. My dad laughed at me instead of walking out in a huff because I wasn’t calling for him instead. YTA.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I was under anesthesia after a rather traumatic childbirth (baby was fine, I was not). When I came round, I asked for a drink. They asked if I wanted to see my newborn, I said no, I just want a drink. I had no idea I had even given birth, my throat was ripped raw from intubation, and I just wanted a drink. Luckily I was met with understanding, not criticism like OP, and when I came to a little more, they brought my baby girl who was perfect. OP, YTA.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2954,
          "content": "I saw a video of a guy coming off anesthesia who sees his wife sitting next to him and asks who she is and she says, \"I'm your wife,\" and he goes, \"*What?* You're my *wife*? You're *beautiful*,\" and it was really adorable and hilarious, but also goes to show that you're not fully in your right mind as you're waking up from anesthesia. It's not like OP's husband deliberately snubbed her by asking for his mom. It's likely that he just regressed back to his childhood and who do you ask for when you're a child? Your mother, or whoever your primary caretaker was.",
          "id": 25,
          "comments": [
            {
              "score": 955,
              "content": "Wow that’s lovely, when my husband came round from anaesthesia he puked so violently into a basin that it splashed onto me, haha. You can’t take things personally when people are in that state!",
              "id": 26,
              "comments": [
                {
                  "score": 30,
                  "content": "Aww that's sweet. LOL",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "When I woke up froma anaesthesia i was just pissed off and just straight up tried to leave the room.",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 602,
              "content": "I was going to comment about that video. It's one of the sweetest ones on youtube. He was like \"You're my wife? I hit the jackpot!\". He didn't even know if they had kids lol.",
              "id": 29,
              "comments": [
                {
                  "score": 301,
                  "content": "Didn’t he start crying happy tears when she said they had kids together? Lol",
                  "id": 30,
                  "comments": [
                    {
                      "score": 45,
                      "content": "If it's the same video (and it probably is) they didn't have kids yet.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 198,
                  "content": "Friend of mine fell off a mountain and nearly lost his leg.  After surgery his then girl friend was in the room but he didn't recognize her, he told her all about his plans to propose to her.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 46,
                      "content": "That is both hilarious and really sweet. I hope the proposal went well!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "Once I was conscious and alert after major surgery the nurses told me I had spent an hour telling them repeatedly that they should get my wife from the waiting room, and they'd know who she was because she was so hot. Turns out my hot wife was the only person in the waiting room, but she thought it was funny when the nurses told her my description of her. You can't get bent out of shape when someone's on mind altering drugs for medical procedures.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "That's beautiful!\n\nMy husband said,  \"I'm too drunk to taste this chicken.\" \n\nI guess anesthesia makes some folks sentimental.  Others quote Talladega Nights.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "My husband tried to grope me repeatedly while coming out of anesthesia. The nurses thought it was cute and said they had to dodge gropes from a lot of men. People are really just not all together while coming out of anesthesia.",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "Here's the video, if anyone wants to watch: https://www.youtube.com/watch?v=EcLYd6SjtA0",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "I love my husband so much. Like, I am constantly in awe of how someone so sweet, caring, and sexy fell in love with me.\n\nI woke up after surgery once and looked at him and went \"who the FUCK are you?! I want my husband\"\n\nHe still teases me 😂🤣",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1723,
          "content": "It makes me wonder if the OP has ever been put under anesthesia. The one time I was under, I woke up crying and asking for my boyfriend that wasn't even there. I had literally no idea what was going on. I feel like it's a natural, incoherent reaction to want a person who has comforted you when you were sick your entire life.",
          "id": 39,
          "comments": [
            {
              "score": 2099,
              "content": "When my mother woke up from anesthesia, she accused my sister of being a wolf person and then whispered to me that the nurse was one of them too",
              "id": 40,
              "comments": [
                {
                  "score": 1396,
                  "content": "And of course I assume that you, like OP, took it 100% seriously and stocked up on silver bullets",
                  "id": 41,
                  "comments": [
                    {
                      "score": 778,
                      "content": "Unfortunately, I couldn’t find any so I hid in the closet with crossed fingers instead",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "My mother was telling anyone in earshot all of her canning recipes.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 24,
                      "content": "My father told the nurses he was a vegetarian and could only eat vegetarian meals.\n\nHe is most definitely not a vegetarian. He'll take that filet medium rare, thanks.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Ha! My very mild mannered shy elderly mom was imitating the dr’s British accent… I never told her because she would have been mortified!",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Wait, what's the difference between a wolf person and a werewolf? Is a wolf person a wolf who turns human during normal moons, vs a full moon?",
                  "id": 46,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I think it's just the werewolves who has the connection with the moon. \n\nA wolf person is just a person who is also a wolf.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "My fiance woke up from anesthesia, and first he told me I looked like an angel (wtf we are not religious, he has many nicknames/pet names for me but never once before or since has he called me \"angel\") and then asked me if the pillow on the recovery bed was \"some kind of sex medicine\" whilst regarding it very suspiciously.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "On the way home from getting my wisdom teeth pulled, we passed a plant store and I almost sobbed because \"we don't have enough dirt..we need dirt for the plaaantsss\" \n\nSome people cry for their mom. Some people cry for dirt. Anesthesia is weird.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 737,
          "content": "Especially after *10 minutes* I could maybe understand like 4 hours later and they still weren't letting her see him but it was 10 minutes",
          "id": 50,
          "comments": [
            {
              "score": 54,
              "content": "It really sounds like OP’s communication skills are lacking. If she was wondering how long the mother-in-law would be in the room and whether it was worth going home to wait instead, she literally could’ve just sent a text to the mother-in-law. OP’s attitude of “I will only give her 10 minutes with her son“ is super petty, imo.",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "Exactly, you’re basically still hammered with the drugs and pain medication at that point. It’s like taking someone too seriously when they’re blackout drunk.",
              "id": 52,
              "comments": [
                {
                  "score": 96,
                  "content": "I personally made the arrangements for my best friend to pick me up from surgery, I had never been put under before. When they woke me up they were like “hey, Tayler’s here to bring you home, are you ready to see her?” I had no idea *why* Tayler would be there but my reaction was “TAYLER?? I love Tayler! Hell yeaaaaaah bring her in!” I legitimately thought she had just randomly, happened to be at the hospital and they knew I knew her somehow.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 30,
                      "content": "That's really cute though. Just goes to show how much you love your bff. 🤣",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "tbf the OP said she was told only 1 person could go in for the day.  but to be even fairer, OP should have WANTED to stay and hear from the mother first-hand how he is doing.  but it was more important to her that she just leave and make some point about being her husband's 2nd choice lmao.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Honestly OP is so obviously in the wrong in this story that I would believe MIL wrote it to make the wife look bad.  From mentioning the denying the coffee olive branch to acknowledging that it was a response under anesthesia but still being angry...",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 459,
          "content": "OP, you flounced home because he didn't say your name first. That's the pettiest shit I've ever seen.\n\nQuit acting like a junior high girl. YTA, big time.",
          "id": 57,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 211,
          "content": "I am absolutely and without regret jumping on top comment to repeat a story of my FIL. On his deathbed, at 96 years old, he called for his mother who died when he was a very young boy.\n\nMothers are important, nothing can change that. \n\nOP YTA, so much.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": ">Even if it wasn't a groggy reaction from coming out of surgery, he's allowed to ask for his mother.\n\nTHIS! Everyone is honing in on the fact that he was under anesthesia, but even if he was completely awake, he’s still allowed to ask for his mom. It doesn’t mean he hates his wife, it just means that he wanted his mom (subconsciously or consciously) to be with him in that moment.\n\nI get that OP felt slighted. Emotions were running high, and I’m sure being asked to wait even longer didn’t feel super great. But her reaction to being told that he wanted his mom is what makes OP the asshole. Not only did she leave the hospital out of pettiness, but she threw a tantrum when confronted about it and refused to return to the hospital when her husband *did* ask for her.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "I've been under anesthesia several times since I've been with my husband. I wake up every time asking for Eeyore. Does my husband pitch a fit? No. He hands me my damn Eeyore and waits for me to be fully awake! Don't hold anesthesia against your husband, OP. No one has any control over it and it's not a slight against you.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Agree with the YTA,    \nI also have the feeling OP might be the reason behind the disagreement. Which sane person feels angry or ignored or whatever when a patient going under surgery calls for their mom.To me it seems like OP is very self-centred.  \n\nOP also mentioned that the mom tried to offer coffee, She was willing to put aside any differences they may have so they can focus on the Husband, While all OP can think about is how she had been slighted by both husband and mother.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "I (30f, 24 at the time) had surgery to diagnose and remove endometriosis. With in 10 mins of getting out of theator the doctor came by to tell me that the op was unsucessfull due to the endo growing on my colon. My family and husband (boyfriend at the time) came in after to see me and asked how it whent and i sobbed and told them it wasnt successful because the endo was growing on my scrotum. They looked realy confused and asked a few folow up questions to understand wtf i was talking about? But i just kept repeating it. Eventualy my mum very gently explained \"you dont have a scrotum\" i sat in dazed confusion. The windows error screen displayed across my face, befor finaly i asked \"but how do i poop?\" They didnt hold it against me much after, just a funny story to tell at parties.\n\nYTA if you hold anything against someone that they do after just waking up for an op. He wanted his mam so what? How insecure are you?",
          "id": 62,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 17372,
      "content": "Edit: spelling\n\nYTA\n\nYou don't speak to his mother because of a \"minor\" disagreement? God, I wonder how you'd act if you had a \"major\" disagreement?\n\nHe was waking up from surgery.  He was still medicated.  It's like when you wake up and are groggy and still half asleep.\n\nYou chose to put your spat with his mother over your concern for his health.\n\nGrow the heck up.",
      "id": 63,
      "comments": [
        {
          "score": 2697,
          "content": "Absolutely. I cannot even begin to describe how absolutely disorienting waking up from anesthesia is. OP taking this as a slight against her is so ridiculous and petty.",
          "id": 64,
          "comments": [
            {
              "score": 1088,
              "content": "I woke up this way and asked to see my dog Fred.\n\nFred had been dead for 20 years at that point and I was in a dentist's chair.",
              "id": 65,
              "comments": [
                {
                  "score": 276,
                  "content": "I woke up and apparently really wanted to pull my pants down and windmill my dick. Then when they stopped me before I could do that, I tried playing the penis game and there was some child in the room next door with his family and I guess he had tonsil surgery or something, idk.\n\nI also apparently was sobbing on the way back home because I wanted a McDonalds shake.\n\nIt was for meniscus surgery too, but they went in and found it wasn’t torn, but there was a little like bump or something that they shaved off as a precaution. I apparently named it Bob and was convinced it was a tumor and was also sobbing because they killed Bob\n\nI genuinely don’t remember any of this, my only memory is vaguely coming out and wanting a drink. So yeah, that stuff can do some really weird stuff to a person. Weird thing is I’ve had lots of surgeries before (7 ear tubes, so something like 13 to put in and take out but only 1 time they pulled out while I was awake because they were special) and wisdom tooth since then and I was never anything remotely like that lol",
                  "id": 66,
                  "comments": [
                    {
                      "score": 62,
                      "content": "I told a nurse I wanted to fuck her with my dick. I am female.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "RIP Bob the Bump",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "LOL.\n\nA friend of mine had a wrist surgery under general anesthesia, and when he woke up and was being carried from the operating room to his room, he saw his family, held out his arms forming the V of victory, and cheered a politician that had been dead for 30 years, ON FULL BLAST.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 175,
                  "content": "I woke up from anesthesia after having my wisdom teeth out and asked if I could see Robin.\n\nI don't know a Robin. Have never known a Robin. Haven't met a Robin since then, either. But I wanted to see her. I NEEDED to see her, apparently. (And this was before How I Met your Mother, so not that, and I never got into Batman, so not that Robin either lol)\n\nOP, YTA and you really are Petty AF. Even if your feeling were hurt, suck it up, buttercup. He just underwent surgery and even the danged nurse told you straight up that it was just the anesthesia.\n\nI'm willing to bet that the \"minor disagreement\" was all on your shoulders too at this point",
                  "id": 70,
                  "comments": [
                    {
                      "score": 27,
                      "content": ">I woke up from anesthesia after having my wisdom teeth out and asked if I could see Robin.  \n>  \n>I don't know a Robin. Have never known a Robin. Haven't met a Robin since then, either. But I wanted to see her. I NEEDED to see her, apparently. (And this was before How I Met your Mother, so not that, and I never got into Batman, so not that Robin either lol)\n\nIn this case you were probably dreaming about someone named Robin. Sometimes we dream about stuff and then call stuff out from the dream as if it was real.",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "When I had my knee surgery 8 months back and came to, I kept begging for my dog Rasputin, who had been passed for 22 years. I forgot I was even married and had a husband. My dad was there, so in my brain, I was good. It wasnt until my husband walked in that I remembered I was married and there was a brief moment of \"who is that?\" Before remembering that I was married and that sexy bag of mostly water was my husband 😂",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Hell I once only had two shots of pethidine whilst in labour and was convinced that either me or my partner needed to win a dance off with the ob/gyn before they would let me have my baby.",
              "id": 73,
              "comments": [
                {
                  "score": 32,
                  "content": "I had appendix surgery literally right after I watched Encanto. I woke up and the vibrating things they put on my legs to help with clots convinced me I was running super fast and the lights, since I was high as hell and flat on my back staring at the ceiling, were zipping around like the bike trails in TRON. I thought I was trying to escape Bruno's tower from Encanto on a Tron bike and if I could get out i could wake up, and I woke up going \"mom, mom\" and the nurse said \"you'll see her soon\" and I said in a panic \"tell her you can't talk about Bruno or theyll kill you\" haha",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Waking up from Anesthesia is very disorienting. Last time I woke up from it I cried. I wasn’t in pain or upset. I just …. Cried. Was super embarrassing. Another time I woke up from it the first thing I groaned out was “can I have some chapstick” I’m not exactly functioning at my best afterwards.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Ikr. I told my dad I only love him when he gives me sandwiches and drives me places. Obviously that’s not true but to my foggy brain it seemed like a really nice thing to tell my dad. (He still brings it up years later btw. Very annoying how funny he thinks it is lol). Op’s just being dramatic for no reason",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1301,
          "content": "She doesn’t even seem that concerned about his health period. She’s more concerned about no one acknowledging how she had waited or how stressed she was. Heaven forbid no one think about her and her needs after her husband’s surgery.",
          "id": 77,
          "comments": [
            {
              "score": 341,
              "content": "[deleted]",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 234,
              "content": "My dad called for his mom in his deathbed. She died 35 years ago. \n\nThis is an insecure cold hearted person. High chance she will even leave him sick",
              "id": 79,
              "comments": [
                {
                  "score": 24,
                  "content": "I’m sorry for your loss. My mom has been dead for a few years now, but she’s always going to be the person I need after surgery. For my c-section I paid for my oldest sister to fly out and be a substitute mom (which she was amazing at).",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1015,
          "content": "Not to mention the mother offered coffee(seems she wants peace) and left the room early so OP could have some time with him. OP wrote this while disliking the mother and the mother still came off sounding like a nice lady. \n\nOP, YTA.",
          "id": 81,
          "comments": [
            {
              "score": 276,
              "content": "Yeah, the coffee part is what got me. OP says the mother didn't speak to her but apparently also offered coffee? Both of those things happening seems extremely unlikely.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": "Her son was in surgery and his wife was making everything about herself, and she was *still* being cordial, and didn’t say anything about OP’s behavior until she threw a tantrum and left. Sure sounds like OP is the sole source of tension here. I feel sorry for MIL that she will have to put up with this person forever in order to have a relationship with her son.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 466,
          "content": "if I was half conscious and coming out of anesthesia I'd probably be asking for pikachu for all I know lmao",
          "id": 84,
          "comments": [
            {
              "score": 59,
              "content": "I asked for my wisdom teeth coming out of that surgery. Thank goodness my ride didn't leave me because I didn't ask for them first 😂",
              "id": 85,
              "comments": [
                {
                  "score": 39,
                  "content": "When my sister had her wisdom teeth out, she woke up pissed off (like legitimately angry) that the doctor wasn't John Stamos's character from Glee. \n\nI'm just trying to imagine our mom, who was waiting for her, getting mad and leaving because my sister \"picked\" John Stamos over her.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I always ask for apple juice first thing. Clearly my husband knows where he stands.\n\nI never even drink apple juice but I have immediately asked for it every single time I have woken up from anesthesia.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "Depending on what he got and what he went through, it could be even worse than waking up half asleep. Ive carried full conversations after \"waking up\" that i dont remember because i was still completely out of it. OP's reaction to the whole thing was unbelievably petty.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13263,
      "content": "You should be ashamed of how you acted. \n\nThe nurse was absolutely right. I have literally had surgery, while married to my HUSBAND, and I woke up calling out for my mother. \n\n*I have no relationship with my mother.* She has destroyed most major events in my life, including the police called on my wedding day because of her, and forced me to spend my wedding night sleeping in mine and my husband's marital bed with her because she was trashed, and my husband slept on the sofa. \n\nI don't even remember calling for her. I've heard people not even remembering they're married when they wake up. Some people haven't even recognized their actual parents. \n\nYour concern for your husband was completely overridden by childishness and selfish pettiness. \n\nYou left your husband in a hospital because he called out for his mom. Please, please reevaluate how you look at things. \n\nYTA",
      "id": 89,
      "comments": [
        {
          "score": 4526,
          "content": "My brother told the nurse the Russian mob were running a scheme where they swapped hospital beds for baked beans. He was on morphine and the nurse told us it wasn't even the weirdest thing she'd heard",
          "id": 90,
          "comments": [
            {
              "score": 2764,
              "content": "My husband had a finger amputated about a year ago. After they were done, the nurse came out and told me everything was good. Then she said he was very adamant that she tell me about the human sized  nazi hamsters. So yea, anesthesia makes you say weird shit. Edit: op is YTA btw\n\nEdit: idk why it posted it twice\nEdit2: thanks for the award!",
              "id": 91,
              "comments": [
                {
                  "score": 818,
                  "content": "Human sized nazi hamsters will haunt my dreams tonight. The mental image of that is terrifying.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Just imagine them doing the hamster dance.\n\nOr is that worse?",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Hamtaro revival getting weird af",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 230,
                  "content": "My husband, who I am very happily married to for many years, didn't even know who I was when he came to after an operation last year.",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 145,
                  "content": "I love that she came out and actually told you instead of 'yes dear'ing him about it.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 203,
                      "content": "My husband came out from sedation after an upper endoscopy perfectly lucid. He was joking around with me and the nurse, and when I said something making fun of him, he looked at the nurse and said, \"See what I have to deal with? Can I have your number?\" and the nurse busted up laughing because it was clearly joking.\n\nWe went home, ate lunch, and he took a nap. When he woke up, he didn't know how he got home. He remembered nothing from preprocedure all the way to waking up at home. I told him about asking for the nurse's number and he was mortified. I ran into her at the hospital once and apologized on his behalf, she thought it was hilarious.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1161,
              "content": "My wife was very concerned that her doctor was smuggling owls into the hospital. She was asking the nurses for the number to the FBI.",
              "id": 98,
              "comments": [
                {
                  "score": 816,
                  "content": "Coming off anesthesia for a ruptured appendix I apparently asked my grandmother several times if the mummification worked and if they chose nice jars for my organs. They got me so high I thought I was pharaoh.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 405,
                      "content": "When I came out of anesthesia after getting all my wisdom teeth out I asked the dentist if I could have them and when they said they already got rid of them, I turned to my husband and loudly whispered “they didn’t throw them out. they make jewelry out of the teeth. That’s why I can’t have them.”",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 367,
              "content": "After getting my wisdom teeth removed I repeatedly asked for my tongue back from anyone who would listen. Apparently I thought they took my tongue out and replaced it with a hamburger patty. I cried because I like cheeseburgers.\n\nYTA OP.",
              "id": 101,
              "comments": [
                {
                  "score": 64,
                  "content": "I had mine done and woke up crying because \"my brain is floppy\"",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Totally fair. I hate floppy brain.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 63,
              "content": "Just as my anaesthetic was kicking in for surgery about 15 years ago, I told the surgeon I loved his tattoos and that they had a real \"crunchy\" feel to them\n\n\nHe was in scrubs",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "When my mom woke up from her breast reduction surgery she kept telling my sister that her nipples might fall right off and insisted that she tell me that I could visit her but absolutely could NOT give her any titty twisters, as if that’s the first thing I would do when I visit my mom .",
              "id": 105,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 59,
              "content": "I begged the post-op nurse to call my mom for me.  My mom had died 3 years earlier, but I was convinced that I had just been talking to her and she was going to get popsicles for me because my throat hurt.\n\nThe nurse offered to bring my husband back to see me.  I told her to bring my dog instead — because my mom was bringing popsicles and I didn’t want to share them with my husband.",
              "id": 106,
              "comments": [
                {
                  "score": 25,
                  "content": "damn- sharing the popsicles with your dog instead of your husband? that’s cold lmao",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "My dad told my mum that my niece was up on the hospital roof after he came out of surgery after a liver transplant. The hospital was 100+ miles away from my nieces house. We just laughed and said “ dad, are you high “? 🤣🤣",
              "id": 108,
              "comments": [
                {
                  "score": 43,
                  "content": "My dad referred to my sister as “the toaster” after a surgery. She has not forgiven him 😂",
                  "id": 109,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "I love this 😭 I love videos of people saying weird things on anesthesia",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "That sounds like way more fun than me.  I turn mean on anesthesia.  I was convinced that the nurses were trying to refuse to let me go to the bathroom.  And to be fair, I was trying to get up and go to the bathroom and they were not letting me.   So I was crying and yelling at them.   I'm an asshole when I'm sick and only my dad can handle me so he came back and got out of me what was going on and they finally let me use the bathroom.  But I feel REALLY bad for the nurses because I was not nice.   As an adult, if I go under, I just apologize in advance because I know what is going to happen.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "i kept telling my grandmother the nurses stole my dick and balls after one surgery i had. i am a woman. i’ve never had a dick nor balls.",
              "id": 112,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 400,
          "content": "The first time I was put under as an adult I came out of it an heard the telling another patient that they had found diverticulitis. I started crying saying I could never have popcorn or Mexican wedding cookies again. The nurse reassured me I was fine, and that they were talking to another patient. She left to get my husband. When he got back to where I was he realized I was talking with an Irish accent. He wishes he had made a video.",
          "id": 113,
          "comments": [
            {
              "score": 54,
              "content": "\"They're always after me Mexican wedding cookies!\"",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 265,
          "content": "This thread with anesthesia stories is way better than the main subject of this silly post, since we all agree OP YTA",
          "id": 115,
          "comments": [
            {
              "score": 21,
              "content": "right? this is fantastic. i'm loving this so much.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "Like that guy who didn't recognize his wife, found out she was his wife, and then was super pumped because his wife was hott. Super wholesome",
          "id": 117,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 153,
          "content": "My favorite is when my stepdad looked at my mom post-surgery, gasped, and said, \"You look just like my wife!\"",
          "id": 118,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 145,
          "content": "I finally get to tell my husband’s anesthesia story!! They knock him out and everything goes smoothly - till he started to wake up. \n\nNurse comes out to get me saying they could use a little help. All of the nurses are standing across the room with one standing behind hubby’s chair. Hubby sees me, yells (spit slurs)  “BOOBS” and grabs on to my tits. Got 2 handfuls and tries using them like stress balls. Apparently he was doing this to everyone so they came to get me. Nothing would make him stop. Nurse said “I’ll just leave you to it then shall I?” Yanked the curtain closed and walked off. \n\nThey told me later than it wasn’t common, but it happens. Hubby was just more insistent than they had dealt with before. They were very understanding. He was embarrassed. \n\nGuess I was suppose to get jealous and yell at him for groping people?",
          "id": 119,
          "comments": [
            {
              "score": 34,
              "content": "Nah, they just figured that if anyone was going to get a manual mammogram from your husband it should be you 😆",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 50,
          "content": "When I came out of anesthesia I was apparantly terrified, screaming, only stopping to tell someone how much I loved their shirt, only to continue screaming. Then I went on and on about how much I loved everyone in the world and begged to drive the car. I have an intense fear of driving and at that point didn't have a permit much less a license. You aren't logical after surgery",
          "id": 121,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "I‘m an introvert. When I was waking up from anaesthesia I asked my nursed if she wanted to spend new years eve with me and my friends and got super pushy because I didn‘t want her to be alone. Lol",
          "id": 122,
          "comments": [
            {
              "score": 46,
              "content": "I was recovering a woman who'd had a GA section.  She spent the whole time in recovery trying to get me and the anaesthetist coupled up.  Of course, with the lack of inhibitors she kept saying she just knew he'd have a beautiful penis and telling me to take pictures of it and show it to her.",
              "id": 123,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "I remember a really viral video from a few years ago. A guy had just had surgery and was still under the influence of some sort of drugs. His wife came in to see him and he didn't recognize her as his wife, but was enamored with her. Kept hitting on her and stuff and asking for her number. She was laughing the whole time.",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "Agreed. **Huge** YTA. \n\nAfter I came out of surgery on anaesthesia, I looked at my then-fiancé and was like “Where the *fuck* is my mother?” \n\nLmao. My mum was in the hospital waiting area, she just thought I’d want to wake up to him and have some privacy. Turns out, I woke up and chose violence against them all. \n\nIn my right mind, I would have wanted to wake up to my fiancé. On anaesthesia, I reverted to being a child (with a huge attitude problem, apparently).",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5424,
      "content": "YTA\n\nLast time I had surgery there was someone coming off anesthesia who thought he had been abducted by aliens. People are not responsible for what they say under anesthesia. \n\nYou owe both him and his mother an apology for this.\n\nEdit: I did not realize this comment would result in such an amazing string of incredible anesthesia stories. Thanks for all of them!",
      "id": 126,
      "comments": [
        {
          "score": 1536,
          "content": "My mom thought she was kidnapped by pirates and was being held captive on their ship.",
          "id": 127,
          "comments": [
            {
              "score": 1138,
              "content": "My mom thought she was dead. Between not having her glasses right away and the large white bright recovery room she was in she thought she was in heaven. Even asked the nurse if a mistake was made because there was no way she'd be getting into christian heaven. Nurse was still cracking up when she came to tell us she was awake and recovering.",
              "id": 128,
              "comments": [
                {
                  "score": 542,
                  "content": "I get yearly colonoscopies and the sedation always makes me silly—one year I also had to get an endoscopy. Well it made me breath like Darth Vadar and as I fell asleep, I told the nurse (mangled around the tube) “chssshhhh I am your father chssshhh” and woke up asking for nurse vadar. Bless them for dealing with me. \n\nAlso op, YTA.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 137,
                      "content": "My mom just had a colonoscopie and asked every single nurse out for a drink. She also hits on her other Dr when she's under. OP YTA.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "That sedation is \"conscious\" sedation which is far less weird than full anesthesia. You actually can still be asked questions and such when under it, but you don't form memories and you're not really there, just kind of in la-la-land. A couple of years back I had one, and I went into it telling myself \"don't make inappropriate butt jokes, don't make inappropriate butt jokes\" but you know what? I definitely did. I don't know what I said, but once I was awake in recovery, the doctor wouldn't make eye contact and muttered something about everything looking fine before leaving the room quickly. I decided it was better not to ask the nurses what I did...",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "OMG I love your Mom.  That’s hilarious.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 279,
              "content": "It’s like the OP has absolutely no idea what anesthesia is or does.",
              "id": 133,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 109,
              "content": "Thought I was on a school bus and cried because I didn't want to go.",
              "id": 134,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 87,
              "content": "Hahahahaha oh my goodness! I remember once when I was a kid my mom had surgery on a bunion on her foot and right after she got home from the surgery she was on painkillers and handed me some random object and told me to park the bathtub in the driveway for her.\n\nIt was interesting. Kid me was worried for the most part, but looking back it’s absolutely hilarious.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 712,
          "content": "I begged for my husband because \"I wanted to have group sex in public\" while waking up. He was sitting right next to me and I informed him that I was married to Purple Cement and that's who I wanted for my post anesthesia group sex.\n\nAbsolutely right. You can't control what you say or do while recovering from anesthesia. Haven't you ever seen those anesthesia videos on YouTube, etc?",
          "id": 136,
          "comments": [
            {
              "score": 346,
              "content": "> Purple Cement\n\ni had to google that bc i thought maybe there was someone who called himself Purple Cement. but no, it appears you just had a thing for cement that color. but really, who could blame you? the google images are very pretty.",
              "id": 137,
              "comments": [
                {
                  "score": 279,
                  "content": "Yup. No clue how that got in my head. Can you imagine if my husband got huffy over my relationship with colored cement? Apparently, I was very upset that no one knew what/who/how purple cement was. I'm a nurse so when I woke up was expecting to be told something crazy. That isn't even the worst thing I have said or been told by patients while in recovery. I'm just thankful that there is no video of the worse ones.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 78,
                      "content": "> Can you imagine if my husband got huffy over my relationship with colored cement?\n\nhow could he even compete?!  even if he body sprayed himself purple, he's still not cement.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 501,
          "content": "When I had surgery I thought I was kidnapped by organ harvesters and punched the nurse. For my second surgery I woke up asking for my dog, my dad was not offended.",
          "id": 140,
          "comments": [
            {
              "score": 50,
              "content": "My ex thought the same but didn't punch anyone, instead tried to escape and removed all the needles and a catheter before someone tied him to the bed 🤷🏻‍♀️",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I asked for steak, thankfully my dad was also not offended",
              "id": 142,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "My father thought he was in a pizza restaurant and got annoyed when my brother wouldn’t tell him what he wanted. 😆",
              "id": 143,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 370,
          "content": "After surgery I thought I had been mummified and was pissed off that the nurse and my grandmother wouldn’t show me which canopic jars they had chosen for my organs. Given that my ancient Egypt phase ended in roughly sixth grade I have no idea where that came from.",
          "id": 144,
          "comments": [
            {
              "score": 30,
              "content": "That is hilarious",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 293,
          "content": "When I was in the hospital after surgery the woman in the next bed spent much of the night yelling that she needed a nurse because her bed wouldn’t stop flying around the room.",
          "id": 146,
          "comments": [
            {
              "score": 159,
              "content": "for some reason, out all ALL these fantastic stories, this one made me laugh the most.\n\ni'm trying to imagine what that poor woman was going thru thinking she was airborne the whole night. this really cracks me up.",
              "id": 147,
              "comments": [
                {
                  "score": 82,
                  "content": "You can add to that that I was still pretty groggy myself, and being kept awake, so I was annoying the nurses because I kept using the call button for this woman (because she said she couldn’t reach hers, because the bed was flying). \n\nAlso, at some point a dude came into our room and I think sat in a chair on her side (it was dark but for the hallway light), and I thought I was maybe dreaming/hallucinating myself until a nurse came in and shooed him out.\n\nIn short, in future, I will spring for the private room when I can.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 32,
                      "content": "> (because she said she couldn’t reach hers, because the bed was flying)\n\nomg. this is perfect.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 233,
          "content": "I remember waking up and asking the nurse if she wanted to smoke a fat ass blunt with me. She said no.",
          "id": 150,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 224,
          "content": "My story is after I woke up from anesthesia, I spoke entirely in English to the doctor. Imagine their face in utter confusion. For the context: I was living in a South East Asia country, where less than 1% of people can say \"how are you\" in English. I spoke nonsensically nonstop for 5 mins until my dad stopped me.",
          "id": 151,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 147,
          "content": "My mom was in and out of consciousness after having surgery for a ruptured brain aneurysm and stroke and apparently she attended quite the rager in a tent. And apparently she asked the surgeon before going under that \"If I go crazy will you still be my superman?\" because Kryptonite by 3 Doors Down was really popular at that time. \n\n(If anyone cares she miraculously survived with some minor disabilities. We just had a party celebrating her \"21st\" birthday since it's been that long since it happened)",
          "id": 152,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 58,
          "content": "I saw cartoon spiders dancing on the ceiling when I came to after jaw surgery. They had little top hats and cains. It was terrifying at the time, hilarious in retrospect.",
          "id": 153,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 53,
          "content": "I've always dreaded the eventuality that I have to go under for a surgery (we all need something eventually), because I've had Complex PTSD and my mind does not go to nice places when I'm not in control of it.  I couldn't imagine someone \\*blaming\\* me on a personal level for what my brain did when it happened.\n\nWhen I do have to go under, I'm not having any visitors at all, and I'm going to warn the staff too... how awful of OP to be so judgey.",
          "id": 154,
          "comments": [
            {
              "score": 30,
              "content": "No reasonable person would blame you. I remember when I woke up after the surgery and a friend was in the room with me. I suppose that’s probably normal, but I remember being pissed off because I don’t like unexpected visitors and REALLY don’t want someone in the room with me without my knowledge while I’m unconscious. \n\nI didn’t tell her how angry I was, but jeez, check with people before you visit. I’ve since let my friends know that if I’m ever in the hospital, they should call before visiting.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4680,
      "content": "I noticed that you never stated your age or how long you've been married....\n\nYou know you messed up.  Your husband could have been calling for the Queen of England and he's never going to remember doing it.  \n\nPlease chill... your mother-in-law offered you a cup of coffee and instead of taking her up on it and discussing your anxiety, you played the petty card.\n\nYour problem is you.  Please seek out some professional help... you need to learn how to deal with basic life events.\n\nYes, in this situation, YTA.",
      "id": 156,
      "comments": [
        {
          "score": 685,
          "content": "I’m sorry, but I’m ugly laughing at the idea of some random dude calling out for the Queen because of anesthesia.\nA beautiful image, Christ XD",
          "id": 157,
          "comments": [
            {
              "score": 145,
              "content": "“Jeeves, do bring the automobile around. I believe this man is on drugs.” *queen waves off into the sunset*",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Right, Lizzy never turns up for those moments! Always sends the butler instead",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "Mental age: 13\nTime married: as long as it takes to get a divorce after this",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "He won't remember who he called for but he'll remember who wasn't there.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3560,
      "content": "YTA. I'm a nurse anaesthetist and:\n1. people have no idea what they say when they wake up from anaesthesia and even a pretty while after \n2. It's perfectly normal and fine for patients to call for their moms when they feel sick, are in pain etc. Dying patients usually call for their mothers, there is absolutely nothing wrong with that since our mothers are (usually) the ones taking the most care of us and we all carry them deeply in our hearts.\n\nSo yeah, you have no right to be upset and act childish about this and yeah, YTA.",
      "id": 162,
      "comments": [
        {
          "score": 1271,
          "content": "Oncology nurse here. Can confirm that dying patients will call out for their mom when they're close. \n\nHad one dying patient who called out for his wife to his girlfriend, and girlfriend was not offended. Yes, it was weird. YTA",
          "id": 163,
          "comments": [
            {
              "score": 642,
              "content": "You reminded me that when my 89-year-old grandmother was dying she called out to her mother at the end, who had been dead for close to 40 years at that point. This even though she had all her children and most of her grandchildren around her and had only recently lost her husband of 60+ years. We all decided it meant her mother was there welcoming her home.",
              "id": 164,
              "comments": [
                {
                  "score": 202,
                  "content": "My grandfather too. It gave us a brief smile, because he liked to tease his mother (whom he loved dearly) when she was alive, and we joked that even in death he wouldn’t let her rest.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "When my best friend's dad died he was in his 70s and his mom had been gone for decades. His last words were \"Momma take me home\" \nWe decided the same thing as y'all did.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "For a school assignment 20+ years ago, I interviewed a family friend's dad who was a WWII veteran who fought in the battle of the bulge. I don't remember a lot of the interview or the paper I wrote, but one thing that stuck with me is that he said that on several occasions he saw people running past him screaming for their mothers after being shelled.",
              "id": 167,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 369,
          "content": "All of this \\^\\^\\^\n\nAfter my surgery I was apparently very nasty to the kind recovery nurse looking after me. When I was back in normality someone told me and I could not apologize to the poor nurse quick enough. She said it was OK, it happens all the time, people go into all kinds of states due to the memory effect and distortion of reality they feel. Ranges of emotions come out, anger, fear, some people regress to childhood, heavy disorientation etc etc",
          "id": 168,
          "comments": [
            {
              "score": 35,
              "content": "The one time I was under general anesthesia, apparently I woke up swinging at the recovery nurse. To the point that they had to re-sedate me and when I finally did wake up there were 6 nurses/staff there to keep me in bed and distracted until it was clear I wasn't going to react so violently a second time.\n\nI felt so bad when I found out!",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 271,
          "content": "Critical Care Nurse Specialist here.\n\nAbsolutely agree with the above.\n\nPeople coming round can be completely delirious. He could have been putting himself at risk (pulling lines out etc), and so nurses going to get his mother so he can hear her voice and maybe calm down is a great thing to do.\n\nYTA OP. You should absolutely be concentrating on his health and needs more than anything else.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 254,
          "content": "Mte. My late sister had panic attack before she passed away and she called my mum middle of the night despite having her daughter and husband right beside her.",
          "id": 171,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 45,
          "content": "My mom was a nurse for 50 years and like you said dying patients call out for their moms. Their parents can be dead, estranged, total jerks but in the end everyone just wants their mom/to be loved by a mom.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2190,
      "content": "YTA, and I think you mean \"anesthesia.\" Way to make everything about you.",
      "id": 173,
      "comments": [
        {
          "score": 275,
          "content": "I was very confused for a second. Like she left him before he died and then well saw the next time the word was used.",
          "id": 174,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 84,
          "content": "More like \"anesMEsia\".",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "\"all this waiting and stressing out got ignored\"\n\nwow, narcissist much?",
          "id": 176,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1927,
      "content": "I bet you post on the JNMIL subreddit as a victim.  YTA and a JNDIL.",
      "id": 177,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1144,
      "content": "YTA - I came out of anesthesia begging for my mommy (as a mid-20s adult), slightly wailing, and in immense pain. I don’t remember most of it, and I sure as shit wasn’t in control of what I was saying or doing. \n\nOur moms are normally who we had growing up who take care of us in our most vulnerable state. It’s natural that if he had a good relationship with his mom, he would call for her since it was ingrained in his head as a baby that she is there to take care of him. \n\nHis mom handled this excellently by helping and calming him down, then giving you time with your husband. You are the only asshole here since you just up and left, immediately.\n\nEdit: thank you for the award!!",
      "id": 178,
      "comments": [
        {
          "score": 222,
          "content": "My husband has a horrible relationship with his mom and everytime he's had surgery, he begs for her. When he's told she is not there, he cries like his heart is broken again. \nNever held it against him even if it hurts me a little. Why would he want someone who has treated him so poorly all of his life over the person who is sitting right next to him trying to console him? I have held it against his mom for breaking him so much though. \n It's just what anesthesia does and in many ways is one of the reasons hospitals don't let you in the recovery room right away. They allow the person to get more aware for both physical and mental reasons so most people aren't even aware of what happened unless they are told after the fact.",
          "id": 179,
          "comments": [
            {
              "score": 54,
              "content": "If I may try to answer? It’s because most of us only get one mom. If you pull the short straw on parents, it leaves a big gap where an adequate mom or dad was supposed to be. You learn to live with it, move on, be self sufficient, but it’s always there. Your husband didn’t want his mom as she is, he wanted his mom as he needed her to be, for all those years she wasn’t.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1126,
      "content": "YTA\n\nWhen I had my gall bladder removed, a routine 1 day stay turned into a 4 day ordeal.  Two surgeries and I was under both times.  My father, half sister, and husband were there at the hospital and guess who I asked for?\n\nMy car.  I asked if my car was ok because I thought I was in an accident and I felt more worry for it than for myself.  Imagine the nurses surprise when she had to go into the waiting area and tell everyone \"he's awake but he's asking for <my cars name>?\"",
      "id": 181,
      "comments": [
        {
          "score": 285,
          "content": "I’m sorry but I just burst out laughing at this story! I’m sorry you had to go through such an ordeal for what’s supposed to be a routine surgery! \n\nOP YTA and massively, you sound too immature to even be married.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 189,
          "content": "Well? What's the verdict? How's your car doing? 😂",
          "id": 183,
          "comments": [
            {
              "score": 23,
              "content": "Better than Bob's fridge, I hope.",
              "id": 184,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "To shreds you say?",
              "id": 185,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 184,
          "content": "I woke up and called for my dungeon and dragons character. I had really vivid hallucinations about our campaign. I am in fact, my dungeons and dragons character. My mom ended up calling my roommate about it, and asked for my characters name. Apparently my roommate laughed so loud it could be heard in the speaker.",
          "id": 186,
          "comments": [
            {
              "score": 28,
              "content": "Damn they sent you straight into the fantasy realm. General anesthesia sounds lit.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "I went for surgery to remove my gallbladder. Crazy shit went down, and I was born without a gallbladder and nobody knew til they opened me up. I was 23 and had no idea, but when the doctor realized, he opened up my liver looking for it.\n\nLong story short, I have 40% of my liver left, and I sued the fuck out of the surgeon.",
          "id": 188,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}