{
  "post content": "A friend at work pointed me to this to get some more advice/points of view on my situation.\n\nI (46F) am the mother to two wonderful children, Andrew (16M) and Nicole (21F). Nicole was very bright as a child and excelled in her classes, and she headed into college with a plan to get a Master’s at least. I never had to worry about her doing well or hitting milestones, but the last few years have been very surprising. She became a bit withdrawn in her teen years, more so than I realized until now, and after her first year of college she suddenly moved out from a relative’s home and got her own apartment. Then, after her second year of college (last May) she told me and her father (58M) that she was dropping out and might return in a year, but wasn’t sure, and that she was incredibly stressed and depressed and had been for years. It felt like it was coming out of nowhere. \n\nLast fall she got a full time job and started talking about how she was happy and finally in a good routine and that she loved working. I was glad things were at least going well for her now, but still hoping she’d return to college soon. One of the biggest recent bombshells she dropped on me though was a month ago when I drove to visit her. We went out for lunch, and we started talking about this friend (25F) of hers. Eventually, my daughter admitted to me that she was a lesbian, and that she and this girl had been dating since January and that she FLEW TO MEET HER WITHOUT TELLING ME OR HER FATHER! Mind you, she flew over 1,000 miles to see this girl that she had NEVER MET and had only called and video chatted with for a few months. I was shocked and angry, but all I did was gently scold her for not telling me, but that I’m glad she’s okay and that she had a good time with her girlfriend. I’m very new to this whole thing with my daughter, as I thought she was interested in men, but I’m willing to support her because I love her. \n\nThe problem now is that she told me earlier this week that she intends to move within the next year and a half. She says it may be sooner rather than later because things are changing with her girlfriend’s living situation and she wanted to give me a heads up. I told her absolutely not, that she can’t move in with someone she’s only been dating for a couple of months, especially not when she’s moving several states away. All of her family is HERE, including me and her father and her brother, and her three living grandparents. I told her she’s too young and she can’t move that far away from us just for a girl. She told me that regardless of her girlfriend, she’s been wanting to move far away for years and that her girlfriend’s state was on a list of potential places. She said she loved being there when she visited and can’t wait to go back. She says I’m being unreasonable by asking her to stay and that she hates it here and feels like she “can’t be herself”.\n\nAm I being the a-hole here? I don’t think she’s old enough or mature enough to leave.\n\nEdit because someone asked- my daughter didn’t ask for money. She almost never asks for money, she’s like her father in that way. She’s almost completely financially independent. I have her on my health/dental insurance to help her out, my mother pays her monthly phone plan because she insisted on doing something for my daughter, and my daughters grandfather on her father’s side pays her car insurance, and my daughter goes to her father when she has car troubles because he has a lot of experience with cars. My daughter takes care of all her other needs on her own.\n\nEdit- my child’s father is NOT my husband. We never married. We have not been together since she was born. I would have left him earlier had I not become pregnant. I regret being involved with him because he is why I was introduced and became addicted to drugs. I do not regret my daughter. Please stop calling me a homophobe. I support my daughter. I am just apparently ignorant to some things about being gay.\n\nEdit- I am no longer talking about or answering questions about my addiction. Most of you are making baseless assumptions and disgusting accusations and I won’t entertain them. I tried my best to be a good mother and get clean. That’s that. I may not have been the best person to have custody of her as a child, but neither was her actively abusive father who stalked, abused, manipulated, and intimidated me the entire time I’ve known him.\n\nEdit 3/24- I can’t keep up with the comments. I’ve also been banned from commenting because I apparently broke a rule. I’m going to try to talk to my daughter about all of this when I see her this weekend. I want to be a part of her life even if I think she’s moving in the wrong direction.",
  "id": 1,
  "comments": [
    {
      "score": 28327,
      "content": "YTA. It seems like you don't know much about your daughter's personal life. And that's okay, because she doesn't need to share, she's not a teen living under your roof. The more you butt in and tell her what she can and can't do as an adult, the less you're going to see her. Have you considered that the reason she wants to leave at all is to get away from the restraints of her hometown and family?",
      "id": 2,
      "comments": [
        {
          "score": 22618,
          "content": "OP completely omits from their post that they were an addict their daughter's entire childhood and the daughter was **removed from her care for all but four years** of said childhood. And she was an addict for those four years also.\n\nOP is absolutely unremorseful about this, and omitted this critical context for obvious reasons.",
          "id": 3,
          "comments": [
            {
              "score": 11216,
              "content": "That explains the comment about moving out of a relatives house.  Couldn't figure out why she'd be at a random relatives. To put her kid through that and then have the audacity to try to enforce rules after her daughter is already grown. \n\nYTA OP. Sounds like your daughter is doing just fine inspite of you, not because of you.",
              "id": 4,
              "comments": [
                {
                  "score": 4763,
                  "content": "Yea, I assumed living with the relative was one of those \"it's convenient because my aunt lives right next to the college I'm going to\" - the omitted context makes this a VERY different situation.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2401,
                      "content": "Yup same. And haha she stated that the daughters confession of depression “seemed to come out of nowhere!” Like, are you sure?? Are you SURE it’s out of nowhere. Smh. YTA",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 350,
                      "content": "Ya that's what I thought too. Big difference here.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 163,
                      "content": "That what the relative was, though: an aunt who lived in her college town and offered to board her daughter so she didn't have to live in a dorm",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 98,
                      "content": "Yep and the fact that that every other family member pats for something to but she’s had to be independent and out of her home her whole life why would want to stay?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "I assumed the same till I got to the edits. Yes, OP YTA.\n\nChildhood aside, she is still an adult and can move wherever she damn well pleases. The more you tell her no, the more you are increasing the chances of her going NC.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "That’s what I thought too, that’s a huge piece of information to omit smh. Extra AH to OP!",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3815,
                  "content": "YTA, regardles of any addiction problems or your daughter not living with you. Even if you were the perfect mother and she had the nicest childhood ever, you are still the asshole because she is an adult and can live where she likes with who she likes. You have no right to say she cant",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1047,
                      "content": "That’s really all there is to it. Everything else aside, no one gets to tell a financially independent adult what they can or cannot do.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 359,
                      "content": "Tagging on to say that my parents had a similar stance when I tried to move in with my partner. \"You're not allowed to leave, you're too young and we don't know this girl!\" I was 23 and you know what happened? I moved 3 states away anyway and I couldn't be happier for it. They couldn't stop me if they wanted to and neither can you with your daughter.\n\nOP, your daughter is 21. She's an adult, she's independent, and she has not only visited the area first, but has wanted to move there seemingly before she and her partner started dating. Stop holding her back and let her be herself, for once. YTA.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 176,
                      "content": "This exactly. I don’t *need* to know about the addiction and traumatic childhood to know op is TA, even if it’s icing on the cake.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 102,
                      "content": "It's one thing to gently discuss the realities of moving across the country to live with a partner you don't know that well with your fairly young adult child; it's a whole other thing to \"forbid\" them from moving out of state because you want them to stay with you. OP is within her rights to worry about her daughter - even if she was a terrible mother. But her worries do not trump her self-sufficient daughter's desire to move away. YTA.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "Yeah, the addiction is not relevant to whether or not she’s the AH, it just makes her a bigger one.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "This needs to be higher. That's why you are the AH OP. \n\nTell your daughter that you support her and wish her the best. Let her go to find her self. Encourage her to stay in touch with all her family/friends/support network.\n\nInvite her back with her gf for the holidays or vacations. Try to be a good presence in her life. Let her know you and everyone else cares and that if ever needed, she has a place to come back.\n\nOtherwise you'll really lose her.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Exactly this. I had a fantastic childhood. I still didn’t need or request my parents’ approval for life decisions at the age of 21.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I agree. \n\nDoesn't matter to me what your background is, how much you were or weren't in her life, no matter how much custody you had of her when she was a minor.\n\nShe's 21.  I'd say she doesn't quite know how it is to support herself because she has at least 2 big bills taken care of for her by other people, but she IS an adult, and can make her own decisions now. \n\nIf she wants to move states away to be with someone, that is her decision. \n\nIf she wants to leave college, that's her decision. She can ALWAYS go back.  Neither I nor my daughter went to college after high school. We were more focused on getting in and getting our degrees than some of the kids there right after.\n\nYou don't have to like it, OP.\n\nYou just have to be her mother. And love her unconditionally. \n\nI have a 26 year old daughter. Do you think I like all of her decisions? \n\nDo you think she's liked all of mine?\n\nDo you think my mom was happy about 99.9% of mine? \n\nNo, but I will always support my daughter, and all other things aside, my mom always supported me.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My only caveat to this is that I would say the mom does have the right to strongly suggest that she gets her own place, rather than immediately moving in with a long distance significant other. But she definitely has no right to forbid anything.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "100% this. Is moving 1,000 miles away to live with this girl a mistake? Maybe, but it's hers to make.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 324,
                  "content": "The missing missing reasons of abusive parents are just so common.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 258,
                      "content": "Yep.  OP is totally the one in NA meetings going \"I just don't understand why my daughter is avoiding me\"🙄",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 138,
                      "content": "Ding, ding, ding. So true! My mother once said about one of my sisters, “She’s always hated me”. And I thought, “What, since she was a tiny baby she hated you? More info please.”",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "OP's post is positively dripping with missing missing reasons.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 262,
                  "content": "Reading how OP is currently screwing up her relationship with her daughter I thought \"Geez, is this woman even a parent...\"  Now it makes a lot more sense... \n\nShe's lucky to have a relationship at all with her daughter at this point, and to have the balls to tell her adult daughter that she isn't moving... My god lol.  \n\nOP won the lottery with having something of an understanding child, and she needs to back off, and focus on being a friend/safe place to come back to, if she wants to continue to have any kind of relationship with her.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 207,
                  "content": "Anecdotally, I find it odd that there’s pearl clutching over the daughter traveling over 1,000 miles to meet a girlfriend alone when OP was an addict and obviously in far shadier situations.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 165,
                      "content": "I asked OP in another comment if she thought her daughter actually looked at her as someone she should take advice about life from....shockingly I didn't get a response.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 124,
                      "content": "Also, most moms of 21-year-olds are not much older than I am, and I don't understand how anyone anywhere near my age can act this shocked by the concept of going on a long plane flight to meet a long-distance girlfriend or boyfriend for the first time. Long-distance Internet relationships were already very much a thing 25 years ago, and most people of my generation either took such plane flights, had relationships with people who visited via such plane flights, or at least had friends who did this sort of thing and were therefore aware that it was a thing and that it did not typically end any worse than shorter-distance relationships did. Long-distance Internet relationships are so very far from being a new concept at this point.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Female addicts are usually in the worse case stranger danger situations where kidnapping rape and murder are a very possible outcome.  \n\nI could see why the mom was worried but it doesn't appear like the daughter is like the mom in this case.\n\nI've seen kids of addicts being the best at detailed escape plans. Using a relationship to do this would be a good plan. Especially for a lesbian.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I'm more shocked that one of the reason she gives is \"All her family is here\" meanwhile every family member mentioned has GIANT RED FLAG ISSUES that no one who has their shit together would WANT TO BE AROUND.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 173,
                  "content": "I'm excited for the daughter to have this life that she seems to want. \n\n&#x200B;\n\nI moved away from home last year - my mom and family were not happy because they'll miss me. But OPs daughter is an adult... and moving away can sometimes be the best decision out there.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 113,
                      "content": "Even if it's the worst decision out there and the mother has assessed the situation perfectly and it turns out to be awful... the daughter has the right to find all that out for herself and to build her own confidence by facing those challenges and handling the things that happen as a result of moving away.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "This is it! OP's daughter has had an incredibly difficult and traumatic life. She deserves to do something that makes her happy, and makes her feel free. I really wish the best for her. Regardless of if the relationship works out (which I really hope it does) I'm sure this will be good for her. And op said it herself,  her daughter has always been a smart kid. I'm sure this is no different :) \n\nI hope you're happy now that you've moved, living away from family can be hard (or amazing depending on your relationship) but you can always visit them. It's not something that should ever hold someone back. \n\nOP - YTA. she's old enough to move states away for college and no one would bat an eyelid so she's old enough to do this. Support her and have her back if you want a relationship with her in the future.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "This is the part that floored me.  Too late to be her mom now, she's an adult and can go wherever she pleases and OP can do nothing to stop her.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Honestly, does it matter?  Daughter is 21.  She can do whatever she damn well pleases and Mom can't stop her.  Hope she has a great time across the country with her fab new girlfriend!",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Precisely. If OP wants to have ANY sort of relationship with their ADULT, nearly financially independent daughter then they need to back the f up. From what I’ve read so far, OP should count their lucky stars that daughter isn’t already NC. \n\nYTA",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah daughter seems awesome!\n Survived childhood with addictive: ✅\nGood grades as child: ✅\nDidn't force college education she didn't like: ✅\nFinancially independent:✅\nAssume her homosexuality:✅\nNot afraid of moving far away:✅\nI wouldn't be surprised if the daughter wrote on the raisedbynarcissist sub.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2925,
              "content": "Honestly, this just makes me sad. I suspect OP is experiencing a lot of complicated emotions about missing out on most of her daughter’s childhood and having lost parental rights over her. It almost sounds like denial to me like she isn’t ready to accept that her daughter has already grown up largely without her and is an adult now capable of making her own choices. I know people who tend to react to strong emotional situations with denial (my mom does this) so they can avoid all those feelings. Or perhaps this is triggering the trauma of losing her daughter in foster care and she feels like she is losing her daughter all over again and is trying to exert control to stop it.  Of course this is all speculation.  \n\nRegardless, OP’s daughter is an adult now. And OP’s job as her mother is to support her.  A 21yo adult, unless handicapped in some way, is fully capable of going on trips without telling her parents and she doesn’t need permission to move in with her girlfriend. Many young adults younger than 21 live several states away from their parents for college or whatever. \n\nMy advice to OP is to tell her daughter that she loves her and if things don’t work out OP will always welcome her back with open arms. Keep the line of communication open in case she gets in a bad situation and needs help. Be her safety net. Once your kids reach adulthood, your role in their lives changes to more of a safety net and support system rather than an active parent. If you are having trouble accepting this transition due to your own grief and trauma, then that is something you need to work through on your own without holding your daughter back.\n\nEdit: OP also needs to be aware that her daughter was likely traumatized by the removal and because of this trauma and OP’s own drug and abuse history, her daughter is more susceptible to drug addiction and abusive relationships as well. I hope OP is prepared to work through these issues with her daughter if they arise. I do have concerns about a depressed young adult moving so far away to live with someone they’ve only met once, but all you can do is be there for them if things turn sour.",
              "id": 40,
              "comments": [
                {
                  "score": 199,
                  "content": "I think you hit the nail in the head",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 178,
                  "content": "Bam, top comment.\n\nOP, I don't think you're TA. You're scared for your daughter's future and sort of overlaying your own early adulthood experience onto her, which is understandable, but also not fair.\n\nI think you should acknowledge the full context of your fear for her and surface your own struggles as part of that. From your original post, without the additional context provided, it's clear she was the kid you didn't have to worry about. Trust she's still that person. She might mess up or make mistakes, but she needs to figure them out for herself and have her own process.\n\nWhen I was 21, my internet boyfriend came to live with me. On our third trip to see one another, we got matching tattoos (as was the way for suburban quasi-rebels in 2001). I still have the tattoo, but I did manage to ditch the dude. I was my mom's good kid. It must have been terrifying for her to watch me in that situation, but you know what? She stayed near to me, quietly supporting me, no matter what, and she never said a word. She gave me space and time to get some adult legs under me and figure my shit out. And when I did, she was there to help me move out of my apartment in under an hour. ;-)\n\nStay (metaphorically) close and let her figure out her own path. If you push, she will go further and further from you.\n\nEdit: grammar",
                  "id": 42,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Well said as well. OP is projecting a lot on insecurities as well, and reading through her comments she's had a long battle with addiction, and not always had custody of her daughter. There's a chance her daughter has some trauma or at the very least some issues from having a tough upbringing like that. OP doesn't seem like she knows her daughter that well either.\n\nThey also live in the south and have a lot of right wing family, honestly I'd do the same as daughter at her age. At 16 I would travel to my best friend's place an 11 hour train ride away, at 19 I'd moved out from the burbs to the big city with my BF. I was the good girl in the family but my parents both knew them trying to stop me would mean I'd just push them away and talk to them less. They made sure I knew I always had a place to come back to, that they were there for help and advice, and gave me the basic knowledge to thrive as an adult on my own. \n\n\nOP you don't have that control over your daughter, at best you make sure she knows you are there for her if problems arise, stay open and loving and helpful.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I also got a matching tattoo with my 2001 Internet girlfriend! Girlfriend is gone - she actually covered her  tat... 🤔",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 139,
                  "content": "What an incredible outlook and insight. My mom did the best she could, and now as an adult in my 30’s I look back on certain years with grace and empathy, but I would have had a healthier and happier 17-25 if she looked at things like you do.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "right?? I was deployed twice by that age!",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "I moved out at 18 for college to a new state well over 1000 miles away. I also went to Ireland alone at 20 with little more than a heads up to my parents. She's more than old enough to move where she likes.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I absolutely LOVE the point about what parents should be to their children at certain ages. My classes had a great analogy. As babies, our parents are the boss— they dictate where we go, what we wear, etc. As children, they are like our managers— give us choices in our activities but take us to and from and influence our schedules. As young adults onwards— they are like our consultants. Ultimately, any decision we make is up to us, but we can seek their opinion and perspective on decisions",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The being vocal and willing about being there with open arms and no conditions is critical. I moved like 2 miles from home to live with a bf at 19 and my mom was so mad at me and immediately said if I left that the only way I'd be welcome back was if I paid rent. That anger stuck with me and I didn't feel like I had a safe place once my relationship went toxic and abusive... So I sank into it and took a long while to break free. Yes as an adult child, paying rent to parents isn't that unheard of, but that is something my mom could have waited to bring up whenever I did move back in instead of in anger while lashing out trying to hurt me cus she was hurt I was moving out. I might have felt comfortable leaving the abuse sooner had I felt welcome back home.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Excellent advice",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "People with disabilities can also make these same decisions if they have capacity- and in this situation it would not be a good idea for her unreasonable and unrealistic mother to assist her if required",
                  "id": 51,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Obviously that depends on the disability.  The majority of people living with disabilities can be independent, but there are a minority who cannot be. The reason why I said that is because I have a special needs child who is not expected to be able to live independently as an adult.  I’m assuming OP would have told us if her daughter is in a similar situation.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "What's most worrisome to me is OP's edit to refuse talking anymore about the addiction. I hope this isn't a sign that OP refuses to see how hee addiction has affected her daughter's childhood. It might make sense that OP wouldn't have realized (to this degree) how her last has affected her daughter until Reddit spelled it out, but how she handles her relationship moving forward could be her last chance to save it.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 381,
              "content": "Oh OK then. This post is pointless, the girl is going to go No Contact as soon as she can.",
              "id": 54,
              "comments": [
                {
                  "score": 133,
                  "content": "Yeah OP is big ol mess. I hope daughter has found more loving, stable people to surround herself with.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 59,
              "content": "It’s not that critical. \n\nShe could’ve had the best childhood ever, she’s still well within her rights to up and move across state lines at 21. Her mom can’t forbid her! Shes 21!",
              "id": 56,
              "comments": [
                {
                  "score": 5,
                  "content": "Reading this post, I was entirely convinced OP was one of those parents who lives in the same house as their child and is utterly oblivious to their emotional wellbeing as long as their grades stay up.  The whole reason the \"My child is fine\" \"your child understands this joke\" meme caught on.\n\nHell, I'm proud of the daughter for admitting she couldn't handle university and getting a job and place of her own to forge her own path; I spent a semester letting my mother drop me off on campus every day after dropping out before getting a train ticket and moving in with my brother without admitting anything because I couldn't pull myself together enough to have a conversation with my parents about it.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "[Acccording to OP](https://www.reddit.com/r/AmItheAsshole/comments/11zmf91/comment/jddfp4h/?utm_source=share&utm_medium=web2x&context=3), she had primary custody for five years and sole custody for four--so, her daughter was in her care for the first nine years of her life.",
              "id": 58,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "What where did you read this? :0",
              "id": 59,
              "comments": [
                {
                  "score": 24,
                  "content": "Nvm I found it, it's in the comments 😅",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": ">She became a bit withdrawn in her teen years  \n>  \n>she was incredibly stressed and depressed and had been for years. It felt like it was coming out of nowhere.\n\n&#x200B;\n\nSo, you KNEW she was depressed as a teenager and ignored it due to your own drug addictions you blame on her father. No one forced them on you. Now, after treating her badly due to your own problems, you think you can suddenly put your foot down and tell her what she can and cannot do even though she pays her own way, for the most part. Who the hell do you think you are? You think you own your daughter for life? And that you, a drug addict, are the VICTIM here? I understand why she wants to move so far away. Your narcissism is showing. YTA. Exactly what threat will you use to continue to control her, since you don't pay for anything?",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "lately every aita post has that one post that makes me go yeahhhh I dont need to hear anymore... this was a whopper though.",
              "id": 62,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Thanks for that update. Critical info “unintentionally “ left out. Snicker",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Yup. YTA. You don’t get to show up in an adult’s life and decide you finally want to ba a parent. That ship sailed. She may be making a mistake, but it’s her mistake to make. (FYI, I left home at 17. Smartest thing I ever did).",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1017,
          "content": "[removed]",
          "id": 65,
          "comments": [
            {
              "score": 508,
              "content": ">She says I’m being unreasonable by asking her to stay and that she hates it here and feels like she “can’t be herself”.\n\nReading between the lines (she just came out at 21, all of her family still live in the same area, she 'can't be herself' there, met her girlfriend online), what do you want to bet that they live in a smaller rural area that is not terribly LGBTQ or women's reproductive health friendly?\n\nSource: I'm a queer lady from a small town in the midwest who moved far, far away with my wife.\n\nETA: Oh look, confirmation of this theory: https://www.reddit.com/r/AmItheAsshole/comments/11zmf91/comment/jde0rr7/?utm\\_source=share&utm\\_medium=web2x&context=3",
              "id": 66,
              "comments": [
                {
                  "score": 199,
                  "content": "The LGBT context here is super important. Many meet online and omg distance because the dating pool is small, almost non existent in some areas. I personally know more than one couple that got together like this.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 32,
                      "content": "It’s also how many people meet and end up together my dad married a lady from Canada years after my mum passed young from Breast Cancer at 47, they met online and she came out Australia!",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I think my first girlfriend (I'm bi) had a truck with all her stuff ready to move to the city three days before she turned eighteen.  I don't even think she had a place ready to go yet, she just needed out (not just because of a \"low dating pool\".",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "That was my thought as well. The area may be more accepting of her lifestyle and choices. It is a big decision to move but it could be better for her in the long run. Either way she's old enough to make her own decisions without mommy's input. Sounds like she has a good head on her shoulders even with all the obstacles she has had to overcome.  \n\nAnd as another comment says she's not moving now but in a year or so. Plenty of time to save up for a move and see if her relationship with this other woman is working, perhaps meet up a couple more times before the move. Even if the relationship doesn't work out a change of scenery might just be what she needs. A lot of people thrive in a new city or town and on their own. OP's daughter sounds like the type that could make that happen for herself.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 108,
                      "content": ">she's not moving now but in a year or so\n\nSee, she's not even following the traditions of our people and renting a U-haul in the first 6 months.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Yeah I immediately assumed they currently live in a red state and GF is in a blue state (hence the list of places OP's daughter would like to move to).",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "That was exactly my thought as well (as a cis, straight, white, over 50 woman who worries incessantly about women & girls in their childbearing years and all members of the LGBTQ community in this current climate). I hope op’s daughter is able to find a place where she is welcomed & loved for who she is.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Ding ding ding! OP said in another comment she lives in the SE United States (my guess is Florida or Georgia). And her daughter’s girlfriend is in the NE.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I am betting FL.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Bingo. I said the same, because I also grew up in one of those areas and am also LGBT.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "When I was 19, I flew from west coast to east coast to meet a guy I’d met years ago online. I told my parents I was seeing a friend who moved there. Similarly, when I was 20 I started dating a guy I met on a video game and I flew cross country again (at 21) to go meet him a year after dating (lockdowns and school pushed the date farther than we wanted) and he has since become the love of my life. His mom was equally as upset as OP when he told her that he was moving to California with me because all his family and her were in Wisconsin. She constantly texts him about how he’s abandoning them and doesn’t care about them, he’s 24! I don’t blame him for wanting to get away, she was a narcissist and a terrible mother. The best thing to do is just support your daughter and get over it. She’s leaving no matter what you say, and you telling her she can’t and shouldn’t will only make her go low contact or stop talking to you entirely. YTA\n\nEdit to add: it’s not always about getting away from you and your family. It’s about making a life for yourself on your own and seeing new things and experiencing new opportunities that you wouldn’t before. My bf was from a tiny town with no opportunities whereas here, he can be anything and do anything.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "(I love that song and think  every young girl should memorize it!)",
              "id": 78,
              "comments": [
                {
                  "score": 8,
                  "content": "what song?",
                  "id": 79,
                  "comments": [
                    {
                      "score": 50,
                      "content": "The one alluded to in the comment right above mine - it’s “Wide Open Spaces” by the (Dixie) Chicks. I’ve always loved it.",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "My dad played this song for my sister and I alllll the time growing up!",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "I'm also pretty gobsmacked over this as well. Once I was out of my parents house and living in the dorm, I didn't tell them about trips and such I was going on unless it impacted a time I would have otherwise been expected to be at home (like over summer vacation). And then, sophomore summer and forward, I was either staying on campus for summer semester or interning elsewhere or something, so I wasn't expected to be at home either.",
              "id": 82,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "And who knows, maybe it won’t be a mistake at all! But this is a great time in the daughter’s to take those risks.  OP is def an AH for trying to enforce rules she can’t actually enforce, and not finding a way to positively support her daughter. \n\nOP, coming from the mother of a child in her mid20’s, you have to learn to trust your daughter, let go of the reigns (and you have no choice on that one), and find ways to keep your relationship positive and supportive. The rest of the world will try to make things scary for her. She doesn’t need you for that, too. You are going to lose her if you don’t.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "And.... she is 21 years old!! She is not a child. She is an adult, who sounds like they are capable of making her own decisions.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "YTA. She is an adult and is financially independent (for the most part). As much as you don’t want to see her get hurt and have the best intentions… you can’t control her life anymore. \n\nThis is where you have to cede control and pray that you did enough as a parent to help her navigate through adulthood. What she needs is support, not someone telling her what to do.",
          "id": 85,
          "comments": [
            {
              "score": 32,
              "content": "Sadly I think you’ve hit the mail on the head here. OP doesn’t feel like she did enough as a parent, if her daughter lived with her grandparents because OP was unable to have custody.\n\nI feel for sad for OP, addiction is a mental illness but unfortunately OP is YTA for trying to control her adult daughters life.\n\nOP, let her make her own decisions and be there for her if she ever needs you.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "This. OP, you're trying to tell a 21-year-old woman, who you claim has always been responsible and is almost completely financially independent, that she \"can't\" move to be with her girlfriend?  She has struggled with depression for years, and is making her way to something happy, and you want to stop her because you feel that it is too far away?\n\nWhat are you going to do, ground her? Your reasons are selfish. You should be encouraging her to be independent, and to make the choices that are right for her without interference. Apologize. If she is making a mistake, it is her mistake to make. If it is not a mistake, you may be holding her back from what makes her happy.",
          "id": 87,
          "comments": [
            {
              "score": 3,
              "content": "The big issue in the current treatment by the OP to their daughter is realistically they aren't supporting their daughter at all.   \n\n\nThere's nothing inherently wrong with the daughters decision to move other than the OP doesn't like it. This is how parents ultimately end up creating a divide and pushing their children away and then wonder why the kids never speak with them...answer because everything the kid says is met with \"that's wrong, I don't like it\", it's such a giant energy drain, it becomes exhausting to be around parents like that, that it just becomes easier to cut them off from 99% of your life. Listen and provide support, don't poo poo your children people if you expect your children to remain if you life.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "This...daughter is an adult....period. mom cant dictate diddlysquat. This is how we learn. She goes off to another state. Yhings work out great...things dont work out she moves, does something else...whatever...this is life.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Also from everything I know about lesbians, making big moves to be together is pretty damn common.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I mean, I was in a committed relationship at 21, and we bought our first house after we got married, I wasn't even 23. OP do you even know how mature your daughter is? Have you talked to her about long-term goals and plans, or did you just say no? YTA because you didn't ask her anything, you just said no. 🙄 Do you think she will make mistakes you made? She is a legal to drink, vote, and MOVE kind of adult. Suck it the hell up and help or take the chance at having no contact going forward.",
          "id": 91,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "I moved to another country when I was 24, took me a few years to realise it's because I just cannot be in close proximity with my mother. She is controlling and emotionally immature and I do not have what it takes to have this in my life on a regular basis. I definitely sense that vibe from this, the daughter doesn't feel free to be who she wants, maybe feels like she has to justify herself and does.nit want that kind of annoyance in her life. Also OP, you cannot forbid you daughter to do anything, unless you want her to go LC with you.",
          "id": 92,
          "comments": [
            {
              "score": 4,
              "content": "I hear you on that. My mother was so bad, we can only sort of function with 1000 miles between us.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "> I do not have what it takes to have this in my life on a regular basis.\n\nYou had/have what it takes to set boundaries to keep your life peaceful, which is even better. Good for you tbh",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Yeah, op doesn’t seem to realize that a 21-yo doesn’t need her parental permission to get on with their adult life. “You’re not allowed” isn’t a thing anymore at that age, not when it comes to personal choices.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10298,
      "content": "She's 21, so of course she can move. What a ridiculous position to take!\n\n>she FLEW TO MEET HER WITHOUT TELLING ME OR HER FATHER!\n\nAnd? Your daughter is an adult, I'm pretty sure she's doing all sorts of things on her own without telling her parents.\n\n>All of her family is HERE\n\nAnd she, apparently, doesn't want to be here. Hasn't wanted to be here for a long time.\n\nYes, YTA, and only getting more so with your additional protestations.\n\nedit: \"she's 21\"",
      "id": 96,
      "comments": [
        {
          "score": 2041,
          "content": "When my wife was 21, she picked up and moved thousands of miles away from her family without a word. Just gone one day out of the blue. She knew she had to get away from a toxic, smothering situation, and she knew her overbearing mother would blow a gasket if she so much as hinted at wanting to leave. Best decision she ever made, and she’s never regretted it for a minute. OP is lucky she has enough of a relationship with her daughter that she’s even being told of this plan.",
          "id": 97,
          "comments": [
            {
              "score": 617,
              "content": "Right?! I moved from NY to Australia at 22, for a guy. We lasted 7 years. Adults can live how they want.",
              "id": 98,
              "comments": [
                {
                  "score": 300,
                  "content": "I have a friend who moved from Australia to the US for a guy at 18. It turned out to be a bad relationship with a shitty guy, but it was better than staying with their abusive family, and now they’re free of both.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 187,
                      "content": "[deleted]",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 87,
                  "content": "Yep, naffed off to Amsterdam at 21 and haven’t stopped since. Not that I wanted to go NC or anything, just the worlds an exciting place",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 74,
                  "content": "important fact degree instinctive soup steer snails slap sleep political\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 102,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "Did you stay in Australia?",
                  "id": 103,
                  "comments": [
                    {
                      "score": 27,
                      "content": "We actually moved to America together after a few years and then broke up. Spent 2.5 years in Aus.",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Moved 1000 miles for a girlfriend at 19. We lasted way too long, but it was a great risk to take. My parents just made sure I knew I could come home.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Going on an overseas trip for a few years is totally normal for those of us over this side of the world! Can't imagine being told not to.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 164,
              "content": "I flew to meet my partner who I had only spoken to online when I was 21. They moved halfway across the country shortly after that, and we've been together for 22 years now. And like OP's daughter, I knew my smothering, controlling mother would blow a gasket. She tried to separate us, she tried to forbid it, and you see how well that worked out - still with my spouse, haven't spoken to my mother in 15 years.",
              "id": 107,
              "comments": [
                {
                  "score": 62,
                  "content": "It took years for my wife to speak to her parents again, and the relationships are still strained. At 41, she has to consistently remind her mother that they are separate people with separate lives. Her dad is practically a non entity.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Yeah, I'll never speak to mine again as long as they live. My mother was the same, absolutely incapable of accepting that I'm my own person who makes my own choices about my life. If she didn't like a choice I made, she would harp on me about it until I backed down.\n\nOne of my favorite early stories - in the early 90s when I was a young teen, I bought a nail polish that was pretty weird at the time. It was BRIGHT blue and I loved it, but I knew it was weird so I only painted my toenails so that it could be hidden in shoes for \"proper\" events. Totally normal and benign, right?\n\nMy mother hated that nail polish. HATED. She expressed that a number of times and I kept using it, because it was easily hidden nail polish on my toes so who the hell cared that much? So she pulled her favorite trick - shaming her shy, easily cowed daughter in front of someone else. When we were at a doctor's appointment, she started in AGAIN, telling the doctor that it looked like I had frostbite on my toes (what in the actual fuck) and trying to get him to agree and tell me that I shouldn't wear it.\n\nThe fact that she went to that bizarre length about *nail polish* will probably give you a hint about how she reacted to my partner being trans, or about me refusing to go to their culty church anymore.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Exactly op is gonna have the same thing happen to her die to her ridiculous reaction, shes not only yta but stupid too if she thinks that she can stop a grown adult from doing what they want. \nI have a daughter with a neurological disorder and i cant even stop her from doing things that are not ok. All i can do is guide her and try to reason with her which sometimes works, sometimes doesnt. \nMost importantly i am there through every step and heart break and answer the phone at 1 in the morning when she needs me because when i say she cant do something she then doesnt tell me and suffers alone. Talk about hard, shes the hardest thing i have ever done but i love her and being the one she calls more than trying to enforce my will and decisions on her. Shes an adult legally much as you would rhink she should have a guardian shes a damn adult and thats that.",
              "id": 110,
              "comments": [
                {
                  "score": 6,
                  "content": "She is absolutely headed straight for complete estrangement and, I’m sure, will be just *shocked* when it happens. I struggle with my 23yo, trying to keep them safe while respecting their independence, and it is so hard. Sometimes you can see the mistake they’re making, and you see the consequences on the horizon, but interfering will shut them down and make them reluctant to come to you when those consequences roll in. I want my kid to feel comfortable coming to me with anything at all, and sometimes that means holding my damn tongue.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Man, I left home at age 16 - didn't even tell my folks, just sent a note home with my sister after school! And since they were overbearing assholes, kinda like OP here, I am over 40 now, and have been in their home one time since - they don't even live in that house anymore! That's what OP is cruising for, here: 100% No Contact Estrangement.  \nY'all helicopter parenting THEEE SHIT outta these kids if you think 21 big ass years is \"too young to leave home\" - and that's why they're leaving you forever!",
              "id": 112,
              "comments": [
                {
                  "score": 7,
                  "content": "Good on you. Sometimes extreme measures are necessary.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "At 21 I had finished college and moved to a city 5 hours away. Because I was an adult who could make that choice.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "When I was 21, my parents moved away from me. I had a job, was in school, and had a serious boyfriend. They moved from Houston to Austin, and I stayed. My parents should have lost all rights to complain about my living situation. My dad threw the biggest hissy fit when he found out I wanted to move in with my now husband. Said if I loved him I wouldn’t do it. I broke, and didn’t and it’s one of my biggest regrets.",
              "id": 115,
              "comments": [
                {
                  "score": 5,
                  "content": "Gah, I’m sorry he took that from you.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "When I was eighteen I moved from SA to Canada. I’m not even sure my parents had my address when I was 21.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "At 21, I decided I'd never live under my mom's roof again because of the trauma she caused me. A year later, I decided to move in with a guy I had been dating for 6 months because the prospect of at least getting on my feet in a major city was better than being subject to my mom and her rules in my hometown, even if it might have led to some risk and heartbreak (we're now getting married, so not an issue.)\n\nIn my experience, people run towards and away from things for a reason. With the context of OP's daughter getting removed from her care, there's likely something going on there that the daughter needs to process and deal with, and she feels like she needs to do it away from OP. I wouldn't have an attachment to a parent if they weren't present for 4 formative years, and god knows what was happening before that. Children are very observant.\n\nIn fact, this reminds me a lot of the time my mom tried to paint my fiance as manipulating me because I moved in with him so quickly and never came home. I think she realized that she messed up her opportunity to have a relationship with me as an adult and needed a scapegoat.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Good for her for being able to do that.  I envy her, and I’m proud of her for making that happen.  💖",
              "id": 119,
              "comments": [
                {
                  "score": 5,
                  "content": "She’s a badass",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "\"you never even told me of this plan!!\" \n\n\"Aw I have another plan\"\n\n\"Absolutely not. I forbid it.\" \n\nMaybe she should have done as your wife did 🤔🤔🤔",
              "id": 121,
              "comments": [
                {
                  "score": 3,
                  "content": "She probably should. Sounds like she needs a clean break from queen smother here.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 294,
          "content": "I cackled at OP’s outrage when her daughter flew off to meet her girlfriend.\n\nIt’s just a domestic flight. She’s 21. I’d have been more concerned if a 21 year old wasn’t capable of making the trip on her own.",
          "id": 123,
          "comments": [
            {
              "score": 60,
              "content": "Right?  The daughter sounds like she’s doing really well, all told.  She has considerable financial independence for her age, she’s working, she’s forming serious relationships.  Aside from college, which she tried and decided wasn’t for her, what the heck does OP want?  This is a responsible kid on a good track in life. \n\nAnd so her daughter flew out to visit her girlfriend after knowing her online for a few *months* - just how long was the daughter supposed to wait before figuring out if they clicked when together in person?  I mean, how emotionally attached should she be before confirming 100% for sure that she’s not being catfished?",
              "id": 124,
              "comments": [
                {
                  "score": 7,
                  "content": "yea honestly her removing herself from college bc she was unhappy is an incredibly healthy decision I applaud her for.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "I was flying to foreign countries to spend time with family as a pre-teen. OP would be appalled.",
              "id": 126,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "At age 20, I flew from the US to South Africa to meet someone I knew online. Best month of my entire life.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Lol. As a 21yr old I usually tried to let my parents know any time I was leaving the continent. Usually they just got a message saying “cleared DL7 LAX HND” or something. If I tried to keep them appraised of all my domestic travel they’d block my number.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Daughter is a self-sufficient adult from what OP described.  OP has two options, start treating her daughter as an adult or accept that she will not be a major part of her life at all.  From OPs post and responses I think it's highly likely that being 1000 miles away from judgmental helicopter mom is a factor in favor of making the move for her daughter.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "I had a kid at 19 and was married at 22. I can't imagine living with someone like this.",
          "id": 130,
          "comments": [
            {
              "score": 4,
              "content": "She doesn't even!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Anyone else do the math and realized the irony as OP had her daughter when she was 21?",
          "id": 132,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "i’m 22. i always tell my parents when i go on trips. because they don’t force me to or get mad if i don’t. they love and care about me, so i want them to be aware i’m out of state in case something happens. if they were to try to tell me i can’t go on trips as an adult with my own money, i simply would not tell them. it’s not their business, i just make it their business because i trust them not to abuse that information.\n\nop was so obviously TA from the very beginning of the post",
          "id": 133,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I have a great relationship with my family and one of the best things I ever did was move across the country from them. That’s why I now have a great relationship with them. OP is definitely TA here especially with everything she omitted from the post",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "You can’t tell her what to do anymore OP! You can say “I don’t think this is a good idea and this is why” but she’s an adult!!! You telling her she “can’t” is about as effective as dying the same thing to a stranger on the street.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": ">All of her family is HERE\n\nI love when people say that, like escaping family isn't the reason a lot of people move far, far away from their childhood.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I totally agree with you. She’s an adult and can do whatever she wants. You’re lucky she told you at all.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6134,
      "content": "> I told her absolutely not, that she can’t move in with someone she’s only been dating for a couple of months\n\nShe's an adult. She absolutely can. \n\nYTA.",
      "id": 138,
      "comments": [
        {
          "score": 1630,
          "content": "Yup the “absolutely not” from a parent of a 21 yo  Lmaorofl YTA op grow up",
          "id": 139,
          "comments": [
            {
              "score": 507,
              "content": "That bit got me too. Like, if I wanted to move in with a partner at 21 my mom certainly would've been skeptical, and she would've discussed her concerns with me, but she wouldn't have tried to tell me I'm not *allowed*, because like, she doesn't dictate what's allowed anymore.",
              "id": 140,
              "comments": [
                {
                  "score": 150,
                  "content": "Exactly.  Mom is allowed to disapprove, and she’s allowed to make her disapproval known.  But this woman is fucking delusional if she thinks her 21 year old child is obligated to bow to that disapproval.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": "An uninvolved deadbeat parent, no less. What a fucking laugh.",
              "id": 142,
              "comments": [
                {
                  "score": 116,
                  "content": "i love the \"i TrIeD mY bEsT\" lol they always say that. mine says the same thing too and it's just funny to me.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 26,
                      "content": "both of mine do too. for some reason they think that should be enough to be absolved of all things they did wrong. it was their best! how dare I think it wasn’t good enough? yeah, no, bye lol",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It's funny in the sense of \"yeah, it was your best....and yet was so entirely inadequate you lost your parental rights and your child was taken away from you because your best wasn't in the bare minimum of adequate. Your best realistically isn't the defense you think it is, it's a sad attempt at being emotionally manipulative\".",
                      "id": 145,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Who doesn't pay for shit for her kid. She has no leg to stand on.",
                  "id": 146,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "An uninvolved \"parent\" who only \"cared\" for her daughter from ages 5-9, and then had her taken away due to drug addiction. What a crock.",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "That part got me too. I can just hear the tone & even picture what this lady looks like",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Right???? If my parents told me that, then I’d absolutely make that move, as soon as possible, just to spite them.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 87,
          "content": "Also like… in a year and a half (the daughter’s potential timeline), they won’t have just been dating “for a couple of months”. Like, she’s planning ahead.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Time to land the helicopter, OP... long time ago.",
          "id": 151,
          "comments": [
            {
              "score": 4,
              "content": ">Time to land the helicopter\n\nConsidering she has only been with her child for a few years because she was an addict, she most likely did in no way helicopter her daughter",
              "id": 152,
              "comments": [
                {
                  "score": 4,
                  "content": "She's legit trying to helicopter her *adult* daughter.",
                  "id": 153,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Yup. Daughter is telling OP; she's not asking for permission. YTA",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Funny thing is, lesbians move in way faster than that haha",
          "id": 155,
          "comments": [
            {
              "score": 8,
              "content": "Yeah this is restraint lol. My lesbian ass moved in with my then-girlfriend at about one month of dating? And we were engaged at 9 months of dating. (Married for 2 years now!)",
              "id": 156,
              "comments": [
                {
                  "score": 5,
                  "content": "Aww i’m so happy for you two!",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My girlfriend and I were official in July of last year and living together by late November. Granted, part of that was due to her rent spiking like crazy and it was either me or a hostel. \n\nBut we'd already talked about moving in together after Christmas so it wasn't that much of a jump.",
              "id": 158,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Yup.\n\nMy husband quit his job and moved across the UK to move in with me, 4 months after starting dating.\n\nThat was in 2007/2008.  Been together ever since, married & kids now.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This is word for word what I was going to comment. \n\nYTA OP and controlling",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Can confirm, we absolutely do; my wife and I were dating for all of five months before we moved in together; that was nearly a decade ago.  \n\n\nWait, it's been a decade? OP YTA even excluding the context where you lost custody of said daughter.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Plus by the time the move comes it wont be “a couple of months” but can be up to about 2 years of dating!",
          "id": 162,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3256,
      "content": "Yta, she’s an adult and she has respected you enough to tell you.\n\nIt’s a shame that you weren’t close enough to get to see that she was depressed when you thought she was all good but keeping her close won’t make up for that. Fully embrace and support her because it sounds like  she’s happy, stay on her good side and hopefully she will bring you along in her new life",
      "id": 163,
      "comments": [
        {
          "score": 4,
          "content": "This is really excellent advice. Well said.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2317,
      "content": "YTA Your daughter is 21 and already living on her own. She's happy and excited about the direction her life is going. If things don't work out with the girlfriend, it still sounds like she's capable of taking care of herself.\n\nINFO: Is the area you live in a fairly conservative area? If you're in the US, is it a red state? If so, the fact that she's a lesbian was probably why she became withdrawn and did all the things that have surprised you. It's hard being queer in a conservative area, even if she's in a progressive city in a red state. I bet the girlfriend lives in a more progressive location. Now that she's finally out to you and you've been supportive in general, she feels more confident in her identity.\n\nSupport her happiness. If moving ends up being a mistake, it's a mistake she has to learn from.",
      "id": 165,
      "comments": [
        {
          "score": 389,
          "content": "In addition to the OP confirming your suspicions that daughter lives in a dangerously red, anti-LGBT state, one may also read between the lines of the post itself: “I thought she was interested in men, but I’ll support her because I love her.”\n\nIt ought not be that you support her because “you love her,” but simply because it’s the right thing to do. The resentment in this wording is evident. I’d bet anything OP has a latent dislike for gayness if it’s in her own kids and hasn’t recognized it because she’s fine with “other people” being gay. Classic NIMBY. My family is the same.\n\nIf I’m correct, then I’d further speculate that daughter has picked up on this from OP and that her discomfort with her hometown has to do with the attitude in her home itself, not only throughout the state at large.",
          "id": 166,
          "comments": [
            {
              "score": 9,
              "content": "I actually read the homophonia as going in the opposite direction: \"I'll support her because I love her\" means \"I won't make homophonic comments in front of her anymore, but I'll keep making them in front of all the other gay people I know because I don't care about *their* feelings.\"",
              "id": 167,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": ">Support her happiness. If moving ends up being a mistake, it's a mistake she has to learn from.\n\nAnd if it's a mistake, it's a mistake she was the right to make",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1252,
      "content": "Of COURSE YTA. Your daughter is an adult. Butt the fuck out. It sounds like she was depressed because she was hiding her sexuality from you. Live your own life, not hers. By the way, YTA.",
      "id": 169,
      "comments": [
        {
          "score": 11,
          "content": "It feels so obvious…a queer 21 year old feels unhappy because she’s in a conservative homophobic area around her garbage family? I’d be questioning why she WOULDN’T want to get out. Everyone at that age should be figuring themselves out, moving away is how she wants to.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 999,
      "content": "YTA. \n\nHey look, I get it. Her moving in with someone after a few months is scary. It may not work out. But she’s an adult, and she’s young. Maybe it works out for her, and if it doesn’t, she’ll learn from it. As a parent, you sometimes have to let go and let them figure things out. The best thing you can do is offer your stance but say that you will always be there for her. Maybe if you offered for her girlfriend to come visit for a bit so you can meet her? That might calm your worries.",
      "id": 171,
      "comments": [
        {
          "score": 199,
          "content": "You’re so right! You’re supposed to make mistakes in your early 20s! I moved 1000 miles away from home with a boyfriend when I was 19. Did it work out? Nope. But I found a new home, great friends, a career…I’m in my 40s now, with a home, a loving relationship and own my own company. Her life journey is her own, and she needs to be respected enough to go down that path, regardless of the outcome. She not doing anything dangerous or crazy, just being a young woman about to embark on her adult life!",
          "id": 172,
          "comments": [
            {
              "score": 28,
              "content": "I mean I moved in with my boyfriend when I was 19, trial and error process, but 4 years later and a total of 7 years together we're engaged and about to graduate. He's got a job lined up and while I don't see my family as much as they'd like they're insanely happy about it. I hope the same future awaits OPs daughter.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "Daughter gave a timeline of \"within a year and a half\" so likely it will have been going on for longer and have more visits",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "At 20 I moved states with a relationship that crashed and burned. But this city is mine now and I can’t imagine having stayed in my tiny hometown.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "THIS!\nWhen I was 18 I moved 4 hours away to go to university closer to my boyfriend at that time. I ended up severely depressed (+other things) and I broke up with him after 6 months of living there. I came back home and I'm attending uni in my city.\nAt first my parents were like \"immediately no\", but after all I was legally an adult. Was it a mistake? yes (but it was for ME, there are many people who moved out far away and it worked out for them). Did I learn from it? absolutely!\nSo, if OP is reading this, keep in mind your daughter is 21, probably almost 22, so an adult. She is basically financially independent, and she has the right to do whatever she wants with her money. She may accept advices from her mother, but certainly not a \"no\". I understand your concern, and there are high chances this might not work out, but at the end of the day this is her business, her relationship, her life. You don't have the power to order her to do or not to do something anymore, you can just say \"In my opinion you should...\", but don't expect her to listen to you. Let her experience things.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 694,
      "content": "YTA.\n\nYou can have an opinion of the matter, but that's all it is - your opinion.  I'm not surprised she wants to get away from you - when she says she \"can't be herself\" she pretty obviously means that you are way too controlling and intrusive (just as you're being here).\n\nWish her well, tell her you'll always be there for her, invite her and her girlfriend to visit. Don't try and run her life, it will completely backfire on you.",
      "id": 177,
      "comments": [
        {
          "score": 145,
          "content": "Op wasn't there for her growing up",
          "id": 178,
          "comments": [
            {
              "score": 75,
              "content": "And doesn’t understand that that’s likely why her daughter was so depressed",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 51,
          "content": "They also currently live in the South, in a Red (or Deep Red) state.",
          "id": 180,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 622,
      "content": ">she can’t move in with someone she’s only been dating for a couple of months\n\n???? She's 21. She definitely can do that. \n\n>I told her she’s too young\n\nIn fact, 21 is not too young to make decisions about where she lives. \n\nYTA. You ain't gotta like it, but you do gotta accept that a 21 year old adult has the autonomy to choose where they live and with whom.",
      "id": 181,
      "comments": [
        {
          "score": 43,
          "content": "Lmao right? When I was 21 I moved nearly that far to a country where I knew nobody and didn't speak the language. All I had was a job offer I'd accepted and accomodation for the first two weeks with an option to extend it while I found somewhere long term. All my mum said was commenting on my bravery (it didn't exactly feel very brave at the time but in retrospect...) and told me to stay in touch. YTA OP",
          "id": 182,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 602,
      "content": "YTA, and I fully expect to see you posting in a year or two complaining about how you have no idea why your adult daughter has gone no contact with you.\n\nShe's an adult she doesn't need your permission to live her life as she pleases.",
      "id": 183,
      "comments": [
        {
          "score": 186,
          "content": "I can already see the incoming posts from OP. With titles such as \"Why won't my daughter invite me to her wedding?\" and another classic \"Why won't my daughter let me see my grandchildren.\"",
          "id": 184,
          "comments": [
            {
              "score": 90,
              "content": "You forgot \"I keep asking her what I did wrong, and she won't tell me!\" while ignoring that she  has been told numerous times in the past and the daughter is tired of explaining.",
              "id": 185,
              "comments": [
                {
                  "score": 33,
                  "content": "The ol' [\"missing missing reasons\"](https://www.issendai.com/psychology/estrangement/missing-missing-reasons.html).",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Why did she block me on all social media and won't answer my calls?",
              "id": 187,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 70,
          "content": "Especially when she fails to mention being an active addict and having her daughter removed from her care… but doesn’t understand why she was depressed, OP doesn’t notice and why she may not care about living close to family?",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 61,
          "content": "Setting aside all the other issues that have become apparent after OP’s comments, for me it still boils down to one thing:\n\nWhen she kept something from you, OP, you yelled at her. When she told you something, you yelled at her. *What the hell do you want from her?*",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}