{
  "post content": "I (28m) have been dating my girlfriend (23f) for a few months. Things have gone well; we get along well so far and I really care about her and hope things work out with us.\n\nAnyway she recently invited me to come over and have dinner with her parents at their home.  She still lives with them for now. We are getting more serious and they wanted to meet me. If it's relevant her parents are Indian immigrants to the US and I am white.\n\nSo, I thought it was a completely casual meeting and I wore an Iron Maiden T-shirt. I do happen to like the band but that's not even why I wore it; that's just how I dress and that shirt just happened to be clean that day. I went and met her parents and thought we'd had a good meeting.\n\nHowever my girlfriend is NOT happy with me. She feels as if me dressing in a T-Shirt rather than a nicer button-up shirt was bad enough, but that wearing a shirt with skulls on it was--in her words--\"just obnoxious.\"\n\nI honestly just dressed for the meeting the way I usually do and didn't even think about it. I think that if she had certain standards that she should have communicated them to me beforehand. But she thinks that what I did was \"obviously stupid and inappropriate\" and that I should have known better. Is she right or is she being too critical?",
  "id": 1,
  "comments": [
    {
      "score": 31326,
      "content": "YTA Because you're an adult... meeting someone's parents generally isn't an overly casual thing unless they specify that their parents are casual as well. Surely you own a nicer shirt than an Iron Maiden tshirt, being an adult and all.",
      "id": 2,
      "comments": [
        {
          "score": 15840,
          "content": "OP:\n> … didn’t even think about it.\n\nMaybe she wants someone who *does* put a little thought into the relationship? OP’s decision here is likely to make her life harder and he don’t seem to care…",
          "id": 3,
          "comments": [
            {
              "score": 7065,
              "content": "This is the entire problem. He didn't think about it. \n\nMeeting the parents of someone who you are seriously dating IS SOMETHING THAT YOU SHOULD THINK ABOUT. \n\nI don't think it's just her. I think everyone would want the person they are dating to care about meeting their parents* for the first time. \n\n*(If someone isn't close with their parents or doesn't have parents this might be substituted with another relative or found family or a dear friend. Whoever that person is, I think everyone would want their partner to care enough to think about how they present themselves)",
              "id": 4,
              "comments": [
                {
                  "score": 3573,
                  "content": "One of my sisters boyfriends was so well dressed and overly formal we thought he was a lawyer at first lol. It was weird and we cracked through those nerves but it showed he cared.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3228,
                      "content": "It’s always better to accidentally overdress than to show up looking like you couldn’t give a shit. Plus the jokes provide good icebreakers lol.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 872,
                      "content": "My friends oldest daughter just brought a boy home for the first time last November. He wore a dress shirt and nice slacks and was overly polite and formal. The whole family absolutely cracked through his anxiety but for those initial meetings it's nice to show he cared and they're still together. My friend and his wife adore the kid, because he put in effort\n\n\nSomething OP doesn't seem to get.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 365,
                      "content": "I knew my dude friend was serious about a girl when he asked our friend group if his outfits/hair/style were looking good. Pretty casual guy with a very casual workplace but willingly asking for help to appear mature and fashionable for his SO's family is pretty dang mature.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 105,
                      "content": "Weird or not, I would think that's so sweet because it shows you're nervous and care!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Aww this reminds me of that photo of the guy who dressed up in a suit and tie to meet his newborn nephew bc he wanted to make a good impression.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 705,
                  "content": "OP seems to be trying to pass this off as a cultural difference.  Her parents being Indian immigrants and the imagery of the band Iron Maiden have nothing to do with it though.  “Come over for dinner and meet my parents” means put in a modicum of effort.  Put on a shirt with buttons and a collar.  Grab a bouquet or bottle of wine.  If OP were 18, this would be whatever but 28 is way too old not to understand such a basic cultural norm.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 446,
                      "content": "I agree with everything you said and I'll add: his negligence of any social grace around meeting his girlfriend's parents (which would be bad even if they were from the same culture/race) is compounded by the optics of a white dude dating a POC while showing absolutely no respect to her or her parents. He's just confirming whatever fears her parents had about his level of care and commitment in this relationship.\n\nETA: Thanks for the award /u/Salt2Everything",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 223,
                      "content": "I'm as white as they come and you wouldn't catch me dead in a shirt without a collar to meet a SO's parents for the first time.  It might be a class thing, but it's certainly not a cultural one IMO.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "At least a polo shirt, and this is coming from a 55F who usually wears band t-shirts and sweatpants.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "When we met our now-DIL, my son pulled me aside and confided that she was so nervous, she had spent 45 minutes on just her hair. We’re super casual and and we’d heard great things about her already so we’re expecting to like her, which we did, immediately. I will always be touched that she cared enough about our son that she was really worried about making a good impression. (Don’t worry, we got her relaxed and laughing in no time.)",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 543,
                  "content": "Plus... he's 28 fucking years old!!! What in the actual fuck! To say grow up is the LEAST of the responses and tough love this kid needs to hear at this point.  You cannot be this unaware of life at almost 30 dude.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 26,
                      "content": "That would concern me too. At 23 she’s realizing how immature he is. \n\nMy husband wears band and sports t-shirt most of the time. He still had nice clothes for dressier occasions.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 274,
                  "content": "The two serious SO’s I’ve had, both from cultures / countries other than mine, when meeting their parents I’d ask my SO a ton of questions upfront: should I dress up? Should I bring a gift?  Should i use formal or informal pronouns? Are they hand shakers, huggers, kissers or nodders? Is their “approval” of me something that you worry about? How do they get along with siblings SO’s? \n\nEspecially if you don’t know the culture, you try to put some thought into it so you can be prepared!",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "can confirm. My husband is a band t-shirt-wearing, guitar-playing, relaxed fit kinda guy on the day-to-day. But when it came time to meet my dad as a couple (he had met him before during our years long friendship) He put on a nice shirt and nice jeans and clean shoes. A little effort to make a good impression is necessary when you are getting serious. His mom was a fan of mine since day one and he wanted the same from my dad. It was easy to do because as my dad and brothers all said at that time \"I've never seen her happier\". This is a big statement from them cuz I'm just a generally happy person. It's hard to get under my skin.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3079,
              "content": "The kicker is “she should have communicated”. \n\nAlready the gf is doing all the mental labor to manage her bf. \n\nAn adult asks: Tell me about your parents. How can I make a good impression? How do you suggest I dress? Should I bring anything? I bet he went empty handed and it didn’t occur to him that it was rude. \n\nMy mother would say of OP that he was raised in a cave by wolves, which is our culture’s expression for having been taught no manners. \n\nOP, YTA. You need to take a hard look at an important gap in your ability to function in society and address it. Good manners, curiosity and situational awareness will pay dividends.\n\nEdit to P.S.  Despite what you think the meeting with her parents did not go well. Either you take steps to make a better impression and show effort very soon, or your relationship with your gf has a fast approaching expiration date.\n\nEdit 2: Holy crap, thanks for the awards kind strangers!",
              "id": 20,
              "comments": [
                {
                  "score": 411,
                  "content": "Bingo. Your second sentence sums the red flags that are evident in a majority of relationships. It’s easy to gloss over in the “honeymoon” phase.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 391,
                  "content": ">Edit to P.S.  Despite what you think the meeting with her parents did not go well. Either you take steps to make a better impression and show effort very soon, or your relationship with your gf has a fast approaching expiration date.\n\n1000% agree with everything you said here -why is it her job to teach him how to act like an adult",
                  "id": 22,
                  "comments": [
                    {
                      "score": 227,
                      "content": "Add to it that this is an inter-cultural relationship. Has he done *anything* to learn about the culture that she is coming from?",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 310,
                  "content": "\"How was I to know to dress up for that job interview? I always wear this wifebeater! If it mattered so much they should have told me!\"\n\nI once showed a house to some potential tenants. It was a 30-year-old man and his mother. They showed up in a yellow Camaro that she was driving, and she made sure I understood that she would be the only one on the lease. \n\nThe guy got out of his car, and my first thought was, \"what kind of 30-year-old man doesn't think to put on a shirt when looking at a rental house?\" I guess no one told the poor grown adult.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 141,
                      "content": "Culture in the UK must be so different. No one dresses up to rent a house and casual clothes to meet parents are acceptable unless it's going out to a restaurant or something.\n\nEdit; I misunderstood, I didn't read it properly. I didn't realise the commenter said that the guy had no shirt on. There is also another comment that talks about dressing up for a rental meeting.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "[deleted]",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 166,
                  "content": "I agree with you but to offer another perspective, some of us *were* raised in communities where dressing up, bringing something when you go to someone’s house, saying “please”, “thank you”, “sir”, “ma’am”, offering to help cook or clean up, manners in general really we’re not taught to us. Of my family members and friends I grew up with I am often the only one who does these things and it’s because I moved into other communities and learned on the fly and try to pay close attention now. When I make a social faux pas and tell one of them about it in embarrassment they usually just seem confused and say they never would have thought about it and it least it occurred to me in the moment. \n\n…not saying it’s right, just saying lots of people were “raised in a cave by wolves”, me included",
                  "id": 27,
                  "comments": [
                    {
                      "score": 64,
                      "content": "This is true. I think there should be some grace for people because some just aren’t taught right by their parents. The important thing is what they do once they’re told about it.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": ">I agree with you but to offer another perspective, some of us   \n>  \n>were  \n>  \n> raised in communities where dressing up, bringing something when you go to someone’s house, saying “please”, “thank you”, “sir”, “ma’am”, offering to help cook or clean up, manners in general really we’re not taught to us.\n\nThe guy is 28, not 18.  This is on him.  Nobody in my family taught me to cook, but I learned for myself.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I'd always assumed it was a social class thing, but I also wonder if there's a city vs small town thing going on. \n\nI didn't learn about proper table manners beyond the very basic ones until I was well into adulthood and lived with some roommates that were law students. They'd all grown up well off, so I paid attention and learned.\n\nAs to the not showing up empty handed thing, I somehow picked that up along the way but never figured out what it meant beyond bringing wine. I don't drink, so I wouldn't have the first clue how to pick some out for someone else. Pretty label? Without actual instruction, sometimes a person can only pick up so much.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 138,
                  "content": "I’ve read research that says it takes 7 subsequent good impressions to make up for one bad first impression. OP has some work ahead of him. Except he seems to have shown that he doesn’t want to put in any effort. \n\nOP, YTA. At 28, you shouldn’t need advice on this. The message you sent was that you didn’t care what your GF’s parents think. Which by extension says you don’t care overly much about your GF. Please do some serious reflecting.\n\nEdit: how little attention have you been paying to your girlfriend, if you didn’t already know what her standards are?",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "My mom said the same thing about wolves. Thanks for making me smile at the memory! 😁",
                  "id": 32,
                  "comments": [
                    {
                      "score": 74,
                      "content": "I've heard that before. The most common saying around here is \"Were you raised in a barn?\" Lol.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Such an insult to wolves.  Even wolf parents teach their pups manners.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "You're absolutely right about it not going well. If meeting the parents leaves your SO asking \"What's wrong with you\" and saying \"Grow up,\" something went horribly wrong, and that he's trying to pass this off as a difference in cultures is further proof that he does, in fact, need to grow up.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "actually no. she isn’t doing any mental labor here. it is 100% in her to communicate.",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Yeah and knowing his GF had ties to another culture you’d think he’d ask what the etiquette is if he didn’t know",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This also could have been a golden opportunity to call your dad and ask for advice. I enjoy letting my dad know he's still needed and give him the opportunity to tell me how to do things. Plus he usually offers to help which this daughter usually accepts especially since he's retired and usually looking for easy jobs.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 700,
          "content": "After reading your comment, I had to go back and check the ages - I had assumed he was like 17 - 28 years old and you don’t understand appropriate clothes to wear to meet you SO’s parents for the first time? Sheesh! She needs to run before she ends up taking care of this dude.",
          "id": 39,
          "comments": [
            {
              "score": 173,
              "content": "Same. If they were in high school, then okay, whatever. But dude's 28 !",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "I mean I don't know if there is an appropriate clothes type to meet your SOs parents. The issue is he didn't think to ask.\n\nGenerally speaking the whole button up button up (or is it down?) And slacks aka business casual, can make the wrong impression. Its really going to depend on the families socioeconomic status, part of the country, and prior expectations. \n\nBut again he's 28 he should know to ASK what type of clothes would be appropriate. I'm just here to point out this idea that I see floated around, of a button down and slacks or nice pants.That can backfire easily and I have had it happen to me personally .",
              "id": 41,
              "comments": [
                {
                  "score": 162,
                  "content": "A button-up shirt refers to any shirt that buttons all the way up the front. A button-down shirt means any button-up shirt with a collar that can be buttoned down.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Huh TIL there is a difference",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 68,
                  "content": "Even outside of business casual. You can still looked dressed nicely.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Ya I mean all you have to do for something like this is throw on some jeans and a nice pullover, not really that hard. I love concert t-shirts and have a million, but I wouldn’t wear them meet my SO’s parents. It is a bit disrespectful",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 130,
              "content": "[deleted]",
              "id": 46,
              "comments": [
                {
                  "score": 43,
                  "content": "Same here- my SO and I met in our 20s and this notion of dressing up to meet parents was not a topic. But, tbh. If I knew it was a thing with my parents and I knew his everyday style- I would've just said something.",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "Same with my culture, and I live in the U.S. Clearly, different regions of the country have different dress codes.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "Maybe it's the US thing to dress up? I really can't get all the yta's above. A European here, and I do not dress up for the formal interviews even in most cases, unless the invitation does specify the dress-code peculiarities. No one does. I had multiple boyfriends and was always liked by their parents, but not even once was I dressed up to the level of formal meeting. And yeah I wore t-shirts and hoodies plenty of times. But who gives a crap about it? I am honestly amazed that so many people there do think that the buttons somehow define, whether the bloke puts effort in relationships. Wouldn't want to meet their parents, I guess.  As for the cultural differences - I suppose it's fair the most demanding culture representative out of the two is responsible for delivering those demands as there are people like us here, who could think about choice of wine, flowers, but a shirt vs t-shirt? come on...",
                  "id": 49,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "A sweater is definitely as good as a button up shirt.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "For real, like…she really shoulda said something if it was a big deal because this is not obvious. I have no idea what my now-husband wore the first time he met my parents, because like…who tf cares??? He should just wear his normal clothes so he’s not presenting some weird image that isn’t genuine? I mean that’s what I’d want anyway. If he wanted to dress up for whatever reason then fine, go for it. But it would not be at all presumed that he would do so. :/ The Y T A votes here are really throwing me for a loop lol.",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 51,
              "content": "That’s what got me.  He’s 28!  A full-grown adult who should know how to act in various adult situations.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Because he wore an iron maiden shirt you assume she's going to have to babysit him? What kind of leap is that, holy fuck",
              "id": 53,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah.  I'm in my 40s,  make well over 100k a year, my wife doesn't need to work so she can focus on her health issues. I still wear iron maiden and metal tshirts regularly.\n\nThe first time I met her parents I was dressed up because I was taking her to a nice restaurant but the next few times they got to see me how I usually dress.",
                  "id": 54,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 489,
          "content": "i had to check the ages for a sec. OP is 28 and doesn’t seem to grasp that the “meeting of the parents” is never a casual thing no matter the environment. \n\nYTA OP. would it kill you to wear a nicer shirt to meet the parents of your gf?\n\nETA: this meeting is the **FIRST IMPRESSION** that you yourself will be making to her parents. if she hyped you up, then wow, way to make her look foolish to her parents.",
          "id": 55,
          "comments": [
            {
              "score": 311,
              "content": "I'm 48 years old and my first impression would have been that my daughter's boyfriend has excellent taste in music 🤣",
              "id": 56,
              "comments": [
                {
                  "score": 237,
                  "content": "I’m 56. Great taste, but BAD first impression.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 105,
                      "content": "Agreed.  I'm 52, and my taste in music is pretty eclectic.  Plus I'm pagan, and a hot mess.  \nBut i definitely have taught both of my kids about dressing to the occasion and that first impressions are huge.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Oh, my! Dad heard me give the cold-shoulder to clean-cut, frat, preppy boyfriend. I got a call 5 minutes later and said, \"I'll be ready in 30.\" It was a double-date and our first.\n\nHe showed up in a \"Rat Fink\" t-shirt with hair to his shoulders. (Dad used to race.) Accepted a beer and passed the interview portion. Looked Dad in the eye and made him laugh. I drove him home at 6 am after we talked all night.\n\nDad said, \"You're gonna marry that goddamned Hippie.\"\n\nI did.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 67,
                  "content": "You are obviously NOT an Indian immigrant. OP blew it. You get one chance to make a first impression.",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "60 here.  I agree with the taste in music.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "That’s where I’m at. \n\nI mean, it’s cool if a kid puts some thought into it, dresses up. But ultimately, if my daughter likes him, I would rather he be an individual. \n\nWhen I was young, I had more sense than OP, but never went out of my way to impress a girls parents. Never wore a metal shirt, but that’s was never my style.\n\nNow as a grown man - my in-laws love me, and I’m just myself around them.\n\nBut times are changing, and old customs are falling off.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 190,
              "content": "[deleted]",
              "id": 63,
              "comments": [
                {
                  "score": 171,
                  "content": "Same here. I'd have zero issues with my boyfriend wearing an Iron Maiden tshirt to meet my parents.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Me neither. And to me/my social circles it's basically never a formal situation to begin with, nor is there any need to impress anyone.\n\nFirst time I met my in-laws we just got back from a hike. No idea what I wore. Or anyone else for that matter.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 37,
                      "content": "For some reason your comment has me wondering if the roles were reversed that people would have a problem with it. Like if the girlfriend wore jeans a t-shirt to meet OPs parents and OP was mad that she didn't dress up to impress her parents. I'd bet everyone would not have called her an asshole and demand her wearing a dress or blouse. \n\nReddit is surprisingly conservative when it wants to be.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "If I had a child I wouldn’t have cared either and I’m the type of person that wants to make sure I’m looking presentable lol. For me seeing someone wearing a graphic tee is me gauging what they like and possible a good conversation starter. If this was a fancy dinner restaurant I would think he wud be TA but just sounds like me it wasn’t tho.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 164,
                  "content": "Yeah, these comments really confuse me. My husband wore a band shirt when I met him, most of his shirts were band shirts at that time, and I have no idea which shirt he wore when he met my parents but there's a real possibility that it was in fact an iron maiden shirt. They wanted to meet HIM and that was him, why should he act like he was someone else?",
                  "id": 68,
                  "comments": [
                    {
                      "score": 81,
                      "content": ">They wanted to meet HIM and that was him, why should he act like he was someone else?\n\nThat's what I find really confusing about this. Everyone here is acting like you need to dress to the 9's just to meet new people...",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "And everyone is calling him immature for wearing a band t shirt. Like fucking seriously?",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Same (about being confused), was happy to read this one.",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "I am confused by most answers as well. For me it’s NTA\n\nWhere I’m from the meeting is casual. \n\nI do not need my parents‘ approval - from an early age they have made it clear they want me to be happy and they trust my choice.\n\nMy current partner wore a T-shirt and shorts, it was summer. I don’t recall well but I think he asked me about bringing something and we got wine together. I always make casual jokes about the way he dresses, we laugh about it. I would not be asking him to change his style to meet my parents, it’s him. Unless we are meeting at the opera or something. \n\nNow if in the US meeting the parents is always a super big deal maybe? \n\nBut why is it OPs fault if he always dresses like that and the gf just assumed he would dress differently? We end up unhappy because we often don’t say what we want/need.",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "It’s also not true regarding socioeconomic classes. We poors didn’t dress up for anything except churches , funerals and weddings.",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "My husband was very casual the first time he met my mom, but we were at Rennfest and his clothes were appropriate for the event and were part of his garb. When he met my dad for the first time, he wore a nice polo because the first impression is important!\n\nMy mom loves going to Rennfest and dressing up with all of us, thus Rennfest garb, even if not all pieces are on yet, are appropriate. My dad wears pastel button ups every day, even when home lounging around, so the polo was appropriate. Seven years later, they know that unless we're going out somewhere nice, I'm going to be dressed up, he's going to be in jeans, work boots, and a t-shirt.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This isn't true. \n\nI would give zero fucks if my daughter brought a man to meet me in these clothes. It literally means nothing to me.",
              "id": 75,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Meeting my parents is absolutely a casual thing. My dad is the type of guy who rips the sleeves off his t-shirts so anything is dressed up by comparison.",
              "id": 76,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I have an exception to that rule:\n\nThe first time my now-husband met my parents, we went over the my parents to help my dad work cows. In hindsight, I think it was a test to see if my bf would fit into farm life. \n\nSo my bf showing up in jeans and a superman t-shirt was not an issue for my parents. If he had dressed up, I'm sure Dad would have roasted him. But after we were done and my bf was laughing as he cleaned cow poop off his shoes on the grass, my dad said, \"When you bring him back, make sure he has rubber boots.\"",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 324,
          "content": "This relationship has an expiration date.",
          "id": 78,
          "comments": [
            {
              "score": 91,
              "content": "And it just expired",
              "id": 79,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 274,
          "content": "To add on to what you said (which I agree with), I find it really immature and pathetic that a 28 year old man can’t be responsible enough to have his laundry cleaned on a regular basis. How hard is it to make sure you have clean clothes? Especially when you know you’re going to be meeting people important to your significant other. How is a graphic t-shirt the only clean piece of clothing he had available? He shouldn’t need to be told by his gf that dressing appropriately is expected and his whole post reeked of teenage boy level maturity. \n\nThis isn’t even going into the fact that he’s dating outside of his race and can’t even be bothered to learn about the cultural difference. I’ve never dated an Indian and I still know that they have higher expectations than your average white American family when it comes to dating and respecting your elders. Him not taking the time to learn about his partner and how best to show up for her is a red flag in my opinion.",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 123,
          "content": "Yeah, I made a similar mistake wearing a band t-shirt the first time I met my girlfriend's parents.  I was 17, so at least I can say I was young a dumb.",
          "id": 81,
          "comments": [
            {
              "score": 30,
              "content": "The important thing is - you seemed to have learned from it and will do better in the future.\nIt's not a great look for teenagers either, but you were a kid, so I'm sure the parental reaction was less severe than if you did it as an adult.",
              "id": 82,
              "comments": [
                {
                  "score": 9,
                  "content": "Yeah, I learned my lesson by the end of the night for sure.  Her parents didn't directly say anything to me, but they definitely gave me a look.  In the end, they were destined to dislike me for other, silly reasons, but I still felt like a dolt.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I was wearing an Alice Cooper tee that said TRASH across the back when I met my first boyfriend's parents. In my defense, I didn't know I was meeting them.  I thought we were just going to see some bands, not stop in to meet his folks, and I tried to weasel out of it because I was dressed too casually.\n\nIn retrospect,  I should have weaseled out of the relationship, since he didn't respect my wishes.  It would become a common theme.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Its a fucking T shirt wth people 😭 did band or printed T shirts become a sin overnight orrr???",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "[removed]",
          "id": 86,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "As someone who's been with my wife for 13 years? Bullshit.\n\nFirst impressions matter, sure, but meeting the parents isn't something from an 80s sitcom. Be yourself, dress like yourself, and get to know the parents. The goal is that they'll be your parents, too, remember?\n\nDo you make sure to dress up for your own parents? It's not a job interview.\n\nBeing comfortably yourself is the #1 most important thing about family. If you can't do that, it's never going to work anyway",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "When I met my gf her parents I wanted to wear a button shirt. My gf told me not to because that is not who I am and her parents should accept me how I am. Not everyone is a white colar adult.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Even a plain t-shirt would have been better if that was all he owned",
          "id": 89,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10962,
      "content": "YTA. Try to put a bit more thought into your attire when meeting people for the first time. Especially a girlfriend's parents. \n\nShe didn't need to communicate her standards. You need to address your standards. Don't blame her for your lack of them. It's all on you.",
      "id": 90,
      "comments": [
        {
          "score": 1922,
          "content": "Completely agree but since I see no even slight counterpoints, I’d like to point out that before I met my husband he was a Grey Sweatshirt Man™️\n\nHe pretty much exclusively wore grey sweatshirts. On our first date, on our second, meeting my friends etc.\n\nYou bet your ass that the first time he met my parents I told him to wear a nice sweater and if he wasn’t sure which one, I’d come over and pick it out for him or buy him one (I had to buy him one). My family, my rules. We’re married now and have been together 5 years 🤍",
          "id": 91,
          "comments": [
            {
              "score": 1179,
              "content": "Double fun fact, I had to buy him a jacket too because he only had a carhart that had some blood on it but it was “just a little” and “probably deer blood” which “my parents might think is cool”. \n\nYeah no, I bought him a simple black Colombia jacket. Hilariously, my parents found the tag on it at dinner 😂",
              "id": 92,
              "comments": [
                {
                  "score": 656,
                  "content": "\"Blood which my parents might think is cool\" was your husband 13 lol? You're totally right some people just get stuck in a rut fashion wise.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 356,
                      "content": "Which was totally fine with me. I wear clothes to Not Get Arrested and that’s it. No fashionistas here. But my parents are a little more appearance oriented, so I knew from the get go I’d have to intervene if I didn’t want him to wear his favorite grey sweatshirt and bloodied carhart lol\n\nHe’s a simple country man with simple tastes.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 268,
              "content": "That's...not something to brag about.",
              "id": 95,
              "comments": [
                {
                  "score": 217,
                  "content": "Back off ladies, he’s taken! 😂",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "Or… some people just don’t care about their attire and don’t THINK about it or think about how it makes them look. I have known people who only wear sweatpants because they’re very self conscious about people seeing the shape of their legs. \n\nI didn’t think the OP was bragging about that? Just helping someone she fell for make a good first impression when fashion isn’t their MO and maybe never *needed* to be important in their life. If he had family who never dressed up, went to college in sweatshirts, and got a remote coding job where the bosses don’t care what you wear, how would this man ever learn what is appropriate? \n\nThese types of standards are taught and she taught him",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I take my husband places he's never been before. He's country, AF. \n\nHe's a great guy with good table manners. \n\nThe ex is a seriously dapper dresser and everyone loves him! \n\nI prefer my current husband, overalls and all. It's his personality and character that are most important, to me.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "My boyfriend is a graphic-tee-and-flannel-with-baseball-hat guy. He works in tech and gives zero fucks. He's well-groomed, works out, and cares about his appearance, but his clothes? Give him comfort or fuck off. BUT he does own 2 or 3 nice sweaters and a couple nicer button-ups and has the wherewithal to ask me if he should wear one and if he can wear a hat or should he skip it. Occasionally he takes the initiative to \"dress up\" without asking, but after 3 years together and my answer of \"yes\" to certain events, the initiative is just for those times. But I appreciate I don't have to ask.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "The first time my husband and I were going to a nice restaurant I looked at him and asked what he was wearing. He laughed and said \"well, I guess not this\". It's become an inside joke for us now. He's completely oblivious to what he wears, he figures as long as he can lift his arms without his gut hanging out it's fine. We're in western Canada so his basic outfit is the same as 90% of men over 30 - jeans and a plaid. I bought him some nice new plaids for Christmas and told him I get to pick out the same amount of his old worn-out plaids to throw away. \n\nHe comes by it honestly, he just doesn't care and his dad is the same way. We were friends for a decade before we got together so we just tell each other stuff pretty bluntly and it works for us.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "See I love here that you *told* him your expectations.\n\nCommunication is great.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 475,
          "content": "Some people have taken \"communication is key\" to mean \"I don't have to think about anything ever unless everyone explicitly tells me what they expect of me and how to achieve it\". Expecting thoughtfulness and responsibility from your adult partner is actually very normal.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 291,
          "content": "I'm a 40 year old Metal Head / Rivet Head.\n That wears black combats, t-shirt and hoodie 99.99% of the time. \n\n95% of my t-shirts have prints on them. But I have my \"Safe for work\" pile, tech pile and other.\n\nWhen meeting parents for a meal the first time, I pick from the SFW pile.",
          "id": 103,
          "comments": [
            {
              "score": 26,
              "content": "I love this, I'm going to start calling it my SFW stash. Sounds better than \"professional-ish\" clothes.",
              "id": 104,
              "comments": [
                {
                  "score": 13,
                  "content": "I love that category units are called \"piles\". 🤪",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Thankfully, I’m used to being a remote worker where even pyjamas belong in the safe for work pile. As a newbie, one of my trainers wore a unicorn onesie. That’s when I knew I was in the right place.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6281,
      "content": "YTA.   Yeah, dude.  C'mon.   High school kids have more sense than that.  I realize the world is in \"take me as I am\" mode, but the reality is meeting the parents is a big deal.  If you don't even put the most basic effort into it, you're just telling them, and your gf the relationship isn't that important to you.",
      "id": 107,
      "comments": [
        {
          "score": 1459,
          "content": "Seriously. I'm in full goblin in pj's and slippers at Walmart mode rn, but if I'm meeting someone important, I'm gonna put on something nice.",
          "id": 108,
          "comments": [
            {
              "score": 442,
              "content": "I’m loving you for this comment. I too, take on a goblin appearance for my off days. If I’m visiting my partners parents, I wear respectful clothes that I’ve tumbled in the dryer with a wet wash cloth bc ironing is hard. Also, I lost the iron years ago.",
              "id": 109,
              "comments": [
                {
                  "score": 180,
                  "content": "What is iron? Lol\n\nI just hang clothes in the bathroom while someone showers. Neat trick. Very helpful.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Also works well for things that *can't* be ironed or tumble dried! That's how we got the creases out of my wedding veil, how we got the tulle in the flower girl's dress to lay flat, and how quite a few dance uniforms over the years got \"cleaned\" and \"ironed\".",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Get a steamer, game changer.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "The real LPT is in the comments, as always. Love it.",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 462,
          "content": "Your last sentence hit the nail on the head. \n\nI wore a Grateful Dead t-shirt I had tie-dyed myself to meet my boyfriend’s parents for the first time…… because his parents are absolutely HUGE Deadheads. Wearing that t-shirt *was* a way to show that I was putting in effort and cared about what they thought of me. They loved my shirt, we talked about our favorite live shows, and we bonded over his dad’s expansive tape collection. \n\nBut aside from that one incredibly specific example, I literally cannot think of any other situation in which it would be acceptable to wear a band t-shirt to meet your S.O.’s parents.",
          "id": 114,
          "comments": [
            {
              "score": 164,
              "content": "Well played. Did they offer to adopt you straight away or did you have to further woo them with obscure bootlegs?",
              "id": 115,
              "comments": [
                {
                  "score": 108,
                  "content": "It’s been about 6 years since then and yeah, they definitely like me more than their son lol.",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "'Dress to impress' done the \\*right\\* way!",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "HUGE Iron Maiden fan here (username checks out, lol). Wearing a fan club t-shirt right now. I would absolutely LOVE if I had a kid if they brought their SO to meet me in an IM shirt. But I will admit, I can be a bit odd.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I think the difference is you also thought about the situation when dressing. He just put on what was clean. It's not that he thought that he should be free to wear what he wanted, or want to be authentic, or all the other reasons people are listing. He was just lazy about doing laundry.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 170,
          "content": "I’ve never heard the current state of things summed up so perfectly as “take me as I am mode”. \n\nWell done",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": ">\t Things have gone well; we get along well so far and I really care about her and hope things work out with us.\n\nAside from the surprisingly informed use of a semicolon, OP states in the first paragraph that the relarionship isn’t all that important. \n\n-\tNo mention of love \n-\t“we get along” isn’t “I adore hanging out with her” (or anything close)\n-\the “hopes” things work out — as if he has no real control of that, himself \n\nThere’s nothing here to suggest OP truly gives a shit. The fact that he grabbed a *clean* t-shirt is really in keeping with his mild level of enthusiasm.",
          "id": 121,
          "comments": [
            {
              "score": 36,
              "content": "I scrolled down waiting for someone to say this - I hope the gf finds someone who is invested.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "OP mentioned this relationship is only a few months, so I am guessing less than 5. The word \"few\" to me is actually 3, but let's give some wiggle room\n\nThat is a new relationship. It's not unheard of to not say \" I love you\" in that short of time. \n\nGetting along is very important. \n\nHoping for good things is not a bad sign. \n\nOnce you remember this is within the first 5 months, it's not crazy that OP is not 100% into this person. Might take time. I don't think it's a sign that OP isn't into her.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "\"really in beeping\" lmao. Excellent typo",
              "id": 124,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 112,
          "content": "I’ll never forget when my first “serious” high school boyfriend came to dinner with my dad in sweat pants and a hoodie and kept his headphones in the whole time 💀 he didn’t last long",
          "id": 125,
          "comments": [
            {
              "score": 51,
              "content": "Oh my god I feel like I'm turning inside out with secondhand embarrassment just from reading this. I'm so sorry.",
              "id": 126,
              "comments": [
                {
                  "score": 5,
                  "content": "Just chiming in to say I've had a rough day and this comment/expression gave me a really, really needed laugh. :) Thank you kind stranger!",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The headphones are a deal breaker for sure! That’s insanely rude.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "My university friend went to meet parents of her bf wearing a tank top that said “every time you mastrubate god kills a kitten”. And then she was very upset that they didn’t like her. Iron maiden is nothing. But I do agree that first meeting with the parents is never casual and effort is required",
          "id": 129,
          "comments": [
            {
              "score": 13,
              "content": "That's because she's \"not like other girls\"! 😆",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Exactly! I’ll literally wear my pajamas all day (I’m writing this wearing them at close to 11 am) but if I have something important you bet your ass I put on something nice.\n\nYTA OP.",
          "id": 131,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Yeah, I had a boyfriend show up for Thanksgiving dinner at my house in pajamas. We are not fancy. Lots of jeans and button up shirts, basically. \n\nBut now anytime my ex is brought up, he's now referred to as \"Pajama Pants Guy\" by my family, because his attire left that much of an impression.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4522,
      "content": "I don't think anyone's the arsehole here. Just a case of different expectations.\n\nBut if you do like this girl, eat humble pie, say sorry and don't wear t-shirts with Eddie on them when you meet her parents next time.",
      "id": 133,
      "comments": [
        {
          "score": 1585,
          "content": "Yeah, I don't remember what my fiance was wearing the first time he met *my* parents but since he pretty much only wears band shirts, I doubt it was much different from what OP was wearing. I just don't see what's the big deal",
          "id": 134,
          "comments": [
            {
              "score": 545,
              "content": "[removed]",
              "id": 135,
              "comments": [
                {
                  "score": 206,
                  "content": "[removed]",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "[removed]",
                  "id": 137,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "[removed]",
                  "id": 138,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "[removed]",
                  "id": 139,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 446,
              "content": "My partner of 6 years was definitely wearing some thrash metal Tshirt and his favorite Cattle Decapitation hoodie when he met my parents. I was wearing a beat up star wars Tshirt and cargo pants when i met his. The *only* thing I can say is that since he knew they were from a different culture he probably should have clarified expectations. But yeah all these people freaking out about some imaginary \"dress code\" to meet the parents is so 1950s.",
              "id": 140,
              "comments": [
                {
                  "score": 265,
                  "content": "[removed]",
                  "id": 141,
                  "comments": [
                    {
                      "score": 110,
                      "content": "This should be higher. \n\nHe had to comply This imaginary dress code that existed in 50s and he because he didn’t it’s “clear”that the girlfriend is doing “all of the mental labour” and “shows lacks of commitments because he didn’t bother to ask”",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "There's also a lot of highly upvoted comments in here making very specific cultural assumptions that apparently apply to every Indian person ever. Not a great look!",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I’m extra fascinated by it in this particular instance. The vitriol over a tiny faux pas is astounding.",
                      "id": 144,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 39,
                  "content": "I would be happy if in the future my kids brought home a partner wearing an Iron Maiden shirt. I’d prefer that over many, many things actually.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 27,
                      "content": "If my hypothetical kids wanted to being home either a metalhead or a \"respectful\" kid wearing anything with the Confederate flag on it, I'd tell them to pick the metalhead. Metalhead communities are far and away some of the most nicest, most welcoming people I've ever met.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I've said this a bunch in these comments but my sisters abusive ex wrote a suit/tie to meet my parents. Putting on a show doesn't mean anything, if nothing else that dude did shit to make himself look good.\n\nWhen it came out he beat her, my parents did not believe he did it at first",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I honestly thought I was just out of touch or something when I saw everyone jumping on OP for not having thought to dress up on his own to meet her folks. Some I saw tried to blame it on a lack of morals being taught in the upbringing (yes sir, no sir) and not only do I absolutely hate the expectations of saying that to people.\n\nI think that expecting other people to dress or act a certain way that isn't what they'd want or normally do is rude to them. It shows that they embarrass you by being who they are. I feel like the expectations of dress code and speech code isn't really coming from a place of morality or politeness if it's forced.\n\n-\n\nAnyway, op you are NTA. I don't know what you can do to salvage the fight. Depends on how angry she is I guess. I wouldn't recommend apologizing for something you don't believe in though because that could become a trend.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I'm so happy I'm not the only NTA here.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Boomer is a mindset not just an age, my sister abusive ex showed up on a suit and tie to meet my parents 🙃\n\nLike i legit want to ask these people why they are treating meeting the parents like a job interview 😆 \n\nIf nothing else if I was meeting them at a fancy fucking restaurant ya but their own home? Uhh no",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Agree.\n\nI'm on team NAH. There probably should have been some conversation here first, and I tend to be of the feeling that a certain amount of onus falls on the one whose parents are being met. Especially where there are significant cultural differences at play and/or you know that there are going to be certain expectations that your significant other may not understand. You are the only one going into this with intimate knowledge of both parties. (Lest someone accuse me of sexism, I'd hold this view whether the SO happened to be male or female.)  In an ideal world, the SO might inquire themselves or intuit these things, but they may have grown up in families or communities where these things weren't viewed as important, and it may not occur to them that they would be expected to present themselves differently.\n\nIf you know that your family is ultraconservative and is going to object to the skimpy clothes your SO favors, that there are cultural expectations your SO may not understand, that their tendency to dress to the nines may feel out of place in the small rural farming community you grew up in, etc. why not help facilitate things? \n\nI'm more the \"come as you are, as long as you're covered, clean, and your attire is appropriate for whatever it is that we're going to be doing\" sort, and would likely be more uncomfortable if a hypothetical kid's SO showed up overdressed than underdressed. The band shirt would probably suggest that s/he is likely to fit in here.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It sounds like your parents are used to you wearing beat up Star Wars t-shirts, so they wouldn’t care about your SO’s. That makes sense. Wear ya bullshit. But OP doesn’t include information about how the SO normally dresses. (Conveniently.) If she’s not wearing those kinds of clothes, then her parents would not expect OP to wear those kinds of much, much more casual clothes. Like, you must admit: the most possible casual clothes other than PJs. The SO’s parents may not think particularly *badly* about OP, or judgmental, but because he dresses so much more casually compared to their daughter, they may get the impression that he’s *just not a good match* for her. They may not be totally supportive of the relationship, she could be subtly mocked at home, and OP will have to work harder to win over the parents approval because he’s starting at a deficit with them. OP needs to be OP, nothing should stop him from that, except his choices have consequences. Sounds like he needs to find a girl who also wears t-shirts and she needs to find someone who understands that *most parents* (50yo+) wouldn’t prefer to figure out all the implications of what the graphic on a tshirt means, in addition to what the suitor’s intentions are to their beloved daughter.",
                  "id": 152,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 329,
              "content": "[removed]",
              "id": 153,
              "comments": [
                {
                  "score": 105,
                  "content": "[removed]",
                  "id": 154,
                  "comments": [
                    {
                      "score": 47,
                      "content": "[removed]",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 202,
              "content": "My husband also lives in band shirts. He wears them to work even and he's mid 40's with adult kids and a high paying software job. Meeting parents isn't a formal occasion unless specifically told otherwise imo. I was in a t-shirt and jeans when I met his too. \nNAH just lack of communication and a cultural difference. He should apologize for offending accidentally and she should apologize for not being a clear communicator with setting expectations. Neither party can read minds.",
              "id": 156,
              "comments": [
                {
                  "score": 14,
                  "content": "Husband also in a software job. Also wears band shirts. He's 57. The only time he's ever dressed otherwise for work was when he was in the Air Force in the '80s. \n\nThe one thing I drew the line at, though, was when the graphic on the band shirts was  the only thing that didn't have holes. \n\nI guess why I'm so cavalier on all of this is that we met, courted and married before meeting each other's family. And meeting family required either a 7 hour drive or a 2 day drive, and you know what I'm NOT doing? Worrying much about what I look like when I fall out of the car.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah retiring hole filled shirts is the biggest battle lol. I also draw the line of going to events in his metal up your ass shirt. I prefer that shirt be a weekend shirt",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My husband wore a hoodie and shorts meeting some of my family. The rest of the time were tshirts of some sort. I think I wore either a band shirt or some other pop culture shirt when having dinner with his parents.",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "This.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Thanks for your comment, same here, except we both are in our 30s with quite high paying jobs in different fields, but t-shirts has always been fine for most occasions, with one exception of our own wedding. I most certainly was in the t-shirt when I met his parents, and probably shorts, probably with a lot of holes as well, it was +35C outside, so why on earth not. I doubt anyone remembers it at all, and no one should for that matter.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 186,
              "content": "Agreed. Different expectations for different families and groups of people that weren’t communicated is the issue. I wore a crusty old punk shirt probably to meet my husbands parents and no one thought twice about it. This is all so silly, tbh.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "Thank you. I was looking through comments to find this one. Im a married woman who has a really hard time dressing myself on a normal basis for social events especially since having a baby/being pretty low-income. Oversized T-shirt’s are kind of my go-to. But IMO the gf could have mentioned her family’s vibe prior. \n\nI know people are going to say, she shouldn’t have to carry the mental load (which I 90% of the time agree with) but I think a quick convo would suffice since he mentions this is how he dresses normally.",
              "id": 163,
              "comments": [
                {
                  "score": 38,
                  "content": "I'm an immigrant, explaining my culture to those who have limited exposure to it is my load to carry. I accepted this when I moved. \n\nPeople aren't psychic and if there's a cultural or linguistic faux pas I will explain it. It's fun it gets you talking about differing experiences growing up etc.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yes. She obviously knows how he dresses if he lives in t-shirts. How hard is it to say, \"hey, wear something nice when you meet my parents\"?",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "I live with my bf and we have a daughter. Our first meetings with each other parents, we both were in jean/t shirt/boots. Like i want to be presented as i am. Not what i'm expected to be. 30's and still wearing jean/t shirt/boots, even at work in a field were most wear smoking.",
              "id": 166,
              "comments": [
                {
                  "score": 79,
                  "content": "I fully agree with this. I am surprised about the top level comments as there is no reason OP should specifically go out of his way without even any heads up. Let him be himself.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 25,
                      "content": "If I was a parent, I'd prefer if my child's date dressed normally to see me. It means they are comfortable enough to be themselves in my presence",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Yeah. I met my husband when I was 25 and I was super over the whole “pretend to be a different person for the first months of dating” thing. I’m fairly certain both of us were just in shorts and a tshirt when we met each others’ parents. They still adore us (and each other thankfully).",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I have literally never changed my mode of dress to meet my partners’ parents. My ex-husband’s mom is a widow old enough to remember when the Germans took over her family’s farmhouse and she’s less uptight than most of the commenters here.",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Exactly, you seem cool, and your vibes probably matched. If homegirl is looking for a different kind of guy, then she should find a different kind of guy. honestly, the world about to melt down so I feel a little bit more relaxed about these kinds of matters.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yeah honestly I’m shocked at all the Y T A responses. Who the hell cares what kind of T shirt he’s wearing? Anyone who expects me to wear a button up shirt to meet their parents is going to be sorely disappointed",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I don’t! Everyone’s an adult, why is there so much need to fawn over these people? Why can’t you just be yourself?",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 316,
          "content": "Finally some sense. \n\nI am 38, my boyfriend is 42 we dress casual, both of us, no heels, no button downs shirt, lots of sneakers. \n\nWe are well adjusted, home owners , careers and all of that (for the person who said we must be in our mom’s basement) \n\nIt doesn’t mean that it’s not nice, or cool or even fashionable or appropriate. \n\nShould there be an occasion like a wedding, we will comply but unless specified it seems weird to me to change your style. \n\nAlso doesn’t the girlfriend knows him and what he normally wear? She could have easily said “hey my parents are a bit old school, can you wear a button down shirt?” \n\nNTA",
          "id": 174,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 271,
          "content": "Finally some goddamn sense.",
          "id": 175,
          "comments": [
            {
              "score": 38,
              "content": "Right? My parents literally would not GAF and I wouldn't want a partner to dress like they're going to a interview because that is stupid. I want them to present themself as they are, it's painfully obvious when people \"dress to impress\" and not at all genuine.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "If we had been the parents, my husband (57) would have taken him upstairs to listen to music, and my daughter and I would have ended up visiting each other!",
          "id": 177,
          "comments": [
            {
              "score": 113,
              "content": "I like that most comment are “you’re not a teenager anymore” when Iron Maden fans are in their 50s lol",
              "id": 178,
              "comments": [
                {
                  "score": 22,
                  "content": "I'll have you know I'm only in my 30s!\n\nBut given they've been releasing music for 41 years now there's a pretty big range..",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "This made me lol",
                  "id": 180,
                  "comments": [
                    {
                      "score": 23,
                      "content": "The parents should have asked “well can you name 3 songs?”",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I'm 3rd generation maiden fan, 70's 50' and 30's \nIt's amazing to go to their concerts when you see all walk and ages of life there",
                  "id": 182,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Im 39 and a big metal head, iron maiden were.a bit before my time though and I never got into them",
                  "id": 183,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 97,
              "content": "Yeah, if any of my kids brings home a date with an Iron Maiden t-shirt on, I'd be overjoyed.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 136,
          "content": "While I understand those voting otherwise I am with you on this.  My wife's family are mostly farmers and truckers and don't even have a suit if there is a wedding or funeral.  I work in tech so hoodies and t-shirts is my professional attire most days but have a couple suits specifically for weddings, funerals, and other more formal events.  I've adapted over the years to dress down for holidays and such but show up for weddings and funerals in a suit as that's just too engrained in my from growing up in my own family and it would just feel disrespectful to show up to a funeral in a t-shirt even if I am the only one dressed nicely and getting looks or offhand comments from others.  Every family is different and I am NAH because I think both OP and his GF should have communicated about the expectations and norms of GFs family.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "I met my ex-wife's folks wearing band shirts and chains with my hair down. I'm a died in the wool metalhead and she was a goth.\n\nBUT, I was making the effort, all clean fresh, newer clothes, freshly shaved face, freshly washed hair, etc. I avoided anything with swearing on it.\n\nThere are social and cultural expectations that vary by group. Evidently a lot of people on here are from the group where meeting the parents for the first time is a dressy affair, not just a dressing nice affair. \n\nAlso, UP THE IRONS!",
          "id": 186,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 76,
          "content": "Agreed, I think he probably should have checked with her but she probably should have mentioned it to him also. It wouldn’t have even crossed mine or my parents mind if my spouse came to meet them in an iron maiden shirt. It completely depends on the family, my family is super casual and when my spouse first met them it was a BBQ outside with loud kids and honestly we’d be lucky if my dad was even wearing a shirt.",
          "id": 187,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 44,
          "content": "This is the correct response. Adjust your expectations for next time and everyone moves on.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I legit feel like I'm going insane reading these comments. Maybe it's because I'm a low class Midwesterner, but I think people in both my region and socioeconomic status would think it's weird if you showed up like you were going to a job interview.",
          "id": 189,
          "comments": [
            {
              "score": 11,
              "content": "Yeah I see some people saying she needs to run away from him as soon as possible because of this lol.",
              "id": 190,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "This exactly. I grew up poor. No one I knew dressed up to meet parents. Those clothes were reserved for weddings, funerals and church. I don’t think poor people tend to do formalities as a general rule.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "I’ve never seen any of my exes or my current bf wear formal clothes to meet my parents, is this a cultural thing or something?",
          "id": 192,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3354,
      "content": "[deleted]",
      "id": 193,
      "comments": [
        {
          "score": 597,
          "content": "If I could spare the coin for a gold award, I would give it. This here is exactly what my husband and I just discussed with each other (we're both white Australians as well xD), and we can definitely understand the potential cultural fallout, but there definitely needs to be communication. All the Y T A votes are surprising me here, and I absolutely believe that there are NAH.",
          "id": 194,
          "comments": [
            {
              "score": 295,
              "content": "I was also very surprised. Where I'm from (Netherlands), meeting the parents is a very casual thing and there's nothing formal about it. Really must be a cultural thing",
              "id": 195,
              "comments": [
                {
                  "score": 17,
                  "content": "my then bf met my mom and her then bf in the community sauna. We were butt naked. It didn't even feel awkward, just... normal.",
                  "id": 196,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "100% agreed! I’m so surprised by all the YTAs. I’m Indian too and my Spanish boyfriend met my parents for the first time while he was wearing a T-shirt with Patric Star (or maybe SpongeBob) on it and it wasn’t a big deal at all. \n\nI’ve lived in Germany a very long time and can also confirm that meeting your partner’s parents is an incredibly casual thing here as well. The only time I can foresee dress code being an issue is if they invited me to a nice sit-down dinner some place fancy and I showed up in a T-shirt or sweatpants.\n\nNTA OP, but I still think you might want to consider apologising to your girlfriend about the misunderstanding. I do agree with one of the other posters about how Indian parents can be somewhat critical of things that might not seem so obvious to someone if they’re not from that culture. You should have a talk with your girlfriend and try to clarify some of these things before you meet her parents the next time.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 118,
              "content": "We’re the exact same, I wonder if there would be more NAH if this sub was all Aussie cause my husband and I never dressed up to meet each other’s families, it never even occurred to me!",
              "id": 198,
              "comments": [
                {
                  "score": 23,
                  "content": "American here. NTA in my opinion. If she expected him to dress nicely, why not tell him.\n\nI read a comment that he should put in some thought to learn about her culture but has she done anything to teach him about her culture? Relationships are two way streets.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 225,
          "content": "Finally a reasonable answer. I get that its silly to wear an Iron Maiden t-shirt to an event like this but to go as far as to call the guy an AH for it seems a bit much imho",
          "id": 200,
          "comments": [
            {
              "score": 15,
              "content": "Exactly. Maybe his family just really isn't the kind to overly stress this sort of thing. It doesn't make him an asshole to not have known that her family would have different expectations if those expectations weren't communicated clearly in the first place.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 135,
          "content": "Yeah the expectation for OP to automatically dress up when first meeting his gf's parents is weird. As adults both my siblings have introduced people to our parents in casual dress, Halloween costumes, whatever (I'm engaged but my fiancé and I have been together since high school, so he met them as a teenager and thus different situation). If GF had specific expectations she should have voiced those and not expected him to be a mind reader.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Thank you! When I met my fiancé parents, I was in t shirt and jeans, and when he met my parents, same thing, plus it was 6am- my mum was in her dressing gown. \nMaybe it warranted a more in depth conversation of what the expectation is",
          "id": 203,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Agree 100%!! When my BF met my dad and stepmom, he wore very casual clothes. Sounds like more of a miscommunication, and while OP could’ve asked what to wear (like a lot of the Y T A votes are saying), his GF could have said something, too. OP should just apologize, and follow your advice with the discussion.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Agreed! But if I may offer another perspective as an Indian woman – my parents wouldn't care. They're not all that protective, if anything, my mother would be more mad about me wearing a crop top haha.",
          "id": 205,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Yeah this is a clear case of mixed expectations, possibly based on prior experience. The few times I’ve met the parents of people I’m dating it’s been incredibly casual; dinner at their house to just say hi and meet each other, friendly conversation, I don’t even remember putting too much thought into what I wore and it’s never been an issue. My clothes are clean and I have a sense of style, that’s really all that matters. If there’s a different expectation from what I’m normally wearing, tell me. If she knows her BF wears certain clothes that won’t fly for her parents, say something. \n\nAll the Y T A comments are like “c’mon dude, your clearly in a romcom from the mid 2000s where your GF has overprotective parents and you showed up with pink spiky hair, a studded collar necklace and skull t-shirt!”",
          "id": 206,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Yeah I don't get people saying that Meeting The Parents is such an event. If it was at a restaurant or something, yeah dress up. But just to chill at their house? You wear clothes that are clean and comfortable, which for me would probably be nice jeans and a band shirt. If the girlfriend had different expectations, she should have communicated them",
          "id": 207,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Agreed. If I want my fiance to wear something nicer, I tell him.",
          "id": 208,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I completely agree that this was just a misunderstanding of cultural differences. Maybe he should have asked his girlfriend what would be appropriate, but by default wearing clean casual clothes to meet your girlfriend's family in a casual setting isn't really an \"asshole\" thing to do.\n\nNaiive maybe, but not malicious or \"assholey\".",
          "id": 209,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1655,
      "content": "YTA. 1. You always ask the new girlfriend what to wear to meet the parents. It shows you care. And 2. whether you like it or not, you didn’t do your homework on Indian parents. They are EXTREMELY conservative when it comes to such things (have you never been to the movies or watched The Office?). Tradition is a huge part of their DNA, as their culture goes back over 10,000 years, whereas American culture only goes back 250 years. Tell her you’re sorry, and have her go with you to pick out some nice clothes for you to wear next time. It will show her and the parents you care and are making the effort.\n\nEDIT. I apologize if any of this is offensive. I was trying to be humorous. Obviously, I don’t think Indian culture can be summed up by the media, but some Indians got it and like my comment. I was trying to help the poor guy think about it a little deeper, that’s all.",
      "id": 210,
      "comments": [
        {
          "score": 430,
          "content": "I agree with you to a point, but you are putting the mental load on the girlfriend to be the source of information for OP. OP has google, can go to a store and ask advice about how to dress for certain scenarios. We woman are tired of making basic decisions for men that they can figure out on their own. We have had to. Use a bit of critical thought and let go of weaponized incompetence because this guy didn’t feel like planning and doing his laundry ahead of time and having more than a graphic t shit clean for an important dinner.",
          "id": 211,
          "comments": [
            {
              "score": 464,
              "content": "Agree in principle and empathize with the frustration, but she is the best source of information about _her_ parents.  For other wardrobe decisions, he’s on his own.",
              "id": 212,
              "comments": [
                {
                  "score": 160,
                  "content": "Right, but a better way would be to say, \"I'm planning on wearing my green checked button down, with khaki pants.  Does that sound appropriate?\"  And then let her take it.",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "I think the comment was just trying to say that they can go pick out some new clothes together to further show the girlfriend that he wants and values her opinion. You’re right that he totally can get an outfit in his own, and it’s quite a red flag if he isn’t able to. But I think the comment wasn’t trying to “put the mental load on her” so much as just further show that he values her opinion",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "The mental load of dealing with the girlfriends parents SHOULD be on the girlfriend. Dealing with his OWN parents should be on him. This is hardly weaponized incompetence. Unless he's going to turn into Joe Goldberg how else would he learn about her parents expectations other than from her?\n\nAnd no where does he say he didn't do laundry, all he says is that he just grabbed a clean shirt to wear. Personally, I tend to wear about 4-6 shirts 99% of the time while the rest barely get used. Those shirts are my favorite shirts, and the ones I'm most comfortable in and feel I look the best in. I read it as he grabbed ol' reliable as opposed to \"the only clean thing.\"",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Lol communication is now a \"mental load\". 2023 version of \"if you don't know why I'm mad, I'm not gonna tell you\". Being mad about a shirt is weird too begin with. Expecting someone to constantly Google what expectations their significant other may or may not have is even weirder. Just communicate",
              "id": 216,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "It’s your damn partent meeting your parents. If he asks to be sure just answer . If you don’t want to take any part in your relationship then just stay single. Op should know better than go with that g shirt but saying that a SO asking their partner about what they parents like or dislike as they are individuals not a monolith is putting all the mental load on them is quite ridiculous",
              "id": 217,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "On the other hand, the girlfriend really is the only source of information for OP on her parents.  One can generalize about any given culture or situation, but there often are exceptions or variables. There is a difference between making a decision for someone and providing that person with information and encouragement. \n\nThat said, the fact that OP didn't have the sense to figure out that a t-shirt for a metal band was not a good choice is not something the GF could have fixed with encouragement.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Asking someone about their parents’ expectations before meeting them isn’t weaponized incompetence you knob. It’s performing due diligence. \n\nIf you’re putting up fences that aggressively over something this simple, you really shouldn’t be in a relationship.",
              "id": 219,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": ">I agree with you to a point, but you are putting the mental load on the girlfriend to be the source of information for OP. \n\nFor her parents?\n\nIt is. If you have standards you want someone to adhere to, the load's on you for that one.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "She knows her parents though. If I were taking someone to meet my parents, there'd be no issue at all with them wearing a band shirt - they're pretty casual, and meeting parents tends to be pretty casual where I live at least. I'm a woman, and would definitely need to ask my partner what to wear because expectations differ so much.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You're kidding, right?\n\nThere is no one size fits all appropriate clothing here. The *only* person he can ask or who could say on their own is the girlfriend.\n\nIt's unreasonable for him to guess what is appropriate or ask some random person who the internet what is correct. That is so varied it won't matter.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 313,
          "content": ">Tradition is a huge part of their DNA,\n\nWhy do people all rush to upvote such insanely racist shit?\n\nNope, Indians don't have tradition in their DNA. They aren't all conservative. They're just fucking people, jesus christ.",
          "id": 223,
          "comments": [
            {
              "score": 93,
              "content": "\n>Why do people all rush to upvote such insanely racist shit?\n\nCuz they think it supports whatever argument they're making and lack critical thinking skills lmao",
              "id": 224,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 71,
              "content": "Yeah, my dad is an Indian immigrant and doesn't care about any of this lol. He has a normal expectation that people will dress nicer for nicer events, but I'm pretty sure my and my siblings' partners all met him wearing jeans and a t-shirt and he didn't think twice about it, because he was dressed the same way! I know my parents and I know my partner, so if I know we should dress a certain way for an event with my family then I communicate the expectation ahead of time. Especially for a first-time meeting, can't expect people to inherently know the standards of other people they've never met before unless I give them that info in advance",
              "id": 225,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Thank you!",
              "id": 226,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "Even if every single Indian cared very much about tradition, that would still not make it a genetically determined thing lol, tradition is a societal concept and has nothing to do with your DNA.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 154,
          "content": "So you automaticly assume a stereotype based on which country they come from, but also take your source from a tv-show? Thats pretty bigoted",
          "id": 228,
          "comments": [
            {
              "score": 70,
              "content": "Yeah fucking hell. What a bigoted thing to say. How are people agreeing with that statement?\n\n\"All Indian people are exactly like the stupid stereotypes Americans make them out to be\"\n\nWhat fucking nonsense.",
              "id": 229,
              "comments": [
                {
                  "score": 25,
                  "content": "And a show like The Office, which by design has somewhat cartoonish characters, is not one I would want to use as my basis for understanding other cultures lol",
                  "id": 230,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 118,
          "content": "I like how you've based your knowledge on Indian cultural conservativism from the Office.",
          "id": 231,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 94,
          "content": "It’s pretty stereotypical to say that all Indian parents are “*extremely* conservative,” but okay. You can keep being racist.\nETA: I am, in fact, Indian. I have Indian parents. So if you’re going to come at me saying that I’m just ignorant to Indian culture, please kindly check yourself. If you’re not Indian, please don’t tell me that not all generalizations are harmful",
          "id": 232,
          "comments": [
            {
              "score": 38,
              "content": "Why r u being downvoted?\n\nI'm an Indian.. you just said the truth 😭",
              "id": 233,
              "comments": [
                {
                  "score": 23,
                  "content": "I think many people assumed that I just don’t know about traditionalism in Indian culture. Maybe people perceived my comment as a white savior thing and using racism as a buzzword, which is why I later added that I’m an Indian. Though I did reply to people that I actually have Indian parents, and some just doubled down 🤷🏻‍♂️",
                  "id": 234,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Also can we talk about how this girl is bringing home a white guy that she’s only been dating for a few months and people are still assuming the stereotype that she has extremely conservative parents??? Like for real?",
              "id": 235,
              "comments": [
                {
                  "score": 14,
                  "content": "Indian in an interracial relationship here. Totally agree, I think people have no idea what real conservatism looks like in this situation. Her parents haven't asked for anything that I couldn't see someone of anything background wanting.",
                  "id": 236,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah, I wrote this coming from the same place as you, only my parents never cared about the clothes. If I had expectations I would have had to spell it out.",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 77,
          "content": "Okay, but like... Oof... Can you imagine if he literally googled \"What do Indians like\" or something like that beforehand? Wouldn't that just be cringy racism, even if his intentions were good?",
          "id": 238,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 58,
          "content": "[deleted]",
          "id": 239,
          "comments": [
            {
              "score": 7,
              "content": "Stereotyping an entire race based off a TV show is the best answer in the thread? Holy fucking reddit moment",
              "id": 240,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "Lol basing stereotypes on tv shows is what gets people in trouble buddy",
          "id": 241,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "I agress, except maybe don't pick the office to learn about the culture of indian people.",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I don't think that \"Indian parents\" detail is necessary,  any parents meeting deserves a little effort",
          "id": 243,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1548,
      "content": "NTA I hate people that judge others by the way they dress, it's not a fucking job interview and if it was so important she should have told you before hand.\nI just can't fathom expecting my newly found gf to wear heels and a fucking dress to meet my parents, even more so, why lie and dress like the person you clearly are not?",
      "id": 244,
      "comments": [
        {
          "score": 80,
          "content": "There's a difference between dressing up for the occasion and dressing up as someone that you are not. My taste in clothes is kind of weird - think \"hippie meets garbage can - but when I know I am going to meet someone for the first time and want to make a good impression, I am going with the more elegant dumpster dress and not with the comfy one that got stains and a rip I patched with a cat butt patch I crocheted myself.",
          "id": 245,
          "comments": [
            {
              "score": 7,
              "content": "Ngl off that description i want to see the comfy dress with the butt patch. That sounds awesome",
              "id": 246,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "It's about respect.\nHe didn't have to wear a tuxedo. And being that clothes are not important, how does a shirt define \"who you are\" so much that you just gotta wear it as some kind of representation of your character?",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1232,
      "content": "I’m amazed at the people acting like meeting the parents is a one way street here and that he is expected to be 100% deferential. \n\nIf there was an expectation it should have been communicated to him. \n\nAnd in the absence of that, it is perfectly valid for an adult to dress however they feel comfortable. They’re all adults. They don’t get to dictate how other adults dress, not do they get to dictate who she dates (and if they do, well I’d like to get that out in the open as soon as possible personally). \n\nYou did nothing wrong, OP, and the people insinuating that what you did was childish are the ones ironically being most childish. Adults don’t whine about what other adults they know are wearing. Better to set the expectation that you don’t dress up in formalwear in casual settings.",
      "id": 248,
      "comments": [
        {
          "score": 300,
          "content": "This is one of the most reasonable responses on this post. I honestly can’t wrap my head around most of the other responses here. I’m assuming since they’ve been dating, the gf knows how he usually dresses. If they were doing a first meeting at a fancy restaurant? Yeah.. different dress would probably at the very least communicated “hey we’re going to x restaurant to meet my parents, throw on a button down and some nice trousers”. But at a person’s *home*?? Casual all the way *unless otherwise specified*.",
          "id": 249,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I agree. I’ve had boyfriend meet my parents for the first time at, say, a sporting event they or I am competing in. No one is dressed up. Maybe he should have clarified first, but ultimately it’s on her if she wanted him to wear something specific.",
          "id": 250,
          "comments": [
            {
              "score": 16,
              "content": "The first time I met my ex’s parents I had just come from work, smelled like dogs, and was probably wearing a ratty t-shirt and worn out jeans, it was fine. People this obsessed with appearances though, I’m probably not going to be interested in anyway.",
              "id": 251,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "If this was a girl who wore a short skirt to meet Christian parents and bf called her oblivious and dumb.. Oooohhh boy.\n\nStill shocked by the double standards on this sub.",
          "id": 252,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "The burden is always on the one inviting to make expectations known to guests, though it's wise to ask questions about anything you're invited to.\n\n\n\nThis is even more true in a relationship event like this. If there are expectations that mean something to her, it's on her to make them known. But being a good partner, you should try and preempt that some and understand what will be wanted. Learn and move on, it's really not a big deal.",
          "id": 253,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Yeah the people in this thread are surprisingly racist and sexist.\n\nSo many people are politicizing this. It's a simple oopsie doopsie. It's not an \"interview\" to be a part of the family, it's not weaponized incompetence, it's not \"putting the mental load\" on the girlfriend.\n\nThe girlfriend didn't communicate. OP acted natural. And now she is pissed when she didn't voice her expectations. I wouldn't say she's an asshole, but needs to grow up a bit and act like an adult.\n\nETA: I actually shouldn't be surprised. Reddit is incredibly racist and hateful despite what the hive.mind says",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This is correct. I would not put up with anyone here saying Y T A. Why is it his responsibility to automatically know what her parents would want if she didn't tell him in advance? It's not a formal restaurant, it's a house. Wearing a band tee is a far cry from disrespect and if it was formal then it should have been communicated.",
          "id": 255,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah like is her dad the President or something?? Sounds like she could’ve at least mentioned the standard she wanted. I get wanting him to look well groomed, but I don’t think a t-shirt is that much of a faux pas.",
          "id": 256,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 923,
      "content": "NTA - really surprised at how many are calling you TA. As long as your clothes were clean and ironed, I don't see the problem. Surely GF's parents would care more about whether you're a nice person and polite? If your GF thought you should dress smart, she should've conveyed that beforehand.",
      "id": 257,
      "comments": [
        {
          "score": 589,
          "content": "no one has ever ironed an iron maiden shirt",
          "id": 258,
          "comments": [
            {
              "score": 177,
              "content": "Ironed Maiden is my favorite band",
              "id": 259,
              "comments": [
                {
                  "score": 22,
                  "content": "The most tidily-dressed metal band of all time",
                  "id": 260,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "best reply",
                  "id": 261,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "😂",
              "id": 262,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I did once but there was NyQuil involved. Don't do chores when you're barely conscious folks",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Who is ironing casual clothes anyway lol",
              "id": 264,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Geez, maybe my mom. She was both a clean freak and a metal head",
              "id": 265,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 191,
          "content": "I’m also surprised. Of course meeting parents for the first time is something important, but I wouldn’t dress any different than I would usually dress. But I see here many people don’t think that way.",
          "id": 266,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Lol it’s an Iron Maiden T-shirt not an ironed Maiden T-shirt.",
          "id": 267,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 603,
      "content": "NAH. South Asian in his late 30s here. I think your girlfriend sees this as her being relatively more invested in the relationship, because you wore whichever clean t-shirt you had lying around to meet her parents for dinner. For you, it's just how you dress to meet anyone. I can see both sides.",
      "id": 268,
      "comments": [
        {
          "score": 36,
          "content": "[deleted]",
          "id": 269,
          "comments": [
            {
              "score": 6,
              "content": "There you go, I was searching for this comment. You know if there are expectations others may need to be aware of and you can gauge if your SO needs a heads up. I would never let my SO walk into a social situation with my family without outlining their weird or quirky expectations. My only question would be if his usual style of dress was something different than a tshirt and he usually wore a button down shirt - if this shirt/style of dress was unusual and he wasn’t prone to dressing in tshirts or band tshirts then she may have thought it was unnecessary to say something because he ALWAYS previously looked appropriate/dressed appropriately and that his usual style would be acceptable. You don’t bring home boys to parents who are judgmental without prepping/warning them.",
              "id": 270,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}