{
  "post content": "The ex and I divorced last year and the divorce decree states she gets to claim the kids which I agreed to. She refused to get a job until October (child support and free rent at her mom's was enough for her) and it was a part time job. Now it's time to file taxes and I owe $1700 which sucks. I asked her since she's barely going to get anything back if we can have me claim the kids as dependents (she'll still get the earned income credit) and I would pay her half of whatever I save by doing so.\n\nShe rejected that offer and when I pressed why she would throw money away she told me she's going to let her mom claim the kids so that way she can get all the tax savings from her mom in cash. I told her if she did that I would claim the kids too and let the IRS decide. I told her if she tries to backdoor this and I win I'm not giving her any of my tax savings. However, we could come to an agreement now and split it 50/50. Am I an asshole for thinking that since she's not claiming the kids like the divorce decree states that I shouldn't be next in line? \n\nSome context:\n\nI'm active duty and overseas so I can't have the kids outside of summer. I am officially the non-custodial parent but joint legal custody. I'm up to date on child support and never have been behind. She may have paid her mom rent with child support. Either she did and her mom didn't provide much financial support at all, or she didn't and she's been receiving free rent which isn't currently in the child support calculation and I'm not pressing it. I have offered her financial advice during the divorce and even gave her half of a bonus while officially separated without her even asking for it because I thought it was the right thing to do.\n\nTL:DR, don't blame you, I wouldn't want to read it either... But I'm living it... So help, anyone?",
  "id": 1,
  "comments": [
    {
      "score": 142,
      "content": "This kind of seems more appropriate for r/legaladvice or r/financialadvice.\n\nThat being said, if you can show that your ex isn't following the divorce decree, then you can file for a change of circumstances or otherwise petition to amend the mandate. If her mother isn't a primary caretaker for the children, then she may not be able to claim them as dependents. However that is for a court to decide and you need to figure out if that's worth the effort.\n\nIn any event, if you also disregard the divorce decree as you are suggesting in your post, then ESH.\n\nRemember that you put yourself in a stupid position by disregarding legal mandates. Why would you risk that? Follow the legal solutions available to you.",
      "id": 2,
      "comments": [
        {
          "score": 28,
          "content": "Thanks for the reference. I risked it because she was also wanting to fight for my military pension and her lawyer threw in a bunch of bat-shit crazy ideas. Getting her to back off saved me thousands in lawyer fees.",
          "id": 3,
          "comments": [
            {
              "score": 54,
              "content": "to piggyback off of the above comment: The IRS doesn't give a fudge about divorce decrees, but I assume the courts give a fudge about parents following divorce decrees. This sounds like lawyer territory. Don't do the wrong thing just because your ex is also doing the wrong thing. But I wonder how much of a hassle it would be to find out whether the money from those tax returns was spent on your children. YWBTA for playing as dirty as your wife",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "Don’t go to r/legaladvice. Those people aren’t lawyers. There is a whole sub that’s mostly dedicated to calling out the terrible advice given there. People troll it with planted questions just to watch them screw it up.\n\nYou need to talk to an actual lawyer. I’m not an attorney, either, but this whole thing sounds sketchy as hell whether it’s you claiming kids you don’t have custody of or her mother claiming them in order to give her daughter the cash. $1700 is not worth getting in trouble with the IRS, and only an actual attorney can help you figure out how to move forward.",
              "id": 5,
              "comments": [
                {
                  "score": 15,
                  "content": "The IRS has rules for non-custodial parents claiming children as dependents if the custodial parent signs off on it. I just can't claim the Earned Income Credit.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I feel like this proves my point that you need to talk to someone who is not on Reddit. We often have no clue. 😂\n\nSo you want to do something not sketchy overall but against the technicalities of the divorce decree, but your ex wants to do something sketchy AND against the divorce decree. You’re definitely not an asshole!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Even more of a reason to involve an attorney and talk to an accountant. If she's already demonstrated her willingness to make inappropriate demands, how do you think she'd react when she can PROVE that you've violated your divorce decree?",
              "id": 8,
              "comments": [
                {
                  "score": 4,
                  "content": "If she doesn't claim it and gives it to her mom... Is she not violating it too? Doesn't say it's her's to give away. It says she WILL claim them. It sucks all around. I wish the situation didn't present itself",
                  "id": 9,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I am not currently a tax accountant, but I was one and this is NOT tax advice, just some helpful info. But, her mother claiming the children for tax purposes might violate the agreement, but the IRS doesn’t care as long as they pass the dependent test for her. You’d have to pursue it in court because the IRS won’t.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "No idea I'm not a tax accountant or a divorce attorney. \n\nHere's the thing though. You aren't entitled to it based on the divorce decree, she is. She IS using it, just not ethically. So the question here isn't about who is entitled to it, the question here is about weather or not your ex and her mother are engaging in tax fraud.\n\nWhich do you think will give you more leverage? Your wife splitting your refund with you, or your wife engaging in tax fraud and possibly violating your divorce decree?\n\nWhich do you think will give HER the most leverage? You filling a legal dispute after she's potentially done something unethical/illegal, or you violating your decree out of spite?",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Claiming dependants is about who is paying for that dependant's expenses. If your ex's mother is paying for more than half of your kids' expenses, including where they live, then yes, she is well within her rights to claim them.\n\nYou, however, saying that you'll just claim them too and \"let the IRS decide\" is about the stupidest, most naive thing you could possibly do. We're talking \"IRS does a massive audit on you and potentially garnishes your wages with thousands of dollars in fines and fees for tax fraud\" levels of shit hitting the fan. Do not do something so abjectly stupid. You need to be talking to a lawyer. Not Reddit, including me.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "No she would not be violating it if she let her mom claim them. But if you claim them without a paper signed  and she calls them up with the divorce paperwork  they will audit you. This happened  with someone i know and didnt end well for the guy",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "According to the IRS, her mother is indeed allowed to claim all of them because she supports them financially (per the upkeep statute) at 51% or greater. So IRS wise, they will win because the ex's mother is indeed head of household.\n\nAs per divorce decree, that's different. Your divorce decree doesn't specifically account for this situation because neither one of you are technically providing more than 51% of the children's upkeep/housing/etc. You're going to have to talk to a lawyer if you want to know your exact rights here. It's up to you if you think paying the lawyer's fees is worth any money you may or may not get.\n\nAnd do NOT double claim those kids because you do NOT want to play games with the IRS. Given how understaffed the IRS is, it might take a couple of years to get through everything involved, including the audits of past files that they can (and usually do) require. And you can absolutely be penalized financially / legally if the IRS determines you purposely claimed something you aren't entitled to because that's fraud. Source: My sister went through this with her AH ex. Took her 2 damn years to resolve the issue the first time he did it, which means she didn't get that tax return until well after she needed it. The second time he did it, they resolved it in 8 months. The third time he did it, they got the law involved. The IRS doesn't give af. \n\nAnd as always IANAL, but man do I recommend avoiding dragging the IRS into your life any more than necessary.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Also, if you are active duty and caught breaking the law (regarding claiming invalid deductions) you can get in serious military trouble too.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 75,
      "content": "[deleted]",
      "id": 16,
      "comments": [
        {
          "score": -31,
          "content": "You're assuming a lot. I go all out for my kids while they're here in Europe with me. We visit different countries and go see things they can't in the US. I do all of this to broaden their appreciation of the world and to get out of the small town mentality I had. That $700 for each parent would directly benefit the kids while the US and abroad. Not to mention, help cover the thousands we spend in airline tickets to get them here. I don't want to go to court and don't think I'd need to. I'm pretty sure the IRS would handle it when they see two tax returns claiming the kids. One by a father and one by a grandmother.",
          "id": 17,
          "comments": [
            {
              "score": 14,
              "content": ">  I'm pretty sure the IRS would handle it when they see two tax returns claiming the kids. One by a father and one by a grandmother.\n\nIDK man, better to be \"absolutely sure\" than \"pretty sure\" on this one. Morally, I think you're in the clear since you do provide financially for the kids, but I think this is less of an \"AITA?\" kinda question and more of a \"Am I sure this won't backfire on me?\" deal. That's just my take on it.",
              "id": 18,
              "comments": [
                {
                  "score": 7,
                  "content": "I think the IRS cares about who files first",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -12,
                  "content": "Sorry, I shouldn't have said pretty sure. They do review once the same SSN is claimed as dependent more than once. I think it falls on my favor, but even if it doesn't I would only have to file an amended return without it.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Except the kids don’t live with you. They live with your ex, who sounds like she is financially dependent on her mother. \n\nIf the grandmother gets the deduction, that money will go for things the kids use, like their home, food, and clothes.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "The IRS goes by whomever the kids spend more physical days with, if theres a conflict, regardless of what any court docs might recommend. If your ex lives with her mom then she would win.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Unless you lie on it they'd split it between where the kids actually lived. If they lived with you 3 months you'd only be entitled to that 3 months and nothing more.",
              "id": 23,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 52,
      "content": "YTA - You're asking her to help you commit tax fraud.  You're not the custodial parent, you can't claim the kids as dependents. And you're asking her to do so ***at her expense***, when she is the custodial parent and does have that right.\n\nSoliciting someone to help you to commit a crime that would be harming them is very, very AH.\n\nIf the grandmother actually provided care and custody, she may have the legal right to claim the kids.  But you absolutely don't.\n\nThe question is not who is the child's closest relative, the question is who is doing the actual work of caring for the child.  You weren't even in the country, and certainly weren't doing that work.",
      "id": 24,
      "comments": [
        {
          "score": -19,
          "content": "Thanks for your input. I don't know if you read through the comments already but I do have a claim if the mother does not claim them. The mother made almost nothing and won't get anything back meaningful by claiming them that's why she's wanting to use her mom. Her mom did provide housing but that's hard to put a dollar amount on where as I have it documented exactly how much support I gave and I had them for a portion of last year.\n\nNo where am I trying to do anything that isn't built into the IRS laws. They even have forms for what I'm trying to do.",
          "id": 25,
          "comments": [
            {
              "score": 28,
              "content": "If her mother provided housing, she has more right than you. Non custodial parents cannot claim children that do not live under their roof for 6 months or more. If you have special laws in regards to military status, you’re still pushing her when she’s already said no. Double filing a child with the IRS can land you in court for tax fraud.",
              "id": 26,
              "comments": [
                {
                  "score": 2,
                  "content": "to piggy back.  tax laws changed last year making it so it doesn't matter how many dependents you have.  it gives you no tax savings. read up on the new laws",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "If they are living in her mom's house, the mom can claim them as dependents and has a hell of a lot more right than you to do so. If you file and she does too, that's tax fraud, period.  YOU will be the one in trouble. The IRS *will not* side with you. If you try to go at the court saying you deserve it because you paid your mandated child support, they'll laugh in your face - because the same court order states you ex gets to claim them on taxes! You can't say you held up your end so you get to take from hers. Even if she is paying her mom rent, the child still has expenses. There's a good chance the child support isn't enough for her to afford to live on her own and work full time and pay for child care at the same time. Even if your child support payments were enough to support full time daycare so your ex could work (which I doubt) that means that all other child living expenses would be on your ex. It is understandable that you can't take them more because you are in the military - but that is why you financially support them. Because the burden has been put on your ex since you are not around.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 24,
      "content": "Granfmothet can claim them if they live there. Whoever has more overnights with the children get to claim them on the taxes, unless that parent signs form 8332 to release claim.\n\nMy ex's ex was the same situation. She let het mom claim her child credit as rent. She had every legal right.",
      "id": 29,
      "comments": [
        {
          "score": 6,
          "content": "Another detail (I'm sorry) that isn't included. I'm active duty military serving overseas and this is an exception mentioned by the IRS for not meeting the overnight majority. Thank you for telling me about your ex's ex. Good info",
          "id": 30,
          "comments": [
            {
              "score": 3,
              "content": "How do you owe $1700 while active duty?  More than half your income isn't taxable.  You must have screwed up big time on your witholding.",
              "id": 31,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "YTA. First, if she agreed to let you claim the children, you should give her your ENTIRE return, the reason being is you are saying that you will OWE 1700 otherwise.  So if you actually get a refund, you aren't entitled to any of it because claiming them reduced YOUR tax debt to zero.\n\nThat said.  She gets to claim the children because you have a court order that says she can and under IRS rules if she is \"providing\" more than half their support, they qualify as dependents in any case.  The fact that she wants her mother to claim the children, isn't illegal or even shady.  The grandmother can claim head of household with the children and possibly her own daughter as dependents.\n\nIt sounds to me like you are trying to cash in not only on the tax benefits but also sneak your way into the stimulus checks that might be coming if congress decides to add monthly checks for children to the mix.\n\nThe fact is YOU owe taxes and if you didn't plan ahead to try to minimize your liability, it is on YOU.  I've been filing my own taxes since I was 15 without help from a tax preparer and I've never owed the IRS because I filled out my paperwork correctly and had the correct amount deducted each payday.",
      "id": 32,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 13,
      "content": "YTA this would be you using your children as a tool to pay less taxes. You don't have any right to claim them as your dependants considering they aren't. And her as their custodial parent has the right to if she wants to.",
      "id": 33,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "The IRS does not care about custody agreements, they care about overnights. If you both claim, and she proves she has them more nights, they will force you to pay everything back. If you have a court agreement where you can claim them and she claims them, you have to go back to court to enforce it.",
      "id": 34,
      "comments": [
        {
          "score": 1,
          "content": "Are you referring to the grandmother or the mother?",
          "id": 35,
          "comments": [
            {
              "score": 7,
              "content": ">to a lawyer, and drag the whole thing into court, and try to get the decree amended... but you're not doing this for your kids, for their safety or health or wellbeing. You're doing this so you don't pay as much in taxes.  \n>  \n>Quick math problem: What is the total tax savings in question ($1700 or less) divided by the hourly fee your lawyer charges you, plus the costs for calls and postage between you and the lawyer and you and your wife? How quickly would the costs of this fight exceed the tax savings you were hoping to get? And if you either can't or won't answer this question, the\n\nI think he means that either the mother or the grandmother would be listed as primary custodians since they have them 66% of the tax year (if you do summers).  It doesn't matter how much you spend, what matter more is custody.  If your ex's mother is supporting her or and the kids, she could get deductions for having an adult dependent.  Its been a while since I had a tax class, but if she provides over 50% of your wife's living expenses and is a blood relative, this is easy to do and it means that you wife cannot claim dependent since she herself is one.  Which might be why she is having her mom claim them.",
              "id": 36,
              "comments": [
                {
                  "score": 1,
                  "content": "Hm, interesting. Thanks for your input",
                  "id": 37,
                  "comments": [
                    {
                      "score": 1,
                      "content": "My mom is kind of in the same situation as your ex's mother, providing support for a grown woman and 2 kids.  I tried to get my mom to claim all 3 as dependents but she didn't want to make my sister angry.  Every year, my mom misses out on thousands in deductions and credits and my sister doesn't help out at all with the basic necessities.  \n\n\nIt sounds like you provide money for the family and the grandmother provides housing (which could be 50% of the expenses for the child), so you both should rightfully split the credits, but you can't go 50/50 on taxes so you kind of have to rely on the other person to be decent. Maybe you can work out something where you claim just one of the kids?  \n\n\nI don't think you are wrong or an asshole.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "YTA - you have a legal court document that says she claims them.  You are not custodial parent so you have NO right to claim them as dependents because you don't have the expenses of housing/caring for them which is the purpose of the deduction.  Basically, you are trying to break the law so stop it now.\n\nIf she does have someone else claim them, then you report it to the IRS.",
      "id": 39,
      "comments": [
        {
          "score": 4,
          "content": "But I do have rights to claim them, it's in the IRS rules. If she signs a form it's all legal. And my child support I supplied counts for way over 50% of the support they received in 2020. It just feels so wrong for her to cheat the system with her mom and I guess that's what has me hung up. That there's a legal and fair way for us both to win.",
          "id": 40,
          "comments": [
            {
              "score": 15,
              "content": "But aren't you trying to also cheat the system with what you want to do? You're trying to get out of paying the IRS what you owe for your taxes. And you're only offering her half of the return? She would be doing you a favor and essentially erasing a $1700 debt. You gave up your right to claim them, so you owe that money, sorry dude. \n\nHowever.... I don't agree with what she is doing either. This is an ESH situation honestly. Idk if what she's planning to do is legal or not, but she doesn't owe it to you to help with your tax obligation.\n\nI'm sure this won't be popular, it is what it is.",
              "id": 41,
              "comments": [
                {
                  "score": 2,
                  "content": "I agree, it sucks all around and the situation wouldn't exist if she made back any kind of kick back by claiming them. All the info I found for what I'm doing was from the IRS itself. To what benefits the kids the most and what is legal... I think my route is best. I agree with you, she doesn't owe me.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "\" And my child support I supplied counts for way over 50% of the support they received in 2020 \"\n\nHow do you know this?  Do you know the entirety of what it costs to house, feed, and raise the children?  You aren't there, so how would you???\n\nYTA.",
              "id": 43,
              "comments": [
                {
                  "score": -5,
                  "content": "I know because I know how much I pay. I know that even if they were paying rent for the entire house it's less than I pay. They aren't paying rent or if she is sending her mom money it's not much. My child support is meant for food so she wouldn't be able to claim all of that against her. I could go into dollar amounts but I know. I know what job she has, I know the days of the weeks she isn't available to facilitate a call. I know when she started. I can calculate how much she made. Even if she spent every dollar on the kids. It's still less than I paid for the year.\n\nI know this, because I know all the nuanced details of the area they're living and what the cost of living there is like.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 7,
                      "content": ">My child support is meant for food\n\nOh...wow. You really do know nothing.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "It's only legal if she signs away her right to claim them. She said no. She's not signing ie not legal for you to claim them.",
              "id": 46,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "YTA I went through a similar thing, my non custodial ex wife claimed the kids and I did also. Irs froze both refunds until they were satisfied who the custodial parent was, she lost and agrily told me she gave birth to them therefore she should be the only one who can claim them. By what you told us it sounds like a situation you will lose considering you did not have placement. You do not have to be a parent to claim dependents so grandma could legally claim them also.",
      "id": 47,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "YTA...... despite most people telling you that you have no business trying to claim the children and their mom does not want to help you commit fraud, you are arguing and still trying to justify your selfish desires.",
      "id": 48,
      "comments": [],
      "relation": "Attack"
    }
  ]
}