{
  "post content": "I'm very new , so excuse any mistakes.\n\nTomorrow is my eldest daughter's 19th birthday.\n\nShe's only ever wanted one thing for her birthday: concert tickets to see her favorite band, which is a korean band called BTS. I know she's been a big fan of theirs for a few years and has wanted to see them live for a long time. I kind of got sucked into the group a little myself, through our mother-daughter bonding time and decided that I would buy as tickets for her birthday.\n\nNow the twist was, that I had to give her her present beforehand, because the concert was going to be ON her birthday (so tomorrow).\n\nGetting the tickets was really hard and they weren't the best admittedly but when I gave them to her a few months ago, she was in tears and I've honestly never felt so happy seeing how happy the tickets made her. She was so elated, was dancing and singing and just so happy that I definitely knew I had made the right decision.\n\nNow as you can probably tell from the timing, it didn't work out. The concert got cancelled and my daughter was and still is completely devastated. She's been crying the entire weekend on and off and was inconsolable. I made it a point to sit down with her, have a talk, try to cheer her up and re-watch some of their DVDs with her but it only made her sadder.\n\nThis morning, her father and my ex-partner came by to bring some birthday presents and talk about our daughters birthday \"party\" - since we won't be traveling to the concert, we decided to have just a small gathering in the park, just my partner, my ex, I, the siblings and a few of my daughter's friends eating cake at a safe distance.\n\nHer father was apparently put off with how sad and dejected my daughter looked and asked her if she wasn't excited for her birthday. She just said not really and when he wanted to know why, she said she was sad about the concert being cancelled. He got mad and started mocking her about how priviledged she was, that she was too old to bis this hung up over a boyband and that she couldn't enjoy what everyone else was doing for her because she's so selfish etc.\n\nI blew up at him, threw him out and told him not to bother coming tomorrow. My family is telling me I overreacted and even my daughter tells me she wants her dad there but I told her he could come only if he apologized to her before that.\n\nSeemingly everyone thinks this is not a huge deal but I won't allow my ex to talk to his daughter like that, even if she permits it.\n\nAITA here?\n\n&#x200B;\n\nEdit: I thought I'd update since the \"party\" is starting soon. I was pretty upset all day yesterday about the situation but I ended up telling my daughter the decision was up to her. She decided he could come but thankfully insisted on an apology herself, which she has never done before and I'm incredibly proud of her for sticking up for herself. I talked to my ex-partner after they were done talking and apologized for my outburst but also told him that the way he treated our daughter and her hobbies needed to stop. I could tell he wasn't happy but did agree to either just accept or not comment on things that make her happy.\n\nJust as a last comment to some of the people who commented disparaging things about my daughter and her hobby: I don't appreciate it and I feel sad that some of you have apparently never had something you were truly passionate about. And for context: my daughter told me that the group is apparently going to disband soon because they have to go to the military so this might have been her only chance. ",
  "id": 1,
  "comments": [
    {
      "score": 916,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 472,
          "content": "My daughter has a tendency of letting her father get away with treating her badly, like making disparaging comments about her hobbies etc. \n\nI feel like I need to encourage her to ask for an apology first before she lets him attend her birthday party. I'm not trying to take that decision away from her but I also need to make a point that I won't accept such behaviour towards our daughter either.",
          "id": 3,
          "comments": [
            {
              "score": 451,
              "content": "Then encourage her. But that isn't what you are doing here. You explicitly *are* taking that decision away from her, what you are trying to do is immaterial.",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 140,
              "content": "[deleted]",
              "id": 5,
              "comments": [
                {
                  "score": 176,
                  "content": "True. But I do get to throw someone out of my own house for insulting her. The rest will be up to her.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 184,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 33,
                      "content": "I really hate when people come here looking for judgement and then argue with that judgement. You didn't ask about throwing him out of your house, you asked about uninviting him to her birthday party in which case, YTA. Your daughter is an adult and if she wants her dad there, he should be there regardless of your feelings about it. Not to mention, you can't exactly ban someone from a public park. You also failed to mention your daughter's reaction to his comments. If she still wants him there she couldn't have been all that upset about it. It sounds like you're being a bit overbearing with a tinge of angry ex.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "You were in a relationship with this person. That means you, at some point, were the person who had to pay for others reacting the way you are now so that you could maintain a relationship with him. He's now your ex, but she doesn't get that luxury. He's her father.\n\nI get that you want to protect her, but I think you're likely just giving her two parents to have to manage if her end goal is what most teenagers of divorce would be : keeping both parents in her life. She'd get more from a hug from you and effort to make a special, stress-free opportunity outside of the birthday to enjoy something (which I wouldn't link to the band since there's tension built up around it -- what's another hobby of hers?) than you loudly championing her and her having to smooth things over with him to maintain a functional relationship.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I am 22F and my father has said hurtful things about me and what I enjoy in similar ways and my mother reacts similar to how you do. She encourages me to block his number because I am usually sad after the phone calls because of how he praises his step son in ways I never got. So I understand what you are doing by uninviting him, but please let your daughter make this decision for herself. \n\nPersonally I have a distant and melancholy relationship with my father that I am working out internally and the little interaction that I have brings me a little bit of comfort even though it can bring up negative feelings. It is possible that, like me, she hasn't sorted out her feelings or is focused on something bigger than the drama and guilt that would come with rejecting her father. Sometimes, in my case, younger people are resilient to these remarks and understand \"this is dad's problem, not who I am.\" Alternatively it may make her life harder if he's uninvited because family guilt is one hell of a thing to go through. You did right by kicking him out of your house, but if she says she wants her father there for a important day in HER life you should respect that. Listen to her about her feelings about him, be sad WITH her, be angry WITH her but ultimately this relationship is her choice and she should be trusted to navigate it how she thinks is best.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "She's 19. It's admirable that you have her back, but you should be working with her on  how to stand up for herself. She might need therapy. You might have to let her get hurt by her father as part of the growing up process. It's insanely hard for a part to do sometimes. But she'll be a stronger and more capable person for it",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">  I'm not trying to take that decision away from her\n\nbut you are!! you're saying he can only come if he apologizes(which yes, he should). she didn't decide that, you did and you are trying enforce it.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "You're not encouraging her at this point, you're pressuring her into being your proxy in a conflict with your ex. You were right for defending her in the first round, but now you have to let her make her own choice. Anything else would be really disempowering.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 239,
      "content": "ESH but ONLY because your daughter wants him there. I think you might be a bit more upset about the tickets than she is.",
      "id": 14,
      "comments": [
        {
          "score": 95,
          "content": "I don't think anyone could be more upset than my daughter, truthfully.   \nBut I get your point.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 117,
      "content": " ESH. Yes her dad went in a bit hard but we can't deny that there is some truth to what he's saying, crying more than once and pouting about not being able to see a band is pretty juvenile I'd expect that from a kid under 12 not a 19 yr old , she needs to get over it tbh and appreciate that people are still putting effort into her birthday in the middle of a pandemic. Banning your ex from attending was way overboard and you need to ease up on coddling your daughter.",
      "id": 16,
      "comments": [
        {
          "score": 124,
          "content": "[deleted]",
          "id": 17,
          "comments": [
            {
              "score": 6,
              "content": "That wasn't what I was saying- be upset absolutely, cry about it, but that shit needs to be done with after the first day. Crying on and off all weekend and then pouting at your dad about how you're not looking forward to your birthday because the gig has been postponed due to a global once in a lifetime pandemic is not. People were still putting effort in for her, and she is *nineteen*. It's an overreaction and an immature one at that, as was OPs. The dad went in hard as well, which is why I said ESH, but the solution to all this is the daughter needs to get over it, OP needs to not coddle and use her daughter's overreaction to punish her ex and the dad needs to chill, not that the dad needs to grovel.",
              "id": 18,
              "comments": [
                {
                  "score": 116,
                  "content": "[deleted]",
                  "id": 19,
                  "comments": [
                    {
                      "score": 0,
                      "content": "There has to be some sort of line.\n\n\"You can't give someone a timeline for being upset\" okay, I'm going to spend the next week cry-shouting because the store didn't have my favorite brand of peanut butter this morning. That okay?\n\nThere absolutely exists such a thing as a reasonable duration and severity of being upset in any given situation. And what OP's kid is displaying is beyond that.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -51,
                      "content": "Real life isn't as cheery, having these temper tantrums as a 19 year old is unacceptable, I don't even want to know what will happen when her boss yells at her for doing something wrong or something like that, when you grow up, your emotions need to grow up too.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 44,
                  "content": "I think you're forgetting the context of why the concert was cancelled. I'm thinking the 19 year old in the midst of their first pandemic is allowed to cry for a few days over the be-all-end-all tickets she finally got and immediately had taken away from her.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 60,
          "content": "God you sound terrible. Not being allowed to cry about missing out on something because she’s 19? It’s not juvenile it’s normal. People have emotions they shouldn’t be ashamed of, and I’m sorry if yours got stunted at some point in your life. I’m glad her mother is being so supportive. It’s not coddling it’s support. She’s being a good parent and honestly I bet your kids aren’t very open with you about their problems if you even have any. I hope the next time you have the audacity to cry over something it’s just so so serious.",
          "id": 23,
          "comments": [
            {
              "score": -15,
              "content": "Crying for multiple days over cancelled concert tickets for some crappy Korean boy-band is not something stable adults do. Moreover not showing appreciation for the party she DID have thrown for her because of said cancelled boy-band concert just comes off as incredibly spoiled. I didn't even have birthday parties at 19, just dinner out at a restaurant of my choosing with my immediate family and that was enough for me.",
              "id": 24,
              "comments": [
                {
                  "score": 18,
                  "content": "You guys are acting like she was crying non stop far days. The day before the party she just looked bummed out. Just because you think it’s a crappy band doesn’t mean she does. What if you got tickets to E3, NYC Comic-Con or the Super Bowl for your birthday? You’re telling me that not going suddenly wouldn’t bum you out? That being sad giver her father the right to pick on her like that? \nI don’t think being upset makes her spoiled. It doesn’t sound like she was blaming anyone. She wasn’t saying NO I ASKED FOR THE BLUE CAR screaming her head off. She was just regular old upset. \nI’m glad a nice meal is enough for you, that’s what I get too, but you and I weren’t given something we’ve wanted for years only to have it suddenly ripped away by a bad situation.\n\nPicking on a 19 year old girl is not something *stable adults do*",
                  "id": 25,
                  "comments": [
                    {
                      "score": -10,
                      "content": ">What if you got tickets to E3, NYC Comic-Con or the Super Bowl for your birthday\n\nIt'd be cool, but I'd be fine with whatever as long as we do something. If the events get cancelled I'd just say \"what a shame\" like JC Denton and be fine with whatever we did instead. Telling a 19 year old she needs quit behaving like a 9 year old is not \"picking on her\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "“Some crappy Korean boy band”? Really? You sound like this poor girl’s dad. Other people are allowed to like different things than you, and they’re allowed to cry about things if they’re sad. People express their emotions in different ways. It has nothing to do with being spoiled.",
                  "id": 27,
                  "comments": [
                    {
                      "score": -2,
                      "content": "\"Other people are allowed to like different things than you.\" sure, but crying for multiple days straight because a concert got cancelled is not something mentally stable adults do. Even if it was my favorite band I wouldn't cry. I'd just say \"oh that's a bummer\" and move on with my life. That's how actual adults deal with things that don't really matter.\n\nAlso expressing zero gratitude for the birthday party you had thrown for you and acting like that isn't good enough Is absolutely spoiled.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Are you kidding? Being sad about something you were looking forward to is normal at any age, she didn't say she wasn't grateful for everyone's efforts--just that she was still sad. One of the things about this pandemic is that we're grieving normalcy. She's probably more sad about this one thing then she would be otherwise because she doesn't know when any of the other things that bring her comfort and joy will be back either.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -29,
          "content": "You see, yours is the sort of opinion I won't even take into consideration because it sounds you've never had something you truly loved or were excited over. I will NOT shame my own daughter for expressing her emotions and I prefer her crying and being openly upset over her just pushing all of that down.\n\nI once lost Rolling Stone tickets when I was 29 and you bet your ass I bawled my eyes out for days.",
          "id": 30,
          "comments": [
            {
              "score": 51,
              "content": "If your sobbing for days over a band that hasn't just died in a fiery plane crash and your 30 years old, thats honestly ridiculous. At 20 my favorite band of over a decade was touring and I wasn't fast enough to get tickets to see them. I was disappointed for like a day and then I moved on. Wallowing in tears for days is not healthy and that level of obsession is not good for anybody. There's other concerts, especially in your daughters case the concert will be rescheduled. Rather than encouraging her to wallow you should be lifting her up and telling her that this isn't the end of the world and she is still going to get to see them. Also, point still stands that your daughter is an adult and if she wants her father at her party you have no place to deny her that.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "I think there’s truth in what Lolognese wrote. OP, my friend and I were the world’s biggest My Chemical Romance fans. We were utterly obsessed with them when we were 12-16. They remain my favourite band of all time, and their songs mean the world to me. They broke up when we were 16 before we got the chance to see them live.\n\nLast December, guess what - they’re back touring and we got tickets! This week, the show got cancelled. It absolutely sucks. I’ve been waiting for to see them live for NINE years. I’m gutted. But there’s a global pandemic. \n\nI do understand how your daughter feels, honestly. It’s shit - and I’m not defending what your ex said. Of course she’s going to be sad. But she needs to learn to cope with her emotions. Frankly? If a concert being cancelled is the worst that happens to you right now, count yourself lucky. Sobbing over it for multiple days is an overreaction. Your daughter could’ve guessed it would be cancelled and has had plenty of time to come to terms with it.",
              "id": 32,
              "comments": [
                {
                  "score": 25,
                  "content": "This right here just point-evidenced-explained my original comment. The context of all this makes the reaction of the daughter and OP worse imo.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "Yeh you're right, I've never truly loved or been excited about anything.",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "You're getting a lot of shit but you're right. If he makes those comments often enough she could have normalized it. It takes distance and healthy relationships to see that she doesn't deserve to be treated like that.\n\nYou don't have to have him at your house but I would allow him to the park. If only to be the bigger person. I would also make it clear that you're watching the way he treats her and will step in if necessary. Also therapy for her would go to great lengths.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That’s pretty embarrassing. Don’t assume that’s normal 30 yo behavior.",
              "id": 36,
              "comments": [
                {
                  "score": 6,
                  "content": "I cried over Comic Con getting cancelled. It’s the one big thing I look forward to every year. I’m 32. To each their own.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 3,
                      "content": "And I’ve cried too when something I was looking out for was cancelled or postponed. But once or twice, “bowling your eyes for days” is not normal at 30 for a cancelled event.\n\nI repeat, feeling bummed out/sad/disappointed for something and crying is not bad, the exaggeration of this is what I consider abnormal.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "That's not normal. I think both of you could use some therapy.",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 110,
      "content": "So your adult daughter has been inconsolable for days because a concert was cancelled of a band she really wanted to see? I understand being upset- even crying once about it. The fact that she’s inconsolable for days though is troubling for a 19 year old. Does she always have this inability to regulate her emotions or self soothe? If so, she might need some outside intervention like a therapist to teach her age appropriate coping techniques. My sisters wedding was cancelled this coming weekend....it’s a sucky time for people- but she is adult enough to know that it will happen down the line when the world isn’t in chaos...\n\nYes- her dad might have been harsh with her- but if your daughter is upset about that she needs to ask for an apology and have a talk with him herself. That’s not your place. Again, if your daughter is having a hard time expressing her feelings about that- maybe seeing a professional would be a good idea for her. \n\nIt sounds like dad was being too harsh and you are perpetuating her immaturity.",
      "id": 40,
      "comments": [
        {
          "score": 36,
          "content": "I'm 20, I've had a lot of friends celebrate their 21st birthday online with our group (the restrictions where we are don't allow for sitting outside eating cake) some of them have lost vacations, graduate jobs etc and haven't made such a scene. \n\nIt's just a date at the end of the day, I'm sure she will get the tickets refunded/the concert be rescheduled. It's normal to be upset and even cry, but to be inconsolable for days and she should try to appreciate that her friends and family are still trying to make it special for her. \n\nIt seems pretty entitled of her tbh",
          "id": 41,
          "comments": [
            {
              "score": 39,
              "content": "Everyone's missing out on a lot right now. She's super disappointed about the concert, but might also be upset about school, friends, and just normal life that we're all missing. I've had a couple days over the past several weeks where I've just been super sad about everything and I think that's pretty normal.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yea I've missed out on my 21st birthday, will be missing out on my college graduation and a grad trip I had planned for after. As well as worrying about whether my job will still be there once I get closer to the start date. It's okay, I'm upset too but not to the point where I'm crying for days because I know there will always be time to celebrate later. I should be grateful it's not worse.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Maybe the reaction is really just letting out feelings about the entirety of our worlds being flipped on their head re: COVID. Sometimes it’s that thing that gets you to the point of losing it.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "But was the dad evening being that harsh? Or is OP \nexaggerating? Because from the sound of it both OP and the daughter are over dramatic.",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Maybe it's a little over the top but shes a teenager. BTS tickets are insanely hard to get and this will most likely be their last tour for a long time. It sucks that it got canceled and she can be upset that she might not ever see her favorite band in concert. I wouldn't go straight to saying that she can't control her emotions",
          "id": 46,
          "comments": [
            {
              "score": 2,
              "content": "I get that. There have been a lot of disappointing things the past few months. If daughter has been inconsolable for days though- that’s a bit much. OP used that word- meaning she can’t calm her down. So either daughter needs some coping skills or mom is exaggerating the daughters reaction.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It's okay to be disappointed about this. But moping around the house crying for days because of it is something I'd expect out of a 13 year old, not a grown adult. \n\nMaybe I'm just made of stone or something, but it really feels like her reaction is way over the top.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 67,
      "content": "ESH from the title I though your daughter was a child, but she’s 19. She’s an adult, and she gets to choose who comes to her birthday, not you. If she wants her dad there, he should be there. I get that you want to protect her, and you should, but at some point you have to respect what she wants too.",
      "id": 49,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 44,
      "content": "Yes you are yes you overreacted and yes your daughter is being childish and over dramatic she’s 19 ffs",
      "id": 50,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 32,
      "content": "YTA\n\nDo not interfere with the relationship between your ex and your adult, 19 year old daughter. It's the fastest way for you to become the bad guy.",
      "id": 51,
      "comments": [
        {
          "score": -4,
          "content": "I can’t agree with this at all. If an adult is clearly mocking and bulling her kid she has every right to step in. Father or not. I would never ever let my partner speak to my child that way.",
          "id": 52,
          "comments": [
            {
              "score": 11,
              "content": "He was not mocking his daughter. He was trying to tell her that she should be more grateful. He was parenting, perhaps he was harsh, but saying he was bulling her is an overstatement.",
              "id": 53,
              "comments": [
                {
                  "score": 3,
                  "content": "“He got mad and started mocking her about how priviledged she was, that she was too old to bis this hung up over a boyband and that she couldn't enjoy what everyone else was doing for her because she's so selfish etc.”\n \nI’m sorry but I’m glad you and I have different views on parenting. Because this is not good parenting to me.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 12,
                      "content": "She is privileged and she is an adult crying about a boyband for days. I do not consider that “mocking”, as does OP.\n\nLike OP said, when she was 30 she cried for days because she lost tickets to a concert. That’s probably why OP’s daughter thinks this is normal behavior. By all means, be upset, but if your family, who is not to blame for the situation is trying to celebrate with you, there is nothing wrong with cutting your “mourning” for a boy band you’ll get to see in a few months. It’s not like they died.\n\nBut yeah, we do have different views, I think helicopter parents are a little bit too much for my liking. Have a nice day!\n\nEdit: to add more info on OP’s comments.",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Considering OPs responses to the various comments I'm starting to think she is quite protective of her daughter and we have to put in doubt the objectiveness of the depiction of her ex. Especially since guests and the daughter herself think there was an overeaction. \n\nI would love to get the ex's version in all of this.",
              "id": 56,
              "comments": [
                {
                  "score": 2,
                  "content": "Honestly that’s the best argument I’ve heard. \nI’d love to get the daughters version the most tbh.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 32,
      "content": "NTA \nMaybe a bit of an extreme reaction especially if your daughter wants her father there but I think he should definitely apologise.",
      "id": 58,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 26,
      "content": "Your daughter is old enough to decide if she wants to let people treat her this way. If she was 6 and you made that decision, fine. But she isn’t. ESH you did the wrong thing for the right reasons. She knows her father isn’t kind always and if she still wants him in her life then that’s her decision. I agree that he shouldn’t mock her interests, and shouldn’t be yelling at her.",
      "id": 59,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 20,
      "content": "ESH I get you were sticking up for your daughter and your ex is definitely a jerk but your daughter is 19 so she should really have the final say on who she wants to come on her birthday",
      "id": 60,
      "comments": [],
      "relation": "No"
    }
  ]
}