{
  "post content": "Throwaway account and fake names because my wife is also on Reddit. And sorry for the long post. \n\nMy wife (39F) and I (42M) have three sons, Alex (15), Dylan (11), and Jake (8). When I was a kid I always wanted a dog but my parents said no. I never got the chance to get one during my twenties but recently my interest in owning one was sparked again so I asked my family what they thought about getting a dog. My wife wasn’t enthusiastic about it but she relented after a few weeks of me asking. Alex and Jake were excited to get one but Dylan was immediately opposed to the idea. \n\nDylan was always different than my other sons, he never had an interest in sports and was always more subdued than his brothers which has always made it hard for me to connect with him. \n\nHe remained opposed to the idea of getting a dog but me and my other sons managed to wear him down until he finally relented. However, he said that if we did get a dog, he wasn’t going to be interacting with it or taking care of it, that would be completely on me and his brothers. I found this ridiculous but i agreed in the moment hoping he would change his mind after meeting the dog. \n\nThe problem is he hasn’t changed his mind yet. We’ve had Zeus for seven months now and Dylan has not warmed up to him in the slightest. \n\nHe doesn’t play with the dog, he doesn’t cuddle with him, he doesn’t let Zeus into his room because he “destroys stuff” and whenever he is near the dog he just ignores him. I find this completely ridiculous. Zeus loves Dylan, he follows him around whenever he sees him and jumps on him to get his attention and play but Dylan just isn’t receptive to it.\n\nTo change this, I told Dylan last week that he would be in charge of walking the dog every day after school. Dylan straight up refused and has shut down the conversation every time I bring it up. It’s been a week and he hasn’t walked the dog once. \n\nIn my frustration, I told him that if he didn’t start listening then I wouldn’t allow him to go to the comic book store anymore and he freaked and told my wife. Now, my wife is upset with me, claiming that I knew what I was getting into with this and I knew that Dylan wouldn’t be playing with the dog but his intolerance of the dog is weird and I refuse to entertain it any longer. \n\nMy wife has been short with me ever since that conversation and Dylan is cold with me as well. Alex is now agreeing with his mother which is making me have second thoughts. So Reddit, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 48024,
      "content": "YTA\n\n\nSo, you are 3 people who want a dog and could care of the dog, but your son who didn't want the dog HAS TO even though you TOLD him, he wouldn't have to. \n\n\n\nWhat you teach your son:\n\n\n- you are a liar\n\n\n- it is okay to not take care of own responsibilities \n\n\n- you punish him intentionally because he isn't you\n\n\n\nEdit: THANK YOU for the awards!! I appreciate it! But please stop. This comment isn't genuis or anything great.",
      "id": 2,
      "comments": [
        {
          "score": 11653,
          "content": "Jumping on a top comment to ask-- 1) why did OP ask his sons if he could have a dog? Like if the wife said ok, then, well, that's that. 2) why is OP so weird about his son interacting with the dog? Like there are multiple other people to take care of the dog.",
          "id": 3,
          "comments": [
            {
              "score": 8600,
              "content": "1) seems his wife didn't just say ok. she \"relented after a few weeks\" of OP asking for a dog. 2) OP makes it clear he feels uncomfortable with Dylan not fitting his view of how a boy should act which in a lot of people's minds means a childhood dog for boys.",
              "id": 4,
              "comments": [
                {
                  "score": 6833,
                  "content": "Three - I'm not ok with how OP lets Zeus act around Dylan. \n\nThe dog follows Dylan around and jumps on Dylan. Instead of OP training the dog to behave, OP thinks this is evidence that the dog \"loves\" Dylan. No this is evidence that OP doesn't know how to keep their dog away from people who don't like dogs. \n\nI feel so bad for Dylan. It is clear that Dylan is not OP's \"ideal\" for a son, and therefore gets poor treatment. It is really sad. Zeus gets more consideration than Dylan.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3160,
                      "content": "“Hey son, you know this animal you don’t like and didn’t want anything to do with? You’re going to have special one on one time with him where you get to enjoy picking up its poop :)”",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1474,
                      "content": "interesting how \"destroys stuff\" is in quotation marks, almost like there's some kind of doubt about zeus being destructive. i guess OP has never heard of the concept of dog training. hey, dogs will be dogs right?\n\nedited to change \"cinceot\" to \"concept\" lol sorry",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 141,
                      "content": "Honestly OP waited this long for a dog, if he respected his son at all he could have waited 7 more years for him to go off to college and get a dog at that time, when Dylan would have only had to have minimal interaction with it. Also depending on how big this dog is - an 11 year old being the one responsible for walking it, considering we know it has a habit of jumping up on people and destroying things, is wildly inappropriate. If this dog is say German shepard sized how the hell is an 11 year old who \"isn't sporty\" gonna pull it off people it decides to \"greet\".",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 135,
                      "content": "I agree with this - OP needs to do some serious behavior training with this dog instead of allowing it to behave poorly with people who don’t want any interaction.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "For sure this! \nDogs are not supposed to jump up on people- no one, not even their family. It can set a really bad precedent that can lead to a frail/fragile person, or worse, a child being significantly injured. You are always supposed to train your dog to heel/down and not jump on people. And as another commenter pointed out, a dog that is prone to jumping up on/at people, is likely a difficult dog to walk. And the name Zeus would also lead me to believe it’s a fairly large dog, too… a dog too difficult for an 11 yr old to walk.\n\nAnd the fact the dad is writing “destroys things” exactly like that, tells me that he 1. Has no respect for his kiddos belongings that are being destroy by a dog he **did not want** and 2. Reinforces that this dog is not being trained at all.\n\nEdit: YTA big time!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "It’s only when his other son Alex agreed with his mom, op’s wife that he started having doubts like wtf?! That really shows where he values one son’s feelings vs the other, and hell even his own wife who he pushed off, maybe cause cause she always has to mediate between him and Dylan like op’s trying to make him do things that he doesn’t want to do like watch & play sports like op’s other sons do which op says because he has no interest in sports and is more “subdued” then his other sons it’s always made it hard for op to connect with him, uhh idk try something other then sports like connecting with ur son through his interests. He wants a kid to do all the work to get to kno and have a connection with his dad when he’s the adult and this is his own son! \n\nOp lied about respecting his conditions on that he never had to take care of or interact with the dog, and now he’s went back on his word while forcing & punishing Dylan to be more involved with the dog all cause it upsets op that he’s not bonded and interacting with the dog like his brothers when that was his conditions for the dog! It’s not like Dylan is the only one home and that’s why he has walk it op just wants it to be him and not his brothers to walk him to force him to interact and take care. Why would having to walk the dog make the kid love them? And the dog doesn’t seem well trained if it’s jumping on him and stuff, maybe if op got the dog super well trained it might help Dylan open up to them. \n\nHe doesn’t have to do anything with the dog though, op promised and went back just because he wants him to start acting “normal” like his other sons. Op there’s nothing wrong with ur son, his interests or how he acts so stop trying to “fix” things that don’t need to be fix cause *nothings broken or wrong, just a different model*",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yeah, I came here to say this. That dog is not trained well enough if it is destroying things in Dylan's room. Dylan also clearly doesn't want the dog jumping on him, but OP can't be bothered to train it to not do that.\n\nWhen I was married, my now ex brought home a dog without talking it through first. Since I worked 2 jobs he was supposed to train it, but of course he didn't. That dog jumped on my 5 year old daughter all the time and destroyed her stuff. She literally walked on the furniture to avoid the dog because she was so scared of it. It took her years to get over her fear of dogs.\n\nAll OP is doing is making Dylan not trust him or the dog.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "> Dylan was always different than my other sons, he never had an interest in sports and was always more subdued than his brothers which has always made it hard for me to connect with him. \n\nthis section right here was all i needed to see who was TA. because of course it’s on Dylan to change himself to fit OPs likes and not on OP, ya know, the adult and parent; to take an interest in his child’s interests and be interested in his child’s life. pssshhh of course not \n\nsince Dylan isn’t “normal” like OPs other sons, it’s hard for OP to connect with him, poor OP. has to deal with a son who *checks notes* doesn’t like sports, dogs, and is a bit introverted. the absolute horror /a\n\nYTA OP and when Dylan moves out and never speaks to you again, don’t act shocked and like you’re the victim when in reality you never gave your son a chance.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 370,
                  "content": "OP is insufferable. They badger people until they get the answer they want. It seems everyone in this family eventually agrees with OP just to get them to shut up.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Except the one who stood his ground. Now OP is going after him like he's on a mission from Gawd.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 260,
                  "content": "[removed]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 460,
                      "content": "And apparently a dog that \"destroys stuff\" how fun",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 126,
                      "content": "Five If you count the dog.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 190,
                  "content": "I really hate being asked the same question over and over again when someone doesn't like the answer I gave? So annoying and childish to me. 🤣",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "It seems like OP has a habit of pestering people until they give into his demands. It seems that he's also taught his oldest and youngest to do the same thing.",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "OP has so many YTA points in this post. Starting with repeatedly asking son and wife after having probably received a \"No.\" from one or both of them at least once. Trying to force his son to conform to a specific standard instead of being adult enough to meet his son where he's at and not even attempting to understand his *child's* perspective. Trying to control even how Dylan *feels* about the dog. Apparently not providing proper training and outlets for the dog's energy (jumping on people, destroying things). OP recognizes and validates the *dog's* feelings more than his own child's because the dog's feelings conform to OP's expectations.\n\nJust ick. ick.ick.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I'm also kind of skeeved that his wife told him to stop and he shrugged that off and it took the intervention of his 15 year old son for him to concede he might be the asshole... its a snippet in their lives but nit one which shows a lot of respect from this man to his wife",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Also Dylan is introverted and enjoys more nerdy things.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "He recruited the other boys to pressure mom into saying yes",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "yeah. god lord, no interest in sports and more subdued than the other kids so the father has trouble connecting with him. \n\nAs if sports matter.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1344,
              "content": "I am a total dog person. Basically show me anything with fur and I'll love it. And a few things without fur.\n\nI honestly don't understand why people who don't like dogs can not like them, they're adorable.\n\nBut I'm not about to force anyone to interact with any dog they don't like, especially when they've been told they don't have to.\n\nI mean, I'll silently judge you for it, but not everyone has to be like me. (edit: dear lord, people on this forum really can't take a joke, can they)",
              "id": 26,
              "comments": [
                {
                  "score": 680,
                  "content": "for me, i love dogs, but im autistic and sometimes they’re too big energy and too loud and unpredictable, like my black lab when he was younger. i didn’t like him at first, i finally have him trained to where he doesn’t trigger sensory overload and he’s the bestest boy ever. doesn’t jump on me, listens, is good boy",
                  "id": 27,
                  "comments": [
                    {
                      "score": 578,
                      "content": "When I was reading this I was thinking he probably got a puppy and they've only had it 7 months. Some dogs take 2 years and heavy training to break puppy behaviour which can be extremely overwhelming, even to neurotypical individuals. The son has expressed verbally that the dog destroys his things, and communicated via body language he doesnt have patience for it's exhuberant and annoying actions. Dad is a huge AH who is ruining any chance of son creating a bond with the dog as it gets less needy and annoying by forcing the relationship. Doesn't it sound like an 11 year old is more mature than the 42 year old in this situation? Some people are just wild. Ps. Im really glad you love your good boy and it all worked out <3",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 337,
                  "content": "To me, dogs are like children. \n\nI'll like other peoples', but will never have one of my own. Hell no.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 171,
                      "content": "I love my kids, but i don’t like anyone else’s kids. With dogs i’m same as you. I like everybody’s dogs, but i wouldn’t have one. I don’t want to go for walks, and i don’t want to throw sticks, balls, dead squirrels, etc, everyday for that dog.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 290,
                  "content": "I have an amazing cat, and an adorable Golden. I get why people don’t like dogs. They can be rambunctious. Especially when they are young. \n\nWhat I don’t get is people who hate cats. However, I would never force somebody to hold my cat. Just like you and dogs, I would just silently judge them.\n\nThe OP should only be mad if Dylan hurts or mistreats the dog. But he is only ignoring the dog, which is what you are supposed to do. Avoid it and don’t make eye contact.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 209,
                      "content": "I’m a cat person all the way. I’ve always had cats and they are easier than dogs. They don’t jump all over you, lick your face, hump your leg, piss and poop on the floor (usually lol) or bark incessantly for some ridiculous reason. You can leave them alone overnight. Dogs are like children to me. I mostly tolerate them and there are a few that I actually like but I have zero desire to have my own. They are just too much work.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I am terrified of dogs that bark loudly and run and jump on me. It sends me into panic attacks. However if anyone I was living really wanted a dog, I wouldn't mind, if they made sure it was properly trained to not jump on me and that they took care of it themselves.",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 293,
              "content": "[deleted]",
              "id": 34,
              "comments": [
                {
                  "score": 195,
                  "content": "Not just a dog thing, a sport thing too. He has a hard time connecting with his second son because he is different from op. But what really gets me is op's method of wearing people down until they give in. He sounds exhausting to be around to say the least.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Because OP wants a dog, but doesn’t want to take care of it.  He figures he can brush the unpleasantness off on his kids, and by asking them he can put it on them.  Dylan is putting the kibosh on that plan.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "He’s weird about it because he’s taking it personally. Like HE’S being rejected. I also think somewhere deep down he knows he’s wrong but if everyone gets on board, he will feel his actions are justified.  Dylan ain’t having it!",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5660,
          "content": "How to tell the world you resent your middle child without saying the words.  \n\n1. You don't connect with him because \"he doesn't do sports or other manly things\"\n\n2. You wanted a dog.  Pressured your wife into getting a dog.   When your son expressed he didn't want the dog, you lied to him about the dog not being his responsibility\n\n3. When your son kept his boundaries intact, and didn't interact, or bond with the dog he TOLD you he didn't want, you punish him for it, because his aversion to the dog is \"weird\" (aka not what you wanted or expected).\n\n4. Instead of being an adult and talking to your son about WHY he didn't want the dog BEFORE you brought it home (and potentially having a bonding moment with the son you struggle to bond with) you push the innocent dog on him after you have already bought him, in a bid to force responsibility on your son and teach him a lesson (I think?)\n\nConclusion: do you even like your son?  It sounds like you resent that you have no common interests with him (aka he doesn't like what you like, and you try to force it on him anyway and he rebels and it pisses you off) and instead of TRYING to find one, or trying something he likes, you just... bully him.   YTA.  majorly. Edited wording and wording",
          "id": 38,
          "comments": [
            {
              "score": 739,
              "content": "This sounds exactly like my parents. My sister wanted a dog, she doesn't do anything aside from play with it. I didn't want the dog and apparently I get to be responsible for stuff like picking up poop when my parents ask me to mow the lawn.",
              "id": 39,
              "comments": [
                {
                  "score": 290,
                  "content": "That's super frustrating.  Parents shouldn't indulge a child wanting a pet unless that child has a plan on how they are going to take care of it, and they (with their parents help, if needed) have done research into how much work owning a pet is.  Im sorry this happened to you.  This is not good parenting.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I'd be so tempted to give your sister the poop.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My brother did the exact same thing. He took care of his dog for 1 week and then foisted his responsibility on my parents. He didn’t even ask, he just said he’s getting a dog. I feel bad I never bonded with her because I resented my brother.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 330,
              "content": "The boundary thing is spot on. There is no point in this that the child waivered. He \"relented\" after being pestered for a while. Then OP believes if he pushes his son to connect with the dog, it will magically work? The son told OP from day one he didn't want a dog and wouldn't be interacting with it once it was in the house. \n\nWhat is it with parents trying to step over their kids' boundaries?! \n\nOP is definitely TA.",
              "id": 43,
              "comments": [
                {
                  "score": 86,
                  "content": "Seriously though!! OP's son had clearly expressed his boundaries, had made his intentions and his expectations surrounding the dog clear, and good Ole OP just mowed right over them with the dog in tow to shit all over his sons pristine boundaries that lay in shambles around him.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "There are a surprisingly large amount of people that believe their children are supposed to be extensions of themselves and therefore are not supposed to or allowed to have boundaries. It's why the whole notion of \"don't force a kid to give hugs and kisses if they don't want to\" is so controversial.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 130,
              "content": "I would like to add to this if the kid doesn't like the dog, and resents it, and is forced to interact with, yeah that's not good for the dog either. Dogs will pick up on that, and you may end up with a dog with behavioral issues.",
              "id": 46,
              "comments": [
                {
                  "score": 32,
                  "content": "100% this.  A dog can sense resentment, and it can make them either more aggressive or more submissive depending on the dog's nature.  If the dogs nature is to want to please the dog will be submissive and want to get away from his son.  If the dogs nature isnt that way...  well that could get ugly.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "End up with?  The dog already destroys stuff and jumps on people.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I had already decided that OP was YTA when he said he had trouble connecting with his son because the son doesn’t like sports. \n\nLook, OP. I’m a girl. My dad didn’t know anything about the stuff tween girls like, and he was definitely was not interested in watching the tv shows and movies aimed at tween girl audiences. But he had an interest in ME, so he watched the tween girl tv shows. And after a while, he started to get invested in them and we bonded over laughing at wacky hijinks and predicting what would happen in the next episode. \n\nRight now, you have no interest in the things your son likes, so you just don’t spend time with him. And that sucks beyond measure for your son. Ask him about his comic books. Ask him what a good starting place would be for one of his favorite stories. TAKE AN INTEREST IN YOUR CHILD. He’s not required to be a younger version of you who does all the things you do and likes all the things you like. Make an effort, for gods sake. \n\nAnd let him not like dogs. Some people don’t, and that’s normal and fine.",
              "id": 49,
              "comments": [
                {
                  "score": 31,
                  "content": "So story time!! I was born AFAB.  I'm 28, my dad is 62.  I came out to my dad last summer as genderfluid.  That was a ride to explain, but.  I got there!  And you know how we got there?  (Forgive me native German speakers, I am in the US, so this is going to sound like a shitty explanation lol). My dad and I took German in high school.  I told my dad I was gender neutral, that I didn't really feel like a guy or a girl sometimes.  And he looked thoughtfully at me, and asked \"so you're like das, right?\"  My face lit up guys!!  \"Das\" is the gender neutral form of \"the\" in German, and I immediately knew that while my dad might not ENTIRELY understand me, he was trying, and this was his way of connecting with me in a way we BOTH understood. It was a beautiful moment.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I'm reminded of another AITA post where a father didn't connect with his non-sporty son (there were two other sporty sons) and the son basically went NC with him when adult while the mother (I think she was the OP) who was more supportive of his interests gets to talk to him.  The father whined about it but the OP mother told him he reaped what he sowed.  Interestingly enough, I think the sporty brothers actually agreed with OP.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "INFO: OP, did you get the dog as a replacement for your middle son that you resent, or did you get the dog of your own selfish needs to have your childhood fantasy fullfilled?",
              "id": 52,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "This is what I'm wondering.  The whole post is less, \"AITA for making my son walk a dog he doesn't like?\" and is instead, \"My middle son is weird because he doesn't like the things I like, so AITA for punishing him by trying to force a bond with a dog he didn't even want in the first place?\"",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Countdown until Dylan goes no contact with Dad.",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "All of this.  \n\nOP, as a parent, it is your responsibility to find a way to bond with your son. You are literally punishing him because he doesn’t fit your idea as to what a boy should be like.  This poor child needs to know that you accept and love him for who he is.  You need to not punish him because you lied to him. \n\nPlan a weekend with your son. Find something maybe a couple hours away that HE would enjoy and make a weekend of it.  Maybe a Comic-Con in a nearby city, get a hotel, let him pick a couple other activities to do.  Make it a strict “no sports” weekend.  No watching a game, no talking sports, nothing.  Give him complete control over the remote.   Freaking bond with your kid",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Very well said.",
              "id": 56,
              "comments": [
                {
                  "score": 12,
                  "content": "Thank you!  I was trying to figure out how to word things and finally was like... just let your heart speak.  And thats what came out lol",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1620,
          "content": "you forgot teaching his son to just get on peoples nerves until they relent and that 50 no's and 1 yes means yes.  i mean \n\n> My wife wasn’t enthusiastic about it but she relented after a few weeks of me asking.\n\nand \n\n> He [Dylan] remained opposed to the idea of getting a dog but me and my other sons managed to wear him down until he finally relented.\n\nreally says all one needs to know how op feels about others boundaries.",
          "id": 58,
          "comments": [
            {
              "score": 535,
              "content": "I'd love to know what other areas in his life, OP doesn't understand what consent looks like. Because he sure had no problem bulldozing his wife and son when it was something *he* wanted. YTA.YTA.YTA. OP, I had a dad like you. We don't talk.",
              "id": 59,
              "comments": [
                {
                  "score": 100,
                  "content": ">I'd love to know what other areas in his life, OP doesn't understand what consent looks like.\n\nExactly. OP sounds utterly exhausting when he doesn't get his way. I would expect he will soon be divorced and at least one son will go NC at the earliest possible opportunity.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 227,
              "content": "THIS!!!! These statements really jumped out at me immediately. OP sounds controlling and coercive. A few WEEKS of pestering his spouse about it until she relented (sounds like he WOULDN'T relent himself) and \"wearing down\" his son?!?! \n\nI've met people like this in real life. I call them \"bulldozers\". This is sick and manipulative behavior in order to get what he wants. Absolutely disgusting behavior. OP is MAJORLY the AH. I suspect that no matter how many people here tell him that he is the AH, he'll just disregard it. These types of people only want to hear agreement with them. Anything else is just static.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 83,
              "content": "100% chance he has badgered women who said no to sex until they relented.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Parents like this are why I have no boundaries as an adult.  I hope Dylan can keep his.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Just Dylan’s and his own wife’s. I think people nailed it when they say he doesn’t like his middle child for not being “manly” and not liking sports",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 638,
          "content": "Also, train your dog to stop jumping on people. It's not cute.",
          "id": 65,
          "comments": [
            {
              "score": 239,
              "content": "OMG *THIS!!!*  It irritates me beyond belief when a dog is jumping up at me, licking me, mauling my arm playfully, and the owner goes 'Awwwww he *likes* you!'.  It is *not* being cute, it is being *freaking annoying!* Any dog owners that do not control this behaviour are AHs.",
              "id": 66,
              "comments": [
                {
                  "score": 48,
                  "content": "I know!! One of my biggest pet peeves. If someone apologizes and corrects the dog I’ll at least know they’re trying (I know it’s hard to curb bad habits) but I feel like people think it’s cute now. It’s not.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I love dogs, I’ve had dogs my entire life, and I agree with you that I hate getting jumped on. Jumping is a behavior I absolutely do NOT tolerate. Jumping is not cute or nice and is easily corrected with training.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "IKR? OP mentions it as though it’s a cute behavior of the dog and Dylan is heartless to ignore it. 🙄 Train the dog, OP!",
              "id": 69,
              "comments": [
                {
                  "score": 37,
                  "content": "While you’re at it, train the dad. He’s in desperate need of parenting/husband skills.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "My grandmother almost broke her hip when a huge dog jumped on her, and the dog's owner said he liked her. She doesn't go to that person's house anymore.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "And with a name like Zeus (and complaints about destructiveness), you just *know* that it's a Great Dane or something huge, and OP can't imagine anyone not thinking it's cute when a 150lbs of slobber is trying to push you down. My dane is as tall as I am when he stands with his paws on your shoulders, and we've done the work to ensure that he only ever jumps when we tell him to. And was royally pissed when my dog destroyed things during his puppy years, more so when it was one of my kid's things. It's not cute to let dogs act like that, and it's just enraging when people think it's not even a big deal.",
              "id": 72,
              "comments": [
                {
                  "score": 14,
                  "content": "Apparently they only walk him once a day so I can see why he’s being destructive.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Dylan is actually the only one doing the right thing by ignoring this behaviour rather than rewarding it with attention.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 456,
          "content": "It's also teaches that boundaries don't matter.",
          "id": 75,
          "comments": [
            {
              "score": 13,
              "content": "Exactly, & he’s abusing his authority position as a parent.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 337,
          "content": "This is so like my father's parenting style. He used to say, \"Do the thing that you do not want to do.\" He would force us to do things just because he knew that we did not want to do them. You can force a child to do something, but you cannot force them to enjoy it. And no, even 50 years later, they still will not \"appreciate\" what you tried to force them to like.",
          "id": 77,
          "comments": [
            {
              "score": 67,
              "content": "This sounds like my mom... \n\nShe'd force me into things she wanted to do.  Ironically,  if I did do something well or if I became interested in the activity,  she'd pull me out of it....It was freaking weird!\n\nOP,  YTA!  I can't even comprehend why you can't see that you're not.  Your son doesn't fit into your acceptable mold for a child so you decide to PUNISH HIM.  Good god,  I can't wait for the time his love of comics become his very prosperous means of living and cutting you out of his life.",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Yeah big surprise coming in 10 years or so when Dylan leaves and doesn’t look back at the dad who constantly forced him to do stuff he didn’t like.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Forcing him to walk the dog is not going to make him like the dog any better. I bet they both will pick up very unhelpful habits.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 225,
          "content": "It was YTA for me once he started talking about \"the differences\" between his sons. Checked out once I finished reading!",
          "id": 81,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 109,
          "content": "$10 says this man doesn't like cats and thinks that they don't deserve the same love and attention as dogs do. Cat have clear boundaries and it seems this man has no idea what a boundary is.",
          "id": 82,
          "comments": [
            {
              "score": 19,
              "content": "Sounds pretty damn plausible and likely to me!",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "$10 says you’re right! And the middle son is more LIKE a cat — you can’t MAKE them do things. They have to want to, and you can’t train them by punishing them. Poor kid! I love cats and he can come hang out at my house!",
              "id": 84,
              "comments": [
                {
                  "score": 14,
                  "content": "I bet you that kid would ADORE a cat",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "You’ve also taught your son that he does not have agency over himself, his decisions, and ultimately his body. We’ll done. \n\nYTA\n\nEdit- typo",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Lmao this guy treats his son like a frat pledge that has to take care of the house pet\n\nAlso I don’t understand why he can’t relate to his kid just cause he has different interests. That’s like. How people work yknow? I hardly interact with people with my exact interests but that doesn’t mean I don’t find other stuff to talk to them about. One of my favorite things is just asking them to explain to me something they like. It gives me context and allows me to join in the conversation, and people LOVE to talk about their interests! I like seeing that passion in people regardless if I understand them or not!",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16143,
      "content": "Dylan: I won’t interact with the dog.\n\n*OP buys the dog*\n\nDylan: doesn’t interact with the dog.\n\nOp: 👁️👄👁️ \n\nBy the way, YTA.",
      "id": 88,
      "comments": [
        {
          "score": 2602,
          "content": "“But the meme says they all turn around eventually!”\n\nYTA",
          "id": 89,
          "comments": [
            {
              "score": 626,
              "content": "exactly why I hate that \"dads with the dog they didn't want\" meme",
              "id": 90,
              "comments": [
                {
                  "score": 509,
                  "content": "To be honest my family is a perfect example of both scenarios.\n\nWhen my mom(supported by my sis) wanted a small dog, dad only agreed cuz he felt mom needed it and I basically took Dylan’s stance from this post. I knew mom needed it and my sister wanted it, but it’s not my dog, therefore not my responsibility. I made it clear I’d only take care of a bird(too much hassle for them to consider one), a cat(only I wanted one) or a snake(good luck with that all 3 have a snake phobia lol).\n\n8 years later and dad found out that the dog is a huge emotional support for him as well and takes an active role in caring for the little mop, but I still haven’t come around and only occasionally pet it or let it come in my room if everyone else is out for a couple hours. \n\nTldr some people just don’t like dogs. For me it’s the smell that does it. They just stink no matter the breed or how often you wash them.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 165,
                      "content": "As a bird owner I don’t blame your family lol. I have three parrots and I’ve decided I’ll never have children, just birds. They’re such needy little babies",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": "“The problem is he hasn’t changed his mind yet”",
          "id": 93,
          "comments": [
            {
              "score": 23,
              "content": "seems like OP has a habit of convincing people to do whatever he wants, thinking if he asks enough they'll eventually agree and that immediately makes it okay... sounds familiar, doesn't it? almost like a few criminals i've heard of.",
              "id": 94,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "YTA OP\n\nBut don't forget, it's an untrained dog (OP is clearly an AH). It follows Dylan around and jumps on him.\n\nI wouldn't like a dog that jumps on me either. OP needs to shut up and take care of the dog HE wanted.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15060,
      "content": "Let me get this straight. \n\n1. Your son doesn’t like sports so it’s “hard for you to connect with him. “\n\n2. He didn’t want a dog but you got one anyway and when he didn’t change his mind you punished him\n\n3. The one hobby you say he does like, comics, you want to ban him from until he shows interest in your hobby. \n\nWhy do you go so far out of your way to make it clear you have no interest in getting to know your son, you just want to change him into someone who you have things in common with? Why not spend some time trying to learn about his interests instead of forcing yours on him? Do you really think if you turn the dog into a punishment that will make him not resent the dog? \n\nYTA if that wasn’t obvious.",
      "id": 96,
      "comments": [
        {
          "score": 4391,
          "content": "4. The dog jumps on people and destroys things.\n\nThat dog is improperly trained and OP is minimizing that. If OP and his other 2 sons put some time and effort into actually training the dog Dylan might be a bitt more receptive to it.",
          "id": 97,
          "comments": [
            {
              "score": 1154,
              "content": "Well, I wouldn’t go blaming the boys, they’re just following dad’s example on how to treat the dog. It’s on OP to teach them how to train the dog, which is probably not going to happen since OP seems like the kind of dog owner that thinks that their untrained dog is a perfect angel even as they’re in the middle of destroying something.",
              "id": 98,
              "comments": [
                {
                  "score": 206,
                  "content": "Remember, this is OPs first dog, they more than likely don't know how to train a dog, or even that it's behavior is the result of poor/no training. Probably assumes every dog is just like that",
                  "id": 99,
                  "comments": [
                    {
                      "score": 137,
                      "content": "That’s true, I did let personal resentments get in the way a little there. But OP putting “destroys stuff” in quotes rubs me the wrong way and makes me think he’s being an apologist about the dog’s untrained behavior. \n\nAlso if OP is ignorant about training, it’s important to note that research is very important before getting any pet for the first time. It’s kind of negligent to not train a dog even if it’s not agressive and as a dog owner OP should’ve known that already. It’s not like the necessity of training is a niche topic.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 366,
              "content": "Well what is OP supposed to do if the 11yo won't train it? /s",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 322,
              "content": "He also mentions Dylan is worried about the \"dog destroying things\" and won't let him in his room. \n\nTen bucks says Dylan is worried about the dog destroying things AGAIN as it's likely already happened. That's not a fear you just pull out of your ass, comes from experience.",
              "id": 102,
              "comments": [
                {
                  "score": 15,
                  "content": "Especially worrying when you realize his hobbies include comic books. Not to generalize, but I’ve often found that hobby comes with owning collectibles… and OP’s attitude here leads me to believe he would be in no rush to replace what is destroyed.",
                  "id": 103,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "It's a great Dane. This OP scream L.D.E and likes to bully his kids.  you know it's  not a chihuahua named Zeus  it's a giant un trained beast.",
              "id": 104,
              "comments": [
                {
                  "score": 185,
                  "content": ">t's a great Dane.\n\nWait, A JUMPY GREAT DANE?!?!  \nJFC, a jumpy great dane is a dangerous dog! It's pretty easy to break an arm if you're tackled by something that large.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Never underestimate an idiots ability to ruin a dog.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "This is so horrible. I don’t mean to be a bit sexist, but whenever a guy I’ve known gets a dog, particularly big dogs, they train them to get riled up and attack/play rough. \n\nIt is horrible to be around. My sister and her ex had a pit bull mix that would drag her or I around the house with NO WAY of stopping it. Getting bruised, bleeding, and no way to stop. Her ex was strong enough to get the dog to stop and was able to control the dog, but my sister and I were not. \n\nIt was a HUGE constant issue. This is just one example of guys doing this, but Ive also had partners do this with their dogs, or friends partners do the same. Just absolute untrained madness. \n\nIm afraid maybe the same thing is, or will happen here. It sounds like OP doesn’t care how anyone else gets treated or feels about the dogs behavior since he finally gets to have a dog. \n\nHe doesn’t realize how much training and work they actually are! My dog is turning two this year and I still train him basically everyday.",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Who's surprised the dog is untrained? This dude probably shouldn't even have kids. He's a shit parent and a shit pet parent too, I would imagine.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "With a name like Zeus, it's probably enormous, too.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Hell, even if the dog actually were trained, Dylan still has the right to be 0% Dog Person.  (I am personally 100% Cat Person, 0% Dog Person and I feel really sorry for this kid.)",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Untrained dogs are so goddamned annoying and sometimes/often quite dangerous",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 893,
          "content": "Why are these men so bad at 'connecting' just because their kid doesn't like sports. I see this on posts way too often!",
          "id": 112,
          "comments": [
            {
              "score": 557,
              "content": "Honestly I see it with me dating too. I’ve seen tons of guys who get their girlfriends into their hobbies but I never see guys get into their girlfriends hobbies. Same with their kids. They want their kids to get into their hobbies but never take a moment to try to get into their kids hobbies. Think about how much it would mean to Dylan if OP tried to read one of Dylan’s favorite comics.",
              "id": 113,
              "comments": [
                {
                  "score": 438,
                  "content": "Yeah, I think I saw a post years ago where a woman said her boyfriend expected her to go to games with him when she had 0 interest, but when she told him she wanted to get up early to watch the royal wedding he refused because he had no interest. \n\nIt's so aggravating when our interests are optional and theirs are mandatory.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 127,
                      "content": "My first boyfriend was exactly like that. We both played games and watch anime but I am much more obsessive about it than he is. He is a huge Mortal Kombat fan and insisted we play even though I'm not too into it. Ok, cool, I played and I looked into the MK lore. He only ever watched Black Jack (really old clasic anime) and nothing else. I've tried watching that anime a few years before we dated and didn't like it. So I declined. Pitched a total fit when I accepted a recommendation from our mutual friend (also anime/game lover) to watch an anime that was within my interests. He wouldn't play any of the games I liked and insisted we only play Mortal Kombat... like... buddy... not how this is supposed to work >.>",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 385,
                  "content": "This is one of the things that made me give the nod of approval to my mom's new boyfriend.\n\nHe's the first one out of every relationship she's been in that has taken an interest in her art and pottery, and actually attempted it himself. \n\nI mean, he's TERRIBLE at it, but he still tries, with enthusiasm and interest and boy was he SO PROUD of that shoddy little crooked, wobbly bowl he made. 😂\n\nHe is constantly peeking in on her while she's working, and complimenting her pieces, and asking about techniques and how she does things, and just constantly being utterly marveled by the things she makes.\n\nHe even helped her build a Raku kiln in the back yard!",
                  "id": 116,
                  "comments": [
                    {
                      "score": 116,
                      "content": "This made my heart happy.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Reading this made me really happy. I’m glad for your mom.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "That's so adorable!!! He's a keeper.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "This internet stranger is happy for your mom.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "“Main character of the family” syndrome",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Right, and it's not even that hard to make an effort for a kid, to ask about their interests, try it at least once, ask what else they might be interested in trying and try it with them. The kid likes comics--Dad could just read a few comics to talk about with him! Or hey, Dylan, you like Hawkeye comics, would you ever want to try archery? Oh, you would? Let's try out a class together and see if we like it!\n\nMy dad loves sports, which not one of the 4 of his kids care about at all. He is so not into musical theatre that he fell asleep during Wicked, which I feel like is almost impressive because it is pretty loud. \n\nWhy was he *at* Wicked? Because I was really really into it as a teenager and wanted to go for ages so for my birthday he got us tickets and went, and even though he did fall asleep he asked about what he missed and talked about it with me and my sister and listened to it in the car with us. Again, he REALLY was not interested in that, but he did it for his kids. He gets soooooo bored and fidgety at museums and is not very interested in art, but he would take us to the art museum anyway, and didn't even complain about me wanting to read every caption in the rooms I was particularly interested in. And we sometimes go to Sox games with him, even though we do not care about it at all, because he loves going with us. But we do that because we want to, because he's a good dad, not because he pressures us to go with him or to love sports.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Right? “I’m going to sit here and talk down about Dylan for preferring comics and make zero effort to engage with him on his own level, but I’m going to ban him from his other hobbies until he starts pretending to enjoy what I like to do.”",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6884,
      "content": "i just...\n\nYTA.\n\nbig time.\n\npoor dylan.\n\n7 years and counting, wanna bet?\n\nalex, the heir, the pride and joy with the same likes as you. dylan, the spare, can't click with you because you do not understand him. jake, the baby, again someone you can click with.\n\ndylan situation sounds like the typical overlooked middle child. he is his own person, has not to be your carbon copy to show the world your 'manliness', your prowess between the sheets!\n\nyou wore your wife down with weeks of nagging.\n\nthen you set your sights on your defenseless child.\n\nhe said no, you pressured him, used your position as an authority person to wear him down saying yes to get a dog.\n\nhe warned you - your dog, not his problem.\n\nand what are you doing now?\n\nagain stomping over him, trampling his boundaries into the dust just because again, he isn't a carbon copy of you?\n\nis his own person?\n\nwith his own wants and his own needs?\n\nin future years, when you browse through social media and see a post that he is engaged but he didn't tell you. when you see wedding photos for a wedding you got no invitation too. the birth, the baptism of (a) grandchild(ren) you will never see.\n\nthen search for this post.\n\nread it.\n\nand maybe then you will understand that 'no' is a full sentence.\n\nbut untill then, the 'lord of the manor' wants a dog, the 'lord of the manor' gets a dog after nagging, cajoling, pressuring wife and middle child into agreeing. but now the 'lord' is pissed that a forced 'yes' is still a 'no'. and again abuses his authority as a parent to pressure said child into behavior the 'lord' deems acceptable.\n\nthere are people out there who dislikes dogs, who want a gerbil, a cat, a snake.\n\nthere are people out there who are against getting a pet since they know exactly who will have to care for them - not the owner, no, the care will be placed onto their shoulders if they want it or not.\n\nas you are doing now.\n\nbut guess what?\n\nthere are people out there who know how to help themselves. to stand up for themselve.\n\nhow often do you think can you force dylan to try to bond with zeus by walking him? to play with him? to care for him?\n\nhow fast comes the day when you come home from work and get informed that dylan walked zeus - as the lord ordered - but sadly zeus got away.\n\nand is nowhere to be found.\n\nand all this just because you can't accept that dylan is not you.\n\n&#x200B;\n\neta: thank you kind redditors for the awards. i've finally figured out how to get a notice for them and say thank you via the chat (i hope). in case this doesn't work again, thank you.\n\nand please, say a prayer for dylan, will ya?",
      "id": 124,
      "comments": [
        {
          "score": 3514,
          "content": "Not to mention, it wasn’t until the eldest child started “siding” with mom and brother that OP started second-guessing himself.  The words of his wife and son were not enough. \n\nOP, YTA.",
          "id": 125,
          "comments": [
            {
              "score": 656,
              "content": "That's cause the oldest child is a man that shares daddy's interests. What would the wife know about things, she's a woman who he had to wear down with weeks of nagging, and his middle son who he doesn't care since he's not into the same things as the kids he has that he can bond with",
              "id": 126,
              "comments": [
                {
                  "score": 227,
                  "content": "I'm guessing that Dylan is more like the wife than dad, which begs the question, how does he relate to his wife?",
                  "id": 127,
                  "comments": [
                    {
                      "score": 115,
                      "content": "Exactly, I’m concerned OP wears down his wife’s other “no”s into “yes”s. Which in certain contexts could be very bad.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "She relented to sex with him at least 3 times.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 260,
              "content": "He only listens to manly people. As a non-manly boy, Dylan can be safely bullied, pushed around, and ignored ... just like his mother.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "Mom was not on board because it would probably one more thing that ends up in her lap",
              "id": 131,
              "comments": [
                {
                  "score": 22,
                  "content": "1000%",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "RIGHT! His middle child told him time and time again, yet OP refused to listen. But as soon as the prized first child said something was off, suddenly OP pauses for reflection.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "And OP says his wife isn't \"receptive to his advances\" now, so it only gets to be a problem when he's not getting any AND his favorite kid says so.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "This, how many times has OP trampled on his wife's boundaries or wore her down until she said yes?",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 550,
          "content": "I wonder if the whole \"he doesn't like sports and gross dogs\" thing is a dog whistle (lol) for \"he might be gay\".",
          "id": 136,
          "comments": [
            {
              "score": 215,
              "content": "I don't know if OP suspects the kid is gay but there are *definitely* a lot of \"my son doesn't like MANLY, NORMAL things like me, and therefore must be FIXED\" vibes here. The comic books thing made me think OP may also be somehow trapped in stereotypical 80s high school and think his son is too nerdy or something. Could also definitely be both!",
              "id": 137,
              "comments": [
                {
                  "score": 61,
                  "content": "Dad certainly comes across as the jock who peaked in high school.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 203,
              "content": "i fervently hope not.\n\ni can see op sending his son to a 'camp' to 'make a man out of him' if you get what i mean.",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 86,
              "content": "Honestly that thought came to my mind, too.",
              "id": 140,
              "comments": [
                {
                  "score": 16,
                  "content": "i love your username lol",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "My first thought, too. OP seems very intent on pointing out how “different” this kid is from him and the rest. Kills me that people like this don’t get that depriving people of joy and expression won’t make them less gay.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Bingo. I thought I was just being cynical but I guess I'm not the only one.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "Damn, couldn't have said it better",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Shit dude, I'd throw an award at you if I had one, well said",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Poetry",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "“The floggings will continue until morale improves”",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "My heart stopped at “& Zeus got away”. THIS, OP needs to realize if Dylan is not fully engaged or committed in the dogs safety, that’s an unfair position for both Dylan and the dog. I’ve literally had ppl who adore my dog, tell me they were not comfortable watching my incredibly fast and “escape artist” dog because they don’t want the responsibility in case something were to happen. & I respect and appreciate that! No one who is uncomfortable caring for a dog should be forced to carry that pressure and burden! This is how dogs get lost, hurt, and unfortunately, killed!",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3386,
      "content": "YTA. Huge. To both the dog and your son. He will end up hating animals thanks to you.",
      "id": 149,
      "comments": [
        {
          "score": 404,
          "content": "Not to mention hating the dad.",
          "id": 150,
          "comments": [
            {
              "score": 40,
              "content": "That he already does",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "But he clearly deserves it",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2450,
      "content": "When someone googles \"total asshole\" I'm guessing your photo pops up first. You're a manipulative husband and a crappy father who doesn't like it when he can't get his own way.  YTA",
      "id": 153,
      "comments": [
        {
          "score": 85,
          "content": "Couldn’t have said it better!",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "[removed]",
          "id": 155,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2103,
      "content": "YTA and you are telling Dylan that you can’t be trusted. He relented and agreed under the promise he would have no responsibility and you misled him and are now punishing him for not doing something that you said he didn’t have to do in the first place.   This is gonna have repercussions beyond the dog if you don’t change course, recognize and apologize to your son.",
      "id": 156,
      "comments": [
        {
          "score": 170,
          "content": "This, so true.\n\n&#x200B;\n\nOP, YTA",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "It's called cognitive dissonance. \n\nIt literally makes 'victims' crazy by making reality unreliable.\n\nOP you wanted a dog. You got a dog. Take care of it and leave Dylan out of it.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1911,
      "content": "INFO Why are you so obsessed with Dylan not being interested in the dog? He’s not being mean to it or making your life more difficult by not wanting to be around the dog. \n\n>which has always made it hard for me to connect with him\n\nBecause everything needs to be all about you, what you like, on your terms?\n\nDon’t be surprised if your relationship becomes nonexistent when he’s able to move out.",
      "id": 159,
      "comments": [
        {
          "score": 723,
          "content": "In a comment he says \"because the dog is a family member and everyone needs to chip in\"\n\n\n\nI personally think it is bs to make the kid do most of the work that didn't want the dog. It is also bs to lie to your children and double bs to not take care of your own pet but make your kids do it.",
          "id": 160,
          "comments": [
            {
              "score": 277,
              "content": "It’s not just that Dylan didn’t want the dog: in the original post OP also says Dylan told him he wouldn’t help with the dog and OP agreed, just to get everyone to say yes to a dog. Now OP’s surprised that Dylan hasn’t miraculously changed his mind and started helping with the dog and OP is going back on his word. It seems like he always planned on going back in his word about this. \n\nThis post makes me so annoyed on behalf of Dylan and the wife. OP YTA\n\n(Edit spelling)",
              "id": 161,
              "comments": [
                {
                  "score": 31,
                  "content": ">and the wife\n\nFor real, because you know he pulls this same shit on her when he wants sex and she doesn't.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 303,
          "content": "Scapegoat child.",
          "id": 163,
          "comments": [
            {
              "score": 84,
              "content": "Yep, scapegoat child and weirdly power tripping dad.\n\nThis thing that (mostly) men and little kids do: they hear \"No.\" and rather than taking it in they think, How can I wear them down until the answer is Yes?\n\nLet me say here that teaching your boys not to take \"No.\" as a complete and final answer is a very dangerous thing to do. Most women have met these boys later in life as men and we did NOT have a good time with them. \n\nI hope OP can hear what everyone in this thread is saying. No. means No. no matter how much you want to have things your way other people, even your poor scapegoated child, have their own preferences and you need to give them agency over themselves and their choices.\n\nYTA",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I hope Dylan moves out at 18 and gets a rabbit.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1700,
      "content": "It cracks me up when people say “throwaway” when 1. Nobody knows you so why does that matter? And 2. You just explained the whole story. Do you really think your wife won’t be able to figure out that it’s about your family? \nYTA. Unfortunately, I’m a dog lover, but the kid straight up told you he didn’t it want it in the first place and said he wouldn’t be helping with it, and you didn’t deny him of that right then. So you can’t all of a sudden force him to be part of something he told you he had no interest in.",
      "id": 166,
      "comments": [
        {
          "score": 720,
          "content": "$10 says his main is in some NSFW subs and doesn't want anyone snooping on those",
          "id": 167,
          "comments": [
            {
              "score": 172,
              "content": "Never thought of that, makes so much sense 🤣🤣🤣",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "Or it contains a post history that paints him in a negative light.",
              "id": 169,
              "comments": [
                {
                  "score": 30,
                  "content": "Not that he could be painted that much worse than right here 😂",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 95,
          "content": ">Do you really think your wife won’t be able to figure out that it’s about your family?\n\nI take it more as \"my friends/fam know my account and can browse my post history any time, so I did not want to post this sensitive content on my main account where they can easily stumble across it\".",
          "id": 171,
          "comments": [
            {
              "score": 47,
              "content": "More like they don't know my account but they will recognize me from this story so I don't want to lead them straight to my account",
              "id": 172,
              "comments": [
                {
                  "score": 13,
                  "content": "Yea I always assumed people do it for this purpose too",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 28,
          "content": "I was JUST thinking this on another post. Here’s this super specific situation that just happen but hopefully no one will recognize the story. I’ve had situations I wanted to post here - but I know my friends read Reddit and would IMMEDIATELY know. So strange.",
          "id": 174,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1149,
      "content": "Yta. Stop fixing your son. He is not broken, he is different from you and that is a good thing. Accept him as he is.",
      "id": 175,
      "comments": [
        {
          "score": 462,
          "content": "The one great piece of parenting advice I ever got when my kids were newborn was \"Raise the child you have, not the child you thought you were going to have.\"\n\nOr, by implication, the child you hoped to have, the child you were when you were young, the child your other kids are (except when you're parenting them; then raise the ones they are), the child you were afraid you might have, the child you had two years ago, or any other variant besides the actual child who's standing in front of you right now. \n\nOP is refusing to raise Dylan as Dylan is. He's trying to raise Dylan as if he were somebody else -- himself when he was little, or his other two kids, or the kid he wanted to have, or some combination. But he's not raising the child he has.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}