{
  "post content": "I (16 F) am a babysitter and I babysat for a family I have never babysat for before. They have a baby that’s only a couple months old, a 4 year old boy & a 4 year old girl (and are paying me 12/hr) As you can imagine they are all on the smaller side and require lots of attention. when the parents were about to leave their friends came over and dropped of thier 4 year old. I am not getting paid extra and this was not communicated with me ahead of time. The parents brought her to me and said that she goes to bed at the same time as the others and gave me a quick smile before leaving. I babysat the kids for 6 hours. I was wondering if I should i bring it up to the parents or should i just let it go since it's only one extra kid? It just kinda seems unfair that there was no communication to me about it and im supposed to feed this extra kid, get her ready for bed, keep her entertained & put her to sleep. In the end i decided to do nothing about it and told myself that it wasn’t that big of a deal, my parents and friends have since said that i was being taken advantage of.. Yesterday the mother texted me asking if i would babysit for her kids again while she went out. I declined telling her that I didn’t feel comfortable babysitting with her again because she didn’t communicate with me last time and i felt blindsided. She snapped back by telling me that i was very rude and it was in the past. She said I should’ve said something then and that it is my fault for not telling her how I felt. I feel really bad but my parents told me that she is trying to guilt trip me since I’m only 16 and she thinks that she can. I haven’t responded to her messages because I am unsure of if I am in the wrong. So am I the a hole here?",
  "id": 1,
  "comments": [
    {
      "score": 8192,
      "content": "NTA. 12/hr is wayy too low of a price point. You should have been paid more especially if you are caring for 3 kids. \\[in addition to having to babysit for a 4th unexpected child\\]. Shes the A for expecting you to babysit another kid and not communicating with you about it - big NO.\n\nDo NOT babysit for her. Do NOT let her guilt trip you. Do NOT tolerate her behaviour.\n\nIn the future, you shouldn't have to justify your reasoning as to why you can't babysit someone's children - eg. her children in this case. I feel like you should give her the reason of being uncomforable. Just tell her that you are unavailable. Block her number. \n\nI would also think about what prices you would charge for babysitting. I know that some people have a baseline price for 1 child and then an additional cost for multiple children (maybe a couple of dollars more added onto the baseline price per child\\] - this is completly up to you. For example maybe $12/hr for one child and then maybe a couple of more dollars \\[$2-5\\] extra per child.",
      "id": 2,
      "comments": [
        {
          "score": 2727,
          "content": "in my area, the MINIMUM rate for 1 kid  (over 4) is $14/hour, $17 for kids under 4 (or arent potty trained). \n\n\n(and thats the teenager/not certified rate)\n\n\nadd $4 per kid per hour, and usually limit the total # of kids. \n\n\nyou are a very affordable babysitter which is why the mom took advantage of you. \n\n\ndont reply back to her. its only going to get worse. ",
          "id": 3,
          "comments": [
            {
              "score": 724,
              "content": "Too low. 40 years ago I was paid $15/hr to watch 5 kids (2 from one family, 3 from another that wanted to get together). Kids ranged in age from 4-10.",
              "id": 4,
              "comments": [
                {
                  "score": 1321,
                  "content": "Man the best babysitting gig I ever had was for a single child which would now be labeled on the spectrum. Youngest of 5 and everyone else was in college or moved out. $15 an hour for me to get my butt kicked in N64 and read him Harry Potter. Apparently other teens thought he was a handful, but our flavors of neurospicy complemented each other. They even let my boyfriend come over on NYE and do sparklers with us and watch neighborhood fireworks,  so long as he left after midnight. That kid is now an incredibly successful member of a Big 4 accounting firm, which his lawyer dad blames on me. I’ll take it.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 247,
                      "content": "Neurospicy is fantastic!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 91,
                      "content": "\"Our flavors of neurospicy complemented each other\" \n\nis a beautifully poetic start of a friendship.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "Awwww... I love this!!!  I'm so glad he had you as a babysitter.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 83,
                      "content": "Nice work!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "This reminds me of a work friend of mine. She was telling me a story about her neurospicy stepson, she, herself, her new partner and the other son are all apparently neurospicy. Anyway. She was telling us the story how him getting in trouble at school over neurospicy behaviour (forgetting books?) and I looked so puzzled that she asks me laughingy \"You see nothing wrong with what he did, do you? That says more about you than it did him\". TBH, I've never been evaluated, but she keeps saying I probably am based on my getting along better with the neurospicy community.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "Stealing \"neurospicy\"!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "W sitter 🙌🏼",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Good freakin times",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "You're clearly a bad influence.....\n 😉",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I had the same experience. His mom always paid me extra like $60 for 4/5hrs then would leave pizza money and tell me to keep what was left over. I was the only person who was able to get the kid to fall asleep aside from his mom and I only lived a couple blocks away.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 267,
                  "content": "Heck, I got paid $15/hour in 2003-ish to babysit my professor's dog for 4 hours. I got paid 60 bucks to watch TV with a dog in my lap, and all I had to do was feed her and let her out to pee.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 25,
                      "content": "When I was in school I lived for and was known for dog sitting. People always paid at least twice as much for dogsitting, it was easier, and I love dogs.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Is your professor still hiring? Sounds like a dream job.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "In the mid-late 90s I got paid like $20/hr to watch 3 very well behaved kids who were only allowed to watch tv when they had a babysitter so I let them watch a couple hours, then we read books and went to bed. All potty trained and fed by the time I got there. I was not expected to clean dishes or anything else. The worst they ever got was arguing over who got to choose the book to read. I just agreed everyone could pick a book (these were very short books) and I’d read them all and problem solved.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Lucky. I got paid $30/week to: get two girls off the bus, help with homework, cook dinner, handle bath and bedtime, wake them up in the morning, manage breakfast, and walk them to the bus stop...five days a week. Their parents worked 3rd shift. This was in...'99-Early '00.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Omg in the early 2000s I got paid $3/hour to babysit 5 kids who weren’t allowed to watch TV with babysitters 😂",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Where did you live? I lived in a pretty big city on the east coast in the US, and baby sat for wealthier families. The average was $10 to $12. Only one family ever paid me $15, and their kids were a horror show. That was 25 years ago.\n\nETA: I absolutely think OP is being taken advantage of. I just want to know where someone lived in the 80’s and made $15 to $17/hr as a high school babysitter because minimum wage was $2-$3.75/hr depending which state you were in.\n\nETA 2: I babysat from 1996-2004 in Richmond, which is actually medium sized, so I’ll correct myself there, and from 2004-2006 in Virginia Beach which isn’t NYC, but fairly big coming in at 39th in the US.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I swear every time I see one of these babysitting threads the going rate gets higher and higher. Clearly OP is being taken advantage of, but the only relevant rate is what other babysitters are charging in her area today.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Tucson Arizona",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "40 years ago, I was excited to get $5/hour.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "This thread makes me laugh. A rate of $15 per hour is approximately twice the minimum wage in Texas (which admittedly has not kept up with inflation.) My college-age niece charges $20 per hour. \n\nWhen I was age 14 to 16, I got paid $0.50 per hour, in the early-mid 1970s. The minimum wage at the time was $2.10 per hour, so that was less than 25% of minimum wage. My sister took over my clients for me, and the going rate went up to $1 per hour. \n\nWe were robbed!",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 36,
                  "content": "Wow you had it good! 40 years ago I was paid $10 for 3 kids for 3 hours.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I was about to comment the same thing. My parents used to pay $10 per hour to babysit me and my sister back in the 80s. I could very well see $20 per hour now. OP was severely underpricing herself.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah they didn't get together often. Maybe once a month for 3-4 hours. But my first real job when I turned 16 delivering pizzas I made average of 10-13/hr when minimum wage was 3.35/hr. People paid good in those days.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I got $4 to watch 3 kids for 4 hours 50 years ago. Stingy MF😡",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I got $1hr for 4 kids & sometimes their friend would drop her 2 off.. I was 12, watching 4-6 kids ranging from 2-8. ofc I was stoked. They lived at the end of our road, so in case things got wild,I could call home for reinforcements..but back then kids weren't entitled brats & I was a fun babysitter, so they were easy. It was the lack of TV after midnight that sucked.. news, the love boat & fantasy island, then taps & static..\nMy girl just paid $25hr for a babysitter to watch her 3yo on a Saturday night.. maybe it's time we start babysitting again?lolz",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "30 years ago, my sister tried to pay me \"a dollar per hour per kid\".",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "40 years ago. That's a stretch. The minimum wage 40 years ago was $2.65/hour. Your intended point is very much valid, but the stretch kinda undermines it.\n\nMaybe in Beverly hills in 1984 they were paying that, but in Everytown USA, it wasn't anything like that hourly rate.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I babysat about 30-35 years ago. Kids were 9, 4, and 2. I babysat them for about 6 years.  I got around $20 an hour and $150.00 for my birthday and $150.00 for Christmas.  Also if I babysat like 1h40 min they would round it up to 2 hours.  Plus they didn’t ask that I do any cleaning, food was prepared all I had to do was warm it up.\n\nSo you are totally right it is way too low for the number of kids and their ages and throwing in another kid that you don’t know.  Plus it sounds like they didn’t go into much detail about the issues that could arise with new kid.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Man I only got $2-3/hr for 1-2 kids 25 years ago. And the parents would round payment to the 50 cents. I decided very quickly it wasn't worth my time. People paid better AND gave me snacks for pet sitting.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 233,
              "content": "OP, read this.\n\nAnd sit with your parents to discuss your billing rate. Any future jobs, text or email your fee schedule. \n\nIf that woman gaslights you again, let your mother respond and put her in her place. She blatantly took advantage of you. Your mother is not out of place to tell her that she used you, took advantage of you, and to never contact you again. \n\nAll to save a few measley bucks. Dear God.  Tell your friends to stay away from that woman.",
              "id": 36,
              "comments": [
                {
                  "score": 74,
                  "content": "And 3 small children and and infant is too many children for 1 teen to handle. There are laws about minors and their supervision children under the age of 7. I think she was in violation because an infant was in the mix. What if there was an emergency?",
                  "id": 37,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Was just going to say, I am hesitant about teen babysitters at night anyway and certainly would leave an infant plus three other small children with one.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "I'd tell her rates have gone up to $15 per child per hour and to be paid upfront 😁",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "This. My daughters get $15 base for 1 child and $2 more for each additional child per hour.\n\n$12 is a joke.",
              "id": 40,
              "comments": [
                {
                  "score": 2,
                  "content": "I made $12 an hour in the 90s.",
                  "id": 41,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "We are never going to come up with a consensus on what the price should be, because we all come from different areas and different social classes.",
              "id": 42,
              "comments": [
                {
                  "score": 4,
                  "content": "$12 is way too low for the such a huge responsibility",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "As someone who did daycare for 8 years and was only able to charge $30-$40 a day per child in my area, this makes me cry. And I could only have 6 kids.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I'm in NYC. People pay $25/hr here for 1 kid and that was PRE-pandemic.",
              "id": 45,
              "comments": [
                {
                  "score": 10,
                  "content": "I'm in the Bay Area. $20-25/hr for one school-aged kid is pretty standard. Add 5/hr for diapers/infants, and probably 10/ hr for each additional kid.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yup that’s the rates in my area too.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I live outside NYC and rates START at $20/hour, even a few years back when our kids were the age where they needed sitters. We basically stopped going out because the sitter cost more than the date night itself!",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "This is the way👏👏👏. Op your parents have your back. Listen to their opinions as to how to take the wickedness of the world into account.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Thats insane! My 11 year old, certified in august 23' charges $5 per child. $10/ child with special care needs. Obviously she is new to sitting and will raise her prices. But never to that much. $17 an hour shheesshhh\n At thT point i cant go out lmfao im staying in and they go to the sitters house so i can nap 😴 .... thats not to bad an idea though! Lol",
              "id": 50,
              "comments": [
                {
                  "score": 3,
                  "content": "Wow! That’s 1980 prices! Your 11-year-old is getting taken advantage of too! Unless you live in an area where inflation hasn’t happened in over 30 years!",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 188,
          "content": "I agree with the changing your prices. 25 years ago I got paid $12 to babysit 3 kids. I repeat, 25 years ago…\n\nOPs starting point should be $12-15, adding $2-5 per each additional child. Further more, if it is someone else’s kid being added last minute, I would tell her that’s gonna be an additional $12 per hour. The other parent should be able to pay you that. The price more so for the inconvenience than anything else.",
          "id": 52,
          "comments": [
            {
              "score": 24,
              "content": "$12 in 1999 is $31.50 now adjusted for inflation",
              "id": 53,
              "comments": [
                {
                  "score": 5,
                  "content": "Seriously?",
                  "id": 54,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yes. The workers of today are multiple times worse off than they were 25 years ago. Wage stagnation (not tracking inflation) and rocketing costs of living being the main causes.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "The mom probably told her friend it was okay for her to bring her child and she didn't have to pay. I'm hoping they are not both cheap AHs!",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly bc it’s a different parent.  Gf should’ve walked the minute they pulled that stunt but at 16 she’s at a disadvantage and that’s what they were banking on",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "I’m glad she spoke up to let the Mom know why👍",
          "id": 58,
          "comments": [
            {
              "score": 128,
              "content": "Yes, I actually think that was very mature!\n\nShe doesn't owe the mom an explanation, but giving her one was great in this case. She let her know how the mom had abused the situation previously, and why the made her not want to work with her.",
              "id": 59,
              "comments": [
                {
                  "score": 46,
                  "content": "NTA. You didn’t do anything wrong.  Don’t let that woman guild trip you. \n\nAs others said; block her number, review your pricing and all will be fine.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "It's not like that mother wasn't aware lol. That's just shitty people being shitty. The reaction when told proofs it.\n\n\nA decent person wouldn't have reacted by attacking and blaming op but would have apologised to op, then offered (and insisted) to pay op the rate for an additional child to babysit retroactively at least. Also some version of 'this won't happen again' and agreement on how to handle similar issues in the future.\n\n\nBut then again, a decent person would have been unlikely to even put op in that position but would have asked her whether the additional kid would be ok and at what rate.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I’m glad too!! See if this woman gets away with that garbage with another sitter",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "NTA-The fact that she got angry with you and turned it around on blaming you would be enough to not babysit for her again.",
          "id": 63,
          "comments": [
            {
              "score": 40,
              "content": "Definitely. I would not work with her again after that response. ",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "She got angry because she knew what she was doing and got called out for it. \n\nShe's a bitch and OP would do right by blocking her number.\n\nOP is *definitely* NTA!",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "They all took advantage of you. They put you on the spot, knowing you wouldn't say anything in that circumstance. That's also too many little ones for one teenager to be caring for. Not cool. \n\nNta. Block her. Post about it elsewhere too so no one else gets railroaded by them. They're the AHs here and they should be ashamed of themselves.",
          "id": 66,
          "comments": [
            {
              "score": 7,
              "content": "EXACTLY.     AND THAT MOTHER WHO HIRED HER HAS A LOT OF NERVE.   OBNOXIOUS WOMAN.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This!!! Shame her and tell what they paid you! If the mom believes it’s ok what she did she won’t have any reason to be angry 😂😂",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Another thing to add, do not let anyone downplay how much of a big deal an extra child is. Outside of the usual babysitter concerns of workload, allergies, etc part of a babysitter's job is being able to handle a worst case scenario until parents/guardian can get home. Wrangling an extra child in an emergency is a big deal, especially if they're young. You need to consider your hard limits on number of kids and stick to them. Hopefully you'll never have to handle a big emergency, but knowing your limits on what you can handle is essential",
          "id": 69,
          "comments": [
            {
              "score": 4,
              "content": "I'd add an extra kid they are in a new environment so they normally sleep just fine, but now it's a strange other 2 have a friend so they are likely bouncing off the walls. My 3 yo will do laps of his grandparents house at 10pm when he's usually in bed at 7.30!",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "I used to charge per kid,so like 10-15$/hr (based on age. Higher price = younger kid) and got plenty of business in the late 90's-early 2000's. You're undercutting yourself. Your time, mental and physical energy, and emotional load is worth more. \n\nAt LEAST 15$/hr + 5$/hr per additional child.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "I’m super impressed that OP told her why though, that was a baller move.",
          "id": 72,
          "comments": [
            {
              "score": 6,
              "content": "Young lol.  Clearly by this post she hasn't been fucked over or pissed off by people's bullshit enough to stop giving a good god damn about what they think.  I'm not criticizing, the kid is 16 lol.  Few people that age have encountered that yet, and this was her introduction into shiesty people trying to take advantage.  Which is actually an interesting insight, she did it to explain her side.  We say \"Eh, eat a dick!\" and don't even bother with the whole effort of getting into the why's and what for's and just politely dance around stuff to avoid the drama.  And then as we get more and more jaded, we're so used to \"politely\" dancing around shit that we go back to just blatantly saying what's on our mind and that's the ultimate sign of not giving a fuck anymore.\n\nFunny how the cycle goes full circle, innit?  I do think she genuinely thought these people might have the temerity to be ashamed of what they did though lol.  Lesson learned I suppose.  People can suck.  She did the right thing IMO, fuck em'.  Blatantly let them know what they did, and the only advice I have is to follow it up by blocking them and stick to the guns.  Took me until my 20s to start standing up for myself, so she done good!",
              "id": 73,
              "comments": [
                {
                  "score": 2,
                  "content": "I’m proud of our girl ❤️",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "Yes, listen to your mother…she is right and these people are really taking advantage of you! Stand your ground! You are worth more money too!",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Maybe let a parent communicate with her with one single call or text, \"My kid will not be looking after yours after that stunt. Kindly their parent,\" \nAnd then block.\n(The parents sound reasonable enough to ask them, at least)\n\nIt's grand for an adult woman to expect a 16 year old to say, \"I'm not happy about looking after another child for free\" on the spot when she didn't communicate as the ADULT that there would even be a extra child. Or offered extra payment. (Honestly, other mom should have paid. They are two separate clients) \n\nShe's being demanding because it's a 16-year-old she's talking to. \nAnd not a parent or other adult.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2161,
      "content": "NTA. Yeah they're trying to take advantage and mom's attitude here just proves they'd do it again if given the chance. \"You should have said something.\" You just did. And hello hypocrisy for HER not saying there'd be an extra kid for no extra money. \n\nJudge things by the situation, not by people's emotional response. The mom is trying to throw you off by acting like you're the bad guy. You aren't. It's your labor, so it's your choice.",
      "id": 77,
      "comments": [
        {
          "score": 761,
          "content": "*She said I should’ve said something then and that it is my fault for not telling her how I felt.*\n\nI’m sorry, but I’m just sixteen and it was the first time someone has cheated me. I have learned my lesson though. Thanks.   NTA",
          "id": 78,
          "comments": [
            {
              "score": 149,
              "content": "“And if you think I’m so rude then why would you even want to have me around your kids?” Standing up for yourself isn’t rude. That woman knows she’s wrong and she’s just mad she can’t cheat you again.  \n\n NTA, and you’ve learned a lesson here. They were absolutely counting on you not standing up for yourself in the moment. That’s a shitty thing to do to a teenager, and pretty stupid to do to the person you are leaving in charge of your kids. (I would absolutely would NOT have given those kids markers/paints and let them be creative wherever they darn well pleased 😂.)\n\nIf that happens to you again, I recommend telling the parent of the unexpected child that they need to pay you in advance. Or tell them you’re sorry their failure to plan ruined their night out. And then leave them to take care of their own damn kids.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "I like this response a lot.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "To paraphrase Jonathan Coulton, under the circumstances, OP's been shockingly nice. \n\nMaybe OP should concede that she has been quite rude, and she would hate for her rudeness to rub off on the kids, making her dreadfully unfit for the position. NTA.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "\"Very well.\n\n\nI wish you all the best in your search for a new sitter.\"\n\n\ncheers,",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "\"You should have said something.\" She should have informed you beforehand about the 4th child too.\n\nYou are way too nice to these people. Your parents and friends are right. Block them and move on. You don't owe them even an explanation, let alone babysitting.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Just to add too, OP knew nothing about this new kid- allergies, preferences and likely got no contact info.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I'd tell your friends not to babysit for them either.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1200,
      "content": "NTA. Your parents are exactly right: they are trying to take advantage of you and counting on 16-year-old you not standing up to them. I have no doubt they'd try it again. \n\nThe mother's comment that you are rude is ridiculous. She's trying distract from the fact that SHE is the rude one in lying about the terms of your employment and then counting on her position of age-based power to get away with it.\n\nGood for you for turning her down and telling her why!",
      "id": 86,
      "comments": [
        {
          "score": 181,
          "content": "This.\n\nOP, this is what you reply to the mother:\n\n\"No. I am not rude. I have self respect. You took advantage of me and put me in a terrible situation. I will not be babysitting for you again.\"\n\nAnd, from here forward, OP, raise your prices to a flat fee for the first child and $1 for each additional child. Get in text the number of children that you will be watching and tell each family from here forward that a family has done a bait and switch on you in the past and if they spring extra children on you last minute, the sitting job is cancelled immediately and you will leave.",
          "id": 87,
          "comments": [
            {
              "score": 83,
              "content": "I agree except more like $5-10 per extra child depending on what she raises her base rate to.  OP is way undercharging.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Yes, or “I’m 16, mam, I haven’t been tricked by my employer yet and do not know how to react immediately on this situation. I’ve learned now. \n\nMy rate is 20$/h + 5 every extra child, Thank you.”",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Girl it’s 2024.  Minimum $5 each extra and if it’s a different parent their first kid is base rate.  They cheated her and they knew what the fair rate was",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "I agree-- it's awesome that OP turned down the job and explained why! That wasn't rude, it was mature. \n\nI think this younger generation is doing much better at not accepting unfair and unreasonable working conditions. That's a good thing--I see too many managers trying to take advantage of workers, pressuring them to work while sick, to work excessive overtime, to take on more and more tasks without compensation. I hope to see this change a bit",
          "id": 91,
          "comments": [
            {
              "score": 24,
              "content": "Seriously though!  Reading how she responded to the second request, I was impressed at the civility and maturity of OP’s response. Firm, polite, and honest.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "As a former young lady having grown up in a \"Turn the other cheek\" culture, it is so good to see. I was constantly getting fucked over, power-tripped, guilt-tripped, and felt powerless to do anything about it. Really rooting for you, Gen Z. People will continue to treat you however you allow them to. Set that precedent and stick to it, because no one else will do it for you.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 799,
      "content": "NTA.  She’s just mad because she thought she got away with sticking you with an extra kid.\n\n>She snapped back by telling me that i was very rude and it was in the past.\n\nIt was literally the very last time you sat for them, not something you dredged up from the long-distant past.  Refusing to sit for them again is the best way to make sure it doesn’t happen again in the future.  ",
      "id": 94,
      "comments": [
        {
          "score": 139,
          "content": "Also, an impromptu sitters' union might not be a bad idea.  If OP and any sitters she knows pool information about clients like this it can spare them some grief.  Saw it happen with my girlfriend and her circle when I was young.",
          "id": 95,
          "comments": [
            {
              "score": 103,
              "content": "Babysitters’ Club!  If you aren’t familiar, it’s a series of books about just this. They have dossiers on each family and weekly meetings to assign jobs. At some point I think they even get subcontractors",
              "id": 96,
              "comments": [
                {
                  "score": 20,
                  "content": "I loved those books as a kid.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Yes, OP needs to stand up for herself! Even if it were only the two 4-year-olds and an infant, $12 an hour is WAY too cheap. I paid more than that ten years ago for two elementary school-aged kids.",
          "id": 98,
          "comments": [
            {
              "score": 50,
              "content": "It’s also a safety/liability issue.  OP met this extra kid 3 seconds ago, doesn’t know if the kid has allergies, or anything else OP might need to know when being fully responsible for a child that small.  ",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "By this person's logic, nobody should ever be held accountable for anything, ever, because the moment you do or say anything it's immediately in the past. ",
          "id": 100,
          "comments": [
            {
              "score": 38,
              "content": "Lol, literally what I was thinking!\n\n\"That was in the past!\"\n\n\"Yes, but it's very hard to complain about things that are in the future\"",
              "id": 101,
              "comments": [
                {
                  "score": 2,
                  "content": "This! Anyone who says that phrase is by definition TAH.  I don’t know if any time anyone’s used it with me unless they were trying to dodge accountability",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Indeed.  And you can \\*bet\\* how well her saying something at the time would've gone while mom was trying to slide out the door...",
              "id": 103,
              "comments": [
                {
                  "score": 6,
                  "content": "Yes, if she’d said something at the time it would have been considered rude. \n\nIt would only be not rude at a particular time, defined by rules no one can explain.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "If you have friends who babysit, be sure to warn them about this family. You are NTA. If the woman calls again, tell her you have no intention of babysitting for her again and instruct her to erase your name and number from her contact list.",
          "id": 105,
          "comments": [
            {
              "score": 8,
              "content": "I thought the same thing. I took it even farther and wondered if the mom of children could be setting her up, to blacken the babysitter’s reputation.",
              "id": 106,
              "comments": [
                {
                  "score": 2,
                  "content": "You could be right. \nAny teen who takes on babysitting jobs should work only for families they know. Accepting a job with unknowns could be dangerous.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "And warning other potential babysitters to make the rates contingent on the number of kids with this family. \n,",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Amen.  OP gets to decide what's in the past and what's relevant today.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 377,
      "content": "NTA and your parents are right, she's just trying to manipulate you.  \"That's in the past\" and \"you should have said something then\" is weasle talk for \"I want to see what I can get away with.\"  Apparently no apology and no offer to make it right?  Your fault?  For not telling her?  You just did.  And she responded by blaming you.  Sheesh.\n\nTriple your rate and get paid up front.",
      "id": 110,
      "comments": [
        {
          "score": 67,
          "content": "Yeah, I wonder how she *would* have responded if op *had* been like \"Woah woah woah, you're dumping another, unknown child on me? How does the extra child alter the rate we already agreed on?\" 100% they would have ganged up and played it off like an extra child wasn't even worth complaining about, they're an angel, all you're doing is putting them to bed so what's the big deal? Straight up, damned if you do, damned if you don't.\n\n\nIf the mom doesn't pay up for the extra kid, tell her to lose your contact information until she learns how to be an adult and not try to screw over teenagers who are *LITERALLY TAKING CARE OF HER CHILDREN WHILE SHE IS GONE.* ",
          "id": 111,
          "comments": [
            {
              "score": 10,
              "content": "And they would have all complained about how OP was ruining their night out by her being to greedy to just take on this 3xrra precious angel baby free of charge.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "8 hours minimum, upfront, cash, $20 bills or smaller.",
          "id": 113,
          "comments": [
            {
              "score": 2,
              "content": "Venmo",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 227,
      "content": "> She snapped back by telling me that i was very rude and it was in the past. She said I should’ve said something then and that it is my fault for not telling her how I felt.  \n  \n\nNTA - Shitty people do shitty things and try to blame their shitty behavior on other people and try to make them look shitty instead  \n  \nStay away from shitty people. These are shitty people.",
      "id": 115,
      "comments": [
        {
          "score": 3,
          "content": "Right? Crazy to act surprised that they did something wrong, they knew what they doing",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "How shitty are they really 😂😂😂",
          "id": 117,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 157,
      "content": "NTA. when you're older you won't even think a second about saying no to these kinds of customers, they're trying to take advantage of you because they think you're a dumb teen.\n\n&#x200B;\n\nleaving a random extra child with you that isn't even theirs is also incredibly irresponsible and creates major liabilities for you. next time someone tries that on you walk out on the spot. trust me on this.",
      "id": 118,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 144,
      "content": "$12/hr is not an acceptable wage for care of three children, one being a newborn, let alone for four children.  It's not even legal for the parents to leave you, a minor, alone with their children.\n\nI think it's fair for your parents to step in here.   It's completely inappropriate and unsafe for them to do this! \n And they know it's wrong.  I'm actually wondering if they may have collected money from the +1's parents but didn't pass it on to you.  Bring it up and don't babysit for them again!",
      "id": 119,
      "comments": [
        {
          "score": 58,
          "content": "Actually it is perfectly legal. In my county in Virginia, you can babysit babies and children at the age of 13.",
          "id": 120,
          "comments": [
            {
              "score": 16,
              "content": "It really depends what state she’s in. In Oregon she is old enough to babysit but can only legally babysit 3 kids (not related to you) without a childcare license.",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "It’s not market rate though.",
              "id": 122,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "In the US only two states have a minimum  age limit for babysitting. In Illinois it is 14 years of age and in Maryland it is 13 years of age. The other 48 states do not have a minimum.  So if OP is in the US there’s no reason why she cannot babysit.",
          "id": 123,
          "comments": [
            {
              "score": 7,
              "content": "There is a limit to the number one of non related kids you can watch. In Oregon it’s 3 kids. More than that you need a child care license",
              "id": 124,
              "comments": [
                {
                  "score": 3,
                  "content": "Most states don't have this. So it's very dependent on where OP is. Just like everything in the US.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I think every state has a limit but it’s higher. I just looked up Mississippi and Virginia and you can babysit 6 kids without a license in those states.",
                      "id": 126,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Non related to each other or non related to the babysitter?  In this case 3 kids were related to each other and one was not. Otherwise how would a couple with 4 kids go on a date night? The regs must differentiate between a business intent and “casual” babysitting.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Not related to the babysitter. I guess people with four kids would need two babysitters? Though I think the ages of the children are taken into account and I think it matters if they are in their own home and not the babysitter’s home? I wasn’t able to find a definitive answer. In any case for OP, a 16 year old watching four children under 5yo for 6 hours seems like a stretch especially if it was a surprise.",
                      "id": 128,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "That’s not true. Georgia has an age of 13: https://abuse.publichealth.gsu.edu/child-supervision-guidelines-in-georgia/ ",
              "id": 129,
              "comments": [
                {
                  "score": 19,
                  "content": "I looked at a website that has all the states listed.  Perhaps Georgia implemented this and the website I looked at is out of date. At any rate the point being is it is unlikely any state is going to prevent a 16 year old from babysitting.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "Why does everyone assume everything happens where they live? In their country, etc? \n\nIn Canada, for instance, there is no legal age for babysitting. You can babysit at 12 years old, and in most provinces, there's no limit or age when you can be left alone at home, either.",
          "id": 131,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "Not sure about your opinion on the legality. \nIt would have been sensible to tell the sitter ahead of time, and maybe plan a two person job with so many. remember too this is a 16 year old. Quite mature by the post. She did a stellar job and wasn't respected so otherwise agree.",
          "id": 132,
          "comments": [
            {
              "score": 3,
              "content": "A two person job would have cost them more money, and involved treating teenagers nicely. That's too much to expect from this mom.",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I agree.  I wouldn't babysit for her again.   My daughter gets $20/hour for baby sitting two kids.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Legal age for a babysitter actually varies by state and the majority of states have no minimum age requirement. In a few states it's 13 or 14.",
          "id": 135,
          "comments": [
            {
              "score": 2,
              "content": "And by country. Not everything happens in the US",
              "id": 136,
              "comments": [
                {
                  "score": 2,
                  "content": "Yes, thank you!",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "100% perfectly legal 😂🤣😂🤣 seriously where do you think it's illegal for a teen to babysit. I was babysitting at age 10 🤷‍♀️ and our state has babysitting courses (teaches first aid/cpr) and you have to be 12 years to enroll. So... yeah.",
          "id": 138,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -1,
          "content": ">It's not even legal for the parents to leave you, a minor, alone with their children.\n\nUmm babysitters exist. This is a thing.",
          "id": 139,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 137,
      "content": "Believe your parents.\n\nYou learned your first business lesson.  You negotiated compensation for a specific \"scope of work\", and then your client changed that scope of work without discussing additional compensation for you, taking advantage of your age as your parents well know (and yes, she also tried to guilt trip you).\n\nFind another client, one with honesty and integrity.\n\nNTA.",
      "id": 140,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 113,
      "content": "I would respond, “It was very rude of you not to ask my permission to babysit an additional child and not pay me any extra. You were also paying me a very low rate for three small children and took advantage of me. Shame on you.”",
      "id": 141,
      "comments": [
        {
          "score": 3,
          "content": "DO THIS OP",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}