{
  "post content": "Okay so, I’m 17 going to be 18 this month. And yea, I know that it’s my parents’ house, they pay rent, etc etc. yes I know they can just kick me out whenever. But please just shut up and listen before commenting that I’m in the wrong because I’m the child.\n\nSo for context, today, my “uncle”, lets call him “SP” was being overall annoying. I have an IEP (special education plan essentially) at school, and I usually have accommodations. However, said accommodations arent being accommodated and I relayed this to my mom who was talking to SP. SP barges into the conversation, stating his opinion and basically saying “suck it up and deal with it”. Sure he had good intentions, but for someone who isn’t active in my life like that to attack my opinion, is pretty fucking annoying.",
  "id": 1,
  "comments": [
    {
      "score": 17,
      "content": "ESH.\n\n\"But please shut up and listen\" You sound really lovely and considerate yourself..The whole thing is a bit dramatic. You picked a fight, lost and went crying to your mom and dad. I don't have much to say other than grow up.  \n\n\nEdit: you will probably get a lot of sympathy from redditors though. So good for you. Also, fixing your own problems is not \"some hippei shit\". that's adulting.",
      "id": 2,
      "comments": [
        {
          "score": -11,
          "content": "Being fair, I didn’t pick the fight, I said it as gently as I thought I could. I initially called my mom just to talk to her 1 v 1 and my dad barges in (he does this often)",
          "id": 3,
          "comments": [
            {
              "score": 6,
              "content": "You picked a fight over that Alexa stuff. You could've just shut the door that your mom had left open and went about your day. But you wanted to confront your uncle. I'm not saying your wrong for that. But don't cry after you pick a fight and lose. Then just don't pick the fight. \n\n&#x200B;\n\nYou're young but you should start taking more accountability. You get very annoyed when people don't cater to you. In adult life, most people won't. Just get used to it.",
              "id": 4,
              "comments": [
                {
                  "score": -5,
                  "content": "Its not that, its the fact that people respect my privacy usually and this was beyond stupid",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Get over yourself. You sound like a spoiled little brat. \n\n\"Owh em Gee people didn't fix this problem for me\"  \n\n\n\"owh em Gee people didn't close my door\"   \n\n\n\"owh em Gee people set off my Alexa\"  \n\n\nThen you go cry to your mom for 20 minutes, she sees through your bullshit. Your dad sees through your bullshit as well. And now you come cry on reddit and you open the post by insulting the readers and telling them to shut up. \n\nYou're insufferable. You don't know wth the word stupid means. You'll find the definition in the mirror.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "What you call peace is everything going your way. Sounds like everyone else in the house is always walking around on eggshells cause you are tripping over every little thing. This is so petty and the fact that you went off to that degree and get that pissed off. Yeah your parents will be glad when you are out of the house. You are too much drama",
      "id": 7,
      "comments": [
        {
          "score": 6,
          "content": "Exactly, OP just wants everybody to cater to her and starts yelling when people don't. Holy shit how annoying.",
          "id": 8,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -1,
          "content": "Saying that I’m too much drama is some of the stupidest and funniest shit I’ve heard today. Thanks for the comment",
          "id": 9,
          "comments": [
            {
              "score": 3,
              "content": "Your response is very dramatic",
              "id": 10,
              "comments": [
                {
                  "score": 1,
                  "content": "Wasn’t supposed to be",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "I didn't even get the entire point of your story because of the attitude that's overwhelmingly written in it.",
      "id": 12,
      "comments": [
        {
          "score": -1,
          "content": "Basically, I was trying to explain what SP has been doing, that makes me uncomfortable, and wanted to know if me yelling was an asshole move",
          "id": 13,
          "comments": [
            {
              "score": 4,
              "content": "Yelling is almost always the AH move. Real adults can resolve conflict without yelling and using profanity. You can't even write a post without resorting to profanity. \n\nClose your door, unplug Alexa. Solve your own problems.",
              "id": 14,
              "comments": [
                {
                  "score": -2,
                  "content": "Sure, let’s go with that",
                  "id": 15,
                  "comments": [
                    {
                      "score": 3,
                      "content": "In my entire adult life, I have never resorted to yelling and swearing. \n\nI also don't expect other people to cater to me. If someone is being loud outside my door, I close the door.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": ">Okay so, I’m 17 going to be 18 this month. And yea, I know that it’s my parents’ house, they pay rent, etc etc. yes I know they can just kick me out whenever. But please just shut up and listen before commenting that I’m in the wrong because I’m the child.\n\nThis is as far as I'm reading. YTA",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "If you can’t take the time and effort to read the story, don’t comment at all. Easy and simple.",
          "id": 18,
          "comments": [
            {
              "score": 3,
              "content": "YTA",
              "id": 19,
              "comments": [
                {
                  "score": 1,
                  "content": "If thats your opinion fine",
                  "id": 20,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I'm in the vast majority. I'm sure that's fine for you, too.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Didn’t you post on Reddit to get an opinion ?",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "[deleted]",
      "id": 23,
      "comments": [
        {
          "score": 1,
          "content": "Thank you",
          "id": 24,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Continuation because of the post limits..\n\nAnd then earlier, SP and Mom were talking out in the hallway. For reference, I have an Amazon Alexa/Echo whatever you wanna call it. He’s yelling about something stupid to my mom out in the hallway, (who forgot to close my door when I asked after she left my room, the door was closed beforehand), and screamed out “Alexa” followed by profanities.",
      "id": 25,
      "comments": [
        {
          "score": -1,
          "content": "It set off my Alexa which fucking annoyed me, and sure I could get over it, but what annoys me is that when I asked them to move the conversation so they don’t activate it again is that SP said “Why don’t you shut your door and keep your earbuds on playing video games and ignore us like you always do?” And I told him my Alexa was going iff because of him. He said he knew and did it on purpose.",
          "id": 26,
          "comments": [
            {
              "score": -1,
              "content": "This fucking annoyed me. Why couldn’t they just realize that they had set off the Alexa? Sure I could ignore them, but they were setting off my device that was talking back towards me for no reason. I told him “why cant you guys close the damn door after opening it?” And SP just went on this rant about how I’m not fixing my own problems, and blaming it on other people and I’m not being positive, some hippie shit.",
              "id": 27,
              "comments": [
                {
                  "score": -1,
                  "content": "He left the house to go out for a break after we argued and I called my mom for support because I was SO fed up. We had a 20 minute talk on boundaries, why SP would do certain things, and how I felt like nobody listened to me when there were issues with his behavior. Sure, I can get over some stuff. But this is a 32 year old man who likes to fuck around, play pranks, etc. and I’m not comfortable with that. Theres a time for seriousness when it comes to being a FUCKING ADULT.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 0,
                      "content": "What pisses me off even more so is that my dad had the fucking nerve to say shit like “She can leave too” and other shit like that. First of all, this phone call wasnt for you so I’m not gonna talk to you. This was supposed to be me and mom only. Secondly, you’re going to choose a friend over your own child living in your house? What the fuck.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think me lashing out made me the asshole because while I am a child, respect is mandatory for anyone. But I feel like I mightve blown up too much\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 30,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay so, I’m 17 going to be 18 this month. And yea, I know that it’s my parents’ house, they pay rent, etc etc. yes I know they can just kick me out whenever. But please just shut up and listen before commenting that I’m in the wrong because I’m the child.\n\nSo for context, today, my “uncle”, lets call him “SP” was being overall annoying. I have an IEP (special education plan essentially) at school, and I usually have accommodations. However, said accommodations arent being accommodated and I relayed this to my mom who was talking to SP. SP barges into the conversation, stating his opinion and basically saying “suck it up and deal with it”. Sure he had good intentions, but for someone who isn’t active in my life like that to attack my opinion, is pretty fucking annoying.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 31,
      "comments": [],
      "relation": "No"
    },
    {
      "score": -2,
      "content": "No you are not the ass. People with special needs have every right to whatever the need is. Implying you need to suck it up is not a way to help. Maybe your using the shut up sounded crass but social skills are not always born with some. You're doing a good job at taking care of yourself!",
      "id": 32,
      "comments": [
        {
          "score": 1,
          "content": "I am doing my best, I really am. Taking care of myself is one thing, but then the family expects me to feed them everytime I have money. Maybe not EVERY time? But I do it often enough to make it seem like a routine. Or whenever I send my dad out to the store with limited amount if money, he’ll buy stuff for himself. And I’m usually sick when I have him go for me. Sorry for oversharing.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}