{
  "post content": "Me (26m) and my wife (24f) have been married for 4 years. During those 4 years she had the same job which requires her to be away Friday to Sunday, so she leaves early on Friday and returns about 4-5pm on Sunday. Occasionally it would be leaving on Saturday and returning Sunday. She also has to work some of the school/public holidays.\n\nI work full time and get just a bit above minimum wage and tips, so our bills are split 60 (her) to 40(me). While I find myself struggling with money and having to have to borrow from the joint bank account, my wife never have this problem. I know she is getting paid more then I do as she works for a high profile client, but I'm not sure by how much more. She also wouldn't tell me what exactly she is doing, all I know is that it is connected to her degree and it is 100% not a sex work or nothing in that industry. The reason why she won't tell me is because she signed the contract and it is highly confidential so she is not allowed to go into details.\n\nShe does chores around the house but doesn't cook (she admits herself she is a bad cook and hates it), instead she would order either those premade healthy meals you then heat up for herself or takeaway. When I'm home and she hasn't ordered she will order for me too. So most of the day while I'm working she is either in our house chilling (watching TV, playing video games, reading or exercising) or shopping or in the gym.\n\nOver the years I got annoyed with this and have asked her to find another job so she has something to do while I'm working instead of wasting her day. She told me she is not wasting her day but relaxing and her job pays her enough so she can afford the lifestyle she wants. I said it is not fair on me, as I come home tired while she has done nothing all day, to which she said I can find another job or a different job but I am an asshole for wanting her to find another job because I feel tired when coming back from my work, when she has already got a job she loves.\n\nAfter she won't talk to me. I have spoken to my family and while my parents agree with me that she needs to work, my sisters took my wife's side and called me a massive asshole.\n\nEdit: I'm not saying she needs to quit the job she has. I'm saying she needs to find another job to do during her freetime, could be a part time one, since she doesn't really do much during the day.",
  "id": 1,
  "comments": [
    {
      "score": 37284,
      "content": "YTA. \n\nYou have no right to make your wife leave her clearly very good job just because you feel it's unfair to you. \n\nShe gets paid well and gets to relax, but you'd rather she suffer working the same way you suffer than you'd have financial security.\n\nIf it bothers you this much, how about *you* start looking for another job that pays more and demands less?\n\nEdit: OP, your edit that she needs to find a second job doesn't make this any better. In fact, it makes it worse.",
      "id": 2,
      "comments": [
        {
          "score": 17289,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 11676,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 4447,
                  "content": "Op would have hated me\n\nI saved up a bunch of money and lived off of it because I could.. I only did my fair share of the housework because I paid my share of the bills. Why would I do more just because I have more free time? I paid for that time and OP is an entitled ass",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3162,
                      "content": "OP  probably DOES hate you tbh. He hates his **own** high-earning wife, why would he not hate strangers online!",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1932,
                      "content": "Most likely he is insecure about earning less then his wife due to societal norms. Also the fact that he comes home tired everyday while his spouse apparently does \"no\" work seems unfair to him.\n\nYTA. Get a better job or stop bitching.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1063,
                      "content": "Can confirm, my parents with a similar mindset to this hate my boyfriend who does this same thing. He works his ass off for like a year, socks away money, then quits when he's sick of it and lives off his savings for a while. They think he's lazy and a \"bad provider\". *I* think I have a spotless house, free childcare, dinner on the table every night, and someone at home all the time to handle home maintenance and repairs and anything else. Plus he does contribute financially from his savings on top of it (he buys all the food, I pay all the bills). He's happy, my son is happy, I'm nice and relaxed because I don't have to do a damn thing when I get home from work except parenting my kid if I don't feel like it. \n\nNever in my fuckin life will I understand this \"I'm miserable, so you have to be too!\" mindset. These people are fundamentally broken imo.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 144,
                      "content": "I'd do more of the housework so that my partner could also have more free time to spend with me. Fortunately my husband isn't an ass, he works less, pays his way and does more of the chores so that in an evening we can relax together instead of him watching TV alone while I have to catch up on chores.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "This reminds me of that post from the guy who was mad at his relative (brother, I think) for making a ton of money from his startup businesses and planning to retire at like 30 or something.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 60,
                      "content": "dude! same. I am in my 40s, retired military, single, lots of savings and truly do nothing all day but game, shop and dick around on reddit and kpop, lol. I have money to do jack shit and wont get a job just because I am bored during the day",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "OP would hate me too. I’m in a position where I’m able to work part-time….so I do. I work like 20 hours a week (although sometimes it ends up being more during busy seasons) and I get my afternoons free. Plus my job is flexible enough that if I want to take a long weekend, I can just flex my hours to work more on the other days of the week. It’s great and works wonderfully for my life.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "My brother was a carpenter. He would work his a** of for six months of the year, then take off the next six months. He bought some land and put a mobile home on it, and lived there comfortably. He was an avid hunter and fisherman, and he worked so he could enjoy his hobbies while he was young (his words). Sadly he died in a car accident at 28. He’d been doing the six months on/off for about five years. I like to think he really enjoyed his life, just he and his golden retriever Blaze doing what they had enjoyed. We spend too much of our lives conforming, so we need our downtime to be ourselves.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "My last roommate did that. She busted her butt to save money, then when her last job closed down, she used that money to go to school and pay bills. She hasn't worked since December 2019.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "OP would hate my dad\n\nhe works from home making 6 figures a year",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 784,
                  "content": "Seriously! When I first started reading I was expecting “she works Fri thru Sun, I work full time all week we never see each other/ when I’m off she works & when she’s off I work” so I’m thinking ok I understand that. \n\nBut his whole issue is she’s at home all week & he expects her to get a SECOND job just bc it’s not fair to him that she’s enjoying her days while he’s at work? Even though she makes more in the 2-3 days a week she does work than he does?\n\nYTA.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 422,
                      "content": "Yeah I’m wondering if he relaxes on the weekends while she’s working or if he has a second weekend job. That’s basically what he’s demanding of her.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 266,
                      "content": "He probably wants her to get a second job so she can pay 100% of the bills and he can quit and do nothing at all. \n\nYTA",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 159,
                      "content": "This was my expectation when I started reading too - like the conflicting schedules make it so they can never spend time together and he's frustrated, which would be understandable.\n\nNope it's just that he's bothered by her having free time. What an AH.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yes I was expecting the same and would have understood, but getting her to get a 2nd job just so she's also tired in the evening is so wrong. She'd be tired, more likely to make mistakes at her other job, and hating her life.\n\nIf OP is unhappy in the fact he comes home tired, then best would be for him to find another job. Also being grateful for having a wife that's hapoy and contributing to the household so much would be a better choice.\n\nWhy bite the hand who's \"feeding\" you?\n\nSo OP, YTA.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Exactly! I thought it was going to be something along those lines too. OP is practicing the \"never let them know your next move\" trend. But he's going to be on the \"divorced before 30\" bandwagon if he doesn't realize, if a bunch of people online think YTA the wife must really be feeling the effects of being married to someone like that. She's young and makes good money eventually she'll get tired if he doesn't stop the entitlement and a bunch of other behaviors he is likely also doing.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I was expecting \"works 80 hours a week at underpaid job that she loves, I all already work 2 jobs, AITA for asking her to get a better paying job because we are still struggling\". Not, she earns more than I do, can I make her get a second job anyway?",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "exactly this. I was actually feeling for him after few first sentences, thinking all this guy wants is to have his wife spending quality time with him at the weekend.\n\nBut then... I'm still rubbing my eyes. like WTAF?!?!",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yeah, I was expecting it to be the same as you were...",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Yeah - I wasn’t expecting him to whine about her not working enough. However, she does work enough because apparently she’s bringing in the bucks. I have a friend who only works 3 days a week and I’m happy for her!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Me too.  It wouldn't be an unreasonable request if it was about her workload being such that they never see each other and their marriage is falling apart. Even then, she would be within her rights to say no... But at least then there would be some logic behind the request.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 214,
                  "content": "YTA- you're upset she makes more money and gets to relax during the week? I agree with her that you should look for a different job instead of adding another to her plate just because you have a case of sour grapes.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Ha! Case of sour grapes. Stealing that one to use on my son! 😂",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "More like a whole pallet of sour grape cases...",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 89,
                  "content": "She makes more than me, but I want her to be tired to! .... this is the logic I'm confused 😕",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "Well because obviously her being tired too will make him less tired. /s",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Then he can live off her extra money probably 🙄",
                  "id": 32,
                  "comments": [
                    {
                      "score": 5,
                      "content": "But he doesn't mention what he does Friday to Monday.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Her second job should be finding a good divorce attorney.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Bc he's the \"man\" of the house ofc/s",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "And how much do you want to bet if she did decide she wanted to work a second job he would ask her to contribute even more to the finances since \"she can afford it\" and still be complaining the house isn't clean?",
                  "id": 36,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Obviously as he's the man and shouldn't have to lift a finger and come home and sit on the sofa and do fuck all while she does everything. I hope OP's wife runs so very fast.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Not to mention, her taking care of the chores in the house while he's working. Eff that noise. He's TAH.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 410,
              "content": "Facts.\n\nOP is TA. His wife needs to keep the job and lose the husband.\n\nShe is paying 60% of the household bills and only works 3 days a week. Why is dude complaining about her needing ANOTHER job. Oh yea he wants her to pay 100% of the bills.",
              "id": 39,
              "comments": [
                {
                  "score": 202,
                  "content": "Mostly I think he just wants her to be more miserable. If she can pay 100% and do the chores, that's a big bonus of course, but I think the misery part is top priority.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 50,
                      "content": "'Misery loves company,' I guess.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Well that may work for her, because if she pays all the bills and does the chores she is in a perfect position to leave him.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 153,
                  "content": "It sounds like she actually pays more than 60% of the bills since that is her agreed share and he admits to regularly borrowing from the joint account to cover bills.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 71,
                      "content": "And paying for all the takeout food.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Note that those three days probably total more than 40 hours if she's working as a medical worker.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 332,
              "content": "Exactly and he said they go on dates and go abroad. Who pays for this? Her I bet. OP you are an AH and a jealous one at that. You feel she needs to be doing something through the week while you sweat away at work. While she is working on the weekends what are you doing? I bet relaxing. Why don't you go get a weekend job so you aren't \"doing nothing\" while she is working so you can cover your fair share of the bills.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 77,
              "content": "Exactly! She does her fair share around the house, pays up 60% of the home bills. Doesn't bother him to cook and still orders take outs for him, but because she's not suffering as he is, he has a problem with her. No Op needs to get himself another job and actually work on his mindset.",
              "id": 47,
              "comments": [
                {
                  "score": 18,
                  "content": "Fair share or all the chores? He doesn't mention what he does around the house, so there's a solid chance he's \"too tired\" and she pays the majority of the bills AND does the majority of domestic work.",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "OP is projecting",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "🔥🫠🔥",
              "id": 50,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "He only pays 40%",
              "id": 51,
              "comments": [
                {
                  "score": 64,
                  "content": "Less because he admits to borrowing money from her to cover bills.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Oh that's right!",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Also earning less and still using her money when he’s short. What utter backwards world is this that you then say she should work more. \n\nSounds like she has a really nice job where she worked for her degree to get and now gets to enjoy the fruits of that labour. \n\nDon’t be upset because you’re working an intensive job and she has more free time. Also since she can’t divulge the details of her work who’s to say she isn’t working her arse off those days and then needs to relax after. \n\nShe isn’t on your case for anything and seems to treat you right, so if it annoys you that much find a job where you can relax a bit, even if it means retraining.\n\nYTA",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I had to read the post twice to confirm that the GF was earning more money while working fewer hours. OP is the one that needs to switch jobs if money is an issue, not the GF.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "No no, see the edit? He doesn’t want her to leave that job for one with different hours, he wants her to keep that and get a SECOND job.. proving is has nothing to do with the time she spends away but entirely about him wanting her to suffer like he does",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1145,
          "content": "YTA this is some toxic stuff… why does your wife need to get a second job if the bills are already covered? Oh you want her to be tired like you? You don’t think she’s contributing to the household even though she pays 60% of the bills, gets free event tickets and you get to travel with her, but she’s not contributing enough?! Seriously how messed up. I hope she leaves you because she deserves much better, and would have a much better lifestyle without you in it.\n\nEdit: I edited out toxic masculinity, though he obviously toxic issues surrounding women and what his wife makes, etc Expecting his wife to eggs. Second job so she’s just as exhausted as him when her work week is on the weekends makes no sense. He has control issues.",
          "id": 57,
          "comments": [
            {
              "score": 356,
              "content": "He doesn’t like that she relaxes and has fun while he’s working, so she should be working, too. \n\nFirst, she is away working early Friday to late afternoon Sunday, so minimum 48 straight hours she’s at work or at least on call - how many hours a week does she need to spend working?\n\nSecond, why shouldn’t she be allowed to have down time?\n\nThird, WTF is he doing all weekend while she’s at work? \n\nFourth, she does chores around the house (I’m guessing the majority based on this guy’s attitude) and the one thing she doesn’t like to do she still provides in her own way!\n\nWhat a piece of work OP is. She deserves better.",
              "id": 58,
              "comments": [
                {
                  "score": 161,
                  "content": "He also doesnt like that she doesnt do ALL the house related jobs when she’s home. Doesnt matter that she does the cleaning, its just “she doesnt COOK and makes ME do it—or orders meals so she doesnt have toooooooooooooo” \n\nLike fuckin hell. I’ll take not having to clean if i only have to make one meal a day when i get home from work. \n\nYTA op.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 10,
                      "content": "What it comes down to is \"My wife's success means I don't feel like I'm a King. Waaah, poor me.\"",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "This OP is a piece of work (no pun intended).\n\n> why shouldn’t she be allowed to have down time?\n\nExactly what I was thinking.  His wife shouldn't be allowed down time, a proper meal, or even sleep properly?  \n\nThe only person in the way of him doing better is himself.  He should be embarrassed that he came to the Internet to tell everyone that he is attributing his lack of success to his wife's overall success.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Agree! He has the weekends to relax while she's working. I don't see him offering to get a 2nd job or do housework. OP, YTA!",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 285,
              "content": "So with the event tickets and travel it's more like a 70-80 split on her side\n\nDude needs to find other work that will pay him better... she's pretty much giving him a bunch of perks and he's not being grateful",
              "id": 63,
              "comments": [
                {
                  "score": 58,
                  "content": "It probably boils down to his ego.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 6,
                      "content": "In my experience, everything boils down to his ego.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Pays better or treats him better.  Either way, he needs to look in the mirror and make his demands there.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 145,
              "content": "Not only covered but she actually pays more than his share.. so why is it that she has to find another job? I am not understanding his reasoning except that it triggers his fragile ego that his wife makes more than him with less effort.",
              "id": 67,
              "comments": [
                {
                  "score": 37,
                  "content": "Edit: nevermind this post. I made the mistake of giving OP benefit of the doubt, but reading more of his comments has thoroughly removed that doubt. He's unequivocally TA.\n\n>Not only covered but she actually pays more than his share.. so why is it that she has to find another job?\n\nPartners don't have to put in the same money, but they should try to put in the same effort. Right now, OP is struggling to make ends meet, because he has a low-paying job. Meanwhile his partner can seemingly easily make ends meet, *and* has time to relax. Their stress levels aren't balanced.\n\nThis does *not* mean that OPs partner should find a new job, or a second job, or whatever. OPs struggles are valid, but his solution is nonsense. What they need to do is have a talk about their partnership. Maybe partner could pay even larger portion, maybe she could entirely support him while he looks for a better job, maybe just some realignment of values. Or maybe this relationship doesn't work at all and they should break up? But they need to talk.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Maybe she could change his diapers too.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Absolutely, there should be an equal effort and balance of give and take. There are times when one partner might give more than the other but then it could fluctuate depending on the circumstances. It’s a team work where both partners ideally find a happy medium on a continuous basis.\n\nIn OP’s case, he just wants to take take take and then take some more.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "Honestly, I can't think of anything less masculine then coming on to a board to whine about your wife makes more money then you do, and you don't think it's fair that you are tired and she isn't during the week.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 62,
              "content": "This isn't toxic masculinity at all, OP is just an arse and can't be happy that his wife has something good going and it isn't the normal 9-5 weekday schedule.\n\nI work 12hrs, 7days/week for 5 weeks straight and then get 5 full weeks off. A lot of people think I \"do nothing\" when I'm off and at the beginning my mum would regularly say I should get a part time job when I'm back. I've had to consistently point out that the time off is all the weekends and evenings that I've missed out on, and that I work more than an average full time job.\n\nIn the same vein, OP's wife's \"weekend\" is actually the standard work week. Unless she is complaining that she's bored during the week or feels like she's missing structure then there isn't any reason to get an additional job apart from the fact that OP is bitter and that she must suffer alongside him. OP, YTA",
              "id": 72,
              "comments": [
                {
                  "score": 6,
                  "content": "That’s crazy. My husband used to work these shifts.  I would never imagine for a second telling him to get another job.  It would take him a full week just to recover.  I think what some people don’t understand is that working these kinds of shifts even though it might be the same amount of time as a normal 49 hour week, takes a bigger toll on you lR brain and body.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It's the same as when you hear about people being lazy and when they're \"sleeping in\" despite the fact they work night shift",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "What I was getting the impression of is that OP's wife knows how to budget her work time.  Then OP turns around and is complaining about her job instead of deciding that he needs to be the one to start looking for another job instead of complaining about how much his wife's job affords her.  Jealous much?",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Shit, I couldn’t manage that. At most I would last 2 weeks of 12 hour days and then still need 5 weeks off to recover.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "There was a similar story years ago in Dear Prudence, but it was the wife who was all chafed to see her early-retired husband not depleted from a job he didn't need (and that she actually didn't either). \"I think he should be avoidably miserable just like me and he disagrees, who's right??\" https://slate.com/human-interest/2013/11/dear-prudence-my-husband-retired-young-and-goofs-off-all-day.html",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Imagine NOT having to share those nice things with someone who wants you to be exhausted 🤩",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 351,
          "content": ">If it bothers you this much, how about you start looking for another job that pays more and demands less?\n\nWell that would mean OP would have to stop being a jealous AH and stop acting like a brat. That in itself is already tiring \n\nThe fact that OP this clueless amazes me.\n\nOP WTF? you are paying less that half the bills , you can take money out of an account with no issues and yet you complain this is a problem?  A shit ton of couples who be happy not fighting or worrying about money.\n\nShe isn't the problem here , it is you OP who doesn't feel like a man because wifey is living the dream and it's pissing you off.\n\nYou want it changed ? You go to college , get a degree and get a new job.\n\nETA : OP - YTA\n\nEDIT words\n\nEdit spelling",
          "id": 79,
          "comments": [
            {
              "score": 123,
              "content": "This! OP is jealous and looks at his job as more demanding. Meanwhile, he ignores the fact she works every weekend and many holidays, likely missing out of time with her friends and family!",
              "id": 80,
              "comments": [
                {
                  "score": 102,
                  "content": "That's what I thought the gripe would be when I started reading! A job cutting into family time is at least worth discussing. But \"my wife has too much time to relax\" is not a real problem.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I also thought that this story would go in another direction. 'My wife works weekends and holidays so I don't feel like I am valued in this relationship' would at least be a reasonable complaint. 'I want my wife to be more miserable because I am too' is just so wild, I feel like the post has to be a joke some how.\n\nI even would have understood 'I dont know what her job is and it makes me somewhat uncomfortable', but the post really seems to just be 'she's happier than me how dare she'.",
                      "id": 82,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Yeah, there's a reason why that job pays more for that schedule. Away every full weekend means you're going to have a very hard time maintaining friendships or family relationships, and you're almost never going to be able to go to a concert, play, bridal/baby shower, wedding, game night with friends, church, holiday BBQs/dinners... the things that make many people's life worth living.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 5,
                      "content": "We don't know what her job is either. She may be spent after her work shift while he may be relaxing on the weekend.\n\nI had a job from Fri-Sun once. It was a pretty tiring overnight job, but it was nice to have the week off.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "Apparently his wife is even offering to pay 100% of the bills if he wants to go to college, but he’ll have to do more household chores. What a dream of a woman\n\nEdit: YTA",
              "id": 85,
              "comments": [
                {
                  "score": 13,
                  "content": "Is that in a comment? OP should be on his knees in gratitude to be married to her! She’s willing to accommodate him so he can be happy, and he would rather his misery have company.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "makes me wonder about his upbringing too since his parents agree with him.\n\nGo his sisters though for calling him out for what he is. A major AH.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 209,
          "content": "&#x200B;\n\nInstead you are jealous of your wife. That is pretty pathetic. As previously stated, OP you need to be the one to fix things if you aren't happy. Your wife doesn't need to do anything.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "[deleted]",
          "id": 89,
          "comments": [
            {
              "score": 136,
              "content": "“My wife has a job that she loves and is fulfilling, it pays her more than enough to contribute her fair share to our household, and gives her plenty of down time to enjoy life. How can I put an end to this and make her as miserable as me?”",
              "id": 90,
              "comments": [
                {
                  "score": 4,
                  "content": "This should be the top comment.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 56,
              "content": "He acknowledges that she does the chores, but I guess they can’t be that time consuming because he doesn’t see her doing them. \n\nMy dude will be whining that the chores are never done if she does get a second job.",
              "id": 92,
              "comments": [
                {
                  "score": 5,
                  "content": "Also in addition to paying 60% of the bills, it sounds like she is paying for meals too. And doing house work which takes time.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "She should take her extra money and get a place to enjoy her downtime in peace.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 118,
          "content": "Ya his logic is all sorts of screwed up. \n\nHey you have a job you love, it pays you well, and you have lots of free time to work on yourself and relax and be happy while I come home miserable and tired each day after barely making ends meet **therefore** you should get a job that makes you also feel miserable and tired so we can both be miserable together. Wtf?? Her job and work life balance is not the problem. His is. YTA",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "The fact that she put 60% in everything, from payment to taking care of the house, she'll definitely be better off without OP. \n\nAlso \n\n>but you'd rather she suffer working the same way you suffer than you'd have financial security.\n\nthis kind of mentality is the reason why OP is unhappy. Rather than be happy for having a great wife, he hate her having a good time. \n\nTotally having grindset of \"work hard not smart\"",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 93,
          "content": "This! YTA big time!\n\nIt reads like you are very jealous of your wife having free time and a good job.\n\nTo give you a bit perspective, how would you feel if your wife told you to find another job because she doesn't like that you relax during the weekend when she works nonstop? It's the same thing!\n\nAlso what is this low key complaining that she doesn't cook and buys take out or premade meals? You too could learn how to cook if it bothers you. \n\nIt makes me question if you actually like your wife. When you love a partner you only want the best for that person. I'm happy when my partner is happy and has a good job, not petty about it. You need to rethink why this is bothering you so much. Especially as she already contributes more to the household than you do.",
          "id": 97,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 89,
          "content": "My favorite part was how he made sure to point out she’s not making this money through sex work. It says all that needs to be said about him.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "He doesn’t want her to leave her job. He wants her to get ANOTHER one to do during the same hours that he’s working, you know, during her “free time” as this AH calls it!!",
          "id": 99,
          "comments": [
            {
              "score": 6,
              "content": "Frankly, being married to someone like OP is already a full-time and utterly thankless second job.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9795,
      "content": "YTA, YTA. Your reason for wanting her to do is just because you feel jealous and emasculated",
      "id": 101,
      "comments": [
        {
          "score": 4654,
          "content": "‘I am suffering therefore she must suffer too so I don’t feel as bad ‘",
          "id": 102,
          "comments": [
            {
              "score": 994,
              "content": "This is exactly how it reads. OP is jealous she has days each week to live her life. He wants to force her into long hard minimum-wage labor just like he does. Girl has found peace and balance, OP should be striving to be like her.",
              "id": 103,
              "comments": [
                {
                  "score": 12,
                  "content": "I used to have a job that I had to work really hard at (owned my own business) and my husband had a much higher paying job that involved less time. He worked for the government and got all the federal holidays off plus often a 4 day weekend on those holiday weekends.\n\nWas I jealous? Hell, yes!! Was that his problem? NO. My feelings were mine to deal with. I had many advantages to being my own boss and I chose to try to focus on those instead.\n\nBecause that's what you do in a mature, healthy relationship.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 459,
              "content": "[deleted]",
              "id": 105,
              "comments": [
                {
                  "score": 116,
                  "content": "Yeah, I was all ready to be sympathetic. Not having matching schedules sucks and it means you never get to see your SO and it can be super lonely. \n\nBuuuut that’s not his issue. Like, I kind of get it. I’m a teacher and sometimes my husband gets a little jealous when I get to sleep in during breaks. But I also take over all the chores, and he sees how stressed out I am during the school year. So we’re good.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "That’s what I though this was going to be about. He still wouldn’t be in a position to DEMAND anything, but at least then he would be within his rights to ask. But just wanting her to work bc he’s annoyed she relaxes and enjoys her version of a weekend? Such a horrible, petty reason I can’t comprehend it. \n\nAnd the edit makes it so much worse! “She doesn’t HAVE to quit the high paying job that funds my lifestyle, I just think she should work weekends too so I don’t get annoyed she has fun when I can’t! What? Me? Work weekends to make things fair? No of course not! When would I relax?”",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Misery loves company",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 348,
          "content": "I've seen another post where the girlfriend didn't like that the guy didn't have a traditional 9-5 and for the same reason. It is pure jealousy. He definitely doesn't care about work life balance. He's living in the boomer idea that every person should be tired from working all day. It the same people that rant about art degrees or having hobbies.",
          "id": 109,
          "comments": [
            {
              "score": 164,
              "content": "I’d argue he’s living with the boomer mentality that because he doesn’t see her work she must not really work…",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Definitely boomer gender roles mentality, why else would he include a section about how she doesn’t cook and orders food for herself? \n\nHe’s mad she doesn’t cook (for him), mad she doesn’t clean extra messes (his messes), likely feels emasculated by her salary, and is trying to punish her by making her work outside the home so she gets burnt out and becomes more susceptible to his ridiculous wishes. \n\nAfter all, learning to just cook and clean a little more to make your husband happy would be easier than working two jobs, right? He’s angry she’s looking this argument up and down and saying “no, that doesn’t sound good”.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 329,
          "content": "I honestly thought this was going to be about OP missing his wife and wanting to spend more time with her in his free time....\nBut no it's about OP being insecure and petty",
          "id": 112,
          "comments": [
            {
              "score": 108,
              "content": "Right?! I thought he was going to say since he works all week and she works the weekends they don’t have any days that they’re both off and can spend time together. He’s a huge AH for this.",
              "id": 113,
              "comments": [
                {
                  "score": 38,
                  "content": "Or that they have kids and all of them can't do family fun time on weekends becaof her absence, which would've been more understandable, but no.... pure jealousy, nothing else...",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 104,
          "content": "There was a AITA a year or so ago about this guy who complained that his girlfriend worked less, earned more, yet *only* did half of the household chores. Reddit rightfully piled on his entitled, whiny patootie.\n\nEdit: [found it!](https://www.reddit.com/r/AmItheAsshole/comments/kwnb8d/aita_for_being_frustrated_that_my_girlfriend/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
          "id": 115,
          "comments": [
            {
              "score": 48,
              "content": "Proof we both spend too much time on here that we both remember that",
              "id": 116,
              "comments": [
                {
                  "score": 12,
                  "content": "Oh yes, necessary Spider-Man pointing gif is necessary lol",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I was just thinking about this post! Also the guy who threw away his breadwinner girlfriends’ skincare.",
              "id": 118,
              "comments": [
                {
                  "score": 6,
                  "content": "I’m sorry what now?!\n\nEdit: Found it! [Here it is](https://www.reddit.com/r/AmItheAsshole/comments/ktrljn/aita_for_hiding_my_girlfriends_skincare/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) for the curious!",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6727,
      "content": "YTA...Instead of worrying about what your wife is doing with her time, why don't you make a plan to better your own work situation ?",
      "id": 120,
      "comments": [
        {
          "score": 1131,
          "content": "Seriously- it sounds like only one person in this post needs a new job.\n\nIt's pretty weird how he has *no* details about it, though. Some people's marriages are very different than mine.",
          "id": 121,
          "comments": [
            {
              "score": 364,
              "content": "To me it sounds like he's lashing out in jealousy, which I think is rather creepy in a marriage.  I guess some couples don't map out a journey together.",
              "id": 122,
              "comments": [
                {
                  "score": 34,
                  "content": "Lack of communication all around. I imagine after 4 years, being married so young at 20, the wife maybe secretive because she’s tired of OP’s emotional abuse.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 231,
              "content": "Yeah I'm always baffled by this in posts like these. How do people not share (at the very least) the basic details of their work life with their partners? I'd need a confidant back home to share my bad work experiences with.",
              "id": 124,
              "comments": [
                {
                  "score": 189,
                  "content": "Yeah my wife and I both have things we can't legally discuss outside of work, but we absolutely know what each other does in general. So weird. My imagination would have gone completely insane by now!",
                  "id": 125,
                  "comments": [
                    {
                      "score": 318,
                      "content": "She probably has told him but either he didnt care to listen or didnt understand it so brushed it off with \"that makes no sense'",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Hell even a lot of jobs that require Top Secret/SCI at least let you tell someone what industry you're in and the basics",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 163,
                  "content": "If we're being generous, we could assume OP knows the basics since it's related to her education and is just avoiding all details in the post due to the confidential nature. That's probably giving him too much credit though...",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 68,
                  "content": "I had a friend growing up who always told people her dad was a recruiter for a certian branch of the military. In reality he worked in a highly confidential sector and they weren't allowed to know what he did besides he works for x branch of the military on x base. I couldn't be married to someone with such a highly confidential job but in the 20 years ive known her it never seemed to be an issue for her mom.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Exactly. My fil works with military contacts and has a super high security clearance. We don’t know what his job is now. And we didn’t know what his job was when he had a lower clearance but still classified job. He could only tell us about the very very very basics after he left the job and moved to the new one. We know the address of his work for emergency but that’s about it. Seriously the address is the only reason we even speculate the current job is military like the last one. That’s the ONLY info he is allowed to give us besides his general schedule \n\nIt’s 100% a requirement for some jobs that you don’t bring it home. Period.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I had an aunt that did “security” at NASA.",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "It sounds like she is a nanny or an au pair for someone who takes their personal family security very, very seriously. To the point where people who work for them aren’t allowed to tell anyone what they do or who they work for or when they will be doing it.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That's exactly what I thought. I had a friend who did that for a celebrity couple that boarded their kids during the week, and had her when the kids where out. \n\nSince they toured and acted and did photo shoots and interviews and whatever else, they had very unpredictable schedules and wanted thier kids to have stability so they hired my friend for all those times, even if one or both of the parents were there. \n\n\nSo they hired her for several years for weekends and holidays, plus any travel they did with their kids. All her expenses were payed with a per diem and room & board plus full access to basically a full compound with driving privileges. She took care of those kids for years and still gets first offer on most their trips if they need supervision on one-offs now. \n\n\nThey paid her extremely well to boot. Which she also couldn't discuss as they wanted their finances very discreet too. But it was so mysterious at the time!",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I'm also baffled he doesn't know her income. They've been married for 4 years, presumably filing taxes jointly, and he has no clue how much money she makes? A shared understanding of your financial situation and goals is so important in a marriage.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I’m always amazed by the ages of these people being married!! What’s the rush??? Live a little, grow a bit and see if you truly know and like this other person. \nSo many posts in this subreddit could be solved by people not rushing into the most important decision you will make in life.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Maybe she's a restaurant and hotel reviewer for Michelin.  They have to be super secretive,  and traveling every weekend would allign with that. (/S they are also usually experienced chefs, critics, or restauranteurs.)",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "She clearly believes that (or wants him to believe that) her nondisclosure agreement means that she can't say a peep.  Maybe it does or maybe she's just being careful because she wants to keep her job or because she's not comfortable sharing anything more than \"It is connected to her degree and it is 100% not a sex work.\"",
              "id": 137,
              "comments": [
                {
                  "score": 61,
                  "content": "Honestly, with this post maybe she’s scared he’ll use the info to straight up jeopardize her job. I would not be surprised",
                  "id": 138,
                  "comments": [
                    {
                      "score": 20,
                      "content": "That's the vibe I get. She's not telling him exactly what she does because he's so overcome by jealousy that he'd mess it up for her.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I have a sneaking feeling she doesn't want him to have a good sense of how much she earns because she expects he'll take as much of it as he can.",
              "id": 140,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I kinda got the impression that maybe she had to sign an NDA for her job. Not sure what that would cover, but the job sounds great and I can understand not wanting to risk it at all.",
              "id": 141,
              "comments": [
                {
                  "score": 9,
                  "content": "Definitely! Sounds like OP has it made. He's obviously just frustrated with his job and needs a change.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yeah, agree. It’s okay to be frustrated, hell it’s okay to be jealous as long as that jealousy isn’t taken out on others… like it’s a very human thing to feel. OP is kinda just displaying that whole “misery loves company” saying with how he is treating his wife over his own frustration around his job.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I mean if she signed an NDA she can’t. I had to sign them before when I worked on oil rigs. Not doing anything particularly wild either, it was well site geology work. But we were drilling in “sensitive” areas and had something happen once I also had to sign an NDA for. And those big oil lawyers scared the bejeesus out of me.",
              "id": 144,
              "comments": [
                {
                  "score": 4,
                  "content": "Yeah, but you could tell people \"I work on an oil rig,\" right? Obviously that could be any number of jobs, but it's something in the ballpark. OP acts like she vanishes off the planet a few days a week and he has no idea what's going on lol",
                  "id": 145,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I could say that but that’s about it. At one time I couldn’t even name the company (after an incident.) \n\nOP is being weirdly vague. I’m sure he has an idea of what she’s doing but is being weird about it in this post. \n\nBut you never know. I also had a friend that did, for lack of better word “black ops” stuff with the military for a few years. He just decided not to date because he literally couldn’t say anything. Not where he was going, for how long, why, or sometimes even when. He’d literally have to disappear for months at a time. It was bizarre for sure",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Growing up, my dad was only able to tell us very limited info on what he did. Only as it became declassified was he able to talk about it. OP's wife could have a NDA or clearance that prevents her from talking about her work, and if he's willing to post stuff on the internet she's wise to not share that information...",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "You and me both. I can’t imagine not having some idea of what my spouse does for 3 days a week!",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Nah, it's less of a marriage related thing, it's pretty obvious she signed an NDA",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 178,
          "content": "He says her job is related to her education, yet OP is working a grueling 9-5 at minimum wage. He brings in way less, yet he works way more hours, and he has the AUDACITY to think his wife needs a second job. He sounds either controlling or a mooch. He needs to better his situation and be grateful he has a successful wife!",
          "id": 150,
          "comments": [
            {
              "score": 48,
              "content": "I think he's just bitter and sending it the wrong way.",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Seriously OP is the one who needs a new job. And he needs a new perspective. \"I'm miserable and tired with my shit job so I need to tear my wife down and make her run herself ragged because I'm jealous she has time to watch TV. Nobody can relax unless I give myself time to as well.\"",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3586,
      "content": "YTA.  You both have a full-time job and then spend other time relaxing.  Her hours are just as valid as yours.\n\nI think the real problem is something different.  Are you concerned because you don't know what she does?  Do you want more time with her, and your different schedules prevent that?  Either of those would be valid, non-asshole concerns to discuss with her.",
      "id": 153,
      "comments": [
        {
          "score": 878,
          "content": "Ok, the real problem is, in fact, not about her job: it's entirely about you being an asshole.  If the two of you were being \"fair\", and making sure everyone \"contributed enough\" to the household, she would continue as she is and **you** would get a second job, so that you're earning as much as she is.\n\nI hope she recognizes this and divorces your entitled ass, since you simply want to make her as tired and miserable as you are.",
          "id": 154,
          "comments": [
            {
              "score": 181,
              "content": "People always say this Reddit goes immediately to “dump” or “divorce” as if we’re the irrational ones. I’m convinced it’s because the problems must be really bad before before someone thinks of posting on here. Like how most (or significant amount) of people who to couples therapy break up. \n\nAll to say I totally agree. I hope she can find someone better. Especially if OP doesn’t see how massively he screwed up.",
              "id": 155,
              "comments": [
                {
                  "score": 17,
                  "content": "Let’s just say that people with reasonable and healthy relationships aren’t coming to aita for advice",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 111,
          "content": "It's definitely concerning that he has zero idea how much she makes. I doubt he would react well to knowing but as a couple, they need to be able to communicate about finances and base line information like \"how much are we earning\" shouldn't be a secret.",
          "id": 157,
          "comments": [
            {
              "score": 66,
              "content": "He does know what she makes though. He mentions he makes about 66k while she makes around 120k a year. He just doesn't know the specifics of what exactly she does at her job.",
              "id": 158,
              "comments": [
                {
                  "score": 38,
                  "content": "I’m just really curious about what she does that makes $120k a year, only takes two days a week, and is so confidential she can’t even tell her husband what she does. \n\nI mean, he’s the asshole for how he’s handling it, but I’d definitely be suspicious, too.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 26,
                      "content": "One where he has to make it clear she isn't in the sex working industry.... like yeah I'm questioning what she does really.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "It could be live in weekend nanny or housekeeping for rich families",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Could be a lesser manager to some famous person or business person (main manager works mon-fri, and lesser on the weekends)",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Where does it say the amounts?",
                  "id": 163,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "he sounds pretty controlling though so I can understand why she doesn't want him to know. My thing is like- what job pays that well for just weekend work?? I need to know lol",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "For real tho. Why doesn't he get a second job on his free time (I assume he doesn't work weekends) if relaxing is such a huge deal. OP is a massive hypocrite.",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2268,
      "content": "YTA. She has a job she enjoys, she gets paid well, and you expect her to give that up because *you're* miserable? Bruh.\n\n*You* should get a new job, and a new attitude. Have you considered that? \n\nShe doesn't deserve to be treated like this. Sort your life out.",
      "id": 166,
      "comments": [
        {
          "score": 465,
          "content": "Our dude isn’t happy (even though his wife is in a good mood and contributes more than he does financially, and is willing to support him while he undergoes school/training,) so instead of making his own situation better or learning to be grateful, he really wants to make her *more* unhappy. Jfc.",
          "id": 167,
          "comments": [
            {
              "score": 394,
              "content": "He really bagged an entire goldmine of a wife and he's out here acting like this 😂😂\n\nI can't even",
              "id": 168,
              "comments": [
                {
                  "score": 146,
                  "content": "I don’t know why so many men get upset when their girlfriend/wife earns more money than them. If my wife made significantly more money than me then I’d feel like I hit the lottery and be proud of her. OP just thinks his wife should suffer because he doesn’t have a good job himself and is jealous. If the roles were reversed I highly doubt he’d be looking for a second job. YTA",
                  "id": 169,
                  "comments": [
                    {
                      "score": 38,
                      "content": "I’m guessing it has to do with control when a man feels emasculated by their wife/girlfriend making more than them. They can’t control a strong woman. Doesn’t stop them from trying. Misery loves company and other such nonsense.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I wonder if the roles were reversed and he was the one working from Friday to Sunday and his wife’s suggested for him to find another job, he would play the victim.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "And she should get herself a new husband",
          "id": 172,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "And it’s not that he is operating with the false assumption that more work is good, even though research shows humans don’t have an unlimited capacity for work and more downtime/fewer work hours improves performance. OP literally just wants her to be miserable too.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Sounds like the wife is living her life, having all that free time and being able to pay the bills like that... Also sounds like OP has a hard time living around the fact she has so much leisure time... Even doing the chores around the house while OP is gone for work, having to fill so much time alone by herself. \n\nShe got it all figured out man. Now it's your turn.\n\nYTA",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "He doesn’t want her to give it up. He wants her to get a second job to fill her free time since it’s not fair he comes home tired and she gets to chill while he’s working. \n\nHe wants her to be miserable because he’s miserable.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2064,
      "content": "YTA for wanting her to quit a job she likes, is in her field, and affords her a lifestyle she is comfortable with. Does she just trash the house when she is home and expect you to clean it up or does she pick up after herself and expect you to also be an adult? It sounds more like your ego is hurt. Why don't you try and find a job that aligns with her schedule so you can make more and spend time with her? Minimum wage doesn't sound like your dream career.",
      "id": 176,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1758,
      "content": "YTA, your wife can do as she pleases with her time off. If you want her to be more involved in the household chores, then why don't you get a better job and become the sole bread winner?! Perhaps then she will be able to focus on what you want. However,  she has done her part, she works, comes home tired and chills on her days off. Heck she even orders your meals. Stop being a jerk and instead ask yourself, what can I do to make our situation better? Respect her position and be thankful you have a great wife who works, contributes to the household,  thinks of you when she orders her meals, ect. Pick and choose your battles, let this one go.",
      "id": 177,
      "comments": [
        {
          "score": 366,
          "content": "He says she does most of the chores now.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1182,
      "content": "ETA YTA This is wild, she's contributing 60% to the household bills, does all the chores and she's not contributing enough?! It's clear you are unhappy, but the root cause isn't your spouse's work/life balance.",
      "id": 179,
      "comments": [
        {
          "score": 143,
          "content": "I'd say the problem is the spouse's work/ life balance. Too much life and not enough work apparently",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Maybe he wants her to get another job so she’s making 2x the money so he can quit his job that makes him miserable.",
          "id": 181,
          "comments": [
            {
              "score": 75,
              "content": "In another comment, he said she offered to cover 100% of the bills so he could go back to school and switch careers.  He doesn’t want to do it, because she said he would have to pay for his own schooling and do the household chores.",
              "id": 182,
              "comments": [
                {
                  "score": 7,
                  "content": "Lmaoooooo what an absolute asshole this guy is. The audacity.",
                  "id": 183,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 974,
      "content": "Info:\n\n\nDo you do chores?\n\n\nEdit: YTA - you sound jealous and can't seriously expect her to work a second job just so she can't enjoy her time as much.",
      "id": 184,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 795,
      "content": "[deleted]",
      "id": 185,
      "comments": [
        {
          "score": 319,
          "content": "\"My wife works less and makes more. She taunts me by enjoying her days off. How can I make her more miserable?\"\n\nMaybe YOU can find another job that isn't work from home so you aren't growing spiteful of a happy wife",
          "id": 186,
          "comments": [
            {
              "score": 14,
              "content": "It’s worse than that, “My wife works less and makes more. She enjoys her days off, which I think is taunting me. How can I make her more miserable because I’m miserable?”",
              "id": 187,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "I'll be OP is \"wasting\" his weekends but doesn't think he needs a weekend job while wife is at work.\n\nBut she definitely needs a job to do while he's miserably at work.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}