{
  "post content": "\n\nBasically the title. My daughter (16) has a thing for baking, she bakes cakes and some (I said some not all!) sweets and makes money out of it by selling her work to relatives, friends and supposedly us!\n\n\nMy husband's (Her stepdad) 45th birthday took place days ago. He asked my daughter to bake him the birthday cake and she agreed. I told him about paying her to which he responded with \"pfff pay her? Get outta here, I'm her dad!\". I insisted seeing she's \"a yes\" person and a people's pleaser so won't outright demand the money from him. He said he'd pay but days went by and he didn't pay her a cent.\n\n\n I decided to go ahead and sell the wrist watch I bought him as his birthday cake and pay her for her. He foubd out and went off on me. I told him he had rnough time and shouldve paid her seven before he recieved the cake. He said that I was teaching her to treat familial relationship as \"transactional\" and raiding her to be \"materialistic\". I explained the time, effort and even money she put towards making the cake but he lashed out verbally calling me an asshlle for making this move and for enabling my daughter to expect so much from family that she's supposed to help with nothing in return.\n\n\nHe's furious and told almost the whole family about how I took back his birthday gift and returned it. I got enough shame from family members to begin to think that I might be an asshole for how I dealt with this.\n\n\nAITA? Ya'll, my daughter did want and expect to be paid. If she intended for it to be for free then I would have kept my mouth shut. And also the wristwatch idn't expensive. I kept the rest of the money after giving my daughter her share.",
  "id": 1,
  "comments": [
    {
      "score": 30132,
      "content": "Info: did he think the cake was her gift to him? Who pays for the supplies? Do you pay for your own birthday cake if she makes it?\n\nI find it strange that you’d make him pay for his own birthday cake rather than pay for it yourself. Who asks someone to pay for their own birthday cake?\n\nYTA.\n\nEdit: Daughter doesn’t pay for supplies. OP does.",
      "id": 2,
      "comments": [
        {
          "score": 10048,
          "content": "I was thinking the same thing. Couldn't the cake be the daughter's gift to him? And even if not, then why didn't the OP just pay for the cake since it was the husband's birthday",
          "id": 3,
          "comments": [
            {
              "score": 4877,
              "content": "I agree its sad that neither kid or wife will make/buy husband a bday cake. Very unloving and ungenerous of them. Even worse to take back a gift and pawn it.\n\nBut its pretty low to promise to pay for the cake and then welch after its eaten. Husband should have expressed his disappointment that his family won't make this gesture of caring and said forget about making the cake. \n\nDo these people even like eachother? Esh.",
              "id": 4,
              "comments": [
                {
                  "score": 1219,
                  "content": "It’s unfair to include the daughter to say she wouldn’t make the cake unless she were paid. OP is the one who mentioned that stepdad had to pay.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 454,
                      "content": "Op says that daughter wanted and expected to be paid though. And that if she hadn’t she wouldn’t have said anything.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Completely agree esp since it seems like the kid was kinda ok with not being paid - how do we know OP isn’t just assuming the kid would want money? OP acts like the kid was making it, paid or not - maybe she didn’t expect to be paid at all,’or at least not by Stepdad.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "He didn't promise the daughter. He told OP to make her quit nagging. I never asked my parents or sibling to pay for my labour when I made the cakes for their birthdays when I was a child. Especially when my mother bought the ingredients. It was enough that it made them happy and they enjoyed it. I was the official cake and pie maker for holidays and birthdays.  I just enjoyed doing it, I never expected anything in return. Forgot the judgement, YTA.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yes! Me too! I never would ask the birthday person for money after making the cake. Absurd! I was always doing it out of love and appreciation for the person! OP’s post is so out of touch. Really sad!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "WOW! That was a hard read. Has inflation become so bad that a homemade cake costs more than $10? What am I missing here? Its **normal** for people to make cakes for loved ones and NOT CHARGE them. Hawking a \"wrist watch\" to pay for it? I could literally go to the Dollar Tree and purchase a cake mix, frosting, candles and balloons for $5.00 and I live in Manhattan!!!\n\nEveryone in this situation is the AH. Earn some cash on a beer money site if you have to- can make $5 in a few hours vs. whole family having a meltdown and having to hit up the pawn shop for something that's just going to bolt from your booty hole in a few hours!",
                  "id": 10,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The last cake I made from scratch cost me more than $60. So, depends?",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Mom should've hired daughter to make the cake for her dad. NO one should buy their own  birthday cake. \n\nAlso, since mom buys the supplies, it would've been nice for the daughter to make the cake as her gift to her stepdad. If he gets her a gift on her birthday, that is. \n\nOP, YTA",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "I think there are a lot of holes in this story. OP said that she sold the wristwatch to pay for the cake but pocketed the change. They also said it was a cheap watch, so couldn't have gotten much for the resale. \n\nWhy couldn't the watch be returned, why did OP resell it? How much did OP give the daughter for the cake? Why did OP pocket the remainder of the present for the husband instead of getting him something else? Did the topic of payment come before or after the daughter agreed to pay for the cake? The way OP worded it, it almost sounded like the husband was hearing about this after the fact, not before.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yea. Sound like the mom/wife drummed up a lot of unnecessary drama.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Right? Do any of them even like each other? I can’t believe the daughter wouldn’t WANT to make the cake for her father as a present or even just a nice gesture for his birthday! Especially since it’s something she loves to do!! Even her buying the supplies is part of the present.. if she was unable to afford, then the WIFE pay for the supplies. It’s really crazy that the mother/wife decides to PAWN the gift... I mean, what in the world??! She made sure to tell people what she did, so it would get back to the husband/father. So vindictive and manipulative. \nSeems to me the daughter and mother are already very materialistic and don’t give a shit about the fathers feelings. \nVery very sad. I bet it was one of the worst birthdays the father/husband has ever had.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "Exactly, I mean if her daughter didn't bake the cake then she would have either made it or bought a birthday cake for her husband. She should have paid their daughter the birthday cake. I guess she can pay for her own birthday cake when it's her birthday.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1846,
          "content": "If I wanted to pay for my own cake, I’d go buy what I really wanted- like a steak 🥩",
          "id": 17,
          "comments": [
            {
              "score": 551,
              "content": "I got my daughter a sushi cake one year. Literally 2 tiers of rice, nigiri, sashimi, rolls, and edible flowers. She was SOOOOOOO happy. As were we all as we ate it.",
              "id": 18,
              "comments": [
                {
                  "score": 98,
                  "content": "Steak cake 3 tiers of ribeyes strip loins and tenderloins 🤤",
                  "id": 19,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Mashed potato icing?",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": ">Steak cake 3 tiers of ribeyes strip loins and tenderloins 🤤\n\nMarry me",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "For those who asked, here are pictures. You might have been expecting something bigger or grander from my description but we were so overwhelmed with how amazing it was.\n\n[Cake picture 1](https://www.flickr.com/photos/196847751@N03/52470892957/in/dateposted-public)\n\n[Cake picture 2](https://www.flickr.com/photos/196847751@N03/52470892942/in/dateposted-public)",
                  "id": 22,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Just a heads up, those links show your name at the bottom. Be safe!",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "But did you make her pay for it",
                  "id": 24,
                  "comments": [
                    {
                      "score": 13,
                      "content": "LMAO!! \n\nIt was freaking expensive. No way could she have afforded it.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "You just changed my entire life. Thank you 🤩",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Omfg that sounds amazing !",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I really really need to see a picture of this sushi cake because I ABSOLUTELY LOVE sushi and I want one for my birthday now! Can you please upload a picture on imgur and share the link here? Or even a link to a Google/Pinterest image?",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Steak is definitely the best birthday cake money can buy! 👌🏼",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Steak over cake any day 🤤",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I think the birthday guy’s family would snatch his steak and feed it to the dog. That’s the level of love I read.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Me and my daughter have a birthday a day apart.  One year we decided to surprise each other with a cake...we got the exact same flavors, and it was a special order flavor...not a common mix.  Idk how we missed each other at the bakery in such a small town 😂",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1115,
          "content": "I’m a big believer in no one should buy their own birthday cake. \n\nI’m kind of on the ESH fence. OP for returning his gift (was that really necessary?) and SD for refusing to pay her because FAAAAAAAMILY.",
          "id": 33,
          "comments": [
            {
              "score": 807,
              "content": "I respectfully disagree with ESH. I’m sorry, but the only way someone should be paying for something involving their own birthday is if they’re celebrating alone. I don’t think the husband refused payment because “FAAAAAMILY”, he did it because it was his birthday and his daughter flat out said she wanted him to pay her to make something to celebrate it, which makes zero sense.\n\nOP, and a part of me wants to say the daughter is one too, but I won’t since that’s how she was raised, is the sole a-hole here for not only going along with the daughter’s idea of having the birthday person pay for something involving their own birthday, but also for going behind his back and returning the gift for him when he didn’t play that idiotic game.\n\nOP, YTA. I’d recommend getting the watch back, but if you do, the memory of it will forever be tainted with what you’ve done, so I’d highly recommend finding or doing something else to make it up to him.",
              "id": 34,
              "comments": [
                {
                  "score": 342,
                  "content": "Big agree with this.  It's insanity that anyone thinks SD is to blame at all.  I feel like if he was told before he ate the cake maybe he'd just not eat it.\n\nBut to give someone a cake on their birthday, let them eat it and then demand payment.  That's a bad joke.\n\n\nOP and Step daughter are AHs here in my eyes.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "But they *are* family and in most families it would be crazy to ask someone to stump up for their own birthday cake in most families. He should have just said ‘that’s stepdaughter’s gift to me’.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Nowhere did it say the DAUGHTER wanted him to pay it was just the mom assuming she would've wanted that without asking her.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 491,
          "content": "YTA for the typos too, this took way more effort to read than I felt like exerting. 😂",
          "id": 38,
          "comments": [
            {
              "score": 58,
              "content": "Thank you! A couple misspellings here and there can be overlooked, but this whole thing was a mess. I'm not saying this to be a dick, but  it's not too much to ask for OP to proofread before they post.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "For real. Also the insane title followed by the first line \"basically the title\" like it's a normal situation that normal people have all the time. This family sounds awful. OP is major AH.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It was exhausting to read",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "That's horrendous. OP is definitely YTA. She is teaching their daughter to be as well. \n\nI think strange is an understatement. Let's call it the motto of the past few years \"unprecedented\" \n\nWe have officially entered the twilight zone where we bake/buy our own cakes and buy our own gifts for our birthdays.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17397,
      "content": "YTA.\n\nI have never in my life heard of a person expecting to get paid for making a close relative's birthday cake.  I mean, if your daughter owned a bakery, and your husband went in and put in an order for a cake, yes.\n\nAnd SERIOUSLY, as his wife it would be normal that YOU provide the birthday cake, whether you make it yourself or buy one at the local bakery.  So if YOU wanted your daughter to make your husband a cake, AND you wanted her to be paid for her work, then YOU should have paid her to begin with.",
      "id": 43,
      "comments": [
        {
          "score": 2929,
          "content": "I agree. This is weird. It could have been her gift to him considering he's her step dad and living under his roof.",
          "id": 44,
          "comments": [
            {
              "score": 1680,
              "content": "Exactly. OP says daughter wanted and expected to be paid, but I think it is OP who gave her that expectation since she did not discuss price with stepdad.\n\nEven if she's been paid by other friends and relatives to make cakes, I'm going to say it should not be the birthday person paying for their own cake, ever.  Aunt can buy for cousin, etc.",
              "id": 45,
              "comments": [
                {
                  "score": 442,
                  "content": "Agreed. \nShe didn't even tell him she wanted paid so how was he supposed to know. This wife/mom is ridiculous.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 340,
                      "content": "OP is extremely overbearing and likely why her daughter is a “yes person”.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 204,
                  "content": "And honestly, it’s a good lesson for the girl that if she wants to make money off of it one day, she needs to learn how to negotiate the payment before accepting a job. \n\nI don’t think a kid should be paid for baking a cake for their dad that they agreed to make.\n\nIf anything, op made her conflict-averse daughter less likely to continue baking in future if she thinks it will just lead to conflict",
                  "id": 48,
                  "comments": [
                    {
                      "score": 30,
                      "content": "This! He may have been asking her as a favor. In which case, she could say no. I was a writing major, but if my dad asked for help writing something for a family event, I’d do the editing, formatting, etc without a fuss. Or at the very least tell him my rates if I had to charge him something. Feels like this is either a disjointed marriage, we’re missing some info, or both. Like, if the daughter wanted to get paid, she should say so directly ahead of time.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "YTA  Mum should've paid the daughter if money was such a big deal anyways.\n\nI would expect the cake as a gift from the step-daughter.  \n\nHaving to pay for your own fucking cake...all I can do is shake my head.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "She didn't even tell the stepdad she wanted to be paid, she told her mother!",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "And even if daughter was silently expecting it, mom isn't doing any favors by fighting her battle for her. Maybe she's a people pleaser because her mother is smothering and combative. Geez, with family like this, who needs enemies??",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Also, if the daughter is a people pleaser, this would’ve been a good opportunity for the daughter to ask for payment in a (supposedly) safe/supportive environment. OP isn’t helping her daughter grow if she just fixes the problem FOR her daughter. (But I also assumed the cake was a gift and think it’s weird to expect the husband to pay for it).",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": ">I have never in my life heard of a person expecting to get paid for making a close relative's birthday cake.  I mean, if your daughter owned a bakery, and your husband went in and put in an order for a cake, yes.\n\nExactly what I thought!!!",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Oh, but it's a GIFT that OP is giving her husband, so it doesn't cost anything!/s   \n\n\nMy own mother pulled this on me - promised a gift of a handmade thing I like to dabble in to one of her friends, and when I told her that it would cost her $$ she balked at it. \"Why should I have to pay? It's a gift!\" Yeah, one for YOUR friends I don't know. I don't make these things for fun, and if I do, it's so I can keep it myself. Honestly, one of the reasons why I went NC with my mother. Her total disregard for my time and effort.\n\nOP: YTA.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12214,
      "content": "This is one of the most bizarre posts I've ever seen. I'm not gonna call anyone an asshole because I think a lot of it comes down to gory details about timeframes and who directly asked what of whom, but this is an extremely strange thing to litigate this hard. Who the hell expects a family member to pay them for a birthday cake on their own birthday? Who wages a proxy war about it on behalf of someone who apparently doesn't want payment enough to advocate for it themselves? And then returns a present as revenge instead of just reminding him? But also who puts their wife on blast to the entire family over a birthday present?\n\nI diagnose you all with weird and petty disease, your sentence is to drink a glass of water and count to 10.",
      "id": 56,
      "comments": [
        {
          "score": 1661,
          "content": "Petty disease; drink water and count to 10 I am totally going to use that. Genius.",
          "id": 57,
          "comments": [
            {
              "score": 58,
              "content": "Honestly, it’s good advice. I probably could have avoided a lot of rash, stupid decisions if I had just drank a glass of water and counted to ten before reacting.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1410,
          "content": "I'm also really concerned that she had to sell a watch to be able to pay a 16yr old for a cake? Does she not have her own money?",
          "id": 59,
          "comments": [
            {
              "score": 742,
              "content": "RIGHT? Why is nobody talking about it? How much did that cake \"cost\"? \n\nEither it was a cheap watch or the daughter (or whoever comes up with the \"price\") is delusional.",
              "id": 60,
              "comments": [
                {
                  "score": 1298,
                  "content": "[deleted]",
                  "id": 61,
                  "comments": [
                    {
                      "score": 553,
                      "content": "Especially considering she notes she kept the rest of the money. So much for Dad’s birthday.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 221,
                      "content": "It was 100% to \"teach him a lesson\" He didn't pay, he doesn't get a gift. Which I think is kind of cruel.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 78,
                      "content": "This right here; OP appears to have returned the watch as a punishment. If OP already paid for the ingredients, it was the husband’s birthday cake, and done by the daughter then the cake should have been exactly what the husband wanted and given as a gift. \n\nMy mom fixed a New York style cheesecake requiring several pounds of cream cheese, 18 eggs, a couple boxes of graham crackers, real vanilla, and numerous sticks of butter just as the base. She’d spend 5-6 hours preparing then cooking (partially in a water bath, partially with the oven door open). People would ask her for the cake as their gift knowing she’d spent $40 (in the 70’s-00’s) for ingredients. Other people would bring her all the ingredients and $20 cash to make the cake for them. People knew the arrangement. No one in our family ever expected me as her child to pay for the cheesecake if that’s what I wanted for my Birthday. I’d still get a nice gift in addition to the cake. Granted, this was a mother-daughter relationship. \n\nOP if you wanted your kid paid then pay her. Stop punishing your husband. Stop putting a wedge in the relationship between him and your daughter. Your husband never should have been put in the position to agree to pay for his own Birthday cake. By the way, are her cake supplies solely coming from you or is the money from your joint banking account with your husband, which means he may figure he already paid for the ingredients. \n\nY’all need a nap, juice box, and family counseling.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yeah it's clear that's what happened.\n\nOP -- who the hell is expected to pay for their own birthday cake? Have you ever been to a birthday party in your life? Do you even like your husband? \n\nIf you want your daughter to get paid, pay for it yourself. YTA",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "It was definitely vindictive lol. it seems she didn't like his flippant response. But she could have just paid her daughter for the cake herself. Since it was for a birthday.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "This was definitely to punish him. “I’m taking your birthday gift away because you didn’t pay for your own birthday cake “. Wtf is wrong with ppl and why do they think it’s ok to treat their partners like shit.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 324,
                  "content": "OP just edited to say she gave the daughter “her share” and then kept the rest of the money…….. jfc",
                  "id": 68,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Yowza.  Money grubber.  This poor, poor man.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "So no gift for the husband? Just a cake that he indirectly paid for by not getting to keep the watch that was gifted to him. What a shitty birthday",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 263,
                  "content": "She kept the change, the filthy animal",
                  "id": 71,
                  "comments": [
                    {
                      "score": 19,
                      "content": "\"Keep the change, ya filthy animal\" is what I say to my wife after I rip a loud one.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "That one made me actually lol.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Unexpected Christmas 🎄",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Cake cost a trillion dollars. The Dad will be in debt the rest of his life paying the birthday cake off. \n\nHe's thinking to himself. \"I'm getting too old for this shit.\"",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Like an old sitcom where every problem the characters face would’ve been solved in 30 seconds via text, FaceTime, etc.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Also what type of cake are we talking about here? Like 5$ Walmart cake? Box cake with store bought icing? Cake made from scratch? The icing from scratch? Or are we talking about hyper realistic cake? How many layers? \n\nThat can all impact the price. If the kid is making box cake and using bought icing there was seriously no need to sell the watch or even really pay the kid (buying the ingredients should suffice) but if we're talking about a multi hour cake completely from scratch I can understand the need to pay the kid, but again selling the wrist watch should still be unnecessary\n\nIf the kid was a cake god who made multi level cakes with attention to detail the whole expensive kit I can DEFINITELY understand the mom feeling like she should be paid\n\nThat doesn't mean should be paid, but I can understand why she would feel like it deserved payment.\n\nOP you need to give way more details",
                  "id": 77,
                  "comments": [
                    {
                      "score": 17,
                      "content": "This is what I was thinking.  Some people who make cakes for money spend DAYS designing and decorating the cake.  If this was that sort, then I could see the argument for paying her.  If this was an \"I did it after school in an afternoon\" thing, then this entire story is just ridiculous.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Even so. Mom should have paid. \n\nNot the birthday boy. \n\nI’d daughter did something that requires payment, mom is the one that gets to pay. \n\nNot docking stepdad for a cake that he didn’t commission. \n\nIf it would have been a $12 Costco cake, he wouldn’t have had to pay. \n\nSo why does he have to pay for an elaborate cake that he didn’t order?",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm guessing the watch was in a $40-$60 range, as OP says she kept half.\n\nI can't imagine buying and returning a three figure watch considering how much a hill OP made out of making her husband pay her daughter.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Not enough to warrant the selling of a watch.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Op said “ I kept the rest of the money after giving my daughter her share.” lol",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "If OP doesn't have her own money then step dad is paying for the kids baking supplies.",
              "id": 83,
              "comments": [
                {
                  "score": 7,
                  "content": "She had her own money to buy the watch, apparently.",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "No way she had to return the watch to pay for the cake. That was done to punish her husband and make a point. Unpleasant.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I think she has the money to pay. That was just a piece of disrespect and spite. Disrespect and spite seems to wrong strong with mom and dad!",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "She sold the watch because she was pissed off.",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "How did she buy the watch in the first place?",
              "id": 88,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "That may be the real problem right there. If no one has the money for a cake …. No cake.  Either way you don’t make the birthday boy/girl pay for their cake.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 688,
          "content": "I find all these posts from married couples with totally separate finances and highly transactional dynamics when it comes to money quite strange and uncomfortable. Makes me glad to have only joint bank accounts and healthy communication strategies.",
          "id": 90,
          "comments": [
            {
              "score": 318,
              "content": "[deleted]",
              "id": 91,
              "comments": [
                {
                  "score": 87,
                  "content": "I swear, the posts here on Reddit definitely make me wonder how half of these people end up in relationships with the other person in the first place.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 8,
                      "content": "The people who believe it's better to be in a relationship with literally anyone than it is to be single.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "If I charged my husband for eaten snacks would totally depend on what time I went looking for them. Mid afternoon? No charge. After dinner? I'm considering billing but I won't. 2am can't sleep watching YouTube and seeing food. It might have to be paid back in blood. Lol",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "I’m convinced it’s because most of the audience of this sub has never had a functioning adult relationship. You don’t divorce your partner over chocolate unless they were licking the chocolate off of another person.",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "For real! I feel like my husband and I end up wasting the last of treats pretty frequently because we’re always leaving the last piece for each other.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Not weird at all. I also like your spouse",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "I have separate bank accounts from my partner and we are not transactional at all. These people are petty crazy people. Like, I make twice as much as my partner. I pay ALL the bills and he gladly pays the fun money stuff. If you love your partner it's not about a transaction, it's literally about being a partner\n\nEdit: a word",
              "id": 98,
              "comments": [
                {
                  "score": 15,
                  "content": "We’re the same. We have a joint account and personal accounts. He earns more so pays more but there’s no owing. It’s our money together. Certainly don’t worry about whether or not we can eat something in the fridge or whatever. We can buy another gas station chocolate bar, eeeshhh.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 7,
                      "content": "When it comes to eating something, we're more likely to go the other way and save something the other particularly likes for them. I'm always getting sent chocolates from work for Christmas, Easter, birthdays and other occasions that I give straight to him, he always takes the walnut off the top of his Walnut Whips and gives it to me.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My husband and I have separate accounts. However, we don't nickle and dime each other. We just split bills by whatever works for us at the time. So if he has more outside financial burdens I pick up the slack and vice versa. We we do check in every once im a while to make sure the other person feels OK with the financial setup. But then again, we don't have kids or anything so maybe that makes it easier?",
              "id": 101,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 152,
          "content": "lmao every once in a while a weird post like OP will pop up on AITA and it makes me feel like I'm going insane. like how are there people who behave like this?",
          "id": 102,
          "comments": [
            {
              "score": 39,
              "content": "It's like the level of petty you'd see on Seinfeld.",
              "id": 103,
              "comments": [
                {
                  "score": 21,
                  "content": "Or It’s Always Sunny in Philadelphia.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Adults that need to be grounded.  I seriously want to go over to some of these peoples houses and remove all tv, internet take their phones away from them and all forms of entertainment so that they have to either sit in a room by themselves and do nothing or learn to get along.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "Def the most bizarre post of today for me. I’ll go ahead and call it YTA. I’m annoyed that people like this are floating around out there.",
          "id": 106,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "This is the most reasonable reply I've seen here.  There's just so much wrong and so many details that would need to be filled in to make this make sense that there's no way for me to fully weigh in on who's an asshole.  My inclination is everyone is, except maybe the daughter.",
          "id": 107,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Yeah, couldn’t she have just paid the daughter and none of this post needed to happen.  It’s chaos.",
          "id": 108,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Thank you for succinctly putting together everything wrong with this whole thing lmao. SO bizarre!",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4159,
      "content": "INFO: Have you talked to your daughter, did she want to be paid? \n\nI ask because if my step asked me to make a cake for their birthday, I would consider it my gift, and wouldn’t expect to be paid.",
      "id": 110,
      "comments": [
        {
          "score": 1603,
          "content": "She seriously took his already gifted item, returned it, and kept the leftover money for herself? What in the AH is this?",
          "id": 111,
          "comments": [
            {
              "score": 423,
              "content": "Had me thinking either it was a cheap af watch or an expensive af cake.",
              "id": 112,
              "comments": [
                {
                  "score": 98,
                  "content": "OP stated in her post that it “was an inexpensive watch”. So yeah, it was a cheap watch. She paid her daughter some money and kept the rest for herself after she returned it-so I don’t think the cake would have cost very much and her daughter doesn’t charge very much.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Supplies the daughter used were probably not paid for by the daughter. \n\nAnd I understand being paid by relatives but in house family WTH that's not a teaching moment. Sounds like the mom said something then when she realized she was wrong she doubled down.",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "So... does this mean OP short-changed her daughter on the cost of the cake or was the watch that cheap? Either way, some gift.",
                      "id": 115,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": ">either it was a cheap af watch or an expensive af cake.\n\nNone. It was a cheap asshole wife.",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Flour, eggs, baking powder, ingredients for icing, cocoa, vanilla extract etc, food coloring.  I don't know - I've never banged a cake, but it can't be that hard, or that expensive!",
                  "id": 117,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Paging Dr. Freud 😅",
                      "id": 118,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "When she mentioned it took money to buy ingredients and daughter should be paid for that I was like yeah I bake too and it probably cost a maximum of about $20 to buy some flour, sugar and butter.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 206,
              "content": "Top-notch assholery at its finest!  Congrats OP?  Another new low for the AITA history books.\n\nYeesh, I wouldn't want to be married to someone who expects me to pay for my own birthday cake.",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "Yep. And since she gifted it it was No longer hers, so she actually stole it from her husband.",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Theres been a lot of bat shit crazy asshole posts lately..I’m like wtf are you people REAL?",
              "id": 122,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "This part. This was 100% about being petty and punishing husband instead of making his birthday special like she should have. If it were that important, she should've used the leftover money to get him a different gift, not just pocketed it.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Honestly there are several ways she’s the asshole. Returning the watch was a punishment which is a dick move. But also putting aside the weird transactional dynamic, if the child wanted to be paid then the child should have voiced it. When step dad asked for the cake would have been the time to come to terms. Could have been a teaching moment in advocating for yourself. Instead OP interjected herself",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3759,
      "content": "YTA since it was HIS birthday it kind of seems like YOU should have paid for the cake. Nobody else buys their own birthday cake, why should he?? Or the daughter could have done it for him as her birthday present. The way you treated this situation definitely ruined his birthday.",
      "id": 125,
      "comments": [
        {
          "score": 403,
          "content": "[removed]",
          "id": 126,
          "comments": [
            {
              "score": 234,
              "content": "Thank you. It doesn’t sound like it was agreed upon. It sounds like OP immediately insisted that dad pay her.",
              "id": 127,
              "comments": [
                {
                  "score": 25,
                  "content": "OP claims that is what she wanted but is too much of a people pleaser for her own good sometimes. I'm the same way so while I get why she wanted to speak up for her it should have been a talk involving all of them. OP could have assumed her feelings in this instance too, it's not really clear if she talked to her or not. Though I also feel the birthday guy shouldn't have had to pay for his own cake but that's just my take. Apparently OP pays for the ingrediants too so idk why she couldn't have taken care of it.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Then she returned his watch to pay for thr cake and pocketed the difference",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "https://www.reddit.com/r/AmItheAsshole/comments/yjgdh9/aita_for_returning_my_husbands_birthday_gift_to/iunnmmo?utm_medium=android_app&utm_source=share&context=3\n\nOP discussed it with the daughter, daughter never said anything to dad",
              "id": 130,
              "comments": [
                {
                  "score": 34,
                  "content": "Well it would have been appropriate for OP to be the one to pay her.",
                  "id": 131,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 155,
          "content": "Exactly. This was very weird. I wouldn't dream of charging my dad to make him a birthday cake nor not getting my SO a birthday cake. \n\nAgreed that OP ruined her husband's birthday. She says the daughter never discussed payment with her dad, so this was a crusade on OP's part. It was her husband's birthday - does she always expect him to pay for his own cake?",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "I also wonder **if** the daughter truly expected to be paid for his birthday cake, did she plan to do anything else for his bday? Did she plan to get him a gift at all, or do something special for him?\n\nI just feel horrible for OP's husband.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "This whole family needs some serious therapy. They don't seem to have a grasp on the basics of interpersonal family dynamics or communication.",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "THANK YOU!! I read this to my husband. We were both so confused. This is so bizarre. Why wouldn't OP just pay their daughter for her husband's birthday cake.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I do. I also buy my own cake. Everyone in my family did that.",
          "id": 136,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2246,
      "content": "YTA, she can't afford to make her dad a birthday cake, or you couldn't pay her?  It's his birthday for God's sake.  You sound petty.",
      "id": 137,
      "comments": [
        {
          "score": 513,
          "content": "Absolutely this!  Did she REALLY have to sell the gift she bought her husband?  No, me thinks not. She did it to be petty.",
          "id": 138,
          "comments": [
            {
              "score": 275,
              "content": "And she even kept the extra money after paying her daughter for the cake… guess he didn’t get a present at all.",
              "id": 139,
              "comments": [
                {
                  "score": 77,
                  "content": "I think his present will be the divorce papers he serves her for her birthday\n\nEdit: YTA. He shouldn’t have had to buy his own cake in the first place.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Came here to say this.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "I get paying the daughter if it’s like a business type thing, but then why didn’t OP pay? I’m assuming here that she would have normally bought him the cake so why did HE suddenly need to pay for it?",
                  "id": 142,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I think she just wanted an excuse to get the money back, considering she kept most of it herself",
              "id": 143,
              "comments": [
                {
                  "score": 11,
                  "content": "P. E. T. T. Y.",
                  "id": 144,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I get being upset at how the husband acted but OP really didn't need to sell his present. It was something small enough to have settled after the party or even just let go. Not saying the daughters feelings don't mean anything just it didn't need to go this far. OP was petty af. Even more so for keepin the left over money. She could have at least given him that.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "It’s 100% pettiness. OP must have a grudge or something against the husband. Unless the daughter is making some extravagant 11-tiered wedding cake, really OP couldn’t have paid the daughter $20 or whatever it was and still given him his birthday gift? How stingy are y’all",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1602,
      "content": "She’s going to charge her own father for HIS birthday cake on HIS birthday and you sold HIS gift to punish him on HIS birthday… wtf. YTA. \n\nEdit: ESH was the incorrect choice, at first I was just confused and thought maybe my perception was wrong in thinking the father could possibly be in the wrong but I stand behind family values and don’t believe in being punished for not buying your own birthday cake. It all feels so drastic and dramatic.",
      "id": 147,
      "comments": [
        {
          "score": 363,
          "content": "Step father\n\nMy question is though, did he agree to pay her beforehand? Cause if not why would he owe anything? The cake could have been her gift to him\n\nLots missing here",
          "id": 148,
          "comments": [
            {
              "score": 131,
              "content": "My confusion as well, I’m just going off what’s there. Did they communicate a price or anything? I don’t know, all I see is family trying to charge family for their own birthday",
              "id": 149,
              "comments": [
                {
                  "score": 171,
                  "content": "I’m guessing not because OP says daughter wouldn’t outright ask for money. Seems to me like OP thinks daughter SHOULD ask for money and stepped in?",
                  "id": 150,
                  "comments": [
                    {
                      "score": 67,
                      "content": "It just feels so strange to me, I personally wouldn’t ask or treat any family member like that especially my parents.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I’m thinking OP may have communicated this with daughter but daughter and step dad may not have discussed it. It’s like OP set up this situation without all parties agreeing then got mad when they didn’t agree.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1532,
      "content": "YTA.\nIf someone REALLY had to pay for your HUSBAND'S birthday cake, it should have been YOU.\n\nIt was his birthday. You want him to PAY OTHERS for his birthday gifts?\n\nWho TF pays someone else for their birthday cake, on their birthday? A cake is a GIFT.\n\nWhy didn't you pay your daughter? Why didn't your daughter bake it as a gift? How much did you demand for her cake?\n\nETA - you sold the watch, gave the daughter her cut and KEPT THE REST and you STILL don't understand how that's an AH move?\n\nYou absolutely destroyed your spouse's birthday, because you're too busy trying to make everything into transactional contracts.\n\nGood job.",
      "id": 153,
      "comments": [
        {
          "score": 209,
          "content": "I can’t believe most people are voting not an asshole. It’s common in my family for people to bring cake as gifts especially when the cake feeds the entire party. It’s a great gift. I would be depressed if I bought my own cake ):",
          "id": 154,
          "comments": [
            {
              "score": 6,
              "content": "I love when I get to the point that this doesn’t make sense to me. All I see now is YTA and I’m like yay okay I missed the BS",
              "id": 155,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "If I had to pay someone namely my family or close friends to bake me a cake on my birthday then they can keep the cake. I do not want it at that point.",
          "id": 156,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "When her birthday comes I’m sure she’s gonna be shocked when she gets no cake and no gift from hubby.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1208,
      "content": "YTA That’s either one bloody expense cake your daughter baked or one cheap ass wrist watch you bought your husband",
      "id": 158,
      "comments": [
        {
          "score": 137,
          "content": "That’s what I was thinking…",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Omg yes",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 787,
      "content": "YTA\n\nYou should have paid for the cake, not him. It's **his** birthday. The fact you intentionally ruined his birthday by returning the thing he wanted makes you double AH.",
      "id": 161,
      "comments": [
        {
          "score": 84,
          "content": "This is actually the most sensible response. Daughter obviously should get paid, and OP should have paid.",
          "id": 162,
          "comments": [
            {
              "score": 101,
              "content": "Maybe it’s just me but in my family I give my mom or dad birthday gifts so why wouldn’t she bake him a cake as her gift.",
              "id": 163,
              "comments": [
                {
                  "score": 18,
                  "content": "Fair point. I’m a chef and I give my folks gifts, but they always try to pay me for food. What I end up doing, mostly, is accepting, but only letting them pay food cost, or telling them it cost much less than it actually did",
                  "id": 164,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I understand having my parents pay for the ingredients if I were 16 but I can't imagine ever trying to profit off of my parents for making them food or a cake.",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}