{
  "post content": "I (30f) am a teacher. I have a class with 24 students. I teach 1st grade. \n\nI told my students that we could have a barbecue at a park (with hotdogs and hamburgers and snacks) for whoever filled their “good noodle” sticker charts. This has been approved by the principal and I teach at a private school. \n\nWe have daily sticker charts to track their behavior in school. They had to have perfect behavior all of April in order to participate. \n\nI have one student who has some behavioral issues. They did not earn all of their good noodle stickers this month. Since this student - we’ll call Bobby - didn’t earn the barbecue I had let his mother know just in case he mentioned it.  Bobby would join another class for the day and do work inside while his classmates were at the barbecue. \n\nShe has been sending emails complaining to myself and the principal all week about how her child should also be able to participate and it is unfair. She thinks we should make an exception since he has behavioral issues and feels we could be targeting him. I think I’m being fair because he did not earn all of his good noodle stickers. \n\nSo AITA?\n\nUpdate: \n\nI had a meeting today after school with the parents and the principal. \n\nThe principal agrees it would not be fair to the other students to allow Bobby to participate. She expressed she understands the frustration but she needs to make it fair for all students and not just Bobby. \n\nThe father said he understood and thought it was a fair assessment if all the other students were able to complete the goal. \n\nThe mother argued Bobby’s IEP. The principal then reminded her we follow his IEP as a courtesy but as a private school we legally do not have to follow it and she has a choice to come to this school but if she’d like to unenroll Bobby then there was a waiting list of students they could contact to take his place. \n\nBobby will still be enrolled in the school and in my class if anyone is wondering. He will not be attending the barbecue.\n\nUpdate 2: \n\nBobby’s mother came to the school yesterday to drop off Bobby’s lunch he forgot at home. She arrived during the children’s snack recess. All of the kids were playing freeze tag. A game where once you’re tagged you have to freeze until someone unfreezes you. I was inside prepping art while the teachers aid was with them. \n\nBobby’s mother came inside absolutely livid saying we were forcing her child to stand in one place and not let him move. We explained the game and she said then the students are cruel for not unfreezing him but unfreezing everyone else. She was making such a big scene and so loud the principal overheard (their office is down the hall).  \n\nHis mother was removed from the school grounds and we had a meeting with his father in the afternoon. The principal let him know Bobby would need to be unenrolled due to his mothers behavior. He did try to get him to stay until at least the end of the year but ultimately understood. He was also told if Bobby’s mother is on the school grounds again the police department will be called immediately.",
  "id": 1,
  "comments": [
    {
      "score": 31993,
      "content": "YTA. \n\nAs a former educator myself, I hate these kinds of public exclusionary rewards, ESPECIALLY for very young kids.  These are 1st graders.  From what you've posted,  it sounds like this was the only student excluded. There is literally no way that is going to encourage better behavior from this young child in the future. \n\nKids, especially young ones,  often act out in reaction to emotional stimuli they don't have the appropriate tools to process yet.  99% of the time,  a kid of 1st grade age who is acting out has trouble somewhere - stress/problems at home,  getting bullied, who knows.  For the same reason it's unfair to punish young kids for tardiness or attendance issues,  it's unfair to expect a kid this young to \"behave\" all the time when you have no idea what might be happening in their lives that isn't in their control. \n\nPublicly excluding one child is going to make behavior issues worse.  You're turning them into a pariah to their peers - kids can be mean,  and honestly don't need much to single someone out as \"other.\" \n\nI know you want to use some kind of reward system for the kids who are behaving the way you want,  but you're talking about 6 year olds! Something as big as a BBQ at the park should have been an all-or-nothing class goal. Singling out the one kid who is having trouble (which, again, you as the teacher will almost NEVER know the true source of) is bullying. \n\nIf these were high schoolers that would be one thing - teenagers are more mature and can be expected to have more control over their behavior - but we're talking about kids who are only SIX years old. \n\nYou need to rethink your reward system,  keeping in mind age-appropriate expectations for these children.\n\nEdit: some of your comments specify that this kid has an IEP. 100% YTA. A kid that young who already has an IEP is never going to be able to meet that level of behavioral expectation, regardless of whatever accommodations the IEP calls for. Perfection for a month! You set this kid up to fail. Hopefully not on purpose,  but that's still the outcome. Learn from this in the future.",
      "id": 2,
      "comments": [
        {
          "score": 6738,
          "content": "This is what really gets me. It's such an unrealistic expectation. The child has issues and they only messed up once in a whole month. That seems worth celebrating not punishment. I feel like if you are setting up a system and it's possible for all but one child to succeed it's a bad system. Especially at this age.  There needs to be some sort of safeguard.",
          "id": 3,
          "comments": [
            {
              "score": 4591,
              "content": "If the kid only missed one noodle sticker in the month and in every other month has missed more then to me that IS improvement worth celebrating. If the kid normally misses half the stickers then if I was his parent I would probably be overjoyed at his progress and furious that he was being excluded- he tried, and he is like six years old not 16.",
              "id": 4,
              "comments": [
                {
                  "score": 2164,
                  "content": "Came here to say this - as an educator this breaks my heart for him.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2075,
                      "content": "Absolutely. This feels cruel, really. It's the kind of thing that follows a child their entire life, and he'll probably remember how he was excluded his entire life (I can think of several times when I was small that adults treated my unfairly and I could only assume that it was because I was a \"bad\" person). It doesn't take much to really mess up a child's developing sense of self-worth, and this is pretty much a guaranteed way to do so. \n\nOP, if this is how you treat small children you're responsible for, you probably shouldn't be in education.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 205,
                      "content": "As a mom of kids with learning and neurodev disabilities it breaks my heart even more.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Having been one of those kids who struggled due to undiagnosed disabilities and an abusive/neglectful home environment, stuff like this just made me give up. Completely. What was the point of even *trying* to do any better, if there wasn’t even the slightest bit of acknowledgment for it?\n\nI had to sit there and watch classmates from wealthier, healthier homes have all these rewards just handed to them, stuff they didn’t have to lift a damn finger to actually *earn,* while I felt like I was being punished for stuff that was completely outside my control.\n\nSo I gave up.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Same, as a parent of a six year old who tries SO hard to do his best - but is still a six year old. This makes me want to cry. \n\nDang, OP.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 392,
                  "content": "He only missed ONE! OMG, Op... YTA!! The message you are sending this poor little kid is simply: Doing your absolute best, STILL ISN'T GOOD ENOUGH! \n\nWhy would he even bother trying after that? You could be his hero, and you are fighting to crush him instead.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I didn't when it happened to me. I have it on very good authority that I was a little shit for the rest of the school year and my behavior plummeted. To my 8 year old mind, why bother even trying if there's only another punishment at the end? And he's even younger, bless him.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 201,
                  "content": "[deleted]",
                  "id": 12,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Exactly, this teacher is ableist af. The child has made progress and is being excluded because he has issues outside of his control.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 174,
                  "content": "YES! “Everyone improves” is not without its issues, but it would be closer to equitable and realistic.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Progress not perfection!",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "This kid is probably trying harder on his behaviour than everyone else in the class. \nYou really couldn't have \"found\" one more time he was \"being good\" so he could get an extra sticker? YTA.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "If the kid has an IEP, his sticker chart could easily have been modified for him, to set him up for success, instead of the failure that seemed inevitable. Sad that the teacher didn’t make this small effort.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "now imagine being that kid and trying so hard to be good all month only to still be excluded.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This is my favourite comment, as I was reading the previous ones I was thinking it should have been about improvement. This kid has learned that even when he does his best it is not rewarded.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1228,
              "content": "#THE CHILD EVEN HAS AN IEP!\n\nSorry to yell, I'm just flabbergasted.",
              "id": 20,
              "comments": [
                {
                  "score": 413,
                  "content": "This kind of thing was done to me all the time. I wasn't allowed to go to class parties, I wasn't allowed to go on field trips, I wasn't allowed to do anything unless it was with the self-contained class. And it made the abuse from my peers so much worse.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 265,
                      "content": "Shit happened to me, turns out I'm extremely dyslexic and had ptsd symptoms from abuse at home. I got relentlessly bullied after these trips or parties, told if I wasn't so stupid I'd be able to do them, class had a root beer float party and me and 1 other kid had to turn our desks around in the classroom and do work, during the party multiple other kids would come up and blow in our faces saying stiff like I bet you wish you could have some, one of the kids slapped me in the back of the head and said I was stupid, I punched him, I got suspended and the teacher said none of that happened and I made it up.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "Me too this first comment made me kinda choke up, remembering the punishments and then feeling good to know how wrong a lot of people think it is. Like I wouldn’t get rewarded, I didn’t do work bc my house was abusive and I was pretty catatonic. I remember a teacher being genuinely concerned because I scribbled answers before class without looking and i was genuinely stunned she thought I was that impaired, I’m sure they convinced themselves that I was severely disabled. I would be tested for learning disabilities every year without ever being ask about my home, which i would have been removed from if they asked. there was a lot of signs they ignored for the sake of making it a me problem even as a young child.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Same! Not only feeling like I was bad/stupid, but then having my peers think that as well.. it was terrible. I’m nearly 30 and I still remember it all, even at 5-6 years old, this stuff has a lasting impact and stays with you your whole life.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This was back in the 80s, but one of my 6th grade classmates got permanently put in the back corner of our classroom with a cardboard divider around his desk. He was excluded from things and I remember the teacher and kids making fun of him. Even as an 11-year old I remember feeling bad for him. There were some mean teachers and they were a terrible example to kids. So sorry that happened to you.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Me too! It was an absolute nightmare, and some teachers I had did that kind of thing on purpose.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 325,
                  "content": "Private school = does not have to even acknowledge the IEP. True facts. If your kid has an IEP or a 504 and you want guaranteed support you need to send them to a public school.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 267,
                      "content": "This. All these \"school choice vouchers\" are basically leaving IEP kids SOL as the local public schools get defunded but private schools don't have to follow IEP or 504 plans or even ACCEPT IEP students into their schools. It really burns me up the way these kids are getting ignored and run over instead of receiving the support the need and deserve to be their best selves!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 104,
                      "content": "If the private school accepts federal funding of any kind then it’s illegal. Just a tidbit. Hope you’ll never need to use it.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 62,
                      "content": "Yup! And my state just passed a bill that public school money can now go for vouchers for private schools. So private schools are now receiving public funds but don't have to follow any public school laws or rules. Nice to know I get to pay for schools to discriminate 🙄  Oh, did I mention this is a rual state so a lot of the population doesn't even live anywhere near a private school and couldn't send their kid even if they wanted to.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 234,
                  "content": "As a foreigner,what is an IEP?\n\nEdit: nevermind,I googled in a different way. For any others wondering, it's similar to a PPI (Proyecto pedagógico individual),making explicit changes to curriculum,evaluations and objectives for a child WITH DISABILITIES. OP IS BEYOND AN ASSHOLE.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 130,
                      "content": "It's short for Individual Education Plan. It's meant to help children with disabilities, or special needs, get the accommodations they need to succeed at school.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "Sounds like she doesn't like this kid and set him up to fail so she could have the bbq without him.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 116,
                  "content": "Wait, WHAT?! The school absolutely should not allow this. This is ridiculous",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 85,
                  "content": "That's the first thing I thought of. This kid is most likely autistic or has ADHD and his \"behavior issues\" are because his needs aren't getting met. Just exclude the poor kid even more, that ought to help/ s",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 59,
                  "content": "This one is worth yelling about.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Agreed. Now I’m actually angry. The lack of self awareness is astounding.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "Thank you for yelling!  Children with IEPs have enough going on in their lives without being excluded by the teachers and/or school administrators who should know better.  \n\nThat poor little boy!",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "It’s outrageous.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 359,
              "content": "He misbehaved only once? ONCE! He did great for the rest of the month...he should get rewarded big time!  \n\n\nOP is definitely a huge AH.",
              "id": 40,
              "comments": [
                {
                  "score": 152,
                  "content": "Omg that makes it’s even worse!!!! Like I was picturing the kid maybe having full on outbursts most days of erratic behaviour MAYBE you could consider not letting him come for unsafe behaviour but ONE mistake and that’s all is remembered?? Not how hard he worked all month to be on his best behaviour. A SIX year old! Is being punished for one bad day out of 20odd other perfect days. My heart absolutely breaks for this child. \nOP you really need to reconsider your whole teaching approach to all of these children.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 100,
                      "content": "Yeah, the more I read, the more I think this was intentional on OP's part. She shouldn't be in education.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "My heart breaks for that poor little kid who probably tried his absolute best so he could go to a bbq with his classmates but is a SIX YEAR OLD on IEP! I can’t believe a teacher would even begin to think the requirement to attend was at all appropriate!",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 179,
              "content": "I’m a whole adult and I can’t promise to have whatever this teacher considers good behavior 100% of the time. It seems suspicious to me that this child was deliberately targeted, I find it hard to believe and entire class of first graders all earned their stickers every single day, except this child.",
              "id": 44,
              "comments": [
                {
                  "score": 70,
                  "content": "This is what gets me as someone in childcare. So many people expect more out of kids than they’d ever expect out of an adult. The kid ALSO has a full time job that requires them to be on basically 40 hours a week, and then they also have no control over their life and go to bed at like 8-9pm. I’d be a little shit most of the time too dude.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Exactly this! I taught first grade for almost 20 years and there’s no way the other 23 were perfectly behaved all month. She let things go for those kids and not this kid.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I hate when children - especially ones who have developmental difficulties - are expected to adhere to higher standards than even adults. I am human and I am not expected to have 100% perfect job performance. Any workplace that expected that level would be toxic.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I’m betting OP set this up to have a day without having to deal with that kid. She knew he’d fail the task.",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Everyone is allowed bad days so this would be unrealistic for anyone. I'd like to learn the terms of what gets you a sticker.\n\nI help out in my church and our reward system was a group effort and our goal was to be kind and participate. When it was complete, I brought in cupcakes and they loved it. Any 6 year old is going to have a bad day and it does seem you are targeting this child.\n\nYou should reward him for progressing and not measure him against other kids. Kids are not cookie cutter robots.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Not to mention setting it up as a 100% perfect or nothing encourages a toxic perfectionism mindset, which winds up teaching kids to give up on things the first time they make a mistake. If the whole month's good behavior becomes worthless because you messed up once, the lesson isn't \"keep striving to improve\", it's \"a single mistake is the same as a total failure\", and that is the opposite of a healthy growth mindset.\n\n(Plus, it's just a wild standard to hold 6 year olds to. I'm 37 and I'm pretty sure I've never made a full month in my entire adult life where I kept up perfectly on every housework thing I needed to do, when I planned to do it lol.)",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I hate this type of reward system. It was terrible for me as a kid with ASD/ADHD, and it’s been terrible for my kid. Totally destroyed his motivation and his self esteem. I’m so glad our school have started to move towards individual goals in order to be rewarded. At the start of the year, the kids write down their goals, and when they’re seen to be working hard towards them and eventually achieve them, that’s when they get their noodles or stickers or whatever. It removes the good child/bad child mindset",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I still remember being a first grader and being excluded from one of these events---the \"good\" kids got to watch a movie in the gymnasium, have ice cream, and got extra recess....the \"bad\" kids (and I was one because of my attention seeking behaviors---sorry I kept tipping over that chair, Mr. Hammond) had to sit inside on a beautiful day and watch a film on why we needed to behave better.  I learned absolutely nothing that day, other than life is patently unfair and adults can be real AH.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This reminds me of when I was in 4th grade. We had a \"home room\" teacher and then halfway through the day our class would be split and divided into other 4th grade classrooms due to a shortage of teachers. \n\nThe classroom I got sorted into had this \"brownie points\" system where over the course of a month or whatever they would get these brownie points for reaching goals. If they reached a certain amount of brownie points, the teacher would bring in homemade brownies. However, this was only for the kids who had that teacher as their homeroom teacher, not for the kids who came into the class halfway through the day. \n\nSo basically once a month me and my peers from my home room would come to class and watch as everyone else got to eat homemade brownies. This teacher didn't even have the decency to hand these out during the first half of the day where we were not in her class. I will say, it sucked ass. We all hated that teacher. At least those of us that came in halfway through the day. She was LOVED by those who had her as their homeroom teacher. \n\nAfter many parent complaints, she \"attempted\" to set up a brownie points system for those of us who came in halfway, however we never reached the goals due to us only being in the class for half the day. \n\nYTA. Being singled out is not fun, especially for something you cannot control. I hope you realize that this kid is trying. He may not even want to go to the BBQ now, but at least give him that option.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 834,
          "content": "This kid is going to remember this FOREVER.",
          "id": 54,
          "comments": [
            {
              "score": 569,
              "content": "As this kid, I absolutely remember this. I had behavioral issues because I could not communicate well, I was terrified, things at home weren't great and to be honest, it seemed like the teacher had it out for me. I was the only one not allowed to participate in a Christmas party in class and had to watch everyone decorate cookies while I just did busy work. I still get teary eyed thinking about that moment in second grade as a now 30 year old.",
              "id": 55,
              "comments": [
                {
                  "score": 177,
                  "content": "You didn’t deserve that. Sending you virtual cookies and hugs",
                  "id": 56,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Thank you 😭 I just wrote in a comment I told my husband the story this morning and just started bawling, I feel so sad for my 8 year old self. I was also an immigrant kid who barely spoke the language so I’m sure a lot of my “misbehavior” was truly because I just didn’t understand.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 146,
                  "content": "Oh this hurts my heart. The fact that you were still in the room. I just can't imagine being that cruel.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 68,
                      "content": "There are plenty of teachers who can be assholes, all while smiling and thinking they’re doing a good job “teaching a lesson”.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 68,
                  "content": "I’m so sorry this happened to you. This was not ok. The adults let you down and you did nothing to “deserve” this. Sending you and your small self a hug and some Christmas cookies.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "This is heartbreaking. I cannot fathom how anyone could justify such cruelty, let alone someone meant to guide a childs development. I hope OP reads your comment and realizes that something like this, especially during our formative years, has long term affects. You didn't deserve what happened to you 💜",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "OMG. 1972. A girl in my class, 8 yrs old. She was a Jehovah witness. The teacher, not her mom, wouldn't let her participate in our class Christmas party. Whether it was just that, or add on she was the only black girl in the elementary school I don't know. She sat and read little house books.  When we left school that day I followed her and gave her my Santa cookie and my candy cane. She looked annoyed. I don't know if I was wrong or right but I thought at the moment I was right. I was 8.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 17,
                      "content": "JWs are not allowed to celebrate birthdays Christmas etc anything.  The only celebration in their minds should be worship everything else is the work of the devil.  There's some cartoons for kids they produce and are on YT I highly recommend looking up.  My brother was beat bloody with a belt by his father at his JW step mother's insistence for having a donut hole at school because another kid brought them in for his birthday. Not my brother's birthday, the other kids.   My brother was 6. He was taken at 8 to foster care after he hung himself in the school gym closet over the abuse, which was all justified as \"biblical discipline\" they got to keep the step moms kids, brothers bios all went into care.  All 5 of them.  So yeah you might have caused her harm as good as your intentions were.  :(",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "It's sweet that you tried to include her, but she probably thought you were trying to tempt her. Jehovah's Witnesses are very serious about not celebrating holidays and birthdays. They also can't enjoy fiction that has magic, aren't supposed to go to college, and are highly discouraged from being friends with outsiders. Tbh this girl's childhood probably sucked because she wasn't allowed to enjoy normal non-cult things.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "You were in the right. I'm afraid I have no time for that particular cult. There was a child with JW parents in my son's class at school when he was five. My son was very upset because he 'wasn't allowed' to invite his friend to his birthday party, to which his whole class was invited.\n\nI asked my son if he wanted his friend there, which of course he did. So he got an invitation along with the rest of his class. The parents complained to the school, so I told them that I don't pander to religious cults, and that under no circumstances are we going to invite all but one child. I told them their son was invited because our son wanted him there, and that they were free to turn down the invitation and explain to their son why they won't allow him to go. I wasn't doing their dirty work for them.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I was that kid, too. Often. For different reasons. When you factor in the abuse I endures at school, I have a slew of mental health issues because of it. It sucks to be us.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "God this is terrible :( I’m very sorry this happened to you, this shit makes me so angry",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 181,
              "content": "I would tell you the terrible 1st grade teachers name but I will get deleted. She told another teacher loudly in front of my class that I wasn’t very smart because I didn’t like to read out load (I was in speech & self conscious).  When I earned my masters degree I sent her a copy & told her how terrible she was. YTA & will have a lasting negative impact on this poor child. Please get out of teaching because with teachers like you causing harm to these children there really is no hope.\n\nEdit - I am 43 now so the impact will be carried with that child forever.",
              "id": 68,
              "comments": [
                {
                  "score": 13,
                  "content": "My daughter confronted her abusive teacher years later as well and I was so proud of her for it.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I love that you sent her proof of your master’s degree!  She should have encouraged you.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I was treated poorly by the school nurse. Wrote an essay about it many years later, in medical school. Found out the nurse’s address and mailed her a copy of the essay.",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 161,
              "content": "I talk about this a lot. \n\nMy kid was violently abused, which his teachers didn't know, and he sure as hell didn't talk about. He also had undiagnosed adhd and autism. He didn't get his homework done at \"home\" because he'd get beaten. So it wasn't done. So he'd get isolated and would be punished with silent lunch. This meant he talked to his friends during class, which meant he got labeled as a bad kid and was constantly in trouble, so he got beaten. What that meant was that at school he had no friends, everyone assumed he was stupid, and he was a bad kid.\n\nThere was a math activity regarding times tables. For every one you got, you could get a bowl, ice cream, and something to add to your ice cream. He didn't understand times table's. He couldn't get help. He watched his classmates have ice cream, and what he got was an empty bowl. \n\nHe is the single most brilliant human being I've ever met, and I say that with no bias, and as a teacher. He's now nearly twenty and has not forgotten that. And it still makes me cry, and i have to remind myself of it every time I get pissed at a student for being an ass.\n\nAnyway, I shaved an avatar arrow into his hair today and he looks ridiculous, so we're gonna go dye it blue now and make it worse.",
              "id": 72,
              "comments": [
                {
                  "score": 24,
                  "content": "Aww man this made me tear up.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Every time I think about quitting teaching, I stay because I'm afraid I'm gonna miss another him who needs someone to see them.\n\nSimultaneously I'm afraid that the kid I'm annoyed at who hates me is someone I'm missing.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "My kids would totally befriend your kid based on that haircut alone!  Tell him some weirdo on the internet says he’s gonna look awesome 🖤",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "My (significantly) better half was dealing with a similar kid today in a similar situation. To deal with the behaviour issues of students in Class A, Administration decided to move her to Class B. When my partner told them she would react poorly and it was a bad idea, Admin decided she was just “entitled” instead of, you know, talking to her and *listening to what she had to say.*[1] I’m not sure what it is about teaching that makes people like your son’s teacher and OP assume that a kid is being willfully/maliciously disobedient, but I’m glad there are teachers like you to make up for them.\n\n[1] Spoiler alert: she is not entitled, unless “entitled” is a euphemism for “severe trauma.”",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "And good luck to OP trying to get kid to improve his behaviour from now on.",
              "id": 77,
              "comments": [
                {
                  "score": 106,
                  "content": "Oh yeah, this kid is gonna remember it and likely take his resentment to his next class and teacher. Hopefully next year he has a better one and still has enough trust to open up to it. \n\nI remember the teacher who destroyed my love of school. Her name was Mrs Greere and she was a bitch. Anyone who was even slightly different was an abomination in her eyes, I became a target because I could already read beyond my grade level and she hated me for it. \n\nI got left at school during a field trip for “not turning in my homework”. Except I did. Her student teacher found it crumpled in a desk drawer. But she claimed I “snuck” it into her desk so I still didn’t get to go. \n\nI went from a kid who loved school to one who would injure myself or make myself sick so I didn’t have to go. And I never got over it either.\n\nFuck Mrs Greere. Her husband cheated on her when I was in high school and a bunch of her former students sent her cards telling her it was her fault and she was too ugly inside and out for any man to be happy married to, lol. (I swear I didn’t send a card or do anything to her. But I cackled when she was crying in the hallway after getting one. My cousin was in the class next door to hers so unfortunately I had to see her daily when I picked up Cousin.)",
                  "id": 78,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Seriously. Fuck Mrs. Greere.\n\nI will never get why there are so many teachers that seem to hate kids.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Stories like this ignite and reinforce my belief in karma, so thank you for sharing. Fuck Mrs. Greere indeed and any other so-called grownup that ever fixes their mouths to belittle or bully children.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I had two specific teachers that ruined school for me. One was my 5yh grade teacher. I started half-way through the school year and when I said I was in foster care she sneered at me and said 'Oh, a future criminal. You can sit in the back.' I was HATED by my entire class and school was absolute torture all the way through. Then I had a 7th grade math teacher tell me I was too stupid to pass a math test because I had ADHD. I stopped trying after that. I figured if everyone was just going to think I was stupid, then what was the point.\n\nThe one good thing that came of that is that I will not allow teachers to treat my kids that way. We've had full, open conversations with our kids so they know how they should be treating people and how they should be treated.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "It’s the end of the school year, that student is the next teachers problem 🤷‍♂️",
                  "id": 82,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Ugh, what a terrible thing to do to Bobby’s next teacher.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Absolutely. I started acting out, getting distracted really easily, in second grade. My teacher fucking *hated* me, and made that clear. She skipped out on a parent/teacher/ Principal convention and got in *serious* trouble, but this took place before that. One day, an ice cream truck was coming around, and I was intentionally excluded. I was crying openly at my desk, until a boy who was sweet on me came over and split his treat with me.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I had a sub one week in the third grade who made me erase my math worksheet and do it all over again. I missed recess and reading, my two favorite things, and cried the entire time. \n\nI was seven. \n\nIm turning forty this summer, and I’ve hated math ever since that day in class. It makes me break out in cold sweats. \n\nI don’t remember that woman’s name, but I know for a fact that she doesn’t know or care that she changed the entire course of my life.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "So will the other kids. They will know that their teacher doesn’t allow mistakes, and they have to be perfectly behaved. There are probably other kids — in this class, and in future classes that OP has — who are going to be so stressed out by this need for perfection and the obvious punishment when someone falls short.\n\nSix year old kids should not have to endure that pressure.\n\nAnd hey, after they mess up once, why bother trying?",
              "id": 86,
              "comments": [
                {
                  "score": 5,
                  "content": "I feel for all the kids under her supervision, the one who had one bad day out of 30 and is being excluded, the anxious perfectionist who is sitting there with knots in their stomach because they’re terrified of screwing up and all the ones in between.  It would be a miserable environment for anyone but for 6 year olds?",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I was a pretty smart kid. Got into a top 20 university. Scored high on my standardize tests. Back in 3rd grade we had to learn our multiple times tables and then take this *timed* test where we had fo memorize something to go to an ice cream party. I was not invited. I’m 32 now and still remember",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 538,
          "content": "Even worse, this sticker chart started as an incentive for this kid *as part of his IEP plan* - OP just decided to make it an all class thing, and is now using it to exclude this kid.\n\nOP literally weaponize this kid's IEP incentive against him.",
          "id": 89,
          "comments": [
            {
              "score": 108,
              "content": "Whoa I missed that detail! That is so much worse.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "Oh god that’s stomach turning.",
              "id": 91,
              "comments": [
                {
                  "score": 9,
                  "content": "I agree. My stomach hurts reading this.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "*Wow.*",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Holy fucking ableism. Wow.",
              "id": 94,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Good lord, OP is a sick person. It seems like the cruelty is entirely the point. I would not trust my children around someone like that.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "This breaks my heart. I would be in a RAGE if this happened to my nephew who has ADHD, is an autistic person, and has anxiety. So, obviously his behavior is not always the \"best\". This teacher is lucky she's not at his school because complaining is about 10% of what my sister's reaction would be.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "OP definitely should not be a teacher.  How horrible!",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "It’s extremely poorly designed then. All-or-nothing reward charts are not recommended for kids with behavioral issues/neuropsychiatric issues. I have two kids with ADHD and every professional we’ve met has recommended charts where you gather points to exchange for rewards but you can’t lose earned points and the points are never wasted like in OP’s case. Poorly handled behavior charts will just make the kids resent the system and then they’ll sabotage it because there’s no point in cooperating when one mistake will ruin all progress.",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Wow.",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Omg this poor kid I hope mum pulls him from the class",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 410,
          "content": "Thank you for this. As a mom to a kid with ADHD, SPD, Anxiety, and Tourette’s, I really appreciate your comments. \n\nMy kid already graduated high school, but I can tell you, in 1st grade our first Parent/Teacher conference was after class on the first day of school. His teacher used a green/yellow/red card system.  It was November 9 the first day he actually ended the school day on a green card. It was a Tuesday. How do I know? Because I cared and was an involved parent. Because his teacher and I were a team that both wanted him to succeed. Because it was a HUGE achievement for HIM. Because he could not be measured by the yard stick of another child. His teacher celebrated him that day! He got a trip to the office to be a special afternoon helper to the principal and secretary after school as a reward for showing responsibility. \n\nThe child HATED coloring with a passion (fine motor skill delays) and writing was challenging enough. Some days that were particularly challenging, he would get picked to take a walk in the afternoon to help wash and slice leftover fruit from lunch. The school noticed that a handful of kids would start struggling with attention and flowing directions in the afternoon, and rather than being sent to the office for discipline, they would be sent to the office for a couple slices of apples and oranges. A boost to their blood sugar and change of scenery. Then sent back to class where they were in a better state of mind to learn. Disciplinary referrals went down, mastery of skills went up, disruptions in class went down. \n\nBy the time my kid was in 8th grade, reports from the teachers were that he was the best behaved student in class. \n\nIf OP treats this child like he’s the bad kid, when really he’s just a kid struggling to cope in a classroom environment before he is fully able, then the kid will become the “bad” kid. He will see himself that way. The students will see him that way. The teachers will see him that way, and sometimes, the parents will see him that way. Do not do that to him. \n\nOP is TA and should never restrict a 6 year old kid from a field trip because they are not “perfect”.  Imagine if your spouse refused to take you out for an anniversary dinner because you were not a “perfect” husband/wife. We are humans. None are perfect.",
          "id": 101,
          "comments": [
            {
              "score": 52,
              "content": "Thank you so much for writing this. I've got three kids, and my sweet 3rd grader has had such a difficult time. This story and perspective was so helpful and inspiring. You are not only a great mom, but a cool mom.",
              "id": 102,
              "comments": [
                {
                  "score": 13,
                  "content": "Things will get better! 4th grade was a big year of emotional maturity which helped a lot, which allowed for other coping strategies to really start to stick.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">The school noticed that a handful of kids would start struggling with attention and flowing directions in the afternoon, and rather than being sent to the office for discipline, they would be sent to the office for a couple slices of apples and oranges. A boost to their blood sugar and change of scenery. Then sent back to class where they were in a better state of mind to learn. Disciplinary referrals went down, mastery of skills went up, disruptions in class went down.\n\nThis sounds like an excellent school - definitely an example more of them should follow!",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 196,
          "content": "Some ideas for reward systems that don’t cause these issues:\n\n-Every day, each student can earn a gold star ticket. Tickets can be exchanged for privileges or prizes—20 tickets for a day using the teacher’s desk chair, 15 tickets for a cool pencil, 50 tickets for a joke book, etc.\n\n-Full class build up to party day: each kid can earn a sticker on the big class chart and when the chart fills up you get a party\n\n-Every day, kids who do a good job get to put their name in a drawing to win a reward\n\n-Same system with a chart fill up to party day, but if you don’t earn the day’s sticker you can earn it back by answering some reflection questions (why didn’t you earn a sticker today? What could you do differently to earn a sticker tomorrow? ) or by helping the teacher with a task around the classroom (help pick up trash at the end of the day, or sharpen pencils for a few minutes at the start of the day)\n\nThis way, no kid misses out on the fun completely no matter what",
          "id": 105,
          "comments": [
            {
              "score": 49,
              "content": "I remember star sticker incentives when I was in grade school. Hell, I remember all of the good behavior incentives that each year’s teacher would have. I was a really ‘fun’ combination of intellectually competitive and a discipline problem. \n\nI remember all three times I actually managed to do well enough to get any kind of reward from these kinds of systems. Those were the first times I got to play on a computer, one of two that the students had access to (1980s). The rest of the time it just added to my anger and frustration throughout my grade school years.\n\nThere are plenty of good ways to encourage good behavior. Reward based isn’t always the best way.",
              "id": 106,
              "comments": [
                {
                  "score": 31,
                  "content": "I’m sorry this happened to you. With any individual behavior incentive, it’s important that all kids are able to meet the expectations a good portion of the time. It’s not motivating if most of the time you see other kids getting rewards which you can’t earn. They don’t work well if kids can’t be reasonably held to the same expectations. When kids don’t meet the same standards, there are ways to still make things work \n\n-the daily ticket can be earned for different behaviors which everyone can do at least a good portion of the time (for raising a hand during class, for working hard on an activity, for being kind to others, or for working through a tough situation, for example). A quiet kid might earn his ticket for doing all the class work , a distractible sweetheart might earn her ticket by helping her friend, a struggling kid might earn his ticket by talking to his teacher about why he misbehaved and what he should do if the situation comes up again.\n\n-the reward is full-class, so even if the struggling student can’t contribute as many stickers to the chart, he still gets to add his part towards the prize and participate in the reward day\n\n-rewards are based on secret goals that each kid makes with the teacher. Results are kept private because prizes are done by raffle. Each kid gets to find out how they did in a quick meeting with the teacher while everyone reads quietly. The struggling student’s goal is based on his most pressing current problems, not what the ideal student would be able to do—a day with no screaming incident means his name goes in the drawing",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 172,
          "content": "All of this!  \n\nOP — I am a nurse who attends school with a disabled child who needs 24/7 care.  I see dozens of children with behavioral concerns where reward based behavior modification does not work because their problems go much deeper.  It isn’t fair to expect all children to be your good little minions.  Christ, they are 1st graders!",
          "id": 108,
          "comments": [
            {
              "score": 94,
              "content": "And at this point, it's not reward- based. It's straight up punishment. Of a 6-year old. If my kid were in this class, they'd be skipping the barbecue in solidarity.",
              "id": 109,
              "comments": [
                {
                  "score": 14,
                  "content": "oh you know this teacher didn't tell any other parents that only ONE of her students is being excluded",
                  "id": 110,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Bet at least one kid did!",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "Frankly, given the IEP and the \"100% perfect behavior\" requirement, this feels almost targeted. Like, you're telling me that not ONE other 6-year-old child was at any point cranky or messy or forgetful or out sick for an entire month? Or did the other kids maybe get a little grace, since they'd be just so sad to miss out?\n\nYou took a kid who was already struggling and turned him into an object lesson and probably a laughingstock.",
          "id": 112,
          "comments": [
            {
              "score": 16,
              "content": "Yep. I was a behaviour therapist in my past life, and \"mastery criteria\" for targets were NEVER 100%.. when has any human ever been able to maintain 100% perfect behaviour, let alone a 6-year-old who barely has a frontal lobe, let alone a 6-year-old who barely has a frontal lobe and has other things going on...? OP either has an appallingly poor understanding of neurodevelopment and basic behaviour support principles, or, this was targeted. Either way OP... YTA. \n\nI wonder if OP will be consistent and withhold these good noodle stickers from all of the other children after they inevitably ask why Bobby didn't attend, presumably get told that Bobby didn't \"behave himself,\" and then start excluding him or picking on him because they feel emboldened to do so by OP's wildly immature behaviour.\n\nETA: The more I think about this, the more flummoxed I am as to how this \"rewards\" system was supposedly approved by the school. The logic is wildly flawed - supposedly the children are aware of the expectation of 100% perfect behaviour for the duration of the month in order to access the reward, yes? And presumably the stickers are awarded day by day? So if a child were to not receive a sticker one day, why on earth would that child maintain their good behaviour for the rest of the month if they no longer have a reward to work towards?? I'm not sure how it could be argued that OP DIDN'T set this child up to fail, in more ways than just missing the BBQ.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "Yeah, YTA. I got excluded from pizza parties and sh*t like this as a kid. Not only was I punished by missing out, but it was also a form of public humiliation because everyone knew you weren’t there.\n\nCore memory unlocked. Damn. Crying alone while everyone else was having a fun time. Reflecting all day on how messed up you are because you’re a “bad kid.” Being punished for tardiness, missing assignments, absences.\n\nSometimes I missed out on things just because I couldn’t afford the fee to go. \n\nScrew you for punishing any kid for things they can’t control. If a 7 year old has issues, that’s on genetics and the parents. Not on the kid. And it’s not on you to fix it with your warped sense of consequences.",
          "id": 114,
          "comments": [
            {
              "score": 10,
              "content": "Complete side note: why the fuck were we as kids getting punished for tardiness on getting to school? I wasnt the one driving, what was I supposed to do about it?",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Omg I’m so sorry. I’m an educator and school can be a form of trauma for so many kids. I don’t know why these people become teachers or HOW their training fails them and in turn fails the children. I hope your adult life fucken rules you sound amazingly resilient.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "Honestly this post made me want to cry as a teacher and as a mother. Also a mother of kid with behavioral issues. Ugh. I'm sorry but I'm this close 🤏 to saying OP shouldn't be teaching if they thought excluding one kid from such a big activity is ok. She needs to profusely apologize to that little boy.y heart is breaking for him",
          "id": 117,
          "comments": [
            {
              "score": 29,
              "content": "Dont be that close and not say it. Im a mom of 6. 1 w/ an IEP.  This instance isnt the first. Or only. Or last time OP has done this. Shes LUCKY that child wasnt mine because shed be unemployed and broke by the time i was done. \n\nThe last time a teached tried this with a child of mine, i was at the school ib the playground asking why my chikd wss being excluded from a field trip to a museum (she struggled with completing work on time in class so they took away her recess and hee trip). Lied and said my childs behvaior was a problem so i offered to chaperone after askong my child if she acted up (she said no right to the teacher who couldnt give me an example of misbehavior outside of daydreaming). \n\nI got the principal and dean right there (it was dismissal time). And explained. Teached rhen said she could go so I smiled and said nope. Id take her on an educational trip to the museum on my own. It was this moment when the teacher learned i had already filed a complaint against her and the other teacher q/ the board of ed. \n\nNever again did my child miss recess, a trip, or anything else.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I’ll come out and say it. This is not a person that should be teaching. This kind of thing means you’re unsuitable as a person to deal with young children. Absolutely disgusting actions against a struggling kid that still manages to only mess up ONCE.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "> I'm sorry but I'm this close 🤏 to saying OP shouldn't be teaching if they thought excluding one kid from such a big activity is ok. \n\nI’ll say it for you: OP shouldn’t be teaching if she thinks this is OK: https://www.reddit.com/r/AmItheAsshole/comments/1318ca3/aita_for_not_inviting_all_students_to_a_barbecue/jhzcaa2/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "I agree with this … I’ve been trying to figure out how to put my thoughts into words, but this sums it up.\n\nTo add, OP, if these were high schoolers, then you did set clear expectations. But these are first graders. This kid is probably having a hard enough time with his peers since any kind of disability can set someone apart from the rest of the kids; he really doesn’t need a teacher adding to it. Maybe do something like if they are the best behaved for the day, they get to wear a special hat or pick a silly topic to talk about or something. But events should be all or nothing at that age",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6170,
      "content": "YTA. *Perfect* behavior for an entire month is not an age appropriate expectation for 1st graders. \n\nAt that age, shorter term rewards are more effective.",
      "id": 122,
      "comments": [
        {
          "score": 1116,
          "content": "I honestly don't think it is appropriate for any kid in elementary school or even middle school. Perfect behavior is an unreasonable standard. Kids make mistakes. One of my kids got in trouble once in 7th grade for \"name calling\" a friend (he and his friend called each other equally offensive nicknames but my son was overheard by a new teacher). He never had a discipline issue before or after and he is graduating high school this year. He served his detention, moved on, and learned to be more careful with his word choice but if it were up to OP that one mistake would be enough to write him off? \n\nPerfect behavior for an entire month for 6 and 7 year olds is beyond ridiculous.",
          "id": 123,
          "comments": [
            {
              "score": 406,
              "content": "It's not appropriate. I have a group of kids with educational goals that come in once a week for extra help and to get caught up. We are currently doing a \"pizza party\" reward for meeting goals. The expectation is 80% of the goal being met for each kid. And even then, if one kid is at 60% I am not going to cancel the party. I am not even going to tell them what percentage they are at. They have all worked hard to meet their goals and they are all different with different abilities. So next week...pizza for all and a huge Congrats and thank you for trying.",
              "id": 124,
              "comments": [
                {
                  "score": 136,
                  "content": "It's not even appropriate for adults, for any kind of learning environment. That's because behavior is subjective--I could cause a disruption because I'm standing up to a bully and still be the one getting in trouble.\n\nAs another commenter said the focus should be on collective not individual behavior. How do you all come together to create a harmonious and safe classroom environment? That means including those with disabilities instead of succumbing to cancel culture and canceling the kid who's not falling in line \n\nLuckily the tide is turning and it seems like educators are tuning into more progressive, humanitarian ways of actually educating--not the antiquated dictatorship that fuels OP's need for control and homogeny",
                  "id": 125,
                  "comments": [
                    {
                      "score": 17,
                      "content": "There were three subs in my daughter's kindergarten class last week (I don't know why they have a different sub each day the teacher is out). One of those days my daughter was sobbing after school and it took over an hour to get her to say why. Turned out, the sub called her \"a rude person\" because she was doing what she always does with subs - trying to be their assistant and help them know what to do. This particular sub didn't appreciate having the school day explained to her by kindergartners and apparently made like half the class cry. On the flipside, my daughter often gets \"Paw Points\" (reward system) on sub days for being so helpful. Granted, she doubled down and got a bit pushy when the sub said no, and we talked about boundaries and taking no for an answer, but... She made half the class cry, dude. I'm assuming she was not experienced with kindergarten. The reason so many kids tried to participate and take an active role in their day is because that's what they're taught to do in kindergarten.\n\n So yeah, the same behavior that gets you a pat on the back from one person absolutely gets you smacked by another... Crappy life lesson, but we talked about that, too. There's that need to self-assess and just know you did your best, meant well, and stayed true to your values, even if you didn't get the appreciation you hoped for. Can't let one grouch convince you that you're a bad person.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I totally agree! In year 11 I remember deciding that I was going to make a huge effort to be better in math class. I sat up the front instead of up the back & I really wanted to improve myself! \n\nMy friends kept trying to talk to me & at one point I turned around & asked them to stop distracting me - teacher sent me out of the class for talking! \n\nI think I only went to a handful of maths classes after that",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I got *one* detention in high school, and that was for a reason largely outside my control - one teacher required a doctor's note to excuse an absence (not just a parent's note/phone call, like the admin office accepted alongside all the other teachers). I got sick, stayed home a couple days, got better and went back to school, and before the start of the class I just went up to get my detention slip before the class properly started. While writing it out, she asked me why I didn't get a doctor's note since I clearly know this was going to happen.\n\nA decade and a half later and I still remembered the absolutely baffled look on her face when I said, \"I'm not paying $50 just to get out of detention.\"",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 192,
          "content": "It’s not even realistic for adults! PERFECT behavior all month long?? I can’t think of a single person who is perfect alllll month long, let alone a 6 or 7 year old whose brain is still developing. Major YTA.",
          "id": 129,
          "comments": [
            {
              "score": 35,
              "content": "especially for children who can get nailed for talking too much or being off task. I'd be missing a lot of good noodle stickers at work if that were the case lol",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "OP can't have 100% perfect behavior for an entire month, either--being this intentionally cruel TO A CHILD surely wouldn't meet the \"good noodle\" standard!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "100% this! OP, YTA. And not a very good noodle👎🏻",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Perfect behavior for a month is out of reach for most children under the age of 12, realistically speaking.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "100% \n\nA first grade teacher should know this ffs",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3322,
      "content": "YTA\n\nSingling out a child who you know have behavioural issues and possibly can’t control certain things and you’re punishing them for it?\n\nI’m glad our teachers recognise effort, we all have shit days and this is one of your massive ones! Glad you don’t teach my kids!",
      "id": 135,
      "comments": [
        {
          "score": 345,
          "content": "These sort of rewards or punishments assume that the only thing standing in the way of kids \"succeeding\" is sufficient motivation. While providing additional motivation may help some kids, for lots of kids it is not the case. \n\nParticularly at this young age, kids are still developing the kind of skills required to get the \"good noodles\" - skills like concentration, emotional regulation, impulse control. Some kids will naturally lag behind others. \n\nParents and educators are meant to help these kids develop those skills, not punish and exclude them because they are not there yet.",
          "id": 136,
          "comments": [
            {
              "score": 21,
              "content": "Also depending on what the skills are some kids might never get there.  My autistic kid has an auditory processing disorder where she needs things repeated and has trouble with eye contact.  I cant even begin to count the times she has been accused of “not listening” like it’s a willful choice.  It just makes her angry and frustrated which makes the behavior worse.  She does great in the classes with teachers who will just let her be her.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "But this isn't just a \"shit day\", is it?  The whole thing has been carefully plotted, planned, prior approval sought and given and then implemented.  This is deliberate cruelty and abuse from an allegedly trained educator of young children and their Principal.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1900,
      "content": "This isn’t okay. You’re teaching 1st grade - not 10th! They’re too young and immature to fully understand why you’re ostracizing them and it can’t come as a surprise to you that this can lead to mocking of the child who failed to “behave”. \nGood grief. Wasn’t pedagogy and empathy a part of your curriculum at all? Find a more age appropriate way to award good behavior. YTA\n\nEdit after your update: neither you nor your principal are fit to safeguard the mental health of little children. You deserve the judgement you recieved - and more.\n\nYou must be sad he’s still enrolled in your class. We see right through you and we’re disgusted by what we see.",
      "id": 139,
      "comments": [
        {
          "score": 439,
          "content": "By 10th grade, all the students know that reward systems like this are divisive and undermine good faith in the teacher and admins.",
          "id": 140,
          "comments": [
            {
              "score": 182,
              "content": "I teach 10th grade. I do sometimes dole out candy as rewards, but I make the rewards reachable. \"Danny, if you don't talk for 2 minutes, you can have some candy.\" :)",
              "id": 141,
              "comments": [
                {
                  "score": 139,
                  "content": "Also some kids getting candy and some not will suck for the excluded kids for the 30 minutes it’s top of mind, mayyyybe for the whole day…but being excluded from a super special, super rare bonding event will impact that kid’s relationships with their classmates and teacher for the rest of the year. \n\nAs a teacher, OP, YTA",
                  "id": 142,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": ">2 minutes\n\n🤣 Dang. Danny talks a lot, huh?",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "At my highschool every teacher got to give out a favorite student award at the end of the year. I still remember every time my favorite teachers picked someone else. It seems silly, and I wasn’t devastated, but it still made me feel kind of weird and let down. And what OPs doing is worse because if teenagers have poor emotional control, first graders have even less.",
              "id": 144,
              "comments": [
                {
                  "score": 14,
                  "content": "On the flip side, when I was teaching our football players had their favorite teacher wear a spare jersey the day of homecoming. It was pretty disappointing never to be picked, when I taught quite a few of them. The difference is that a teacher should be able to handle it as the adult in the situation. I had lots of kids that I “clicked” with more than their classmates, but I would never have been able to pick a favorite student. That’s just hurtful.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 11,
                      "content": "The age is what made the difference for me as well. Adults are better equipped to handle the disappointment. I remember one year my favorite teacher chose a boy who was awful to people (I don’t think she knew that though), and it caused genuine tension amongst the students. It’s seems silly to adults but it’s not to teenagers",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "As a fellow 1st grade teacher currently getting my Master's in special education, I agree wholeheartedly. This was a terrible idea, and I wonder if it was unconsciously devised to punish the child. If the behavior is due to the disability, then it is unreasonable to punish the child. Positive reinforcement is better for the child and much more effective than punishment. I have quite a few students with disabilities in my classroom, and I'm incredibly aware that I am modeling how to treat others.",
          "id": 147,
          "comments": [
            {
              "score": 35,
              "content": "I’m not so sure it was unconsciously devised to punish the child - I think it was likely very consciously done. As a former special education teacher, I have seen multiple teachers set up situations to purposefully punish or humiliate children who they dislike or who don’t behave as they want and especially at the end of the year.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Thank you for being one of the good ones.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yes hard agree. As the troubled kid all grown up, believe me when I tell you you're not doing that kid ANY favors. This will accomplish nothing other than isolating him further from his peers. This WILL make things worse for him. Please please don't treat him this way any longer.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1826,
      "content": "YTA I’m dead serious - find a new profession. Far away from children or anyone vulnerable.\n\nTeachers like you are a big reason why children like that student struggle and suffer for years with their self worth, finding their place in society, and struggle with relationships. \n\nI wonder how many core memories of trauma this teacher has left on students like Bobby. Every time he didn’t get a sticker or penalized for being a child (with a disability) rather than guided and respected.\n\nYou couldn’t train him like some prized show dog, so you’re punishing him. Let me guess, he didn’t sit still, stop speaking on command, a little rowdy…. Find. A. New. Job.\n\nEdit: my first gold. Thank you kind stranger!\nEdit: my first silver. Thank you kind stranger!",
      "id": 151,
      "comments": [
        {
          "score": 452,
          "content": "Thank you for saying this. I was Bobby. I was abused at home and had no friends at school. I wet the bed and my parents wouldn't wash my clothes so I went to school smelling like piss.\n\n OP is my Mrs. Greene. A woman who actively encourages my classmates to ostracize me, who let them go through my desk when she knew I had recently started my period (age 10), who told me that other teachers would apologize to her for having that \"difficult child\" in her class. No friends, no support from teachers, abused at home.\n\nTeachers like this made me hate teachers. I was a lonely lonely child and was lucky to come out the way I did. \n\nOP I hope you see this and realize that the things you do WILL impact this child long term.",
          "id": 152,
          "comments": [
            {
              "score": 112,
              "content": "I’m so sorry you went through that. I was also abused, and I acted out in school. To this day I cannot believe that in 12 years of day-to-day interactions with mandatory reporters, no one ever did anything to help me. Instead I also had teachers who bullied me. Some worse than the kids. I’m fine now, but I also consider myself fortunate to have “made it.” \n\nOP, people like you are what’s wrong with this world. YTA.",
              "id": 153,
              "comments": [
                {
                  "score": 12,
                  "content": "Through experience I find that nothing can be a bigger misconception that to become teachers it means you like and wish to help kids. Looking back at my childhood, it was pre internet/early internet times, mental health and development were kind of taboo etc but there were teachers who were just malicious.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "You just made a 40 year old man cry. We had a similar childhood by the sounds of things. Sending you love and wishes that you,like me, made sure that our own kids never felt this x",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Came here to say this.\nY so much TA, you should not be a teacher and anyone who gave this the okay, should also not be allowed to teach. This situation is devoid of anything good or healthy.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "seriously. it should be harder to become a teacher. i don’t think teachers realise how much of their behaviour stays with kids YEARS later into adulthood and affects them in so many ways? OP is absolutely disgusting, i don’t care if it’s a harsh word because it’s appropriate. just simply disgusting. such people need to be thrown out of the profession. i cannot believe a profession that has such great influence in the formative years of human beings accepts just any emotionally stunted rando.",
          "id": 157,
          "comments": [
            {
              "score": 11,
              "content": "When I was in 6th grade (a longggg time ago), my teacher told us all to get pee chee folders. My mom wasn’t dirt poor, but we often shopped generic, and that’s what kind of folder I got: generic. That teacher called me out in front of the whole class to tell me that I did not have the right folder. I was so embarrassed, and despite the fact that I wasn’t a troublemaker at all, I yelled “then YOU buy it for me!”.  He yelled at me “SMITH, OUT IN THE HALL!” (Not my real last name). \n\nThe worst part of it is that they made me see the school psychologist and look at ink blots, and if I recall, I had a behavior plan. \n\nSo yeah, shitty teachers stick with ya.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Trust me when I tell you he will remember this for the rest of his life. \n\n3rd grade we had multiplication groups we had to complete for an ice cream coupon. We had to do problems on the board in front of the class. \n\nI’m dyslexic and when I wrote my answer the teacher said “that’s right but numbers can’t see backwards on the board” and the class laughed. I rewrote one of the numbers but it must’ve been the wrong one. Everyone laughed more. I now had no idea which numbers were right or wrong facing. This went on for a couple more attempts before the teacher told me to sit down. It was so humiliating. I can still feel how hot my face was and how hard I tried not to cry.  \n\nI didn’t get the coupon to have ice cream. I also stopped participating in anything that required me to do something in front of the class. I didn’t raise my hand, I didn’t read aloud, I didn’t volunteer for anything. I felt different already and my teacher had just reinforced that and made me think different meant I was dumb. \n\nThis is what you are setting bobby up for, but at an even younger age. He will be made fun of, he will be excluded, and he will feel less than. All at age 6. When he already has to work harder than the other kids because of his diagnosis. \n\nI can’t even imagine how sad and confused and humiliated he will feel when his entire class goes to the park without him. And all so you can do what? Hold his own IEP sticker reward program against him? Show him how superior the other children are? Get back at him for misbehaving? \n\nYTA. I agree that it does not sound like you should be in this profession if you can’t see why this is wrong. I truly hope the answers here make you rethink your methods and stance on this situation.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "\n>I wonder how many core memories of trauma this teacher has left on students like Bobby\n\nThis post gave me immediate flashbacks to Ms. Phillip's \"responsibility board\" when I was in the 1st grade. We all had toothpicks in a little pocket, and if you forgot your homework, talked in class, etc., you had to get up and remove your toothpick in front of everyone. Every day you went without removing it, you got a sticker, and like 10 stickers got you a reward from the prize box. \n\nMy undiagnosed ADHD and I sucked at remembering homework and sitting still, and never got prizes like the other kids. I still think about it surprisingly often 25 years later. She was a bitch and that whole school was backwards. Private, ultra conservative Christian school ruined me for life.\n.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1166,
      "content": "[removed]",
      "id": 161,
      "comments": [
        {
          "score": 657,
          "content": "It gets worse. OP is only excluding one child. The child has a disability and behavioral issues.",
          "id": 162,
          "comments": [
            {
              "score": 149,
              "content": "[removed]",
              "id": 163,
              "comments": [
                {
                  "score": 79,
                  "content": "An Improvised Explosive Device? 🤣 Sorry, I know it was a typo, I had to.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 47,
                      "content": "To be fair, I'm not sure I'd want anyone with an IED at my BBQ. *Pictures children flying everywhere as the picnic table explodes*",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "Haha you would be surprised how often schools exclude kids with disabilities! It seems made up in this day and age, but excluding kids still happens a lot.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 7,
                      "content": "One time my disabled son had to leave an assembly on diversity because it was going to include one of his sensory triggers (for some random reason.)",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I find it hard to believe every other student was perfectly behaved for an entire month.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I wouldn't send my kid to that school ever again.",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 953,
      "content": "YTA\n\n You likely could have predicted 1-2 students would fail to get all the stickers. I agree that a person should stick to what they say; in this case you should have left some leeway. You set this up and should have foreseen this exact outcome. \n\nThis is going to be rough for a 6 year old to handle. Being the sole kid to be excluded might feel pretty bad. \n\nThe real question is; would you feel good about it if you were 6? Put yourself in the kids shoes; they will hear about the BBG from their friends for the rest of term. \n\nIf you can honestly say, you would be fine with being the only kid excluded, then feel free to ignore my judgment.",
      "id": 170,
      "comments": [
        {
          "score": 437,
          "content": "Yes. This kid already has an IEP and special needs. He already knows he is different. He faces years of exclusion in a world built for NT folks. I’d expect a first-grade teacher to be a soft place to land.",
          "id": 171,
          "comments": [
            {
              "score": 344,
              "content": "I think it's really telling that OP left out the IEP detail in the post.  Knowing that,  this is clear YTA territory.",
              "id": 172,
              "comments": [
                {
                  "score": 210,
                  "content": "Yep, I hate to say it, but I think OP set the whole thing up so that she didn't have to have this one poorly behaved kid at the barbecue.",
                  "id": 173,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 140,
                  "content": "Either they were deliberately leaving it out (which I doubt since they admit it in comments) …. Or they don’t understand what the document actually means.\n\nThis is why private schools aren’t necessarily a superior option to public. They actually have far *lower* standards of accountability.\n\n**Edit to address your extremely disappointing edit:**\n\nI want you to think about the following VERY CAREFULLY as you move forward in your career as a teacher of children.\n\n> “The principal then reminded her we follow his IEP as a courtesy but as a private school we legally do not have to follow it and she has a choice to come to this school but if she’d like to unenroll Bobby then there was a waiting list of students they could contact to take his place.“\n\nI want you to TRULY understand what this TRANSLATES TO:\n\n“*Your child has special needs. I would like to remind you that we do not think it is important to meet the same legal standards for inclusion and equity that public schools do. In other words, either keep your kid here where we punish him for being special needs, or take him somewhere else, because we don’t want people like him here. We, and the other students on the waiting list, are better than him.”*\n\nI want you to REALLY THINK about if this is why you got into teaching. Are you in it to help kids learn… or are you in it to be the instagram teacher with charts and BBQs (but only for the rich and smart kids pls)\n\nYou have TWO CHOICES about how to proceed now that this meeting is concluded:\n\n- you could feel validated that the principal backed you up and not worry about it anymore and let yourself believe you did nothing wrong because you didn’t get in trouble\n\n- OR you could recognize that what happened in that office is discrimination, realize you had a part in creating it, and make a better effort in your classes moving forward to actually set this child up for success\n\nYou are treating a HUMAN CHILD as if they are an inconvenience rather than a person, because they are different.  Let me be clear: punishing or excluding only this child for not meeting unfair standards for behaviour is the same thing as punishing or excluding a child who needs glasses for failing vision tests. Or punishing or excluding a child in a wheelchair because they can’t do the obstacle course. Being left out of something the entire class is doing? That’s not a consequence, that’s public shaming. And it’s traumatizing. \n\nAnd it makes me (and the vast, VAST majority of people on the internet) sick to think about. Him staying enrolled in your class is heartbreaking. He SHOULD go somewhere that he is valued and treated with respect. But he shouldn’t have to. \n\nReally think about that. Were you shocked by this sub’s reaction? Why do you think so many people reacted that way? I think it is time to realize that you live and teach in a bubble of privilege. And do something about it.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 16,
                      "content": "100% agreed. Especially since the principal apparently is fine with it. Who does one talk to about this principal and teacher in a private school setting?!? \n\nIf this happened in public school shit would hit the fan and something could be done about this—principal’s boss, central office, BoE, HR, etc.",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "They are financial institutions and will act in the interests of the business first - protecting it's reputation etc, individual customers (parents) and contracts (teaching children) comes second.",
                      "id": 176,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "The issue isn't just the kid feeling bad for being excluded, it's deeper than that.\n\n\n\nExpecting perfect behavior from first graders is ridiculous in the first place, but it's also ableist, classist, and ignorant as fuck.\n\n\n\nA child could be acting out because they're being abused at home and don't know how to articulate it. Not only has she now punished a child for being a victim of abuse, but she's also further ostracized that child from their peers. Now that child won't be safe at home or at school. That child has also been taught that teachers aren't safe to reach out to which puts them at risk for further abuse.\n\n\n\n\nWhat about disabled kids whose parents can't afford to get them diagnosed? Welp, this teacher just punished the kid for being disabled and their parents being poor.\n\n\n\n\nIn this case, the child has an IEP. So OP effectively just discriminated against a disabled child for not being able-bodied/able-minded like their peers.\n\n\n\nOP has no business being a teacher. What she did is cruel *at best*. I work professionally with traumatized kids, most of which are in the system. I can guarantee you situations like this do nothing but compound the harm marginalized kids are already facing. If a client of mine disclosed that their teacher did something like this, I'd do everything in my power to make it so that teacher doesn't have access to children until they've proven they're no longer a risk for harming the children under their care.",
          "id": 177,
          "comments": [
            {
              "score": 93,
              "content": "My middle child just got an IEP because he has anxiety due to his father committing suicide, and school is hard for him because he's away from me and in his mind, I might disappear like Daddy did. I'm so incredibly thankful that he has an entire team at his school making sure he has every possible resource to learn and grow.\n\nIf OP was my son's teacher, I would blast them to every single conceivable source, every social media platform, I'd go straight to the administrators and make sure OP never worked in a school again in their life.\n\nImagine being so flippant about socially and emotionally destroying a *six year old*.",
              "id": 178,
              "comments": [
                {
                  "score": 23,
                  "content": "I'm so sorry you and your child have gone through that trauma and loss. I hope you're both getting the support and resources you need to move forward and heal as best as you can. This internet stranger will be keeping you and your son in my prayers tonight.\n\n\n\nI'm also a parent and if OP was my child's teacher I wouldn't stop raising a stink until she was fired. I wish I could do the same for the children I work with, unfortunately the laws and codes I have to abide by make it difficult to advocate for my clients to the extent that I would like to.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 16,
                      "content": "We're doing okay, thank you so much! We have an amazing village that love me and my kids so much and it makes everything hurt less. It's not always easy, but my kids make it worth it to always keep going and always keep working to give them a good life.",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My eldest daughter is now 14. In elementary school she had a horrible teacher and scjool environment in general. After a mental break down i learned the gist and fought back with limited success. Fastforward 6 yrs. My daughter JUST started to open up about that period in her life. \n\nShe described once incident that blows my mind: her \"underline\" on her paper wasnt straight. The teacher was mad and scolded her, threw away the paper and made her rewrite it. \n\nMy daughter developed an anxiety disorder. I spent 8 yrs of her life making sure i protected her from toxic ppl... to have the f**** teacher be the toxic adult who gave her mental health issues. \n\nNever. Again. I have vowed to tear schools down for my kids.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If I had an award to give you, I would. I'm an SLP often participating in behavioral analysis for students exhibiting frequent violent behaviors in school. This is precisely one of the major factors contributing to violent behaviors among our disabled students. When they start pre-k, disabled children are often happy but can't follow the rules and can't achieve the learning objectives set for the group. When teachers fail to help them adequately and to adjust expectations, children react with minor behavioral issues. Teachers fail to be empathetic and rather than seek help to understand the kids, they end up using inadequate reward/punishment systems with behavioral goals children are already unable to attain, thus increasing even more their feeling of failure and hopelessness. And then they wonder why behaviors keep getting worse and worse until they are no longer manageable. Now, the only thing this child has learned is that no matter the efforts, it is never going to be enough and school is cruel. So why bother trying? Honestly, I can't count the times we've solved behavioral issues by letting summer go by and the kid gets a different, more empathic teacher.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Arguably, given other comments and my own shitty experiences with the public school system and IEPs and having to lawyer up, the parents of the kid could probably bring some MAJOR legal trouble onto OP. It's going to be *very* hard for them to prove they didn't discriminate against this one kid if I'm understanding other comments they made correctly. Fucking hell.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 58,
          "content": "My favorite movie is Inception.",
          "id": 184,
          "comments": [
            {
              "score": 42,
              "content": "Or take the time limit off and have their party when everyone fills up their sticker chart.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "As a kid that never got in trouble in elementary school *this* would frustrate me. \n\n\nIt is unfair to saddle the bulk of the \"work\" on the \"good kids\". \n\nI always got paired with the kids who had behavioral problems or were behind in learning and it sucked for me. \n\nI still remember when I got sat next to this kid who would not stop talking the entire day. He talked and talked. I tried to ignore him but the teacher caught me telling him to stop talking to me and we both had to move our \"colors\" down. \n\nMultiple teachers told me they were putting me with X or Y or Z kid so that I'd \"rub off on them\". \n\nIt was a burden and not fair to do this to kids who often are unable to communicate that they don't want or like this.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "I agree , they’re 6 years old… like come on",
          "id": 187,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 839,
      "content": "YTA\n\nYou're saying out of 24 first grade kids, Bobby was the **ONLY** one who didn't have perfect behavior for an entire month?  That's incredibly hard to believe.  \n\nI don't believe in the Speshul Snowflake, Everybody Gets a Trophy theory that's so prevalent these days, but c'mon!  I don't know of any 6 y/o who is perfectly behaved all the time.",
      "id": 188,
      "comments": [
        {
          "score": 324,
          "content": "> I don't believe in the Speshul Snowflake, Everybody Gets a Trophy theory that's so prevalent these days\n\nI have literally never heard of this actually happening, just people making fun of it.",
          "id": 189,
          "comments": [
            {
              "score": 60,
              "content": "Somewhere in a box I have like 5 participation ribbons from science fairs 15-20 years ago. So they definitely did happen, but I think they've become more of a deal because of the jokes than they were in reality.",
              "id": 190,
              "comments": [
                {
                  "score": 108,
                  "content": "Yeah, were they even a big deal at the time? I don’t remember taking them seriously - they were usually more like a souvenir, it didn’t feel like winning something. No one gave a shit about them, really.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 76,
                      "content": "People get \"participation medals\" for running the London Marathon every year but no-one fucking calls them snowflakes.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I have a really vivid memory of a soccer team I played on as a kid that kind of relates how I feel about participation trophies.\n\nI was around 10 years old and my team had this one kid that was just… awful. Really, really bad. No one was happy he was there, but we were stuck with him. He brought down the skill level of our entire team he was so bad. But he was given a bit of play time each game nonetheless, because why shouldn’t everyone at that age get some game time?\n\nOne game, he found himself in the opponent’s goal box and the ball just kind of ended up right in front of him with a wide-open net. I’m talking a standard size soccer goal, this kid 5-10 feet from the goal, and a barely moving ball right in front of him. He took the shot and it rolled so slowly that it might not have even made it across the goal line if it hadn’t obviously been stopped. It was embarrassing to watch and we really weren’t happy that he blew the easiest goal we should have ever had. We either lost by one or tied that game.\n\nAfter the game, on the sideline, the kid ran up to his mom and asked her in the most excited voice if she had seen his shot. He was so proud of it an the two of them celebrated loudly.\n\nYeah - people typically wouldn’t care about participation trophies growing up - I sure didn’t - except for the one or two that did. And it was pretty cool to see when those kids got excited about their efforts.",
                      "id": 193,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I don't think they were a big deal. Like we all got them, but because we all got them they weren't seen as anything important. It was like a pass/fail thing where you passed just for showing up haha.\nI think they were only a big deal to the parents who wanted their kids to be winners at all costs because they meant their kid wasn't a winner. Which translated to those kids getting upset about them.",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Just fyi, that era is pretty much over. My kids have zero fake trophies or ribbons.",
          "id": 195,
          "comments": [
            {
              "score": 9,
              "content": "Honestly that makes me kind of sad. It was a lot of fun getting those tiny plastic trophies then going out for pizza after our last peewee soccer game. I don’t know anybody who got a participation trophy past elementary school.",
              "id": 196,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "True that that era is over. It was part of my childhood and I’m in my 20s now.",
              "id": 197,
              "comments": [
                {
                  "score": 36,
                  "content": "I’m in my 40s, and it was part of my childhood, so it’s not some millennial Tyler Durden thing, it went on for a long time until we apparently decided life was too generous and kind to children for some reason? Frankly I think kids today should get a participation trophy and an ice cream party just for showing up to school while they’re being warned that at any second they might be shot to death.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "How many adults would fail this test after even a week or two? LOL",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 645,
      "content": "I was the mom in this situation and my son is in 1st grade as well. Kids their age take everything to heart and get hurt very easily by being excluded. If the kids already struggling with behavior problems how would being singled out affect their mental health? That’s so wrong I’m sorry but I’d be furious with you too and ask my child to change teachers…",
      "id": 200,
      "comments": [
        {
          "score": 184,
          "content": "I was the mom in this situation- and I pulled my kid out of private school immediately and put her in public. Have never regretted it!",
          "id": 201,
          "comments": [
            {
              "score": 51,
              "content": "Private schools *can* be awful. I love how OP mentions that they have Principal approval, as if that means anything. From my experience, Principal's in private schools often know the least about education and educational theory, as they are hired for their business acumen.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "An excellent choice.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Especially for such a big thing - our first and second graders sometimes can't participate in end of class games if they're making the game impossible (kicking, shouting, whatever) and don't have an IEP or otherwise struggle to behave regularly. But like, one round is 5 minutes maximum, and if they promise to follow the rules they can join in the next one. \n\nDepending on the behavioral issues, a big event like a barbecue might require some time away from the others if he's overwhelmed- but he behaved almost perfectly for a month. If any of my first graders behaved absolutely perfect for a month without a single bad day, I'd be checking if they were exchanges for a robot or something. Kids make mistakes!",
          "id": 204,
          "comments": [
            {
              "score": 7,
              "content": "See that seems like a perfectly reasonable way to address behaviors in a 6 year old. It’s like, we’re having fun and you’re getting overstimulated so let’s just go sit down for a few minutes to rest and then come back to the next one.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 365,
      "content": "Well is Bobby the only excluded student? Was he clearly trying hard to earn them?",
      "id": 206,
      "comments": [],
      "relation": "No"
    }
  ]
}