{
  "post content": "(Sorry for spelling and gramma in advanced) Me (15m) my mother (45f) me and my siblings live with our mother and grandparents my mother has been talking about moving to QLD in australia for quite some time from where we live currently it’s about a 15 hour drive to there\n\nshe wants to move due to most of not all of her friends living there and it’s cheaper to live there in general. When I was told about this I broke down crying as we havnt moved in my hole life and I’d be leaving my friends I have behind   \n\nIt’s taken me years and years as I’m a introvert and it’s hard to socialise for me with out getting overwhelmed until a year or two ago I only had one friend that only talked to me due to our mothers being friends now I have made a group of friends that support me and I get a get a long with and I’ve got the sweetest girlfriend that we will most likely haft to break up if we move my mother doesn’t know about her and I can’t tell her\n\nI love living with my grandparent we’re we currently live a lot of singers I listen to tour here and I love music if we are to move it would be taking away some thing that brings me joy and all of my friends it would be taking away the environment I’ve always lived in and it would be taking away things I love I’ve told my mother that she can move with my siblings to  QLD but I will be staying here although I will visit them over the holidays. every time she brings it up I break down \n\nI can’t think of moving with out going in to a break down and we end up in a massive fight over it as her friends are there and my life is here she wants us to move at the end of the year, I want to stay here until I graduate, am I the ass hole?",
  "id": 1,
  "comments": [
    {
      "score": 5,
      "content": "NAH.  You both have valid reasons for wanting to move or not move.  But unfortunately only one of you can get your way, and your mom is the ultimate decision maker as the parent.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "This was really hard to read",
      "id": 3,
      "comments": [
        {
          "score": 2,
          "content": "I edited it in to parts sorry I’ve got dyslexia and I’m shit at writing things in general",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA but unfortunately you are a minor and do not have much of a choice. Maybe you could stay with your grandparents until you graduate?? I would suggest explaining your feelings to her and offer suggestions rather than just blatantly refusing. It may help her see you as more mature and feel more comfortable leaving you with your grandparents! Good luck!!",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH. I'm sorry you're going through this. Your mother isn't moving to ruin your life. Unfortunately, you don't really have a whole lot of say in the matter.",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "How long til you graduate?",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "3 years",
          "id": 8,
          "comments": [
            {
              "score": 2,
              "content": "Well I'm on your side as someone who grew up very introverted and moved a lot. I really hope you all can come to a compromise.",
              "id": 9,
              "comments": [
                {
                  "score": 1,
                  "content": "Thank you",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Would she be willing and your grandparents be willing to let you stay until graduation? I truly hope everything turns out. I get how you feel unfortunately your mom may not.",
          "id": 11,
          "comments": [
            {
              "score": 1,
              "content": "She’s not ok with it although my grandpearants are",
              "id": 12,
              "comments": [
                {
                  "score": 1,
                  "content": "Maybe try half a school year and if your grades and attitude stay up she'll agree to more. I understand not wanting to be away from your children I'm a mom of 4 grown ones, but as a mother you have to make sure you are setting your kids up for success and not failure.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Trust me my grades from the previous years are great a few year ago I was straight d’s on my report card now It all a’s and b’s it’s not grades or anything she is set on her decision and it doesn’t seem like she wants to budge",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Nah\n\nIt's sad to move, but what if she needs to. If you were an adult, you'd have a say, as a minor, you don't really, unless you can afford to stay yourself.",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "Yeah I so pose  that there could be reasons I don’t know about but currently it doesn’t seem like there are any I’m not awear of",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My mother wants me to move and thinks I am being inconsiderate by not moving as her friends live 15 hours away and she wants to move closer to them\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n(Sorry for spelling and gramma in advanced) Me (15m) my mother (45f) me and my s kings live with our mother and grandparents my mother has been talking about moving to QLD in australia for quite some time from where we live currently it’s about a 15 hour drive to there, she wants to move due to most of not all of her friends living there and it’s cheaper to live there in general. When I was told about this I broke down crying as we havnt moved in my hole life and I’d be leaving my friends I have behind   It’s taken me years and years as I’m a introvert and it’s hard to socialise for me with out getting overwhelmed until a year or two ago I only had one friend that only talked to me due to our mothers being friends now I have made a group of friends that so-port me and I get a get a long with and I’ve got the sweetest girlfriend that we will most likely haft to break up if we move my mother doesn’t know about her and I can’t tell her, I love living with my grandparent we’re we currently live a lot of singers I listen to tour here and I love music if we are to move it would be taking away some thing that brings me joy and all of my friends it would be taking away the environment I’ve always lived in and it would be taking away things I love I’ve told my mother that she can move with my siblings to  QLD but I will be staying here although I will visit them over the holidays. every time she brings it up I break down I can’t think of moving with out going in to a break down and we end up in a massive fight over it as her friends are there and my life is here she wants us to move at the end of the year, I want to stay here until I graduate, am I the ass hole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Have you thought of her needs or just your own?\n\nNTA for not wanting to move and thinking of options. \n\nYTA if you don’t consider her needs",
      "id": 19,
      "comments": [
        {
          "score": 1,
          "content": "Half of her friends she hasn’t even met in person and leaves her children in the care of my grandmother and my grandmother has agreed to me staying till I graduate but she isn’t ok with that",
          "id": 20,
          "comments": [
            {
              "score": 1,
              "content": "It’s possible you don’t have all the info. \n\nMaybe there’s a reason she doesn’t trust her parents with watching you for three years. \n\nMaybe she has some depression, etc somis needing friend support.",
              "id": 21,
              "comments": [
                {
                  "score": 1,
                  "content": "Possibly but she leaves my siblings in their care a lot of the time",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. See what options and rights you have.",
      "id": 23,
      "comments": [
        {
          "score": 1,
          "content": "Yeah I’ve been looking in to it recently",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}