{
  "post content": "A while back I was invited to my younger cousin's wedding out of state and I originally had RSVP'd about a year plus in advance.\n\nSince then, life happened and I was going through a bitter breakup myself and allot of personal problems. \n\nBy now the wedding is a couple of months out and I inform her that I will no longer be attending because I was in such a deep dark depression that I didn't want to ruin her special day with my problems.\n\nAm I the @$$hole, here?\n\nEdit 1: The bride is completely innocent in this story. She did nothing wrong. This is based on my guilt of the feeling of selfishness brought on by the depression.\n\nEdit 2: Myself an only child and my two younger cousins (the bride in the story and her older brother) practically grew up together as my aunt would frequently babysit us kids as both my parents worked.",
  "id": 1,
  "comments": [
    {
      "score": 10,
      "content": "NAH. Would you be the asshole if you... Idk... Got a severe disease that would have you admitted to a hospital, for example? No. Depression is also an illness. Do your best to take care of yourself first. \n\nI'd still send the newlyweds a gift tho.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "I did. For the life can't remember what. Something from the Bed Bath and Beyond registry.",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "Great :)\n\nGet better. Cheering for you! ❤️",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NAH. Your mental health will always come first. Do not feel bad for skipping out on certain functions because of your depression. It's not selfish, hell I'd even say you are a very caring person for thinking the way you are. If you need time off, take it. But I would advice you to inform her as soon as you can so she can do the proper preparations. I'm sure your cousin would understand. And two months is more than enough time to prepare. \n\n\nTo everyone else. Guys, the bride hasn't done anything. She isn't the asshole here either.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "nta you gave her enough time before i feel like",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA: you are giving her a good amount of time to sort it out and accommodate. Some people don’t even have the decency to reach out and say they can’t attend",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "Why is the bride asshole tho?",
          "id": 8,
          "comments": [
            {
              "score": 1,
              "content": "Not necessarily the bride, but perhaps anyone that would think this was TA move",
              "id": 9,
              "comments": [
                {
                  "score": 2,
                  "content": "So it's still more of an NAH situation",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH - you gave her plenty of time and presumably she hasn't responded nastily",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA but how do you know you’ll still be depressed 2 months from now. Maybe I didn’t read it correctly.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NAH. A couple months is more than enough time for her to change her guest count with the venue/caterers. Probably should still send a card and gift off the registry.\n\nAre you in the bridal party?",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "No, I wasn't in the bridal party. Just a guest.",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": "Still wouldn't be any assholes if you were in the bridal party. Just would determine how you would want to tell your cousin.\n\nOn a more important note, take care and hope the best for you during this darker time.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA\n\nShe won’t want you ruining it, either. \n\nHope things get better for you.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "INFO: Are you cancelling because you were depressed, you are depressed currently or think you will still be depressed when the wedding occurs? \n\nYou use language in the past tense so yes ywbta for skipping a wedding because you WERE depressed or for anticipating depression you don’t currently have.",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "I cancelled because I was going through depression brought on by my own bitter breakup and other issues the began spiraling downward.",
          "id": 18,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Nah - but of your close to this person you should go. A couple months out you might be feeling a little than you are now. Also going to an event like that might be good for your mental health overall.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    }
  ]
}