{
  "post content": "This will likely get removed, but I’m genuinely conflicted so I’ll give it a shot! My ex-husband (43m) & I (46f) share 2 kids (18m) & (17m) & separated back when they were 3 & 2. We have a child support order in place, but I never held him to as much as the state recommended because I honestly just wanted to be done, & instead signed an agreement for about half of what the calculation was. He only started regularly paying in these last 5yrs through bi-weekly direct deposit (not a formal garnishment just a payroll disbursement), & even made an adjustment because the accountant at his job pointed out 2 extra pay periods a year. Regardless of how much he owed, I’ve always kept my mouth shut because it was just “easier” to accept whatever he was willing to pay. \nObviously, my 2 boys are hitting major milestones with cars, braces, college, etc., & I’ve tried to bring this up only to be promised support that hasn’t come. All the while he has reaped child tax credit benefits (for 1) & no expense when it comes to any visitation since he moved out of state. He sees them, but I still pay half or more of the expense. \nMy oldest is wrapping up his 1st semester of college & I’ve paid the entirety. I’m now paying deposits for the next semester & looking towards fees for the other. Same son also recently had to replace his car due to extensive parking lot damage, which I paid for in full. I’ve let my ex know of all of these expenses & have asked for support but he goes silent or makes jokes (?) about how much anything that comes up must “suck”. \nI can’t cover everything on my own anymore. My oldest’s tuition for Spring is coming up & I’ll soon have 2 kids as the other is graduating in a few months. I’m all but broke. I bring it up & he laughs everything off as a joke because I “make more” than him - even laughed when I said my mom was going to pay for oldest’s dental. I ask for help & am reminded this (his support $) is what I agreed to. \nI finally put my foot down & said if he’s not going to put these boys over his BS with us, then I will argue the agreement that I’ve admittedly not held him responsible to.  He obviously thinks I’m an AH for this. I honestly don’t care what he thinks, but really, AITA for asking & expecting him to finally help??",
  "id": 1,
  "comments": [
    {
      "score": 74,
      "content": "So why haven’t you taken him back to court? That should have been a no brainer here. You’re N. TA for wanting him to pay, but you are for letting him get away with this for so long. It’s bad enough that you signed half away right from the get go, but you then didn’t force him to even pay what you both agreed to on a regular basis, and in full. So he has never really stepped up in anyway until recently and now you think he will? \n\nThere is massive back support he owes and should be required to pay in full even if they are of age. But he won’t if you don’t go through the courts. Get a lawyer and take him back to court! \n\nESH.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "I’m absolutely TA for not reworking the agreement. No question. I’ve tried to make it a point to not let them know about any issues or arguments I’ve had with him. As they got older, I was afraid he’d bring it up instead of trusting they’d make their own opinion based on his behavior.",
          "id": 3,
          "comments": [
            {
              "score": 28,
              "content": "You have denied your children their rightful support to keep up a false image of their father.   The only way they would have known would have been for him to complain to them, which would itself be evidence of his assholey nature.",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I definitely understand wanting them to make their own opinions, as I did the same for my son, not wanting his opinion of his dad be affected by my issues with him. But in the case of financial support, that needs to take precedence. Now that they are old enough to understand, sit them down and explain if you need to. They may be a bit angry at you, him or both. Hopefully they’ll understand. Also, depending on where you are located, the back pay may not come in a big lump sum, but trickle in a bit each month. Think about setting up two separate accounts for each of them to split those payments into. Cause they may not be able to use them for college/university payments right away, but could use them for books, food, rent help and/or incidentals or even fun money while at school. Something to think about.",
              "id": 5,
              "comments": [
                {
                  "score": 2,
                  "content": "I’ve never taken a penny into my primary account. There’s an automatic transfer set up each week to put the money into their custodial accounts.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Awesome!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "yta for taking the easy way out. nta for wanting him to take care of his children.",
      "id": 8,
      "comments": [
        {
          "score": -6,
          "content": "I definitely tried to play the parent who could handle everything without help. I absolutely accept being TA in that sense, but I honestly didn’t know how else to handle everything without being pegged as the bad one. I felt if I kept my mouth shut, they’d see it on their own. Now that they do, I don’t know how to explain I’m not the one who can fix everything, if that makes sense?",
          "id": 9,
          "comments": [
            {
              "score": 9,
              "content": "They would have still seen in their day to day life that you were the parent doing everything. Even if you got court ordered child support from their father.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "NTA. Go after him for arrears. They'll garnish his check.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "ESH but Y.TA for letting the ex skip payments and not taking him back to court a long time ago. Consult a lawyer because you know that guy isn’t going to voluntarily transfer a dime to you.",
      "id": 12,
      "comments": [
        {
          "score": 0,
          "content": "Dude…he skipped payments for “medical reasons” that he ultimately said were LASIK. Trust me, I know I’m TA for letting that go. I’ve just tried so hard to not be the bad one in this whole thing",
          "id": 13,
          "comments": [
            {
              "score": 3,
              "content": "How’s that working out for you now?",
              "id": 14,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "ESH\n\nYou for not taking him to court all these years. Do so now and I know nothing about the law so maybe it will be easy for you to get what you need and I really hope it is but I have an inkling it won’t be. \n\nHim for obviously not paying jack",
      "id": 15,
      "comments": [
        {
          "score": -1,
          "content": "Fair. \n\nFor the first few years, he had absolutely nothing to do with them, visitation or otherwise. I guess I kind of gave up at that point. It honestly irks me now that they’re older & he’s trying to get back with almost none of the responsibilities.",
          "id": 16,
          "comments": [
            {
              "score": 2,
              "content": "I hear you. If everyone were good parents there wouldn’t be any single parents. I can’t speak from personal experience but from my understanding most systems suck. I wish you luck.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "Esh. Had you followed protocol all along you could have had a savings account for these kids and not be in this situation. There is a reason child support is ordered and when people what you have allowed it just influences other non custodial parents to try to pull this crap. Go to court, establish a court monitored CS order and both of you adhere to it",
      "id": 18,
      "comments": [
        {
          "score": 0,
          "content": "I actually did set up automatic transfers each month into their accounts for what he was paying because I didn’t want it.",
          "id": 19,
          "comments": [
            {
              "score": 2,
              "content": "But you had a fraction of what you should have to put into those accounts because you signed away money that was owed to your children by their dad because in your own words \"it was easier\". \n\nHe's an AH for making it difficult but you're just as much an AH for agreeing to give up money that you and they very much needed for their futures (as you're now discovering) and that wasn't yours to give up. I honestly don't understand all the mothers on here that do this. Now you need the money . . . but you could have had it all along. The courts literally ordered him to pay it to you, and you just said, \"Oh no, that's okay thanks.\" WTF?",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "This is confusing you didn't want him to pay it all but now want him to make it up for not paying it all like you agreed to. Also do you make more than him? You put it in quotes for some reason. I have mixed feelings on these things because you had an arrangement and it sounds like you got custody so maybe you'll just have to pay the kids auto repair. Only because this being confusing and you being so inconsistent makes you just sound like you want whatever seems best for you in the moment, YTA",
      "id": 21,
      "comments": [
        {
          "score": 0,
          "content": "Sorry if it’s confusing, these are raw thoughts as I’m sitting here working & figuring everything out. When they were younger at the time of the original agreement there obviously weren’t the extra expenses. I thought he might grow as they did, & he always pointed out that I made more which is why I put it in quotes. I honestly don’t & didn’t care about the unpaid support, but I thought he would be more involved & understanding as he grew more stable financially & they grew with needs. I hope that makes sense.",
          "id": 22,
          "comments": [
            {
              "score": 1,
              "content": "Yes kind of. Sounds like you don't have the worst relationship with him. Maybe just tell him you were cool about not asking for the full child support early on so you'd like if he helped with a couple big items here and there",
              "id": 23,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH your ex is a major AH for not paying his fair share. You are very lightly the AH for letting him get away with it. You should have had the court force him to pay all those years, even if you didn’t need the money you could have been saving it for it now. You put yourself in this situation, I hope you find a way out.",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "I definitely did put myself in the situation. It’s a weird space when you’re worried about what might get said. I didn’t know how to balance & tried to keep peace.",
          "id": 25,
          "comments": [
            {
              "score": 1,
              "content": "I get it and now you have to pay for that decision. Don’t get me wrong he is the larger asshole by far, but you gotta do what is right for your kids, not keep the peace.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "YTA for not getting what you were ordered to get.  Now one is 18 already and other is about to turn 18 so it might be too late - you might be able to get arrears but you need a lawyer, not reddit.\n\nHe clearly has not taken any responsibility for these kids over the years, and I don't see why it would start now.  He must have thought he hit the jackpot when you agreed to half the amount, and now he is laughing all the way to the bank.  Speak to a lawyer, but that is going to cost you money with no guarantees.",
      "id": 27,
      "comments": [
        {
          "score": 2,
          "content": "She should have nipped this shit in the bud years ago.",
          "id": 28,
          "comments": [
            {
              "score": 1,
              "content": "Agreed. I was too forgiving & worried of what would be said",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "um NTA but if he owes back child support you really should collect that. like he shouldn’t even be claiming a child on is taxes at this point. i think you should start with wage garnishing. they’ll collect the amount hes supposed to be paying plus some for the arrearages",
      "id": 30,
      "comments": [],
      "relation": "Support"
    }
  ]
}