{
  "post content": "I (M 39) have been married to my wife Stacey (F 30) for 5 years and we have 2 children together. I also share 3 children with my ex wife Hannah (F 37). Ever since Stacey and I got together she has made it very clear to me that my 3 children are mine and Hannah's responsibility, not hers. This has worked out well so far, but lately it has been taking a toll on me.\n\nI pay Hannah child support every month, ever since Stacey had our first child she has demanded that I give her the same amount of money each month to keep things \"fair\". In addition, I have to pay for half of our joint household expenses (ie mortgage, utilities, food) and my own car. Stacey pays for the majority of expenses for our children. \n\nHere lies the problem. Stacey has never taking issues with having to care for mine and Hannah's children. She picks them up from school, takes them to activities, and ensures they have everything they need. However, anytime she purchases anything for them, she immediately sends me a Venmo request and demands I cover all expenses related to children that are \"not hers\". We recently went on a family vacation and she demanded that I pay for half of the portion for our children and all of the portion for Hannah's. I told her that all theses expenses are taking a hit in my finances and she didn't seem to care. She reiterated that my children are my responsibility.\n\nTo add insult to injury, she recently started contributing money to college funds for her kids, while Hannah and I have nothing saved for our kids' college. Hannah found out and asked that I start funds for our kids. When I talked with Stacey about this, she said this was fine, but I had to put the same amount of money in the funds she has set up for our kids.\n\nI told Stacey I need her to start paying her fair share of expenses around our household. I cannot afford to pay child support, household expenses, and all these miscellaneous expenses that come up for my kids. It wouldn't hurt her financially, as she makes more than me and could easily spare some money. Stacey blew up and took our children to her parent's house and I haven't heard from her in a day and a half. Am I the asshole for demanding that she pay her fair share?",
  "id": 1,
  "comments": [
    {
      "score": 26763,
      "content": ">I told Stacey I need her to start paying her fair share of expenses around our household\n\nUmmmm....\n\n> I have to pay for half of our joint household expenses (ie mortgage, utilities, food) and my own car. Stacey pays for the majority of expenses for our children.\n\nSounds like she pays for half of the household expenses AND the majority of the expenses related to your shared children. \n\nYTA.",
      "id": 2,
      "comments": [
        {
          "score": 8618,
          "content": "But does Stacey pay those expenses with the “child support” from her husband, because if so, that doesn’t make him an asshole.",
          "id": 3,
          "comments": [
            {
              "score": 11474,
              "content": "I'm guessing she uses that \"child support\" to help with those costs, yes. It honestly sounds kind of like a way to force him to actually contribute financially to his own kids because he doesn't seem willing to do it otherwise, because \"she makes more\". So yeah, he's paying \"child support\", aka contributing financially to the children he lives with.\n\nHe's still an asshole because he's expecting Stacey to:\n\n- Take care of their kids and his kids with his ex, five in all, with all of the time and mental load that requires, in addition to having a regular job\n- Pay for half of their household, half-ish of their own kids *and* some portion of his kids with his ex, including vacations and whatever daily costs that come up with them\n- Contribute all of the funds to their kids' college funds, and let him only contribute to three of his five kids' college funds\n- …and accept this as fair.\n\nStacey however should probably be paying more of the mortgage if she's making nearly double what he is making, but his expectations still make him an asshole.",
              "id": 4,
              "comments": [
                {
                  "score": 2809,
                  "content": "I would usually agree with her paying more if the mortgage BUT I need info: is the house larger, therefore more expensive, to account for his other children? If do I think half is more than fair...",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1142,
                      "content": "If she's a joint owner with him, this doesn't make a huge difference because she would still be co-owner of a larger and thus more valuable house. The question is whether she would own a bigger portion of it if she contributes more. That would also need to be addressed.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 865,
                  "content": ">Stacey however should probably be paying more of the mortgage if she's making nearly double what he is making\n\nAhhh, but their mortgage is likely more expensive than it could be because his 3 other kids living with them part time means they need a larger house...",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1918,
                      "content": "In a sense I agree that she shouldn’t have a larger cost to support his children (with ex). But on the other hand, Stacey seems unhappy to be in a blended family and her insistence on making sure everything is split right down the middle or in thirds to make it “fair” seems to be hurting the family. Why did she marry a man with 3 kids if she wants to constantly point out that they aren’t her responsibility? I get that she’s doing things for them but also makes sure OP knows that he owes her for it. \n\nDo the kids witness these $ exchanges? Is OP being rung out of every dime he has so each mom can make sure no one is getting more than she is? They really need to sit down and discuss what family means to them, and how to share finances in a way that’s more equitable than “fair”.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 684,
                  "content": "I think the main problem here and something I've noticed recently in this sub is the lack of clarity in the division of labor among blended families. The way this frustration was communicated to his wife is what makes him the AH here. One side will either \"nacho\" (not my kid not my problem), or one side will set a reasonable boundary like this one and the other will push it to inconvenience the other to see what they can get away with. \n\nReminds me of a recent one about stepkiddos needing dinner, the father demanding their stepmother make them something, she couldn't because she was working, he left them hungry and INSTRUCTED the kids to badger their stepmom for food, and he blew up on her when she got them take out. \n\nOP's wife set the boundary that she is NOT paying for stepkids activities/food/cloths/etc and that OP needs to contribute to HALF of their shared childrens activities/etc. OP AGREED to this arrangement (a fair one I might add) and is now pushing back because he's feeling the pressure. \n\nInstead of demanding she contribute, you both need to sit down and come up with a less stressful way to communicate about finances. Maybe a monthy budget for all kids activities. 250 for bio kids and 500 for step kiddos from OP. These are examples obviously, IDK what their extra curricular activities are, if they are in a HCOL area, many factors, yada yada.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 271,
                      "content": "Yeah I've noticed that like 85% ish of the posts here boil down to \"learn to communicate like adults\" and/or \"get some freaking therapy.\" \n\nI think OP and his wife would do well to sit down with a couple's counselor and probably also a financial planner. \n\nSo I'm going to go NAH based on the bit we've seen because I think they just need to communicate more effectively.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "🏅🏅🏅\nIs this how poor people give awards??",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "yeah it sounds like Stacy has excellent boundaries, and so did the lady who was working and the husband played his little game.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "You obviously have a blended family too if you know about Nachoing. Blended families are hard work! 😀 and my partner doesn't have kids of his own.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 397,
                  "content": "How could he possibly be bitching about his current partner not paying expenses for his other kids?!",
                  "id": 14,
                  "comments": [
                    {
                      "score": 218,
                      "content": "Seriously. She's not their mother; they have a mother.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I'm sure he has some excuse to complain about it; these guys always do. Good on Stacy for seeing this far into the future and calling it.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 151,
                  "content": "Stacy would presumably be living in a smaller house (3 bedrooms needed for 2 children, one parental bedroom) with a smaller mortgage than the one she is currently paying for (assuming 6 bedrooms so the five kids each have their own room. Am assuming this because OP would be all over “Stacey even makes them share rooms when they stay with us! She won’t pay half or more on a bigger house for all my kids!”) So OP’s family obligations require a 6 bedroom home, Stacey’s family would require half that many.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 81,
                      "content": "This is true, but I do think this is kind of where the boundaries become more complicated. Because even if the kids aren't her responsibility, she did marry him knowing he had three kids already, which meant they would be a part of their family – just not her financial responsibility. I would think she also sees them as part of her family (or at least extended family), since she seems to care for them and all that.\n\nBut yeah, it's a good point. She is already contributing financially to them in a way, and definitely contributing her time.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "And OP only pay’s half the grocery bill, so she’s also contributing 50% of the cost of feeding his three kids on top of half the mortgage on a house larger than they would need if he didn’t have 3 other kids, plus the time and cost of driving them around.\n\nShe’s already paying and doing enough for his kids - OP is TA.  Fancy getting butthurt because she didn’t want to pay 50% of the cost of taking his kids on a holiday?",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "[deleted]",
                  "id": 20,
                  "comments": [
                    {
                      "score": 156,
                      "content": "But all 5 are his. Not just the 3 from the other mom",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "It depends on how big the house is.  If they were divorced, Stacy could make due with a 3 bedroom house because she has two kids. OP would need to house 5 kids and him during the time he has them.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "Well put",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "[deleted]",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2243,
              "content": "Yeah, the big problem here is the \"child support\" to your current wife.  That's just fucking insane. \n\nAlso, this is why I'm so happy that my wife and I have the same outlook on financials.  Because all the posts here about separate finances are just fucking exhausting. \n\nLike honestly, who cares who pays for what.  If your partners car breaks down and they can't afford to fix it, is your response going to just be: \"Well tough shit, guess you're walking\". \n\nOr will they be stuck on a diet of mac n cheese while you're eating steaks because they can't afford more in groceries?\n\nIf you're in a relationship where the answer to either of those questions is a yes, then you shouldn't even be in a relationship. \n\nIF the answer is no, then again, it doesn't matter where the money is coming from.",
              "id": 25,
              "comments": [
                {
                  "score": 580,
                  "content": "It's being framed as child support but it's just a way of distributing money based on who's in charge of that task. It's no different then the monthly expense I 'give' to my boyfriend to pay my percentage of the rent, groceries, and utilities. OP is responsible for paying for those child's goods for the month but, she is the one going out and physically spending the money on them so this is how they decided to do that.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 262,
                      "content": "When OP wrote that Stacey demands child support as well, I took this to mean that it’s an expense that he has to pay to her before all the other household bills are split. It sounds like if OP had not been married before, or did not have child support to pay, then Stacey would just expect to split everything and not be handed “child support fairness” cash.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 200,
                  "content": "Seriously!! Posts like these are depressing AF cause it just seems so exhausting. It's important to be on the same page financially, I get it. But these posts make it sound like each partner is 'saving' for themselves, and not for the shared life together. \n\nI mean, splitting costs for raising your children seems batsh\\*t crazy to me....",
                  "id": 28,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Yeah, exhausting really is the best word. \n\nLike, I have two step kids with my first bio kid on the way. \n\nVery early on , like years and years ago before we were married she paid for most of the things for her own kids.  But now?  Like it literally doesn't matter.  If I buy tickets for everyone, that just means she has more money left to buy whatever we need the next time... or vice versa.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 149,
                  "content": "Same honestly they post are draining so glad me and my husband share our finances.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 78,
                      "content": "Yea, I got a headache from just reading this post.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "everyone that posts about someone's fair share shouldn't get married and just save themselves all the drama.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I agree people are drawing way too many lines in the sand. Kind of makes me think they don’t trust each other….Then why marry the person?!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Honestly, their marriage is a giant business transaction and sounds exhausting.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I really don't mean to come across as judgmental, because I know it works for plenty of people, but the seperate finances thing just strikes me as nuts every time I read about it here.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah, I just don't get it in like a long-term committed couple. \n\nLike, so what, these people get to save a little bit more because they're not paying a cent more than their fair share... fine great.. \n\nBut what are they going to do with that money?  Invest for retirement?  Who exactly do they think they're retiring with?\n\nThey saving for a vacation?  They plan on going alone?\n\nLike, maybe it gets a bit sticky if you have like a really expensive hobby and want to spend $5000 on something only for yourself when money is already tight, but if the other person is taking issue with that... maybe there's a good reason?",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "SERIOUSLY. I've known married couples where one spouse \"borrowed\" money from the other and had to pay it back. The amount of money was whatever a pack of cigarettes costs. I cannot fathom being so selfish with my possessions and money with my spouse.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 13,
                      "content": "My wife works at a hostel and once had a couple come to pay their bill (splitting it) and one said to the other \"you owe me for that sandwich earlier so I'll take that out of my part\". \n\nI can't even fathom asking my wife to pay me back for a fucking sandwich I bought her. A SANDWICH!!!! Why are these people together?",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeah, it really boggles my mind. \n\nLike obviously with anything, there is going to be exceptions... if one spouse had a gambling problem or something there may be a need to separate finances, but if that doesn't stop, then again that's kind of speaking to larger marital problems. \n\nYou either trust your spouse or you don't.  And if you don't, why be married?",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "\"exhausting\" is what I thought of too. I understand that it's complicated to pay for the expenses related to having a blended family equitably, but the \"your share/my share\" stuff is tiring.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I'm a step parent in a blended family... I think it's only exhausting if you're not really taking that \"blended\" to heart. \n\nMaybe I'm lucky in that my step kids were relatively young when I entered their lives... Fortunately I haven't had to deal with any of the cliche: \"you're not my real dad!\" moments... but like, I don't think my wife would have married me if I didn't treat her kids as anything but my own, and I never expected anything other. \n\nI just don't know how you'd be in that role of a kid for like a decade, but somehow not care about them because they're not technically blood?  Seems odd to me. \n\nObviously it's different if they're already like 15, but then we get back to the finances part.  If you think you're \"saving\" money by not contributing anything to your partners kids... what are you going to do with those savings?  Invest in retirement?  You're sharing that shit when you and your partner both retire anyway.  Go on vacation with your partner?  I don't think so.     \n\nLike sure you're saving money, but your partner is then spending more, and it's all the same pile anyway.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "If there is a thing this Reddit has taught me is that there's a lot of people who should have never continued a relationship with someone with still minor children.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 5,
                      "content": "IT really goes both ways. \n\nAnd I say that as someone married to someone with young kids from a previous marriage. \n\nI can't imagine entering into that relationship without being okay with being a stepdad... like obviously the kids are going to be priority#1. \n\nAnd I could not imagine my wife being with someone who didn't have that attitude.  \n\nBut truthfully, with the divorce rate as high as it is, there's really a lot of people who just shouldn't be in their relationships period.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "So much yes to this\n\nWhen I first moved in with my partner (now wife) we split everything in half. She made close to twice what I made at the time (there's an age gap and she had been working a lot longer than me at that point), so obviously this benefitted her more than me.\n\nFast forward 10 years and I was making close to twice as much as she was. Still split all the bills in half, so obviously this now benefitted me more than her.\n\nNow she's semi-retired and I make maybe four times what she makes in a year. House long since paid off, technically split all the bills like electricity, cable, food etc. in half, but neither one of us really pays any attention any more to anything else. If there was anything she needed but couldn't afford, I'd pay for it because she takes care of other things and in the end, it balances out. I sure as hell wouldn't let her be without a car to drive or be eating steak while she eats ramen because at the end of the day, we're partners. If that's not your outlook, why are you with that person?",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 401,
              "content": "It is highly unlikely that the \"child support\" that OP pays her covers those expenses entirely. It would be nice if he clarified that though. \n\nRegardless, I stand by my vote as his entire attitude here is asshole-y",
              "id": 45,
              "comments": [
                {
                  "score": 21,
                  "content": "He says in a comment he pays $800 a month total for their two kids and has no idea what the monthly expenses really are.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Which, to me, makes it pretty clear why Stacey isn't willing to have a joint account with him.\n\nOP seems pretty clueless as to what children cost.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "It makes him an asshole if he's demanding she pays more yes...",
              "id": 48,
              "comments": [
                {
                  "score": 97,
                  "content": "The more comments he puts in, the more his story falls apart. I do agree with you",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Does OP pay Stacey for caring for his children? Because according to the post, she appears to be the children's primary caregiver in their household.",
              "id": 50,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I was all ready to say NTA and why pay child support to your wife for kids you are already supporting BUT then he acknowledged that she pays the majority of the kids’ expense as well as half the household expenses.  She’s already paying her share.  It sounds to me like there’s a lot more to this story and husband has a history of being irresponsible with money and taking advantage of her.  She’s trying to keep financial issues outside of the relationship and protecting herself and her children.  I can understand that.   And how is it the wife’s fault that he and his ex have done nothing to save for their children’s future?\n\nLook I know a marriage is supposed to be all kumbaya and what’s yours is mine and as long as we’re together yadda yadda.   That’s just not how real life works.   It might seem cold and kind of mercenary but I get it and don’t blame her.",
              "id": 51,
              "comments": [
                {
                  "score": 9,
                  "content": "Yes, the more questions he answers the worse the whole things soundS. If he had listed actual dollar amounts it might help his cause, but he did not. It sounds like he had children he can’t afford.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I reckon she just framed it as being like child support when he asked why he had to contribute X amount. I get the impression he just doesn't realise how much his kids cost, and she handles everything finance and organisation wise.",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Stacy is the current wife so he doesn’t pay her child support. They have two children together that live with them and they are both responsible for. His other children live with his ex who he pays child support to.",
              "id": 54,
              "comments": [
                {
                  "score": 13,
                  "content": "No, per the post, Stacy makes him pay the same amount of child support to her as he pays to Hannah",
                  "id": 55,
                  "comments": [
                    {
                      "score": 39,
                      "content": "That’s not child support. That’s in putting money to raise his children who live with him. She wants him to pay his fair share. And considering she covers most of their children’s expenses, you have to wonder how much he actually gives towards that.",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "well technically, if she uses the child support to help her pay for their expenses and they both share household, then him demanding her to put more money does make him the asshole because the current status quo would be the fair cut.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Op says that Stacey pays for the majority of expenses for their children. Even with paying her “child support” this sounds like it would balance out to be even. Health insurance, food, clothes, activities, etc add up very quickly.\n\nOp, YTA. If you want a more equitable relationship, then discuss splitting shared expenses, like the mortgage (not your personal car), based on your individual incomes.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1010,
          "content": "ESH.\n\nAm i the only one who thinks **paying child support, to your current wife, that you live with, and raise children with, is fucking stupid**? That's not how child support works.\n\nThis all sounds overly complicated and sloppy. A marriage is a partnership.\n\nOP pays child support from previous marriage.\n\nOP sets up, and contributes to a college fund, equally, to all his children. His ex wife, and current wife are free contribute as much as like.\n\nOP and his wife, split the cost of living, of raising their children, in their home, together.\n\nCurrent wife isn't comfortable paying for the half-siblings from another marriage (when they visit), so she doesn't. This is fine.",
          "id": 59,
          "comments": [
            {
              "score": 752,
              "content": "Sounds like current wife knows OP can’t be counted on to manage finances fairly so she ensures she gets what she needs",
              "id": 60,
              "comments": [
                {
                  "score": 364,
                  "content": "Bingo!  He said that she wants to make sure that he spends the same amount on his kids with her as he does with his others.  Because you know if she didn't make him pay, she'd be footing the total cost.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "yep this is clearly what she's doing, smart of her because I see so many women post here and other places and they're basically covering costs AND childcare while the dad sits back and blames child support to the ex for why he can't contribute as much.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Yep, I think she’s worried about their children not having the same treatment as his bio kids in terms of access to finances (food, extracurricular, clothing, etc). I don’t blame her for this based on how OP described the situation. The fact that she seems to be the primary parent when his kids are at their house solidifies that to me. YTA OP, if she had kids from a prior relationship would you act differently?",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "This x 1000",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Exactly. OP sounds extremely selfish and his wife is smart enough to know that if she doesn’t ask for “child support” she’d be stuck paying for the kids on her own because she makes more money.  I actually wonder if he specifically chose her because she had money and could take care of him. Some men want a mommy and not a wife. He sounds like one.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Which begs the question why she married him if she knew this.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 418,
              "content": "Stacey set up the college fund for her kids. The ex wife found out somehow and demanded OP set up one for their kids. All Stacey asked was that he contribute equally into the kids college funds and not just the one for his children with the ex. I don’t think that’s an unreasonable request. Why should she be the only one contributing to their shared children’s funds while he contributes only to his children with the ex wife?",
              "id": 67,
              "comments": [
                {
                  "score": 130,
                  "content": "Yeah it sounds like Stacey is only asking OP contribute the same to their shared kids as he does to his other kids. She isn't asking him to match what she spends on them, just what he already spends on his other kids. Making it fair. He shouldn't take advantage of the fact that she makes more and contribute less to some kids than he does to others.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 31,
                      "content": "And basically I think that's Stacey's whole schtick - either she suspects or knows (from experience) that OP and Hannah are going to take advantage of the fact that she makes more money.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "I’m curious as to how his ex even found out about the college fund",
                  "id": 70,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I'd put money on OP complaining to Hannah about it",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "More important question is why Hannah thinks it's OP's sole responsibility  to provide  the college funds. Hanna and OP should be covering that together for their children. Also Stacey's request to match the contributions, are reasonable, however, there must be a common ground so noone is struggling financially. Either way, OP  needs to cover for 2 set of kids, and that sound like a financial disaster in it's own right.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 323,
              "content": "Tbh I think what she’s asking for is fair. She’s the one doing all the labor for their and her step kids. My guess is he pays “child support” to her so that she doesn’t end up solely supporting all 5 of his kids and half of house hold expenses which I think is what OP is angling for her to do.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 264,
              "content": "I think OP calling it ‘child support’ towards current wife’s kids wasn’t accurate. It’s more of a living allowance for them, which makes sense. To me, it all read as an itemized bill of their family budget, and it was reasonable. \n\nWhat I read from the post was that OP was realizing he couldn’t actually keep raising all of his kids at the same standard, because his wife could provide more towards their common children. Which will happen, given that not all parters are situated similarly. \n\nWhat made him an AH for me was that he is demanding that all of his kids have the same resources, but that’s on him and his ex’s to provide. Yeah, it seems unfair to the kids, but that’s not his wife’s responsibility.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "I think she’s demanding “child support” because otherwise he’s not paying towards anything for his children. \n\nIt feels like (from the wording of his post) he expects her to pay for everything for their kids and he’s unhappy that she’s not also paying for the step kids when she takes them out. \n\nI kinda feel like he’s bleeding her dry and she’s trying to draw a line. And also he doesn’t seem to be investing in his children. It’s kinda bad if you have 5 children but only pay for 3 of them. She’s trying to be a responsible parent and partner but he’s only doing what he’s being forced into. \n\nThe situation is grim.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "It is stupid they have a joint account for utilities, food etc. Money for kid related expenses should go from that account and child support is exactly for that. So having a joint account AND paying child support to current wife is mad. Other than that rest is fair.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "He hasn’t set up a college fund for any of his kids though. His wife did for their 2 kids.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": ">Am i the only one who thinks **paying child support, to your current wife, that you live with, and raise children with, is fucking stupid**? That's not how child support works.\n\nIt's not literal child support, it's a baseline amount for OP to contribute.\n\n>OP and his wife, split the cost of living, of raising their children, in their home, together.\n\nThe wife is putting her kids in private school and whatever luxuries and advantages she can financially provide. She started the college fund herself.  OP still pays the baseline amount so it is equitable with his other kids.",
              "id": 78,
              "comments": [
                {
                  "score": 10,
                  "content": "Right, she's  paying way more than OP for their 2 children's upkeep.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": ">paying child support, to your current wife, that you live with, and raise children with, is fucking stupid?\n\nSupporting his child = *child support,* even if it's not the normal usage of the phrase.  Otherwise, OP would leave his wife to pay everything for the kids she has with him, while he looks after the others.\n\nA wild conjecture here: the wife's approach might be non-standard for the average family, but it is fair and deeply *functional -* as an engineer, computer type or maybe a finance person might see it. It would also explain the salary difference.\n\nI don't think it's stupid at all.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Honestly, the whole situation really just sounds like he doesn't want to take care of any of his kids.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "She also makes double the salary so I think household expenses should be based off income not split in half.",
          "id": 82,
          "comments": [
            {
              "score": 362,
              "content": "Yes, but OP needs to have a conversation approaching splitting mortgage and utilities based equitably on income, rather than equally on cost. Not presenting it as his wife needs to \"contribute her share\". Because as it stands, she is.\n\nETA: And that doesn't mean her contributing financially to his and his ex's children. Which, the way OP is presenting it, seems to be what he's asking for.",
              "id": 83,
              "comments": [
                {
                  "score": 186,
                  "content": "I would agree with this except she seems to do most of the labor when it comes to the Kids … so she’s supposed to do all the work AND pay more?",
                  "id": 84,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Right?",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "A lot of their household expenses are supporting the other kids. So it is not a simple math problem.",
              "id": 86,
              "comments": [
                {
                  "score": 9,
                  "content": "I mean, if we don't talk about the income disparity, he's already got more children there that he's responsible for than she does. If it was just their shared children, with separate finances he should be covering half the costs (himself, and half of the kids he shares with Stacey). But not only that, he has 3 other kids there presumably half the time, that he is responsible for... So in fairness he's responsible for the expenses and bills relating to these three kids, but half of all the other expenses and bills.\n\n50/50 is a good deal!",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "why? am I suddenly using 2/3 instead of half of the utilities because I have a better job? lmao no...I use half so I pay for half... and op can get a better job or maybe not have kids in the first place that would cause him so much financial grief with child support... his wife is taking care of FIVE KIDS so she should deserve some sort of compensation, especially since the majority of those kids aren't even hers",
              "id": 88,
              "comments": [
                {
                  "score": 63,
                  "content": "So get a room mate and not a spouse. It's fair, but that's also not a partnership",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "Good point. However, I don’t wonder if Stacey made her conditions clear about each of them paying half for the household and “her” children prior to them having said children. I doubt she developed this position recently. If that’s the case and OP readily agreed, then he’s a major AH for crying poor all of a sudden\n\nEdit: thank you for the award kind stranger.",
              "id": 90,
              "comments": [
                {
                  "score": 10,
                  "content": "He says in comments that he agreed to all of this before marrying wife #2 and having kids with her. He just thought she'd relax her rules after a couple years. So yeah, he wants out of the agreement he made, making him TA",
                  "id": 91,
                  "comments": [
                    {
                      "score": 7,
                      "content": "So OP miscalculated and now crying foul.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "How in the world is this logical to you? Does 1 gallon of water magically cost less because you make less vs another person making more?\n\nAlso as far as the mortgage goes, why should she pay more because of her income? The court will rule 50/50 on the house even if she paid 450k vs his 50k. The caveat being it’s her house and not a shared marital asset.",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 120,
          "content": "But they're married... Why is he paying his wife child support? That's for when the parents are seperated because one parent will have them more usually and hence forth incurs more expenses, no? This seems like a wierd business transaction and not a partnership.\n\nEta -  everyone should pay their fare share, I just haven't heard of a married couple where one pays the other child support while they're still married and living together under the same roof. If he's being a dink with the money then yes he's an AH but it seems like they both care more about money and nickle and diming each other. Perhaps it's time to sit down and decide whose going to cover what and how much each is contributing to those things. Seeing things on paper can make easier for everyone to truly understand the bigger picture. Then they decide whether one party isn't paying their fair share.",
          "id": 94,
          "comments": [
            {
              "score": 82,
              "content": "I just want to add that not only is it insane he’s paying his current wife child support. \n\nHe’s also paying her the same amount of child support as he is his ex-wife. He has two kids with current wife and three with ex-wife.",
              "id": 95,
              "comments": [
                {
                  "score": 49,
                  "content": "He said in comments he pays $1200 to ex, $800 to current, meaning $400/child per month. He just wants her to cover all expenses for the 2 children he shares with current wife, and all expenses when she also has his 3 other kids (because she provides childcare, transpoetation, cooking, and shopping for whatever kids are with them) and leave him out of it. He want to pay his half of household bills, and child support to the ex-wife, and be done. He promised Stacey she wouldn't have to contribute to his 3 other kids when they married, and when they had kids. She's just demanding \"child support\" from him\n\n1. To cover expenses for his 3 kids when she's taking care of them\n2. So she's not the only one paying for her kids.\n\nIf she divorced him, she'd get at least that much, and she'd only have to care for 2 children instead of 5, on top of her full-time job. He didn't think she'd hold him to the agreement he made her repeatedly, and \"paying her fair share\"  really means \"paying everything for our 2 kids, and some towards my 3 kids that aren't yours.\"",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Maybe it’s same amount per child and not exactly the same?",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": ">I just want to add that not only is it insane he’s paying his current wife child support. \n\nIt's not, because it's not literal child support.  If it costs $2000 per month for Stacey's kids, he's only paying $200.\n\n>He’s also paying her the same amount of child support as he is his ex-wife. He has two kids with current wife and three with ex-wife.\n\nIn another comment it's only $800 a month for Stacey and she's putting her kids through private school.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "She's making sure he contributes to his kids with her, not just foisting all those costs off on her.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "I am stuck on the part where he says Stacey expects him to pay her child support, though?",
          "id": 100,
          "comments": [
            {
              "score": 190,
              "content": "She just wants him to pay his fair share for his two kids with her, which he definitely does not.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "YTA for sure. I’m really curious what the missing reasons are for this arrangement in the first place. My theories: \n\n-He didn’t contribute anything to his current wife for their children’s care at all. Leading her to request a set amount every month to ensure they were covered\n-He blows his money leaving nothing left \n-He didn’t do any child minding for his younger or older children leaving her holding the bag or \n-She had to take time off for child care during which time she did not have an income\n\nSome additional thoughts:\nCurrent wife is using her extra income to build up  an education nest egg which likely reduces her disposable income further  OP isn’t contributing to this for any of his children yet is mad she is doing that? \n\nShe’s expected to be thé primary caregiver for all five, not just her own that’s time, effort, mental labour and prep all on her. \n\nCosts of housing are likely higher due to older kids ie groceries, utilities, larger vehicles to fit everyone, larger home to fit everyone.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "No no no wait…. I see… sooo you’ve got more kids than you can afford. Got it. YTA.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Wow OP YTA. Can’t do math and is delusional. Stacey already pays majority of the costs for THEIR 2 kids. That’s literally more than what the baseline would be. On top of that, she contributes to ex wife and OP’s kids by providing childcare, time, commitment and basically caring like a second mother to them. OP can’t even do the bare minimum which is providing his share of child care costs for his own separate 3 children 😑",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Stacey pays for the majority of expenses for her kids and does the majority of the childcare. OP needs to realize that if he doesn't contribute more to the kids he has with her, she's eventually gonna realize she's effectively a single mom, and she'll get a better deal by divorcing him and actually being a single mom. No more stepkids, and she will be able to legally enforce OP to pay for the kids she has with him. Right now she's asking, but post divorce she'll be demanding. YTA.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Don’t forget 100% of the emotional and physical labor involved in child rearing too, hey OP YTA",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9124,
      "content": "YTA.\n\nStacey is paying half of the household expenses. Stacey is paying for majority of things for the two children you have with her. Stacey is helping you with childcare for 3 children that are not her own.\n\nStacey does not have to contribute to their college funds; that is for you and Hannah to sort out. It is not her fault that neither or Hannah thought about this until she was proactive about her children's future.\n\n'We recently went on a family vacation and she demanded that I pay for half of the portion for our children and all of the portion for Hannah's'\n\nHow is this unreasonable?\n\nThe only thing that is a little odd is that you're giving Stacey the same monthly amount that you give your ex; this is confusing to me. I suppose it makes me question where this money goes, how much money she lost in earnings when she was pregnant with the two children, who paid the medical expenses etc.",
      "id": 107,
      "comments": [
        {
          "score": 4932,
          "content": "Maybe she thought that was the only way to get OP to contribute towards the financial aspect of the two kids they have together?",
          "id": 108,
          "comments": [
            {
              "score": 2215,
              "content": "That's the vibe I'm getting",
              "id": 109,
              "comments": [
                {
                  "score": 728,
                  "content": "Glad I'm not the only one thinking it",
                  "id": 110,
                  "comments": [
                    {
                      "score": 1622,
                      "content": "He really thinks that she should pay all for their children because he has 3 more...he shouldn't have had 5 kids if he can't contribute to all of them equally.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Same",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 601,
              "content": ">I have to pay for half of our joint household expenses (ie mortgage, utilities, food) and my own car\n\nIt funny how this happens when you're an adult.",
              "id": 113,
              "comments": [
                {
                  "score": 242,
                  "content": "This whole situation is odd...he acts like this is a new situation, like, what was he doing before?! He's 39...he has been an adult for 2 decades! \n\nIt sounds like OP doesn't have any financial sense- and he's unhappy because Stacey is obviously protecting her family's finances from, well, him.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 7,
                      "content": "And adult for 2 decades and already had 3 kids so he should definitely have known kids are money sinks.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "OP's post just implies that there are at ton of issues here and they didn't start when he began to pay Stacey \"child support\". This just feels super weird.\n\nStacey wanting to be paid the same amount of child support as he pays for 3 kids is a bit weird, but I guess that would depend on the amount he pays and whether or not Stacey is putting an equal amount (or more) of her own money into the children's upkeep. (IE, not just or predominantly using the money he gave her.) If she's not paying an equal amount then that would definitely make me raise an eyebrow. If I were OP in that specific situation, I'd worry that this is her prepping me for an eventual divorce.\n\nPlus, if he couldn't afford to pay for 5 kids he should have taken additional steps to ensure that there were no more children. If Stacey wanted kids and he couldn't afford them then well... he needed to either figure out how he'd help support them or break things off.",
              "id": 116,
              "comments": [
                {
                  "score": 225,
                  "content": "According to OP comment he gives her 100 a week per kid. From what my non-american ass gathered is that childcare expenses alone are much more than that which would mean she pays the difference out of her pocket PLUS the other expenses (activities etc). Sounds like he's actually the one not paying HIS fair share.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Ah, that makes sense! Thank you for clarifying that! It definitely sounds like he's not paying his share, then!",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "He only pays 100 per week per kid?!?!?!?! That would barely pay for the gas she uses (assuming with 5 they have a mini van or suv that has horrible gas mileage) to shuttle the kids around. He is so delusional.",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "I don’t think it’s same amount. I think it’s same amount per kid. I think she wants to make sure he’s taking financial responsibility of his kids and not pawning it all off on her.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Thank you! I wasn't sure about that, so this makes sense!",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Stacey was paying 100% for her children until she asked for support for them too.",
                  "id": 122,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Op specifically says Stacey pays for majority of the kids' expenses...implying that the support is the \"non-majority\" portion of his contribution. I'm guessing without the child support, he may not contribute anything to child care.",
                  "id": 123,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Yep. She knows a slippery slope when she sees one. She’s already making lunches and driving to school and taking them out shopping. She’s not DENYING the kids equal treatment, she just wants ONE of their parents to step up and pay. One day it’s crayons for school. Then it’s shoes. Then it’s college funds. And every dollar that goes to the step kids isn’t going to her kids. Which, maybe it’s selfish, but it’s biological to prioritize your offspring’s present and future.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "It also sounds like his ex has some bullshit competition with his current wife. She was perfectly fine with their children having no college savings until she found out his current wife had started saving for the 2 youngest.",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Stacey is a boss bitch and we should all strive to be like her.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1582,
          "content": "Someone left a really good comment basically stating OP and Hannah thought that because Stacey is the breadwinner she would support their kids too or at the very least let OP off the hook with his two kids with Stacey so all his money could go to the three with Hannah. \n\nI think this is really it. He assumed because Stacey makes bank she’ll take care of everything for them and he’ll send his money to the other kids. Stacey is smart as hell making sure not only did that not happen but that he also supports their kids equally. \n\nHe said somewhere that he was good with Stacey being a stepmom and not having more kids but had to agree to more kids because she wanted her own to get him to marry her. Honestly sounds like he wanted a sugar mama and it backfired.",
          "id": 127,
          "comments": [
            {
              "score": 398,
              "content": "Ooh - that makes sense. If he didn't want more kids and couldn't afford more, then he should have just let her go.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 313,
              "content": "If Stacey was smart as hell she honestly wouldn't have married him, let alone had kids... but hey is never too late.",
              "id": 129,
              "comments": [
                {
                  "score": 362,
                  "content": "Well this is true lol \n\nHe says in some comments Stacey was hesitant to marry him at all and he had to convince her by agreeing to more kids and splitting finances. Guess he was convincing enough but wanted her to just forget about it eventually. His plans seemed to just backfire all over the place.",
                  "id": 130,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 41,
                  "content": "Their age gap isn't huge but given they've been married 5 years and were probably dating at least a couple years before that, Stacey was 22/23 when they met. There's usually a reason that men in their 30s go after young women barely out of college, because they don't have as much life experience to recognize red flags.",
                  "id": 131,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Stacey has wised up.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Can all of us just give a round of applause to Stacey and her shiny backbone?",
              "id": 133,
              "comments": [
                {
                  "score": 26,
                  "content": "Seriously. Stacey is an icon for all women. My hero.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Wish I had an award for you! This! All of this!",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Wow good on Stacey for seeing that and demanding the same. To add in another comment OP says he pays 100 per week per kid. So is only giving Stacey $200 a week and she pays everything else for their children together. OP really tried to squirrel away the important info.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Exactly! I noticed he called his kids with Stacy “her kids” and his kids with Hannah “our kids”. That kinda sums up how he thinks of things.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 675,
          "content": "OP is doing the math like his two children with Stacey are only Stacey’s children. He says that Stacey “pays the majority of expenses” for their children, even though he gives her the same amount he gives Hannah in child support every month. OP calls it “child support” to make it sounds like Stacey is in the wrong, but essentially he is just contributing to his children’s expenses. What OP wants is for Stacey to pay for *their* children and for him to only contribute to his kids with Hannah. That’s what he thinks is “fair.” I get that he doesn’t have very much money leftover after paying household expenses, child support etc, but no one forced him to have five kids. The only area I see wiggle room in is to split household expenses proportionally, as a lot of couples split expenses equitably and not equally, but it’s not wrong for Stacey to want an equal split if that’s what they agreed to.",
          "id": 138,
          "comments": [
            {
              "score": 429,
              "content": "He straight up calls them \"Stacey's kids\" and goes on to complain that she won't buy his kids with Hannah the same things she buys \"her\" kids, that he expected her to step up financially but that it's OK that Hannah \"barely scraps(sic) by\", and worst, that he would have been happy with her just being a stepmom but she insisted in being a mom so he agreed to kids to get her to marry him.\n\nDude should have had a vasectomy a long time ago, his attitude is gross.  Stacey would be better off without him.\n\nIt sounds like he's one of those divorced dads who wants his new wife to pick up all the slack.  Stacey does a lot for his kids but I guess he expects her to pay for them too.",
              "id": 139,
              "comments": [
                {
                  "score": 208,
                  "content": "The part that gets me is that he doesn’t think she’s covering her fair share. If he wants to ask her to financially help out because he’s struggling that’s one thing, but he really thinks she has a financial obligation to his kids.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 179,
                      "content": "He isn't willing to hold Hannah accountable for her kids, but he wants to make Stacey responsible for all of them.  And it sounds like she's a good stepmom and does a lot for them, but she is prioritizing financially supporting her bio kids, which she should!  It sure doesn't sound like OP is going to do it.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 320,
          "content": "This isn’t odd to me because he pays child support to Hannah and if Stacy hadn’t demanded equal money, it sounds like she would be covering 100% of the kids they have together.",
          "id": 142,
          "comments": [
            {
              "score": 80,
              "content": "That's what I think too tbh.",
              "id": 143,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "And I wonder how far it went before she had to hold her ground like this top. What was OP expecting?",
              "id": 144,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "OP states that Stacey pays for the majority of expenses for their children. I assume this comes out of what OP pays her in “support”.",
          "id": 145,
          "comments": [
            {
              "score": 170,
              "content": "I doubt his “child support” in enough to cover private schooling, otherwise, the other three would also be in private school. So, she probably pays a good deal more for their kids.",
              "id": 146,
              "comments": [
                {
                  "score": 89,
                  "content": "It doesn't. He just doesn't want to pay for his children with her because she has money. He actually feels she should be paying for the kids he had with Hannah too.",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "OP pays Stacey $100 per child. Stacey is definitely footing the lion’s share. If OP was a single dad he’d have had a heart attack by now at how expensive it is to raise one child, let alone 5. $100? Good luck",
              "id": 148,
              "comments": [
                {
                  "score": 16,
                  "content": "He’s in for a rude awakening when Stacey wises up and divorces his ass.",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Ding ding ding! Everything you said is spot on. Nothing Stacey has asked for is unreasonable. She is paying more than her fair share and doing more work than he is with all his kids. \n\nTo the dad of 5 OP, YTA. Stacey has every right to ask you to contribute to college funds for YOUR kids with her if you're going to contribute to funds for your kids with Hannah. All 5 of them are your genetic responsibilities. If you couldn't financially handle raising 5 kids, you should have used better birth control, my dude.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I'm confused why someone who's struggling for cash is going on vacations in the first place. Op sounds really irresponsible with money, it's no wonder his wife wants to keep it separate.",
          "id": 151,
          "comments": [
            {
              "score": 5,
              "content": "By the sound of it he expects Stacey to foot the bill.",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6839,
      "content": "YTA- \n\nStacey pays for half of all the household expenses (fair) and most of your SHARED children's expenses... That makes you the AH... They are your kids... Why is she paying for most of what they need? \n\nYou also owe child support to your ex... Which you are paying...... But then you're upset about financially supporting your two kids who live full time with you... \n\nSo let me get this straight.... Stacey does most of not all of the child care. Stacey does her fair share of household care... Stacey covers her part of the expenses... \n\nStacey starts college funds... And you figure out oh crap we should do that and you then freak out because you have to contribute to five kids college funds? Like duh... You have five kids..  \n\nYou take your kids on vacation and don't expect to pay for your 3 kids... You expect Stacey to pay for your 3 kids? And care for them? Naw\n\nWhat are you bringing to the table here? Is it just more children you can't afford to support and don't do the work to care for?",
      "id": 153,
      "comments": [
        {
          "score": 2052,
          "content": "Does OP think he wouldn’t get hit with child support if Stacey leaves him?",
          "id": 154,
          "comments": [
            {
              "score": 1100,
              "content": "I wouldn't be surprised if this is Stacey prepping him for a divorce and the child support he would be expected to pay.",
              "id": 155,
              "comments": [
                {
                  "score": 394,
                  "content": "Oh god. Then in a couple years there will be another AITA post: “AITA for wanting my new wife to pay her fair share for our 2 new kids, while I have to pay for 5 others that I have with two different women?”",
                  "id": 156,
                  "comments": [
                    {
                      "score": 45,
                      "content": "This made me lol",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 371,
                  "content": "As she should",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "Tbh I feel like Stacey would almost do better off on her own.",
                  "id": 159,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "He's giving her 100/wk. He'll likely pay MORE than that if they divorce. He's shooting himself in both feet here.",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Tbh, he could end up in a better financial position divorced, because it would cap at a certain amount and it would take everyone’s income into account and the current ordered payments.",
              "id": 161,
              "comments": [
                {
                  "score": 12,
                  "content": "True but also 3/5 kids are likely to get way less support than the minimal support they get now as a result. Not that the OP cares.",
                  "id": 162,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 225,
          "content": "I’m confused. Does he give Hannah the same amount he gives Stacey, and then *also* pay half of everything he shares with Hannah (house, kids, car, bills, holidays)?",
          "id": 163,
          "comments": [
            {
              "score": 285,
              "content": "From my reading OP and his current wife (Stacey) split household/utilities/food in half. OP pays child support to his ex-wife Hannah and pays the same amount to Stacey.\n\nWhat I don't understand is why OP says Stacey pays the majority of the expenses for the kids if he's also giving her money for specifically child-related expenses. Does what he gives her specifically for the kids not cover half of those expenses? Is he not equally contributing to the care of the children he lives with?\n\nRegardless, the crux seems to be that Stacey isn't happy to cover the expenses for her step-children in addition to those of her children and asks OP to repay her for money she spends on his kids/her step-kids. OP doesn't think this is fair, and wants her to pay for his kids as well, in addition to being the on who provides most of the childcare, which is why he's getting all the YTA votes.",
              "id": 164,
              "comments": [
                {
                  "score": 111,
                  "content": "The amount Stacey is paid for \"child support\" probably does not cover half of the child-related expenses. It may not even cover half of day care, much less clothes, shoes, food, toys, books, toiletries, medical insurance, medical care, and any extracurricular activities (sports, classes, etc); which OP freely admits she pays the majority of.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Because OP is complaining about how his \"finances are taking a hit\".\n\nHe can't afford five kids, so he's leaving Stacey to pick up  when he doesn't have enough money to pay for his car and other expenses. She, in turn, is going to OP since he agreed with her that his three children with Hannah are only his responsibility. Stacey should NOT have to pull money out of her pocket when the children who are not biologically hers have a mother.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "He wasn’t contributing to Stacey’s children equally with his own which isn’t okay.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 146,
              "content": "That is how I read it, and I'm not understanding all the yta votes, assuming my reading comprehension is correct.",
              "id": 168,
              "comments": [
                {
                  "score": 392,
                  "content": "All the YTA votes are because OP says his wife currently pays the majority of the expenses for the kids they share while splitting the rest of the bills equally. Even with his contribution, he still says she pays for the majority of child-related expenses, so he's not paying half for the kids he has with her and he now wants his current wife to start covering expenses for his kids with his ex.",
                  "id": 169,
                  "comments": [
                    {
                      "score": 72,
                      "content": "> All the YTA votes are because OP says his wife currently pays the majority of the expenses for the kids they share while splitting the rest of the bills equally.\n\nYes, OP is feeling like he has a bit of money to pay in child support to Hannah, so he figures that Stacey can support **both of their children on her income**. Instead, Stacey is seeing this for what it is and has been sick of OP's shit already. Stacey made it clear that his children with Hannah are his responsibility. What OP isn't saying is how *often* Stacey is supposed to take money out of her *own* pocket to subsidize the stepchildren when OP \"comes up short\".",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I read equivalent as the same per child.",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "He clarified in comments, he pays $100/week per child. Hannah gets $1200/month for her 3, Stacy gets $800/month for her 2. (The agreement he had to make to get Stacy to marry him, that he thought she'd relax on.) Then he pays 50% of household expenses. He admits Stacy is already paying more than 50% of costs for \"her\" 2 kids, but he'd prefer if she just covered everything for them, plus whatever expenses arise for his other 3 kids when she's also providing free child care for them (in addition to her full-time job) so his money could just go to child support for his 3 kids with Hannah, and his half of household expenses.",
              "id": 172,
              "comments": [
                {
                  "score": 11,
                  "content": "He also left a comment  with the example that they all went out to eat. Each adult paid for themselves, she paid half of her 2 kids (possibly all for her kids, but I can't recall or find the comment again), but expected him to pay for all of his 3 children's meals. He wants to just split the check 50/50 instead of caring who ordered what, etc. Of course, this clearly benefits him, not her.",
                  "id": 173,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "No, the only reason he pays for anything kid-related in his own house is from that “child support.” Sounds like if she didn’t “charge” him, he wouldn’t contribute anything. \n\nThe post says she pays her half of all their bills and the majority of their kid stuff. He’s clearly paying less.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "No she was paying for her two kids and he wasn’t contributing, so she asked him to pay as well and he called it child support",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "He pays Stacy “child support equivalent to what he pays Hannah” for his shared kids, which she uses to pay the kids expenses.",
          "id": 176,
          "comments": [
            {
              "score": 23,
              "content": "Because she was stuck paying for her kids expenses and told him he had to contribute more",
              "id": 177,
              "comments": [
                {
                  "score": 23,
                  "content": "Exactly. If he didn’t pay “child support” to her for the shared kids, she’d be stuck with all of it.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "He expects Stacey to stop contributing to the college fund because his other kids can’t have one. \n\nMy wonder - how did Hannah find out? Those kids aren’t old enough to talk about a college fund to their mom. \nOP told her in one of his excuses as to why he couldn’t pay his fair share to Hannah and Hannah went “Ohhhhhh… a college fund huh? Us too then” and now he’s blaming Stacey. \n\nStacey’s awesome. She’s got her shit together. She’s not going to get taken advantage of and her finances will be sound when these 2 split. Her kids will be OK because she’s a smart cookie who won’t be pushed around. OP is finding out that you marry a woman who has it together and you’ll have to rise to her standard and for guys like him, that’s hard. That’s what’s bothering him here.",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "He brings stress, debt, and resentment to the table.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "And just maybe, if you can't afford to provide for 5 kids, you shouldn't have had 5 kids.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Wtf does OP think happens when you have 5 kids?? I don't understand this",
          "id": 182,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3197,
      "content": "YTA\n\nYou have 5 kids. You’re responsible for providing for their care. That includes a lot of expenses. \n\nStacey is right that she shouldn’t be financially responsible for your 3 kids that you share with Hannah. Any financial stuff regarding those kids should be dealt with between you and Hannah. \n\nIt actually sounds like Stacey does a great deal for her stepkids. She has just maintained a clear financial boundary, which according to you was something she was upfront about from the beginning. She even advocated for them that they should be getting the same college fund contributions as her own kids. \n\nIt is not Stacey’s problem that you are struggling to support your 5 kids. It sounds like she is more than pulling her weight with the household and the kids. I’m not sure why you would ask her to pay “her fair share” when it sounds like she already is.",
      "id": 183,
      "comments": [
        {
          "score": 1050,
          "content": ">Any financial stuff regarding those kids should be dealt with between you and Hannah.\n\nIt's wild that so many people are willing to call Stacey an AH without considering the fact that Hannah can also contribute to her own kids. If OP and Hannah want to provide their kids with more, they can figure out how to do it without Stacey's help. She's already helping with childcare!",
          "id": 184,
          "comments": [
            {
              "score": 288,
              "content": "Exactly! I'd bill the parent of the child I'm babysitting, too. That floored me. Like, of course she expects to be paid back--those aren't her kids!!",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "As a stepmom, I am triggered by this! Those kids have two parents that can contribute to college funds. They should not be relying on Stacey to do so for their kids.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Yep, her children have 2 parents, OP thinks Hannah’s kids should have 3 parents I guess. \n\nThTs why he’s the AH.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Exactly. Stacy is picking up a lot in terms of the day-to-day with all the kids, but Hannah is basically ignoring them because she doesn't seem to want them other than as a means for child support. It falls to OP and Hannah to provide for those three kids. That's not on Stacy.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "That’s because so many people are in the same situation as OP: not being able to fund their own lives and expecting their partners to cover their behinds rather than just being partners.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "OP has definitely made it seem like he sees himself and Hannah as this impoverished couple that this monstrous woman is trying to steal from.\n\nThis would be sooooooooooooooo different if they decided to Brady Bunch it from before they got married, but Stacey made it so clear that she didn't want to be their financial stepmother, and he doesn't seem to have custody.\n\nStacey is smart af.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 350,
          "content": "That’s just it … he SAYS he wants Stacey to pay her fair share (which she is, and then some). But what he *means* is that he wants Stacey to pay HIS fair share.",
          "id": 191,
          "comments": [
            {
              "score": 22,
              "content": "DING DING DING WE HAVE A WINNER. And not OP.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "NAILED IT !!!!!!!!!!!!",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Maybe consider getting a vasectomy if you're not prepared to pay the expenses it costs associated with raising additional children",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "You nailed the crux of the problem here really. He chose to have 5 kids. Stacy isn’t the problem at all. It’s like he chose to have 5 kids and now brings out the shocked pickachu face when he’s expected to pay for 5 kids. The outrage!",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2088,
      "content": "YTA- it sounds like Stacey works outside the home, takes care of your shared children and does a share of child care and chauffeuring for your children with your ex. Pony up and be grateful.",
      "id": 196,
      "comments": [
        {
          "score": 865,
          "content": "One more thing to add...GET SNIPPED OP! 5 kids is more than enough.",
          "id": 197,
          "comments": [
            {
              "score": 392,
              "content": "Yup. Automatically made him the AH here. Don’t have kids you can’t appropriately care for financially.",
              "id": 198,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "Right?!\n\nYou don't like paying for kids, stop making them..\n\nStacey is doing more than her fair share financially and far more than her fair share in regard to childcare. OP is delusional in his phrasing of the title of this post.",
              "id": 199,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "Pony up and be grateful indeed.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1656,
      "content": "YTA\n\nYou have five kids and an ex wife.  She has two kids.\n\n>In addition, I have to pay for half of our joint household expenses (ie mortgage, utilities, food) and my own car. Stacey pays for the majority of expenses for our children. \n\nSo she's already paying the other half and the majority of her children's expenses?  What exactly would be her fair share then?\n\nEdit:  Apparently a bunch of people are still confused.  \"Child support\" is just a baseline amount for OP to contribute.  Stacey, is paying for private school, she isn't asking OP to split that AND pay for Hannah's child support.",
      "id": 201,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1399,
      "content": "YTA. You should have gotten a vasectomy if you can’t support all those kids. Three are Hannah’s and two are Stacy’s but all five are yours.",
      "id": 202,
      "comments": [
        {
          "score": 472,
          "content": "Ha! Literally read your comment after I thought ‘Dude needs to get a vasectomy’.\n\nFive kids? In this economy?",
          "id": 203,
          "comments": [
            {
              "score": 136,
              "content": "IN THIS ECONOMY 🤣\nGoing into a marriage with 3 kids and having 2 more is TOUGH. I feel like there’s always problems and no one is satisfied.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Exactly\n\nLike, save some planet for the rest of us. Jesus",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yeah I really don’t get why he mad. He has two family’s. His ex and his wife each only have one. Of course his money doesn’t go as far. He’s responsible for 5 humans when his wife is only responsible for 2.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1110,
      "content": "YTA. Don't have kids if you don't want to support them.",
      "id": 207,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 746,
      "content": "YTA\n\n>In addition, I have to pay for half of our joint household expenses (ie mortgage, utilities, food) and my own car. Stacey pays for the majority of expenses for our children.\n\nSo, you divide the shared expenses in half, yet she pays for the majority of the kids expenses. What does she need to pay more for it to be fair?? \n\n>She picks them up from school, takes them to activities, and ensures they have everything they need. However, anytime she purchases anything for them, she immediately sends me a Venmo request and demands I cover all expenses related to children that are \"not hers\".\n\nDon't say \"not hers\", because they are NOT hers. She is amazing that she does so much for them, you can't expect her to also pay for them?\n\n>Hannah found out and asked that I start funds for our kids.\n\nMaybe Hannah should use her child support for the college fund?\n\n>I told Stacey I need her to start paying her fair share of expenses around our household. I cannot afford to pay child support, household expenses, and all these miscellaneous expenses that come up for my kids. It wouldn't hurt her financially, as she makes more than me and could easily spare some money.\n\nShe works for that extra money she makes. And from your story, it sounds like you are already dividing the expenses (with her paying more as she is solely paying for your shared kids). It is not her fault that you are making more kids than you can provide for, and its not her job to fix that issue for you. It's between you and Hannah.",
      "id": 208,
      "comments": [
        {
          "score": 448,
          "content": "I feel like he also doesn’t get that Stacey is in fact already contributing to his Hannah children, by paying half the household expenses. There’s regularly 3 people in that household that she has zero financial obligation to. She should logically be paying less than 50%. So, really, Stacey is amazingly reasonable.",
          "id": 209,
          "comments": [
            {
              "score": 83,
              "content": "And all the free childcare she’s clearly doing",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "She probably also bought herself a bigger car so she could ferry around all his kids",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "I agree. I actually don’t see a problem with her asking for “child support” because the agreement was they have separate finances, and she pays for half of everything plus most everything for “her” kids. That’s what she’s using that money for and it sounds fair to me. \n\nShe told OP from the get go that she will not be responsible for his kids and he agreed. Now he’s upset because she makes more money and ”her” kids will have a college fund, and if he contributes to his kid’s college fund the he has to contribute to their kid’s as well. That makes perfect sense! Why would he only give some of his kids college money and not the others? And the vacation thing, that also made sense to me, he pays for his kids (maybe their mom should have pitched in?) and half of his other kids. This is why I hate separate finances, but that’s what y’all agreed on. \n\nI also say YTA. She let OP know that if she was in a relationship with him and he has 3 kids already, that there would be stipulations. If he wasn’t ok with that he should have said so before proceeding. In my opinion (as an outsider but also obviously I don’t know all the info) things seem pretty fair, and she’s even taking his kids to school and to go eat and whatnot, there’s no mention of her not treating them nice which is what you want from a partner, right? She just doesn’t want to pay for their food, which was the agreement before they got married. Plus if he divorced her he would still have to pay child support, plus his other kids, plus himself wherever he lives. And if he contributes for college funds, it should be even. \n\nHaving 5 kids is a lot. It took OP a while to figure that out I guess.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "OP seems to be hurting because of his financial position sees his wife making more and doesn’t have a healthy outlet so of course he would resent this and demand things are not fair. \n\nOP is definitely YTA.",
          "id": 213,
          "comments": [
            {
              "score": 78,
              "content": "He probably should have considered all this before having two more kids with Stacy. Five kids simply cost a lot of money on top of other life expenses. She’s also doing a lot of childcare, which is a cost OP isn’t even factoring in. Honestly, I think OP should be counting his blessings that she’s putting money away for the college funds of his two younger kids.",
              "id": 214,
              "comments": [
                {
                  "score": 16,
                  "content": "Ah. Sounds like my cousin. He’s 40 and just popped out his 5th kid that he most definitely cannot afford. Idiot decided to have 2 more with his second wife while unable to afford CS for the 3 from his first marriage. His entire plan is to harass my brother and I for a portion of inheritance when our father dies. I won’t hear him over the sound of me relaxing with a pina colada in my hand though. Hope my brother is feeling generous because my cats and I will be living the high life.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 699,
      "content": "YTA.  Stacey is paying for half the household expenses, more than half of her bio kid's expenses, *and* saving for her bio kids' futures. She's a badass.\n\nHer step kids have two bio parents involved in their lives. It is not on her to be financially responsible for them. Her bio kids don't have three parents (as I'm sure Hannah doesn't pay for shit for Stacey's kids), so why should Stacey pay anything for Hannah's kids? She's being awesome on not denying the step kids things in the moment, and is keeping OP honest behind the scenes. She's involved in the steps' lives and is supporting them in none financial ways.\n\nOP, though, he's got 5 kids. And it looks like though he sets aside the same amount of money for each child that's then given to the mother, Stacey is able to provide a more affluent lifestyle to her bio kids than Hannah is to hers. Hannah seems to resent this, because a college fund will most likely significantly change the trajectory of Stacey's bio kids compared to Hannah's bio kids. That's an understandable thing to feel envy over.\n\nSo Hannah asks why Stacey's bios have funds but her bios don't. Answer, neither Hannah nor OP ever opened one, but Stacey did. So OP and Hannah should do so now.\n\nTo which Stacey asks why OP should fund 3 of his children's educations, but not all 5? Also fair.\n\nOP, you have two ways out of this without violating your long standing agreement with Stacey. One, you tell Hannah that as Stacey is funding her bios' education on her own, Hannah will have to as well. Or, you contribute equally to all 5 educations.\n\nAnd if you can't keep up with expenses, it's time to re-evaluate either your lifestyle or your job. You either have to make cuts that are agreeable to Stacey or you need more income. You can't blame Stacey for the fact that raising 5 kids is expensive, you chose to have 5 kids.",
      "id": 216,
      "comments": [
        {
          "score": 190,
          "content": "This right here needs to be higher. OP, you decided to have **five** kids. Stacey only wanted two. Your other three children are not her responsibility. \n\nShe already picks them up from school, watches them, and presumably feeds them. She's doing you a solid. \n\nIf you don't have the finances to make your prior three children college funds, you shouldn't have had five kids. Stacey is smart and looking out for her children's future.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}