{
  "post content": "My husband works 4 days a week, 10 hours a day but once a month he has to work the weekend. I work from home, care for the house and our 2 kids. Husband goes to the gym 3-4 times a week for 2 hours each time. On the other days he takes the dog and goes for a run, usually an hour to 90 minutes. I workout at home when the kids are at school or asleep. Today happens to be a weekend day that husband had to work. He comes home, changes clothes and left for the gym, he will be gone for about 2.5 hours. This means that he will get back about bedtime for the kids. Would I be the a-hole if I asked him not to go to the gym after working all day on the weekends anymore? \n\nDuring the week I don't care but after leaving me to care for the kids all day with no break, I find it a bit unfair that he comes home, gets the kids and dog all riled up and leaves 5 min later. I'm left to deal with them being upset that Dad only spent 5 minutes here and almost none of it with them. I haven't had 2 minutes to myself all day and I just want to be able to sit down without having to break up an arguement, get someone food or do for someone else. Just writing this post has taken me almost an hour because I can only write a sentence at a time.",
  "id": 1,
  "comments": [
    {
      "score": 38,
      "content": "NAH.\n\nYou both want different things with regard to your schedules.\n\nYou are married with children.\n\nYou need to work this out. No one here is an asshole, but you need to work out this disagreement and competing priorities.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 36,
      "content": "NTA\nBeing parents is a joint ownership. Unless otherwise discussed he should be there to help out. I’m not saying he shouldn’t go to the gym, but compromise. Instead of 2 hours for four days see if he’ll go for an hour everyday or see if he’ll be able wake up slightly earlier and go before work. \nYou should be able to take a breather too.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "NTA for wanting a present father in the kids life",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "NAH. You can totally ask him to stay home, I'm sure he will understand. That's not wrong at all. As for him, I'm sure he just wants to get some workouts in. He obviously enjoys the gym. He isn't being TA either.",
      "id": 5,
      "comments": [
        {
          "score": 16,
          "content": "I do not think he is being unreasonable for wanting to go to the gym at all. I just think that these work weekends are hard on us all. That's why I asked if I'm being unreasonable.",
          "id": 6,
          "comments": [
            {
              "score": 5,
              "content": "I think you're good. There is nothing wrong (as far as I think) with asking your husband to stay home from the gym a couple times a month to help with the kids.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 18,
      "content": "No, YWNBTA. 7 days a week you're home? It sounds like you're on house arrest!\n\nEven better than telling him he has to stay home, you should assign days where he has to work in his workout after the kids are asleep and YOU get to leave the house for a couple hours.",
      "id": 8,
      "comments": [
        {
          "score": 7,
          "content": "No house arrest. I like being home and during the week it's not so bad since my kids are in school. Weekends we usually are doing family stuff and out all weekend. It's just this one weekend a month that there is an issue. I'm not sure if I'm being unreasonable since I don't have an issue with it any other time.",
          "id": 9,
          "comments": [
            {
              "score": 5,
              "content": "Then yeah, he has to arrange his workouts around family time. Not just dump all the kid raisin' on you and sashay off to the gym for 2 hours of me-time. It's not like he's at the coal mines.",
              "id": 10,
              "comments": [
                {
                  "score": 1,
                  "content": "Not the coal mines but he does have a  very physically and mentally demanding job. So I understand his need for me time.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 1,
                      "content": "And kids are also physically and mentally demanding, aren't they?",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NTA! Your husband is being very selfish. Ask him, if he's a rational person he will agree.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NAH. Your husband works ten hours a day, which is a lot. The gym is probably a good release for him. You understandably don't want to have to parent by yourself all day. It's worth having a conversation about but don't go into it with a \"he's the asshole\" view.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NAH but communication BEFORE resentment is super important. Talk to him!",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA \n\nBut does he usually spend time with kids most of day when he doesnt work on the weekends?",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband works 4 days a week, 10 hours a day but once a month he has to work the weekend. I work from home, care for the house and our 2 kids. Husband goes to the gym 3-4 times a week for 2 hours each time. On the other days he takes the dog and goes for a run, usually an hour to 90 minutes. I workout at home when the kids are at school or asleep. Today happens to be a weekend day that husband had to work. He comes home, changes clothes and left for the gym, he will be gone for about 2.5 hours. This means that he will get back about bedtime for the kids. Would I be the a-hole if I asked him not to go to the gym after working all day on the weekends anymore? \n\nDuring the week I don't care but after leaving me to care for the kids all day with no break, I find it a bit unfair that he comes home, gets the kids and dog all riled up and leaves 5 min later. I'm left to deal with them being upset that Dad only spent 5 minutes here and almost none of it with them. I haven't had 2 minutes to myself all day and I just want to be able to sit down without having to break up an arguement, get someone food or do for someone else. Just writing this post has taken me almost an hour because I can only write a sentence at a time.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    }
  ]
}