{
  "post content": "I (30M) have a wife (30F) and a daughter (7F). I work in finance and my wife is a stay at home mom as I earn sufficient for the both of us.\n\nMy wife is a great SAHM and takes great care of our house. I was lucky to buy a home as I earn well in a medium cost of living city.\n\nI love my wife but she finds it humorous to say that I am incapable of doing household tasks, we had agreed that she would do them when we decided she would stay at home but I do stuff occasionally when we are both home if she asks me to, but then if I say load the dishwasher for her she will claim I did it wrong just because I do it different than she does (it still cleans well).\n\nThe other day we were eating and she told me about her day and how she went grocery shopping and optimized the cost by buying specific items at specific stores and accounting for the cost of traveling to each store and she made an offhanded remark that I would never be able to do that and said it in a \"what would you ever do without me?\" kind of way.\n\nI replied back saying that of course I could do it, I handle complex decisions and calculations at my work as I work in finance and that I have a masters degree and what I do involves more intellect than household operations even though I acknowledged and appreciate what she does, I would be capable if the roles were reversed.\n\nShe got angry and seemed to think I was calling her stupid when I wasn't and then cried and now I feel like an AH. She said she was a very good student and had she graduated she would be in my position as well.\n\nMy wife and I met in college but she was an international student studying physics and computer science and she had issues with her loan from her home country and could not afford to complete it and we got married then so she could stay. Initially she wanted to complete it later after finding the funds but she agreed to be a SAHM when I got a good job and I appreciate that a lot as we were able to have a kid early on even while I was both completing my masters and working full time.",
  "id": 1,
  "comments": [
    {
      "score": 50243,
      "content": "YTA.\n\n> she was an international student studying physics and computer science and she had issues with her loan from her home country and could not afford to complete it and we got married then so she could stay. Initially she wanted to complete it later after finding the funds but she agreed to be a SAHM when I got a good job\n\nYour wife is a very smart woman who probably prepared her whole life for a challenging technical career. And now for better or worse she is a SAHM with no degree or paying job.\n\nIt’s clear that you are proud of your intellectual capabilities and the complex tasks you tackle at work. It is part of your identity and your ego. Your wife has none of that, even though that’s what she wanted. What little source of pride she has (her household tasks), her own spouse diminishes & minimizes. How would that make you feel if you were in her shoes?\n\nWould you consider supporting your wife to finish her degree?",
      "id": 2,
      "comments": [
        {
          "score": 19061,
          "content": "Yeah, if OP makes so much money now, let's see him pay for his wife to go back to school and finish her degree...\n\ntheir kiddo in is school now, so it's a great time for her to look at the local university schedule and see if she can make it work!",
          "id": 3,
          "comments": [
            {
              "score": 5382,
              "content": "Yes, even if it is part time for the first couple of semesters so that she can ease back into it.  She at least deserves the option",
              "id": 4,
              "comments": [
                {
                  "score": 5497,
                  "content": "OP said in another comment, she only has 3 semesters left to go...  if she was studying Physics than it's probably smaller advanced classes that she needs to take, and she should be able to get her advisor to okay a part time schedule, even if the school usually doesn't allow that.\n\nHe also said it was an Ivy League school...",
                  "id": 5,
                  "comments": [
                    {
                      "score": 8563,
                      "content": "Having to leave a physics program at an ivy to look for the best grocery deals sounds like such a waste of human potential. She is probably beyond bored.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 628,
                      "content": "Jesus ... Here is this brilliant woman, Stanford, assuming, double major, physics/cse trying to find some satisfaction in her life as it applies to her skills and abilities (I am sure she is happy and fulfilled as a mother, but she has other qualities and needs too) and her husband can't even give her that ... For the grocery shopping.\n\nThis woman could be a VP at Google by now!\n\nOP YTA, do you love this woman or not? Give her a boost, show her your appreciation, pay for her to go back to school.\n\nIf you can't do the above the Internet has no choice but to assume you snagged a foreign bride, you're not even a passport bro, you green card married a foreign student with no other options.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 204,
                      "content": "depending on how long it's been, she might not be able to get right back to the degree with just three semesters left - most schools have a limit of a couple years for taking breaks from earning degrees. but a chunk of her previously completed credits should contribute to the new degree and shorten the time regardless.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "Normally your credits go away if you wait too long. At 30, some of those credits have probably gone bye bye.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "this is my plan! i didnt plan to be a SAHM but as soon as both are either in daycare or school i will be going back to finish my degree and get a part-time job. this post hit too close to home for me.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 813,
              "content": "He doesn’t want to do that, if you see his comments further down—He’s trying to convince her into having a second child and all but admits that he’s doing it so that she won’t be in any position to seek further education or employment.",
              "id": 11,
              "comments": [
                {
                  "score": 660,
                  "content": "What a prick. He’s probably one of those men who pursued a woman from a different culture because he thought she’d be easier to handle. \n\nYTA, OP.  Science teachers are hugely in demand and even without a degree, your wife may qualify to be a substitute.  That would give her part-time work she might find fulfilling as she would be using her brain for something other than the most efficient way to load a dishwasher.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 192,
                  "content": "Gross… OP, you’re an awful husband for this.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 460,
              "content": ">Yeah, if OP makes so much money now, let's see him pay for his wife to go back to school and finish her degree...\n\nMy aunt and uncle did this. He got his degree and started his career when their kids were young and she was a SAHM, then when the kids were in proper school she went back to finish her degree.         \n  \nBelieve it or not, a household with *two* highly credentialed professionals has a lot higher of an income potential than one professional and a stay-at-home-parent. It's almost as though relegating your partner to helpmeet might not be the best option - especially if they're both capable and desiring of something more.",
              "id": 14,
              "comments": [
                {
                  "score": 302,
                  "content": "But then how would OP feel superior to his wife? /s",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 145,
                  "content": "My grandpa was adamant about getting married to my nana the summer after he finished college, but she was only a junior. She dropped out to marry him and was pregnant with my mom a month after they got married.\n\nHowever, my grandpa and his mom knew how much education meant to my nana, so they helped her go back and finish her bachelor’s degree. After my mom and her siblings were out of the house, my nana went into banking and ended up getting her MBA.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 9,
                      "content": "🙌🏻🙌🏻🙌🏻 go nana!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "When they were 18 & over? That’s so looong :(",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "This is exactly what me and my husband are doing. Our youngest and last will be in school next year and I’ll be going back to school. I’ve been raising the kids while working part time at home freelancing. He’s constantly telling me how amazing I’m doing AND helps with the kids and chores when he’s home. I couldn’t imagine having a partner diminish that work, it’s hard! Kids are a lot and it isn’t just watching them. Having to handle meals, shopping, after school activities, play dates, cleaning, making sure laundry is stayed on top of. It’s a big mental load too.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My wife and I did this. Best decision we ever made she’s a genius and never wanted to be a sahm but didn’t want to miss the early years. Now we mentor each other in our careers.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This is exactly what we did. My husband and I shared school time. He went first while our kids were young. He got his bachelor's. Then I went back and got my associates. Then, he studied for an additional certification. Then I went back for my bachelor's. Now, our kids are heading off to college shortly.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 400,
              "content": "Read his comments - he doesn't want her to. He's been avoiding bringing it up because he thinks she wants to, but he wants her home with the kid/a second kid. \n\nBefore I read his comments I was like eh, sounds like the wife was looking for some validation that her contributions to the household matter. Could she have phrased it better? Sure. But his comments make it very clear that his only priority is what he wants the way he wants it, and that he is only where he is because of the support of his parents and partner and she was not as fortunate with either.",
              "id": 22,
              "comments": [
                {
                  "score": 11,
                  "content": "That makes me so sad, reading the post I thought maybe he was just feeling like his work was unappreciated, but reading the comments it seems like he's really putting her down",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 303,
              "content": "Just saying, if OP's wife is in the States and they've been married for more than two years, she still gets to keep her green card (or citizenship, if she has it), even if she kicks him to the curb!\n\nAnyway, YTA, OP. Jesus.",
              "id": 24,
              "comments": [
                {
                  "score": 25,
                  "content": "> they've been married for more than two years, she still gets to keep her green card (or citizenship, if she has it), even if she kicks him to the curb!\n\nAdd in child support and possibly alimony and she'd be crazy to stay.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It's a little more complicated than that. Being married doesn't grant citizenship she still has to take the test after 3-5 years of marriage that being said if she shows a valid reason for divorce then her status does not change and she can still take the citizenship test later\n\nEither way OP is the AH\n\nSource: my wife is from overseas and we've gone through this process",
                  "id": 26,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Thank you for bringing this up. People from the US still think marriage is an automatic citizenship, which it’s far from. There are two types of standard green cards, conditional and unconditional. Both require a sponsorship agreement signed by the spouse or business doing the applying, where the conditional (the most common approved) requires the agreement whether it be marriage or job to be maintained for a long amount of time. Time may have changed since I dealt with this, but it used to be standard minimum 4 years. Then the card gets upgraded to unconditional, which is when you could get divorced without losing your green card. And that still has nothing to do with citizenship. That’s a whole different application and process.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "And $$$ in spousal support, don’t forget!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I wonder if OP has been willing to shell out the $700 or so for her to apply for citizenship,",
                  "id": 29,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I had the same thought as I was typing, TBH. Not just citizenship- I wonder if he could even be bothered to get her through the (similarly expensive) adjustment of status process. I've run into plenty of cases where manipulative/abusive spouses *don't* bother and then use their spouse's undocumented status as a further means of exerting power over them. Ugh.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Yeah. I love how OP mentioned twice in the first two paragraphs that he earns enough for both of them. I think he’s the insecure one (and also TA). 🙄",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Yes. Since he's so successful, hire a nanny and a housekeeper so she can complete her degree. It seems you love lording your degree over her as if she wasn't competent and flunked out. She ran out of money and you convinced her that being a SAHM would be a good alternative. She's trying and you're putting her down and purposely harming your self-esteem. I suspect a misogynist/narcissist who can't handle competing with a woman who could be more intelligent than him. \n\nHe's in finance. She was in physics. I have a degree in Microbiology and an MBA. Let me tell you, the business classes were a cakewalk compared to our science curriculum. Most science classes had a lecture and two 3 hour labs per week. We had tests, midterms, and finals for both that were rolled into a single grade. It was rare to take more than 3 classes per quarter because every class was double the class time and tests. 9 hours of class time per week worth 3 units. It was hard to fit more into your schedule. In business school, you could take five 3-hour classes worth 5 units each. No labs or extra class time. \n\nHe acts superior and seems to like it that way. YTA",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Oh no he can't do that because then he couldn't boost his ego by making what his wife does to run a house unimportant.\n\nIt seems as if his wife is attempting to make herself feel valuable while he takes the opportunity to put her down.",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Oooh I remember an AITA and when it was the girlfriends turn to go to school and finish her degree, the guy (who had his degree) broke up with her.",
              "id": 34,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "By the sounds of it OP would never assist by helping financing his wife’s return to study. Even how he states, I bought a house, not we bought a house says a lot.",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1519,
          "content": "Sadly, this type of situation isn't all that rare. It is the story of so many women. As a SAHM, as much as I appreciate and love my husband, I wonder what my life would be like had I stayed in school and did the things I initially set out to do.",
          "id": 36,
          "comments": [
            {
              "score": 536,
              "content": "you can and should go back. you don't want to be at his mercy if he walks away - which he can do at any time.",
              "id": 37,
              "comments": [
                {
                  "score": 507,
                  "content": "Or die. My brother died recently, and it was very unexpected (stroke). Just like that: one day he is there, relatively healthy and okay, and the next day he is in the hospital in coma and the next day he is with us no more. \n\nHis wife was SAHM. She used to have a good job (a translator on a TV channel with good opportunities), but he insisted that she should be SAHM because he didn't want his wife to work. \n\nWell, now she is alone with two kids and has no source of income, and has no recent working experience for more than a decade, which sets her at a severe disadvantage.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 105,
                      "content": "These stories are so wild to me. Before we even got engaged my husband definitively wanted me to get a stable job to be able to provide for myself should anything happen to him. He didn't insist because I didn't want to (I dislike working the way it's done right now, but I like to be productive and contribute and take pride), but merely because the things I showed interest in at the time I was struggling to find stability in. It's taken a while, but I'm there. I used to consider kids. I'm fairly against now for several reasons (and we've discussed). But even when I did, I insisted on income for a year out, and for him to save for a few months to join me. IMO pressuring your partner who clearly thrives on working in some way to not do it at all is just...manipulative. And he's never diminished my efforts even though they've changed course a thousand times and he still makes triple+ my new income. \n\nIt's totally okay if that's what you WANT to do of course, but yeah, this guy is a big ole asshat. She probably makes those comments to make HERSELF feel better too--I did when I got stuck between jobs for 6 months twice in the past two years.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I really hope they had life insurance.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Yep, same thing happened with my oldest brother. He was 34. Came home from his HVAC job during the summer, so obviously his busy season, and said he was exhausted and just ate dinner quickly and went to lay down. Absolutely nothing unusual about it. The man worked 14-16 hour days during the summer sometimes, in the heat. She fell asleep on the couch watching TV, got up around 2am and went to bed, and he was already cold. They had three kids together, the youngest was 13, so yeah, not LITTLE kids, but still. Kids. She'd had jobs off and on, but had NEVER been the main bread winner and was mostly a SAHM. I will say, I am incredibly proud of how well she stepped the fuck up. The kids did get his SS monthly which helped tremendously, but she has her Medical Assistant certification and went back to work. She obviously didn't want to live in the house he died in, they rented so it wasn't THAT hard to just pick up and move, which they did, and she's been a great single mom to those kids. Granted, she's remarried now, he's been gone 8 years, so definitely fine that she was able to move on, and it was like, 2-3 years after he passed that she met the guy, so in no way disrespectful or anything. But based on her history, we absolutely expected the worst. They didn't have the greatest marriage, I could go on forever giving examples as to why we didn't expect much, but she immediately stepped the fuck up and is still super close with our family and those kids are thriving. Oldest will graduate from a prestigious private university in our state with his Nurse Practitioner degree, going in to sports medicine. Kid was always an exceptional athlete and got a full ride football scholarship. The youngest just turned 21 in January and while she's still trying to figure out her path, she's a great kid who I have no doubt will do well.\n\nBut they got incredibly lucky and things could have been way worse for them.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Sorry for your loss and hers",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yep. You are on very dangerous ground relying on a man for your support. He can jet at any time and you'll be stuck looking for work, health care, child care, etc. No one wants to work, I get it, but I like knowing I have a giant bank account in case my husband leaves or dies.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "Im a “traditional” college student (Highschool > college) and the number of times I hear female classmates say “non-traditional” things like “my baby”, “my child”, “my husbands”, “my [career]”, “my menopause”, etc FAR outweighs when I hear male classmates talk about it (or they obviously look older than 21, but I’m bad at guessing)",
              "id": 44,
              "comments": [
                {
                  "score": 75,
                  "content": "Yep. Master’s student at 46, spent 16 years as a SAHM.  Totally lost myself for a while there, but I’m loving finding myself again.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That gives me hope for me.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "Same here. I actually am going to back to school in the winter this year to finish my degree. My daughter will be 9 and I finally have the time/energy to devote to finishing up. I need something for me again.",
              "id": 47,
              "comments": [
                {
                  "score": 6,
                  "content": "I started school again last September at the ripe age of 40. I'm by far the oldest in my class. My 15yr old daughter is super proud I took the leap and started school again. \nI'm also doing it for me. I love going to school! And the prospect of better pay and a promotion.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I’m proud of you too! I’ll be 35 so I know I’ll be older but better late than never. I want to show my daughter that we can do hard things and we don’t have to stick to the traditional timeline.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "I'm here from the future to tell you your chidren will grow up,  and school will still be there! I went back to work/school part time at 37 and work full time at 46. I did so much better in school than I did the first time around, and I had enough life experience to know what I wanted to do. \n\nI definitely won't have as many opportunities to climb the ladder, but I'm glad I took my \"retirement\" when my daughter was young, and I had a lot of energy!\n\nNow I'll just work until I drop. I like it,  though! 😅",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Professors love older students, the ones who are there because they want to be there.  \n\nI went back for my doctorate in my late 30s.  It's never to late!",
              "id": 51,
              "comments": [
                {
                  "score": 3,
                  "content": "I don't even have a bachelor's degree and I will be 35 in February. I feel as though life has passed me by....",
                  "id": 52,
                  "comments": [
                    {
                      "score": 5,
                      "content": "No way!  My aunt got her BA at 55 years old.  As long as you are alive, it's never too late to start.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I went back to school in my 30s - online for my bachelor's and then, when my kids were school age, I went on to law school. You can still do the things you want to do!",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It's never too late. I was a sahm for over 10 years and always wished I could have finished school. Being a parent is rewarding, but I still felt like I put my life on pause for it. I graduated at 40 this spring. Landed my dream job, too.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "If I had a partner who felt like that I’d honestly want to know. Why would you want your partner/best friend to not push themselves and get that sense of achievement. Last thing I’d want is a partner who felt like they’d limited themselves because of me, heck if I earned enough to have a partner who was able to stay at home I’d say that would mean I’d have enough spare cash to help them pursue something they were into.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 863,
          "content": "I don't know - this is an ESH to me. I'm a SAHM who used to have a pretty intense career. There are times when I feel insecure about not working but engaging in these kind of petty games with your spouse is not the way to handle it. \n\nIf OP implied to his wife, that she could never do what he does is that cool? It's a put down any way you slice it. In wife's case a pretty silly put down as grocery shopping and cleaning are achievable by all.\n\nI don't think OP had to come at her so hard. He could have been more diplomatic and empathetic given its his wife and not some rando. Basically say what he did in the post - he's grateful that she runs the household well but he is also a capable person not some helpless oaf. \n\nIf going back to school isn't an option, wife can get some intellectual hobbies. She has agency here - it's not all on OP to solve her unhappiness. I'm more up on current events and investing than I've ever been.",
          "id": 57,
          "comments": [
            {
              "score": 750,
              "content": "Oh damn, if grocery shopping, cleaning and childcare aka housecare is so achievable by all, why is it among leading causes for divorces? (Edited, as it is indeed not \"number one\" as I initially phrased.) Why is it the number one complaint women have about men? A little task that wealthy people hire several employees to do?\n\nI also have worked an intense job similar to OP's, and am now a temporary SAHM. The job is hell of a lot easier than having kids and running a household, a neverending job with no breaks and gazillion tabs always open in your mental metawork browser. \n\nJust to keep my sanity, I started to run groceries in the way OP's wife does, in a complex way that ultimately saves a ton of time and money. My husband, also a brilliant guy working a good career, looked at my process and said:\n\n\"Yeah no, I wouldn't have the processing memory for that. I'd just to to Price Chopper and forget half of it. Thank you for what you do.\"",
              "id": 58,
              "comments": [
                {
                  "score": 405,
                  "content": "Except shes the one who came at the OP first. He never put her down, he simply he could manage just fine. She made the claim that he would be useless without her. Everyone sucks here. Her for initiating the argument, and him for being just as brash.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 410,
                      "content": "She wants acknowledgement. She gets no paycheck, no bonus, no review, and she works 24/7. She said this to him to receive acknowledgment for what she does. He wouldn’t even do that.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 187,
                  "content": "I am also a woman responsible for the majority of household work and I work an intellectually demanding job FT, with the two teams that I manage. Absolutely anyone who is not mentally disabled **can** run a household. A lot of men **choose** not to do it for various reasons, but anyone who is of average intellectual abilities can do it, it's no rocket science. They might not want/do it in a specific way you or I choose to run it, creating complex schemes and strategies (or loading the dishwasher in a special way, jesus), but they can do it at an acceptable level.Now my job - no, you can't do it without special training and experience, and it's way more mentally challenging than keeping the place cleanish and the food ready.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 103,
                      "content": "> . Absolutely anyone who is not mentally disabled can run a household.\n\nI'm autistic and a single father. Even those of us who are mentally disabled can run a household.",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 95,
                      "content": "Exactly. It’s not that rich people hire others to run their household because they’re not capable of doing it themselves. They’d rather spend their time on other things than scrubbing floors. 🙄",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "It sounds from OP's comments like his wife would love to finish her degree and start a career, but he's discouraging her because he likes her at home. So managing the household is all she has to stimulate her and be proud of her, and his response is to talk about how he's in a more intellectually demanding role; yeah, rub it in, dude.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "And that’s the problem. This lady is smart and highly educated and is not a sahm and now fulfilling her potential.\n\nAlso just because you don’t need to be a genius to run a household doesn’t mean it’s not stressful and draining work.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "There's a huge difference between being capable of those tasks, and being willing to do them and or actually following through doing them",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "Once you add up all the costs, such as childcare and a housekeeping service, it would probably be cheaper for me to stay home and take care of my kid full-time, but I don't, because I absolutely suck at things like cleaning the house and taking care of kids, on top of which I wouldn't enjoy it. Don't get me wrong, I love my son, but I also enjoy the work I do, and I worked very hard to acquire my skills. OP's wife sounds like a talented woman who doesn't have a good outlet for her skill/motivation.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "It's acheivable by all. Doesn't mean everyone will optimize it. But you don't need to. And since her husband work in finance it's probably a drop in the ocean of their income.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": ">\"Yeah no, I wouldn't have the processing memory for that. I'd just to to Price Chopper and forget half of it. Thank you for what you do.\"\n\nAnd what if that wasn't true? What if your husband had a masters degree in finance and was at the same high level institution you were at when you met?\n\nAnyway you slice it, the argument STARTED because wife was insecure in her perceived worth in the family unit (whether that is OP's fault or not is unclear) and she decided to assuage those concerns by implying OP **COULD NOT** accomplish the things she does",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Women leave husbands who don’t do shopping and cleaning and childcare because they *choose* not to learn it even though they are clearly capable. Your argument sounds like you are saying “if it’s achievable for all then why do some women have to leave husbands who are unable to do it?” But they are able. They don’t want to. That’s why women leave them.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Agreed, Adulting and taking care of a home is not easy. COVID made it even more fun trying to minimize trips to the store/exposure. The extent of my \"optimizing\" is ordering my grocery list by the path I take through the store.\n\nAlso hello Upstate NY person! I grew up there, still go back a bunch, but live in MA now. There are a few Price Choppers here, on the other side of the primary area for Big Y suspiciously not served by Price Chopper, but before Wegmans really picks up, which suspiciously doesn't really compete with Price Chopper.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Because it's a common source of friction due to being a frequent task that couples all have to do. The tasks themselves aren't difficult, they're just time consuming and often unpleasant. Those are two different things that way too many people (especially Internet-dwellers) conflate.\n\nYou know what the difference between your situation and OP's is? You didn't go up to your husband with a spreadsheet and say \"look at me, you would never have been able to do that\".",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "First of all, it’s not the number one topic for divorces. It’s not even top 3. Second, it’s an issue in marriages/relationships period, one of the partners aren’t holding their weight.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 314,
              "content": "It seems to me that Wife is crying out for some confirmation that what she is doing is important and valuable and appreciated, and OP consistently responds with \"Sure I appreciate it but it's not like it's anything all that hard.\" I agree Wife's comments sound petty, but if OP really talked and listened to her, he might get a better understanding of what she is really asking for -- appreciation, confirmation that her efforts are indeed efforts, and a discussion of how she can start returning to the intellectual pursuits she gave up.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 227,
              "content": "OP’s comments have given more information. He will not help her pay for tuition for her to return. He also wants to convince her to have a second (he convinced her to have their first and be a SAHM) and conveniently mentioned she’ll be too old to finish her education when the second would be school aged.",
              "id": 75,
              "comments": [
                {
                  "score": 102,
                  "content": "Yikes. So he’s just trying to beep wife “in her place”. Gross.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Now THAT makes him an AH",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "This is OP's narrative. And likely to be biased, consciously or unconsciously. I'd ask if she's saying these things to point out that her labour has value because she feels that it is overlooked. Does OP do or say anything to make her feel appreciated? How much of her efforts go unnoticed? (Speaking as an involuntary SAHM the answer is going to be most of it and I have a very appreciative family. The dishwasher thing is especially annoying. He is clear that him loading the dishwasher is a rarity. Does he then unload it hours later? Does he check everything in case anything needs an extra wash? If not how does he know it 'still cleans well'. Does he fit everything in? Does he clog the filter? Does he have a little laugh about how easy it is when she 'makes such a fuss'?) And the disingenuous 'we agreed' phrasing that she would be a SAHM when in reality she was up against the wall with no real choice at all.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I think she was fishing for a compliment maybe? hoping he would confirm giving her a sense of worth. I don’t know maybe i’m reaching",
              "id": 79,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Read his comments. He knows she wants to complete her degree, but he doesn't want her to because he likes having her at home.\n\nPoor woman is bored out of her tree, but she's dependent on her marriage to him for her visa.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Did she actually say he couldn't do it, or did she just ask, \"What would you do without me?\" It seemed more to me than she just wanted to feel needed. The true question is, could he do all that she does WHILE Working full time? Aka could he do all that without her?",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 317,
          "content": ">What little source of pride she has (her household tasks), her own spouse diminishes & minimizes. How would that make you feel if you were in her shoes?\n\nHe is in her shoes though, because she expresses her pride by trying to put him down.\n\n>she finds it humorous to say that I am incapable of doing household tasks\n\nBut I guess calling someone incapable is only funny when she's doing it. And he didn't even do that, actually, he just explained that he could absolutely manage to feed himself without her. Because that's something that he felt the need to inform her of.",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 299,
          "content": "To be fair, it's not really beneficial or constructive to frame it as \"you would be so useless without me\". Now if she was simply stating that she was excited that she found good deals and was able to save money and OP said \"Eh big deal i could do it too\" then yeah he would be TAH, however, making the comment that he can't do it and whatever would he do without her is also AH behavior.\n\nIt's just like how media portrays men/dads as bumbling idiots along with their kids and if there wasn't a woman/Moms around then everyone would fall into chaos because no way could an adult figure out how to take care of themselves or their kids.\n\nThat being said he could've just said, \"I think it's great that you are able to do that and I'm glad I dont have to worry about it\"\n\nEdit judgement: YTA for your comments man. The original post was an ESH but now your just an AH. \n\nI never understand this line of thinking. If both of you have a career and make money who f*cking cares? Y'all both getting shine. I never can understand this idea that Only one can have a career. Is it because you feel that's all you have to offer? Suck less my man\n\nEdit again. Wow man your comments get worse and worse. So instead of being a team and partnership you want her to continue to be a SAHM completely reliant on you and support and no way to be independent. JFC there's no much wrong on this post and everything your saying. Cot damn man your the kind of guy that makes all of us look bad",
          "id": 83,
          "comments": [
            {
              "score": 12,
              "content": "Not to mention the angle of not being a citizen, which could possibly leave her vulnerable if the marriage ends.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 261,
          "content": "Imagine how understimulated this poor woman must be. Physics and CS is an extremely technically challenging degree path. Had she finished her degree it's likely she'd be getting recruited by quant funds (some of the most technically sophisticated types of finance jobs). It sounds like she's grasping for ways to turn her day to day into something more engaging by doing things like mathematically optimizing household expenses really aggressively. She probably still wants to complete the degree and if OP is holding her back from that it's an obscenely cruel thing to do-- people like that need ways to engage their brains or they often get really depressed. \n\nOP if you love your wife you should have a real conversation with her about this. The life she's living right now is a nightmare scenario for so many women like her  I'm saying this as a woman in physics-- this scenario comes up all the time in conversation as \"it would be terrible if this is what my life ended up looking like\". This isn't to say she doesn't love you or love being married to you or love your kids, the nightmare is about living a life where you don't get to engage your mind or your curiosity. If she finished her degree she'd likely also be able to get a high paying job (cs/physics is in demand and useful for a lot of things that aren't just physics research) and would be much happier.",
          "id": 85,
          "comments": [
            {
              "score": 230,
              "content": "To be honest, i do not think he loves his wife at all.  In one of his comments he does say he \"likes\" her.\n\nOp gives off huge \"trapped a trophy wife\" vibes.",
              "id": 86,
              "comments": [
                {
                  "score": 59,
                  "content": "Yeah all he does is make excuses for why she should have to stay at home now even though their kid is in school. You don't need a whole person to take care of a home that's empty most of the day. I feel so awful for her. Wonder if he's threatened by how intelligent she is.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "He says they married so she could stay in the country.",
                  "id": 88,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 149,
              "content": "He said even if she went to college she would\n“Just study computer science “ as if that’s not a worthy pursuit . She is already programming at home\nAs a hobby and clearly has interest. He wants\nTo lumber her with baby no 2\nAnd he said when baby2 is independent she’ll be “too old” to start a career . I think this is his plan . She is clearly intelligent .. perhaps even more than OP and that could be the root of the issue here.",
              "id": 89,
              "comments": [
                {
                  "score": 85,
                  "content": "He is financially and emotionally abusing her, basically. He took advantage of her immigrant status and loan/financial status to begin with to trap her.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Exactly - she’s just a baby machine to him",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "YEP it's giving insecure husband trying to put down his wife and suppress her intelligence and earning power because he feels threatened by her. \n\nEdited bc pressed post before done",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "This 💯 \nI don’t see this situation as anyone in particular being an asshole, but as a woman who is desperate to use her brain to its full abilities and have a sense of accomplishment. That should be the OPs primary concern, not determining who is right or wrong",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 239,
          "content": "100% this.\n\n>I replied back saying that of course I could do it, I handle complex decisions and calculations at my work as I work in finance and that I have a masters degree and what I do involves more intellect than household operations\n\nOP immediately used his work and degree to point out how inferior his wife is to him, and how he could \"do everything better\" than his wife, because he has a degree in Monopoly money.\n\nI've known brilliant, truly brilliant people get lost while grocery shopping because they didn't understand that refried beans are in the \"ethnic section\", while the \"beans section\" had only whole kidney beans. Or get stuck trying to find olives because there's not a section that is labelled \"olives\".",
          "id": 94,
          "comments": [
            {
              "score": 28,
              "content": "The difficulty of household operations is heavily tied in the stamina required for the sheer, never-ending mental load of managing and remembering thousands of details, and the capacity to manage minutiae you have zero interest in. \n\nI’d much rather work an intellectually demanding job that uses my education than force my brain to focus on things it doesn’t care about. I agree that the wife could have phrased things differently, but this guy seems to be missing a lot of bigger points about the demands on her and the unhappiness she experiences. \n\n“She agreed to be a SAHM” rather than complete her degree, rather than “she said she wanted to be a SAHM” - OP needs to dig into this with her. \n\nIt’s honestly kind of weird to me he is on here trying to explain his “side” of these interactions, rather than saying to her “Hey honey, I feel like your comments are digging at me in sharper ways than you may be aware of. Are you unhappy? What do we need to talk about?” \n\nAnd before anyone says “she could bring it up on her own” - yes that’s ideal, but we don’t know the full story here, and it’s also ok to throw your spouse an open door to talk when they seem unhappy.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Yes, this is where I stopped reading:\n\n> and what I do involves more intellect than household operations\n\nYTA 100%",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Absolutely. My ex has a Phd in chemistry, IQ above 160. By every objective metric \"smarter\" then me. I'd ask him to get me deodorant from the store and he'd get wrong thing. I'd literally text him a PICTURE of exactly the product I needed and he'd still get the wrong shit.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "He would be nothing without her because it was through her sacrifices that he was able to buy a home, advance his career & have a kid young. She’s absolutely right.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 180,
          "content": "OP said in a comment that he doesn't want to talk about the topic because he is afraid she would want to go back to school and therefore wouldn't be able to spent that much time with their daughter. I just love the comments where he says that he suggested to get a child and she agreed to it and agreed to becoming a SAHM. She didn't have to she could have also gone back to her home country. But since he wants a second child it would be a bad timing for her to start studying again. His comments are basically full of the fact that she is extremely smart and always wanted a career. He trapped her financially and basically made her bis maid. It seriously surprises me how little he is thinking of her and how much he dictates her life. Yes YTA a 1000 times",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "This needs to be upvoted into infinity. OP, if you say you could do anything she does, how about taking some of the household responsibilities off her hands and letting her resume her education?\n\nNot to mention, would it hurt you to say „great job honey, good on you being responsible with money, I appreciate it”? YTA",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "Exactly, bare minimum your wife wants to feel smart, valued, appreciated, and needed. \nWhat she is really say is “hey i did all this hard work to make our lives better,  do you appreciate it?”  Because just like you she needs to have a purpose, but she doesn’t have a job to give her that purpose.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15830,
      "content": "After reading OPs comments, YTA OP. Your wife gave up everything in order to raise your child. This includes making your masters degree and your career possible, you literally would have neither of those things if she hadn’t sacrificed everything she wanted for herself to make your life possible. She could’ve left you with a kid, returned to her home country and let all of your dreams fall apart instead of her own. \n\nSeveral people have suggested that you take up her job since you believe you can do it, and allow her to return to her education. You have declined. This means you literally *can’t* do her job. You lied. Why would you decline to do this? I’ll tell you, because it has a massive personal cost and sacrifice to give up what you want so someone else can have what they want. That’s what she did for you, you aren’t capable of that, or you would. Forget the groceries. You literally are refusing to do her job because the cost is too high for you to pay (in your mind). It wasn’t too high for her to pay, and for her to keep paying, so you actually cannot do her job. \n\nI suggest that you do something to allow her to be more fulfilled. At a minimum, cut back on your work hours so she can return to her education part time, take up a lot more at home so she can pursue another interest, whatever. Either way, it’s the bare minimum you owe her. She’s obviously unfulfilled and since she made your dreams happen, it’s your turn to return the favor. Stop saying you can do her job when you can’t and are flat out unwilling to, and start looking for ways to give her a sense of pride and accomplishment. She deserves a happy and fulfilled life too.\n\nEdit: For those who are confused, here are OPs relevant comments:\n\nOn the question, “does she want to finish her education?”\n\n> She has said that she wants to go back, and talked about the great things she could have done but I never asked her because she always follows up with it might be too late. I did tell her that to an extent it is true that it is hard to start your career late.\n\n> She would not be able to afford it without me, and she would have less time for our daughter if she did that, so I am not super keen on encouraging that and she has not mentioned it to me directly.\n\n> She does not even have a bachelors only an unfinished one. If she went back I feel like she would want to do the same thing or just computer science. She is not into arts or business things. She still does programming as a hobby.\n\n> Initially, the plan was actually for her to start working once she was legally allowed to do so after marriage and then get another loan and go and complete her degree, but once I got a good job we could manage on one income and I asked her about being a SAHM and having a child and she agreed.\n\nOn paying for his wife’s education (please note that his wife made his education possible):\n\n> I was thinking of bringing up getting a second child, I dont think we could afford that if she were in school and I was paying for it, especially an Ivy.\n\n> She was an academic snob back then so she would definitely want to go to an Ivy and she knows our finances so it would be theoretically possible but put a dent in it.\n\n> She would very likely want to finish her Ivy degree, she has 3 semesters left to graduate.\n\n> I was thinking of talking to her about a second kid, she was previously at an Ivy and tuition is expensive (and even more so than when we went) so I dont think she could afford that by working herself. I could only afford it as my parents helped me.\n\nAnd your wife OP. Once again. \n\nOn the fact that a second child would likely set back her goals:\n\n> By then I really doubt she would have any interest in going back for a career and would be too old to get hired for junior roles.\n\n> Now she is not, I meant if we had a second kid and then she went back once the second kid were older.",
      "id": 102,
      "comments": [
        {
          "score": 5619,
          "content": "This!! There are so many crucial details about their home life, OP's character, and his wife's sacrifices that are missing from the post completely. We shouldn't have to go hunting in the comments to get the big picture. OP is a massive asshole to his wife.",
          "id": 103,
          "comments": [
            {
              "score": 2910,
              "content": "This is the thing people who say stuff like OP do not get. Even if you can shop for the stupid groceries or pack the kids lunches, unless you are willing to give up everything she gave up, you actually demonstrably, cannot do her job. You literally can’t. You find the cost and the sacrifice too steep, too high. So you literally can’t do it. She paid in her own hopes, dreams, goals, desires, and unless you can do that extremely painful thing *and* do the groceries and the lunches and the bedtimes, you can’t do her job. Many people in these comments have suggested he do just that and he says no. Put your money where you mouth is or stop lying. It’s that simple.",
              "id": 104,
              "comments": [
                {
                  "score": 832,
                  "content": "My thoughts, word for word. His wife's job is a hell of a lot harder than his, but he sees no value in it. Being a SAHP isn't enough for him to leave his job, even if it means supporting his wife. He obviously has his finances under control, so the only thing stopping him is himself.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 377,
                      "content": "Exactly. I’m childfree for very good reason, and part of it is this. I am very committed to my education and my career and the idea of giving it up to care for everyone around me day after day - potentially with a thankless partner like OP who would never appreciate it or return the favor - is maybe my greatest fear. I can’t imagine the heartbreak and the pain and still needing to function. No way. That very idea is more difficult than my career tbh. OP doesn’t get it and he couldn’t do it, most people can’t.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 272,
                      "content": "He has no grasp of the fact that he is where he is because she enabled him to be.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 186,
                      "content": "And one of the thing that is revolting in his post is, sure, she lives in his house, etc.. But she is likely not paid for the work she does around the house, and even if he gives her some sort of allowance, she still would be paid much more as a computer engineer or whatever she was studying. The day their relationship ends, she has nothing, and not even a qualified, stable job to fall back on.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Seems he has a got a bit of a fragile ego. Seems reluctant to let his wife succeed. \nI hope one of them gets a clue and does what’s best for the wife.\nEither he supporting her finishing school, or her gtfo of that marriage so she can have fulfilling life.",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I wonder ... has anyone asked him if he's willing to get pregnant & deliver the baby?  I mean, seriously, how obtuse can this guy be?! \n\nOP is TA here, in every way possible.\n\nUnless he changes his attitude, there will be no chance of a second baby.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": ">She paid in her own hopes, dreams, goals, desires, and unless you can do that extremely painful thing and do the groceries and the lunches and the bedtimes, you can’t do her job.\n\nI love how you word this. Maybe OP as \"someone working in finance\" can understand better when put this way.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": ">She paid in her own hopes, dreams, goals, desires\n\nDing ding ding.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This comment almost brings me to tears it rings so true.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 410,
              "content": "Not to mention it just sounds like she felt proud of this optimization and just wanted some praise from her husband \n\nThe hardest part of being a SAHP is that everything you do is a thankless task",
              "id": 114,
              "comments": [
                {
                  "score": 35,
                  "content": "As a mostly stay at home parent (I work part time to help make ends meet), that’s exactly how I read the situation. She was looking for a little recognition for working hard to benefit the household. I think putting in the extra work to meal plan, find the best grocery prices, and provide healthy meals for your family are all things to be very proud of. I often feel acknowledged by my partner for my contributions and can understand needing recognition from a partner. She wasn’t looking to turn it into a competition of who could do what task better… she just wanted to feel appreciated.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "She is **30** and OP keeps saying \"she is too old\" and \"it is hard to start your career so late\". WTF. 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩",
              "id": 116,
              "comments": [
                {
                  "score": 6,
                  "content": "I wish I had an award to give you.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Basically he is making sure he holds her down so he can get what HE wants. Which is why he is such an Ahole for what he said. He is making her feel like less because if she felt she wasn’t good enough, she wouldn’t pursue her dreams.\n\nHe is incredibly insecure and probably feels as if his wife would leave him if she became financially secure on her own",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I like that he forgot to mention that she had made it through 2.5 years studying physics at an Ivy league school! That's not evidence of a lesser intellect. She gets bonus smarty points if her courses were not in her native language!",
              "id": 119,
              "comments": [
                {
                  "score": 7,
                  "content": "🤣🤣🤣 \"Bonus Smarty Points!\"",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "And he keeps saying HE could afford her tuition, but she probably couldn't pay for school on her own.  how did you get this nice big job you have now? Are they not a team? Did she do nothing to help him in his life up to this point?\n\n Obviously she did, he just hasn't noticed the benefits he gets from her managing the home. It's very sad! I hope OP can learn from this and treat her better going forward",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It sounds like his wife wasn't even being that serious about the \"you can't do what I do,\" comment. Sure, every joke has a little truth in it, but anytime I've heard someone say that it is usually in a joking manner tbh",
              "id": 122,
              "comments": [
                {
                  "score": 4,
                  "content": "I agree. I say this to my partner occasionally, even to my parents, or my very forgetful college voice professor when she forgets about the meeting she has to go to right after my lesson and I remind her. Maybe others don’t see it the same way, but it’s never been very serious to me. I always use it in a very joking and loving way.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "[removed]",
              "id": 124,
              "comments": [
                {
                  "score": 8,
                  "content": "I definitely agree with this. The comments give context but all the nasty behavior and self-righteousness is evident in the original post. I just read your parent comment—very well said!",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "YTA. But let’s keep it simple. OP failed Spouse 101. When your spouse asks “what would you ever do without me?”, there’s only one answer: “I wouldn’t want to find out ❤️”. Stop making it a contest and start talking about what each of you needs to be happy.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1583,
          "content": "👏👏👏👏 So fucking well said. Hope OP hears this loud and clear.\n\nEdit- My take is that in her original comment his wife was fishing for a compliment. She was probably feeling undervalued and underappreciated, and was trying in a \"jokey\" way to get OP to acknowledge it. Pathetic that instead OP then does the exact opposite and belittles her. YTA",
          "id": 127,
          "comments": [
            {
              "score": 474,
              "content": "Yes, OP should read well between the lines: The wife is not happy in her role right now, she might have thought she'd be enjoying a SAHM life but found out it's not fulfilling long-term.\n\nI totally adored staying with my baby for 1 year, loved doing everything around the house, but by the end of the year I felt as if my brain was shrinking. I talked baby talk most of the day, was talking to other moms about baby stuff and wasn't intellectually challenged at all. I couldn't do it long term.\n\nOP, if you value your wife, sit down with her calmly and ask her how she feels, what wishes she has and if there was anything she'd like to change. Show her that you listen and care. Just because she agreed to a lifestyle doesn't mean she cannot change her mind. If she wants to go study part-time make this possible for her, hire a cleaner and send the kid to daycare, don't expect her to do \"that little household\" on the side. Give her a break.\n\nYour marriage and child will thank you",
              "id": 128,
              "comments": [
                {
                  "score": 267,
                  "content": "Not only that, the effort she put into grocery shopping shows she is craving intellectual stimulation. Get this poor woman out of the house and back into school.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 31,
                      "content": "But then she might be able to leave him! OP can't let his trapped bird fly free from the cage! Better to never open that door!",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "Ikr, reading this just made me sad. It gave me the same feeling as when you're  watching a magnificent tiger pacing around a tiny cage in a crappy zoo.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "if he were a good person, OP would have easily said something along the lines of, \"You do so much, and I couldn't do this without you.\" but that ego got in the way, and his true colors showed. YTA big time \n\npisses me off that he wants to start trying for a second child without letting her get her degree first",
                  "id": 132,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 273,
              "content": "As a SAHM who *often* feels undervalued and unappreciated... that is *exactly* what she was doing. Just looking for the tiniest bit of appreciation and recognition, and he couldn't even do that job for her.",
              "id": 133,
              "comments": [
                {
                  "score": 48,
                  "content": "Honestly STAM should be paid at least the minimum wage for the work they do.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "Agreed. But Run On Sentence Randall over here didn't have his \"humor\" program engaged.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Yeah I feel like OP chose to get offended over something that was never meant to be offensive. Sounds like his wife feels underappreciated and is trying to show him that there's more that goes into her day than he realizes.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly, I did not get the vibe from OP’s post that she was belittling him.",
              "id": 137,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "OP is not just an asshole but a dumb one at that",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 675,
          "content": "Wife is in the ‘acceptable level of permanent unhappiness’ zone, and OP is fine with it because his life is good.\n\nOP - your wife is giving you very strong hints about the relationship.\n\nDo something to fix it before she hits her breaking point and walks away",
          "id": 139,
          "comments": [
            {
              "score": 138,
              "content": "Wow, “acceptable level of permanent unhappiness” is a very good way of putting how many SAHMs end up feeling when they had other dreams and aspirations.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yup, everyone say it with me loudly enough for OP to hear: TIME FOR COUPLES COUNSELING!!!  I’m an MFT in training and fun fact, most people go to couples counseling too late. BUT, that doesn’t mean that by deciding to go, you’re going to late. You can take a moment like this and say, hey, I think this interaction shows that there is something going on in our lives that needs a tune up! \n\nAnother fun fact: there is nothing wrong whatsoever about going to couples counseling and in fact everyone should do it from time to time to keep your relationship as healthy as possible, like doctor or dental checkups.\n\nOP, your daughter is old enough that she is in school and out of the house and therefore your wife now has time to do more than just be a SAHM. Based on her reaction, she probably needs to be doing more now. She was looking for validation and you were hurt by what she said. You didn’t necessarily say something that makes you the AH but it still hurt her feelings because she appears to feel the loss of not graduating and finding a meaningful job. Her job as a mom certainly isn’t over anymore than yours as a dad, BUT, the day long version of it kind of is. It’s time for a shift so everyone can get their needs met. \n\nWhere you kind of become the AH is by not apologizing for unintentionally hurting her feelings. What she needs to hear is that; while you didn’t intend to hurt her feelings, you recognize that you did and you are very sorry for that. Your reaction was defensive and based on feeling a little hurt yourself. This is not meant to be an excuse but to help understand why you responded as you did. Now what you need is to understand where her comment came from. What did she need from you in that moment? Is she feeling like she wants to go back to school?",
              "id": 141,
              "comments": [
                {
                  "score": 25,
                  "content": "Wait, I’ve read more of OP’s comments… dude… YTAH! If you actually “love”, not just “like” your wife and value your marriage then besides doing what I said up above, you need to learn to care about her happiness and start putting it needle your own because clearly your happiness has been made front and center this whole time. She is NOT too old to go back to school and a smart person will not be happy to stay idle for long. You need to get to fixing this ASAP before she starts figuring it out without you. If this is a partnership treat it as such.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I really hope by now she has her greencard or citizenship and just leaves him. Being a broke single mom sounds way better than being with this guy.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 265,
          "content": "I kind of hope OP’s wife leaves him and fulfills her dreams. [Married women do more housework than single women.](https://www.prb.org/resources/married-women-with-children-and-male-partners-do-more-housework-than-single-moms/) She would have a better life as a divorced mom having a kid every other week than staying at home with this guy.",
          "id": 144,
          "comments": [
            {
              "score": 15,
              "content": "The paper is more correctly “Married mothers do more housework than single mothers”.  I may read the paper later since I have my doubts, but the authors seemed legit.",
              "id": 145,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "That's a fascinating statistic, I guess it backs up the women who call their husbands an extra kid.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I really hope she takes the half to which she is entitled.",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 260,
          "content": "Oh this reeks of an insecure man who wants to keep his talented wife in check by securing she stays economically dependent. \"She was an academic snob\"?? You mean, she was doing so well academically that she was able to choose the institution, including Ivy league ones?\n\n\"I tell her it is hard to start a career late\" - way to demotivate an already insecure person! Subtle remarks like this can nag at you until you believe them yourself and think you will never be able to make it in life.\n\nIf this woman is as clever as OP describes her, I really really hope she wakes up soon and realizes the manipulation and disappointment she has been subjected to. The wife sounds WAY above OPs league and I'm sure he realized that pretty early on and made sure to chain her to him while her visa status was still insecure and she hadn't finished her education. Pathetic.",
          "id": 148,
          "comments": [
            {
              "score": 89,
              "content": "I hope she sees this post myself, but also, 30 with 3 semesters left? I went back to school at 31 and I’m doing just fine. Sis, go get your degree. The alimony he would owe her for supporting him with childcare though school would probably cover it…",
              "id": 149,
              "comments": [
                {
                  "score": 14,
                  "content": "I restarted my career in a totally new field at 32 as a single mom to a pre-schooler. It was financially tough and exhausting for a few years, but I am now in a very rewarding and well-paid job and happy that I could show my kid this version of its independent and happy mom, instead of a miserable housewife.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I'm almost 32 and in the beginning stages of my degrees and working towards becoming a doctor while also pursuing having a baby. What I tell anyone who comments on my age and working on a goal that will take about a decade is that in 10 years I will be in my 40's whether I reach my goal or not, the years aren't going to stop passing, so I might as well be in my 40's and have achieved my goal than in my 40's wishing I had started 10 years ago.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I don’t get how he’s calling her the academic snob if they met in college. Didn’t he go to the same college then? Yeesh.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My mum worked part time in a role outside of her chosen field all through my childhood until a couple years ago when she went back to study a diploma to prove she still had her skills. She's 50 now and back doing what she loves (IT related too). I have no idea why he'd say she's too old to start now, especially since people change careers all the time (meaning you have older people in junior roles).",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 94,
          "content": "Wow I love the way you put this. It's 100% true. Sahm  would be my literal nightmare.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "He probably makes more than enough for them to hire a person who can help them out if she goes back to school and then gets a job.",
          "id": 155,
          "comments": [
            {
              "score": 6,
              "content": "And if not, he needs to acknowledge that being a SAHP takes more than literal skills, it takes *So. Much. Sacrifice.* and *that* is the part that he lacks, not the skills or know how. His wife has sacrificed almost everything she is as a person so that he could have it all: career and family; that’s the part he “could not do without her”.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "I wish I could upvote this a billion times and I wish the OPs wife could read this and see her sacrifice put into words",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Men like OP are so exhausting. As a career woman, I’ve grown to resent men like him so much. Their entire lives and careers are subsidized by their wives, and they’re able to be as successful as they are because they have someone taking care of everything else. But do they appreciate it? No. Meanwhile I’m doing everything that OP’s wife is doing plus my career, and men like OP are assholes to us working women too even though we’re doing the jobs of two people.\n\nIf she does manage to finish school and start working again, OP will still expect her to do literally everything for the house and family. \n\nAnd then when they get divorced, he’ll fight tooth and nail to avoid alimony and child support while whining about women being gold diggers after having sabotaged her career and earning potential.\n\nA story as old as time.  And it’s why I refused to ever even consider being a SAHM despite constant pressure from my mom and the majority of the men I’ve dated.",
          "id": 158,
          "comments": [
            {
              "score": 19,
              "content": "I am a career woman as well, childfree though and I have been there. Watching men I’ve worked with for 10 + years while they didn’t have to take off a day for their kids appointments, school meetings, field trips, whatever, arguing viciously about how unfair alimony is. “Oh yeah, I married my wife at 20, had 3 kids back to back, and she’s been a SAHM ever since while I built a massive career. Not my fault she’s lazy and didn’t work as hard as me!” It’s the craziest thing that it seems like people can’t see. It’s almost chilling.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Every part of your comment is the cold hard truth. Especially how these types of men react once the relationship ends. Economic dependence is such an insidious form of control, and the people who foster it always act like they’re doing a huge favor by bringing home a paycheck when they’re the ones pushing for this arrangement.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "\"She was an academic snob\" why do I get the vibe OP gets a kick of having knocked down a woman with so much potential down so many pegs?",
          "id": 161,
          "comments": [
            {
              "score": 6,
              "content": "Right? Instead of being proud of what she’s achieved he has to already bring her down because it’s inconvenient for him.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6095,
      "content": "INFO\n\n> Initially she wanted to complete it later after finding the funds but she agreed to be a SAHM when I got a good job and **I appreciate that a lot as we were able to have a kid early on** even while I was both completing my masters and working full time.\n\nHow is that a *benefit*? If you waited to have kids she would have her degree.",
      "id": 163,
      "comments": [
        {
          "score": 2432,
          "content": "right???? how does op have a master’s while the wife doesn’t even have a bachelor’s degree? the issue isn’t her not having the lack of degree - it’s that wife WANTED to have the the degree but wife’s plans got derailed by the loan and then the baby - I hope she gets to graduate one day",
          "id": 164,
          "comments": [
            {
              "score": 875,
              "content": "Plus she was studying physics and computer science. Doesn’t sound like she’s not highly intelligent and probably wasting away at home doing chores.",
              "id": 165,
              "comments": [
                {
                  "score": 706,
                  "content": "She literally found the smartest, most financially intelligent, and most efficient way to… get groceries. Even factoring in the gas it would take to go buy the cheaper groceries so it actually was worth it. She’s 100% wasting her potential and is as bored as can possibly be, what an absolute nightmare scenario",
                  "id": 166,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I work in technology and software and am a former computer science teacher and have a family. Some of my favorite and most rewarding moments are putting my skills to use for my family in everyday stuff like getting groceries, budgeting, planning a vacation. It’s much more rewarding to see my wife and kids enjoy the fruits of my labor directly than some rando client I’m working with. That being said, it is messed up that she didn’t get to finish her degree and the OP is most definitely an AH. But it sounds like she is proud of the solutions she finds for family stuff with her intellect. I wouldn’t call it 100% of a waste and nightmare scenario. I’m sure it is for some people, but not all.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 185,
                  "content": "At an Ivy League school, according to OP\n\n🤦‍♂️",
                  "id": 168,
                  "comments": [
                    {
                      "score": 257,
                      "content": "I really think OP is threatened by her intelligence. Now he can’t even let her be smarter than him at the thing she spends all day doing.",
                      "id": 169,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 35,
                      "content": "That makes it even worse.",
                      "id": 170,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "You’re kidding. Oh my goodness, I need to go through these comments.",
                      "id": 171,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 895,
          "content": "Maybe the benefit to him is that she is trapped?",
          "id": 172,
          "comments": [
            {
              "score": 256,
              "content": "Ding ding 🛎!",
              "id": 173,
              "comments": [
                {
                  "score": 24,
                  "content": ">  is that she is trapped\n\nAbsolutely. Because getting married would not have been enough to deal with OP being an AH once she could afford to finish her education. Them being tied together over a kid would have though. \n\nPoor woman. The things I wanted at 23 are far different than the things I want now at 30. And I can't imagine having had a kid at 23 with those differences.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 58,
              "content": "[removed]",
              "id": 175,
              "comments": [
                {
                  "score": 31,
                  "content": "And he doesn’t want her getting all uppity thinking that she’s as smart as him. So Mr. Big Money Masters Degree just tells her that her efforts are so simple anyone can do it. She’s nothing special, he could handle it all himself.\n\nWhy doesn’t he take over some of her “easy” chores and give her the opportunity to go back to school and achieve her potential? Oh yeah, then she might show off and be even more intelligent than him. Imagine if she became \nDr.”Mr. Masters degree”?! We can’t have that!\n\nIf you want some advice OP, grow up, quit being a controlling idiot and help her go back to school. That instead of holding her down and holding her ability to stay here over her head. Before she gets sick of you and moves to her home country with her child.\n\nps: YTA",
                  "id": 176,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "His brood mare with an excellent pedigree, so she is a superior status trophy.",
                  "id": 177,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "And then in 10 years he’ll moan that she’s so boring now, (her brilliant brain having turned to mush in the meantime.) he’ll say she’s boring and start an affair with a 20 something intern/graduate at work and leave his wife with no money and no education to fall back on",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 416,
          "content": "He says something in another comment about wanting his kids to be adults when he's in his older years.  So presumably the benefit is that he'll have yet another person to take care of him.",
          "id": 179,
          "comments": [
            {
              "score": 63,
              "content": "[deleted]",
              "id": 180,
              "comments": [
                {
                  "score": 66,
                  "content": "it would take one year for her to finish. one year is nothing.",
                  "id": 181,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "As a 43 year old father of a 2.5 year old toddler, whose mother is 44, I wholeheartedly agree with this comment.",
                  "id": 182,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "Seeing as this AH is not actually taking care of his kid at all, then what's his fucking point? He just \"wants\" it for whatever reason. More likely, he likes having his wife trapped in a pointless, unfulfilling marriage with him.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "Also that HE wants his kids close in age and her going to school would screw that up. So basically he needs her to have his babies and do his bidding...not to have a life of her own with her own accomplishments.",
              "id": 184,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 128,
          "content": "It's a benefit for OP because now his wife is dependant on him and does not have autonomy in her life. OP clearly gets off on thinking he's smarter and more competent than her.",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "It’s a benefit for sexist dckheads bc that’s a great way of getting whatever tf you want while keeping your wife completely under control. She’s dependent on him and even tho she’s suffering and miserable, it’s unlikely she will leave anytime soon bc they have a child.\n\nAnd now that’s she’s mentioning her degree again, he all of a sudden wants a second child! He even talks about how she‘d be too old to accomplish her dreams afterwards! He‘s sabotaging her life!!! \n\nHe doesn’t want to pay for her education either, even tho he’s bragging about his income. So it’s his money only, not theirs and she has no say in it. Financial abuse at its finest.\n\nOP, YTA YTA YTA and you make my blood boil. I hope karma kicks you in the balls harder than you‘d ever imagine.",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "It’s beneficial to him because he has a bang maid taking care of his kid and he doesn’t have to lift a finger at home apparently",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Especially since they are now 30 and the daughter is 7, making them 23 when they had her. Even considering arguments that they wanted to have children young, they could have waited 3 or 4 years and would have still been in their 20s starting a family. AND she likely would have been able to complete college. smh",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "It’s a benefit to OP because he wants his wife to be reliant on him and therefore much less able to leave. Had she been able to finish her degree, she’d have much more options to leave him for someone who actually treats her with kindness and respect.",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": " If she had a degree and made a career out of it, it would be far easier for her to leave him",
          "id": 190,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Plenty of time left for children AFTER getting her BS and master's!",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4893,
      "content": "YTA. Oh dear. You need to go back to husband school. She was telling you about her day and probably was pleased that she'd shopped the way she did. It might not be rocket science but as well as sharing facts about her day she wanted recognition of her value to you. I will say that again, as you are a slow learner, Mr Masters Degree. SHE WANTED RECOGNITION OF HER VALUE TO YOU.\n\nA comparison of your job skills was inappropriate.  Of course if you blether on about your fancypants finance capabilities, she will feel put down. Your attitude of \"I do really clever financial stuff, so of course I can do your job\" is disrespectful and hurtful. Household management is a skill. It is both practical and requires specialist knowledge. It requires someone who can get things done. You just see the bit of the iceberg that sticks out above the water and you have no idea of how much organisational skill is going into your household.\n\nI suggest you apologise profusely,  give her lots of hugs if she will have them, flowers, chocolates and a wild night in for her. And never, never disrepect what she does ever again.",
      "id": 192,
      "comments": [
        {
          "score": 944,
          "content": "Right? Like he got defensive over something soooo juvenile. Read the room OP. She was looking for validation from you and instead you turned the conversation towards yourself and how amazing you are.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 268,
          "content": "YTA. I agree with anemoschaos. Yes, you can do the math. Yes you can take care of the kid. Can you do it when sleep deprived with the sick kid screaming at you pooping everywhere and no respite of leaving to go to work and knowing you won't get a break from all of this for Years.",
          "id": 194,
          "comments": [
            {
              "score": 25,
              "content": "Yes it's a different skillset that he is not acknowledging.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "And can you do it with the loving patience required of a mother?",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Well said.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": ">  Of course if you blether on about your fancypants finance capabilities, she will feel put down. Your attitude of \"I do really clever financial stuff, so of course I can do your job\" is disrespectful and hurtful. \n\nIt's called contempt and it is the number one cause of divorce.. You better step up OP. \n\n[https://www.gottman.com/blog/this-one-thing-is-the-biggest-predictor-of-divorce/](https://www.gottman.com/blog/this-one-thing-is-the-biggest-predictor-of-divorce/)\n\n[https://youtu.be/AKTyPgwfPgg](https://youtu.be/AKTyPgwfPgg)",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "YES YES YES. Also, let’s put into context the dishwasher loading comment and extrapolate that outwards. Let’s say OP is at work, the office he is employed by has a particular way of doing things, his boss prefers it one way, and he says “well, whatever, I still did the job good enough.” Like, it’s minor, but it bothers me that he doesn’t just ask her how she likes it to be loaded and accommodate that if he is really interested in helping out.  \n\nIdk, the more I read his post, the more I am in agreement… OP is the asshole.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3056,
      "content": "I'm willing to say YTA - BUT - Not in a typical way. Your wife is bored and doesn't feel appreciated. She was sharing all these things with you so you would say wow great job, you're brilliant. Apologize. Tiny human is 7 now? See if she wants to go back to school. Ask her what she's thinking and listen.",
      "id": 200,
      "comments": [
        {
          "score": 1506,
          "content": "And, for Christ sake, don't ever say you are loading the dishwasher \"for her\". You're doing it for your household, this includes YOU. If your wife asks you to do the dishes you're not doing them for her. It's not a gift for her, it's stuff that needs to be done in the house.",
          "id": 201,
          "comments": [
            {
              "score": 255,
              "content": "Alternatively; thank her and gush over her every time she loads the dishwasher, does a load of laundry, mops the floor, scrubs the bathroom, etc. If OP wants praise for doing everyday chores, then he'd better be dishing it out for her too.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "Yeah, Jesus Christ, it’s your house too. Does she never get to “clock off”? No matter the situation of work, both people should be contributing to chores",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "\"I do stuff occasionally when we're both home and she asks me to\" \n\nUuugggghhhhhh",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "He helps out... if she asks. SMH.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "OP is the kind of dad who talks about “babysitting” his own child. I’d put money on it.",
              "id": 206,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "This is a type of a guy who “helps his wife with the child sometimes” 💀",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "^ read this OP. And do as it says. You have an intelligent wife and you better foster that and allow it to grow. If you continue to alienate her, one day she will be gone. She is more than capable of taking care of herself.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "Yuppppppp",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Yeah. Never been married but, a high five and \"nice job, thanks babe,\" would have been my to my partner. \n\nIs what his wife said  petty, maybe a little... is it a cry for help, most definitely... but a conversation about her feeling appreciated and maybe taking up more challenges for her self identity could come later after the easily given high five, when a quiet moment presents itself. \n\nThen you get double points for being empathetic and communicative.",
          "id": 210,
          "comments": [
            {
              "score": 14,
              "content": "You don't have to be married to be a good partner! (High fives also work for friendships!)",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah - I was going to say, she's not exactly going about it in the most healthy/mature way - trying to show you are 'better' than your partner in any area to make yourself feel 'better' - not necessarily cool. But it is so glaringly clear she is looking to feel like she is intelligent and worthwhile. When OP finished explaining the situation and how she became a stay at home mom - double that. \n\nShe really wants confirmation she is a capable, intelligent person in general and that OP sees and appreciates this. \n\nI fully second the suggestion above that discussing if she wants to  return to school or the workforce now that kid is school age would be good. She may really want her own chance at having a fulfilling career or just feeling her talents are valuable and appreciated.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "She wants to go back to school, OP is just pretending she hasn’t directly told him that",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "He’d apparently rather have a second kid than help his wife pay to continue her education. Heaven forbid she gets anything she wants. She gave up everything so he could have the life and career he wanted, and he doesn’t want to give anything back.",
          "id": 214,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "This needs to be top comment.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "\"What would you do without me?\" Is a specific cry for appreciation. This gal probably does so much and and just wants to feel like it matters to more than just herself.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1906,
      "content": "I'll be direct. Yes, you're an AH. \n\nThe problem with men that have money is that we tend to commercialize and tie everything to money. \n\nYou ignore the companionship, the sacrifices, and the love your wife and mother of your kids provide you even after getting bogged out with housework. \n\nYou feel for example, yes I can cook or I can hire a chef, but forget there's a difference between someone who cooks because they love you, and the one who does you pay them to. \n\nHowever, the reason you're an AH is because you fail to recognize how much work goes into the housework she does because you do it once in a while. Take a hint from the fact that when you do it, she complains, but when she does, you don't. Most likely, it means you're not doing it properly. \n\nHousework is hard work, and you should recognize that. But often time, until men have to do it frequently, we don't understand how hard it can be.",
      "id": 217,
      "comments": [
        {
          "score": 823,
          "content": "It's not only how hard housework is, but how unpleasant. I think that even if it was highly paid, it's not a job most people would go for. It's both physically and mentally draining, underestimated, and mostly (this isnt talked about enough) very isolating. \n\nBeing a SAHM is lonely and you are always doing overtime. OP doesnt seem to get his wife is looking for validation through her comments, and he also doesnt seem to get that if she feels the need to ask for it, it's because things at home arent going as smooth as he thinks. \n\nI've seen so many cases of men who are so blindsided by divorce requests, yet they were given every sign that their partners were unhappy.",
          "id": 218,
          "comments": [
            {
              "score": 11,
              "content": "Also, thank you for articulating this so well 💗",
              "id": 219,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Perfectly articulated. Being a maid, a chef, and a child care provider at all is monotonous. Those are the primary tasks of a SAHP. Household manager is another. If you couldn’t afford to pay all of those professionals, and would have to do the work yourself while also working 9-5, you should say a prayer of gratitude everyday that you are privileged enough to have a SAHP. Wage working parents and single parents have to constantly tread water to get it all done and are often drowning as a result.  \n\nBeing a maid and child care provider is often disgusting. They are all physically and mentally taxing. More than that, related to the comment above, people don’t respect this labor because it is primarily done by women and it benefits families and communities instead of making a profit for anyone. So SAHP’s must do this challenging work while facing the stigma in our hyper-individualistic wealth obsessed society that doesn’t value the basic work of caring for humanity. They are constantly receiving the message that they are worthless, lazy, or wasting their potential. SAH dads also gets belittled for doing “women’s work” and SAH moms are constantly being told they are betraying feminism. \n\nI’m not a SAH parent, but this subject makes me so angry because it reflects a broader societal issue where we diminish our humanity to elevate industry and profit.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "Feeling pretty fucking seen, here. Wow. Thank you, and for articulating it so beautifully 🙏",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "So true. Housework is an endless loop. It is never done. You may be able to check something off the list, but chances are, it will need to be redone the next day. It really feels like a thankless job that you have no chance of actually “completing“. \n\nPlus, the amount of emotional and mental labor that SAHP do is very often not recognized. It’s exhausting. Sometimes you just want to fully relax without anyone expecting anything from you, but the spouse that works outside the home often assumes the SAHP had plenty of time to relax while they “were home all day”. But the “working” spouse comes home and expects to relax the whole evening, after all they just worked all day unlike the SAHP. SMH\n\nI’m grateful to have a partner who recognizes that me staying home makes all of our lives easier as I can do things we all need done without also having to work a full-time job outside the home.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "100% all of this. My wife is a SAHM. On occasion I find myself in the position where I’m solo parenting for a fraction of the time she does, and by the end I’m ready to gouge my eyes out and run back to the office. My paid work is measurable and quantifiable with built in structure and breaks. The work at home is constant, thankless, and kids constantly oppose and undo your work you just did. Not their fault, they’re kids, but it’s psychologically exhausting.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I have two young children, 7 and 3. I've always said that I would rather go to my job any day than be a stay-at-home parent. Working outside the house is MUCH easier than raising a child and taking care of a house.\n\n When you are a SAH husband/wife you don't get to \"go home from work\". You are on duty 24 hours a day. The dishwashing doesn't stop because it's after 5:00 p.m. your child doesn't stop crying because it's after 5:00 p.m. My wife only stayed at home for the first few months after our children were born but we agreed early on that she was doing just as much work during the day as I was and when I came home then we both shared responsibility for the house and children.",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Plus he is only able to work that hard and earn that money while having a child \\*because\\* he has her to do all of the unpaid labor. If he was paying her for the services she does for him, chef, maid, surrogate, daycare etc I think SHE would be the rich one. The audacity of this man to say \"she can't afford school without me\" like dude you can't afford your family life WITHOUT HER. You are supposed to be partners. It's not your money alone because the paycheck has your name on it, it's JOINT money, all of it. So yeah I think that she actually can afford to pay her way through school now because she is entitled to half of what you earn because she does 95% of the home and family labor. You get to leave work at the end of the day and you get vacation. She doesn't. So the least you can do is not be a dick to her and talk down to her like she isn't the more intelligent between you two.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1580,
      "content": "“I told her what I do involves more intellect than household operations and for some reason she thinks I called her stupid.” YTA.",
      "id": 226,
      "comments": [
        {
          "score": 205,
          "content": "It would definitely have been better if OP had just said he feels like she is belittling him, so please stop.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "That’s because he did call her stupid! YTA",
          "id": 228,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "OP did essentially call her stupid. Or to use his words \"operated at a lower intellect\"  \n\n\nEdit: Re-read the post, found the quote.",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1128,
      "content": "Maybe she needs a change.\n\nMaybe she's bored and trying to make herself feel more fulfilled.\n\nDoes she want to complete her studies?\n\nHave you asked her?\n\nI'm leaning to YTA as you sound a bit patronising.",
      "id": 230,
      "comments": [
        {
          "score": 554,
          "content": "Op is twisting himself into a pretzel in order to come up with justifications for why she can't/shouldn't go back and finish school. \nInstead, he keeps talking about doing more things to chain her down: 1)he's ready for a second kid, so she should do that first, 2) school is too expensive, after all he only could finish because mom and dad paid for it, 3) it's been too long since she was in school, and on and on.  \n\nDude marriage trapped then baby trapped and is trying to second baby trap.",
          "id": 231,
          "comments": [
            {
              "score": 200,
              "content": "OP is just threatened at his wife's potential. End of story.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 117,
          "content": "Perhaps the change she needs is a less ass-holey husband.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "[deleted]",
          "id": 234,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 805,
      "content": "YTA.  She wasn’t looking to put you down, she’s looking for validation and appreciation of her contributions to the household.  As much as she loves your kids, she probably also finds it mind numbing at times to not have the intellectual challenges of her prior studies in physics and computer science.  Would it kill you yo show a little understanding of that?",
      "id": 235,
      "comments": [
        {
          "score": 144,
          "content": "LMAO at all these replies.\n\n“Goddammit, it’s factually correct that his job requires more intelligence than being a stay at home mom! Therefore! For her to have the gall, nay, the AUDACITY to brag about what little scenarios she can apply her sacrificed intelligence and education. And DARE to tell him that he couldn’t do it?! HA! Does she not know of his intelligence is unmatched by her, for he has recievith thine further education?! EMOTIONAL ABUSE I do declare!”\n\nHahahahahaha \n\nLike…my dudes. Just lie if you don’t mean it I guess, but... Fucking be a man, suck it up, and let your significant other know how much you appreciate their intelligence, kindness, compassion, empathy, etc…with WORDS. And you don’t have to be “correct”! Holy shit. You’re SO can be the smartest, most beautiful, most compassionate creature the world has ever seen…you just…say it…",
          "id": 236,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 703,
      "content": "YTA.\n\n>I do stuff occasionally when we are both home if she asks me to\n\nYou shouldn't need to be asked to clean up your own home. Your wife has agreed to manage the household chores *while you are at work*. Your big boy job doesn't make you incapable of recognizing when chores around the house need to be done (after you get off of work) and doing them without being asked. Your wife isn't your mommy.\n\n>I replied back saying that of course I could do it\n\nCould you do it while caring for your kids, managing meals and snacks, cleaning up after your kids and *then* cleaning up around the house, and running errands? I could guarantee that your wife does more work at home than you do at your job. Just because she isn't getting paid for it doesn't make the work any less grueling. \n\n>she made an offhanded remark that I would never be able to do that and said it in a \"what would you ever do without me?\" kind of way.\n\nWhat *would* you do without her? Without your wife, you would have no one to manage your home or watch after your children while you're being the big important breadwinner. Could you handle \"complex decisions and calculations\" while juggling all the responsibilities your wife so generously handles for you?\n\n>what I do involves more intellect than household operations\n\nDamn, way to call your wife stupid. Low blow, OP. YTA big time.",
      "id": 237,
      "comments": [
        {
          "score": 250,
          "content": "I bet wife is the one who keeps track of dental and doctor appts, etc, too. \n\nOP, do you understand that her work day never ends? And that moms basically sleep with one ear open in case a child cries? While you come home after your big important job and park on your entitled ass? Both of you need to take care of tasks outside of work hours. \n\nAnd yeah, you might be able to replicate how she efficiently handled the grocery shopping. But I bet you have no freaking idea what else she accomplishes and worries about and monitors. \n\nYTA",
          "id": 238,
          "comments": [
            {
              "score": 24,
              "content": "I bet the wife is the one that knows what is going on in their kids lives, their friends, teachers, school. She is the one raising them and there to have conversations about the world and life. She is not only taking care of the household, she is emotionally giving everything to those children and him. He gets reviews and pats of the back at work. Where is her thanks or even just acknowledgement? It's no wonder that so many couples get divorced once the kids are out of the house.",
              "id": 239,
              "comments": [
                {
                  "score": 12,
                  "content": "Another thought, considering how he’s treating his wife how likely is he to encourage his daughter to go to school for something more than an Mrs degree?",
                  "id": 240,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Plus any occasions they have to commit to. Birthdays, christmas, family gatherings. I would bet money that he is the culprit of one of the many mothers day posts on Reddit where the wife gets a \"day off\" that's exactly the same as every other day for her plus some flowers lol men like this are EXACTLY why men get a bad rep. You CAN do better, so DO better. Otherwise I see divorce in your future 🔮",
              "id": 241,
              "comments": [
                {
                  "score": 10,
                  "content": "Yeah, and if she divorces him, he’ll be the first one to call immigration on her as not having a legal reason to stay in the United States. That’s what he holds over her head.",
                  "id": 242,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I just had an argument with my husband yesterday over housework; we both do chores but I have a system and he doesn't. He does dishes or laundry, but doesn't take the time first to figure out what we need. So we end up with literally 20 clean coffee cups but no lunch boxes for our daughter. Clean socks and underwear but no pants. If he's the one writing the grocery list, he gets cereal and he gets stuff to cover dinner, but forgets about lunch. When he's the one who packs lunch for our daughter. It's almost more work when he helps than when he doesn't.",
              "id": 243,
              "comments": [
                {
                  "score": 9,
                  "content": "It is absolutely more work. \n\nBecause now he has spent however much time washing the wrong dishes and when it comes time to make lunches… oh wait, someone has to take *more time* to wash a singular lunchbox. Laundry done out of order? Things take different dry times and it can literally add hours to laundry washing when doing multiple loads. There is time and gas wasted having to go back to the store to buy lunch materials (or the forgotten ingredient for thursdays dinner). Food may get wasted because the menu for the week didn’t use ingredients efficiently and things go bad- or leftovers get forgotten about in the back of the fridge.",
                  "id": 244,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Actually I bet he couldn’t handle the grocery shopping as well as she could. Men (and others) who don’t do it don’t realize that it’s actually quite complex and difficult. \n\nMy kids lunches each have different classroom allergen requirements (one is no nuts, one is no nuts, seeds or eggs) and shopping for that is a nightmare alone.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 150,
          "content": "As a single mom who has the \"big boy job\", OP wouldn't be making these statements if he didn't have a wife. It's stressful keeping up with everything in a household even when you have the means to pay for a nanny and pay for a maid. Bills, house fixes, landscaping, taxes, insurances, groceries, dishes, laundry, meal prep, cleaning...so many things that take up SO much time and getting all of it done after work alone + caring for a child would mean being on the clock 24/7.\n\nI say the wife takes a self-care week with some friends, and we'll see if OP feels the same way when she comes back.",
          "id": 246,
          "comments": [
            {
              "score": 14,
              "content": "There's so much skill involved in GOOD household management: figuring out how to do things effectively and efficiently, so everybody has what they need. Using the right products so it doesn't take an hour to scrub the bath. Remembering to leverage data mining, to get the most money back from supermarket rewards schemes. Checking for cross promotions in case the supermarket chain links up with the clothing store chain, so you can save money on what your child needs for the upcoming season. Mapping out your errands so you're not pinballing all over the city.\n\nI'm sure you know exactly what that's like, but OP has zero clue how much mental labour goes into the logistics of day to day life.",
              "id": 247,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "It’s wild how often men resort to\n\n“But I worked all day, so when I come home I want my wife to mother me.”\n\nAs if she didn’t work all day too? That’s why you work TOGETHER. Not just waiting to be asked to do a chore when you’re home.",
          "id": 248,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I'll bet she has more emotional intelligence, too, which is kind of important in \"household operations.\" Whereas OP has the emotional intelligence of a bag of hammers.\n\nDefinitely YTA.",
          "id": 249,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Well put. I'd like to go back to her comment about \"what would you ever do without me?\" Now why would she say that in the first place? He says he does stuff around the house when asked. So for at least 7 years (because that's how old their kid is), if your partner only helps out when asked, and then not doing the task good enough or half-ass.(going by his remark about his wife doesn't like the way he loads the dishwasher) from the perspective of the wife, to her it doesn't look like he could do her job without her. I'd bet he's pulling that malicious incompetent crap so she wouldn't ask him for help as much. \n\nI'll admit, I don't know these people, but going by OP's original post, followed by his comments, he seems like a piece of work all on his own.",
          "id": 250,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}