{
  "post content": "I feel like a real A hole here.\n\nI've got this friend I've known for the better part of my life, I'm 18 and they about a couple years older. About five years ago he moved city and we lost all contact for awhile. But about a year ago they started calling me and wanted to talk. They had a tough time in school and never found a solid job. I'm sure they felt lonely and just wanted someone to talk to. What started happening is that they talked about subjects like anime and video games, stuff I'm not very interested in.\n\nThe calls felt one sided and I'd had enough after awhile and started making up excuses for them to not call me. They cought onto it after some time though and started asking question about why I did not want to talk. I avoided those conversations as well for awhile because I did not want to make them feel bad for telling them off.\n\nWhen they after months of me avoiding it approched me about it I told them how I felt. I said I had no interest in the calls and that I had more important things to focus on, I've just started my first full time job. I made it clear it was nothing personal but they took it very poorly and have not heard from them anymore.\n\nWhat makes me feel like an A hole is that the last thing they said is that they saw me as a very close friend. I can only ponder on if I was their only friend and if they went through depression now. What else could I have done? I did not want to keep taking calls, but I might just have ruined them.\n\nAm I the A hole here?",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "NAH, this is tough but if you have no interest in talking to someone or being their friend then it's probably better to just rip the bandaid off.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "YTA. for dragging it on",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Any relationship, be it a friendship, romantic relationship, or otherwise, takes work from all parties. It sounds like you lost interest in putting in the work to make this friendship work. Nothing necessarily wrong with that, as you are likely a very different person at 18 than you were at 13. \n\nMy advice: If your only regret is for how the friendship ended, then let it go and you're NTA. If you miss the friend, then call him back and work to make it a two-sided deal.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA, you have your own life to live how you want  to live it, with whom you want to share it with. That said, I feel for both you and this other person. \nUltimately you know the nuances of your relationship, and if you feel like you should reach out that’s certainly okay too. Perhaps you could do or talk about things you are interested in for a change? \nLooking back on my own life, 34 M, I made regretful decisions of letting real friendships wither and die because I was caught up in chasing other things and impressing new people. There’s nothing wrong with that, it’s important too. I also had to let some toxic friends go, because it was damaging to my wellbeing and that was very important and freeing.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI feel like a real A hole here.\n\nI've got this friend I've known for the better part of my life, I'm 18 and they about a couple years older. About five years ago he moved city and we lost all contact for awhile. But about a year ago they started calling me and wanted to talk. They had a tough time in school and never found a solid job. I'm sure they felt lonely and just wanted someone to talk to. What started happening is that they talked about subjects like anime and video games, stuff I'm not very interested in.\n\nThe calls felt one sided and I'd had enough after awhile and started making up excuses for them to not call me. They cought onto it after some time though and started asking question about why I did not want to talk. I avoided those conversations as well for awhile because I did not want to make them feel bad for telling them off.\n\nWhen they after months of me avoiding it approched me about it I told them how I felt. I said I had no interest in the calls and that I had more important things to focus on, I've just started my first full time job. I made it clear it was nothing personal but they took it very poorly and have not heard from them anymore.\n\nWhat makes me feel like an A hole is that the last thing they said is that they saw me as a very close friend. I can only ponder on if I was their only friend and if they went through depression now. What else could I have done? I did not want to keep taking calls, but I might just have ruined them.\n\nAm I the A hole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Soft YTA. This person saw you as someone they enjoyed talking to, and it sounds from your post as if they talked about normal things that they enjoyed. From the language of your post, you seemed to have no interest in interacting with them or acknowledging their passions, which is not friendship behavior. Being busy is one thing, but friendship is a two way street, and you don’t seem like you’re putting a lot into it and are just avoiding it.",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "It seemed very one sided to me. It's not helpful to either one to let him prattle on about his interests with little concern for OP.",
          "id": 9,
          "comments": [
            {
              "score": 2,
              "content": "If this is the case, OP should be up front about it instead of dragging it out.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "tough call but I'm going to say YTA because of this:\n\n>  said I had no interest in the calls and that I had more important things to focus on, I've just started my first full time job. \n\nYou are allowed to not have similar interested, but you could've participated in the conversations with things that you were interested in. You dragged out this \"friendship\" and essentially told them that they were not worth your time.",
      "id": 11,
      "comments": [],
      "relation": "Attack"
    }
  ]
}