{
  "post content": "So I was leaving a restaurant and my wife kid (3) year old lets call her Rachel \n\nSo mil starts saying my daughter is ugly I get pissed and tell her to shut up well she then starts saying my car sucks ass and I should get a more exotic car I tell her if she wants me to get a better car she can pay for it herself and until then she must shut the fuck up. My wife and I were on the same page until her mil tried to unbuckle my daughter I pull over and I was gonna kick her right then but didn't want to make a scene I cuss mil out and my wife starts yelling at me I tell her to stay out of this and stay in her lane and she is pissed and didn't talk after that.\n\nWell mil tests me again and says that I need to get rid of Rachel i m done so I again pull over at a local McDonalds and tell her to gtfo of my car she laughs and refuses I get out of my car then and open her side she then gets out my wife cusses me out saying I can't leave her mother there I tell my wife to get out also and she does also I tell her if she condones this behavior she's a pos and I should divorce her. \n\nI'm getting hella lot of emails and calls and voicemails saying I'm a dick my step daughter even called me and cussed me out.\n\nAITA here?",
  "id": 1,
  "comments": [
    {
      "score": 158,
      "content": "None of this sounds real.",
      "id": 2,
      "comments": [
        {
          "score": 28,
          "content": "Maybe, but who knows? I've seen many episodes like this on the show \"Cops\".",
          "id": 3,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "This. Ovious troll is obvious.",
          "id": 4,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Ik it really sounds like its bs but I have a awful family my wife is nice but when mil is around she acts like she doesn't know me",
          "id": 5,
          "comments": [
            {
              "score": 14,
              "content": "Why the heck was she unbuckling the kid for?",
              "id": 6,
              "comments": [
                {
                  "score": 12,
                  "content": "She said OP has to get rid of Rachel, so...",
                  "id": 7,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "OP, it sounds like your MIL is dangerous. It’s time to go NC with her and keep Rachel away. I suspect that your wife and MIL drink too much together.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 51,
      "content": "What the hell did I just read? ESH. \n\nYour MIL for being cruel AND trying to unbuckle a child in a moving car (what the hell was that about).\n\nYour wife for not standing up to her mother and being an enabler.\n\nYou for telling your wife to \"stay in her lane\". It's a family matter concerning her mother and daughter. It's her lane - she might be an ass, but it's her damn lane.\n\nI feel really sorry for the little girl. What a family.",
      "id": 9,
      "comments": [
        {
          "score": 27,
          "content": "I can't fault OP for this. MIL was telling them to get rid of their three year old and unbuckling her, putting her safety at risk. As a mother, putting a child in danger should be where you draw the damn line.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": ">You for telling your wife to \"stay in her lane\". It's a family matter concerning her mother and daughter. It's her lane - she might be an ass, but it's her damn lane.\n\nIt's not her lane. It is OPs child that his wife's mother was trying to throw outta the car. His wife defending her mother immediately took her outta the lane. He absolutely should divorce her for defending her mom trying to get rid of his daughter.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "The daughter isn't the wife's according to one of OP's comments. Another redditor asked if kiddo is not wife's and OP said \"correct\". I'm not refuting btw, just adding info <3 I do like your breakdown of this though, mostly cause I don't condone this type of behavior in front of kids. Eloquent refute to MIL in a calm manner sure, but knock down drag out cussing matches.... nope",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 20,
      "content": "ESH\n\n\nSo you all are just cursing and yelling and abusing eachother in front of a baby?\n\nYou all should be ashamed!",
      "id": 13,
      "comments": [
        {
          "score": 4,
          "content": "Exactly what I came here to say! ESH, I feel sorry for that poor child growing up with so much anger and negativity.",
          "id": 14,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15,
      "content": "My guess is Rachel isn't your wife's daughter?",
      "id": 15,
      "comments": [
        {
          "score": 20,
          "content": "Correct",
          "id": 16,
          "comments": [
            {
              "score": 20,
              "content": "You need to edit you main post and add that in.....it explains why your MIL hates your kid and why your wife is defending the MIL-- it's not her child.",
              "id": 17,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Then you need to divorce your wife. Do not keep exposing your child to these abusive people. Please care more about your child than getting your dick wet.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "So what you’re telling us is that you married a woman whose mother-in-law abuses your child and your wife allows it and you still stay married to this woman? yeah you’re still the asshole. Like actually a raging asshole because I am going to bet that your wife abuses her when you’re not around and miss treats her when you’re not around 100% would bet if you put cameras you would find her being unbelievably awful to your daughter. There is 100% a reason why your mother-in-law thinks that she can treat your daughter this way and it is because I would bet that your wife talks mad shit about your daughter to her mother-in-law",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "NTA in this situation. People are going to disagree with me, but I wouldn't allow anyone around my 3 yo daughter who commented on her looks, and saying she's ugly, omg! WTF is wrong with your MIL!",
      "id": 20,
      "comments": [
        {
          "score": 1,
          "content": "Yes, but the way OP handled this is ridiculous. Instead of handling things calmly and firmly he jumped right to cussing and yelling. ESH.",
          "id": 21,
          "comments": [
            {
              "score": 3,
              "content": "Oh, yeah, agree with you there. Didn't help anything, and she won't learn her lesson because of this.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "This is just a child trying to make a outrageous post",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "How is this even real????",
      "id": 24,
      "comments": [
        {
          "score": 11,
          "content": "It's not.",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "ESH.\n\nY'all better get your shit together for the sake of the 3-year-old.",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "Your MIL says your “car sucks ass”??? Really?? I highly doubt a MIL uses that type of verbiage….",
      "id": 27,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "Presumably your MIL tried to tell you to \"get rid of\" your 3yr old daughter & that the child is ugly?  ...  \n\nThe whole lot of you suck...",
      "id": 28,
      "comments": [],
      "relation": "No"
    }
  ]
}