{
  "post content": "My best friend and I had opposite priorities during college. She was incredibly responsible and career-focused when we first met in college. She was a Resident Aide, did no partying, and focused on getting through nursing school— forfeiting any invitation to party or indulge in any standard early-20s debauchery. I was a fire-breathing hedonist.\n\nShe became a nurse at 22, shortly married her high school sweetheart, had a kid in our mid-20s, and second kid in our late-20s. I spent a majority of my 20s bartending/doing bottle service, and indulging in much of the life that comes with that.\n\nFlash forward to now (we are in our early 30s), she is divorced, and a single mother of two children. I, have barely established roots to my career but have grown so far from my former night-timing self, to a pretty disciplined adult. I don’t drink, I don’t party, I’m in a healthy/stable relationship, in bed before 8:30, listen more and talk less— I am quite literally the opposite person I was in my 20s— a bore. For the past 5 years, I have always awoken at 3:30 am to go to the gym. More intently now, because I’m training for an Ironman. (All of this she knows.)\n\nI feel like she’s going through a weird Renaissance period— which, I understand a divorce may put you through. Any time we go out and she’s without child(ren), she’s always vying for attention from men. It makes me feel like those we’re those pathetic old bags that are past their prime, hitting outside our weight class lol. It straight up makes me uncomfortable.\n\nSo, we got into a confrontation on the evening of her birthday. We were at dinner with our mutual best girlfriends and my bedtime was shortly approaching. As I announced my plan to leave, best friend proceeded to guilt me into staying as she wanted to have an impromptu night dancing at a nearby bar— “for old times sake.” It did not help that our two other girlfriends (still stuck in their 20s), further goaded me, saying I sucked and was a killjoy. We got into it in front of everyone where I ended up giving her what sounded like a stern scolding from an angry parent to respect my boundaries and it should’ve been enough that I came out this late already. It was just an awkward silence after I spoke, then bye.\n\nAnd that’s the thing, it’s not like I started becoming like this overnight, I have always slept early and awaken even earlier. And I don’t want to party anymore! Hang out with the other two to live out your 20s. 20s me was fun as hell at that time, but I could never go back to that, and I’m sorry you straight up missed out. AITA for being a killjoy and not indulging her on this one day?",
  "id": 1,
  "comments": [
    {
      "score": 2503,
      "content": "ESH. You for acting like early 30's are like being a pensioner - you can still go out and have fun in your 30's, it's not a crime nor is it irresponsible. Nor did your friend 'miss out', she is perfectly young enough to still have fun and go dancing in her 30's . Or 40's . Or 50's!\n\nThey are the asses for trying to force you to do things you don't want to do.",
      "id": 2,
      "comments": [
        {
          "score": 1400,
          "content": "I came to say exactly this. ' we’re those pathetic old bags that are past their prime, hitting outside our weight class lol' ???? like what? i didn't realize i was a pathetic old bag at 34. r i p, me.",
          "id": 3,
          "comments": [
            {
              "score": 437,
              "content": "I’m 35! Certainly don’t feel either old or pathetic - frankly I feel in the prime of my life! I go out dancing with my husband and friends frequently in normal times!",
              "id": 4,
              "comments": [
                {
                  "score": 285,
                  "content": "I live on an island and I see 70 year olds who are still out dancing. I don't see what's wrong with that. ESH.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 36,
                      "content": "I want to come to your island!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "My mom is in her 70s, and was partying up a storm at my BFF's wedding (in normal times!). My friend's 89 year old grandmother likes to go out to \"the disco\" a few times a year, and is always the last person on the floor at any wedding. She says partying with the \"young pups keeps her young.\" She's probably not wrong!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Florida Keys?",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 115,
                  "content": "Oh no, I will be 36 this year. Life is over :D. \n\nI am not much of a party person myself (never was), but come on, I totally would if that was my jam! I do like outdoor bars tho \\^\\^.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 86,
                      "content": "I’m 36 and can confirm, am just killing time on Reddit while waiting for death 🙃",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Ha, as a youth in my prime, move out the slow lane grandma! You think you're young? Are you downing your weight daily in tequila? Thought not *beep beep* \n\nYeah, nah, deffo, ESH",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 170,
              "content": "I’m 39, and typing this from my crypt.",
              "id": 12,
              "comments": [
                {
                  "score": 117,
                  "content": "I’m 47 and do you know how hard it is to move dust in patterns to hit the keyboard?",
                  "id": 13,
                  "comments": [
                    {
                      "score": 55,
                      "content": "47? Sure you haven't been pressurized into oil yet?",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "same... coughing up dust as I type this out",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "34?? Heck that’s even past early 30’s, hope you enjoy your retirement!",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "I didn’t feel like i actually started loving my life until I was mid 30’s. My 20’s was stress off building my career, having kids and generally figuring out life every time it kicked me. Now that I’m pushing 40 I’m really starting to feel like I can securely live. Didn’t know I was... a degenerate, according to op lol",
              "id": 17,
              "comments": [
                {
                  "score": 12,
                  "content": "And the student loans!! Once I got into my 30s and started workout out from under that pile I felt so much freer",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I swear my 30s are the best. I'm finally comfortable and confident in who I am, have a tried and true group of friends, *and* I have the money to actually spend on the things I like! Though I will admit hangovers hit much harder now...that's the only down side.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I'm 36 and I was confused.  Yes, I'm middle aged,  but there's not...a time limit on flirting?",
              "id": 20,
              "comments": [
                {
                  "score": 63,
                  "content": "Middle aged at 36????? WTF? I'm forty & I'm planning to live until I'm atleast 106 so I won't be middle aged until 52. You need to start thinking bigger.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Average life span is 76, so middle age is 35-45 mathematically (upper and lower bound could shift further out technically)",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I had to go back and find their ages because I thought I had missed a decade or two.\n\nWTH, OP? You're in your 30s, not 70s. And even if you were in your 70s... you do you, and let them do them.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I'm 48 and up until COVID I still went out dancing. OP sounds insufferable. She went straight from her 20s to Get Off My Lawn.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yup, I’m also 34, has your pension check come yet? I’m still waiting. \n\nYTA because this could very easily be you in your 40s regretting putting yourself out to pasture so early.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "It sounds like OP is one of those folks who partied so hard in their 20s that they just totally lost the energy/joy for it.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I’m 38, does this mean it’s time for me to check myself into a nursing home? YTA to OP. That is such a toxic mentality to say “old bags” “past their prime” no one should force you to do anything however eww. Hope you learn no one is past their prime ever in life. E V E R",
              "id": 27,
              "comments": [
                {
                  "score": 2,
                  "content": "I love that——no one is past their prime ever in life. That is such a great way of thinking. I’ve been feeling weird as a 42 year old with no kids but kinda working on it, so that just really hit home for me. Anyway-thanks for putting it that way! 😃",
                  "id": 28,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My cousin died before she turned 26 (her and I were 6 months apart) it’s changed my perspective on a lot of things in my life. 1.) aging is a privilege denied to many 2.) no such thing as “prime” years 3.) life is short so make yourself happy.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Op is being SUPeR judgements here. Tell your friends to respect your boundaries although I don’t think it would kill you to go out with them once either. You’re 30 you’re not dead! \n\nSo what if your single friend wants to meet dudes? So what if she wants to go have fun? There isn’t an age limit on dancing. You’re coming off very judgmental and it’s not a good look.",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "This. Like thanks for calling me a pathetic old bag. While I definitely can’t handle going out like I did in my 20s, I still more than happy to have some fun.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yes, please ladies in your 40s go out.\n\nIt's a weird trip having women asking me out for once instead of the sheer amount of anxiety and shame the comes from being rejected repeatedly.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yea, at 35 I only go to bed by 830 when I'm sick. Holy hell. I mean it sorta makes sense cuz she wakes up at 3am but not a single person I know in their 30s does that craziness.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And even if you are a pensioner, no rule against having a drink with your mates once in a while.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Right. You can enforce your boundaries without beating everyone over the head with how immature you think they’re being for having fun. Heck. There are times in my twenties I’d shown up to night clubs that raged all night and been acutely aware that I was the youngest person there by two decades. Those people weren’t sad old sacks punching above their class, they were people in their 40s and 50s who enjoyed dancing and drinking on weekends. Heck, many night clubs I know that aren’t dedicated college bars cater to people in their late twenties and thirties, because young kids can’t afford bottle service and $15 cocktails.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This!!\n\nI once had a friend annoyed with me cos we went to a bar, she thought I was being hit on by a guy (he wasn’t, he was alone and stuck in the city and actually just had the nicest conversation with me, standing a good 3ft away - pre Covid, this was just a respectful distance)\n\nI was a grand dame in the group at a massively old 40",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Soooo this!\n\nI’m 36. I don’t consider myself anywhere near being an “old bag”! \n\nI don’t drink often and I party even less. But would I? Yep - if I was planning for it I sure would let loose and have fun still!\n\nI just know the hangover will be worse if I drink too much. But, I’m also better at drinking water and eating food which helps reduce to hangover so it probably evens out.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "If there is something you don’t want to do and you have thoroughly expressed what that is, then you shouldn’t be guilted or hounded into doing it. It doesn’t matter what it is or your age range or what the masses consider fun anymore. That’s what a boundary is, and boundaries are there for a reason. OP isn’t an asshole for wanting her boundaries to be respected by her friends being okay with her doing what makes her happy and comfortable.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1092,
      "content": "What makes you the asshole here is your attitude. You sound like your completely full of yourself and think your better than your friends. YTA.",
      "id": 39,
      "comments": [
        {
          "score": 171,
          "content": "[deleted]",
          "id": 40,
          "comments": [
            {
              "score": 81,
              "content": "Not even the same thing. It's her birthday and she wants to go out dancing. That's normal.\n\nAnd her \"friend\" thinks she's a used up old hag that's embarrassing herself if she tries to flirt? No one needs that friend.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Exactly! I think we all need to try at least once even if it’s not our fave.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -335,
          "content": "Comments like this is the essence of how good this page is. Thanks for not holding back.",
          "id": 43,
          "comments": [
            {
              "score": 232,
              "content": "You also seem to think you're a pensioner at 30 which is dumb.  You call being 30 a pensioner, but maybe it's cause you're just boring and have given up on enjoying life.",
              "id": 44,
              "comments": [
                {
                  "score": -52,
                  "content": "Where did OP call herself a pensioner? Nowhere. You're just agreeing and rewording the top comment. If everyone was saying OP was in the right you'd be here agreeing. You're barely a person. Do you even have your own opinions on anything?\n\nWhat is boring about going to bed early? Are you automatically boring if you sleep in? \n\nIf her friends don't want to be scolded maybe they should show some respect and just say goodnight when OP wants to leave. What do you think she should have done? Went and partied? Left without explaining and defending herself? \n\nDo people here even think or is whatever the first essay posted the stance everyone takes?",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 689,
      "content": "ESH. She absolutely should respect your boundaries, but you’re acting like someone in their early 30’s wanting to go stay out past 8pm on their birthday is unreasonable. It’s not, you guys are in your early 30’s, you’re not ‘pathetic old bags that are past their prime’. Seriously, stop judging your friend so harshly.",
      "id": 46,
      "comments": [
        {
          "score": 212,
          "content": "When I read the title my brain immediately went to nights in my 20s where I stayed out till the bars closed and then went to an overnight dinner at like 3 in the morning for something unhealthy and finally crashed at like 4...to wake my ass up at 8 and go to class. Because yeah if someone wanted me to do that now I’d probably cry.\n\nBut staying out past 8 on your best friends birthday is not an unreasonable ask.",
          "id": 47,
          "comments": [
            {
              "score": 32,
              "content": "She does get up at 330am to train. Staying up \"late\" for the dinner was fine, her friend asking her to go to the bar should have been met with; I have to be up at 330am to train for my ironman.",
              "id": 48,
              "comments": [
                {
                  "score": 90,
                  "content": "I definitely get that but it’s not unheard for someone to take a day off training. It’s even recommended. And her friends wanting to go out to a bar doesn’t mean they’re still living in their twenties.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 87,
                      "content": "She could have scheduled her training around her friends birthday. \n\nThe idea of her just busting out at 8pm and calling everyone else pathetic omg! \n\nYou can still have fun as an adult.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Op could've adjusted her training schedule. I would for my best friends bday to make sure that I could celebrate with her, especially if she was going through a divorce.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "my mum worked nights in her early 30s, and on her days off the reason she didn't party was because she had a child to take care of.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 582,
      "content": "Nta for not wanting to stay out late but yta for how you're talking about your friend. Who cares if she wants to party and bang dudes when she doesn't have her children? There's no age limit on that.",
      "id": 53,
      "comments": [
        {
          "score": -227,
          "content": "Absolutely fair. I suppose I should’ve been clearer that she is entitled to do what she wants, as long as I am not forcibly included.",
          "id": 54,
          "comments": [
            {
              "score": 268,
              "content": "You're a grown adult, no one can force you to stay out. It kind of sounds like you overreacted. I don't drink and also tend to be the friend that wants to go home the earliest. I'll get the c'mon just hang out a little longer from friends and it never ends in me lecturing them about boundaries and awkward silence. It sounds like your opinion on them staying out late is coloring your responses to them. It is definitely possible to decline an invitation without being an ah.",
              "id": 55,
              "comments": [
                {
                  "score": 15,
                  "content": "This. So much this.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yep. Just saying no and leaving is an option! Her friends shouldn’t push but there are graceful ways to say goodnight anyways.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "Except that you have called her pathetic for that. You sound judgemental and arrogant, as if you think yourself miles above her. Also, there is a difference between asking your best friend to stay out once, on your birthday, and trying to force you to go partying every weekend, which is what the title suggests. YTA",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 93,
              "content": "Were you planning on leaving at 8p to make your 8:30 bedtime? That's one detail that would help.",
              "id": 59,
              "comments": [
                {
                  "score": -171,
                  "content": "It was implied because every event prior to this one, I have always left at 8. They have even adjusted dinner times for me for this reason.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 251,
                      "content": "Wow that’s kind of them to accommodate your needs. But on her birthday yoy don’t get to insult her about what she wants to do.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 105,
                      "content": "Leaving at 8 on your friends birthday? You guys must not be very close friends.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 57,
                      "content": "Omg I didn’t actually think you would leave for your 8:30 pm bedtime 😂😂 \n\nThat’s literally the beginning of the night wtf",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "And she's your best friend, you say? They accommodate you but you can't stay out an extra hour for your best friend's birthday? ESH",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "That is so early.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "Use your grown up voice and say no.",
              "id": 66,
              "comments": [
                {
                  "score": 2,
                  "content": "She did and they started calling her a killjoy.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Then you just leave.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Honestly, I don't know why they include you at all. It must be because they don't know how you really feel about them.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Now you just sound like a whiny teenager. You are in your 30s (and so am I, for that matter), nobody will \"forcibly include\" you in anything. You're your own person, you're free to leave anytime you like",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 343,
      "content": "ESH your friend absolutely needs to respect your boundaries and decision and if you want to be in bed by 8:30, so be it. But your friends aren't stuck in their 20s, they just have a different lifestyle to you and the way you talk about them is with very little empathy and respect. Your personality isn't defined by your age and the fact she spent her 20s being responsible and working on her career and family life should tell you this. Also, bit judgemental saying flirting with men makes you feel like a pathetic old bag past her prime. Maybe you should have some introspection and try and figure out what you mean by \"prime\" and why it makes you so uncomfortable.\n\nEdit: changed it to ESH from ETA...",
      "id": 71,
      "comments": [
        {
          "score": 31,
          "content": "Hey, just an FYI! There's no ETA here. The abbreviation is ESH for Everyone Sucks Here.",
          "id": 72,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "ETA doesn’t mean anything",
          "id": 73,
          "comments": [
            {
              "score": 91,
              "content": "It means lots of things!\n\nEstimated time of arrival\nEdited to add\nExpected to announce\nEating Tacos Always....",
              "id": 74,
              "comments": [
                {
                  "score": 20,
                  "content": "Oh, I'd like some tacos",
                  "id": 75,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Estimated time of arrival of op to her bed is earlier than people in their 70s",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "God damn it I meant ESH!",
              "id": 77,
              "comments": [
                {
                  "score": 5,
                  "content": "You can edit the post to reflect that",
                  "id": 78,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yup done it now!",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 331,
      "content": "Uh it kinda sounds like YTA. She's in her 30s, not her 70s. She can go dance at the bar and receive attention from men if she wants to, especially as a divorcee - you aren't obviously required to attend but don't project your own age insecurity on her",
      "id": 80,
      "comments": [
        {
          "score": 151,
          "content": "If she was in her 70s, she could still go dance at the bar and flirt with men. Old ladies out on the town are fabulous. There's no age where you're not allowed to have fun!",
          "id": 81,
          "comments": [
            {
              "score": 37,
              "content": "Right you are - I was just trying to be pithy",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "> She's in her 30s, not her 70s.\n\nI regularly danced with women of all ages, including one woman in her 70s. If someone wants to dance, dance. I'd wish it was possible again.",
          "id": 83,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Especially on her birthday!",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yeah, tbh. I get that pushing her even she said No is TA but OP's whole attitude in this post is just pure assholish.\n\n30 ain't that old. 30 ain't gonna make you magically be, \"I'm this age, I feel mature and these are the actions I deem mature, therefore I'm right.\" That ain't it. You don't prefer clubbing at your 30s? That's fine. But some people want to catch up, and that's also fine. What's not fine is judging others for what they want to do. YTA with a slight ESH because of the friends (but I feel that just sounded like the \"cmon loosen up\" /peer pressure/ you get the jist? Idk I may be wrong, but I rest my case.)",
          "id": 85,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -2,
          "content": "OP said nothing about stopping them from having fun, she's upset because they don't respect the boundaries she has asked for. Having to say no over and over again to 3 people who won't listen is frustrating as fuck.  You twisted the story around to fit your judgement and are calling her the asshole based on something that didn't happen.",
          "id": 86,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -106,
          "content": "I should’ve clarified that she can do whatever makes her happy as long as I don’t get dragged into it?\n\nAnd I definitely have age insecurity, I admit that.",
          "id": 87,
          "comments": [
            {
              "score": 120,
              "content": "Dude, you made it *suuuper* clear how judgmental you are of anyone who doesn't act like a boring old person like you. There's no backpedaling you can do here. You're an ass for gatekeeping other people's lifestyles and saying such nasty things about your friends (not to mention anyone over the age of thirty who does completely normal fun things like date and stay out late... Yeesh).\n\nIf you're*really* so happy with how your life is going, why are you clearly so hung up on what other people are doing? Your insecurity and nastiness are on full display here. (And you were presumably tying to portray your side of the story in the best light? *Yikes*) You're not fooling anyone here.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "Set a harder boundary about what you want to do with your evenings with your friends - my girlfriend is a party girl and I've had to tell her that when she goes out with her friends I'm likely only going to be down to go out to a bar and get buck wild maybe one in four times. I'm way more of a homebody by nature. You wouldn't be the asshole for simply not wanting to participate in an activity that doesn't suit you",
              "id": 89,
              "comments": [
                {
                  "score": -35,
                  "content": "I have boundaries for sure, but I suppose I need to make them even more clearer. That sounds like a fair compromise you have going. But are you really an asshole for simply not wanting to participate in an activity that doesn’t suit you? Or just close-minded?",
                  "id": 90,
                  "comments": [
                    {
                      "score": 106,
                      "content": "I can tell you that you are *definitely* extremely closed minded. Most of your post was judgmental posturing about what you think people *should* be doing in their thirties. You didn't even have to say any of that to make your point, but you couldn't help it, even though all it does is make you look waaay worse.\n\nIf you don't like your friends (it *really* seems like you don't) then just find new ones that you have more in common with, instead of acting like a helpless victim because your friends peer pressured you into staying out late for a birthday party. This nasty judgmental attitude you have going here is beyond unflattering and it's just plain mean. You might want to consider you're not that much of a prize to hang out with yourself. Friends don't talk about friends the way you talk about your \"friends.\"",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 79,
                      "content": "Yea pretty sure no one is ever going to ask you out past 8 after this",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "It's not you different idea of fun that has everyone here branding you an AH, it's your serious judgement of people you claim to consider friends.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "Nobody thinks you're an asshole for going home. Everybody thinks you're an asshole for judging your friends in such a gross way. It strikes me as a little mysogynistic too - women are often judged for aging, while men gain more respect usually. Plus you're disgusted by her flirting - why? She's allowed to want male attention.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "That didn't make you the asshole. Saying, \"no\" is okay! But the way you typed everything in your post, saying that [non-verbatim] your friend shouldn't flirt with guys at her age etc. etc. is just soooo judgmental. Any preferred lifestyle is fine as long as it's not harmful to yourself nor to others.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Aw man, well I'm glad you can see it! I totally support your early-to-bed, early-to-rise, intense training life choices! But as everyone has mentioned, you're dripping condescension for your friends, and that's something you can work on. \n\nYou might be the arsehole here, but you can learn to do better, and you can talk to your friends about loving them but prioritising your training. It is hard when you're training intensely, people don't get how much it takes over your life - but when you don't have a competition coming up, maybe do consider letting loose once in a while? You don't have to go to clubs, but you don't need to never ever be a bit silly (unless you really don't want to, of course).",
              "id": 96,
              "comments": [
                {
                  "score": -5,
                  "content": "Thank you for this very understanding and constructive response. I can definitely work on being less condescending. As you are aware of how time-consuming this race is, it's so important to me. But I'm sure I can find a better balance accommodating both somehow while being less of an arsehole.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 27,
                      "content": "And work on your age insecurity ffs",
                      "id": 98,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I believe you can! I assume you have years of rapport built up with your friends, it's definitely something you can talk to them about - or I hope so, anyway. \n\nNone of this is to dismiss pressuring you, by the way. You're just all going through a lot of changes and tempers can be high when you are talking at cross purposes, especially right now.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "You’re going to hit your 40s and realize this was silly",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'd like to see what you do if your relationship doesn't work out. You're not even married.",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 229,
      "content": "There is nothing normal about being in bed by 8.30, without exception,  in your early 30s. \nI'm 41, and honestly,  I'd probably blow off a friend who insisted on going home to bed before 8 even on my birthday",
      "id": 102,
      "comments": [
        {
          "score": 44,
          "content": "Myself and my other 30s friends are in no way big party animals but we've barely started at 8.30pm when we meet for dinner. And that's usually alcohol-free!",
          "id": 103,
          "comments": [
            {
              "score": 17,
              "content": "My grandparent's parties usually start at 7pm and go till midnight, and most of the guests there were/are in their 70s or 80s, some people would always leave at like 10 ish, but that was usually the YOUNGER of their friends who has kids at home...",
              "id": 104,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "The OP has a reason to be going to bed that early, but I agree. Being in your way over the hill 30s isnt reason enough to be going to bed so early",
          "id": 105,
          "comments": [
            {
              "score": 104,
              "content": "I feel like most people would blow off ONE morning at the gym to spend more time with their friend on her birthday.",
              "id": 106,
              "comments": [
                {
                  "score": 36,
                  "content": "Know a ton of heavy athletes and people in Ironman training and none of them wouldn’t organize their day/training around something like this, rather than the other way around",
                  "id": 107,
                  "comments": [
                    {
                      "score": 59,
                      "content": "Especially when OP says in another comment that they regularly change their plans around to accomodate OP's early bed time. To me, that makes OP a huge asshole, to be accomodated to all the time,  and not for one freaking night go out dancing with the birthday girl.\n\nLike, on one hand, I totally agree and understand that OP's friends should respect her boundaries. OTOH, given OPs attitude, I wonder what exactly was said. I wonder if after OP said no, someone did say something about how they move stuff for OP and can't OP reciprocate for once.\n\nAll I know is that after this, assuming I did still have a friendship with OP, it wouldn't be the same.",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "You can miss one morning of working out to party with your friends, or push the workout to later in the day.  I lift or run 6-7 days a week, usually first thing in the morning, but I shuffle my schedule all the time if need be.\n\nAnd 8:30 bedtime?  If I'm out with other adults, I'm looking for a reservation that *starts* at that time.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Yeah, in before times just grabbing dinner with friends generally meant being out to 9 or 10 in the evening easily. Having a friend that was cutting out at 8 constantly would be annoying, especially if they couldn’t make an exception for my birthday.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "My 84 year old grandma doesn’t even go to bed at 8:30",
          "id": 111,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -3,
          "content": "It's perfectly normal for people who get up early",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -8,
          "content": "[deleted]",
          "id": 113,
          "comments": [
            {
              "score": 6,
              "content": "Yeah, but that's to go to the gym by choice,  not to start a shift",
              "id": 114,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I’m currently training for an Ironman.  It’s like a yearlong process.  If you’re completely inflexible about your training sessions, even on your best friend of 15 years’ birthday, that’s an extremely unhealthy attitude towards the whole thing",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 136,
      "content": "Nta for not wanting to stay out late. YTA for how you described your friend now. Just because she’s in her 30s doesn’t mean she can’t stay out late and have fun once in a while and flirt with dudes. Sounds like you two are just on totally different pages which is fine but you don’t have to be so judgmental.",
      "id": 116,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 126,
      "content": "YTA - Thirties isn't *old*, bloody hell.  You're acting like a night out dancing is going to risk breaking a hip!  \n\n\"Pathetic old bags past their prime\"?  Yikes, be nicer to yourself.\n\nShe's not an asshole for wanting to stay out and dance - on her birthday! - and you're not an asshole for *not* wanting to dance, but it was an asshole move to get into a lecture about it.\n\nI'd probably have went E-S-H because she's not great calling you a killjoy, but - I'm sorry - to be honest you do sound like a bit of a killjoy.  You've painted yourself as this sensible, boring adult and she's your crazy, childish friend.  \n\nYou do you, but there's no need to look down your nose at anyone else.  The best thing about getting older is not giving a shit about what you're \"meant\" to be doing, whether that's going out dancing all night, or staying in to watch Disney movies.",
      "id": 117,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 104,
      "content": "YTA for your attitude. Wanting to have fun in their 30’s and not go to bed the same time their grandparents do doesn’t mean they’re stuck in their 20’s.",
      "id": 118,
      "comments": [
        {
          "score": 21,
          "content": "Even my grandpa who literally grew up on a farm usually went to bed at 9 or 9:30 instead of 8:30. It isn't even dark out at 8:30 like a quarter of the year!",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}