{
  "post content": "I’m on mobile. Formatting. Etc.\n\nAt the beginning of this semester I moved into a new apartment owned by my university. When I applied to live here I wasn’t told that there would be frequent construction going on in the complex as well as our apartment. The apartment is in really good shape and i don’t really have any issues with it. Currently the only thing needing to be fixed is a huge square hole they cut in our ceiling. It’s been there since the beginning of February and they have yet to do anything with it.\n      As soon as the semester started we began receiving papers saying that our apartment could be entered between 9 am and 5 pm for a full month. I was frustrated with the first one but figured I couldn’t do much about it. At the end of that month we received another of these letters. I feel like giving staff the ability to enter an apartment at anytime is intrusive. I’m constantly on edge about being able to shower during the day because what if I step into my room to find a staff member? I can’t even take a short nap between school work because half the time I’m woken up by someone needing to work on the apartment. \n       I feel like I live in a constant state of being prepared for someone to enter my room. I can’t relax until after 5 pm. My roommates and I keep a tidy apartment so we don’t have an issue with receiving a citation for cleanliness. I have an anxiety disorder and i feel like this constant stress is making it harder on me to be a functioning person. I feel like I don’t have my own space because of this. I also feel like a have almost no privacy.\n       I just need to know if I’m being an asshole about this.  I would like to complain to my university housing department but maybe I’m just being way too sensitive. I understand that sometimes things need to be fixed but currently our apartment is fine and livable. Summer is approaching and we are being kicked out for further improvements to the apartment. I don’t understand why these issues they see can’t wait until then. \n\n\n\n\nUpdate: After reviewing the housing policy it seems they are able to enter whenever they see fit for maintenance. Thank you to everyone for the advice. I will be discussing it with housing and possibly taking it further if needed. ",
  "id": 1,
  "comments": [
    {
      "score": 10,
      "content": "NAH.  The anxiety disorder is the asshole.  I don't see the harm in talking to them about it.",
      "id": 2,
      "comments": [
        {
          "score": 4,
          "content": "Thank you! The anxiety 100% plays a big role in this issue. ",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "Good luck!  The fact that you are evaluating your thought process so carefully means you are on top of your condition so kudos to you.  School is hard enough with anxiety.  I hope it works out for you :)",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "I wouldn't confront them about them entering, I would confront them about renting out apartments that were actively under renovation if there's no mention of it whatsoever on any documents for advertising or anything you signed. ",
      "id": 5,
      "comments": [
        {
          "score": 4,
          "content": "I hadn’t thought about it that way. This place was described as “luxury” which yes for a college apartment it’s pretty nice. Thought i wouldn’t consider constant construction luxury at all. ",
          "id": 6,
          "comments": [
            {
              "score": 3,
              "content": "It's kinda like a pill to cure migraines not mentioning that it has vertigo as a side effect. Even if you'd be willing to take that pill knowing about that side effect, it doesn't make it any more right to be sold it without that information being on the package.  ",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA. \n\nUniversity's need to communicate better. \n\nWhen I applied for accomodation they failed to mention there would be construction work on one side of the building. It hasn't affect me much because I'm on the other side. However for some other people, Its caused issues with their water and sleep. ",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA. You shouldn't have accepted those intrusion terms. Those are not reasonable. In most states, they would not be enforceable unless there was an immediate health or safety hazard.\n\nCheck and see if that agreement is legal now.  Even if the school owns the housing and you go to the school, you still get tenant protections under the law in your area.",
      "id": 9,
      "comments": [
        {
          "score": 2,
          "content": "I will look into that thank you! ",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nI’m on mobile. Formatting. Etc.\n\nAt the beginning of this semester I moved into a new apartment owned by my university. When I applied to live here I wasn’t told that there would be frequent construction going on in the complex as well as our apartment. The apartment is in really good shape and i don’t really have any issues with it. Currently the only thing needing to be fixed is a huge square hole they cut in our ceiling. It’s been there since the beginning of February and they have yet to do anything with it.\n      As soon as the semester started we began receiving papers saying that our apartment could be entered between 9 am and 5 pm for a full month. I was frustrated with the first one but figured I couldn’t do much about it. At the end of that month we received another of these letters. I feel like giving staff the ability to enter an apartment at anytime is intrusive. I’m constantly on edge about being able to shower during the day because what if I step into my room to find a staff member? I can’t even take a short nap between school work because half the time I’m woken up by someone needing to work on the apartment. \n       I feel like I live in a constant state of being prepared for someone to enter my room. I can’t relax until after 5 pm. My roommates and I keep a tidy apartment so we don’t have an issue with receiving a citation for cleanliness. I have an anxiety disorder and i feel like this constant stress is making it harder on me to be a functioning person. I feel like I don’t have my own space because of this. I also feel like a have almost no privacy.\n       I just need to know if I’m being an asshole about this.  I would like to complain to my university housing department but maybe I’m just being way too sensitive. I understand that sometimes things need to be fixed but currently our apartment is fine and livable. Summer is approaching and we are being kicked out for further improvements to the apartment. I don’t understand why these issues they see can’t wait until then. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, put one of the following abbreviations in your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "You should post this in r/legaladvice \n\nThat doesn’t sound legal to me. ",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "I honestly considered that and almost posted there instead of here. I’m a broke college student though and have zero resources (or money) to take any type of legal action. ",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "Post over there.   Your school may have legal options, you can potentially get free consultations etc.  you may not even need a lawyer.   It never hurts to ask ",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}