{
  "post content": "  I (26f) recently got a new flatmate (25m), renting one of the rooms in an apartment in my name. The two other people living here are away for weeks at the time, so it's mostly me and him (especially in the past 5 weeks). He's friendly and social and everything has been great for the first 3 months, we hung out and I felt comfortable hanging around the flat looking like sh\\*t, which is very important to me, as I am one of those people who recharge batteries away from social situations.\n\nHe recently got a girlfriend, who seems nice and rents a room in an flat nearby. Even though we had all agreed to try and give one other fair warning when bringing someone home, he lets me know she's coming over approximately 30 seconds before she arrives. As I feel uncomfortable being the extra-person in the room during date nights and snuggle time, I tend to either go out or lock myself in my room when he brings her home (she always comes over mid-week and after 9pm and I don’t love going out in the snow just to give them space). Kitchen and living room are the same room, so I only use the bathroom and smoke out of my bedroom window.\n\nLast week I was on my way home from work, looking forward to taking off my bra and relaxing on the couch in front of the TV. As I walked in he told me she was on her way over and they were going to cook and have a romantic dinner. She had already been over 3 three times during the same week, talking loudly right outside my door late at night knowing I had an early shift. So I snapped and told him \"It's okay for tonight, but this cannot be an everyday thing, next time please go to her place\". I apologized for the tone a couple minutes later, but I stood by my statement. He wants me to be comfortable having her around the apartment, and it's nice of him, but he also said he'd like her to stay over every night and his bed is more comfortable than hers so he'd rather have her sleep here.\n\nI don't want to be the a\\*\\*hole who tells him she cannot come over, and I am aware that there is no real issue with me looking like shit or sitting in the common areas while she's there, but I simply don't feel comfortable. I didn't rent the room to a couple because I've lived with couples before and it was a nightmare (it's not nice having to third wheel every time you want to watch a movie on the couch in your own home). Obviously, he should be able to have his girlfriend over, but it's starting to be too often and he's taking over the entire apartment, since at this point, I'm either out or in my room. This is the first time he lives in a shared flat, he's always had his own place and that results in him not really thinking about anyone else other than himself when it comes to shared spaces. Talking to him hasn’t given any results.\n\nI need to know: AITA for not wanting her to come over every day or is it reasonable to say no to something that makes me feel uncomfortable in my own home?",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": "NAH. The fact that you live in a shared space now goes both ways—he should be considerate, and you can’t expect him to not use shared space\n\nAs long as it’s not to the point where she’s basically moved in (which she hasn’t) and isn’t doing anything particularly disruptive (she’s not), it’s not really fair to limit his use of the space\n\nBut, he should communicate better anyway since it’s not just his space, either\n\nI think you’d be better off communicating with him about what you would like—for example, that you like to unwind for a bit at X time\n\nOverall it sounds like a roommate compatibility issue more than an asshole situation",
      "id": 2,
      "comments": [
        {
          "score": -1,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 6,
              "content": "Unless OP added a comment I’m unaware of, the Gf hasn’t moved in. The other dude is allowed to get a gf and use the common space \n\nIt just sounds like a frank conversation is in order. So far no one has done anything assholeish",
              "id": 4,
              "comments": [
                {
                  "score": 0,
                  "content": "He wants her to sleep there every single night.  To me, that's saying he wants to move her in.",
                  "id": 5,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA. When you share a living space with someone, you both have to compromise and work out a way to share the space so you're both happy. As long as the rules are reasonable, apply to everyone living there, including you, and everyone agrees on them, they're fine (like no partners at the flat more than x number of days in a row/week and must provide x amount of notice).",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. He needs to realize that he is not being courteous at all. You say you’ve spoken to him and can’t get through, maybe talk to his GF. Explain to her that you don’t mind her being there occasionally, but it’s happening way too frequently and it’s making you very uncomfortable. She rents a room as well, hopefully she understands better how to be courteous in a shared living situation and will understand. Otherwise, you may need to explain to him that if he can’t keep his end of the agreement, he needs to find other accommodations.",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "He pays just as much as her and has every right to use that shared space. Besides the one time they were talking loudly, the only other problem was that it made her uncomfortable which to me, is your own problem to fix, not someone else's. You can't ask a grown adult in their mid-twenties to not do normal adult things. So as long as her problem stems from her being uncomfortable and not the loud talking being an every night occurrence, I'm leaning more towards NAH.",
          "id": 8,
          "comments": [
            {
              "score": 3,
              "content": "She clearly states they had set boundaries about these types of situations that he’s not following now that he had a GF. It’s a communal space, why would he want to have a romantic night and cook dinner when he know that the actual person he rents the room from is going to be there and that he never told her of these plans. He doesn’t pay just as much as her. She has two other roommates and is on the lease. He just recently rented the room from her. I stand by my opinion.",
              "id": 9,
              "comments": [
                {
                  "score": 3,
                  "content": "It's a communal space so he can use it however he sees fit. You can still have a romantic dinner with someone else in the room. Again, this sounds like she's uncomfortable because she doesn't like being a third-wheel.\n\n&#x200B;\n\nSolution to that: get your own TV.\n\n&#x200B;\n\nI too live with 3 other roommates, all who have SO's who stay over most nights of the week so at any given time there is usually 7 of us in a 1200 sq. ft apartments. We have all seem to make it work, romantic dinners included and she can't seem to get comfortable with just 3 of them.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 2,
                      "content": "To be fair, I had a bad experience renting my extra room a few years ago, so that’s probably why I can’t see it from both points. I decided to never let another person move in my house again the experience was so bad. You’re most likely right, or at least unbiased.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA I think you need to have a meeting and establish household rules regarding having guest over. In the meantime after the second/third night I would hang out on my couch and watch tv even if they are there. It might make you uncomfortable but your roommate might be counting on that. Call his bluff and enjoy your living area.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "ESH\n\nhe pays rent and therefore is allowed to have guests. that's it.\n\nbut that said, if you're uncomfortable then you two need to have a talk about it.\n\neither way, the relationship is 3 months old. the frequency of her visits will start to die down.",
      "id": 13,
      "comments": [
        {
          "score": 0,
          "content": "[deleted]",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "i dont see if OP mentions the girlfriend is staying over each night, just that she is visiting.",
              "id": 15,
              "comments": [
                {
                  "score": 1,
                  "content": ">He wants me to be comfortable having her around the apartment, and it's nice of him, but he also said he'd like her to stay over every night and his bed is more comfortable than hers so he'd rather have her sleep here.\n\nand his AITA question in the last line is in regards to her coming over every day.  \n\nGuests do not come over every day and sleep there every night.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n  I (26f) recently got a new flatmate (25m), renting one of the rooms in an apartment in my name. The two other people living here are away for weeks at the time, so it's mostly me and him (especially in the past 5 weeks). He's friendly and social and everything has been great for the first 3 months, we hung out and I felt comfortable hanging around the flat looking like sh\\*t, which is very important to me, as I am one of those people who recharge batteries away from social situations.\n\nHe recently got a girlfriend, who seems nice and rents a room in an flat nearby. Even though we had all agreed to try and give one other fair warning when bringing someone home, he lets me know she's coming over approximately 30 seconds before she arrives. As I feel uncomfortable being the extra-person in the room during date nights and snuggle time, I tend to either go out or lock myself in my room when he brings her home (she always comes over mid-week and after 9pm and I don’t love going out in the snow just to give them space). Kitchen and living room are the same room, so I only use the bathroom and smoke out of my bedroom window.\n\nLast week I was on my way home from work, looking forward to taking off my bra and relaxing on the couch in front of the TV. As I walked in he told me she was on her way over and they were going to cook and have a romantic dinner. She had already been over 3 three times during the same week, talking loudly right outside my door late at night knowing I had an early shift. So I snapped and told him \"It's okay for tonight, but this cannot be an everyday thing, next time please go to her place\". I apologized for the tone a couple minutes later, but I stood by my statement. He wants me to be comfortable having her around the apartment, and it's nice of him, but he also said he'd like her to stay over every night and his bed is more comfortable than hers so he'd rather have her sleep here.\n\nI don't want to be the a\\*\\*hole who tells him she cannot come over, and I am aware that there is no real issue with me looking like shit or sitting in the common areas while she's there, but I simply don't feel comfortable. I didn't rent the room to a couple because I've lived with couples before and it was a nightmare (it's not nice having to third wheel every time you want to watch a movie on the couch in your own home). Obviously, he should be able to have his girlfriend over, but it's starting to be too often and he's taking over the entire apartment, since at this point, I'm either out or in my room. This is the first time he lives in a shared flat, he's always had his own place and that results in him not really thinking about anyone else other than himself when it comes to shared spaces. Talking to him hasn’t given any results.\n\nI need to know: AITA for not wanting her to come over every day or is it reasonable to say no to something that makes me feel uncomfortable in my own home?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH. You’re allowed to set rules and boundaries for a household. Just try to make sure everyone is on board. You’re not being unreasonable; and your roommate will find somewhere else to live if they don’t like the rules.",
      "id": 19,
      "comments": [],
      "relation": "No"
    }
  ]
}