{
  "post content": "Pretty straightforward I got a lock for my four year olds room. My son is only four but he’s super in the collecting things. (He has autism) He has probably every single monster jam monster truck ever made, he has every single marvel/DC/superhero action figure you could think of, and he’s really into setting up these huge marble runs. Everything is organized and put away nicely and my son likes to keep it that way. \n\nThe problem is that every time my best friends kids or my nephew comes over, they b-line it to his room and trash everything. Literally from ripping off legs to The action figures, ripping off tires to his monster trucks and just trashing every single toy that they can get their hands on in general. I’m not even talking about just normal wear and tear these kids are fucking like destructive and they will destroy almost everything they put their hands on. \n\nThe marbles end up all over my house and lost. He also has a collection of those squishy toys and one of the kids literally will not keep their hands off of them and bites a hole in one every single time, ruining it. I used to go through his room and have to hide everything before they came over to try to avoid this but I have literally had it at this point so I told them they are no longer allowed in my sons room period. \n\nThey can play with the huge bin of toys that I have in the living room or one of the 100’s of toys outside ect. Of course it didn’t go over well and the kids started throwing a fit because they know what’s in his room and the toys “aren’t good enough and they’re bored”. and my sister and best friend are both saying that I’m being too much and saying that they’re just toys. But these toys are expensive, we spent hours building the marble run just for it to get torn down the absolute second they walk in the door. \n\nAnd after everyone’s gone and the room is trashed and all his toys are broken and misplaced he’s really upset over it. Rightfully IMO. They say I am teaching him not to share and to be greedy but I disagree. I think they need to teach their kids basic respect for other people stuff and to not throw a fit when they can’t have something. I wouldn’t have a problem with them going in there and playing with the stuff if they were even the least bit respectful about it but proven time and time again that they can’t handle it. \n\nNow they don’t want to come over with their kids because they think I’m being an asshole and I honestly don’t care. I also believe that you should teach your kids to share but not everything HAS to be shared you can have specific things to just keep for yourself. I’m just curious as to what everyone else thinks am I the asshole or no??\n\n(Edit to add spacing)\n\nEdit UPDATE:\n\nI’m just not gonna have them over anymore. I explain to them what everyone is saying in the comments and while they agreed, nothing will ever change. (With my best friend, my sister is 100% on board) \nThey came over (besties kids) two times since the incident and now that they’re not allowed in the room they just find other shit to get into in the house.  Next best thing to get into this time it was the pantry. \n\n\nI just come to realize that these kids are monsters it doesn’t matter what situation they’re put in they will find away to be horrible. Everything they do is because she allows it at her own home. Claims she doesn’t but the kids wouldn’t act like that if she were telling the truth. I don’t want to ruin my 15 year friendship because I do love my best friend I just hate her kids so I don’t know what to do. 😬😬😬\n\nUPDATE: I haven’t spoken to said bestie since November. Sucks a 15 year friendship ended but my life has never been more peaceful. My nephew is a lot better as well!",
  "id": 1,
  "comments": [
    {
      "score": 5097,
      "content": "NTA.\nThese kids don't respect \"no\", and they don't respect your child's belongings. I'm sure your child is willing to \"share\" every toy in the entire rest of the house - just not his special ones. And that's fine!! As you said, not everything has to be shared. And sharing doesn't mean \"I get to do whatever I want to your stuff\".\n\nIf a lock on the door is what it takes to keep the hooligans in line, then lock that door, and don't feel bad about it.",
      "id": 2,
      "comments": [
        {
          "score": 2582,
          "content": "Yes! 100% they can play with ANYTHING else in the house. I love how the hundreds of strangers on the Internet can get this so simply but the people who I’m trying to explain this to cannot 😂🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️",
          "id": 3,
          "comments": [
            {
              "score": 1665,
              "content": "They understand just fine. They just want you to cave. I find embracing accusations stalls those conversations. “Yes, I’m teaching him to be selfish. And I’m still not unlocking the door.”",
              "id": 4,
              "comments": [
                {
                  "score": 531,
                  "content": "Why do you think they have kids that destroy other's stuff.  Like child like parent.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 680,
                      "content": "Lemme guess, sister and bestie have never offered to help clean, fix, or reimburse for the damages either, right? I wouldn't be shocked in the slightest. \n\nNTA.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 386,
                  "content": "I’d tell them “ no I’m teaching him it’s alright to set boundaries and you’re allowed to say no.”\n\nThat’s all you’re teaching him-\n\nThey on the other hand are teaching their kids they are entitled to everything, other peoples boundaries mean nothing and if they throw a big enough temper tantrum they can get what they want.\n\nStellar parenting right there/s\n\nNTA- we need to teach kids to advocate for themselves, that they can speak up if they don’t like something someone is doing and that they are allowed to have boundaries.\n\nAlso your son doesn’t have an issue sharing his favorite toys he has an issue with vicious little goblins coming over and purposely destroying his things.\n\nThis I don’t think is even an autism thing- who would be okay with someone doing this?\n\nI doubt if you took your kid over to their house and he trashed everything he could get his hands on they’d just wave it off as nothing.\n\nYou said they are now refusing to come over? Good- your little one doesn’t need these toxic influences and allowing them to continue is just telling your kid that his feelings and boundaries don’t matter.\n\nYou handled this entirely right (I mean I’d of just flat out banned them but the lock works too).",
                  "id": 7,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Have my free award! You said everything I was thinking!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Not too late to ban them. Bet they start on the other toys next if they don't get to destroy his.\n\nAlso as a parent of an autistic child, it can be especially traumatic for them. Not that it's not for any other kid but the level it ramps up is insane.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "*vicious little goblins*",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Please have mine as well. You are spot on!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Take my award too! Very eloquent.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "it's not ok even with an allistic kid. but son being autistic makes it even worse. we can have a harder time regulating emotions so this is much more upsetting for OPs son than likely would be for allistic child same age. in the same vein, it's very possible that playing with those particular toys is part of what helps him regulate his emotions and sensory input. A lot of us either get overwhelmed from sensory input, or we crave certain types of it to help regulate. Those marble runs are sensory gold mines. throw in the narrowed interests a lot of us have, and it's very possible those particular toys are one of the or one of only few, things that really makes son happy. all the family saying she TA don't understand her son's autism and don't care to. otherwise they'd understand exactly /why/ those toys are so important to him.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I am teaching him other people asking doesn't mean he has to say yes especially when said people destroy their possessions. \n\nOP the trash took itself out. I bet those kids don't destroy their own toys.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Nah, just ask them if it's okay for her to go into their houses and take the legs of their tables, couches and chairs.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I like that, it’s like a judo move.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And it's not surprising the kids can't handle \"no\" when it seems their parents can't either. Can't teach what you don't understand. Sad and ridiculous. NTA.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 275,
              "content": "It is called boundaries.  Strangers on the internet are not being affected by your boundaries.  People close to you are.  Don't worry, however, your boundaries are reasonable.",
              "id": 18,
              "comments": [
                {
                  "score": 261,
                  "content": "Right! The saying “The only people who become angry when you set boundaries are the people who benefitted from you having none.” Applies here.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 160,
              "content": ">They say I am teaching him not to share and to be greedy but I disagree\n\nYour son does share. *they* are teaching him to regret it. If he stops sharing, it's a direct result of how sharing with these kids has turned out for him in his past.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "Go over to their houses and rip personal belongings off their shelves and out of their drawers. If they complain, just tell them that they’re just THINGS, and they shouldn’t get stressed out over it. \n\n(Don’t actually do this. It’d be petty and unproductive. I can dream, anyway. But it might be worth phrasing it to them this way, at least.)",
              "id": 21,
              "comments": [
                {
                  "score": 11,
                  "content": "Dump a jar of spaghetti sauce into friend's purse and say \"What?!? It's just a bag! It's no big deal! \"",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 102,
              "content": "They want you to cave because they don’t want to parent their own children. \n\nThis wouldn’t be an issue if they had raised children to treat other people’s things with respect. Then maybe they could play in your son’s room respectfully and put things back where they belong and not tear things up. \n\nYou didn’t put a lock on your son’s door, they did via bad parenting. I also think they are horrible for not cleaning up after their own children. \n\nFrankly they are doing you a favor for not bringing their kids back imo. When they told me they weren’t coming over anymore, my response would have been a simple - OK. \n\nNTA.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "NTA\n\nAnd then multiply that a few times because your son has autism. I have an extended family member with autism, and they don't necessarily process these kinds of things like other kids. You absolutely did the right thing.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "My cousins were like this when I was little. It was like they honed in to the only toys that you loved the most and then tear them apart, they were older than me as well. Stuffed rabbits head ripped off, doll house playsets trampled into plastic shards, dolls drawn all over with marker pen.\n\nBut when I went over theirs I wasn't allowed to touch a thing! I ended up gathering all my precious items and putting them in this wooden toy box I had and sitting on it the entire time they were there. Of course I got pushed off by them 9 times out of 10. My mum banned them from going upstairs but they'd find a way to sneak off and rummage upstairs. I hated them. Don't bother with them at all.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "They just don't want to acknowledge the kind of selfish entitled monsters they are raising.  Also sounds like they are used to walking all over you.  I would encourage you to take a look at your relationship with each of the parents.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Next time, tell them you want their car keys. When they balk, ask them why they don't want to share.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Oh, they understand, they're just assholes, plain and simple. \n\nI'm a parent myself and I still can't believe what jerks people turn into once they pop out a kid.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Exactly. NTA OP. When I was a child my Moms cousins kid would come over and destroy me and my siblings toys. Ripping heads, arms and legs off barbies and action figures. Smashing toys into the floor until they broke and trying to steal toys when they left (my Mom always caught them). It came to a point where my Mom stopped inviting them over and her cousin was mad. My Mom didn't back down though since cousin refused to teach their kid manners. That kid now is in jail and addicted to drugs.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Why do you even want people that let their kids act like this at your house?  I can't imagine your son's stuff is the only thing being ruined.",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "My best friend used to scour her kid's room before her rowdy nieces and nephews came to visit. Anything vulnerable that her son didn't want to share or have damaged went into a big Army duffle bag in the garage every single time. \n\nShe said it was easier than calling out the little Chucky doll family members.",
          "id": 31,
          "comments": [
            {
              "score": 18,
              "content": "Great plan; garage and duffel bag. When my kids grubby cousins came over, I had them put the stuff they didn’t want to share (i.e., get trashed) in my closet, behind my closed bedroom door. \n\nOne evening I was shocked to see a grubby cousin emerging from MY bedroom, holding my son’s guitar, proudly announcing, “Look what I found!”",
              "id": 32,
              "comments": [
                {
                  "score": 13,
                  "content": "I would have grabbed the back of his grubby jeans and escorted him and his parents out. \n\nThat little hooligan probably had his first mug shot way before the age of 20.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 6,
                      "content": "No kidding! Considering some of the other things he and his brothers did, it wouldn’t have surprised me, but they turned out ok.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Honestly, sounds like OP just needs to send these ladies a bill for the damaged toys, since they think its ok for other people's property to be destroyed, they can damn well replace them too.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "THIS RIGHT HERE.  NTA. Nothing at all wrong about having certain rooms locked when guests are over.  I'm not sure why this is even an issue. Your sis and best friend shouldn't be making an issue about this at all.  If the kids are 4, they'll forget soon enough what was in your son's room and be happy with the other toys.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "If you need to lock the door, you’re putting a bandaid on the real problem: these people’s kids come over and destroy another kid’s toys and the parents think it’s fine and OP should just pay up so they don’t need to parent. \n\nIf the kids can’t destroy the 4 teal old’s toys, they’ll soon move to adult items that look interesting. \n\nWhy would you keep inviting these people into your home and call them ‘best friend’? A friend doesn’t stand by while your kid’s beloved toys get destroyed. \n\nThere should never have been a second chance for those kids to go unsupervised into the room and wreak havoc. And now they and their parents DEMAND they’ll be allowed to destroy his toys? That’s enemy action. \n\nIf OP keeps inviting them, she enables them to bully her kid.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1245,
      "content": "HOLY CRAP, NTA\n\nYour sisters are beyond assholes though. \n\nYou're not teaching your kid to be greedy or not share.  You're teaching your kid that he has a right to his own space and to set proper boundaries with people who disrespect him or his space. \n\nYour sisters seem to have taught their kids that it's okay to destroy things that aren't theirs, though, and that's terrible. \n\nYour son has a right to say NO.  He's a person (even if he's a young person!). Because he's a child, you as his mother have a right to say NO on his behalf. \n\nAlso, if your sisters have a crap about YOUR kid, they would've taken the time to do the most general research on autism and would therefor recognize how important environment and personal spaces can be to a lot of individuals on the spectrum.\n\nETA: Had to correct some typos!  Never text while angry lol",
      "id": 38,
      "comments": [
        {
          "score": 510,
          "content": "I’m about to show my sisters this comment specifically because 🎯🎯",
          "id": 39,
          "comments": [
            {
              "score": 443,
              "content": "Quite frankly, any child who purposely destroyed my kids' things and the parents weren't horrified immediately apologizing and insisting to reimburse us would not be allowed over my house again. Maybe all play dates should take place at their houses from now on.",
              "id": 40,
              "comments": [
                {
                  "score": 283,
                  "content": "Yep, I'm surprised OP even the lets the feral wee shits in their house at all, tbh.\nIf they can't treat your son or his belongings with respect, they can stay away until they learn.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 155,
                      "content": "“Feral wee shits” 😂😂😂😂😂😂😂",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Oh, Lordy! 'Feral Wee Shits!' I had a cousin who was one of those miscreants!\n\nHad because all that 'feral' finally did her in.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "Seriously.  this would have happened once (1) time at my house. If the parents of the other kids weren’t apologizing or telling their kids to stop, those kids would not be invited or welcome back in my house until they showed they can act like normal people and not wild animals. This isn’t even an autism thing on the OP’s kid, this is the other kid’s blatant disrespect for other people’s property and the parent’s inability to take responsibility for their kid’s actions.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Yup, if I had guests over with kids acting like this they would never be invited over again and I'd reconsider my relationship with the parents for raising such shitty kids.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Seriously?  OP's asking about a lock?  That would only be useful if they're *already on the property*.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Consider the future. Kids already banned may not come over ever again but what if OP's son makes a friend in elementary, they come over, and prove to be just as destructive as the son's cousins? It's a preventative measure and it helps ensure OP can guage the future kids coming over with the regularly available toys before considering letting them into their son's room where the good stuff are.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "This concept where “sharing” as a child means “letting other people have full access to all of your belongings at all times” makes no sense to me. As an adult, when I visit someone else’s home, I don’t expect to:\n\n* test drive their car\n\n* raid their fridge / pantry for any food I like\n\n* test out their expensive electronics \n\n* try on their brand name clothes & shoes\n\n* put on their prestige brand makeup\n\nSo why do we make children “share” all of their most prized possessions with someone that might ruin them? I can almost guarantee that if OP walked into these objectors’ houses & started using all of their stuff, they wouldn’t see it as just harmless sharing.",
              "id": 48,
              "comments": [
                {
                  "score": 15,
                  "content": "I wish I could upvote this comment more than once! So true!!\n\nOP NTA but keep your child's door locked, if you decide to let them come over. And tell them to bring their OWN toys to play with.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "That is AWESOME!\n\nWe all learn to share when it comes to communal items like in school... there's plenty of emphasis on sharing throughout elementary school. \n\nWhat we DON'T teach enough of is setting and ensuring healthy, appropriate boundaries with people - ESPECIALLY with people we love or are close to.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Ask everyone why they are not making their children apologize to your child and replace everything they break in your house. Most parents would be horrified if their child broke another child's toys, make their child apologize, and replace the toy. Your house rules are perfect and don't change anything.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "If your sister reads this she needs to realize that letting her child make a huge mess and then leaving is a real AH move as well. You clean up after your children, don't leave it for someone who was gracious enough to host to have to tidy up the destruction of your little tornado.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "There is something that I believe is even more disturbing: they said that these are \"just toys\"... Well. You said it yourself that these are expensive toys. A way for them to be forced to reflect on the consequences of their kids actions is to send them a bill, detailing the cost of replacing every single item that their kids destroyed.\n\nObviously they will complain and say that is too much money, that is when you come in and say: couldn't agree more. And it seems very unfair that I have to pay for it since your children are the one breaking them, don't you say???",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You need to buy your son a \"My First Chainsaw\" and let him at your sisters house / nephew's toys!",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Visit your sister, and go into her kitchen and do exactly what her kids do to your son's room.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Any update you would like to give OP?",
              "id": 56,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "Thing is, autism has nothing to do with it! Every child should be able to (within reason) have personal space and personal items that's just for them. It can be a special plushie, it can be their favorite comfy chair, that varies family to family, child to child. But there should always be something that they feel is truly theirs.",
          "id": 57,
          "comments": [
            {
              "score": 57,
              "content": "Oh absolutely... I'm sorry if maybe I wasn't clear enough on went I was bringing up his autism in my response. \n\nYou're absolutely right that ALL kids should be allowed to have personal space and healthy boundaries!!\n\nI brought up his autism because rigid thought processes, especially with regards to environment, are HUGELY common amongst us neurodivergent folks.  Not everybody but enough of us to be a commonly discussed issue.  And while being neurodivergent or neurotypical doesn't make you more or less entitled to your own space, you'd think this mother's sisters would have at least the most BASIC idea of why this child might be more sensitive to things being broken or messy than their own kids and why maybe THEIR frame of reference for what's acceptable is moot here.",
              "id": 58,
              "comments": [
                {
                  "score": 35,
                  "content": "Sorry, I always get fired up when people act like kids shouldn't have their own special/personal things or a space to call their own (not you, but OPs sisters). Everyone parents differently and all, but something about the idea that \"all things must be communal and shared\" just makes my skin crawl. I really feel like always knowing that I could have my own space and my own personal items as a kid helped empower me to effectively communicate that as an adult. I learned what reasonable boundaries look like, and what being a selfish jerk looks like. It's part of a healthy learning process.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Again, I'm right there with you.  I know exactly why this kind of thing gives me the heebie jeebies... it's because if a kid isn't allowed to have their own space what are the odds they're allowed bodily autonomy??  People who act like everything should be communally shared are the same kind of people that force kids to give hugs and kisses when they don't want to. \n\nAnd that slippery slope just gets worse and worse.  People forget that kids are still human beings.  They're not dolls to play with or dogs to train.  They're their own person and everyone should be sides the dignity to act as their own person.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 342,
      "content": "NTA. Unless those parents are willing to replace everything that gets broken EVERYTIME, they can either play with the toys available or bring their own. \n\nI'd make a list of all the items that have broken to date (and the cost) and present it to the parents. If they're willing to pay it, then playdates can resume. If not, they can stop complaining as a debt is owed. \n\nThose kids should be taught to respect other people's things. And their parents are at fault for that.",
      "id": 61,
      "comments": [
        {
          "score": 98,
          "content": "Yeah tell them you’ll unlock the door OP. IF they’re willing to put down a $500 damage deposit first.",
          "id": 62,
          "comments": [
            {
              "score": 25,
              "content": "Nope ,doubt that's enough.",
              "id": 63,
              "comments": [
                {
                  "score": 20,
                  "content": "NGL I just picked a nice round number large enough that people like this would balk at. OP should absolutely use a number more appropriate to their items.",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Nope. Peace of mind and keeping a four year old from being traumatized is more important than the monetary value of everything in that room.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "As well as paying for the hundreds of dollars of damages already caused.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Even if they were willing to replace everything, every single time, it's still fucked up to expect a four-year-old to have his shit broken. And, basic manners shouldn't go out the window just because you have enough money to throw around.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 276,
      "content": "NTA.  \n  \nFuck those asshole parents.  Tell them they're welcome to bring their kids if they will put the room back exactly like it was.  Take two or three reference photos.  They will not take you up on this.  They want YOU to pay for their shitty parenting.  Nope.",
      "id": 68,
      "comments": [
        {
          "score": 267,
          "content": "That’s the thing is they swear up and down that they were going to clean up the room and they’ll put everything back where they found it but by the end of the night but you know that never happens. So yeah I think the lock is the best idea. And the two specific kids that I’m talking about are 6 and 8 years old so they 100% know better they just blatantly don’t do it.",
          "id": 69,
          "comments": [
            {
              "score": 128,
              "content": "Yeah, their parents have taught them they can trash your kids room with impunity.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Would they even be able to put things back the way your son wants them? I work with kiddos with ASD and the degree of detail with which some of them can organize their stuff is amazing. They notice the tiniest changes. (These are the kids that can kick my butt at games like memory, lol). Your son gets to decide what he is willing to allow others to play with or touch.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "6 and 8?! I thought you were talking about toddlers with the way they acted! Holy crap NTA, they’re old enough to understand respecting other peoples property",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Just mildly say “maybe when they are older.” On repeat. “They aren’t old enough to respect other people’s possessions but don’t worry, they’ll get there.”  “I kept promising Bobby they would clean at the end, but since I could not keep that promise I had to promise to keep them out instead.” “We can maybe try again when they are older.”",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I just wouldn't let the kids come over anymore. Go to them instead and refuse to let them in your house until their parents teach them how to not be destructive monsters. Do they trash their own toys or just your kids?",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "NTA.\nGet the lock for your son's room, if your sisters are offended, too bad. My son (6 years old at that time) was playing with his best friend, he broke the belt on the ninja turtle figurine that belonged to his friend, his grandmother was very angry when she showed me the belt, I didn't argue and bought a new figurine to replace it and told my son to be careful how he handled the toys, no issues with broken toys after that.\n\nWhen we moved to a new neighborhood I banned a couple of my son's friends because they started getting into stuff they shouldn't have been doing, my husband played in a co-ed softball league, in his softball bag side pocket he kept some change, some dollar bills, these friends stole the money, my son and his other friends told me what they did, I allowed the other friends to come over to play but told the other 2 they would not be coming over anymore to play at our house, I told them I will not be standing there watching them to make sure they don't go rummaging where they are not allowed, if I can't trust them they are uninvited and not welcomed anymore, sounds harsh but I didn't give in even when they said they were sorry and please let them come over to play.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "They say that, then they don't. Why would you give the same empty promise any weight?\nYour kid NEEDS a safe space. If not his bedroom in his own home, then where? Their \"fixing it\" isn't close to acceptable after destroying his treasured possessions in his most personal space, even if they did, which they don't.\n\nDestroying treasured possessions is abuse. Not \"kids will be kids,\" abuse. Your son isn't safe with these abusers.\nWhat will you do about that?",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Honestly autism is almost beside the point.\nIf I lend someone a purse or a shirt or a dish, you don’t get to put a hole in it and say “it’s just a dish.”\nPeople who borrow things are supposed to return it in the condition it’s in. \nSix or eight is way too old to just rip the legs off someone else’s toy. Does he treat his own stuff thst way? Do they bite holes in their own stuffed animals?",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Honestly, YTA for letting this go on for so long. Your poor kid, I feel with him. And I'm not on the spectrum.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Why do you let them do that a second time? I would not have invited them back",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 196,
      "content": "NTA\n\nWhy do you even want to have these women and their children over? They're disrespectful of other's space and belongings.",
      "id": 80,
      "comments": [
        {
          "score": 87,
          "content": "This is the part I don’t get. When I read “every time,” I was like “what do you mean by every time?!?!? Why are they still coming?” Trash any part of my house once, they’re freaking banned. Actually, I wouldn’t have even let it get that far. First sign of destruction, they’d be asked to stay in the living room with their parents or GTFO. I would have slapped them with a bill and chewed those parents’ heads off before they even can accuse me of being an AH.",
          "id": 81,
          "comments": [
            {
              "score": 11,
              "content": "Yeah OP is TA for letting this ever happen in the first place.  If someone is destroying your kids stuff step in and stop it immediately.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I don't think I could be friends with someone who doesn't teach their children basic manners.",
          "id": 83,
          "comments": [
            {
              "score": 7,
              "content": "Exactly. I have dropped friendships over these sort of things if the parents thought that behaviour was ok.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Honestly, this actually makes me consider a Y T A rating. The OP's son shouldn't need to put a lock his own door in his own home just to keep his stuff safe from guests. If they can't respect the space and its owners, they shouldn't be invited.",
          "id": 85,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Right?",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 91,
      "content": "NTA - next time you're at their house, go in the kids room, trash the place and then leave. If they call you to complain, tell them exactly what they told you.\n\nI have a friend who is not allowed to bring her kids to my house because every time they're here she ignores them and they destroy my kids' belongings. I took my kids to her house and told them before we got out of the car \"don't bother cleaning up after yourself, just have fun.\" And they did. And she called me on my way home saying OMG THEY JUST DUMPED TOYS EVERYWHERE. I said \"And? Your kids do that and more every time you're at my house and you KNOW they don't clean up! Be mad all you want but you get what you give!\"",
      "id": 87,
      "comments": [
        {
          "score": 12,
          "content": "How did she respond?",
          "id": 88,
          "comments": [
            {
              "score": 18,
              "content": "Seeing as I've known her for a very long time and she knows I don't take anyone's bullshit, she agreed that her kids did make messes and she was sorry. I apologized for having to do what I did to make my point and my kids are back to cleaning up after themselves.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 76,
      "content": "NTA, your response to these other parents is your child knows how to share, but their kids dont know how to respect others peoples  property..",
      "id": 90,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 64,
      "content": "NTA. They don't want to come over anymore? Good. Let 'em. You are protecting YOUR THINGS which YOU PAID FOR and you're protecting your son. Imagine being a child's parent and just letting kids, family or not, come into his room, supposed to be his safe space, trash absolutely all the stuff he likes and quite likely has special attachment to, and then just waving them off with a smile like nothing happened to keep the peace with the parents who don't want to actually raise their children and just expect YOU to put up with the behaviour they are NOT correcting. \n\nAbsolutely not, you've done the right thing and you're being a good parent.",
      "id": 91,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 62,
      "content": "NTA. My son has autism. His things are foreign coins and bills. Nobody is allowed in his room except myself, my husband and my daughter. My daughter is a gem and helps him with his sorting and putting things in a collector book. I don’t even let my cleaning person in his room. It is the one room my son and I clean together. \n\nAnd yeah, my son is a gem too.",
      "id": 92,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 61,
      "content": "NTA. That level of destruction is not acceptable. Your son needs to know his personal space and special things are safe, and all of the children involved are old enough to learn that 'no' is an acceptable answer in some cases when asked to share.",
      "id": 93,
      "comments": [],
      "relation": "Support"
    }
  ]
}