{
  "post content": "My son is a 20 month old toddler, my wife is a stay-at-home mom, I work six days a week and I'm usually gone for twelve hours a day.\n\nI always check in on my son remotely via our nursery cam app and he's always awake in the mornings around 8:00. He has a great sleep routine. Our \"wind down\" time starts at the same time every evening, we clean up toys, read a book, when I lay him down he's still awake, he falls asleep on his own and sleeps all night for at least twelve hours.\n\nIt's usually after 9:00 before I have a chance to check the camera, this morning when I checked it was 9:12 and some mornings are closer to 10:00. Every time I look though, he's awake in the dark and standing in his crib just waiting. When I see this, I immediately turn on the brightest night light the camera has and speak to him through the camera app. I always tell him good morning and I love him and he usually laughs and says \"Dada\". Then I leave the app and call my wife to wake her up.\n\nI usually have to call three to four times and when she finally answers, it's obvious that she just woke up and only because I called. I tell her that our son is awake waiting for her and that she needs to get up to start their day.\n\nThis morning while on the phone, I asked her if she was going to get him after using the bathroom and she said no, she was going to the kitchen to prepare their breakfast and THEN she'd get him. I asked her to get him after the bathroom so he could go to the kitchen with her and she flipped out. She told me it pisses her off that I call EVERY morning to tell her how to be a mom and that she has a routine. I retorted with \"well, your routine sucks because he's been awake for an hour and you'd still be asleep if I hadn't called\".\n\nI just bothers me that he has to wait so long. He needs a diaper change, he's probably thirsty, hungry and just wants to play.\n\nAm I wrong though? Do I need to stop? Please be completely honest with your answers. Thanks!\n\n\n\n**EDIT #1**\n\n\n\nI was banned from commenting within the first hour because I violated a rule in a comment and that's why I wasn't responding to anyone. I'm a fairly new Reddit user in terms of posting - I normally read a lot and that's all - and because of this, I had no clue that a temporary comment ban didn't affect my ability to edit the post. I would have edited the post much sooner had I known I was able to regardless of the comment ban.\n\nThere are so many things that need to be addressed about this post and the most important one is about my wife. I love her more than anyone on Reddit thinks I do. She is an amazing woman and a wonderful mother. I absolutely DO NOT think she is an incompetent parent nor do I think she neglects my son. None of the information I provided was ever supposed to convey that negative message about her.\n\nMy whole issue was: \"he's awake, he's been awake, why are you still asleep?\" - that's all, and she agreed she stays up too late plus has alarms set now.\n\nI showed my wife how this post EXPLODED and she COULD NOT believe the kind of attention it got. She is very much in love with me and does not agree that I am controlling nor does she believe that I am micromanaging her daily life.\n\nAlso, because so many people believe that I intentionally left out the medical issues she has, I'll list them here:\n\n- postpartum depression\n- low vitamin B-12\n- chronic fatigue\n\nNow, let me explain why I didn't list them originally.\n\nHer low vitamin B-12 is not a deficiency, her level is just lower than what is considered \"best\" for her age; this is according to recent bloodwork that I recommended. The results state that any number between 100 pg/mL and 914 pg/mL is \"within normal range\", and her level is 253 pg/mL. The doctor suggested sublingual B-12 1000mcg daily to raise the level a little, but stated that apart from that, she could not find a reason for the chronic fatigue. Because of these results, and especially after purchasing the supplements, in my mind, the B-12 is not a problem. Also, the bloodwork confirmed that everything else was normal.\n\nThe postpartum depression is actively being monitored and treated by a professional. My wife literally goes to a psychiatrist, or psychologist (I can't remember their exact title) multiple times a year and we pay for medication every 30 days. She initially tried depression medication, followed the regimen religiously and not much changed for her. This was addressed in a following appointment and a new medication was prescribed. Her current medication is normally used to treat ADHD or narcolepsy and the doctor believed it would alleviate some of her tiredness and release more dopamine thus providing more energy in her daily life. This does seem to be true and she seems to be happy with the medicine.\n\nThe chronic fatigue is a result of her own poor scheduling and personal health. She has agreed that she spends too much time sitting and using the phone. She naps when our son naps and has trouble falling asleep at a normal bedtime hour due to this daytime sleep. We always go to bed together and he's told me multiple times that she moved to the living room after I fell asleep because she couldn't sleep and was bored just lying there. Then, midnight or later comes, she's finally drowsy and decides to sleep. However, the overstimulation from social media and phone usage makes it difficult for her brain to reach REM sleep normally. So she falls asleep at 12:00, our son wakes up at 8:00, eight hours have passed and she still feels tired and not at all rested.\n\nI do know and have known about her condition. We have agreed to disagree about the cause of her sleeping problems. In her mind she has chronic fatigue because of insomnia and it's a vicious cycle. In my mind she stays up too late on the phone and doesn't get the sleep her body needs.\n\nWhether the internet thinks she is a bad mother, negligent, lazy or abusive is not important. I know and love the woman I married, I do feel comfortable leaving her with our kid and she does an amazing job with him. In a few comments I stated that she was lazy and didn't do much at home. I won't deny those statements, but in the moment I was still aggravated because the argument over the phone had just recently ended. I don't truly think she's lazy because I've seen what she can do; I just think she's unmotivated due to a lack of sleep and the same four walls every day.\n\nFinally, I am not spying on her or my son. We only have two cameras in this house and both are in our son's room. One camera provides a wide-angle view of the entire room and the other is positioned directly above his crib. The cameras serve no purpose during the day because I'd barely be able to hear background noise from another room even if I did try to listen in.\n\nMy wife is an amazing woman and an amazing mother. My son is just so happy all the time, he's super smart, full of energy and extremely healthy. I will not be hiring a nanny or using a daycare. There is absolutely nothing wrong with what my wife does during the day, I just wish she'd start her day earlier for my little man.\n\nI want to say thank you to everyone who commented on this post and messaged me. My wife and I had a long, in-depth conversation last night after all of the attention this post received and I've shown her everything. There were tears, much more laughs and a lot of things to think about.\n\nI think the most important thing we learned is that so many people are quick to judge and that in itself is a very big problem.\n\n\n\n**EDIT #2**\n\n\n\nI need to make it clear that my wife does not have narcolepsy. She is not taking medicine for narcolepsy. I said that the medicine she takes now is USUALLY used to treat narcolepsy or ADHD. She also does not have ADHD.\n\nThe second thing we learned is that people love to add details and change the story.",
  "id": 1,
  "comments": [
    {
      "score": 11416,
      "content": "I'd like to answer but this child that quietly hangs out in a crib for hours is just too baffling to respond. \n\nAre you sure you have a child and not a cat or a robot or something?",
      "id": 2,
      "comments": [
        {
          "score": 1758,
          "content": "~~Maybe the son has learned being noisy in the morning doesn’t get him attention so he just waits for the light and the app - I hope that isn’t the case though because that would be heartbreaking~~\n\nEdited: thank you for people sharing info I do not need anyone else to clarify that I was wrong above in my understanding but it was good to learn",
          "id": 3,
          "comments": [
            {
              "score": 4143,
              "content": "That can happen but that's pretty limited to cases of severe and  constant neglect and nobody ever responding to the baby ever. \n\n This kid is obviously cared for.",
              "id": 4,
              "comments": [
                {
                  "score": 1543,
                  "content": "THANK YOU. FFS, these people.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 56,
                      "content": "So many people weighing in who have never cared for a toddler and it shows",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 457,
                  "content": "Yes thank you, more people need to see this comment\n\nA well cared for child, like this one obviously is, isn't conditioned not to cry \n\nIn fact, if he was upset or needed something he would have started crying when he heard his dad through the app. Because toddlers don't understand things like phones or apps or remotely talking to someone. Hearing dads voice means dad is there. If he needed something or was unhappy he would have cried when dads voice stopped",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 97,
                  "content": "Classic Reddit, comparing a first world kid with a full time STAHM to Romanian orphans lmao.",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 58,
                  "content": "My wife and I have our 2.5 year old and an almost five month old. Asked her about this post and she agreed that it’s a child that’s perfectly fine with alone time to just chill. The child seems to be sleeping well and if it’s not crying out, then the child is perfectly fine and safe in its crib. My only concern is if the child has been changed or not as to not cause painful diaper rash. \n\nIf I was in this situation, I’d just take the child with me to making breakfast so they can observe and I can talk to them.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Babies and toddlers absolutly love routines. If this is the routine that he has always known it is entirley possible for them to be completly ysed to this by the time the baby can stand.\n\nAdd in that dad is chatting with him via baby monitor so he doesn't feel alone make it that much easier to belive the kid is just used to this and it his routine.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1186,
              "content": "Except as soon as son makes noise mom gets him, so that opposes your theory. \n\nI have a toddler and mine used to chill in the morning by herself. As she’s gotten older she enjoys this less, but she will chill at night after we put her down before falling asleep.",
              "id": 11,
              "comments": [
                {
                  "score": 279,
                  "content": "Exactly - toddlers need to learn to self-soothe sometimes or else life is going to be very hard for everyone involved!",
                  "id": 12,
                  "comments": [
                    {
                      "score": 239,
                      "content": "It looks like this toddler has learned and the mom is *still* being blamed for made up grievances.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "My youngest was a quiet waker. I have no idea how long she was awake in the mornings before I checked on her 😅 definitely wasn’t neglected and I’d check on her every hour when she was napping. Some babies are just quiet.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 16,
                      "content": "My middle kid is this way. Her wake time varies significantly (sometime between 7 and 9, but usually close to 8), so some mornings, she’s up before me. If I check her, she’s usually happily playing in her bed. She’s 3, so not in a crib anymore, which means she can get up, collect toys, and settle back in her bed to play. When I wake before her, she still wants that quiet play time after waking, so I’ll wake her, then leave the room for a bit.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I was like that as a kid and it continued into adulthood. I love people and am very social, but 90% of my time is spent alone if I am allowed. I would sit in my room for hours happy and my mom was weirded out by it. But it worked out because my brother needs to be around people all the time, so I am sure me being chill as a toddler was a big help.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Exactly. Mine just chills by himself on the morning for an hour ish just for whatever reason. He's like me and the bf where he needs some time to actually wake up before getting his day started with rampaging.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 599,
              "content": "he said mom wakes up when he starts fussing.... so it does get him attention",
              "id": 18,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 301,
              "content": "The likelihood of that being the case is so low its silly to even suggest it",
              "id": 19,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 86,
              "content": "My todler also starts crying in the morning when she need care. I was thinking that she is waking up crying, imagine my surprise when we started record via baby monitor that she is awake for almost hour and a half before she start to call me and crying.\n\nIt's ok for baby to be left alone in the mornings, if they don't cry.",
              "id": 20,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "I honestly think that the kid might be waiting for OPs voice. Since he been doing this for forever, so the kid might think that the dad is with him",
              "id": 21,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Someone has never babied before",
              "id": 22,
              "comments": [
                {
                  "score": 3,
                  "content": "One time I was a baby but I don’t remember it",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I think the baby is just a quiet kid lol.",
              "id": 24,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1119,
          "content": "> Are you sure you have a child and not a cat\n\nMy child has always been like that. As long as he wasn’t hungry or sick, he’d happily mooch around in his cot and sing to himself. Now he’s five and will sit with a book or chatter to his toys.\n\nTo be fair though, he’s been brought up alongside cats (and he’s named after one I had when I was a child and it’s a common cat name along with being the name of a cat food brand) so maybe he is part cat now. Who knows 🤷🏻‍♀️",
          "id": 25,
          "comments": [
            {
              "score": 544,
              "content": "The first name that came to mind was \"Friskies\" followed by \"Meow Mix.\" Both great names!",
              "id": 26,
              "comments": [
                {
                  "score": 361,
                  "content": "It isn’t, but I promise that any future child will be Meow Mix.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 63,
                      "content": "Well, internet is now cheering you on to get laid",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Felix?",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I mean, do, but don't!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "DJ Meow on the stage ladies and gentlemen 😹",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Fancy feast?",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "I guess it's Felix",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I've got my money on Nutro \"Max\"",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "No way. It’s Fancy Feast.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Mine went to Purina 😂😂",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Whiskers sounds like a delightful child.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "Felix?",
              "id": 38,
              "comments": [
                {
                  "score": 38,
                  "content": "Yeah, you got it!",
                  "id": 39,
                  "comments": [
                    {
                      "score": 11,
                      "content": "That's a great name!",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "My part - cat child was always happy to chill. I'd leave her on the floor (not the bare floor, Steele down, but in a soft blanket thing not high enough to fall off) as a bub but would chuck her in the cot for safety when she started getting around. She'd go in there if I was cooking or showering or doing something where I couldn't supervise or where she might be less safe (we were renovating so if I had to paint or make dust etc). \n\nI wouldn't leave her in for ages but would time it so she could put herself down for a nap or have a post-lunch play, and if I had a few tasks I'd make sure to break it up. \n\nAnd yes, maybe days were early wake up, eat and nappy and run big kid to school, then she'd play in her cot from 9-10 while I napped (she was an amazing sleeper, her bro not so much).",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "felix???",
              "id": 42,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Whiskas or Sheba?",
              "id": 43,
              "comments": [
                {
                  "score": 3,
                  "content": "My Grandpa’s favourite cat was called Sheba, and my ex had a cat called Whiskers. We’ve covered all bases!\n\nI’d actually love the name Sheba if I had a daughter. But the front runner would be Tabitha (my Mum had a cat with this name). I clearly have a thing for naming children after childhood pets, should probably see a therapist tbh.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Felix?",
              "id": 45,
              "comments": [
                {
                  "score": 3,
                  "content": "That’s it ☺️",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "immediately thought of Purina, v glad that’s not your kids name",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My younger brother was like that too as a baby! Would just sit quietly and entertain himself, wanted to be left alone mostly. No crying, no dramatics, almost eerily solemn. T'was a shock for my parents after their experience with me (polar opposite!). Kids come in all shapes and sizes I think 🤷‍♀️",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Edgar?",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "My daughter legit tried to rub her head against her first playdate like a cat does. Then she hugged her.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 353,
          "content": "My friend has a kid who is like that. He’s a bit older now, but still likes his alone, quiet time. He is pretty good at entertaining himself when he wants to be alone.",
          "id": 51,
          "comments": [
            {
              "score": 35,
              "content": "Yeah my kiddo lies in bed for up to an hour and a half just drifting in and out, playing with his stuffed animal or his light/music machine. He’s perfectly content and he will cry out when he isn’t. But if he’s not up by 9, I would panic when I woke. He’s basically my alarm clock. He’s just a happy kid who enjoys being alone and sleeping in. Let’s be honest, don’t we do the same on a Saturday morning?!",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "People absolutely neglect how great it is for a kid to be able to self soothe and self entertain.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My oldest was and still is this way. She always woke up, played or talked to herself quietly and then when ready called me. Never super upset when she did just “mum, mum, mum”. If she did wake up crying I knew it was gonna be a rough day and her mood would only get better after a nap.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 252,
          "content": "My one kid was odd that way. At 20 months he’d climb into his crib in the middle of the day on his own just to chill and play by himself. He was a quiet kiddo",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "My 2 year old just quietly plays in his bed or reads books most mornings… we don’t know how it started but we sure love it. I usually let him have quiet morning time for an hour then go get him unless he’s fussing more than normal. \n\nI think OP is TA because he is micromanaging. Do I think 2 hours is a long time to leave him alone? yeah. Am I gonna judge the mom? No.\n\nI’d be more concerned if mom left him in his crib or alone a majority of the day tbh. Baby boy doesn’t seemed phased",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Honestly I can’t help but think the baby does what my niece who’s about to turn 2 does. She wakes up earlier but if left alone, she will soothe herself back to sleep. So OP sees the kid up at 8 and then again at 9 and just assumes he’s been up the whole time.",
          "id": 57,
          "comments": [
            {
              "score": 21,
              "content": "Yup I just found out that my 20 month old son often does this.  He goes to bed at 7, but sometimes wakes at midnight.  I go in an and check on him when he does this and nothing is usually wrong, he is just stating at his fingers, singing or trying to see the ceiling fan in the dark. He goes to sleep after 15-20 minutes of chilling.\n\nHe typically is ready to get up between 6:30 and 7:30 (though sometimes as late as 8) but I noticed once when I had to get up early he sometimes wakes at 5 in the morning singing to himself. And again he goes back to sleep after a bit. My son loves hanging out in his crib or sometimes laying on the floor and relaxing.  So it’s possibly this baby is the same",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "My cat won’t even do that. She lets me know within 10 minutes of her waking that she demands pets and to have her butt scratched while she eats her food.",
          "id": 59,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "Apparently, I used to do this as a baby/toddler. I'd wake up and wait for someone to get me, usually my older, by two years, brother. Kids are weird.",
          "id": 60,
          "comments": [
            {
              "score": 17,
              "content": "I was that child too. My mother couldn't even comprehend why, when I had the capacity to do so, I wouldn't climb out of the crib.",
              "id": 61,
              "comments": [
                {
                  "score": 10,
                  "content": "My brother taught my sister how to climb out of her crib. She was perfectly happy there, but he wanted her out.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 8,
                      "content": "My dad stopped my mother from teaching me how to climb out of there. \n\nIt was the only moment of the day where I was calm, entertained myself and babbled to myself.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "My niece loved hanging out in her crib babbling to herself in the mornings and after nap time.",
          "id": 64,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "alternate theory: house is haunted, toddler has ghost companion ;)",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8554,
      "content": "YTA\n\nFirstly, let's start with the fact that your kid is now into toddler range as opposed to infant.  Your kid can manage a few moments alone in their crib and will still cry if they need any worthwhile attention.\n\nSecondly, let's say she took the toddler with her while preparing the food. Your kid is now in learning escape methods, getting into crap, cause mischief stage. Let her get the food ready first.\n\nThirdly, best intentions aside if my my husband was micromanaging my mothering, I'd blow a gasket from stress alone. Mom's need what sanity remains to us, especially before entertaining a toddler for hours.\n\nFourthly, there was 0 indication of why you thought your son was up for \"an hour\" - which makes me think it wasn't necessarily true so much as you just wanted to add spice to the insult you slung at your wife.\n\nYou chose her to be the mother of your child, now let her do her job in peace.",
      "id": 66,
      "comments": [
        {
          "score": 9431,
          "content": "He clearly states that his son usually is awake by 8:00 and mom doesn’t come get him until past 9:00, sometimes as late as 10:00. That’s not “a few moments.”",
          "id": 67,
          "comments": [
            {
              "score": 1083,
              "content": "He also clearly states that he never actually checks the monitor until at least 9. No idea how he seems to know for certain his toddler has been up since 8? If he never checks before 9, *how can he be sure that’s true*?\n\nIf he’s just going by the app marking him “awake”—those are not reliable. My daughter tends to toss and turn during the last hour or two of her sleep, and the “smart” motion sensor on the monitor frequently clocks her as awake when she’s just gassy or sleeping lightly.",
              "id": 68,
              "comments": [
                {
                  "score": 287,
                  "content": "He also doesnt know if his wife has got up and changed the baby then gone back to bed. She has health problems that mean she is likely going to need rest multiple times a day.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 547,
              "content": "Lol have you ever seen a kid especially that young that wakes up every day the same time like clock work?\n\nMy 15mo is awake sometime between 6-8 with 5 or 9 as exceptions \n\nWhen he needs me he’ll cry. If he’s wet or dirty he’ll cry. If he’s content and playing with his toy bunny I’ll happily let him so I can have at\nLeast half a breakfast in peace. \n\nOp. YTA.",
              "id": 70,
              "comments": [
                {
                  "score": 20,
                  "content": "Yep, my daugther, wakes between 5.30 am and 5.45",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 326,
              "content": "If the kid isn't crying or in distress (and it doesn't sound like he is), what's the harm in letting him sit in his crib quietly while mom does her thing?",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "Kid doesnt care about coming out why take him out",
              "id": 73,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "He speculates this. He says “he’s usually awake by 8” but then contradicts that he never can check until between 9:15-10. So we can’t trust he’s being honest at all. He’s a controlling micromanager. His story isn’t straight. I’d like the mothers side of the story before I give him the praise and her the “terrible mother” sticker. \n\nAs is, mothers already get a hard go at how to mother while fathers don’t. \n\nHe just seems like he’s trying to be right less than accurately providing details.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "[deleted]",
              "id": 75,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "The toddler can usually get up at 8:00, and that doesn’t mean he was up at 8:00 on this day. OP admits they don’t check the cameras until after 9:00, so he really has no idea what time the toddler woke up that day or any day he hasn’t checked before 9:00.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "How does he know if he works six days a week and doesn't call until 9",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "He also states:\n\n>It's usually after 9:00 before I have a chance to check the camera\n\nso how does he know the boy is awake at 8:00?",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "He’s not home at that time and says that he usually checks after 9:00. So he doesn’t actually know when his son usually wakes up, he’s just guessing based on what he sees the maximum of 2 days a week that he’s there for wake up time. And if the son is used to OP always being gone by time he wakes up, the excitement of knowing daddy will be home tomorrow morning might actually be making him wake up earlier than normal.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 539,
          "content": "Toddlers can often fall back asleep, and yes totally let her cook in peace. My toddlers are very attention seeking in the morning so waking up before them and cooking really helps for a smooth start to the day.",
          "id": 80,
          "comments": [
            {
              "score": 250,
              "content": "Exactly. Cooking with a toddler can be frustrating (to put it mildly). It’s so easy to get distracted and burn something or have unnecessary messes happen. Kitchens can be dangerous and a toddler walking around or fussing in their high chair is the ultimate distraction. If someone says then why not put them in a playpen? Well, she has a system that works fine with kiddo in crib so what change it? At some point, it will change anyways. Mom should be able to enjoy it while it lasts. \n\nI didn’t understand why people here are so quick to make the dad a hero for working 12 hour days and then coming home to… be a parent. But they don’t give the Mom any credit for being the sole care taker for 12 hours a day. It’s work! Not even easy work, that’s why childcare is so expensive. At least he gets breaks at work and to go to the bathroom alone. Toddlers are notorious for “needing” to hang out with SAHP in the bathroom.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7254,
      "content": "NTA! \nDoes your son sleep all thru the night? Or does your wife get up to feed him etc? This would change my opinion.\n\nI’m sorry but your wife waking up after 10am, when she has slept all night(if baby didn’t wake up) and her son being up for more than 2 hours is not ok! He’s needs a diaper change, and probably hungry!\nI understand an hour, letting your wife wake up, shower makes coffee get herself ready and then get the baby! But more than 2 hours and she’s still dead asleep, having to call her 3 times before she answers. Your son is getting older, and that’s when babies start climbing out of the crib. Maybe you need to sit with your wife and figure out what’s going on, if she in fact does have her routine with the baby and these are just off days you seen her in.\n\nEdit: Op has stated in the comments that his wife has chronic fatigue, but she doesn’t take her b12 shots because she forgets. Baby sleeps thru the night, mom is able to sleep thru the night, her waking up late is her choice. She’s a mother now, her baby relies on her to eat! Him not crying isn’t even the point, he’s at the age will he will start getting curious, getting out the crib and exploring. Her establishing a routine with her son would work better for her, she can nap when he naps. If she’s not able to force herself to get up, She and Op need to sit down and discuss getting help. Again him entertaining himself is not the issue, the issue is being awake for hours before mom acknowledges him. Accidents happen even when your watching, but being left unsupervised the risk is bigger. All these YTA comments are only looking out for the wife, what about the baby?! Would you still say YTA if it was the dad sleeping in, we’re always so quick to judge the fathers but not the mothers.\n\n\nThank you guys for the awards☺️",
      "id": 82,
      "comments": [
        {
          "score": 3417,
          "content": "The amount of people on here ok with baby’s being left to sit in there own feces for hours is astounding!\n\nEdit: I guess I should have said dirty diaper but my point is still the same.",
          "id": 83,
          "comments": [
            {
              "score": 797,
              "content": "Even an hour is too long. I get my kids right after they wake up.",
              "id": 84,
              "comments": [
                {
                  "score": 79,
                  "content": "Yes! My son is 3, so he just comes down to me when he wakes up. My daughter is 15 months and still in the crib. When she wakes up, I go get her. I might finish my cup of tea first if she wakes up a little early and I'm not done with it yet, but that's like ten minutes max, and only occasionally. \n\nThis is a hugely problematic situation.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 44,
                      "content": "I can't imagine leaving my kid more than the few minutes it takes to get out of bed, pee, and get into her room. If this guy is calling his wife 3+ times to wake her up, it's highly likely that he's been conditioned not to cry when he wakes up. The fact that she responds later means that's when he'll cry. All the people saying this only happens in cases of severe neglect are not necessarily correct. If this were my kid, I would be hugely concerned.\n\nI sympathize with this mother because I also have chronic fatigue, but ignoring your kid for 10 percent or more of their awake time is not the solution.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "How do you know when your children wake up? Are you watching, or are you just assuming they aren’t spending some time awake and alone?",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "That what normal decent parents do.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I don't even have a kid and I feel bad thinking about making my dogs wait more than a few minutes for me to take them out to pee in the morning!",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 661,
              "content": "?? Where’s he’s sitting in his own feces for hours coming from? They don’t poop all the time - and if he does, he’ll just cry for a diaper change.\n\nThis sounds like a happy baby (or toddler), who is ok alone and knows mom will come when he cries (because per OP…he cries and she comes).",
              "id": 90,
              "comments": [
                {
                  "score": 91,
                  "content": "If the toddler is going to bed at 8 pm and isn’t getting gotten out until 10 on a regular basis, that’s 14 hours. You don’t think a toddler would go to the bathroom over the course of 14 hours? Even if it’s “just” pee, that’s still a soiled diaper.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 104,
                      "content": "You don’t think OP would have mentioned if there was any evidence of a toddler living in filth? The diaper rash would be extreme.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Thank you. Ffs the people on here thinking that a baby with eyes open needs instant interaction are wild. Helicopter parents much?",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 521,
              "content": "Why do you assume that’s the case? When I’ve taken care of toddlers pooping overnight wasn’t the norm.",
              "id": 94,
              "comments": [
                {
                  "score": 369,
                  "content": "My daughter pooped every morning when she woke up. It doesn't have to be overnight if the kid is by himself for two hours.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 35,
                      "content": "My oldest would poop only after he wakes up when he was still in a crib. Our youngest (4 months) usually poops in the morning (between 3-6 am), however after diaper change and nursing, he’ll be good until he wakes up later in the morning 8-9:30am.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "I had 4 kids.  Pooping during the night when they were toddlers was not the norm.  Diapers are actually made to hold a lot of urine and help protect the skin. It’s why when you toilet train your child they often learn quicker in regular underwear because they feel damp and don’t like the feeling.  Diaper rash is more often caused from diarrhea than urine in my experience.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "But wouldn’t they after 2 hours of being awake?",
                  "id": 98,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Not necessarily. Kids tend to poop when they've been fed, ie their digestive tract is stimulated. If he was uncomfortable he would let mom know.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Not necessarily at all. My son (similar age to OP) almost never goes at night. Also, it’s good for them to play on their own. They learn to explore their hands, surroundings, etc. We often hear him awake in his room singing to himself in the mornings (and will amuse ourselves watching him on the video monitor) and almost never go in to get him until he cries….which can be (cover your eyes, OP, this will horrify you about our abusive parenting!) an hour later.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Yeah mine stopped pooping overnight around 18 months, if not earlier",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 54,
              "content": "There is literally nothing in the OP and in his comments so far that say that this child was sitting in his own poop.",
              "id": 102,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "Most toddlers do not poop in their sleep.",
              "id": 103,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "Uh… it’s very unlikely that an almost 2 year old is shitting that early in the morning. Baby should be fully on solids (unless mom is extended breastfeeding but that’s more of a supplement than their meal at that point) and will be on a semi normal poop schedule. Hell, my kid had pull ups that she changed herself before I woke up when she was that age.",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "I wonder if the baby has any diaper rash issues. Seems like OP would mention it. Toddlers do wake up dry regularly at some point. If the kid was sitting in a dirty diaper for 12 hours or even 8 hours, there would be a rash problem.",
              "id": 105,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "That OP conveniently left out of his primary post that his wife is also dealing with depression and chronic fatigue/pain is also part of the reason people are calling him TA.",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I don't think babies normally poop overnight?  I've never once had a morning diaper with poop, even when we sleep in.",
              "id": 107,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 796,
          "content": "There are a lot of Y T A votes here because it does sound pretty controlling but like you my only thought was leaving a 20 month old alone in the dark awake for 2 hours is not acceptable. I think there is more to this though … I wouldn’t leave my 20 month old like that for more than 20 mins or so while I grab a coffee and as soon as she stirs and stands up I go get her. Maybe mama has some PND and nobody realises. NTA.",
          "id": 108,
          "comments": [
            {
              "score": 424,
              "content": "Based on OPs comments I feel that OP is exaggerating the amount of time he’s give .",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "I don't think it sounds controlling, more sounds like an ongoing unresolved issue.  If my husband were a SAHD and I couldn't trust him to take care of my kids' basic needs in the morning damn right I'd be calling to wake him up, there's lots of did he or didn't he poop arguments but who cares the truth is he probably poops sometimes but also I'm sure is bursting with pee which is also not great.  And sitting quietly in the dark is not the same as independent play.  I agree PPD should be considered but even so if it is PPD she still needs to be woken up until such time as she is treated and or they decide on different childcare arrangements, if being a SAHM is not for her she should work and send the kid to daycare.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 233,
          "content": "Finally someone wrote what I was thinking. I was baffled at how many YTA comments there are.",
          "id": 111,
          "comments": [
            {
              "score": 28,
              "content": "Right!? Like yeah, he’s being kinda annoying but I would never have let my kids sit there that long. Me husband wouldn’t have either. That’s absolutely not normal and not ok. She sounds depressed, tbh.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 186,
          "content": "Right? 14 hours of no food at that age isn't normal. And full diaper. And the danger of being alone in a crib. Unless baby sleeps in a psychiatric hospital room like those in movies, they can definitely hurt themselves. My own dad cut his tongue. My brother would somehow just walk out. My sister would use the outside zipper to get out (it was travel crib) and she cut into her brow bone, lip, and forehead all within toddler years and one of them was in the bed (can't really remember which one)",
          "id": 113,
          "comments": [
            {
              "score": 20,
              "content": "But apparently because baby doesn’t cry OPs wife sleeps in. To me the issue her still being dead asleep, not even getting up to check on him once. I’ve seen babies around that age getting out the crib like ninjas, like you said in your comments so many accidents.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "[deleted]",
          "id": 115,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "If she has chronic fatigue then that's something that needs real help to address and isn't really something you can just 'attitude' your way out of. And I think you're maybe missing that many people are saying YTA because, regardless of whether what she's doing is ok, OP's hounding was a poor way to address anything and was an asshole thing to do.\n\nAlso yeah if roles were reversed I'd say the same thing. Being 'checked up on' and scolded daily isn't going to brighten anybody's day, especially when OP KNOWS she struggles with chronic fatigue!\n\nLike, I have a family member with Crohn's. And it would be pretty assholy of me to complain to them about how much time they spend in the bathroom and how their restrictive diet is making meals boring, day in and out. OP is justified to have concerns but he should have *talked to her about it* instead of nagging",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "What worried me the most was when she said she wanted to go to the kitchen on her own to make her own breakfast after 10am when the baby has been already up waiting for hours… and she only woke up because of the many phone calls from the husband. Is she’s not worried about the baby?? And if the child is starving/thirsty/needs a change??? She’s fine just letting him stand there waiting while she goes around the house taking care of her own needs first? I have never heard anything like this before, unless it’s a mother with PPD. Perhaps she should go back to work and they have a nanny come in if she’s not fit or is struggling.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I have chronic fatigue 24/7 from MS. When my MS is active/flaring badly, I could sleep 12 hours and still be so exhausted that brushing my teeth seems daunting!!! So I understand next level exhaustion. It makes me think your wife needs help, not a scolding! Lord knows if I had kids I couldn’t take card of a baby on my own!",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "To Be fair though, if he’s reminding her of stuff all the time anyways, has he considered trying to help her Reiner her b12?",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "thissss!!! I fully understand mom needing time to get up, shower, have breakfast etc before getting the child - but that means waking up before he does. Not TWO HOURS later.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4087,
      "content": "The fact that the child sits quietly for some time in the morning?  Not a huge deal.  \n\nThe fact that you call your wife and tell her it is not okay to leave your toddler who is content and safe in his crib while she makes him breakfast, and instead demand that she get him out of his crib so that she can juggle a toddler while also cooking?  YTA.  When you're caring for the child, your morning routine will be your choice.  Your child was not crying and sitting quietly in his crib while his mother was making him breakfast and youre micromanaging the situation?  Come on.",
      "id": 121,
      "comments": [
        {
          "score": 1502,
          "content": "That’s after calling her repeatedly to wake her up every morning like a human alarm clock she didn’t effing ask for. I’d be LIVID.\n\nStop micromanaging your wife, OP, and focus on your own damn job. There is zero indication your quiet, happy child is in dire need of attention at these moments. She doesn’t need you breathing down her neck every damn day, remotely monitoring and policing her parenting decisions. If you have this little faith in your wife’s capacity to parent, hire a nanny or send your wife back to work while *you* stay home with the kid. YTA.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 397,
          "content": "Yes! Some toddlers want to eat immediately (my first did - eyes popped open, and was starving), some don't (second kiddo wants to be moving around a good 30 minutes before even thinking about food). \n\nBoth of my kids will/did wake up sround 4 or 5, get a cuddle (sometimes a snack and diaper change) , then would settle back down for more sleep, so it's also possible this toddler is doing that too. \n\nIf the little one is making happy sounds, let mom sleep.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I keep thinking if he's that obsessive about making sure their child is being parented exactly the way he wants, why not switch places? I had a neighbor where the wife worked and the husband stayed home, and it seemed to work really well for them.  If they both prefer he works, he has to let go of the micromanaging. Letting the kid stay in there for an hour or two is excessive, but his being upset about her wanting to fix breakfast before letting a toddler loose in the house is ridiculous.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I would have taken that camera and shoved it up his ass.",
          "id": 125,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "I’m a mom, and OP YTA and obviously you’re also your wife’s manager. Because that is exactly how you sound right now dear. Like a frighten manager. Get good. Also moms most of them, me included. Leave their toddlers who are content in their crib because it’s a fucking lot to take on and the house. So I think lil man being in the crib for a while after he wakes. ESPECIALLY since how mama does answer him pretty quickly.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2621,
      "content": "YTA. If the kid is sitting in his crib quietly then all is good. In fact, alone time like that is good for babies (not sure why, but I remember a doctor telling us that).",
      "id": 127,
      "comments": [
        {
          "score": 2736,
          "content": "They explore their surroundings, fingers, and whatever baby thoughts they have. Alone time helps their brains to grow. Crying signals parents that baby is ready for interaction/food/diaper.",
          "id": 128,
          "comments": [
            {
              "score": 599,
              "content": "They're 20 months old not 2 months. They require more mental stimulation than that. Caged birds get more entertainment than a toddler in a crib. And teaching them to scream and cry for attention, or that they will be ignored to the point of suffering enough to cry is really sad",
              "id": 129,
              "comments": [
                {
                  "score": 388,
                  "content": "You do know that babies come out CRYING! And no one Teaches them right? ... Its their own language to communicate with adults",
                  "id": 130,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 44,
                  "content": "You’re kidding, right? He’s not in a crib all day, and children do not need to be stimulated at all times. All humans need to be able to quietly sit with their thoughts instead of being entertained every minute",
                  "id": 131,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "[deleted]",
                  "id": 132,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Tell me you don’t have kids without telling me you don’t have kids. A caged bird? Really? At 20 months he’s old enough to have small stuffies/toys in there. He’s old enough to start trying to do things like count and practice words. \n\nI’m with the hive that 2 hours is way too long but your taking this way too far.",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Kids don’t need to be stimulated all the time. If one of the kids of that age at my daycare wakes up before nap is over, they’re expected to lay quietly on their mat until everyone is awake or nap time is over. If they need something, they can say that and the teacher will help them.",
                  "id": 134,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Man by 20 months they can talk not just cry. Mine were climbing out by that age and in a toddler bed. Where they would hang till they cried or we got them. Based on our pediatricians recommendation.",
                  "id": 135,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "OP has said that once the baby starts crying mom does come get him. He isn't being taught that crying will get him nowhere.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "It also teaches them how to entertain themselves without needing technology or toys to do so. Which in turn often has a significantly positive impact on their long term creativity and ingenuity.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I love the phrase baby thoughts. Wonder what a little babies think about",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 858,
          "content": ">alone time like that is good for babies (not sure why,\n\nSolitary play has several benefits and helps build a child's executive function.\n\n\nhttps://www.healthline.com/health/solitary-play",
          "id": 139,
          "comments": [
            {
              "score": 179,
              "content": "The two situations are very different. Babies still require some sort of stimulation for it to be beneficial - things such as toys to explore with their hands.",
              "id": 140,
              "comments": [
                {
                  "score": 23,
                  "content": "Every baby is different. They will let you know what they need. \n\nMy oldest (now a teen) was a very chill baby. He would babble in his crib when he woke up and liked to play before calling for me. Then again, this same baby taught himself the alphabet before age 1, and  he’s still years ahead academically as a teen. He still likes his alone time to chill. It’s just his personality. \n\nMy youngest wanted me immediately when he woke up. He still loves to be surrounded by people all the time, and he prefers to sleep with music playing. Just a different personality type than my oldest. And that’s fine. Both personality types are completely normal. \n\nAlso all these people talking about how the baby is wet and uncomfortable may not have changed any diapers recently. Many of the newer diapers aren’t uncomfortable with a moderate amount of pee. Leaving a baby for any amount of time in poop would cause a rash, but some of the newer diapers are really amazing with the technology/materials to absorb pee. So it isn’t fair to assume the baby is uncomfortable in the morning. I don’t think OP mentioned that his son has any diaper rash, so I doubt the mom is neglecting him.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1984,
      "content": "Info: is your wife depressed? Does she stay up super late? Why does she wake up so late? \n\n\nIt would be pretty irritating to get called every single day. But hey, if you have a toddler who depends on you to be a responsible parent, and you're letting them sit hungry in a dirty diaper...\n\n\nEdit: based on your wife's condition, your micromanagement, and the ludicrous hours you work (72/wk??), YTA OP.",
      "id": 142,
      "comments": [
        {
          "score": 1569,
          "content": "[deleted]",
          "id": 143,
          "comments": [
            {
              "score": 845,
              "content": "Exactly. The ableism in this entire post is disgusting. No, having a chronic illness doesn’t mean you don’t do your duties as a parent – but parenting while also dealing with one’s chronic illness means their methods will likely look different from the norm.\n\nOP, it’s possible she needs more help. You work 12 hour days, does that include commute? Maybe including commute you’re out of the house for 13.5 hours per day? That leaves 10.5 hours for baby bedtime routine, dinner, maybe some relaxing time, and then a proper night’s rest? How many days a week?\n\nSo let’s say mom gets 6-7 of those remaining 10.5 hours of the day to sleep. I’m telling you right now that’s not enough sleep. It’s not enough sleep for most normal people (I know some people survive on 6, but the average recommended is 8 hours). It’s certainly not enough sleep for a person doing 100% of child rearing for 13.5 hours a day, several days a week. On top of that, it especially isn’t enough for someone doing **all** of that AND dealing with CFS/fibromyalgia, depression, ADHD issues, potential narcolepsy issues, etc.\n\nCFS is *brutal*. Full stop.\n\nDo you make enough money to hire a part time housekeeper to take some of the household load off her? If she has more time to rest, she will be better able to take care of the things she’s responsible for in a manner that you probably find more fitting (i.e. “normal”). If you have the time to face chat with kiddo nearly every morning and then call mom multiple times, it stands to reason you could instead be assisting her in ways that she would actually appreciate – and that would actually be *helpful* to her.\n\nHow about reminding her about her B12? How about checking in to see if she’s taken her meds or a quick mood check? Order lunch or groceries to be delivered to her so she doesn’t have to cook every so often, or go out to the store (if she does presently). Ask her and figure out how you can help *together*.\n\nYou really need to talk with her and understand her illnesses. You can’t expect her to function as a “normal” person/parent if she’s shouldering abnormal burdens. I really encourage you to check yourself and avoid being an ableist asshole to your wife and the mother of your child – whom I assume you thought was a half-decent person at some point since you married her and reproduced.\n\nYou can’t expect a fish to climb a tree. You *can* work *with* her, *listen to her*, stop fucking judging her, and support her in *ways she finds helpful instead of hurtful*.\n\nCongratulations on being a dad that ‘actually parents’. (?)\n\n**YTA.**",
              "id": 144,
              "comments": [
                {
                  "score": 73,
                  "content": "Can't believe this comment doesn't have more up votes. OP just carefully left out details of her disability and no one is taking into account those things. I suffer with depression/adhd/anxiety all that and I can't imagine how hard taking care of a child all day must be. Everyone in these comments are being ableist and uninformed",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "I've been searching for this comment - thank you! The ableism in this entire thread is shocking. OPs \"forgets\" thing in particular really wound me up. I'm autistic and have ADHD and my husband has ADHD too. The implication that she's lying about forgetting is such a reflection on how this guy has made no effort to try and understand the complexity of his wife's needs. ND people (especially ADHDers) have no control over what they remember, and often have different cicadian rhythms and need more sleep than others owing to busy brains. If he keeps calling her to disrupt her routine and stress her out, these things will only get worse. YTA OP. Like huge massive giant YTA.\n\nEdit: fixing a typo.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 355,
              "content": "Yeah, clearly omitted some pretty important info. Thanks for the response!",
              "id": 147,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 54,
              "content": "Chiming in as a mom with chronic fatigue syndrome. It’s debilitating. It’s so debilitating that functioning normally or holding a job is almost impossible without some sort of accommodation or moment to rest. \n\nI’m on the medicine wife is on (provigil, it’s the only narcolepsy/ADHD I’m aware of that is given to CFS/ME people. Of note: the drug is a lifesaver *but* doesn’t work every day for me. \n\nWhen I was still working in-office, I napped wherever I could for my lunch hour up to and including my car. If I didn’t, I was worthless even *with* provigil. \n\nI work mostly remote now and have an ADA accommodation allowing me to rest for up to 2 hours outside of lunch time as long as I make up those hours in the evening. \n\nMy birthday was a couple of days ago and all I wanted to do was sleep unbothered. I probably stayed asleep for 5 hours. When I woke up, was still tired. \n\nAll of that said, I’m having trouble with this one. I forced myself to get up with the baby and napped whenever she did, even if it was for 20 minutes. By the time she was toddler age, I got up when she got up and sometimes that was like 9. She made noise though and it was enough to wake me up. I probably napped more than I should but I was at attention when baby/child made noise. \n\nWith all of that information, I’m going to go with ESH. Wife needs to set an alarm for a reasonable time, check the camera, get up if kid is up. If kid is still asleep, snooze and check again.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "I also find it weird that he puts 'forgets' in parentheses.\n\nIt comes across as being sarcastic, like dude, why are you being salty whilst insinuating that your wife is - gasp- intentionally not taking her B-12?\n\nHe is dismissive about her health concerns.",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 491,
          "content": "So from other comments OP made on this post and another, he conveniently omitted to explained his wife has narcolepsy. A pretty bad case. That she is treated for but meds are not helping and he is not doing what should be done to support his wife in dealing with this.\nMassive medical condition prevents mother from caring for kid both physically and emotionally.\nSi it means he needs to step up and find a better situation for the kid.",
          "id": 150,
          "comments": [
            {
              "score": 73,
              "content": "Yikes, that is definitely a good reason/explanation for why mom is in bed. Thanks for responding!",
              "id": 151,
              "comments": [
                {
                  "score": 89,
                  "content": "Yup. Digging a bit and oof. He is the AH for not assuring both his kid and wife have support. Who the hell leaves a toddler with unreliable care due to a medical condition?\nIt is not that she is lazy or doesn’t want to; she is unable to provide reliably. It sucks, I get it. She and baby need support and here he is bragging/saying shit that he is the one helping.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 358,
          "content": "This is what I wondered. Why is she sleeping until 10? Is she up all night, maybe doesn't sleep well. How late does he stay up and is that keeping her up.",
          "id": 153,
          "comments": [
            {
              "score": 170,
              "content": "I often don’t wake up until 9a. I can be my most productive at 10pm. Some people have different schedules.",
              "id": 154,
              "comments": [
                {
                  "score": 61,
                  "content": "While that's true, I've literally never met a parent that had the luxury of sleeping past sunrise with any degree of regularity. I'm not naturally a morning person. My most productive hours are generally noon to 8pm or so. Since I've had a kid I wake up around 5:15 every day and I'm generally winding down by 8pm. It was an adjustment and my productivity at work suffered massively, but after nearly a year I've adapted. Out of necessity.   \n\n\nI'm too fixated on the fact that his wife is able to sleep past 9 to really get a feel on who is the asshole here. Is she depressed? Is she drinking? If she's reliably still asleep 1 to 2 hours after her kid is awake, I can see why Dad is doing the whole 1984 routine with her. He could have legitimate concerns about the wellbeing of his child and the health of his wife. Or he could just be a nosey, snooping control freak. Or he could be a decent dude who has some concerns about his wife, but he's not addressing them and instead riding her about taking care of the kid. That 's not cool, but it's more of a communication issue than a sign of something more sinister.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Or you know..., the Baby doesn't sleep through the night, she gets up and takes care of it and OP simply doesn't notice.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "OP \"conveniently\" forgot to include the fact that his wife has serious fatigue issues and is on a range of medication. As a person with a number of pain/fatigue disabilities, I can sleep till 11 some days. Fatigue of that kind is not cured just because you want to get up earlier.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I’m a parent. My then toddler regularly use to sleep till 9am. Which is well past noon. \n\nHe’s now 5 and the other day he slept till 9:50 and then came and woke us up. \n\nHe was also happy quietly playing in his cot for an half an hour or so as a toddler. And regularly woke up and babbled then slept a little bit again. \n\nAlmost like parenting isn’t a universal experience or something.",
                      "id": 158,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Yea but with a young baby.. do the babies schedule.",
                  "id": 159,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I figured that was the case, but OP acts like it's not. Pretty sure he's leaving some things out. Personally, I can't sleep past 5:30a but I also get up for work at 3:15a so that's sleeping in. When I worked nights, 6p to 2a, my grandma would get so mad I was asleep during the day.",
                  "id": 160,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "OP commented she has narcolepsy and takes meds. So her sleep schedule is medically effed.",
              "id": 161,
              "comments": [
                {
                  "score": 7,
                  "content": "Yea I  started to comment but just got angry at him. I can't imagine dealing with narcolepsy and raising a child can be easy.",
                  "id": 162,
                  "comments": [
                    {
                      "score": 6,
                      "content": "It’s funny he conveniently left that out of his post, as if it’s not 100% relevant that she’s diagnosed with chronic fatigue and narcolepsy.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "If the kid was hungry or uncomfortable he'd cry. OP says she gets him up when he cries, so kiddo hasn't been taught that crying is futile. \nAlone time isn't going to harm the kid. It's actually good for their development. Both pediatricians I've seen (we moved) both encouraged letting kids have alone time \nI frequently hear my 2 year old playing with toys, talking to himself, or \"reading\" in his room in the morning but don't get him up until he cries or calls for me\n\nOP is micromanaging and it's not helpful to mom or kiddo",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1876,
      "content": "YTA\n\nYour intentions may be good, but your actions are bordering on sinister.\n\nIf you want this level of control over what happens in the morning, be there to do it yourself. \n\nIf you are not willing or able to be there to do it yourself, find a solution that isn't remotely monitoring your wife. Whether that's hire a nanny, change your work shifts, whatever.\n\nYour post sounds like the start of a psychological horror film.\n\n**Edit:** If you read that and are about to reply that I am endorsing child neglect... No I didn't. I said what he is doing is creepy and suggested two alternatives of changing his hours to be there himself, or hiring help. I wouldn't suggest alternatives if I thought it was all fine as is. Don't attack people for things they didn't say.\n\nAlso, if you are now about to say anything along the lines of \"maybe he can't afford to do either of those\", here is OPs response, emphasis in bold is mine.\n\n> Do you honestly believe that it's acceptable to go to bed at 9:00 and sleep until 12:00 even though you have a toddler at home that wakes up at 8:00? **I shouldn't have to be there nor should I have to spend money on someone to care for my child when his mother is perfectly capable.**\n\nSo its not the money, its the principle. OP doesn't care as much about his son's welfare as he does the principle that his wife should be fine by herself. Except she clearly isn't. But OP is going to change nothing and keep up his Big Brother act instead.\n\nAnd presumably OP is also going to keep ignoring everyone asking how he knows the toddler wakes up at 8am if he doesn't check the camera until 9am, or why he keeps changing how long his wife sleeps in the comments.\n\n**Edit 2:** Oh and apparently OP has said elsewhere that his wife has narcolepsy.",
      "id": 165,
      "comments": [
        {
          "score": 515,
          "content": "This is the response I was looking for. OP is definitely the Ahole, but mainly because, as someone gone for 12 hours a day, 6 days a week, if he's really concerned over the house he should be getting his wife help, not badgering her. Sounds like a case of burnout to me since she's clearly taking on the majority of childcare and household care with his schedule being so full. Spying on your wife and child is controlling, not helpful. YTA OP.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Exactly. If OP isnt doing anything to change the situation he has no place to complain.",
          "id": 167,
          "comments": [
            {
              "score": 95,
              "content": "He replied to me saying he wouldn't change his hours or hire help on principle. So guess his child's welfare isn't as high a priority as he has been saying either.",
              "id": 168,
              "comments": [
                {
                  "score": 66,
                  "content": "Yeah it seems like he's more interested in controlling his wife than actually helping his child.\n\nHe's acknowledged that his wife has depression and chronic pain which may explain why she's sleeping in, but rather than working *with* his wife to find solutions to the issue he'd rather badger and micromanage her.\n\nImo I don't think, based on the info we have, that the wife is necessarily cut out for a stay-at-home role but that's fine. I'd say it be best for her to possibly take a part-time role that she can manage with her conditions, then use that extra money to pay for childcare. It allows her to contribute in a way that gets him off her back, she can work around a schedule that suits her better, and the kid gets what he needs.\n\nBut the vibe here is that OP wants to prove he's the better parent, so even while he isn't parenting, he feels the need to show his wife that actually he's the one doing everything.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "He also mentioned that she has chronic fatigue and is being treated with narcolepsy meds.  That kinda changes things a bit.  Why on earth wouldn’t he try to get help for his family?  Smdh",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Y'all, you hit the fucking nail on the head. \n\nI started reading, Why Does He Do That? A book about abusive men and this guy fits this shit to a T. It's gross reading about this and he mentions in another comment that his wife is suffering from multiple mental illnesses that is making everything harder for her to manage. He just conveniently left that highly important information out if his post to make her look like she's just lazy and neglectful.\n\nSo not only is this guy micromanaging and nanny cam spying on what's going on in the house, but he absolutely refuses to hire help for her in order to make sure his son's needs are being met.\n\nHe's boiling the whole thing down to, 'my son's needs are the most important thing' and he's using his child as an excuse to spy on and criticize his wife. But it's not really about his son because he won't hire help to make sure his son's needs are met since his wife clearly cannot manage.\n\nNow he's posting about her failures as a mother to Reddit in an effort to shame her and criticize her even more, but he will refuse to do anything to help her because in his mind she just needs to live up to his expectations of how she should be.\n\nThis is so fucked to read and see the controlling and abusive behavior so clearly.\n\nYTA OP",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "thank you!  I still don't understand why, if OP has nanny cam, he isn't recording the baby all night for a few nights to understand the baby's real routine.  This is something he could watch with wife and they could figure it out together and agree on a solution.  Wife has medical issues and needs help herself so maybe she is not \"perfectly capable\" as OP insists.  I still have doubts about OP's claim that the baby always wakes at 8 am and that the baby sleeps right through the night.  I'm an adult and I only sleep through the night maybe half the time (if that).  I really wonder if wife is getting up to tend to baby without OP noticing - during the night and also between OP leaving for work and checking on nanny cam. And OP has been exaggerating - he said he checked the nanny cam at 9:12, so where does this sleep to noon nonsense come from?  Yes the baby needs to be attended to, and OP himself even said wife gets baby when he cries.  maybe baby has learned to anticipate OP's calls on nanny cam and is waiting for that call in the morning? If baby cries for his mother first he'll miss the nanny cam call, right?  OP may have conditioned his son to wait until after OP's morning cam call to cry for his mother's attention, did OP ever consider that?",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1214,
      "content": "I’d kill for my baby’s dad to have ever wanted to be this involved in my child’s well-being. NTA. You care about your son sitting there in the dark alone for an hour before his mum wakes up, if he wakes up at a certain time every morning THAT is when the routine should start. Not when mum is woken up by the 4th phone call. \nIt helps children learn when their parents are involving them in things like making breakfast, helps stimulate him and is just all around better for them rather than keeping him in his dark room for even longer?? \nHow anyone says YTA I just don’t know. She needs to do better, or you should volunteer to swap and you can make sure your son is getting everything he needs",
      "id": 173,
      "comments": [
        {
          "score": 474,
          "content": "This! I can't believe all the people saying he's wrong. I can't imagine leaving my son in the dark awake while I slept. My husband would be angry of I did this, and I would be angry at him if he did this. Especially on a regular basis.",
          "id": 174,
          "comments": [
            {
              "score": 257,
              "content": "Yeah, the overwhelming YTA judgements are baffling. I couldn't imagine leaving my children awake and alone in their crib for several hours every morning. And if that was simply part of my routine, my wife would kill me.",
              "id": 175,
              "comments": [
                {
                  "score": 32,
                  "content": "His wife has chronic fatigue and depression. He refuses to pay for help because he shouldn't have to (not because he can't afford to). \n\nShe's not an AH, she's sick. OP is refusing to do anything to actually help her and minimizes her illness, preferring to criticize her.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Unfortunately, these relationship advice subs are filled with people whom never had one, or only get their information from TV and the Internet. In this case, its most likely people who do not have or never cared for a child more than an hour at a time.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 231,
          "content": "Seriously this, NTA. All these Y T A comments are crazy. \n\nA kid sitting in a crib quietly for a while is fine, but he said kid wakes up around 8 and wife doesn't get kid until OP calls her between 9-10. That's up to 2 hours of sitting in a crib, in the dark, with no stimulation, in a soiled diaper. That is not developmentally healthy.\n\nFunny that the wife says she has a routine, yet she wakes up at inconsistent times and relies on her husband to find a break in his work day in order to be her personal alarm clock...",
          "id": 178,
          "comments": [
            {
              "score": 19,
              "content": "People are literally saying him sitting, alone, in the dark, with no toys (if they follow safe sleep guidelines), with likely a wet diaper, and having not eaten in probsbly 14 hours, for 1-2 hours every day is actually good for him and \"independent play\". I'm fucking horrified.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 190,
          "content": "I feel like I had to scroll forever to find a sensible comment. The baby sleeps 12 hours 8-8 then sits alone for 2 hours that’s 14 hours of a 24 hour time frame. Plus there’s a nap in there (I have a baby almost the exact same age who naps 2-3 hours depending on how busy we were before nap time) so now 16-17 hours a day are spend in the crib. I also have a 5 and 7 year old so this isn’t my first rodeo.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Yes! I'm surprised by all the Y T A votes. If this child is truly sleeping 12 hours and then hanging around for another hour or two, that is way too long to go without a diaper change, if nothing else. I would be concerned about the mom being burnt out/dealing with PPD/something else, because it seems odd that she doesn't easily wake or want to engage with their child as she starts her day. I have a 15MO who is an early riser, so I understand needing a break sometimes, but it feels like something else is at play here.\n\nEdit: OP mentioned in a comment that his wife is being treated for medical conditions that explain her balehaviors. She needs proper support for her and their little one, not criticized on Reddit. If OP posted this on any of the parenting subs, he would be absolutely roasted.",
          "id": 181,
          "comments": [
            {
              "score": 22,
              "content": "[deleted]",
              "id": 182,
              "comments": [
                {
                  "score": 12,
                  "content": "This information definitely needs to be included in the main post. Pregnancy/post-partum hormones do all sorts of things to someone's mental/physical health and her behaviors make a lot more sense now. Being a new parent in general is hard, but harder for some, and it sounds like she is struggling and needs support. I think this situation is far beyond an AITA post at this point.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "NTA. It’s no big deal if a toddler is awake, not crying, and alone for maybe even a half hour…. But an hour? More? When does she wake up if you don’t call? With a dirty diaper, alone for an hour or more? No. I would not want that for my child. I think the Y ta comments reflect at least a bit on that fact that your the father not the mother. It’s not fair. If the roles were reversed people would be voting way differently. NTA.",
          "id": 184,
          "comments": [
            {
              "score": 71,
              "content": "I agree completely if the roles were reversed the responses would be way different. If this was a mom checking in on her kid and husband, the comments would be about how lazy and incompetent the father was for getting up so late. \n\nNTA",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "I thought I was taking crazy pills with all these y t a votes! This is majorly concerning that his wife is letting their son hang out awake for so long. I can see 30 minutes or so, but 1-2 hours??? Who thinks this is ok? It’s not! Wife does sound like she needs some help bc this isn’t normal.",
          "id": 186,
          "comments": [
            {
              "score": 8,
              "content": "I agree!! There’s something going on with your wife. At 20 months old, your child can play while she’s in the kitchen prepping or drinking her coffee. A 20 month old is walking, talking and wanting to interact. I do feel bad that the child is alone for 2 hours in the dark in the morning. If this was done at a daycare, it would not fly. At that age, they’ve already worked on their large and fine motor skills by 10 am!",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "We saying yta because he omitted the fact that she's narcoleptic in his original post. She needs help because the meds she's on aren't working enough. So instead of micromanagement he van either be home more or hire a nanny. We haven't a clue how we'll she can manage but op knew her medical history before making a baby.",
          "id": 188,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "OP stated in a comment \n\n> Depression medicine didn't work, blood tests were \"good except low b-12\", she \"forgets\" to take the b-12, now she takes medicine that normally treats ADHD/narcolepsy and has chronic fatigue. \n\nSo yeah he's an 🍑",
          "id": 189,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1002,
      "content": "NTA Your wife is being neglectful. Your son shouldn’t be awake 2 hours in the dark with a wet diaper before someone comes and gets him. But you need to also need to find out what’s going on with your wife in a more loving way. Is she depressed? Is she staying up too late because she needs more time for herself? If that’s the case, perhaps you should consider putting your son in preschool when he turns two.\n\nEdited to add: Something is very wrong if your toddler is sleeping through the night, and your wife can’t manage to get out of bed by 8:00 or 9:00. You are right to be concerned about your child’s wellbeing, but you should be concerned about your wife’s also.",
      "id": 190,
      "comments": [
        {
          "score": 229,
          "content": "Exactly. Just because a child doesn’t cry doesn’t mean they don’t need to be changed. There are babies who will sit in their poop and pee and not cry at all. That’s not a reason to let them sit in it! The amount of people saying YTA is astounding to me. If this was a mom saying a dad did this it would be unacceptable.",
          "id": 191,
          "comments": [
            {
              "score": 38,
              "content": "Omg the amount of Y T A is nuts to me and making me feel crazy. I have two kids myself. I never let them be awake more than a few min alone or I’m usually up before them. My kids sleep thru the night and my youngest (diapers) I need to change immediately every morning and sometimes he poops when he wakes up. I could never let him sit in that for an additional hour or two?! He’s an easygoing baby too he wouldn’t make a fuss. A lot of these comments I think are basing their opinions on an average kid/baby thinking they’ll cry immediately etc.",
              "id": 192,
              "comments": [
                {
                  "score": 18,
                  "content": "Something tells me people who are completely voting Y T A don’t have children.",
                  "id": 193,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "She has narcolepsy. So yeah there's something wrong with her. But it's something he knew and should hire help for her. He says he doesn't feel he should have to hire help though. So instead he wants to \"fix\" her with shame.",
          "id": 194,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Apparently she has narcolepsy.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 771,
      "content": "Oooh, this is hard. Could be E.S.H. because she's clearly waking up too late. But the entire rest of this is such a nightmare that I'm going with YTA. Your whole deal is that of a horror movie villain mixed with a dystopian nightmare.",
      "id": 196,
      "comments": [
        {
          "score": 45,
          "content": "I don’t understand why I had to scroll so far to see an ESH. He shouldn’t be micromanaging his wife everyday and it’s borderline controlling. And she shouldn’t be leaving a baby alone for hours. I’m a mother myself and a child that young absolutely needs to eat/drink and get a diaper change within an hour of waking up. Children need to eat more often than adults, especially toddlers and babies. The very first thing you should do with a baby/toddler in the morning when it wakes up is give it a hug, a diaper change, some milk or water, and THEN you can go on about making breakfast. I mean for Christ sake, every person I know in the world wants to at least have a glass of water when they wake up. And when is the last time you’ve gone a whole 14 hours without eating?? Just because that baby isn’t crying doesn’t mean it’s content and happy. The poor thing probably doesn’t cry because they learned no one will respond to their cries.",
          "id": 197,
          "comments": [
            {
              "score": 19,
              "content": "I still don’t understand how he knows the baby is awake and alone for hours in the morning? OP says he logs on turns the night light in, says good morning and then calls and wakes his wife. \n\nIf he only logged in for the first time that day, how on earth does he know when the baby woke up? Has it been mentioned anywhere?",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Apparently op mentions that his wife suffers from depression and the meds haven’t worked so far",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I want to upvote this comment to the moon!! They are both asshats here. If she is dealing with medical and mental issues, she should be getting help which means he needs to pay for childcare till she gets better. Not excusing her role in all this because she needs to deal with real life and as a person who isn’t all that able to do that, I didn’t children. I do however get up and take care of my doggo. They are absolutely both wrong.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}