{
  "post content": "I am 15 weeks pregnant and still have this nagging nausea every day. The only meal I can stomach at the moment is eggs and rice. I told my husband yesterday that I was worried that we only had 3 eggs left and he said he would go to the store and get more. Next morning, he wanted to tell me about this wonderful breakfast he made for himself (English muffin, 3 eggs and ham). Without thinking,  I’m like “that’s great babe, sounds good, glad you liked it” meanwhile he is working all day. I get hungry finally and for the first time I can’t wait for the eggs and rice. I open the fridge and the eggs are not where they usually reside in the fridge. \nMe: babe did you seriously eat all of the eggs \nHim: yeah I told you about my breakfast \nMe: I told you that’s the only meal I can eat right now and I was worried about the eggs running out! \nHim: oh sorry\nSo here I am maybe overly pissed off, but come on! \nAm I the A**hole for getting mad?",
  "id": 1,
  "comments": [
    {
      "score": 55,
      "content": "INFO: Is there a reason you can't go to the store and buy eggs?\n\nGiven the responses, NTA. Husband knows that's all she can eat.  How rude of him to finish off one of the only two things in the house OP can stomach. \n\nHope your morning sickness goes away soon, OP.  If you have a store within walking distance, I encourage you to get some fresh air and exercise.",
      "id": 2,
      "comments": [
        {
          "score": 15,
          "content": "Yes I have been nauseous every day of my pregnancy",
          "id": 3,
          "comments": [
            {
              "score": 30,
              "content": "If all you can eat is eggs and rice,  you need to invest in more eggs at a time. Better yet,  set some aside for him and when his is gone,  he can't touch what's left for you.  He can enjoy a variety of other foods that you can't.",
              "id": 4,
              "comments": [
                {
                  "score": 12,
                  "content": "Hide extra eggs in the vegetable drawer. Lol.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Also genius",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Genius",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Can you get them delivered? Like instacart or something?",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 40,
      "content": "NAH\n\nIt was crappy he forgot about the eggs but you are also gonna have to get used to/find alternative ways to get groceries/stock up.\n\nIn my current and last pregnancy I couldn't go into a store more than 10 feet without dry heaving and puking so my husband has done most of the shopping. I would recommend looking into grocery delivery services for yourself if they are available for times like these or curbside pickup. Also since you know what you can handle at this point stock up a lot. Get 3-4 dozen eggs and always make sure you keep a steady supply so you don't go hungry.",
      "id": 9,
      "comments": [
        {
          "score": 10,
          "content": "This is a really resourceful comment! I will stock up!",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 19,
      "content": "Info: why can't husband just go and get more eggs?",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "NAH, your hormonal so it's understandable but you or he can get more eggs.",
      "id": 12,
      "comments": [
        {
          "score": 1,
          "content": "Agreed!",
          "id": 13,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "NAH. Yes, it was inconsiderate to finish them off but he just forgot.",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NTA. My stepdad has this thing where he boils like 7 eggs at a time. The issue is that I buy separate groceries for my mother and I (I bake a lot I need my damn eggs) and I’ll plan to make something only to find out that he’s used all the eggs.",
      "id": 15,
      "comments": [
        {
          "score": 4,
          "content": "I have a separate egg tray for my boiled eggs. We buy a huge box of eggs (I think 96 eggs), I hard boil 12 and put them in the tray and we can have them on salads. The rest goes in the a bin on the inside of the door.",
          "id": 16,
          "comments": [
            {
              "score": 6,
              "content": "My stepdad just sucks. He figures that since it’s his house he’s entitled to everything in it. He’s a landlord in and apartment complex. He doesn’t pay rent. My moms name is literally on the lease. I’m angry ranting now because I was gonna make cupcakes for my coworkers tomorrow and there are no eggs",
              "id": 17,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "INFO  can you just buy a chicken?",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NAH.  You're hormonal and a bit crazy right now. He wasn't being malicious I'm sure and just wasn't thinking. I am usually so in control yet during pregnancy would cry then laugh and my husband would look at me with this scared look not having any clue what to do.....time for instacart (or similar delivery) or just stock up.  We go through so many eggs in my house and whenever anyone is at the store a carton of eggs is being bought regardless of how many eggs we have at home.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Do your local grocery stores deliver?",
      "id": 20,
      "comments": [
        {
          "score": 3,
          "content": "Or Instacart.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA. I would have been annoyed too.",
      "id": 22,
      "comments": [],
      "relation": "Support"
    }
  ]
}