{
  "post content": "I am Female 14, and my mother female 37.\nContext-  Me and my mom use to be close but it doesn’t mean me and her don’t get along. She does a whole lot for me and she is the best mother in the world, and I appreciate her a lot. \nAITA?\nRecently I’ve been really depressed about a couple things which I really don’t wanna talk about. It’s been going on for about 4/5 days. Just now my mom got tired of waiting and seeing me so sad and stressed, angry, etc. She came to me when I was sleeping and said “we have to talk”, I wasn’t really In the mood but I didn’t really have a choice. She said “these passed few days I’ve seen you really depressed and sad, so I would finally like to know what’s going on, because it’s been worrying and concerning me”, she said this in an angry and frustrated tone. I said “I know mom, but I really am not ready to talk to you about what’s going on” I said in a soft sad tone, as we talked she was getting really impatient and angrier then from how she was before, at some point She said “well then we’re gonna have to get you back to school and with a therapist because I have done everything to help you and nothing seems to work”, her knowing perfectly well that I left school because of the constant bullying I got, ( I am being homeschooled right now.) I told her that everything will pass and that I will get better again, she said “well you don’t seem to understand how all of this makes me feel” pointing out me laying in bed tired from being woken up, after she left, she stormed out of the house with my little brother. I don’t know where she went but I’m still here in my bed, crying. I feel like an A hole for not talking to her about it.\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 9,
      "content": "NAH. Depression is a tricky thing, and it takes it’s toll on you; but you have to remember that it takes a toll on the people around you too. It might be hard, but you really should talk to her.\nShe genuinely cares and wants to help, and it’ll be painfully draining on her until you communicate. I didn’t want to tell my parents why I spent every day in my room with blankets hung over the windows, but life got so much better when I did.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NAH \n\nIt seems like both of you are feeling helpless. If you aren't ready to talk to your mom about the specifics that is 100% okay, but I think a therapist is a good idea right now.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA A therapist may be a really good idea. That person could mediate if you also want to have your mom in some of the appointments. She seems to be taking it personally when she shouldn’t. What you’re going through is yours, not hers.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NAH - your mom loves you and is doing everything she can to help you.  You don't feel ready to accept her help. \n\nIt is so scary for a parent to watch their child suffer and not know how to help.  She is there for you and she will continue to be there for you when you are ready to talk.  Accept her help with the therapist idea at least...then you two will have established a good ground to discuss the school stuff.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA - depression is something you need to work on yourself and people can try to fix it and cause more pressure. But do consider help from someone because support helps and teen depression can spiral quickly",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Well, mixed feelings. Will start out with NTA for sure because that’s not what you are AT ALL. But you should get some help. Has to be the right person though, and your mom doesn’t sound right to be the first person you talk to. Maybe try and find a counselor at school, get some stuff off your chest and some advice. Can even use them as a moderator between you and your mom so it’s not so intimidating. I’ve been there, that was one of my methods. Worth a shot at least 🤷🏻‍♂️",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA\n\nIt’s okay that you aren’t ready to talk to her about this stuff, her feelings about your mental illness aren’t your concern.\n\nThat being said, while it’s shitty for her to try to guilt you into talking about what you’re struggling with, she’s not fully in the wrong. You’re being homeschooled, and that can be isolating, especially given how easily it is (for me at least) to isolate yourself when depressed, and you don’t have the resources of a guidance counselor who at least a little bit of training on how to handle this. You aren’t the asshole for being depressed & not being ready to talk about it, but while your mom isn’t handling this in the best way, she’s not wrong that you need resources beyond what she can provide.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am an asshole because I didn’t tell her about my depression.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 2 hours long on this post. [To learn more about the test click here](https://www.reddit.com/r/AmItheAsshole/comments/tio99u/so_we_decided_to_fuck_with_the_sub_again/)*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "I'm shocked you can say you're depressed after 4 days. That shit takes a long time to work out and you are 14. You're hormonal as hell. You're going to get mood swings. It's puberty.",
      "id": 10,
      "comments": [
        {
          "score": 2,
          "content": "I get that but I’ve been depressed for a really long time ( not self diagnosed ), it’s just hitting me hard these past few days and it’s getting more noticeable, sorry for not putting that in there.",
          "id": 11,
          "comments": [
            {
              "score": 1,
              "content": "Ah that's very different then. Your post was ambiguous. \nIf you want to tell her tell her. But it's important to recognise how you are doing will impact those around you.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am Female 14, and my mother female 37.\nContext-  Me and my mom use to be close but it doesn’t mean me and her don’t get along. She does a whole lot for me and she is the best mother in the world, and I appreciate her a lot. \nAITA?\nRecently I’ve been really depressed about a couple things which I really don’t wanna talk about. It’s been going on for about 4/5 days. Just now my mom got tired of waiting and seeing me so sad and stressed, angry, etc. She came to me when I was sleeping and said “we have to talk”, I wasn’t really In the mood but I didn’t really have a choice. She said “these passed few days I’ve seen you really depressed and sad, so I would finally like to know what’s going on, because it’s been worrying and concerning me”, she said this in an angry and frustrated tone. I said “I know mom, but I really am not ready to talk to you about what’s going on” I said in a soft sad tone, as we talked she was getting really impatient and angrier then from how she was before, at some point She said “well then we’re gonna have to get you back to school and with a therapist because I have done everything to help you and nothing seems to work”, her knowing perfectly well that I left school because of the constant bullying I got, ( I am being homeschooled right now.) I told her that everything will pass and that I will get better again, she said “well you don’t seem to understand how all of this makes me feel” pointing out me laying in bed tired from being woken up, after she left, she stormed out of the house with my little brother. I don’t know where she went but I’m still here in my bed, crying. I feel like an A hole for not talking to her about it.\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    }
  ]
}