{
  "post content": "Shared building, with myself in the downstairs in-law and 3 women in the main portion of the house. Around 9pm the other night I hear the \"eeeh-ur eeeh-ur\" of the mattress and it's pretty obvious someone upstairs is doing the old, pardon the vague euphemism, penis-in-vagina-intercourse. I occupy myself elsewhere where i can't hear it, and when the sounds have been absent for awhile, I text \"Not to be crass or make anyone self-conscious, but before the next sexy-time, that mattress needs some serious de-squeaking. I've left some WD40 at the bottom of the basement stairs :)\" to all 3 girls above, as I'm not sure who's doing what (not like it matters). And I did leave an old bottle of WD40 out with the mail on the basement steps, not in a cheeky way but as a genuine solution to said problem. Total acquaintance-relationship with all 3; they do their thing and I do mine, and paths rarely cross. We share some communal things like laundry, mail distribution, and trash/recycling, but separate entrances and we don't interact socially. \n\n The next day I receive this as a response \"That was incredibly crass and intrusive the other night. Please put on headphones next time.\"  What am I missing, or do/didn't do to make me an asshole, or is said responsee being an A-hole. Genuine question; not morally high-grounding or trying to call someone one. Thanks in advance for any opinions.",
  "id": 1,
  "comments": [
    {
      "score": 1795,
      "content": "NTA, that is fucking hilarious. Pun intended.",
      "id": 2,
      "comments": [
        {
          "score": 503,
          "content": "NTA next time you just start yelling ‘oohs’ and ‘aahs’ when they are doing it, very sure it will stop immediately",
          "id": 3,
          "comments": [
            {
              "score": 384,
              "content": "They know that their bed squeaks. NTA. \n\nMaybe next time record the sounds from your room and send it to them so they know how loud it is . \n\nIf it’s just regular bed shaking who cares, don’t be a prude . I’d send a text  ⭐️⭐️⭐️⭐️  or 9/10 or something like that. ‘could be improved with more audio variation’ .",
              "id": 4,
              "comments": [
                {
                  "score": 89,
                  "content": "That's a fucking critique.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Gets the message across . People need to lighten up.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Some people need their fuckin critiqued, just BANG BANG BANG isn't enough anymore.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 52,
                  "content": "Let me get this straight: your suggestion is to hang around for their next session and then *record* them? Do you honestly think this will help the situation? This is terrible advice!",
                  "id": 8,
                  "comments": [
                    {
                      "score": 18,
                      "content": "not to mention super creepy and possibly illegal",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "This ☠️",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 189,
              "content": "Roommate scoffed at me when I told her I could hear her and her latest guy having sex.\n\nSo, in the most pathetic voice I could do, I says \"But, I'm a *good* boy!\"\n\n\"NOOOOOOOOOOOOOOOOO, I can't believe you heard that!\".\n\n20 years later, all I have to do is look over and whine \"But, I'm a good boy!\" to make her turn beet red.\n\nWhy was the tomato red?  It saw the beet root.",
              "id": 11,
              "comments": [
                {
                  "score": 29,
                  "content": "If I hadn't accidentally walked in on my grandparents, I would never have known why it was called a \"root cellar\".",
                  "id": 12,
                  "comments": [
                    {
                      "score": 12,
                      "content": "16 year old me: \"sounds like grandma fell on the floor and is in pain!  Let me go in and help her!\"\n\nThat's the day I learned she met Frank at the senior center.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Niiiice.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "You have the same roommate after 20 years? Are you the Golden Girls?",
                  "id": 15,
                  "comments": [
                    {
                      "score": 13,
                      "content": "No, still just friends.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Wait, is that what the guy said or SHE said???",
                  "id": 17,
                  "comments": [
                    {
                      "score": 7,
                      "content": "That's what he said.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Love the answer. Reminds me of when my now husband and I moved into an apartment. We were downstairs and these two college girls who seemed to have different guys over every 2 weeks lived upstairs. Our first night we heard Yahooooo and weird screams then later the other girl was F-me cowboy weeeeee. It was funny. The first few times we laughed and just imagined the time the 4 were having but having to work and only getting a couple hours sleep we wondered if we should let them know the walls and ceiling was not that thick. Instead the next night they started we turned up some suitable music and just started yelling out same things we were hearing. The next day one of the girls was in the hall and said \"just to let you know the walls are really thin hear. You can hear everything.\" Hubby said we knew it for the 2 weeks we have lived here.  She turned like 5 shades of pink/red.",
              "id": 19,
              "comments": [
                {
                  "score": 3,
                  "content": "My wife's old apartment had incredibly thin walls and a connecting door between the two bedrooms. It was covered but still there. After we'd been together for several weeks we were in bed and I heard her roommate in the next room cough. And then I realized how much he must have heard...",
                  "id": 20,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I think the girls we had upstairs did not even think that we heard them until we said we knew the walls were thin since we moved in. I think her and her friends thought they were catching a newlywed couple. They didn't know the night we made the noises we were mocking them while playing Nintendo lol",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I came here to say turn porn on really loud at all hours of the day - see what they think then",
              "id": 22,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Hahha hilarious!",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Or theyll be like my old roomies, who deliberately got louder.\n\nThey won that war, i bought headphones. Gotta know when youve lost",
              "id": 24,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I don't get how he's NTA. He's an adult, adults have sex, unless it was a constant thing, why bring it up and comment on it. If one night my neighbors move some furniture and it's a little loud, I'm not.gonma comment on it. If one night my neighbors fuck and I hear it, there's no reason to comment on it. Also the term \"sexy-time\" is cringey and neckbeardy.",
          "id": 25,
          "comments": [
            {
              "score": 41,
              "content": "She knows her bed is making noise. By the sound of it, it isn’t a one off. Also who doesn’t use the term sexy-time? My wife and I use it all the time.",
              "id": 26,
              "comments": [
                {
                  "score": -5,
                  "content": "What makes you think it's not a one off? The whole thing describes one situation. I just think it's weird for someone to hear someone having sex one night and then decide to comment on it in a group text. Like there's just no reason to do it. And the WD-40 is way overboard. And with sexy-time, I can see a couple saying it in a playful cutesy playful way, but saying it to other people is cringey. Like with friends or acquaintances I call it sex, sleeping together, banging or fucking depending on the situation.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 18,
                      "content": "You're acting like you feel attacked because you have noisy sex. Like there's really no other reason for your lid to be this popped about it lol, you're acting so defensive and inserting yourself into this a little too much",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Good for you.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Are you saying you like to listen to others having sex because that's what this is sounding like.  \n\nPerhaps the neighbour didn't realise just how loud they actually were and the response is more from an embarrassment perspective because they don't like being called out.\n\nIf you say something then the noises may stop because they'll fix it.  Say nothing and it will continue... now some people get off on it... others nearly go round the bend with it.",
              "id": 30,
              "comments": [
                {
                  "score": 0,
                  "content": "What? Where did you get that from? I live in an apartment, I hear other people doing things all the time. I'm not gonna make a big deal about it cause it just comes with the territory. If it were all the time at crazy hours, that's another story. But a one off situation isn't a big deal.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Not sure how WD-40 is useful in this case....I thought that was for tools and keyholes.",
          "id": 32,
          "comments": [
            {
              "score": 38,
              "content": "It's an oil lubricant used for metal, the assumption is that the metal on the bed frame is rubbing together as they're doing the devil's tango the oil would prevent the noise.",
              "id": 33,
              "comments": [
                {
                  "score": 36,
                  "content": "WD40 is not actually a lubricant. It is a solvent. If you try using it as a lubricant on anything more-sophisticated than a door hinge, you could do damage.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 11,
                      "content": "True personally I would use a 3 in 1 oil  if the issue was the frame and not the mattress, but again I personally wouldn't leave a can of wd40 out for a roommate I think that's too far a conversation maybe because a lot of people don't like the idea of other people hearing them have sex, but leaving wd40 out was probably too far",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Penetrant* so it works on 2 levels lol",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "It's a lubricant lubricant. They advertise it as a lubricant also, we'll the do here I the UK where we're not so quick to make a court claim and have common sense unlike over the pond.\n\nEdit was a spell check mistake",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "powdered graphite?  What's your engineering solution?",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "But can you tell that from hearing squeaks? Besides, couldn't it just be thin walls rather than the fault of the couple?",
                  "id": 39,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah that's true, very well could be the fault of thin walls, Definitely a difficult situation, personally speaking I would have had a conversation with them still cause being able to hear a roommate having sex can be embarrassing for some, not trying to defend op cause leaving out the wd40 was too far in my opinion",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Or the box spring possibly, if they have one. Don't think you can lubricate one of those...",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "WD40 isn't a lubricant, it's a water displacement spray.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I don't think this particular key hole needs lubricant.",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "WD-40 works on locks but I recommend that with a grain of salt. There’s tiny bits of metal in WD-40 to help knock rust off so it’s possible to seize a lock with WD if some of those bits of metal end up jammed in the lock.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Seriously if someone sent me this I would laugh so hard!  And probably try to fix my bed frame lol",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "they are flirting. take the hint",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "Penis in vagina is NOT a euphemism. It's the exact opposite. A euphemism is a substitute for the actual thing -- like \"doing the deed\" or knocking boots or getting horizontal... so right off the bat cause you've described this in such a creepy and inaccurate way - Im gonna say something about you is already sketchy... so YTA.",
          "id": 47,
          "comments": [
            {
              "score": 6,
              "content": "It was a clear and obvious joke my dude",
              "id": 48,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 770,
      "content": "NTA.\n\nEmbarrassment/Shame manifests in strange fucking ways.",
      "id": 49,
      "comments": [
        {
          "score": 94,
          "content": "In this case I think it was after the fucking ways",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Why would anyone be embarrassed or ashamed of having sex? Idk if it's a new mentality or what, but hearing friends having sex was never such a big deal when I was coming up. It's a natural act & you can just turn the TV up or whatever. As always I'm so glad that I was born in the Era I was.",
          "id": 51,
          "comments": [
            {
              "score": 82,
              "content": "Yo you’re wild I’d be MORTIFIED if someone heard me having sex… sex is so intimate?? I don’t want anyone other than my partner knowing what I sound like while being pleasured that’s so weird?! Kudos to you for being carefree about it cause I could never lol",
              "id": 52,
              "comments": [
                {
                  "score": 1,
                  "content": "Hey, it's not like I'm saying I'd go hog wild while other ppl are home. But something like hearing the bed squeak or some bumps or whatever would not bother me. I lived with a lot of people for a long time. We would've all been celibate if we never had sex unless the house was unoccupied. There's gotta be discretion from both entities, I believe.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Why be motified?",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -13,
                  "content": "He's not carefree he's a dick for being cras and oversharing his thoughts for no appreciated reasons than just to be a bigger knob than what he heard the night before bogan roomy really  Don't do anything people if he's home noise police will warrant you an embarrassing text fine",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "I mean, during my days at University, we definitely gave our housemates shit if we heard them going at it, but not because we were upset just because it was funny…",
              "id": 56,
              "comments": [
                {
                  "score": 5,
                  "content": "This ☝️",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "It depends on your background. I was raised very religious, so I feel really ashamed to have sex, even if no one hears.",
              "id": 58,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "The US has a very prudish and puritanical culture. A LOT of us were raised to treat sex as a dirty shameful thing, that enjoying it makes you a bad person, and that it exists only for procreation amd mever ever pleasure. Also that doing it outside marriage means you're gonna be tortured forever.\n\nYes, this is as traumatic as it sounds, thanks for asking.",
              "id": 59,
              "comments": [
                {
                  "score": 7,
                  "content": "We didn't really ask.  Also, it's not \"prudish\" to not want to listen to someone else having sex.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Read the post I responded to. I didn't say it was prudish to not want to hear people having sex.\n\nThey asked \"why would anyone be embarrassed about having sex; it's natural\".\n\nTreating sex as something inherently to be ashamed of is prudish, definitionally.\n\nEdit: Also, \"We didn't really ask\"? The person I was responding to (you'll not, it wasn't you!) literally did ask a question.",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Sounds to me like the solution is for OP to turn the TV on max volume every times they hear squeaking. Make sure it’s the least sexy show possible. Like blues clues or something. 😂",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "YTA Embarrassment/Shame manifests in strange fucking ways. It's a shared house. there's going to be minor noise.",
          "id": 63,
          "comments": [
            {
              "score": 22,
              "content": "Why does every YTA vote in this thread feel like it's emotionally charged like it hit them personally hahaha\n\nSimply just lubricate your squeaky beds people, you're not being asked to wear a chastity belt",
              "id": 64,
              "comments": [
                {
                  "score": -5,
                  "content": "projection much? you sound like a creep who tries to control others",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -8,
                  "content": "No amount of lubrication is going to change the noise with certain beds, or certain sex.\n\nThe OP sending a text to a group of, essentially, strangers to be like \"I heard you having sex\" is creepy. \n\nIf you were living in an apartment and your neighbor told you they heard you fucking, you wouldn't think that was some creep shit?",
                  "id": 66,
                  "comments": [
                    {
                      "score": -3,
                      "content": "it’s so creepy",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 412,
      "content": "NTA. I had upstairs neighbors with a terribly squeaky bed. Having sex wasn't the problem - it was that awful, high-pitched, ear-bleeding noise.",
      "id": 68,
      "comments": [
        {
          "score": -70,
          "content": "I agree, but what to do? I checked all screws, did what I could, but the wood was just totally bend and out of place. Only fix was buying a new bed. 🤷‍♂️\n\nThey left a note at the staircase that we should refrain from having sex after midnight…but what to do when both wake up horny really?! And it only happened like 3 times in 8 years after midnight, so I think they were quite overzealous there too.\n\nIn the meantime we have a proper new bed. And boy, lemme tell you it’s MUCH more fun not having to hold back or use a less squeeky position all the time 😂😂",
          "id": 69,
          "comments": [
            {
              "score": 54,
              "content": "Well when the bed is a problem, don't do it on the bed, bend her over against the wall or desk and go to town...\n\nAnd for OP, NTA but the bottle of WD40 was too much, just mention it in the note and it's enough.",
              "id": 70,
              "comments": [
                {
                  "score": -42,
                  "content": "We tried, but her health issues prevent alot of procedures at times. Sometimes in the shower was somewhat feasible. Bend over only worked for a very short time.\n\nSo yea we tried, but sometimes it was now or never. 😂",
                  "id": 71,
                  "comments": [
                    {
                      "score": 22,
                      "content": "YTA.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 395,
      "content": "How would anyone apply anything, even  lubricant, to the springs inside of a mattress? That’s not a “genuine solution.”",
      "id": 73,
      "comments": [
        {
          "score": -153,
          "content": "Take off the box-spring cover and you have the coils. And yes, WD40 isn't technically a lubricant but rather a water-displacer, but it's what was in the garage, and it can help with noises caused by friction. Short term it's better than nothing. And even if my suggestion is incorrect in terms of hardware, it's still a \"genuine suggestion\" by definition because I thought it was viable fix of the problem. \n\nSo everyone saying I'm the asshole; it's better to not say anything and continue to listen to someone's sex sounds? I know if it was my mattress and someone was living below me, I might be slightly embarassed (esp depending on the kink levels of that night) but better a little flustered for a day or 2 than have an unwitting audience for the foreseeable future. \n\nAnd for a friend, maybe I would put on headphones and go further out of my way. But I've lived there 16 years and this woman just shy of 1, and because it's against my consent, no one should be forced to put up with the audio of someone fucking.",
          "id": 74,
          "comments": [
            {
              "score": 127,
              "content": "You don't get to consent to what other people do in their apartment. What a nut job.",
              "id": 75,
              "comments": [
                {
                  "score": 43,
                  "content": "Poor choice of words considering how much \"consent\" seems to solely apply to sex these days, but there are other applications of the word. Let's just say \"participation\". I didn't want to be an active participant in the constant noise pollution of squeaking. The sex itself isn't really the issue but the invasion of sound in my bedroom when I don't want it and the lack of consideration for others in the house. For someone who thinks I'm a nut-job, what would you have done in the situation?",
                  "id": 76,
                  "comments": [
                    {
                      "score": 76,
                      "content": "Then don’t have roommates. If you have adult roommates then there’s a possibility you’re gonna hear some fucking. \n\nAs for what I would have done? I would have turned up whatever I was watching, put on headphones or went to sleep.",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 36,
                      "content": "I would quit my complaining and put on some music or headphones.\n\nAlso, WD-40 is like 99% not going to do anything, the squeaking probably isn't coming from the mattress but some wood on wood (yeeaaaahhhh) rubbing in the bedframe, so no, you're not being helpful. Bedframes (commonly) squeak when you have sex on them, people can have sex in apartments. You need to get over it. YTA.\n\nOr you could move to Japan, where I've been angrily talked to by my neighbors for sneezing in my apartment... Sounds like that's more your speed?",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "You seem very pompous and entitled. Probably a shit roommate too",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -53,
                      "content": "I have been in your situation. I worked hard saved up and bought my own house. I work in multifamily housing and know for a fact it's nearly impossible to make housing soundproof. You don't consent to sound entering your apt, that's hilarious.\nGet a white noise machine. They have a right to have sex in their apartment without harassment from you, if the walls are thin that's a you problem.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I agree with you, why even bring it up 💀 and everyone in this thread is saying NTA 💀",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 89,
              "content": "YTA, friend. \n\n1. It sounds like this was the first time this ever happened, \n\n2. You're overinflating it, if all you heard a la \"sex sounds\" was the sound of a squeaky bed. You mention other incidents of noisiness, yet you chose to intervene in the one that would be most sensitive to your neighbours.\n\n3. This is not about your consent. You know their intention was not for you to hear them, and you know there's no world where someone asks their neighbour for \"consent\" to have sex cos their bed might be squeaky. \n\nPlease consider that you're being entitled (your consent?... their 1 year vs your 16years?), inconsiderate (pointing out someone's sex and making a mean-spirited joke about it), and quite a bit holier than though in your tone, even if that's not immediately apparent to you.",
              "id": 82,
              "comments": [
                {
                  "score": -16,
                  "content": "What's the mean spirited joke you're referring to?",
                  "id": 83,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Probably referring to the weird text you sent. Im with your roommates personally. It read to me as super passive aggressive. Leaving the WD-40 doesn’t seem “cheeky” or as a genuine solution to the problem - it’s just annoying on top of that text you sent. I’d have told you to fuck right off.",
                      "id": 84,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 56,
              "content": "Thanks, this comment helps solidify that YTA. You care WAY too much about this. Appreciate the description of how WD-40 works but in the process, you’ve exposed how insufferable you must be irl. I am so sorry for your roommates, I’m sure they need your cut of the rent to make ends meet, but otherwise you’re a blight on their home.  \n\nI can’t imagine living with someone like you. \n\nTechnically WD-40 is a water-displacer, and technically, you’re the asshole.",
              "id": 85,
              "comments": [
                {
                  "score": -25,
                  "content": "I don't agree. Can't switch to TA just because you got personally offended at their reply.      \nIf your loud fucking is keeping people up, don't be surprised if somebody mentions it, end of story.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The opposite is true actually. Context DOES matter. Duh lmao",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Loud fucking? It was just a little squeaky 🤣",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "It’s not loud fucking, it’s light mattress squeaking. Grow up",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 51,
              "content": "I've never had a mattress that the cover comes off of.",
              "id": 90,
              "comments": [
                {
                  "score": 8,
                  "content": "Often a box spring has an open bottom where you can get to the springs, not the mattress itself. \n\nHowever, my guess is if the OP was hearing it, it is more likely the frame where the issue is... but who knows.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Aren’t most box springs wooden with no springs at all?  There’s almost zero chance there’d be squeaking coming from a box spring even if it did have springs/coils, but most don’t even have them.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 42,
              "content": "I’m getting some major “I don’t have sex and it makes me mad that she is” vibes.",
              "id": 93,
              "comments": [
                {
                  "score": 9,
                  "content": "This. Something was bothering me reading these comments and it was THIS.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "YTA. How is it any more inconvenient for you to put on headphones for a roommate vs. a friend? You can’t take 3 seconds to put on headphones but you expect your roommate to take off their box spring cover and apply WD40 to their mattress coils?? LMFAO get the entire fuck over yourself!! Also it doesn’t matter that you’ve been living there 16 years to their 1. In 16 years you should’ve saved up for a deposit on a house if you’re this petty about incidental noise from roommates.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I realize your intention might have been to offer a solution, but honestly the sound of a bed squeaking is kinda par for the course with roommates. If there were loud vocalizations, a conversation about it could be appropriate. But people don’t generally like passive-aggressive gestures like what you did.",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I don't know dude. You were kinda extra with the whole thing, and that's what makes you a bit of TA. Wait to see if it happens again, and then politely say something like \"the floors are super thin\" or something. The whole WD-40 is just kinda cringey and sounds like an old man thing to do. They're not your friends, like you said.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yo, creepy, in this case: \n\n>So everyone saying I'm the asshole; it's better to not say anything and continue to listen to someone's sex sounds? I know if it was my mattress and someone was living below me, I might be slightly embarassed (esp depending on the kink levels of that night) but better a little flustered for a day or 2 than have an unwitting audience for the foreseeable future.\n\nThey never needed to know you were weirdly listening to them have sex. They're at home, being adults. You could have just ignored it like most normal people would. Instead you chose to message a group of women that you heard one of them having sex, and be awkward and cringe as shit about it with suggesting WD-40.\n\nHow would you feel if they texted you and said \"Hey next time you're beating off, keep your volume down, we don't need to hear your porn\"",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "lol no one does that especially not women (usually). If you want it done, suggest that you’re willing to do it for her.\n\nOr- I have the perfect solution for you. Buy them a new mattress without springs. Then they get a new mattress and your problem is fixed.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 351,
      "content": "YTA. People have sex. If it was consistently happening past 11pm loudly I would say that would warrant saying something but this was an overstep and very creepy and intrusive.  They had every right to be rude to you.",
      "id": 100,
      "comments": [
        {
          "score": 240,
          "content": "This. His message is creepy as fuck, especially with the smiley face. He could have just minded his own business. If the sound was waking him up on a regular basis then it would be fair to mention it, but it sounds like this was the first time and it wasn't late at night either.\n\nAlso, the \"solution\" is not really a solution at all. It sounds like he just wanted any excuse to bring up the fact that he heard someone having sex, and comes across a lot like shaming. The cringey way OP worded things in this post doesn't really help his case either.",
          "id": 101,
          "comments": [
            {
              "score": 31,
              "content": "Honestly the way it came across when I read it, it didn't seem like shaming so much as putting them on blast and trying to figure out who it was.\n\nI mean honestly, \"I texted the group chat with all 3 of them to let them know I heard one of them having sex\"\n\nOk you fucking creep.",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "This is another issue where I find the prevailing reddit wisdom really weird. Like... People have sex. Ideally you want some privacy but it's not a big secret.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Then have sex in a way that doesn’t involve non consenting parties :)",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "[deleted]",
          "id": 105,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -8,
          "content": "I mean, it seems to me that if the person is selfconscious about that stuff, they should be made aware of the issue so they can take steps to increase their privacy. Also, by admitting he heard he also demonstrates that he has no ill intentions, isn't judging and simply wants everyone to enjoy actual privacy instead of the assumption of it.",
          "id": 106,
          "comments": [
            {
              "score": 5,
              "content": "\"no ill intentions, isn't judging\", lol. Addressing it in the most passive-aggressive way possible is both of those",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -12,
          "content": "Because 3rd shift workers don’t exist, Amirite? Maybe check your privilege and realize that when you’re sharing space, you compromise. I work 3rd myself, and I make sure not to be a dick to my surrounding neighbors because we keep different routines.",
          "id": 108,
          "comments": [
            {
              "score": 66,
              "content": "Having sex in your own home isn't being a dick by any stretch, though. He wasn't even complaining about extremely loud yelling or moaning, which could be reasonably expected to be modulated. Bed squeaking is a near inescapable part of sex. Unless OP is willing to spring (lol) for a new, silent bed and mattress for each of the upstairs tenants he was the AH and trying to control their behaviour by embarrassing them.",
              "id": 109,
              "comments": [
                {
                  "score": -1,
                  "content": "He wasn’t pissed off about a bed squeaking a little bit. He was pretty clear that it was a severe squeak. Why is everyone on this thread acting like it was a major invasion of privacy ? If everyone can hear it in the space, it seems the polite thing to do is call it out for everyone’s sake.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "What are your hours that 9pm would be a problem?",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 327,
      "content": "Is it bad to have sex?  Is it there fault that the mattress/bed makes a noise whilst having sex?  Or is it your ignorance for living in a shared space and think this won’t ever happen?\n\nSorry but YTA.  Let people live their lives if you’re not happy then I think it’s time u move to a detached property where you can hear nothing but ur self.  They was totally correct - you should have put ear phones on.\n\nNot to mention 9pm isn’t too late to make noise so there is literally no problem but you here.",
      "id": 112,
      "comments": [
        {
          "score": 101,
          "content": "Had to search a bit for a sensible comment.\nA bed squeaking isn't disturbing or really noisy. The problem doesn't seem to be the sound but the awareness by OP that they are having sex. But sex is normal, and shouldn't be a great secret. Sure, don't go around making announcements about it, but a few squeaks here and there and even a few moans on some uncontrollable situations are things you should be cool with if you share a house",
          "id": 113,
          "comments": [
            {
              "score": 0,
              "content": "Would OP be mad at the lions having sex during their African wildlife safari?",
              "id": 114,
              "comments": [
                {
                  "score": 1,
                  "content": "Don't know. Would he be mad at a slight squeak from a mattress used for sleeping instead of sex?",
                  "id": 115,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -94,
              "content": "To be honest,it was a feeling of them overstepping their boundaries and infringing on my right to privacy n freedom while at home. Earlier in the week one of the women can into my unit to snag a package and didn't give me a heads up, and one of the women has a dog whose barking really disturbs my elderly kitty, and there has been some barking fits all week. Not huge stuff, but it adds up, esp in a short duration of time. Of course we have to make compromises in shared living situations, but if I could merely send a text to alleviate it happening again, why wouldn't i? Kinda felt like I HAD to say something so that my rights n wishes weren't overlooked. I don't this to snowball into animosity on anyone's behalf, and I honestly thought I was doing the pragmatic, common-sense best response to an uncomfortable situation.",
              "id": 116,
              "comments": [
                {
                  "score": 103,
                  "content": "What about you infringing on their rights to have sex in their rooms? What a weird hill to die on.",
                  "id": 117,
                  "comments": [
                    {
                      "score": -22,
                      "content": "He’s not infringing on their rights though. He just doesn’t want to hear it, which is totally reasonable.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 39,
                  "content": "You asked about a specific interaction, and I stand by the idea that you were the AH with the information that you gave in the original post. If there are other interactions where you feel disregarded or disrespected, that is a whole other question.\nAnd even of you were disrespected before, doesn't mean that in this particular case that happened. Sex is normal in life, even when you share a house. A little squeaking is also not anything above and beyond. It's the type of problems that bother when you don't have much else to be bothered with.\n\nEdit: btw, the squeaking doesn't infringe on your privacy or freedom. Unless noise laws are being violated, your freedom is being respected. Your freedom and desire for silence doesn't trump other people needs and wants for sex, intimacy, and normal activities. And your privacy also isn't being violated, no one knows anything about you by you being able to hear a few squeaks",
                  "id": 119,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "Right to privacy isn’t violated by you hearing a squeaky mattress. “But mah freedom!” also isn’t a reason. If there was loud moaning or something, sure, say something. But hearing a squeaky mattress or barking dog is just part of shared living. If you want silence, buy a single family home way out in a rural area with lots of land. Otherwise, adapt. YTA and a weirdo.",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "It sounds like you’re upset about other things, and then chose to get mad about something that would embarrass them or make people feel uncomfortable. I would feel creeped out by the smiley face too.\n\nSounds like you should talk to the people who live there face to face.. go outside for the conversation rather than trying to convey your emotions through text.\n\nLet them know you’d prefer they’d stay out of your unit, or give you a heads up before picking up a package in your space. Assume they want to get their package asap and maybe don’t want to bother you. What’s the optimal solution for you?\n\nLet them know your elderly cat is alarmed by the dog barking. But rather than saying that on its own, ask them if anything you are doing is triggering the barking. Consider that your actions could be making the problem worse, and ask if there are any changes to your own behaviours that could help create solutions.\n\nEveryone just wants left in peace, so if you demonstrate an honest desire to coexist in harmony (including making changes yourself- maybe the door needs to be closed more quietly?)…then they may be more willing to adjust their own behaviours.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "What about you find somewhere else to live if you can’t handle your neighbours making any noise. \nPerhaps a cabin somewhere in a forest where no one else bothers you would be a good place. You writing that note was rude and invasion of privacy.",
                  "id": 122,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "It happened ONCE. The other stuff is irrelevant and should have been dealt with. Instead you chose to embarrass these people and be a smartass instead of waiting to see if it ended up being an actual ongoing issue. Don't live in a split living situation if you can't handle everyday noises. For all you knew they could have had kids over jumping on the bed. You are creepy and immature",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "The world doesn’t revolve around your creepy ass",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "You’re a weirdo dude",
                  "id": 125,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -2,
                  "content": "[deleted]",
                  "id": 126,
                  "comments": [
                    {
                      "score": 12,
                      "content": "You complain about noise in the true sense of the word, not a few squeaks. It's not like they are savages moaning everyday for hours on end. It's a little squeaking ffs. The same way you call the police on a bar making too much noise at 4am, not on your neighbor alarm clock set up for 9PM for them not to forget to take their medicine.",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Right, maybe if they were straight up screaming or banging on walls but a little creaking? Come on, OP just wanted to be petty.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Agreed, you can't say that if you live in a shared house or apartment you are never allowed to have sex, and adding to the shame around it is not helpful either. Some countries are more puritanical about sex than others, and attach a latent cultural shame to sex which in my view is unhelpful and unnecessary.\n\nFor me it should no more be commented on than if you hear them exercising, walking around or cooking food. Consideration should be given after a reasonable time when people have a reasonable expectation of an undisturbed sleep.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "THIS.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": ">Is it there fault that the mattress/bed makes a noise whilst having sex\n\nThat definitely is their fault.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -102,
          "content": "Sex isn't bad, but it's against my consent in my own home that I don't want to be an unwilling participant to someone having sex. What if, let's say, the walls were two way mirror glass for some funky reason. I've lived there 16 years with no problems from any of the other tenants, then all of a sudden, two people fucking in front of me. They can't see me, but from my bedroom I can see them. By your logic, should I just put on sunglasses and \"oh shucks let me just go n afford a single non-attached dwelling in San Francisco yeah that'll be in my price range duh duh derderder because I'm such a sex-negative asshole\"",
          "id": 132,
          "comments": [
            {
              "score": 99,
              "content": "Lol. You don't have to consent to other people having sex. Noise travels, deal with it. If you can't handle apartment living don't live in an apartment. Your analogy and reasoning are batshit crazy.\n\nYTA",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "YTA, you don’t get to have consent what people do in the rooms THEY PAY FOR. If you don’t like the noise, then you need to leave. They are in their room. If you don’t like it find a different living arrangement for yourself.  They didn’t consent to you literally still lurking the whole period they did it then waited to send a creep text. You hearing it doesn’t include you, what a creep comment",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 50,
              "content": "I don't consent to you using reddit. So you must delete your account and remove the app.",
              "id": 135,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "You need to work on your tolerance of others. Live and let live.",
              "id": 136,
              "comments": [
                {
                  "score": -31,
                  "content": "Unbelievable that you posted this comment without realising how insanely ironic it is",
                  "id": 137,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "but...you're not participating. but you ARE sending creepy ass texts that make it seem like you got off on hearing it.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Op INFO please. Are you older by a fashion? or  a man? or both?\n\nIt would be a TON weirder to have an older man send a group of young ladies a slightly teasing message about their sex lives than it would be for a fellow 20 something to send that same text.",
              "id": 139,
              "comments": [
                {
                  "score": -6,
                  "content": "Same age; all in our 30's, and I think one of them is older than me.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Wait sorry I’m a little confused. You said in another comment that in your 14th year of living there, girl 1 (who has now been living there for three years) moved in after she finished college. This made me think you were at least 10 years older than the upstairs tenants. This, paired with the odd way you talk about sex (“sexy time”, “P in V”, etc), might’ve given people very weird vibes.",
                      "id": 141,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Phew! Sorry, but given your other comments, I would suggest headphones, too. I don't know anyone personally that still has an innerspring and a box anymore, so it may not be an easy fix.  Especially at a reasonable hour and not a stunning frequency, it is a pretty standard noise to hear. I don't think you're an AH, but I think your expectations are just outside reasonable.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "[removed]",
              "id": 143,
              "comments": [
                {
                  "score": 6,
                  "content": "OP is using \"consent\" as a disingenuous buzzword to dogwhistle to far right incels. Nobody reading this actually thinks that's how consent works, same way when a racist uses the words \"THOSE people\" you know exactly what they mean but you can't technically DO anything about it",
                  "id": 144,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Using the term \"consent\" as a resentful bludgeon to shame people having sex in their own, private space where the only sound is some distant squeaking? You absolutely understand how what you're doing is ridiculous, and the only reason you're telling on yourself like this in public is because you know far right incel creeps will squirm out of the woodwork to defend your misuse of the word",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Are you involuntarily celibate? Cause it sounds like you're bitter that someone is having sex and it's not you.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "It isn’t your home, you rent you creep",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 287,
      "content": "YTA for this cringey statement alone:\n\n>pardon the vague euphemism, penis-in-vagina-intercourse\n\nand the WD40 was a passive aggressive way to air your grievances. Like you said, you barely know them so I don't think that came across as funny. Besides, WD40 would do nothing for dodgy bed springs.",
      "id": 148,
      "comments": [
        {
          "score": 127,
          "content": "Feels very neckbeardy",
          "id": 149,
          "comments": [
            {
              "score": 51,
              "content": "It really does. This sounds like someone who's uncomfortable about sex trying to show they're comfortable about sex.",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 234,
      "content": "Next time bang on the ceiling.",
      "id": 151,
      "comments": [
        {
          "score": 230,
          "content": "You’re right; if they were banging on the ceiling, the bed wouldn’t make ANY noise",
          "id": 152,
          "comments": [
            {
              "score": 22,
              "content": "Sounds like they don't care to fix their nosey ass bed so yea. Hopefully you ruin their night and then they fix it.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This made me laugh during my lunch break. Thanks 😊",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If they're not making _any_ noise then are either of them doing it right?",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "it’s 9pm, not 1am. if you can’t afford to live on your own, this is what comes with roommate territory.",
          "id": 156,
          "comments": [
            {
              "score": 5,
              "content": "Exactly. If OP doesn't want to hear the sounds of life they need to buy a house on an acreage. With no pets or animals.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Still would be annoyed if you didn't fix the squeaking of the bed. Still stand by what i said .",
              "id": 158,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Join in the fun by shouting encouragement. Some oh yeahs, you get it girl/boy etc. Lol",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I like this. They’re banging loudly so do the same. NTA",
          "id": 160,
          "comments": [
            {
              "score": 0,
              "content": "I second this idea, definitely if they were loud enough to disturb op, then I'd be doing the broomstick taping on the ceiling 🤣 NTA love it",
              "id": 161,
              "comments": [
                {
                  "score": 1,
                  "content": "Just put on some headphones while doing the sex, easy fix for them.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Bang the ceiling? 😂🤔",
          "id": 163,
          "comments": [
            {
              "score": 5,
              "content": "Yeh just drill a hole and voila, ready for banging",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "When Spiderman gets laid",
          "id": 165,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 216,
      "content": "YTA the old penis in the vagina and you left them a bottle of WD40? You are A creep. Your adults in a shared dwelling. Its a few minutes and you could have said nothing",
      "id": 166,
      "comments": [
        {
          "score": -9,
          "content": "A few minutes? I'm sad for you.",
          "id": 167,
          "comments": [
            {
              "score": 7,
              "content": "I Feel bad for you though, too much time in front a screen gives you plenty of misconceptions",
              "id": 168,
              "comments": [
                {
                  "score": -4,
                  "content": "Lol what are you talking about? I was happy to drop it if you're happy with your 2 minute sessions, but I just find if your man can't last for at least 15 minutes there's no chance of an orgasm, but like I said happy to drop it.",
                  "id": 169,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Don’t be sad for me. I get what I need and more. He knows what he is doing",
              "id": 170,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Complaining when someone gives it back lmao. Sorry I bruised your ego",
              "id": 171,
              "comments": [
                {
                  "score": -4,
                  "content": "We must be responding to different people. \n\nFeels like you might be taking things too personally and projecting. Good luck in life.",
                  "id": 172,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 189,
      "content": "Not the most popular option, but YTA in my opinion. Of course it's intrusive to interfere in another person's sex life. Maybe if this is a regular thing in the middle of the night, maybe you could eventually have said something WITHOUT using the word 'sexy-time'. It was 9pm, mind your own business.",
      "id": 173,
      "comments": [
        {
          "score": 41,
          "content": "'Sexy-time' is cringey as fuck.",
          "id": 174,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "really? Sexy-time was the most cringy in this message?",
          "id": 175,
          "comments": [
            {
              "score": 13,
              "content": "Fr the “euphemism” made me throw up in my mouth a little",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}