{
  "post content": "My fiance, Green (27M) and I (24F) have known each other since High school. I love him so much but he does of a tendency to Mansplain things he doesn't fully understand. Places have opened up in my area and so we went to dinner with his mother, Purple, and his sister, Pink. (14F)\n\nWe were talking at dinner when Pink started complaining how horrible her period has been and can't predict it whatsoever when it comes. She asked if i had issues with it too. Purple chimed in that irregular periods can be pretty normal. I agreed but said that if she's really concerned she could see a doctor. \n\nThis is when Green pops in suggesting his sister start taking birth control, as it helped regulate mine. I had to remind him that i had my period twice a month in high school and it was necessary. Purple also brings up she's not comfortable giving Pink birth control yet and would rather try to wait until 16 or 17. They go back and forth with Green trying to explain how he knows its best for her and is getting slightly louder in the restaurant (He's naturally a louder person). I saw Pink shrink in her seat a bit as people were looking at our table.\n\nI ended up speaking up and said, \"Okay, Green, if you can tell me right now what the R on a tampon means, you get a say on whether Pink can take birth control.\" \n\nHe stuttered and thought about it for a bit and ultimately gave up and the topic was dropped and we got on with the rest of our meal. Though his mom and sister were still giggling about it a little bit before we left. \n\nWhen we got home, he said what i did was an a**hole move and i didn't have to embarrass him like that. I told him he was getting louder and embarrassing Pink over a matter that he doesn't get a say on and knows little about. I don't think i did anything wrong but I'm starting to feel bad, and think i could've resolved it in a better way. \nAITA?\n\nEdit: Thanks to everyone who commented! I was so surprised to find this blown up when i woke uo today XD. I wanted to answer some quick questions.\n1. Why was this dinner conversation? I'm used to this in Green's family. They're very open people and comfortable with topics like this as long as the conversation is quiet. I love that Green can feel comfortable talking about periods and such. \n\n2. Has he gotten better about stuff like this? Yeah, but he was really bad in high school. When we got together, i told him he needed to work on this if we want a happy future together. Nowadays he catches himself or, if he doesn't, he gets quiet if you correct him. He hasn't gotten mad like this in a while and that's why i was concerned about doing this wrong this time. \n\n3. What does the R mean on a tampon and why that question? It means Regular for Regular Flow. He's picked up my products before and I remind him to either grab Regular or Super for my brand, so it was a question he could've answered. \n\nSide note: When we met, his friends (male and female) called his moments \"Mansplain Mode\" so I'm just used to calling it that. I'm sorry if i offended anyone using the word. \n\nI'll be talking to him soon. Thanks again and have a great day everyone!",
  "id": 1,
  "comments": [
    {
      "score": 5932,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 2569,
          "content": "I wouldn’t call him a moron - but it was most certainly sexist.  \n\nYou might point out to him that speaking definitively on a subject he only has tangential experience with when at a table with THREE PEOPLE who have *actual* experience with the subject, he perhaps owes you (and his mother and sister) an apology.\n\nAnd maybe he should have a good long think about how he behaved.\n\nNTA.",
          "id": 3,
          "comments": [
            {
              "score": 1049,
              "content": "Moron- noun\n\nInformal. a person who is notably stupid or lacking in good judgment:\n\n\nI think moron is quite adequate.",
              "id": 4,
              "comments": [
                {
                  "score": 323,
                  "content": "Point taken - but shall we say sexists are a specific subset of morons?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 417,
                      "content": "All sexists are morons, but not all morons are sexist.\n\nSounds reasonable to me",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 196,
                      "content": "I will totally agree to that, or to him being a sexist moron or any other combination of the words.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "It most certainly was sexist, but it wasn't just that. It isn't just about his lack of experience; even if he were a woman himself, this is a *medical issue*, and it's ridiculous for him to assert that he knows what's best for someone else. Especially since he doesn't seem to know much about it at all.",
              "id": 8,
              "comments": [
                {
                  "score": 2,
                  "content": "Very true.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I'm on the pill and have been for many years. I also take another long term medication. My experience of being on these meds is totally irrelevant for someone else's healthcare. I can tell them my experience of them, I can't tell them whether they should be taking them. Only a doctor can do that. \n\nOP was right about Pink seeing a doctor and that was the last thing in this entire conversation that was right. They don't decide if she needs to or should go on the pill. Their experience is not relevant.",
              "id": 10,
              "comments": [
                {
                  "score": 3,
                  "content": "Excellent point!",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He sounds like he’s mansplaining honestly.",
              "id": 12,
              "comments": [
                {
                  "score": 2,
                  "content": "Which is......   Sexist.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "How is it sexist?",
              "id": 14,
              "comments": [
                {
                  "score": 5,
                  "content": "It’s sexist (and mansplaining) because while apparently the boyfriend is not a physician and his only frame of reference to someone using the pill seems to be his current girlfriend (and he has most probably never menstruated or discussed menstrating with a gynecologist,) he was insisting - at a table with three women - that *he* knew more about a problem having to do with menstruating than the did.\n\nSee how that works?",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -2,
                  "content": "It's nice to be able to put a label on something like that. Notice that he's been called a moron and a sexist. \n.\nPeople. He can say something moronic or sexist without being one. Jesus",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 374,
          "content": "Besides that, she's fourteen and probably hasn't grown out yet (like, full/adult height, not sure how to word it). The most likely pill given is one with estrogen which can cause (a bit of) growth restriction. I'm Dutch so can't speak for other countries, but according to my prof (gynecologist) it's not usual to give a not full-grown child the pill.",
          "id": 17,
          "comments": [
            {
              "score": 125,
              "content": "That’s interesting. I definitely knew people who were on some sort of birth control pill in the US—even at age 14 or 15. That was 10-15 years ago so maybe the thinking has changed or maybe it varies by country. I know my mom has said to me that most people stop growing taller soon after (within a year or two?) starting my their period. So as long as the doctor waited a couple years after she started her period to prescribe BC I wouldn’t expect it to impact growth in terms of height. But this might also be outdated medical advice as my mom is in her 60s.",
              "id": 18,
              "comments": [
                {
                  "score": 56,
                  "content": "My understanding was that women pretty much stopped growing taller within a year or two of first period, and that’s late 90s info.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 98,
                      "content": "That's certainly not true. I got mine in 6th or 7th grade and didn't stop growing until about 11th or 12th grade.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 28,
                      "content": "[deleted]",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "i grew half an inch- an inch when i was in first year uni! i went from 5'8 to 5'9",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "That's definitely outdated and not correct",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "You continue growing incrementally until about the age of 20, but most uterus owners don't grow more than 1-3 inches between the time they get their period and the time their bones finally finish growing. You're probably not going to have a growth spurt where you shoot up 6 inches overnight after getting your period. I got mine at 11, was about 5'0 then, and now I'm 5'3. Of course I've met 11 year olds who tower over me.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "I was 10 when I got my period- so no.  I didn’t stop growing at 12.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I became sexually active at 15 and given that my mother was neglectful (unless I did something she didn’t like) my sister found out and gave me a package of hers because I legally couldn’t get any in my area without my mothers permission until I was 16 which my sister was. I mean my mother lost her mind when she went through my purse and found it but I never told her it was my sister who gave it to me. If I was OP I would ask if he thought I should be giving advice on something that would be more relevant to men’s health despite not knowing much about it then hope he understands that whereas he has some knowledge because of OP he doesn’t understand as much as the other 3 women at the table who deal with it every month",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Shit. You mean i'm not supposed to be 5ft even.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "This is why women are shorter than men. The hormones that come with puberty stop growth. I think it's usually two years, but like every thing else it can vary.",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Maybe it’s a more recent viewpoint of Dutch gynos to now not prescribe it at younger ages, but it was def normal when i was a kid (2000s). I’m Dutch and went on the pill at 12 and pretty much all my friends in high school were on it around 12-14 years old.",
              "id": 29,
              "comments": [
                {
                  "score": 12,
                  "content": "That's really interesting. I do believe it's indeed a more recent viewpoint, it has to do with the estrogen speeding up the closing (verkalken) of the epiphysis and therefore limiting growth.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Exact same thing for me. I got really heavy periods straight away so after the 3rd time I got anaemia my Dr suggested the pill. I was 12 at the time. Pretty much all of my friends started between 11/12 and 15yo. I also remember diane still being prescribed for severe acne which is now either discouraged or unavailable all together.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "No wonder I'm like I am, I was 12 but the onset of my 1st period I ended up going to hospital (I was 11) and it was because they thought I had meningitis. \n\nIt didn't get any easier I was on a period sometimes 3 weeks of the month,  had horrific migraines, was depressed,  had the worst PMS, would crave chocolate until I couldn't cope not having it and at times would vomit - but I think that was part of the migraines. I am still convinced I had anemia with it too. I was constantly exhausted and white as a sheet. \n\nI am 41 and for the first time just came off my pill because I want to start a family, and I'm suffering. \n\nI have been tested for PCOS but I was clear. \n\nNTA - maybe keep an eye on it,  it is normal to be irregular sometimes.  I've just started to use an app which is super user friendly, very cute and may help her to see where she is at.  It is called My Calendar Period Tracker. You can write notes about how you feel or simply click on your symptoms and feelings are smiley faces.",
              "id": 32,
              "comments": [
                {
                  "score": 7,
                  "content": "I have basically the same symptoms and have cysts the size of peaches on both ovaries. (have you had an ultrasound done?) but i can't take any contraceptive with estrogen as it causes migraines etc. Have you had your hormone levels checked twice one at start of your cycle and once after the end? Mine showed my estrogen levels are high hence why i can't take contraceptive with it.\n\nEta: to add a word",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I'm so sorry you are and have experienced this, good luck with starting a family",
                  "id": 34,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thanks,  I'm waiting on fertility results so fingers crossed all is well x",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Not to mention the hormones could have an effect on her growing brain chemistry. Its a warning on most hormone based birth control that suicidal thoughts and tendencies are more prevalent in teens and young adults.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "yeah, plus depending in when she got her period, it takes a few years for it to regulate itself, I got mine when i was 12 for the first time, and then after that i didnt get it again for another 6 months (that was a fun 6th month wondering if I was somehow pregnant dispite never having even so much as hugged a boy) and i dont think it regulate until I was about 14 or 15, even now at almost 17 it's still not entirely regular, but that's rather normal in my family",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This, we have been dealing with medical issues surrounding my daughters period, but doctors here (USA) don't give the pill to girls until 16 or 17 due to growth issues.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "We do give children the pill in America - usually to help with heavy bleeding, or cramps. What’s usually not mentioned is what you’ve mentioned: your period/hormones doesn’t regulate until over 18, and some studies show taking artificial hormones before then can affect your normal hormone input. (I was so mad when I read the studies years after they gave it to me for intensely heavy periods!)",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "They started me on the pill when I was 11, in 1991. Of course, I'm 5'3\".",
              "id": 40,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "It can cause that. I got my period at 11 and from the get go it was horrible, i would have to wear tampon and pad together and change every two hours because it was that heavy, it would last 9days but not only that the pms symptoms were bad and I'd miss school the first two days because of pain. So my doctor wanted to wait obviously to see if it would settle down as for awhile after starting your period first it can take awhile to normalise but by age 14 it was still the same so i was put on the pill (i have tried a few different ones) but in my case when it was my week break it made no difference but it can and does for others but at such a young age i believe if nothing else helps then only should the pill be used.\n\nETA: to add luckily it didn't affect my growth",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "Honestly tho, how is is gross and creepy? I'm going to NTA as well but I just want to know how it's gross and creepy? Is it literally just because he's a male?",
          "id": 42,
          "comments": [
            {
              "score": 42,
              "content": "I think it’s a matter of a family member who you haven’t directly asked for their opinion on, telling you they think they know best. If little sister doesn’t want to talk about her period with a specific person it’s a little gross to keep pushing a specific direction. The gender balance I’m sure doesn’t help but it wouldn’t be the sole reason IMO",
              "id": 43,
              "comments": [
                {
                  "score": 62,
                  "content": "I mean she brought it up at a dinner that included him, i dont think that would happen if shes uncomfortable talking about it, even if she wasnt expecting advice from him. I dont think she thought it was creepy I just think its uncomfortable for peiple to start arguing in a restaurant about your period.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -69,
              "content": "Wow...read what I wrote and what OP has said. It is very clear and obvious!",
              "id": 45,
              "comments": [
                {
                  "score": 42,
                  "content": "Tbh, no 🙄 It's not. It just looks like your calling a guy creepy and shit, because he doesn't understand a topic clearly? Yes he stepped out of line and was being dumb for that moment, but I don't understand how it was creepy. What if instead of a older brother saying it, an older sister suggests the birth control? Would it change it or would she be just as creepy?",
                  "id": 46,
                  "comments": [
                    {
                      "score": 49,
                      "content": "I agree. I kind of love that he was comfortable hearing about it and cared. Not creepy But he definitely overstepped.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": ">They go back and forth with Green trying to explain how he knows its best for her and is getting slightly louder in the restaurant (He's naturally a louder person). I saw Pink shrink in her seat a bit as people were looking at our table.\n\nThis is what made it creepy. \n\nIt would have been equally creepy if her own mother started loudly insisting in public that her fourteen year old daughter *has* to go on birth control to deal with her irregular cycle. \n\nHe didn't know how to read the room and see that his sister was terrifically embarrassed and wanted him to shut up.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Seriously, people say stuff like this and then get confused as to why a lot of men are uncomfortable going to the store to pick up tampons, or talking about periods, or whatever.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -49,
                      "content": "[removed]",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "no its really not, the husband just seems like he didn't know what he was talking about and thought the pill was the only option for his sister. if you come from a family where periods aren't seen as something gross thats needs to be hidden from the fragile men, then its not creepy to talk about it openly",
                  "id": 51,
                  "comments": [
                    {
                      "score": 20,
                      "content": "100%. Australian here. Found it overbearing in the post, but not creepy.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 86,
          "content": "NTA I'm going to disagree with you #1, partly. Just on the very first part.\n\nI would say it's unusual that he wants to know, BUT the sister brought it up at a dinner where he was sitting. Some families discuss this stuff. And actually, I applaud that. We hear all the time how some guy shames a girl because he thinks periods are icky, or that she is exaggerating her discomfort. This guy didn't seem to be doing that, and I bet a large part of that is that his family feels free to discuss these things. \n\nThat being said, yeah, no, he has no say. Even if the family dynamic says everyone gets to put their two cents in, that means two cents. Not a buck fifty. Maybe fiance's next step is to get what you said in #2. Not all problems are sorted by one fix.\n\nI would like to point out also that OP has seriously set herself up for a lovely relationship with her SIL and MIL once they get married. That was a nice and humorous way to shut down something that was on it's way to being way more embarrassing to SIL that it would be to fiance.",
          "id": 53,
          "comments": [
            {
              "score": -5,
              "content": "I would say that if you bring your period up in conversation, the people involved in the conversation can then chip in. He should have stopped after OP first told him, but as for the sister and mom, yeesh—discussing medical issues in public is seriously not cool, because the rest of the world would really rather not know, thanks.",
              "id": 54,
              "comments": [
                {
                  "score": 7,
                  "content": "Periods aren't medical issues? And if the rest of the world doesn't want to know, they could always have *their own conversations*.",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "Why would it be gross for a brother to want to help his sister? Sure, it was wrong for him to shout about it and say that he knows best, but being interested, concerned and aupportive about a family member's health isn't wrong in the slightest.",
          "id": 56,
          "comments": [
            {
              "score": 2,
              "content": "It's not gross that the brother wants to help the sister. Where he's out  of line is when he starts insisting that he knows better than everyone else, when literally everyone else has personal experience and he clearly doesn't (and nor does he have any medical training either).",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "Why tf is it creepy and gross? Because he is male?",
          "id": 58,
          "comments": [
            {
              "score": -43,
              "content": "Read what I wrote. It is very obvious!",
              "id": 59,
              "comments": [
                {
                  "score": 27,
                  "content": "I did and i still cant see where its creepy",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 48,
          "content": "Wanting to know what’s going on with his sister and help is not inherently creepy. While he was far too aggressive and his mansplaining was not good it’s not helpful to villainize any involvement in such issues. He was wrong in this situation but it is important to encourage men to become educated and be able to understand and contribute to such discussions.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "How is someone wanting to help and wanting to be better educated creepy? Your reasoning makes no sense.",
          "id": 62,
          "comments": [
            {
              "score": -15,
              "content": "Read OPs statement, he is not educating himself. And look at my upvotes, people understand. I'm sorry you don't.",
              "id": 63,
              "comments": [
                {
                  "score": 19,
                  "content": "Your statement said that him wanting to know is creepy. Wanting to know = educating himself. \n\nI'm sorry I don't understand how a man wanting his sister to not be in pain is creepy.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Didn't sound like he was wanting to know anything,  he wasn't actually listening to the opinion of other people who have real-life experience in this topic. He simply repeated his own opinion more and more forcefully trying to convince his sister that he was right. I get the impression he was more concerned about winning the argument than about what is actually best for his sister.",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "Not sure why this is the top comment. Sure NTA, but what about it was gross and creepy?",
          "id": 66,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "I don't think it's necessarily gross for pink's brother to be involved in this, seeing as the topic was brought up at a restaurant with him present. Yes, I agree he seemed insistent on his ways rather than listening to the people who have experience and that is negative. I would say it's good though that he's at least somewhat informed. Then again, his unwillingness to admit that he still has to learn is not ideal.\n\nOne thing that bothers me is purple's phrasing of pink being too young for birth control. Like, go take your child to an actual doctor who can judge what is an is not an appropriate means to help manage a young teenager's period. My personal interpretation of this is that was an attempt to police pink's sexual activity - and seeing as teenagers do what they want, she might actually hinder pink from making good and healthy choices regarding her sexual activity. Meh.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3013,
      "content": "NTA. Years ago my husband told me I was applying my lipstick incorrectly and proceeded to direct me on how to do it. I handed my lipstick over and said, \"OK. Show me how you do it.\" He got furious & said he doesn't wear that! I told him when he starts wearing makeup he can give advice. Until then, he should shut up. He hasn't mentioned my makeup since.",
      "id": 68,
      "comments": [
        {
          "score": 331,
          "content": "I absolutely love this!",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 265,
          "content": "I really need to know what your differences in opinion were in lipstick technique! :D",
          "id": 70,
          "comments": [
            {
              "score": 108,
              "content": "Oh my! That's been waaaaaaay too long ago to remember! 🤣👵",
              "id": 71,
              "comments": [
                {
                  "score": 94,
                  "content": "Dammit! I was hoping one of you had a revolutionary way to do it haha",
                  "id": 72,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I thought it was going to be the Breakfast Club way",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I think it had something to do with how I blotted the lipstick. Like he saw women in commercials slowly pull their finger out of perfectly puckered lips & saw I don't sexualize lipstick application... or some such nonsense. 🤣",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -42,
                      "content": "Plot twist: she was doing the thing where you line outside your lips to make it look like you have bigger lips, and he was trying to tell her nicely she looked silly.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 117,
          "content": "[deleted]",
          "id": 76,
          "comments": [
            {
              "score": 110,
              "content": "Reminds me of  when a friend was brushing and braiding my hair in a study hall once and doing a bad job of it. This dude with a buzz cut chimed in and told her how to actually brush my hair. Turns out he had a bunch of sisters. That was a funny moment for me.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "😆😆",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "yeah I once asked on a \"girlie\" thread whether anyone knew how to remove nail varnish without varnish remover, it was a guy who knew the answer. This moment was crucial because we'd been discussing banning men from the thread.",
              "id": 79,
              "comments": [
                {
                  "score": 3,
                  "content": "[deleted]",
                  "id": 80,
                  "comments": [
                    {
                      "score": 2,
                      "content": "It's easy as pie: you apply a fresh layer of varnish and then immediately wipe it off. It actually softens up the first layer and as you wipe, that first layer comes with the fresh  one! You do end up scratching at little bits but most of it comes off that way.\n\nI had put some of my daughter's varnish on just the one hang nail to prevent myself from ripping it off entirely (there was an imminent important ceremony coming up and I wanted my nails to be perfect) so no way was I getting an entire bottle of remover just for that, and this turned out to be a great way of dealing with it.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 49,
          "content": "My boyfriend has this annoying tendency to correct me on anything biology related. Meanwhile i graduated suma cumlaude from medical school... Some how he forgets that a lot lmao",
          "id": 82,
          "comments": [
            {
              "score": 9,
              "content": "I hope you remind him regularly",
              "id": 83,
              "comments": [
                {
                  "score": 6,
                  "content": "Yes he is really trying his best to change it. Its an old habit he didn’t know was problematic.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Oh good! Seeing it & trying to change are good signs! Good luck!!!",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -12,
              "content": "[deleted]",
              "id": 86,
              "comments": [
                {
                  "score": 21,
                  "content": "That is indeed funny because i although i have a lot of experience and have worked at various hospitals and places i have officially graduated from 3 years of med school in march after already doing nursing school for 4 years before that. So yes, i am a student. But im also a qualified nurse. You wanna see my diploma or what? I could explain it to you very clearly but that takes me explaining the dutch school system first and i cannot do that in a different language i am terribly sorry.",
                  "id": 87,
                  "comments": [
                    {
                      "score": -12,
                      "content": "[deleted]",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -15,
              "content": "Well if your boyfriend would've taken a Latin course he could have told you it's correctly spelled \"summa cum laude\".",
              "id": 89,
              "comments": [
                {
                  "score": 14,
                  "content": "You are very fond of yourself aren’t you? Get back to me after you have had 12 hour shifts at a corona department , and then try to form grammatically correct sentences.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 12,
                      "content": "\"You are very fond of yourself aren't you?\" 😂😂 I'm def gonna use that one",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1336,
      "content": "[deleted]",
      "id": 92,
      "comments": [
        {
          "score": 230,
          "content": "What does the R on a tampon mean?",
          "id": 93,
          "comments": [
            {
              "score": 344,
              "content": "Regular",
              "id": 94,
              "comments": [
                {
                  "score": 135,
                  "content": "Regular as opposed to what?  Lemon scented?",
                  "id": 95,
                  "comments": [
                    {
                      "score": 293,
                      "content": "Regular flow as opposed to light or heavy :)",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "Lmao",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "[deleted]",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I knew that 👀",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "Thankyou, I'm a woman but I haven't had a period in about 8 years because of my Mirena birth control so I'm fresh out of tampon knowledge. Lol",
              "id": 100,
              "comments": [
                {
                  "score": 52,
                  "content": "Mirena is so awesome! I love not doing anything for birth control cuz it’s already in there",
                  "id": 101,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Me too! I'm on my second one now and I looooove not getting periods. I had to wait a couple of weeks between getting the old one out and the new one in and got my first period in 5 years. I had forgotten how much they absolutely suck.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Lol I just don’t use tampons. Only pads which come in 1, 2, 3, 4 or 5. Lol",
                  "id": 103,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It must be different here in Australia. I don't ever remember numbers or letter being on pads or tampons. I'm pretty sure that we just have the types printed on the box, not on each individual tampon/pad.",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Thanks for asking ☺️ In my country, we don't have tampons with R.",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 843,
      "content": "NTA.  He's not a doctor, the only medical advice he should dispense is to see a doctor.  Especially about periods, which he will never have any experiences with.  \n\nHere's the thing.  From when I got my period until I was 24, I had periods minimum twice a month, like you.  Birth control worked for you.  For me, it made my periods never stop.  What works for one isn't necessarily what's best for another.  It is possible that birth control will help her, (in which case, she should absolutely do it), but that's a doctor's determination, not her brother's. \n\nIf he'd stopped inserting an inappropriate opinion when he was initially called out, you wouldn't have had to prove he knows little about the topic.",
      "id": 106,
      "comments": [
        {
          "score": 114,
          "content": "I 100% agree with this! When I was about 13 years old I had a similar experience, periods at least twice a month, heavy bleeding, insane mood swings, and worst of all it took everything out of me. I would come home from school and literally collapse, sleep until dinner, wake up, eat barely anything, and then go back to sleep. \n\nMy mother, who had a similar issue growing up took me to the doctor, who evaluated me medically and determined birth control was the way to go. It was absolutely the right choice for me, but the point is the only one who should be asserting and making this call is a doctor with medical experience. \n\nIf you’re gonna mansplain something that’s not your field, prepare to be roasted bro.",
          "id": 107,
          "comments": [
            {
              "score": 13,
              "content": "I had a similar thing through trial and error. On the combined pill for two years which regulated my periods BUT gave me horrific migraines while I was \"on\"\n\nSwitched to an IUD at 17 and it was fucking FANTASTIC. Had it switched out after five years and replaced with a new one with a minor complications (GP couldn't find it, had to go to a sexual health expert in a hospital but she got it out and a new one in in less than a minute) and I love it. No bleeding, minimal cramping, no migraines.\n\nHOWEVER, I know the IUD doesn't work for everybody which is why, if asked, I give my experience and experiences of other forms of BC from other people and tell them to go to a doctor and discuss their options with a professional.\n\nNTA - regardless of how much he thought he knew on the subject, he should have seen how uncomfortable his sister was and should be able to control his volume in public places.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "> He's not a doctor, the only medical advice he should dispense is to see a doctor.\n\nI agree this is NTA, but your statement here is a bit strong.\n\nPeople can give medical advice without being a doctor, and it can even be helpful or useful. That said, that's usually because they have some expeirence with whatever they're talking about, which 100% doesn't apply in this case.",
          "id": 109,
          "comments": [
            {
              "score": 5,
              "content": "Its one thing to do so after a diagnosis has been made, and after seeing a doctor.  And obviously i don't mean advice like take 2 tylenol or eat more broccoli.  But hes talking about prescription pills for a condition he doesn't know about because no uterus and one that has never even been diagnosed!  No one should be recommending prescription medicine to someone with an issue that is undiagnosed.",
              "id": 110,
              "comments": [
                {
                  "score": -1,
                  "content": "It’s not like he’s telling her to buy illegal birth control pills. Presumably she’d still need to see a doctor to actually get them. \n\nI think you can recommend prescription medicatuon for the simple reason you cannot actually get it without a doctors say so. I think you aren’t thinking that part through. \n\nThe sister isn’t taking them without talking to a doctor no matter what the brother says.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I am thinking it through.  I know what happens in an obgyn office.  \n\nIf you go into an obgyn office and say you want birth control, even if the reason is because your periods are heavy, they will give it to you and not necessarily look any further.\n\nIts hard enough finding out why a period is too heavy and painful.  She needs to be going in with the intention of solving the problem, not hiding it, which is what asking for birth control will do.\n\nPlus, you can get birth control via telehealth, which means no real exam.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 409,
      "content": "NTA - What a horribly annoying habit your fiance has.  If this subject hasn't been put to bed yet, I'd let him know he does this frequently and it's something he should work on.  He needs more self-awareness.\n\nUnless they're a medical professional, no male on the planet should be telling a female how to deal with their period.  I would have been really annoyed if I was in your shoes, too.",
      "id": 113,
      "comments": [
        {
          "score": 125,
          "content": "And if you are a medical professional it is not your job to tell someone \"it does not hurt that much.\" They should say \"it shouldn't hurt that much\" then figure out the real problem..... so tired of women not getting diagnosed with issues because they think the pain is all just a little period pain. \n\n(endometriosis is what I have and yes i'm still salty at my doctors when I was a young teen, the pain was so bad I vomited)",
          "id": 114,
          "comments": [
            {
              "score": 35,
              "content": "What blows my mind is the number of female doctors who have dismissed my pain or thought Ibuprofen should be enough. It took years, many different doctors, and ultimately a male doctor from India to get properly treated. He's my regular primary care doctor, not even my gynocologist. \n\nWhen people hear I take tylenol 4 and a muscle relaxer in order to be able to function on my period, they say they'd be knocked out. It's just enough pain relief to be able to work and go about my day in relative comfort. \n\nEndometriosis, fibroids, and ovarian cysts are one heck of a pain trifecta. I'm saving up for a hysterectomy. \n\nAlso, OP is definitely NTA. Green needs to sit down and STFU.",
              "id": 115,
              "comments": [
                {
                  "score": 5,
                  "content": "I feel this^ all of this^ thats exsactly what I was given for  my cramps was 600mg I ibprophen.... I just wold pass out/ vomit and curl up,  unfortunately my mom would only listed to the doctor. Who I quote said \"she's just a teenager and playing up the pain for sympathy she will get over it\" dad was hands off since he \"was never a women\" (don't blame him ultimately mad at the doctor who should have at minimum had me do a ultrasound/ check out my gallbladder or sompthing...)\n\nEdit: my mom switched me to a female doctor when I turned 10 and she was bad, id rather have had the dude that was my doctor before her. Or even better the lady I have now.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "When I was 14, the doctor told me that my issues with periods would clear up when I had a child. \n\nI had my only child at 40. \n\nNot a fun interlude. BC helped me, but isn't necessarily the case for others and there can be a lot of side effects",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Endo sister!  Took me 12 years and 2 near deaths before I was diagnosed.  I'm still salty too, and frankly, I wish I had taken legal action against some of them, because two in particular should not have a medical license.  It's ridiculous what we have to go through to get diagnosed.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 235,
      "content": "Um...what does the r on tampons stand for?\n\nEdit. I was told it means regular",
      "id": 119,
      "comments": [
        {
          "score": 171,
          "content": "[deleted]",
          "id": 120,
          "comments": [
            {
              "score": 65,
              "content": "I've found that they don't always put the letter unless you buy the variety pack.",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Ohhh, just checked mine and no r in sight. I feel relieved, thought I was missing out on something obvious.",
              "id": 122,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Thx! That was my only guess.",
              "id": 123,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 142,
          "content": "Am a tampon user for 20 years and was today years old when I learned this.",
          "id": 124,
          "comments": [
            {
              "score": 111,
              "content": "[deleted]",
              "id": 125,
              "comments": [
                {
                  "score": 50,
                  "content": "When my husband and I first started dating I asked him to pick me up tampons from the grocery store. He came home with 5 boxes because he didn't know what \"flavor\" I wanted so he bought one of each. Each box was coded a different color for a different size and he didn't know what it meant but it seemed important.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I've never bought tampons, but I might be confused by size too. Is that depth, width, or flow rate?",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "that's cute, I hope he was able to get a refund for the ones you didn't need!",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "LMAO this seems like a fantastic prank to pull on somebody!",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Ah, so he thought tampons were like twix?\n\nLeft handed tampons, right next to the blinker fluid",
                  "id": 130,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Menopaused a few years ago, and did not know this.",
              "id": 131,
              "comments": [
                {
                  "score": 17,
                  "content": "Same, it was the only reason I opened the comments",
                  "id": 132,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Seriously, same. All the tampons I use are coded by color, not letter. Though honestly, I think it makes more sense to letter code them instead, like I know color blindness is more common among dudes but that doesn't mean there aren't women who are color blind. Or dudes shopping for tampons.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "Thank god someone asked.  Yeah.  I've never seen just an R.  But regular, for sure, makes sense.  Maybe it's a brand specific thing?  I'm  in canada though so maybe labeling is different than where op is.",
          "id": 134,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I have been scrolling through all of the responses hoping to see someone ask this question.  I am 66, never have I seen an R on a tampon.",
          "id": 135,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "idk either and I’m dying to know. I’ve been using it for years",
          "id": 136,
          "comments": [
            {
              "score": 4,
              "content": "They said \"regular\"",
              "id": 137,
              "comments": [
                {
                  "score": 6,
                  "content": "Oh, obviously! In my country it’s S, M and L and I find it weird",
                  "id": 138,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Holy crisp I didn’t think I would have to scroll so far to get the answer thank u",
          "id": 139,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 173,
      "content": "NTA\n\nI can somewhat understand him wanting to be part of the conversation. He should not have tried to dominate it, and certainly shouldn't have tried to diagnose and prescribe cures for anything. You also could have been a lot more harsh or rude. You used a funny way to give him a reality check rather than an angry one, which his mother and sister appreciated. He's grumpy you put him in his place because no one enjoys that, but from the story it was warranted.",
      "id": 140,
      "comments": [
        {
          "score": 8,
          "content": "Very sage words.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 150,
      "content": "NTA. I've said it before, I'll say it again, I am prepared to die on this hill. No uterus, no opinion.",
      "id": 142,
      "comments": [
        {
          "score": 28,
          "content": "I disagree - not YOUR uterus, no opinion. This isn't a dinnertable topic and something for the whole family to discuss. It's the decision of the little sister and partly her mom. No one else.",
          "id": 143,
          "comments": [
            {
              "score": 60,
              "content": "I think they meant men in general should not be in a conversation over what women do with their uteruses....",
              "id": 144,
              "comments": [
                {
                  "score": -21,
                  "content": "Men CAN be in such a conversation, but need to stay in their lane in order to remain there.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Agreed. While I definitely think the fiance is at fault here, I think it's so strange discussing this sort of thing over dinner at a restaurant, but having grown up with two younger twin sisters I will rather attribute that to a young girl lacking a filter on this topic.",
              "id": 146,
              "comments": [
                {
                  "score": 3,
                  "content": "It's not common but I think it's great that periods are not taboo. My mother said never to mention it in front of men, we had to pretend periods didn't exist and make sure men never found out we were on one.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 0,
                      "content": "There is no point discussing it with men in the same way there is no point for men to discuss morning wood or wet dreams with women.\n\nAlso talking about bodily functions is not appropriate during dinner. The fact that it's a bodily function that only relates to women is irrelevant.\n\n&#x200B;\n\n> we had to pretend periods didn't exist and make sure men never found out we were on one. \n\nThis is something only a woman would say.",
                      "id": 148,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "I get what you are saying,  truly.  \n\nBut my doctor does not have a uterus and definitely gets an opinion. \n\n(I'm saying this lightly,  not argumentatively, just so you know)",
          "id": 149,
          "comments": [
            {
              "score": 32,
              "content": "Obviously?? Trusted medical professionals are privy to this conversation, right? Some people just want to be pedantic for the sake of it.",
              "id": 150,
              "comments": [
                {
                  "score": -5,
                  "content": "Lmfao you are correct. I am aware I was being pedantic and I'll own it.  \nI was poking a hole in the phrase for the fun of it.  So yes,  \"obviously\" 😉\n\nSome people fight \"no uterus no opinion\" to the death,  so I was providing an example of when it wouldn't apply.  I even stated I was being lighthearted and not aggressive in my original comment.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I do get where you're coming from with the whole doctor thing because theoretically they should get an opinion but I will say when I had my first (and only) miscarriage I explained to the doctor that the pain was like a very mild menstrual cramp but I was bleeding very heavily. And the doctor rolled his eyes and said \"Its just your period.\" Obviously it was not my period and it took my convincing him to run tests before he believed I wasn't lying.",
                      "id": 152,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 127,
      "content": "NTA he was overstepping and you put him in his place. It all seems lighthearted anyways so what’s the big deal about some giggles from his own family.",
      "id": 153,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 114,
      "content": "To me, the fact that he made a suggestion based on your experience wasn't bad. The issue is that he pushed and *pushed* it. All he had to say was, \"It worked for OP, I wonder if it would work for you.\" And then drop it. \n\nI use a menstrual cup and don't know what the R on a tampon is for either. You made your point but that qualification seems pretty arbitrary. NTA.",
      "id": 154,
      "comments": [
        {
          "score": 125,
          "content": "It wasn't an unfair question. There have been many times where he has picked up my feminine products for me and i used to remind him to pick up either Regular or Super for my brand. So, technically, it was a question he could've answered.",
          "id": 155,
          "comments": [
            {
              "score": 46,
              "content": "oh lol that's different\n\ntwas a *test*",
              "id": 156,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}