{
  "post content": "I(28F) used to have a great relationship with my MIL(58F) until my children started growing up. I have three boys, 4y, and 6y twins.\n\nMy MIL wants the boys over the weekend to spend time with them and I am grateful she takes them so I can clean, relax and go out with my husband.\n\nI am very peculiar about the children eating fast food like McDonalds and KFC. KFC, they’ve had along with Subway and some other fast food places but I avoid ordering from those places. When they get older, sure, I will be unable to stop them from eating fast food but when they are this young and eat what I give them I rather they don’t know McDonalds even exists.\n\nMy MIL rolled her eyes the first time I mentioned this and asked her to not order it. She told me she thought I was being ridiculous because my husband ate McDonalds every day after school and he turned out fine (insert him having the most delicate stomach I’ve seen on a human being).\n\nI told her she can think it’s silly, just to please not order it for the boys. She agreed. A few weekends ago surprise surprise the twins came back talking about ‘their secret meal from mummy’ giggling around. I took them to the mall and they were frantically pointing at the big M begging me to go.\n\nI asked them how they knew it was so good and they said because they ate it but I can’t know (FBI will draft them for their lying abilities for sure). I called my MIL told her I did not appreciate it and she should at least tell me next time. She said okay, it was a one time deal.\n\nNext weekend, same thing, except the kids ate a ton of snacks, drank only sugar drinks and stayed up till 12a.m. That includes the 4yo. I tried to talk to my MIL again and told her we can make compromises but she needs to be willing to work with me.\n\nAgain, okay sure. Kids come back the third weekend giggling again and tell their dad they ate McDonalds 3 times over at grandma. \n\nI got pissed off at this point and next weekend just kept the kids. My MIL came over and asked me if something was wrong. I told her I was disappointed she was completely ignoring me. She said it was her house her rules, I was controlling and needed to get myself a hobby. She also called me an a-hole when I said from now on she is welcome to visit them at our house but they won’t be going over to her house.\n\nMy husband backed me up which is nice but AITA? My mom said I overreacted.\n\nThank you all for validating my emotions. I was beginning to think I was being petty and going crazy. I do know the lying is a bigger issue and that was discussed the first time and was cleared so far. Kids came back and we asked them what they ate and they told us everything. \n\nFor everyone saying stfu if you want a babysitter for the weekend, well, I can watch my kids and I can call a babysitter. I won’t screw with what I stand for because I want someone to take my kids for a day or two.\n\nTo those that went crazy that I am creating picky eaters and withholding certain foods, I can only laugh. They’ve become picky after eating so much junk and now refuse healthy foods and keep begging to get the same ‘cool’ nights they have at grandma. So yeah, she made fast food to be this unicorn food and I have to spend 20-30 minutes trying to explain why we cannot have cheeseburgers for dinner and candy and stay up late.\n\nThey have fast food at birthdays- KFC, Chick-fil-a.. whatever the host serves they can have. This is about food habits and preferences. Please stop assuming everything is black and white. They are not prohibited from having certain foods, but they are fed healthier options.\n\nHow am I the villain for saying ‘Hey, since they spend so much time with you, how about working on a compromise on the food they get?’ Did I say completely no to junk food? No. I said I wanna work something out. I am willing to let her incorporate it in their schedule, just not two days out of the week. There is a golden middle people.",
  "id": 1,
  "comments": [
    {
      "score": 4572,
      "content": "NTA. I’m honestly shocked so many people aren’t on your side or can’t decide. If my child ever told me that someone told them to lie to me or hide things from me we would have problems. You gave her so many chances. \n\nDo I think you may be a little strict about food & that someday your children will grow up to want nothing but junk food? Of course I do. But I still wouldn’t let someone like that around my children alone either.\n\nEdit to say- OP I think you’re a great parent. When I said you may be a little strict I really did mean a little & with your edit I don’t even think that anymore. Your comment about grandma making these foods unicorn foods that they now think are amazing fun things they can have when someone breaks moms rules was definitely a big part of what I was thinking. \n\nI also have to deal with a mother in law that loved to try and prove that she’s the best mom ever by not following my rules with my kids, I responded with a year of no unsupervised time with them & it helped so much & also has shown her son that it’s okay to stand up to his mom. She still tries to argue sometimes but in the end she doesn’t undermine us. I doubt it will last long but if she goes back to it she will get another time out. Stand your ground with your boundaries, it may take a while for her to get it but if you don’t she’ll never respect you as a parent. And ignore the people that say you should just deal with it because she’s willing to babysit, that’s ridiculous.",
      "id": 2,
      "comments": [
        {
          "score": 1293,
          "content": "This, absolutely. It doesn't matter what the lie is about, another adult telling a child to lie to their parent is absolutely out of line.",
          "id": 3,
          "comments": [
            {
              "score": 1274,
              "content": "It's so so so dangerous. What's the difference in a little kids mind of grandma telling them to lie and a stranger telling them to lie?\n\nThe food would piss me off, the lying is unforgivable.",
              "id": 4,
              "comments": [
                {
                  "score": 613,
                  "content": "Most abuse comes from family or family friends, that makes family secrets worse, as it's far easier to convince a kid to lie when they know and trust the offender.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 105,
                      "content": "True. Horribly true.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 153,
                  "content": "This is exactly on point! It’s not about the food! It’s the lies and total disregard for her daughter in-laws stance on not doing that very thing. It’s teaching the children it’s ok to lie and then think it’s funny.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 77,
                  "content": "🥇🥇🥇\n\nGrandma is setting your kids up for danger.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Grandma has escalated this into a big issue. She's purposely feeding them more and more junk food as a f-you to you. The her house her rules is fine because they won't be there anymore. I think you are way too strict about the food, but this isn't about that. It's about her complete defiance and doubling and tripling down on feeding them more the more you complain. Your house, your rules, you get to be lonely and not see your grandkids. NTA",
                  "id": 9,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Grandma's house can be all about junk food and treats when they go to grandma's house once or twice a year.  But when they go to grandma's house every week, no.  That's not a treat, that's part of the schedule.  \n\nGrandma needs to decide, does she want to be the treats grandma or the weekly grandma?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "It’s so important to teach young kids that they need to let their parents know immediately if an adult ever asks them to keep a secret from their parents.",
              "id": 11,
              "comments": [
                {
                  "score": 9,
                  "content": "I've read somewhere else on Reddit that it's important to teach kids the difference between \"good\" secrets and \"bad\" secrets. Like, a \"good\" secret would be a Christmas gift or something, with an end date for the secret to be revealed, and a \"bad\" secret would be bad touching or whatever. Makes sense to me.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I’ve seen the good secret labeled a surprise rather than just associating good or bad with the word secret as it’s easier for younger kids to understand",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "I came to the comment section to make this point. OP, I cannot underemphasize how absolutely dangerous it is for your children to be told by someone they trust that it is OK to lie to their parents and keep \"special secrets\" from them. Your reaction is appropriate! If I were you, I would put MIL in a LONG timeout. \n\nAlso, MILs, just like toddlers, test how far they can push your boundaries. It's fast food today, but it will get worse as the kids age and as she gets away with more. \n\nSo, with this double whammy in mind, keep doing what you are doing, OP. You're a great mom.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -12,
              "content": "The kids wouldn't have needed to lie if their mother wasn't such a controlling person.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 427,
          "content": "Right? And also on a weekend they've eaten mcdo 3 times?? \n\nI mean sure, its fun to have fastfood once and awhile ( and if mom/dad agrees) but at least every day?\n\nDoes she have stocks on mcdo we dont know about? Why so much fastfood!",
          "id": 16,
          "comments": [
            {
              "score": 385,
              "content": "The fast food is the easiest way to gain the kids favour, plus enjoying the fact that she annoys her DIL and that she will be seen as \"fun grandma\" by the kids and their mom will be \"mean mommy\" taking something fun away from them when she puts her foot down. What a sly old weasel.",
              "id": 17,
              "comments": [
                {
                  "score": 108,
                  "content": "I mean there's a reason we introduced me to my step daughter at the golden arches.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 100,
                      "content": "Fast food is designed to trigger the addiction brain chemical dynamics to create the satisfaction and cravings. It's literally designed to work like a drug. \n\nIt's part of the reason for the food addiction/obesity epidemic in the US.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 68,
              "content": ">Why so much fastfood!\n\nShe is too lazy too cook or probably cannot cook? Dunno. 🤷‍♀️\n\nI am in a depression right now and therefore didn't cook for a long while now. Thankfully I don't have children.",
              "id": 20,
              "comments": [
                {
                  "score": 140,
                  "content": "Nah, It's less about her being too lazy to cook and more about defying OP's rules. If she was really too lazy to cook there are better options, like PB&J, or even stuff like Hot Pockets. I'm a terrible cook and my kids don't eat that much fast food.\n\nAnd to be clear, this is absolutely not a judgement against fast food and/or people who eat it. If you like it, eat it! Especially if you have depression and that's what you need to do. But this particular situation has nothing to do with anyone's cooking abilities or mental status and everything to do with the MIL thinking she knows what's best and proving it to OP by refusing to abide by her wishes and then encouraging her kids to lie about it.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Well, I agree but also her son used to eat a hella lot of it and that's why I thought it could be that she is either lazy or a terrible cook. Or she had to work a lot and just couldn't cook. That's also a possibility.\n\nBut it is also true that you don't need eat so much fast food then. You still can eat kinda healthy.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I was going to say the same. There are a few shades between \"macrobiotic, organically sourced, perfectly balanced home-cooked meals\" & \"let's go to McD's\".\n\nWe don't have kids, but even my husband & I will have lazy dinner nights that are just something simple. There are even frozen foods that are still healthier than fast food. (I do have to stay gluten & dairy free, so maybe that's why I've found them, but they are out there)\n\nThe biggest concern is gramma teaching them to lie to their parents. I'd pull the plug on that real fast! My sis taught me to tell my niece that something is a \"surprise\" with a time frame of when she could blab if I want her to keep it quiet. We don't keep secrets from mom & dad.\n\nTotally NTA",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Because she knows it pisses her DIL off. Notice she escalated once she got a reaction?\n\nYou are NTA. There is a difference between getting special treats with grandma and grandma using the children as a tool against her DIL.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "[deleted]",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "No, that much fast food is defiance and retaliation.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I’m sorry to hear that.  I’ve been there, things do get better.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -32,
                  "content": "She's apparently been raising 3 young children every weekend, I wouldn't call her lazy. I don't agree with the lying, but maybe grandma doesn't actually want to give up all her free time to raise 3 kids with a 4th one on the way. \n\nSounds like the parents are pretty lazy tbh. They have 3 young kids, pregnant with a 4th, babysitter during the week and the kids spend all weekend every weekend at grandma's? When are they actually raising their children besides making food rules? Op even mentioned that she's letting them go back to grandma's soon. Probably going to be a never ending cycle of complaining about grandma then sending the kids anyway because it's too hard to keep them entertained all weekend.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Hi, thank you for assuming my whole life.\n\nI am on maternity leave and have a babysitter so my kids are not compromised because I don’t wanna take care of them or I am forced to leave them with her.\n\nNo one is forcing her to take them. This is a request she made.\n\nShe was a single mom and worked 12-15hours a day to support my husband and her. She never really got to watch him grow up and I know having her grandkids often is therapeutic for her as she can be around them without all the stress.\n\nWe retired her and she travels often. Guess what? I take care of my kids when she is gone.\n\nNo one is making her take them.\n\nInstead of assuming I am neglectful and forcing her to have them, ask next time.\n\nI want to give her another chance, I am not doing it ‘because it’s easier’.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Grandma is asking for the kids, they aren't being forced on her.\n\nAnd needing help while on the middle of a high risk pregnancy experiencing complications isnt being lazy. It's a temporary situation where OP can't do what she normally is able to do. It was probably very unexpected if she had smooth pregnancies the first two times. \n\nShe's not sending the kids away because she's too lazy to entertain them.... She's going through a medical event and there kids grandma is ASKING, begging even, to take them. \n\nIf grandma can't meet the minimum standard of care agreed on by BOTH parents, then she can't take them",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "I bet the McDonald’s 3x was her being petty towards the mother. Retaliation because DIL confronted the MIL.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Power play.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "There are places in the world where McD and KFC and all this junk just doesn't exist, and wow children grow up just fine. NTA OP you're being a good mum!",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": ">If my child ever told me that someone told them to lie to me or hide things from me we would have problems.\n\nExactly, it's not about the fast food, it's about the secrets and undermining.",
          "id": 34,
          "comments": [
            {
              "score": 9,
              "content": "YES. Say it louder for the people in the back.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "I had rules like this as a child. My parents didn't order takeaway ever until I was old enough to chip in for it, they only bought fizzy pop on special occasions, even then it was nearly always just lemonade. I don't crave sweets and junk food all the time. I occasionally eat fast food if I'm in a rush, still have never drank cola because it honestly smells gross to me. These rules are perfectly reasonable IMO\n\nNTA",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": ">someday your children will grow up to want nothing but junk food?\n\nNo, they may eat some but not only. Once they have the taste for healthy stuff it's much easier to keep it that way than to develop new habits. I told my kids McD was bad food no kid should ever eat and they are not big fans of it as adults. Sure, they eat some if there's no other option like when traveling and have to fill at that the gas station not the next. But they don't order it to their home.",
          "id": 37,
          "comments": [
            {
              "score": 44,
              "content": "Yeah this is a really weird sentiment imo (that you'll never eat anything else if you restrict something). I grew up with healthy eating habits (thank you, parents!). We ate snackfood once a week, we had one piece of candy after school every day, and we only had some crisps on saturday night. We had sandwiches or cereal during the day and a balanced meal with plenty of vegetables at night, and fruit and more sandwiches etc in the afternoon if we were hungry.\n\nNow as a teenager sure I started eating snacks and candy a bit more, but as an adult I've always kept my healthy eating habits because they're just ingrained in me, they're in my system. Also have always been a healthy weight thanks to this (because I definitely do have an appetite for snacks! It's only my habits keeping that in check, and I've got my parents to thank for those habits.)",
              "id": 38,
              "comments": [
                {
                  "score": 39,
                  "content": "Yeah, but this is balanced - you had those things in moderation. I grew up with a mother who thought processed sugar was the devil, and so when I bought it as a kid/teen I had to hide it in my room. I still to this day struggle to consume sugar moderately, I want to eat it all at once because that's what I did as a teen when I was scared my mum would find my sweets.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 15,
                      "content": "True, but we don't know that OP isn't giving them any type of snacks or sugar. Just that she'd prefer to them not going to fastfood places as kids. (Which tbh when I grew up we didn't have a McDonalds closeby in our country so I've never been there as a kid, nor any of the other chain type fastfood places, and I was definitely curious about it but never started binging that as a teenager or grownup...)",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I've seen it happen to kids whose parents give them 100% no processed sugar, but usually of its healthy eating with occasional treats it just forms good eating habits.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I am so glad THIS is the top comment!! \n\nThe issue is not just about the food, it’s that’s these kids, 4/6 y olds - are learning to lie to parents.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Hopping on to the top comment for an INFO question; Why are you the only one having these conversations with your MIL? Why is your husband \"backing you up\" instead of leading the charge? She's HIS mother. They're his children too.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I kept my kid away from fast food, soda. We'd eat out, but Chinese food etc. She had it a few times for sure, though. She didn't long for it or develop a taste for it. She was an adventurous eater then and now, though she's just as happy to eat vegan or vegetarian as a grownup.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Getting to be a grandparent is a privilege, not a right. \n\nRevoke as needed to remind them of that.",
          "id": 45,
          "comments": [
            {
              "score": 2,
              "content": "This! Children are not community property. Nobody is automatically guaranteed access to them other than the parents.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1275,
      "content": "NTA. Can’t drop the “her house her rules” line and then get mad when you say “my kids my rules”. You gave her multiple chances to even just compromise with you, what did she think was going to happen?",
      "id": 47,
      "comments": [
        {
          "score": 516,
          "content": "“My kids my rules” and “fine, no more your house” were the two things that came to mind. I’m all for grandma time being a little looser but 1. She teaching the kids to hide things from their parents 2. OP tried to compromise 4. McDonald’s 3 times in 1 weekend?? major NTA",
          "id": 48,
          "comments": [
            {
              "score": 45,
              "content": "I read that as 3 times in 3 weekends but really it doesn't matter, it is too much if mother said so. And grandma is intent to continue undermining.",
              "id": 49,
              "comments": [
                {
                  "score": 105,
                  "content": "Interesting! I read again and still get 3 times in one weekend - she fed it to the dad every day as a kid so it’s not that far fetched.",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -19,
          "content": "You all are some salty people. Grand parent visits are supposed to be fun filled and over the top with food. If you all want to be dicks then I guess just keep them home so you can police everything. Just wait till they turn 18 these kids will be gone at midnight lol.",
          "id": 51,
          "comments": [
            {
              "score": 15,
              "content": "Grandparents can spoil their grandkids while following some very basic and reasonable rules about how they should be raised. My parents are not a fan of giving kids fast food either and both my mom’s and dad’s parents successfully spoiled my sibling and I with a very limited amount of fast food involved. Surprisingly, I love them very much and didn’t bolt at 18. What a miracle!",
              "id": 52,
              "comments": [
                {
                  "score": -10,
                  "content": "Did your parents forbid fast food? Did your grandparents follow your parents rules to the T? Did your parents think they know what’s best for you and no one else does?",
                  "id": 53,
                  "comments": [
                    {
                      "score": 12,
                      "content": "No to all three, obviously, and I’d encourage you to reread the last paragraph by OP so you don’t make stupid points that don’t apply to the situations we’re talking about.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "As someone who literally moved out at 18 to avoid a parent you are full of shit. Grandparents can spoil their grandkids within reason, and her rules about fast food are super reasonable. I wasn’t allowed to eat it as a kid, guess what, instead I grew up to love curry and sushi. My idea of a treat was a party platter of spicy salmon nigiri. My cousins who eat it all the time, are going to have epic issues with getting enough nutrients because all they want is fast food.",
              "id": 55,
              "comments": [
                {
                  "score": -1,
                  "content": "You do know sushi was the cause of the largest tape worm ever found in a human in California right?? 30 feet long. That guy ate sushi everyday. McDonald’s didn’t win that award. But sushi did. Imagine that a 30 foot worm coming out of your ass.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Okay? Is that supposed to be a deterrent to eating sushi? Maybe if the US had better medical care it wouldn’t have gotten that big. Junk food is fine in moderation, but crossing that big of a boundary is not okay.",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 723,
      "content": "NTA - MIL is undermining your authority as the parent and teaching your kids it’s 1. Ok to not listen to you 2. Ok to not respect what you tell them 3. To lie to you 4. To keep secrets from you\n\nAll of those issues are waaaayyyyyyyy bigger than the happy meal. Plus that food is disgustingly unhealthy. If you don’t want them to eat that garbage she should respect that",
      "id": 58,
      "comments": [
        {
          "score": 83,
          "content": "Exactly. Also, her house, her rules? Your kids, your rules! NTA.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "It seems like she’s trying to create a power dynamic with the kids. Spoiling your grandkids is one thing but this is way over the top. Letting them stay up all night and constantly ordering the food that they specifically talked about already seems more than just her wanting to let the kids eat what she wants. She’s doing this on purpose to undermine her. Not to mention telling them to lie to mom.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 341,
      "content": "NTA\n\nMy house my rules ? uhm yeah i guess but those aren't your kids, so sit down granny. \n\nAlso, why is she so keen on letting them eat macdonalds ? I guess you are from the US so thats that but wtf",
      "id": 61,
      "comments": [
        {
          "score": 131,
          "content": "She let her son eat fast food EVERY DAY as a kid. That's basically neclectful of a kid's health. My grandma always spoiled us foodwise, but she cooked for us and took care we got nutrients into our bodies. I wouldn't let my kids spend the weekends at her place either, because of the lies she tells and makes the kids tell alone.",
          "id": 62,
          "comments": [
            {
              "score": 19,
              "content": "My grandma spoiled us by teaching us to bake yummy goodies and how to enjoy them in moderation. Now that I'm a grandma and my idea of spoiling the little ones with food is baking with them and then having a couple cookies or 1 Cupcake a day together. We also cook at home and are very adventurous eaters so the treats might be helping with a new recipe. My kids hated McDonald's, they much preferred hibachi grill or a steak, and my granddaughters are shaping up to be much the same.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "MIL: my house my rules\n\n\nOP: cool so they aren't going to your house anymore \n\n\nMIL: *surprised pikachu*",
          "id": 64,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "because mom said no",
          "id": 65,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 293,
      "content": "NTA. She doesn't respect your boundaries regarding the health of your children. She doesn't get to disrespect your boundaries and then cry about the consequences she's now dealing with. There were three strikes - she's out. Also, r/justnomil will likely be a great source for you. They've dealt with it all.",
      "id": 66,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 183,
      "content": "NTA - it’s not about the food so much as about the deliberate breaking of rules and getting kids to  keep secrets from you, their parent. \n\nKids should *never* be encouraged to keep secrets (apart from temporary nice ones like not telling daddy what he’s getting for his birthday because it’s a surprise). Abusers weaponise secret keeping so it’s important for everyone around kids of that age to always be aware that the only secrets you have are nice, temporary ones. \n\nAs someone who did exactly what you did with my kid when they were little (didn’t get McDonald’s until they wanted to try it because they were the only kid in first grade who hadn’t had it) you have my sincere sympathies. I would have been ropable. But since I assume you want your kids and their grandma to have a relationship, *after* you’ve had a discussion about boundaries and secrets, could you roll back and allow one McDonald’s meal a week with grandma, so that’s their thing? Fully understand if you don’t want to, but thought I’d throw it out there.",
      "id": 67,
      "comments": [
        {
          "score": 56,
          "content": "I’ll relent and let her have them again on the same schedule next month. My husband will talk with her as she seems to listen to him more. He is not a fan of them eating McDonalds because that was his main meal growing up and he has food aversion towards so many things.\n\nIt’s up to them at this point.",
          "id": 68,
          "comments": [
            {
              "score": 240,
              "content": "Why are you deciding to relent, OP? The woman has clearly shown she has no respect for you or how you’re choosing to raise your family. By giving into her you’re telling her that her behaviour is acceptable and she can ignore any boundaries you put in place.",
              "id": 69,
              "comments": [
                {
                  "score": 64,
                  "content": "Why are you giving in so easily and letting her gave her way? If you do, she knows for sure she basically never has to listen to you. I was proud if you standing up for your parenting and your kids.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -18,
                  "content": "Seems she's going to relent because she misses that child free weekend set up more than she actually wants her authority respected. Sad.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 20,
                      "content": "That’s a bit of a leap. We weren’t given any info on why MIL was babysitting. It could be because OP needs to work or for health reasons.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Wow. I am changing my answer because you gave into MIL yelling at you. YTA for giving up on the boundaries you told MIL. So now she knows that you will cave in, after she yells and screams at you. Now your kids will know that its OK to keep secrets from Mommy if another authority figure tells them its OK. You are not just an AH, you are a hypocrite YTA.",
              "id": 73,
              "comments": [
                {
                  "score": -33,
                  "content": "So no second chances? I should never let her have them unsupervised even though they love her? I should just have an adult at all time with them? I cannot possibly give her a second chance after my husband talks to her?\n\nEdit: second chance is on the condition she actually starts listening. I am not jumping the gun on this. She was a single mom and she only has my husband and I and the children left of her family.\n\nWhile I wholeheartedly believe she crossed many lines, I do think we can recover if she is willing. \n\nIt will be extremely cruel to never let her have the children unsupervised again.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Yes. You also gave her multiple chances. She's shown time and time again she doesn't respect you, and she asked your young children to keep secrets which is never okay.\n\nShe will continue to undermine you.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "Second chances come when she's proved she's earned them, not through you \"relenting\". Its the difference between allowing visits again because MIL came to you, cap in hand, with a sincere apology and understanding of how she messed up, and just rolling your eyes and sighing and saying \"oh okay MIL\" because you're sick of her whinging and you miss your weekends. Not saying the latter is the case, just illustrating a point. Second chances are earned, if you \"relent\" without at the very least a sincere apology then you're just letting her win and further endorsing her behaviour.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Once Husband has spoken to her and got boundaries firmly in place,  start again by just a couple of hours and slowly build up if she respects your parenting. \n\nUnless you are wanting to quickly get back to the schedule of no kids every weekend ?",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "> So no second chances? \n\nNo *Fourth* chances - especially after she did it the third time, having agreed not to , and fed your kids junk food the entire weekend.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Someone who teaches your kids to lie to you sets them up to be groomed by predators. This is definitely a \"no second chances\" situation. For however long it takes to make sure your kids have learned that anyone who asks them to keep a secret from their parents is a \"tricky person\" and they should tell you the secret as soon as possible. At least six months if not longer.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I would give her a second chance but with supervised visits so that you can show her what you prefer she gives them. Perhaps when you eventually let her have them unsupervised you could send some of the things you want them to eat with them, like celery and carrot sticks, beef jerky, jello cups, string cheese (I dont know what you want them to eat, these are just examples) so that she doesn't have to prepare anything. \n\nJust having your husband talk to her isnt enough for what she has done. Secrets? Lying? Screaming at you? These are all major things that she would have to apologize for before even supervised visits should happen. And your husband telling her to apologize doesnt cut it either. She needs to realize it on her own and make a concerted effort to apologize to you both, and to tell the children that she was wrong to make it a secret and they should never hide anything from their parents. \n\nSecond chance sure, but rehab first.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "She's had a second and a third chance from what you've written. She can have a perfectly good relationship with the kids at your house.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I mean you gave her multiple second chances and she has doubled down every single time. I don't know why you think she's going to suddenly change her mind and start respecting you now.",
                      "id": 82,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "She has to earn that second chance... which means setting the kids at your place, allowing allowing her to be an in YOUR home babysitter, proving she can follow your boundaries. When she starts respecting you, stops encouraging your kids to LIE/keep SECRETS from you,  then you can work up to overnights, then weekends. Of the consequences aren't enforced she'll just keep doing it. Plus, you have given her 2 chances to follow your boundaries.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Of course another chance but your husband needs to be firm with his mother when he talks to her. Does she know he has stomach issues probably from eating that crap everyday as a kid? So no he didn't \"trim out just fine\" plus his other eating issues. He needs to tell her. I agree with many of the others . this lady needs to be remorseful and if you give in too easy she will never stop. What about when you go back to weekends tell her one time they can go? Only one time in a weekend. Does she have enough regular food for the kids? Do you all need to buy her food for the kids when they go?",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "NO.  You must enforce the No Secrets from Parents rule.\n\nThis is for your children's safety.  Part of the grooming process is for abusers to train children to keep innocent secrets from parents so they are primed when the secret is bigger.  This does not mean your MIL would abuse them, but she is placing them in harms way. \n\nThis is a huge deal.\n\nAn occasional fast food meal won't really hurt them.  An abuser being able to get them to lie to you will harm them.\n\nGet your priorities straight.",
              "id": 85,
              "comments": [
                {
                  "score": 23,
                  "content": "I left in the main post a note it has been addressed. She has agreed to not teach the kids to keep secrets and lie.\n\nThe kids have also been told never to lie to us.\n\nShe spoke with them and she told them she is sorry she made them keep a secret and it is wrong of her to do that.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "If it’s any help, my kid is a teen now and while they do like McDonalds, they also like a whole range of other food. I tried to ensure that we treated McDonald’s as something that can be fun to eat, but not all the time. For us, it was more of a holiday treat with me, my SO refuses to eat it so the kid would never ask them, and it became ‘our’ thing. If it can be the ‘thing’ they do with grandma once a month and you don’t have to go near it,  it gets contained within that relationship iykwim",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "What do you mean it's up to them? Up to who? I am confused. Is he going to tell her it's ok? Would she compromise? Like maybe only once a weekend.",
              "id": 88,
              "comments": [
                {
                  "score": 26,
                  "content": "I am saying it’s up to them to find common ground so she can eventually have them again. I’ve said what I wanted and I was ignored. It’s up to my husband to get her to listen or she’ll have to see the kiddos only at our house.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yes, it’s their problem to solve…they want to make it about you/your rules, but until they understand that they’ve created this issue, it’s gonna be hard to resolve.\nImagine being a G’Ma, and being soooo stubborn that you lose unsupervised visits of grands you love?",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "You are exactly right. He needs to also tell her flat out he has health issues from eating that garbage every day.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "You should not relent, your children should not be spending time with an adult who encourages them to lie to and keep secrets from their parents, that leads to major problems later on. And right now it's fast food, but what about later when she's giving them alcohol or cigarettes at 14 because it's her house her rules, and her son did it and turned out fine. She doesn't respect you as a parent or your rules and that can end up being very dangerous. She would not see my children unsupervised until they were old enough to know better",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "YTA then. Your original post was NTA, but this comment makes you an AH to your kids. Don't give up this fight.",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -5,
              "content": "You're being too strict with food. They'll grow up only wanting fast food. Nothing is bad in moderation and trying to pretend McDonalds doesn't exist is only making it worse for the future. \n\nAre you a homeschool parents?",
              "id": 94,
              "comments": [
                {
                  "score": 3,
                  "content": "I think she's not strict with food because she still allow them to eat fast food but not 3 times on the weekend with her. That's too much. Also, his husband is eating fastfood almost his entire life that is why he have a delicate stomach. She even said that, she can intorduce fastfood if they understand the concept of food but when the grandma gave fastfood, she didnt prohibit it, but she wants it kn moderation and not teach kids how to lie.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "OMG\n\nI cranked out my response to OP before reading any of the posts.\n\nYou said exactly what was bothering me. \n\nPredators use this exact approach to groom and abuse kids. Abusers are rarely “stranger danger”. It’s someone trusted by the family. They then proceed to do things and to break simple rules gradually and it’s their little “secret”. And the predator just continues to ratchet up the abuse while keeping the secret.\n\nI’m certain that this isn’t what MIL is doing here and would be offended and appalled. However if MIL’s behavior continued could this make the children more vulnerable? I think it’s possible.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 135,
      "content": "NTA. This only shows you that she will ALWAYS go behind your back and do things you don’t want for your kids. YOUR KIDS YOUR RULES. I recommend absolutely NO alone time with grandma until she learns her fucking place. I absolutely hate people who think they can do whatever with other peoples kids. You need to very very firmly get your point across and stick to it until she gets it.",
      "id": 97,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 69,
      "content": "NTA. and its not even about the food, its that you, *the parent,* asked her something perfectly reasonable - which is to honor your choices about what the kids eat - and she immediately, and *repeatedly* not only ignored your wishes, but apparently lied to your face about it. Like, how is this even a question? \n\nOkay so a little fast food isn't a big deal, that's not the point. The point is MIL has decided she can do whatever she wants with kids that aren't hers.  \n\nOP you definitely didn't overreact, you asked MIL several times to obey a pretty simple rule and she lied to your face and then went behind your back and did it anyway. That's unacceptable. \n\n(also, not really the point but there is a huge difference between grandparents giving the kids a treat now and then, and 'grandparents feeding kids nothing but crap for days straight.' it seems pretty clear its the latter that is happening.",
      "id": 98,
      "comments": [
        {
          "score": 3,
          "content": "Happy Cake Day! 🥳",
          "id": 99,
          "comments": [
            {
              "score": 2,
              "content": "thank you!",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 47,
      "content": "Dietitian here- and you keeping fast food from your kids is NOT creating picky eaters. Fast food MAKES picky eaters. Your mindset is very healthy. We have a limited time in our kids’ lives to make decisions for them. Not only that but you are influencing their future decisions. Nutritionally speaking, fast food offers nothing to anyone especially young growing children. If you have the privilege of having grocery stores around and can offer your children a variety of fresh foods (heavy on the fruits and vegetables), then you would be doing a great disservice to them by feeding them McDonalds 3 times in a single weekend! Your MIL is feeding them food that not only provides little nutrient value, but is chock full of stuff that actively harms health- excess sodium, excess fat, excess added sugar. \n\nI’m sorry but this drives me crazy. We have an epidemic of diet/lifestyle related illnesses and death and it all starts in childhood. And this isn’t even touching the insanity of your MIL actively encouraging your children to lie to you.",
      "id": 101,
      "comments": [
        {
          "score": 35,
          "content": "Thank you for this. I think some adults are seeing as a dig at their own diet which it is not.\n\nAdults can make conscious decisions but kids need healthy habits. If they wanna go ham on the junk food later on I’ll let them and pout silently in the corner. I won’t ground them or purposefully take it away but yeah, while they are this young I focus on teaching them to eat home made healthy options.",
          "id": 102,
          "comments": [
            {
              "score": 9,
              "content": "Exactly! Don’t doubt what you’re doing- you’re doing a great job! Kids need boundaries so they can form boundaries when older. They will be grateful to you for giving them a healthy foundation as well as the knowledge to make healthful choices.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Those adults are victims of the very thing youre (rightfully) trying to prevent in your kids. They can cry about it and have their feelings hurt, or they can go do something about it. Don't let them drag you down from your correct path. When your sons/daughters are grown enough, and they dont have to face bullying or body issues, they'll appreciate you so much for those crucial formative years",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "It's so bizarre to me to suggest that refusing to feed kids McDonald's will make them picky. Like, how on earth is feeding kids a variety of home-cooked food going to make them picky??? \n\nEvery extremely picky I've met, they're picky because they're so used to homogenous fast-food style foods that they can't stomach other flavours.",
          "id": 105,
          "comments": [
            {
              "score": 9,
              "content": "It's clearly a cope on their side. It's something they tell themselves when they give themselves or their children unhealthy food, so they don't have to feel bad about themselves. That and/or they have no nutritional knowledge. \n\nJunk food is addicting. It's loaded with salt, fat and carbs(sugar).  \nThe stuff our bodies are wired to crave because of our evolution.(calorie dense food = survival for our ancestors).\nNobody is addicted to broccoli the same way. \nFast food companies know this and are using it to make profit.\n\nIt's very hard to switch to or even occasionally have  healthy food after years or lifetime of junk food. Your pallate is used to tasting a truck load of salt, sugar and fat. So if you eat a healthy food, it will taste\n bland. That's how you get picky eaters. You would have to consistently eat healthy foods for weeks low in sugar fat and salt for your pallate to reset and for you to actually start tasting the food.\n\nYour gut microbiome is also  loaded with bacteria that thrive on junk food. You likely have an overgrowth of bad bacteria at this point if you've eaten junk for years. \n So if you switch to healthy food get ready for alot of digestive issues, and withdrawal symptoms. \n\nNot to mention the absolute lack of any sort of nutrition.  Feeding growing children empty calories will negatively impact their development and health in the long term.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yep,  there's a reason almost every picky eater I've met has a preference for highly palatable foods.  You don't meet a lot of picky eater kids who only want,  like, spinach.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 40,
      "content": "Your MiL agave them Macdonald’s 3 times in 1 weekend? WTF. NTA.",
      "id": 108,
      "comments": [],
      "relation": "Support"
    }
  ]
}