{
  "post content": "My cousin lives a 6 hour drive from me and the rest of our family. A few months ago we all drove over there for his wedding. Due to limited space, no children were invited to the wedding except the bride's young nieces and nephews. \n\nMy baby was 10 months old at the time and I wasn't comfortable leaving him alone in an unfamiliar place with a stranger, which was a babysitter that my other cousins hired for their own kids. So I decided to bring him to the wedding. I wrote on the RSVP that I was bringing him but he would be sitting on my lap and I would bring my own food for him. My cousin didn't say anything so I assumed that he was OK with it.\n\nMy baby cried at the ceremony but I quickly took him out of the room. At the reception I had him with me the whole time in a body carrier. He didn't make much of a fuss and I thought everything was OK. \n\nAfter the wedding my aunt (groom's mom) confronted me and told me that I was rude for bringing my baby without permission. I explained that I wrote on the RSVP what I was planning to do but my cousin didn't object. She said that my cousin and his bride had a problem with it but the bride didn't want to start any drama because she doesn't know me well. \n\nMy other cousin's baby was 7 months old at the time and my aunt said that he had no problem leaving his baby with the \"certified\" babysitter and I should of done the same. And some of my cousins were upset because they thought that the groom gave me special treatment by letting me bring my baby and making them leave their kids with a babysitter. I didn't mean to start any drama. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 53556,
      "content": "YTA - your baby literally did the thing that the bride/groom wanted to avoid - disrupt the ceremony. You had plenty of time to find a babysitter or other family member to watch your kid while you went to the wedding but decided that you were just above the rules.",
      "id": 2,
      "comments": [
        {
          "score": 31088,
          "content": "Or, if you're really not comfortable leaving your baby with a sitter, just...don't go to the wedding. Staying home is always an option.",
          "id": 3,
          "comments": [
            {
              "score": 14410,
              "content": "No you don’t understand, OP’s presence is such a gift that no one minds that her baby interrupted the ceremony!",
              "id": 4,
              "comments": [
                {
                  "score": 5678,
                  "content": "Her baby was extra special, that’s why it was ok.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1895,
                      "content": "But it was cool because the baby didn't need a seat or a meal! Because THAT is why they didn't want kids at their wedding. Everone knows that infants eat all of the prime rib.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 514,
                      "content": "Yes her baby is so special cuz it's actually the baby of y/n from fanfics and Draco Malfoy 😍😍",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "The baby had objections.  That’s why it cried /s\n\nI would have been so upset if I had been the bride.  The idea of no kids is to make the ceremony enjoyable",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I mean she wrote it on the RSVP! Nbd",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2131,
                  "content": "It’s so tiring when people completely ignore “childfree”.   \n\nI didn’t like the idea of a stranger so instead I’ll cause drama by having a crying baby and not thinking of all the other guests who made accommodations to attend childfree.  \n\nIt’s the “I have a child and we are the most important in the world” card.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 969,
                      "content": ">It’s so tiring when people completely ignore “childfree”.\n\n\"Well of course that means OTHER children, but my child is special and therefore should be the exception!\"",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 796,
                      "content": "I’d have kicked her and the baby out before the ceremony even began",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 579,
                      "content": "\"I understand the child-free thing, but my child is a baby. And I understand the whole \"babysitting\" thing, but I'm such a great mother, that's not an option for me.\"",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 194,
                      "content": "Friends of ours brought their uninvited baby to our wedding. I was stunned.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "That's really the kicker - and I say this as someone who loves children.\n\nDid you really think that you were the ONLY parents of an infant who would be attending? Did you really think that everyone else (including the other parents with infants) would just CLEARLY see that YOUR Precious Baby(TM) was SO special that you just couldn't POSSIBLY leave them with the PROVIDED BABYSITTER HIRED FOR THIS VERY PURPOSE and you simply HAD to BREAK THE RULES for YOUR child??? \n\nUnless you have been given EXPLICIT permission to bring your kid (and no, radio silence is not consent) \"childfree\" means childfree. And the cousins even went out of their way to get a sitter to accommodate for that because finding a sitter is often a barrier to parents being able to attend childfree weddings. They literally couldn't have made it any easier for OP to be able attend sans baby and she chose to stomp all over their rules and bring the baby anyway.\n\nAbsolutely TA.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1240,
                  "content": "[removed]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 858,
                      "content": "Stay home, that will be the gift.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "You think OP will be invited when there's another family wedding after disrespecting them like that?",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 936,
                  "content": "Oh yes, her specialness makes the rules not apply to her.  /s",
                  "id": 19,
                  "comments": [
                    {
                      "score": 201,
                      "content": "r/yourjokebutworse",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 507,
                  "content": "For her cousin she doesn’t know well. Ayayay. YTA.\n\nETA: I misread the post. The bride didn’t know OP well.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I took it that it was the bride who didn't know OP well and didn't want to cause drama in her new family.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 435,
                  "content": "r/entitledparents but that's none of my business...",
                  "id": 23,
                  "comments": [
                    {
                      "score": 23,
                      "content": "The bride may have wrote her own story on there about OP lmao",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "She was such a special guest, one of the really important inner circle people, that \"bride didn't want to start any drama because she doesn't know me well.\"\n\nThen you should not have gone if you wouldn't leave an almost 1 year old with a sitter.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "And when they watch the wedding video in 20 years, they'll love some random entitled strangers baby wailing and reminding them of the moment when they couldn't hear their own vows.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3492,
              "content": "[deleted]",
              "id": 27,
              "comments": [
                {
                  "score": 1854,
                  "content": "Completely agree. If you want to go against the “rules” of the wedding, you actually call and ask. You don’t write it on the RSVP. YTA OP. (And I have two children.)",
                  "id": 28,
                  "comments": [
                    {
                      "score": 882,
                      "content": "The RSVP isn't a contract draft you can redline.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": "This point actually makes me wonder if OP deliberately chose the option where she would not have a direct conversation.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Invitation: Wedding is child free \n\nOP: no it isn’t \n\nLol",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1434,
                  "content": ">Yeah, and I don't think penciling it in to the RSVP is good enough either.\n\nThat's what sealed the deal for me: it almost sounds like she hoped they won't notice and she can still claim she told them. Why not just ask directly, except she already knew they'll say no. Entitled and passive-aggressive to boot.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 466,
                      "content": "I think that's exactly what OP hoped for. Any reasonable person who didn't get an actual response to the RSVP would've double-checked before actually going through with it.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Agreed on the \"hoping they wouldn't notice\" detail. Maybe it'll just slide through the cracks and it won't be an issue?\n\nWhat IS worse is that they expected their cousin to reach out and correct them. I mean, ignoring the fact that the bride/groom originally said \"no children\", but I guess they have to repeat ad nauseum for everyone to understand.\n\nIt's the same thing as people trying to write \"secret notes\" on online orders to Dominoes and thinking it was a contract deal. Like the delivery notes saying \"if it's not under x time, I get it for free\" and thinking that will hold up.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I didn’t think this was a case where one thing “sealed the deal”.  OP is horrendously oblivious.  This was basically “AITA for thinking rules should only apply to other people, and still thinking that even after my breaking the rules caused a problem showing exactly why the rules were made?”",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 742,
                  "content": "RSVP\n\nBtw, I’m bringing ten guests to the wedding and we’ll all eat the prime rib. Thanks",
                  "id": 36,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Heyyyyyy, people actually tried to bring extra, uninvited guests to my wedding. It was ridiculous.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Surprising some guests do use the RSVP to write in their own guest list",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 460,
                  "content": "Yeah OP snuck it in via pencilled note and is *shocked pikachu face* that wasn’t adequate",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 403,
                  "content": "There was a sitter! She could have at least left the baby for the ceremony, which it disrupted, then evaluated if she was comfortable enough to leave it for the reception.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 163,
                      "content": "But her baby is just too fragile to be left with a certified babysitter. She *has* to travel 6 hours with him to a wedding surrounded by people the baby is unfamiliar to.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 31,
                      "content": "I wasn't ready to leave my baby with a sitter st 10 months. I'm still not ready to leave him (15 months) with someone I don't know, certified or not. But that means I simply decline to travel to events where he's not welcome. \"I have a small child, we can't make it\" is a normal valid excuse to not attending a function.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 309,
                  "content": "RSVP: Don’t bring your kids\n*Op writes on said RSVP that she’s bringing her infant*",
                  "id": 43,
                  "comments": [
                    {
                      "score": 191,
                      "content": "This is literally what my husband’s friends did, and they were PISSED when he called to tell them that writing in their kids on the RSVP *did not* magically make it okay for their kids to attend our wedding.  🙄",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 235,
                  "content": "Agree...bride and groom have enough to worry about and don't have time to go thru every rsvp to check for handwritten notes saying \"imma gonna come but disregard your rules\" and then take time to respond and say no your going to follow the rules or stay home",
                  "id": 45,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I’m gonna come dressed as a banana even though the invitation said specifically white tie and for no one to come dressed as a banana again.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 222,
                  "content": "I think even asking directly is kinda shitty, in most circumstances. It puts the hosts in a bad spot. They said no kids on your invitation for a reason - they meant *no kids*. Asking them directly just puts them in an awkward position where they either have to say no to your face - you, the person trying to override their rules with insistence/arguments against their request - or just let it go and give in because you’re making them uncomfortable and they don’t want to escalate the problem you’re causing. And then everyone who did follow their rules gets mad at them, too.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Absolutely. It's one thing if you have an older kid who won't be disruptive and you genuinely don't know if the couple saying \"no kids\" means \"nobody under 18\" or if it just means \"nobody who is going to disrupt the ceremony by watching Paw Patrol on an iPad the whole time.\" But literally nobody who says \"no kids\" at their wedding means \"no kids but screaming babies are fine.\"",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Asking the bride and groom for anything is pretty shitty and puts them in an awkward spot. I’ve already had two guests call me and ask to bring extra people. One was my aunt asking to bring her daughter’s boyfriend and the other was my brother in law, asking to bring his second girlfriend we knew nothing about. And I’ve barely received half the RSVPs back yet, so I’m expecting more…",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "That is EXACTLY why I made everyone RSVP online. I pre-programmed it with only the names of the people invited so they could not add extra guests without calling and specifically requesting me to add the guest to the list. Many of the requests were denied. It gave me full control and not a single person showed up who shouldn't.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "She wasn’t worried about whether it was okay though. Notice that she didn’t pencil in a note ASKING if she could bring the baby, she penciled in a note SAYING she would be bringing it.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 743,
              "content": "Seriously. When people make a wedding child-free, they expect that some people won't be able to attend.",
              "id": 52,
              "comments": [
                {
                  "score": 360,
                  "content": "They often *hope* it means some won’t be able to attend. Increasing numbers of guests increase cost exponentially. Relatively non-confrontational ways of tamping down the number of attendees like this can be a godsend.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 40,
                      "content": "A friend of mine made hers child free and it kept a few people who were invited due to being family but that she didn’t really want there away. It was brilliant!\nAlso- YTA.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Mine is \"invite only\". If your name is not on your invitation you are not invited, period. Very specifically to avoid a situation altogether.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "*Reasonable* people expect that some people won't be able to attend. I've seen some doozies of an AITA posts where couples got angry that someone had said they couldn't attend their wedding because it was child free, and they had a child.\n\nThis is not that situation though.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This. One of my best friends wedding is child free next year and I’m like okay I’ll find a babysitter.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "You know some places charge just for the body, even if it is a baby . If it’s child free and you don’t want to leave them, don’t go. Invitations are not bench warrants.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I'm sorry, but you said \"just for the body\" and my mind went rapid-fire through different ways a dead body could be involved.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 386,
              "content": "That's what I did to the last 2 weddings I was invited to. Did it suck not going and miss out on the memories?? Yes but I chose not to go because I didn't feel comfortable leaving my baby behind with a sitter",
              "id": 60,
              "comments": [
                {
                  "score": 218,
                  "content": "My parents weren't fond of sitters either and until I was old enough to look after my siblings, one parent would stay at home with us while the other went to the wedding. Child-free weddings aren't anything new, I don't know why so many people make a fuss about it these days.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Because everyone has a serious case of \"I'm the main character\" syndrome.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "It’s the entitlement because I have a baby, my baby should be allowed wherever I am whether other people like it or not.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Babies and toddlers aren’t really fond of weddings either. I can’t imagine wanting to attend one with a small child. Requesting no children would give me a guilt free excuse to not attend.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yep. We skipped a family wedding because it was childfree and our daughter was a teenager. We were, \"Ok, no flights, no hotel, no hassle.\"",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My wife and I had a childfree wedding. Some friends couldn't go because they couldn't get someone to watch their kid. It sucks, but we understood because we were the ones who established the rules for the wedding. Not going is always an option and the people getting married should understand.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "THIS! Why does nobody grasp that declining an invitation is always an option.  Hosting a meeting outside this Friday. Some people are coming, some people are not, its all ok and their choice.",
              "id": 67,
              "comments": [
                {
                  "score": 9,
                  "content": "Oh. They know it’s an option. These parents just “don’t want to miss out” and demand sympathy for their situation. I do have a toddler, but I am comfortable with sitters and WILLING friends and family stepping in. If that’s not possible, I accept that it might restrict what I can do in terms of my social life.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My kids are older teenagers and technically adults. But I'm still willing to play the \"can't bring kids\" card to get out of weddings. But, I'm an introvert and hate social gatherings and am constantly looking for a reason not to go.\n\n\nChildfree weddings with kids is miserable. Plus, I'm sure OP and the baby took some attention away from the couple. \n\n\nYTA, OP. You owe the bride and groom a massive apology. Especially since your kid disrupted the wedding ceremony.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2368,
          "content": "This right here!!  I told everyone my wedding was child free. I even had friends stationed at the front in case people brought their children to direct them to free babysitters - I knew people would try and go around it. And still someone brought a baby in and sat in the back because their baby ‘would be fine’. We barely even knew this person. You can hear this damn baby crying on my video and it pisses me off 24 years later every time I think about it. \n\nYTA.",
          "id": 70,
          "comments": [
            {
              "score": 535,
              "content": "You're much nicer than I would have been. I wouldn't have even provided sitters. I would have just had someone at the front asking them to leave if they pulled this shit.",
              "id": 71,
              "comments": [
                {
                  "score": 731,
                  "content": "My mom wouldn’t let me lol. But during the reception when we were talking to everyone when I was introduced to them i said to them in my best bless your heart voice ‘so you’re the little one that had so much to say during the ceremony. I just can’t wait to hear it again when we watch the video…’. All the while staring the dad straight in the eye. The left soon after.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 192,
                      "content": "Why was your mom dictating what you chose to do at your wedding? \nBut honestly I love the pettiness. I would have done thr exact same thing.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": ">All the while staring the dad straight in the eye. The left soon after.\n\nyou know they made a pass through the buffet line for some road food",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Savage and deserved.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Oh man yes! I am so frustrated for you, seriously! I went to a wedding a few years ago where the invitation VERY CLEARLY said “please do not bring your children” and even had mentioned there was a family member who graciously offered to skip said wedding to care for the kiddos. \n\nPeople showed up with their a**hole kids anyways. Three little monsters, old enough to know better (7-9yrs old) were running around playing tag and screaming during the speeches! Finally the grooms father, a very stoic, tall man, escorted them AND the kiddos parents out of the building and made them leave. \n\nIt’s so ridiculous. If you don’t like that someone has requested you not bring your kids, DO NOT GO. It’s really that simple. \n\nOh and OP, yes, YTA.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Imagine this baby wrote this post 24 years later 😂",
              "id": 77,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 823,
          "content": "Not to mention, OP didn’t even contact them directly to explain the situation … she just included it in the RSVP. She had to know this was going to be an issue, she just believed she could get away with it because the rules are apparently different for her.",
          "id": 78,
          "comments": [
            {
              "score": 374,
              "content": "Because she knew and was banking on them either missing the note or not bringing it up. OP has main character energy.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "She didn't ask if she could violate the rules. She just decreed she was above them on her RSVP.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "“I wrote it on the RSVP & made it their responsibility to tell me no if they wanted me to follow the rules.”",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Probably wrote it in a pink gel pen on a pink RSVP card",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 541,
          "content": ">Bride/Groom: \"Here is a rule for the wedding: Do NOT bring your child or any babies to the wedding\"  \n>  \n>OP *passive aggressively writing:* \"I am not going to follow your rules, as by my signed RSVP card\"  \n>  \n>Bride/Groom: \"What the hell? They couldn't even be bothered to reach out and ask if they could or not? They are just TELLING us they are breaking the rule?\"  \n>  \n>OP: \"See, they never said anything to me directly so it was okay.\"  \n>  \n>Everyone Else: \"THEY TOLD US FROM THE START TO NOT BRING BABIES OR CHILDREN. WHY DID YOU THINK YOU WERE SPECIAL!?!?!\"\n\nImagine inviting 100 people to a wedding, and every single one of them wrote in that they were making \"custom arrangements\" that were contradictory to the wedding. No one asked if they COULD do it, they just told the bride/groom that they were going to do it, and it was up to the bride/groom to do something about it. How many times do people have to say \"No\" before people get it?",
          "id": 83,
          "comments": [
            {
              "score": 35,
              "content": "I’ve never understood why some people feel so fucking entitled when it comes to weddings.\n\nLike, you’re being invited to celebrate *the people getting married*. This isn’t *for* or *about* you, it’s their special event to celebrate their love.  So why the fuck wouldn’t you be bending over backwards for the *privilege* of getting to celebrate with them?  You’re not the one making the terms here; it’s their party, and you’re the one trying to get in.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yep… classic shitty person technique. Instead of calling and asking, or just not attending, they made it someone else’s problem before saying “they didn’t say no!”.\n\nOdds are they missed the note entirely because weddings are stressful as hell to organise.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I would have had this woman and her baby escorted out of my wedding if they did this crap to me.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 499,
          "content": "What really gets me is she brought his own food (thinking negating his plate, would make up for it)",
          "id": 87,
          "comments": [
            {
              "score": 622,
              "content": "Right, like they made it childfree because they couldn't afford milk and mashed carrots.",
              "id": 88,
              "comments": [
                {
                  "score": 357,
                  "content": "Most people think they making it child free makes it cheaper, nah we just don’t want it to be loud AF. I have two kids and I’m in a wedding in Nov, they will not be attending lol.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 20,
                      "content": "It does make it cheaper too, though. Often a child's plate costs the same as (or nearly the same as) an adult's plate.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "> nah we just don’t want it to be loud AF\n\nOr we're planning on having a few immediately after the ceremony.  As soon as the vows were exchanged and we did the little walk, the bartender/host yelled \"let's get pissed!\" and the drinking began.  \n\nThat's why there was exactly *one* kid at ours.  We knew she would behave herself and she'd been around some of us partying before.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "My friend is having a child free wedding in August and she cites this exact reason. Like come on. Trying to say it’s because of budget completely negates the reality that babies are annoying. Gives me “yes. Babies cry” vibes. Cool, no shit. But what are you gonna do about it? \n\nMy friend also said that the second she announced a child free wedding it caused drama. To choose that route instantly opens the flood gates for entitled parents who can’t seem to wrap their head around the fact that the world doesn’t revolve around THEIR kids.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I mean, as someone who's planning for a wedding, even kids' plates are expensive, especially if you're planning for an entire family's worth of children. That's part of the reason we're not having anyone under 21 at our actual wedding and just doing a big family barbecue later (that and my fiancé has already been married once and his parents were Not Amused™ when he tried to invite the entire guest list of the first wedding to the second).",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 490,
          "content": "Yep. I had a child free wedding and would have been LIVID if a baby was in attendance. OP is absolutely TA here.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "One of the worst parts of this (because there really are so many) is that there was a babysitter…that they completely dismissed. They actively chose to be selfish and disrupt the wedding AND discredit who I’m sure was a fine babysitter if all of her relatives were fine leaving their kids with them.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Also there are two parents.  Even if absolutely no other options were available they could have traded off attending the wedding/reception and caring for the baby.",
          "id": 96,
          "comments": [
            {
              "score": 6,
              "content": "~~Well, we don't know that. OP is still an ass though, but we don't know for sure if both parents are in the picture for whatever reason.~~\n\nEdit: nevermind, just saw a comment that OP _and her husband_ were there together.. ugh.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "I had a cousin who did this and I’m still bitter. She knew I didn’t want kids there and purposely didn’t send an RSVP. She just wanted to show off her baby. \n\nOP at least gave a heads up, but still should have known better. YTA, OP.",
          "id": 98,
          "comments": [
            {
              "score": 14,
              "content": "Ugh that's so frustrating. \n\nWhen I was gathering my RSVPs I contacted the ones who hadn't replied and basically said \"if I don't get an RSVP  from you by x date, I'll assume you're not coming. Food and seating will be arranged accordingly.\" AKA if you don't RSVP, you don't get to sit or eat.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "That line at the end \"I didn't mean to start any drama\" is a load of BS.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22571,
      "content": "[removed]",
      "id": 101,
      "comments": [
        {
          "score": 4551,
          "content": "THIS. There were other options besides \"Do what I want despite the very specific instructions from the bride and groom\".",
          "id": 102,
          "comments": [
            {
              "score": 3914,
              "content": "Do you sell cured ham?  \nNo, Ma'am, we are a bakery, we do not sell cured ham.  \n\\*Later\\*  \nHello, I'm here to purchase one cured ham, we discussed it on the phone.  \nMa'am, we are a bakery, we do not sell cured ham.   \nI wrote on Yelp that I would be coming by later to pick up ham and you didn't say no, so I assumed you would arrange it. This is outrageous.  \n\n\nOP, probably.",
              "id": 103,
              "comments": [
                {
                  "score": 838,
                  "content": "Ma'am, this is a Wendy's...",
                  "id": 104,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Ok, give me a cured hamburger, whatever",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "Got any grapes?",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "💀💀🤣😂",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I understand the confusion, I thought you wrote *smoked clams*.",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 549,
              "content": "Honestly, if OP was trying to be as spiteful as possible towards this cousin for some reason, the solution would be exactly what OP did. I don't know how OP thinks this is even debatable? The level of entitlement alone is YTA.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "“This sign can’t stop me because I can’t read”",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 723,
          "content": "Exactly this--OP has revealed herself to be an overly entitled person.\n\nAnd she is actually lucky that the groom's mother thought enough of her to tell her the truth, so she can now apologize to the couple and maaaaybe she will be invited to other events that family holds. If she doesn't, I doubt she will ever be asked back.  \n\n\nWe invited a couple I knew tangentially to our home for a meal when they were visiting the area. They asked if they could bring their adult daughter who lives near us. Sure, I said, no problem. They later asked if they could bring her puppy. I said no because our dog does not get along with other dogs.   \n\n\nThey showed up with the dog. We had to lock our dog in a room all day and she barked herself hoarse.   \n\n\nWe never invited them back and refused all their invitations. When people show me who they are, I believe them. I've been burned too many times not to.",
          "id": 111,
          "comments": [
            {
              "score": 281,
              "content": "No way in hell would I have locked my dog up because someone decided to ignore me. Any invitation to eat would have been immediately revoked and they would have been banned. My home, my rules period especially when it comes to my animals.",
              "id": 112,
              "comments": [
                {
                  "score": 101,
                  "content": "Yeah they wouldn't have gotten through the front door if this were me. All of them would be immediately uninvited. I'm not going to traumatized my pets to save face with someone who clearly doesn't respect me or my home.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "right! i would’ve locked their dog up tf",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Oh, I have dogs who aren’t “other dog” friendly.  I’d have been much less accommodating — “oh, there must have been some confusion — I’m sure I mentioned that we couldn’t have other dogs here.  What, you mean you to leave?  Oh, that’s too bad!  Hope to get together another time!”  {bright smile and chipper wave as they leave}",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My ex-mother-in-law used to do the same thing! She had little dogs and we had labs. She would expect to bring her dogs and have ours put out in the yard or have them in a room with a closed door. When we moved out of state we told her she couldn’t bring the dogs under any circumstances.  At that point we moved to a city and had an apartment. Our building had a strict dog rule they had to be registered and show documentation of vaccinations etc. If our building found out we could be evicted b/c they wouldn’t be registered because only 2 dogs were allowed. We had to pass the doorman (who knew everyone) to take the dogs out so would be obvious too. Of course she thought the rules didn’t apply to her and her dogs were more important.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 413,
          "content": "[deleted]",
          "id": 117,
          "comments": [
            {
              "score": 31,
              "content": "Well I'd rather she asked than if she just assumed she was in the right and everyone else was the problem, you know?",
              "id": 118,
              "comments": [
                {
                  "score": 30,
                  "content": "Doubt this changes her mind, she'll just be like, \"all these internet meanies are WRONG!!!\"",
                  "id": 119,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I am surprised I havent read the stereotypical response of \"she has just given birth X many days/weeks/months ago\" or \"hormones\" response as in some vain desperate attempt to justify the OP possibly not being an asshole.",
              "id": 120,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I welcome posts like hers honestly. There’s like one YTA post for every 20 NTA posts. This sub gets boring if all the posts are blatantly not their fault",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": ">And she’s so dense she’s asking if she’s TA\n\nOr the bride is writing this from TA's side of things, hoping to get affirmation that she's not wrong to be upset about TA's actions.",
              "id": 122,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 157,
          "content": "\"But I WROTE on the RSVP that I was going to break their rules. So THEY had to make the extra effort to tell me to follow the original rules of their wedding, instead of challenging my challenge to their original rules. **I** took the initiative here, but they didn't say anything\"\n\nThe amount of audacity from OP is astounding.",
          "id": 123,
          "comments": [
            {
              "score": 21,
              "content": "\"I don't understand. I specifically and clearly wrote in the requests box when booking my ticket that I would be bringing a machete, a handgun, an AK-47, twelve sticks of dynamite, and a bottle of Perrier with me in my carry-on. The TSA did not immediately tell me I could not do this, so obviously it's fine! Why are you arresting me?!\"",
              "id": 124,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "but don't you know that the rules don't apply to OP",
          "id": 125,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "We’re invited to a child free wedding in the fall and my baby will be 10 months at the time. The wedding is 4 hours away, so having someone come with us to stay with him during the wedding will be difficult. \n\nSo guess what we’re doing?DECLINING AND SENDING A GIFT!\n\nJesus-fucking-Christ, how HARD is that?",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15254,
      "content": "Couldn’t you just have not attended? \n\nNext time stay home and send a gift. YTA",
      "id": 127,
      "comments": [
        {
          "score": 1994,
          "content": "Heck, if you don’t attend, etiquette says you don’t even have to send a gift",
          "id": 128,
          "comments": [
            {
              "score": 328,
              "content": "Etiquette does not make any connection, in either way, between giving a gift and attending an event. No one, ever, under any circumstance whatsoever, is obligated to give anyone a gift under the rules of etiquette; if they were it would be called a ticket price, or attendance fee. This is an absolute unbreakable law.\n\nThe reception is meant to thank the guests for their preseNCE at the wedding, not for their preseNTS.",
              "id": 129,
              "comments": [
                {
                  "score": 175,
                  "content": "Try to tell that to some brides!  When I was getting married I saw all sorts of things like “the wedding gift should equal what the couple spent per plate on the reception”.  Ummmm just because you choose to have some fancy ass wedding, doesn’t mean I should break my budget!   Also, my mom paid for my wedding. Shouldn’t she have gotten all the gifts then?\nI made a comment that I crochet blanked for people. Someone said “that is okay for a baby shower but not a WEDDING gift!”   I got a couple of handmade blankets and 16 years later I still use them!",
                  "id": 130,
                  "comments": [
                    {
                      "score": 81,
                      "content": "A crochet blanket is a lovely wedding gift",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Honestly I value handmade items much more than anything that can be bought. Anyone can buy something, not everyone has the skillset to make a gift. Plus making something takes a lot more time, effort, and consideration of the giftee.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I don’t mean to be dramatic but I would die for a crocheted blanket",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I’m getting married in three weeks and we really don’t want gifts, at least for ourselves. We already have too much stuff so we registered for supplies for the local animal shelter. Any gifts we get are a nice bonus. I think the “cover your plate” rule is so tacky. If you invite someone to be your guest you’re not expecting them to effectively pay admission.\n\nHaving said that, I would never show up to a wedding empty-handed.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 91,
                  "content": "Etiquette isn’t an obligation or a law, but it’s an expectation regardless. You’re also not obligated to use cutlery and may choose to eat your food like a dog or a caveman, but you can’t be surprised if people look funny at you for doing so and stop inviting you out to dinner if you can’t follow basic dining table etiquette. I mean, it’s also not against any law to wear white at a wedding where you are not the bride, but you’d still be committing a major *faux pas.* While I agree that it it’s a silly rule to demand a minimum dollar cost for the gift (as an example it’s not unusual for handmade items to take lots of time rather than lots of money), it’s at least courteous to give something thoughtful even if inexpensive to the newly married couple.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "That’s a pretty hot take!  At least where I’m from (Midwest USA), attending a wedding and not bringing a gift would be a clear breach of etiquette. The couple expends a lot of resources on you for their wedding (time and attention to invite and plan, limited resource of attendee spots at the wedding, expense for the reception, time spent at the event, etc). They also show respect / honor that they want you with them in a significant day. To act like it would not be rude to fail to acknowledge that with a gift demonstrates a real lack of empathy / awareness. \n\nYou don’t HAVE to bring a gift, but you’d be an AH and impolite if you didn’t.\n\nOh, also, OP in the main story - mega YTA!!",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Stop. Stop.\n\nEtiquette is inherently a suggestion and a set of societal mores. That's what the word means.\n\nIt's not a law. But it is social mores. That's just what the word means.\n\nIf you attend the wedding, etiquette does indeed entail getting the bride and groom a gift. You are seeing these people on their way as a couple. The idea is to help them. Not burden them. That is why the etiquette is to give a gift.\n\nEtiquette has wiggle room. Will anyone be upset if a college student doesn't get an older relative a gift st their wedding? No. Obviously not.\n\nEtiquette is a series of suggestions and mores. That's just what that thing is.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 199,
          "content": "Exactly. She mentions that the bride doesn’t know her well - which means that OP doesn’t meet her cousin (the groom) very often. So probably OP wouldn’t have even been missed.",
          "id": 138,
          "comments": [
            {
              "score": 18,
              "content": "Ugh that's even worse, since it's usually only those close to the wedding party who *might* get a pass.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "i'm sure her other family members won't be inviting her next time.\n\nalso YTA such entitlement, my lord.",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11569,
      "content": "YTA. You can't just write in a plus one. Especially a child at a child free wedding. Your child was disruptive for the bit before you took them out, which is exactly what the couple didn't want. You disrespected the bride and groom, violated their wishes, and disrupted the ceremony. This was extremely not okay of you. If you can't find a suitable childcare arrangement, stay home.",
      "id": 141,
      "comments": [
        {
          "score": 1877,
          "content": "YTA If OP had twins, she would write a plus two.",
          "id": 142,
          "comments": [
            {
              "score": 1560,
              "content": "I had someone write in +9 because they had 9 kids. I had my Mom take care of that one.",
              "id": 143,
              "comments": [
                {
                  "score": 428,
                  "content": "Unreal! Lol The sense of entitlement takes my breath away!",
                  "id": 144,
                  "comments": [
                    {
                      "score": 222,
                      "content": "OMG that’s like someone writing in that they would like a steak instead of the actual reception food. It’s not a room service order card.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 144,
                  "content": "Omg wtf? I would probably go no contact with someone who had the audacity to try that",
                  "id": 146,
                  "comments": [
                    {
                      "score": 191,
                      "content": "They were invites of my parents. Mom invited a couple of close friends. I'm pretty sure they didn't come after she had to tell them they couldn't have a +9",
                      "id": 147,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "I specifically worded my RSVPs \"we have reserved ___ seats for your family\" and I hand wrote a number for each person's invite. Had them write names of attendees below that so I could know who was coming specifically. \n\n180 people invited, some without room for their children. Nobody gave us an issue or tried to bend the rules. I was so happy because I spent a lot of time and effort trying to make sure people understood how many invites they had.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 29,
                      "content": "These people literally crossed out the 2 and wrote in 11. Zero shame",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I let them bring their kids and still had several people write in +3 and +5 so all their kids could bring their boyfriends and girlfriends. And they did this 2 weeks before the wedding.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I wouldn't do that for a BBQ, much less a wedding",
                      "id": 151,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "People are cray-cray. My sister and BIL had a couple write in their THREE adult children AND SPOUSES on the invitation. My BIL, being the nice guy he was, called them and told them it was OK to bring SIX EXTRA PEOPLE to the reception. The kicker is, NONE of them actually showed, so my sis and BIL had to pay for EIGHT plates for no-shows. They were LIVID. The only good thing was the venue gave them the extra food to take home. Since my sis and BIL were leaving on their honeymoon straight away, my dad ate like a king for about a week after the wedding, LOL. These were distant family members that my BIL invited to be nice, showing that no good deed goes unpunished, and he never heard from the again (and they've been married for 24 years now!).",
                  "id": 152,
                  "comments": [
                    {
                      "score": 15,
                      "content": "The only winner here is your dad for getting tasty leftovers",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Oh HEEEELLLLL no",
                  "id": 154,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Even my ultra-sweet mom was like \"I'll call and take care of it\"",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "My husbands cousin did that with +11!!!! 11 people I didn't know! He was knocked down several pegs by the entire family especially since it was all his gfs friends aaaaand they're no longer together",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Wow I'd take back the whole invitation for that!",
                  "id": 157,
                  "comments": [
                    {
                      "score": 20,
                      "content": "When you tell people that bold \"no\", they tend to either do it anyways or skip all together due to pride. Fortunately, they skipped.\n\n\n\nAt $50 a plate, they had better.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm planning a celebration of life and one of the attendees invited six extra people without asking me. I'm still not sure what to do about it lmao.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 8,
                      "content": "You either call and tell them no, have a family member do it, or accept them with open arms. No other option really",
                      "id": 160,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "My sister in law brought her adult friend +friend’s baby. Didn’t tell me till I think two nights before. I also had a old creepy dude crash the wedding.",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Probably cross off \"chicken / fish\" and put in \"charcuterie board\" too",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 706,
          "content": "Right? My cousin did this. Wrote in plus two for her step kids who I had never met. I asked her about it and she said “well we have them every weekend now so we have to bring them.” Ok whatever. Pissed me off but I didn’t tell her she couldn’t. I even made arrangements for two more kids meals with the caterer. After all that, THEY DIDN’T SHOW UP. \n\nOP YTA. If you don’t feel comfortable leaving your baby with a sitter then you don’t get to go out.",
          "id": 163,
          "comments": [
            {
              "score": 213,
              "content": "Send her an invoice for a cost of the meals.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Exactly! It's kinda like the whole \"if you can't afford to tip, you can't afford to go out to eat,\" thing. If you can't find, can't afford, or don't trust a sitter, then you don't get to go. Too many people don't understand that when you have kids, sometimes you have to miss out on certain things.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "You most certainly could have told her she couldn’t.",
              "id": 166,
              "comments": [
                {
                  "score": 29,
                  "content": "Oh I know. I just didn’t want to make a fuss. It wasn’t a child free wedding, I just didn’t know her step kids and had no idea what her visitation schedule was so I didn’t invite them (she hadn’t been married long and we weren’t close). It was one of those “invite them because they’re family” kind of things. Figured I’d do the nice thing and try to accommodate her.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Gotcha. That was nice of you to allow her to bring them even though she didn’t.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "We did everything we could to avoid this - addressed only to adults, noted child free on invite, and the RSVP card LISTED EACH ADULT BY NAME where they could check yes or no and put any dietary restrictions. \n\nWe still had THREE couples write in their young children, so we had to awkwardly call them and tell them no. \n\nWe made a single exception for a guy who we'd allowed a plus one, and he asked directly if he could bring his 11 year old as his plus one bc it was his weekend. We went back and forth on it and finally said yes because he was older than the above mentioned kids and we'd already counted in for a plus one. Then they were the only no shows to the whole wedding bc the 11 year old boy didn't even want to come.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "My dad tried to write in a plus one. He hadn’t dated anyone in 15 years and also tried to invite a bunch of his work buddies. People are so f-ing entitled",
          "id": 170,
          "comments": [
            {
              "score": 29,
              "content": "I once got invited to a wedding where I was allowed to bring a plus one if I'd liked--I was single and the couple knew that, but also knew I didn't know much of their family. I brought a friend who was of the same religion as them. He felt pretty comfortable there because he knew what was going on, and I was comfortable because I didn't feel completely out of place and alone.\n\nBut also if I hadn't been given that option I'd've gone alone and just awkwardly tried to make conversation with other guests lol. Not tried to invite someone else without permission.\n\nTotal YTA on OP's part here for all the reasons.",
              "id": 171,
              "comments": [
                {
                  "score": 10,
                  "content": "That’s nice they gave you a plus one! That’s what we did for some of our single friends who didn’t know anyone too. No one wants to stand in the corner awkwardly haha. \nMy dad on the other hand had sooo many family members coming, along with his mother who doesn’t even live in the same state. So I have no idea what he was thinking lol",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "You also probably created tensions with other guests who wanted to know why their kids weren’t invited.",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8463,
      "content": "YTA. “Don’t bring a baby” “okay I will”",
      "id": 174,
      "comments": [
        {
          "score": 2243,
          "content": "But you don’t get it, she didn’t “mean” to cause drama, so she’s totally innocent here! \n\nI seriously eye-twitch when people pull the “I didn’t mean to” shit with stuff like this - *You also didn’t mean NOT to, you literally did not think of anyone but yourself and didn’t take even a minute to consider how your actions might affect anyone else. You are not absolved.*\n\nThe assholes who purposely reduced the number of lifeboats on the titanic “didn’t mean” for 1500 people to die.\n\n**Edit** Check the replies to me for titanic facts, apparently there were technically enough lifeboats but still many mistakes were made and nobody “meant” for 1500 people to die but I feel the general point I was trying to make is surely understood.",
          "id": 175,
          "comments": [
            {
              "score": 201,
              "content": "Actually as I recall, according to maritime safety rules at that time, the Titanic carried enough life boats, more than required in fact. That the boats were not filled to capacity is another discussion.",
              "id": 176,
              "comments": [
                {
                  "score": 69,
                  "content": "You may be right, I have some memory of the number which were originally planned for or having initially been there being reduced for some reason, and it was just an off the hip comparison. Could’ve been an initial starting point of a lot more than was actually required and reduced. But yes not filling to capacity was a bigger deal, you’re correct. So I guess I could amend “The assholes who didn’t fill the lifeboats to capacity “didn’t mean” for 1500 people to die”",
                  "id": 177,
                  "comments": [
                    {
                      "score": 93,
                      "content": "They didn't fill them because they weren't given any training and didn't know what safe capacity of the boats was. They were afraid it would tip over. I think the lack of training for the crew was a huge driver in how bad that was, considering that they could have saved like twice the people if they filled the boats up (I do blame the one officer who heard and \"women and children\" and thought that meant women and children only instead of women and children first, because he blocked guys from getting on the lifeboats even if there was space)",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "No, that is incorrect. The Titanic did not have enough lifeboats to begin with. Those they had were not full. Many ppl still didn't believe the ship was going down and did not get in at the start. \n\nBECAUSE of the Titanic many new laws were enacted bc there were so many decision points that could have prevented the disaster. Those laws included mandatory life jackets and lifeboats for every one on board; muster drills at the beginning of a cruise to teach ppl what to do and where to go; made Morse Code the official in distress language, made it mandatory for ships to keep communications on and monitored 24/7 (a ship in the area had its communications system off for the night and if it had been on/monitored, everything would have been different); distress flares only for emergencies (ship close by thought they were firing their flares in celebration like fireworks); and more.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 136,
              "content": "This is exactly the conversation I used to have with my kid when she was a toddler and she didn't mean to make a mess!\n\nShe'd say \"I wasn't trying to break the thing!\" And I'd say, **\"But you were weren't trying to not break it\"** \n\nIt's about intention. Of course they don't intend anyone to get hurt, but they didn't consider the consequences of their actions and how that impacts others, which amounts to the same thing.",
              "id": 180,
              "comments": [
                {
                  "score": 21,
                  "content": "Right. A drunk driver “didn’t mean” to kill the person they hit with their car.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "[deleted]",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 349,
          "content": "People tried to pull this at my child free wedding. I even had one relative say, \"Surely you don't mean my children.\" We definitely meant her children, in fact they were the kids we were thinking of when we made the rule!",
          "id": 183,
          "comments": [
            {
              "score": 56,
              "content": "It's so ironic but so typical isn't it?",
              "id": 184,
              "comments": [
                {
                  "score": 8,
                  "content": "Yup. The woman I was referring to was my cousin. She constantly criticizes other peoples parenting and the behavior of their kids when her kids are god damn monsters.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Always the way, and particularly babies. \"Oh, you don't mean my 6 month old do you? They'll be with me the whole time\".\n\nBabies and toddlers are exactly who I mean. People don't have child free weddings to prevent their high school age family from attending...",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Oh, I thought the “no children” was meant for everyone BUT me!!  💯you are an asshole!!  (I probably would have asked you to leave!!)",
          "id": 187,
          "comments": [
            {
              "score": 9,
              "content": "I would have had her and her kid kicked out, too.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "But she chiseled it on the sacred plates of RSVP....",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6858,
      "content": "YTA absolutely and without question.\n\nChild free means child free, if you don’t want to leave your baby with a babysitter then you stay home.\n\nYou were incredibly rude.\n\nThe reason a lot of people want child free weddings is so they don’t have their vows interrupted or ruined by screaming kids. Yours did exactly that.\n\nThe world doesn’t revolve around you and your choices. You don’t get to write “I’m bringing my kid” on an a child free invite.\n\nWhat is wrong with you?",
      "id": 190,
      "comments": [
        {
          "score": 1016,
          "content": "Why, nothing's wrong with HER. Just ask her! Basic etiquette doesn't apply to her and her precious, squalling bundle of joy who is simply too special to be left with a sitter. \\s",
          "id": 191,
          "comments": [
            {
              "score": 607,
              "content": "Unfortunately the one who needs this advice will never see it. She’ll see the first 2 comments and then write us all of as ‘haters’ and continue on her selfish merry way. YTA",
              "id": 192,
              "comments": [
                {
                  "score": 109,
                  "content": "I have always wondered about this. Do people who write these ever read the reasons why TTA and keep on thinking, “[commenters] they are wrong, I had to do it!” Or really ponder about what they did and maybe accept that they were wrong? I really hope is the latter because I want to believe people can change for the better :-/",
                  "id": 193,
                  "comments": [
                    {
                      "score": 64,
                      "content": "Oh, some people absolutely do that. Some just come here for validation and then get mad when it doesn't go their way. Then they'll either try to justify and make excuses in the comments/an edit or they won't interact with the post/comments at all. These people are typically the ones with narcissistic tendencies or are full-blown narcissists.",
                      "id": 194,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "u/babyweddingthrowaway YTA 100%",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "And she only cried and disrupted the ceremony like you'd expect a baby to do and were trying to avoid, but it was totally fine because *you* don't think your baby was that bad.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 431,
          "content": "OP probably downplayed how obnoxious her kid was as well.  “Cried for a bit” probably means “Screamed bloody murder through most of the vows until I finally left.”",
          "id": 197,
          "comments": [
            {
              "score": 51,
              "content": "Hey guys I’m bringing my cat to the wedding! He absolutely hates being in strange unfamiliar places. He screams bloody murder even when I put him in the car to drop him off at my mom’s if I have to go out of town. \n\nBUT HE IS SO CUTE I LOVE HIM SO MUCH AND HE’S MY CAT AND I LOVE HIM AND I CAN’T LEAVE HIM AT HOME ALONE BECAUSE HE GETS LONELY AND HE IS MY CAT AND I LOVE HIM AND HE IS CUTE",
              "id": 198,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "Agreed! 10 month olds usually don't just start with crying unless they get hurt, there's usually a bit of not-silent fussing and whining, accompanied but mom's attempts at shushing and distracting, before actual crying starts.",
              "id": 199,
              "comments": [
                {
                  "score": 19,
                  "content": "Our son was an absolute ASSHOLE at 10 months old. If he could hear you even BREATHING, he would lose his absolute shit and go from 0-completely unhinged in a second. \n\n\nWe definitely could not take him anywhere even remotely “important” from the time he was ~8-18 months old. And based on the stories from friends with children, family members and mom groups, their experience was much the same for that age group. It’s like once they hit 18 months they fuck off for a little bit. \n\n\nOP is definitely TA. It is incredibly rare for a 10 month old to be able to sit through anything without being a total gong show, and there’s no way she could convince any other parent that she was unaware of baby having such a temperament. They’re crawling, learning to stand/walk/talk. Our son was walking at 10 months. No way in hell they’re staying put for a wedding ceremony. The audacity of this woman is astounding.",
                  "id": 200,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "“But I was trying to calm him down! He was just inconsolable, the poor thing! After about 10 minutes I had to take him for a walk just to get him settled again l” like ok but you should’ve taken him for that walk before the ceremony… all the way out to the car. And then you should’ve taken him for a drive to soothe him… all the way back home, because you never should’ve brought him in the first place and he was never invited.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Right? Like, at the rate OP is going, I’m surprised she didn’t announce a new pregnancy or showed up in a white dress and just wrote it off like, meh…",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 175,
          "content": "I also don’t know how she wasn’t insanely embarrassed to be the only one with a crying baby….like, that’s a bad look when everyone else followed the rule. Tells me everything I need to know about her.",
          "id": 203,
          "comments": [
            {
              "score": 20,
              "content": "Oh but she quickly took the kid out so *it’s no big deal.*\n\nThis woman is so clueless that it’s almost unbelievable. Her cousin not confronting her about RSVP makes me think that she steamrolls people on the regular and then throws her hands up in the air and acts all innocent.\n\nYTA",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She's YTA in general, but especially AH if she doesn't formally apologize *and* offer to pay for professional editing of any wedding photos and videos to remove them and their *crying child* from the memories. The married couple are going to be reminded every time they look back at how huge of an AH OP and her husband were. AH will just continue to be an AH, as is evident in their responses here making the wedding all about themselves and their one-in-a-lifetime opportunity to ruin someone's wedding at a great venue.",
          "id": 205,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5599,
      "content": "YTA\n\n\"my cousin didn't object\" - yes they did. When they sent invitations that said \"child free\" on them.",
      "id": 206,
      "comments": [
        {
          "score": 1744,
          "content": "Honestly, what was the cousin even supposed to say to a note that basically said \"I don't care about your wishes, I'm bringing the baby anyways\"?",
          "id": 207,
          "comments": [
            {
              "score": 513,
              "content": "They should have had the ushers or whoever stop them at the door and not let them in.",
              "id": 208,
              "comments": [
                {
                  "score": 239,
                  "content": "This.\nWhen I expressed concern about my NC brother crashing our wedding, he just replied \"My cousin and his buddies will be working the doors.\"\nDone. Next page.",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This is how I would have handled it. \n\nExcept I'd probably go bridezilla and throw her out myself.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "Cousin could have text her in return ‘hey, sorry you can’t get a babysitter for our wedding. We’re sad you can’t make it, but we’ll see you at the next family gathering.’ He shouldn’t HAVE to do that, but it would hopefully get the point across in a non-confrontational way.",
              "id": 211,
              "comments": [
                {
                  "score": 26,
                  "content": "Why are you making this about what the bride and groom did wrong? Cousin could have- but it's not her job. OP can read. OP knew what she was doing and she was humiliated by other guests - rightly so- who could not only read but respected the bride and groom's wishes. \" Bride and groom didn't try hard enough\" is kinda lousy to say. OP deliberately announced she was not going to play by the rules and as a result she humiliated herself and disrupted the ceremony. ALL. ON. HER.",
                  "id": 212,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "She could have texted cousin before replying to ask if it was ok. \n\nThe invitation seemed clear and planning a wedding is stressful enough without having to follow up with guests who think rules don’t apply to them. \n\nThis whole thing could have been avoided if she respected her cousin’s wishes in the first place. It really doesn’t matter what the bride and groom decided to do after that. They even provided a sitter for god’s sake. \n\nShe had options. She could have declined to go. She could have brought her own sitter. She could have been a decent human being and apologized as soon as she realized the chaos it caused her cousin instead of asking a bunch of strangers.",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "My wife and I had someone RSVP and included their kids. My wife called them (it was her friend) and told her it was a childfree wedding (which was on the invites/website). The friend didn't end up coming because they couldn't get childcare.\n\nNo is a complete sentence.",
              "id": 214,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I had a guy (single dad) friend that I knew would not understand the \"child free\" part of our invite.... so we did NOT give him a +1.  He put in a +1 anyhow-- so we called him on it.  Said, who is your +1?  He said \"daughter\" and we said \"we were afraid of that.  No kiddos at the wedding, sorry.\"  He said he understood and would come without her.  Guess what?  No show.  Ate the cost.  But I'd rather that than have his kiddo (who was out of control) there, so...    point being, cousin should have just called OP and called her out on it.....!",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 341,
          "content": "EXACTLY. Putting it on the invite is their attempt to avoid EXACTLY the kind of awkward situation OP put them in.   \n\n\nThere are so many options here that aren't \"I'm ignoring the hosts wishes and bringing my baby anyway\": get a baby sitter, have one parent attend, don't go at all.   \n\n\nI have a baby and I am going to a no-kid wedding in December. She is travelling with me....and I am bringing my mom along so she can watch the baby for us while we attend the wedding festivities. I am paying for my mom's flight/accommodations, she gets to have a little getaway, and baby gets to be watched by someone familiar, and no one's wedding gets disrupted.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Right? \"They didn't awkwardly confront them when I already clearly told them I don't care about their rule, so I have their blessing!\"",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Right!?  And she didn't ask them she just decided they could object if they didn't like it. What?!",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3792,
      "content": "YTA.\n\nThis was immensely inconsiderate on multiple levels. 1) To the bride and groom who made their wishes clear; 2) to the people who were looking forward to a child free wedding; and 3) **especially** the people who made proper arrangements and didn't bring their kids, even though they may have wanted to.\n\nYou've now made the bride and groom look like they gave you special treatment and not other guests. That's extremely unkind and thoughtless of you. \n\nYou owe them an apology.",
      "id": 219,
      "comments": [
        {
          "score": 591,
          "content": "This is such a good point. Multiple other guests would probably have made arrangements with their own kids because suckers that they are, they respected the bride and groom’s wishes.",
          "id": 220,
          "comments": [
            {
              "score": 24,
              "content": "And now imagine how they talk about OP to those more considerate friends when asked about it. There no way I would be doing ANY damage control on OP's behalf.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "If she didn't wanted to leave the kid with an unknown babysitter, she should have stayed home and give a present after or leave the kid with someone she trusts. Now the other guests with kids are probably feeling like clowns for leaving their children with a babysitter.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Oh yes number 3 is such a good point!!!!",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "[deleted]",
          "id": 224,
          "comments": [
            {
              "score": 6,
              "content": "Willing to bet she hasn’t grown any more conscientious in the years since, huh?",
              "id": 225,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Given how most people do have kids, your points make a ton of sense. Frankly if I were the bride that would’ve been the last time she got invited to anything. Common says if she had difficulties she should’ve confirmed with the bride and groom via phone call, email or call BEFORE she went in. Her desire to be at the event trumped bride and groom’s wishes. They paid for the wedding of their desires. No matter how you slice it this was poorly done on OP’s part. Especially as she displays intelligence though apparently lacking respect and conscientiousness.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "She owes EVERY guest an apology.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Exactly. If OP was uncomfortable leaving her child with someone, then decline the invite.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2973,
      "content": "YTA. \n\nYou were told the wedding was child free. If you’re not comfortable leaving the baby then the correct RSVP was “I’m sorry but I can’t come”, not “I’ve decided the rules don’t apply to me”. He cried during the ceremony- exactly what they were trying to avoid.",
      "id": 229,
      "comments": [
        {
          "score": 55,
          "content": "And the baby “didn’t fuss much” at the reception. \nWhich means the baby fussed.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2296,
      "content": "INFO: Did you make any attempt to contact them about this besides the rsvp?",
      "id": 231,
      "comments": [
        {
          "score": 545,
          "content": "Of course not. Plausible deniabilty.",
          "id": 232,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 345,
          "content": "I love that she wrote it on the invite and left it at that, as if that makes it all okay. She wanted to avoid the conversation, so this was her shitty workaround.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 286,
          "content": "She was hoping that she wouldn’t hear back and that she could get by on a technicality, which is exactly what happened.",
          "id": 234,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}