{
  "post content": "So this needs some context. Disclaimer, the guy I’ve been bringing home knows my ex exists and knows he stays at my place but I don’t tell my ex anything. \nSo the background is that me and my ex were together for 3 years, we have a child together, and overall I think he’s a good guy, he’s intelligent and stable so a month ago we moved out for the very first time to a big city in an apartment. Neither one of us knowing anyone in the city, knowing he’s from Indiana and I was moving from 40 minutes away, it was a dream to be in a city this big. \n\nHe works in food. And I get it, the time you come home always varies when you work a full time schedule and you close and work with shitty people. His job sucks and he works 30 minutes away so I try to not say anything to him when he comes home at 2:30 am. But when I would bring it up we would always fight because he has a history of cheating on me in the past multiple times so of course I worry and his argument is always “we just moved, I don’t know anyone here.” But then it kept happening. He’s a recovering alcoholic. About 3 weeks ago he went back to how he use to be in the beginning of our relationship. Every time he stayed out late he’d come home more drunk than the last night and I’d be worried sick about him. \n\nI’m not the obsessive type but I just can’t sleep until he’s home so I’d stay up til 3-4 am sometimes when I work mornings. I started a new job and that was the night he decided to come home at 2:15 am when I had to be up in 5 hours for my first day. It was a big deal. So I looked it up and his work closed at 9. So there’s no reason it’d take that long. I worried so much that I had this horrible pain in my stomach and ran to the bathroom and there was a huge amount of blood. Come to find out I had a miscarriage. So I texted him I was bleeding and in pain and he ignored it and said sorry that his phone was on silent and that he’ll be home soon. That was at 1:35 am so he shows up at 2:15 am. He said he was at a pub and that he was sorry and proceeded to ignore me and stumbled to the bathroom to get in the shower and then broke a shelf trying to get in and tripped and knocked all the shampoo in the bath. We had an argument and like every argument we’ve ever had in the entirety of our relationship it’s me trying to talk to him and then him turning into this person I don’t know. He’s been doing this new thing though where I get mad and his responses are “hm? WHat? I don’t know what you said” so I stormed into the bedroom and told myself I was over it and that to forget about it and go to sleep.\n\n I check Instagram and I’m nosey so I’m always checking to see what my friends are liking and I see he started following a stripper from a stripclub that is 3 minutes down the road from us. So I go back in the front room and confront him and he says it’s not important and that I need to go to bed and I’m the most annoying bitch he’s ever met. So all the nights the past month he’s been at “pubs” he was really at this stripclub. Granted I tried to let it go. He’s 22, he has the right to be there and drink. But going alone to a stripclub let alone talk to a stripper enough to get her instagram is a entire different story to me. \nSo we fought and he pushed me for “yelling” because he’s the type of person that thinks people are responsible for their emotions which is true to a point. \nSo fast forward to now. He never apologized or put some light on the topic. I’ve considered myself single every since that day and I’ve been going on dates with this guy. But my ex still lives with me. He comes home and acts like we’re dating and I made it to where I didn’t let him touch me or call me honey anymore and he slept on the couch for about a week before he came home drunk one night and came into my room and threw himself on me. I was really mad but I let him do what he wanted and then we slept together and the next morning I was happy. But I’ve promised myself I’m never going to date him again. \n\nMy best friend came over about 3 days ago and she knew everything and she hates my ex now. We were sitting on the couch so my ex does this thing where he’s a smug asshole and says we’re dating and expects things from me. He kept calling me honey in front of her and told me to be safe and have a good day with my other boyfriends and said if I didn’t stop being sassy he’d give me “a finger later”. Guy thinks he’s a total comedian. So he stood and stared at me while me and my friend were putting makeup on (I’m obviously ignoring him because he’s leaving for work and wants something) so he bends down to kiss me and I let him without looking. I’ve told him we’re not dating. And he says we are and he won’t move out so I play his game. I watch movies with him, I let him touch me, I let him do what he wants. But I’ve been going on dates with this guy I really see something with. I haven’t told my ex anything but I really want this guy to stay the night especially because he doesn’t have a tv and there’s some classics I want to watch with him but I’m scared of the outcome. My friends say bring him over and tell my ex to fuck off but they’re in college so I think they’re just being dark about the situation. \nAlso: the apartment is in my name I think that’s essential. \nAITA? There will probably be mixed answers but I expect it. ",
  "id": 1,
  "comments": [
    {
      "score": 48,
      "content": "**ESH**\n\nWhy the fuck are you living with your ex?\n\nSounds like you're both lunatics to me. Maybe you two were actually meant for one another.\n\nI feel bad for your kid.",
      "id": 2,
      "comments": [
        {
          "score": -11,
          "content": "Yike ",
          "id": 3,
          "comments": [
            {
              "score": 18,
              "content": "You came to the wrong subreddit if you wanted to be coddled.",
              "id": 4,
              "comments": [
                {
                  "score": -11,
                  "content": "No that’s not it. Read my replies to other users about the living situation. Or even like. Read my post again. ",
                  "id": 5,
                  "comments": [
                    {
                      "score": 32,
                      "content": "I did.\n\nYou've been broken up for **22 days** and you're already bringing new guys home into bed.\n\n...with your felon ex sleeping on your couch.\n\n...and your assumed infant/toddler sleeping somewhere else in the house.\n\nYou're trash, he sounds like trash, I feel like y'all should just get married.\n\nContradict me if I'm wrong.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Read your post twice to make sure I didn't miss any subtle nuances. I agree with u/aita-user. You and your ex are both acting like lunatics, and I feel so sorry for your poor, poor baby.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22,
      "content": "YTA. He thinks you're dating. You let him touch you. You live together.\n\nYou're cheating on him by seeing other people. So yes, YTA ",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "I disagree re: cheating. It's not cheating if he knows. It's an open relationship. ",
          "id": 9,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": "How can I cheat on someone I’m not dating ",
          "id": 10,
          "comments": [
            {
              "score": 13,
              "content": "> He thinks you're dating. You let him touch you. You live together.",
              "id": 11,
              "comments": [
                {
                  "score": -5,
                  "content": "He didn’t think we were dating when he went and looked at naked women with his phone on silent. But it only matters if he feels it when it’s convenient like not getting kicked out of your house right? Read my other replies about the touching and the situation. ",
                  "id": 12,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Why make a post about this when you badly dont want to be looked like the villain, youre both assholes and youre a terrible mother for causing this to your baby",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "You slept with him recently and let him have his way when he came in your bedroom, no? You need to stop being so defensive and see how we are all critical on here because you're acting like you're 16 years old, and I'm being very generous with that. ",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "No one is arguing that your ex isn't a dick.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12,
      "content": "ESH, you both sound like immature, ridiculous people. He's an asshole for cheating and lying basically acting like an abusive prick, and you're an asshole for continuing to live with him and act like his girlfriend whenever it suits you, and then turning around and dating someone else when it doesn't. \n\nActually, maybe you deserve each other. No one else needs this drama ffs. ",
      "id": 16,
      "comments": [
        {
          "score": 5,
          "content": "And they're both extra assholes for pulling this shit when there's a small child involved.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "Like I told someone else, how do you physically remove someone from where you live? I’ve told him to leave. I wish he was gone. I wouldn’t be posting this now if he was I can financially support myself without him here. ",
          "id": 18,
          "comments": [
            {
              "score": 5,
              "content": "Then why don't you leave?",
              "id": 19,
              "comments": [
                {
                  "score": -1,
                  "content": "It’s my apartment. My name is on it. I have to be here another 11 months. Do people understand the concept of leasing. ",
                  "id": 20,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Regardless of if YTA or not I think you need to not live with this guy ASAP. Your name is on the lease (edit: and it sounds like your ex isn't) so you have every right to kick him out. Get your landlord involved, then police if he won't leave. I'll second the advice to head over to /r/legaladvice too.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Apparently you don’t understand the concept of leasing. Your name is on the lease. His name is not.  Give him 2 weeks to figure out living arrangements and kick him out on the 14th day regardless of what he has figured out. That is not your problem. ",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "So what options have you explored to get him out?",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "ESH. Where the fuck is your kid in all of this? Do you even care how this situation could affect them? If your decision is to be done your next step should be finding a way to establish a separate living situation and a stable environment. Bringing people home to create  contentious situations benefits nobody.",
      "id": 24,
      "comments": [
        {
          "score": 3,
          "content": "It is enraging to have to scroll down this far to find anyone talking about the child.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "I do care. A lot. But yeah the living situation is for him to get out because he’s living here illegally and my name is on the lease and only my name. He had everything going for him. He had a family and we were doing good and he was getting decent paychecks. Things were fine until he made the decision to do the things he did and these are the consequences. He wasn’t thinking about me or his child when he went to see naked women and drink so much he couldn’t stand when he got home. IMO it’s my apartment and he deals with what I do because he won’t leave. Don’t leave then fine, I’ll live like I’m single and like you’re not here like he’s not suppose to be. ",
          "id": 26,
          "comments": [
            {
              "score": 6,
              "content": "Even if we forget about your child's existence (because it seems as if that's not a concern for you) you need to address what's going on with him. It strikes me That your motivation here is to parade someone in front of him as opposed to rectifying the situation. If you really are interested in this other person that isn't going to start things off on a healthy note. Tell him to leave. If he doesn't leave, have him evicted. Then go get some family therapy.",
              "id": 27,
              "comments": [
                {
                  "score": 0,
                  "content": "I don’t want to forget about my child. I love with him with all my heart which is why I have to take time away from him and work my ass off and put in the hours at college so I can have money to afford nice things and a house for him just that’s not the reason I’m posting here. People don’t know enough to comment on my kid. What I do away from him doesn’t affect him or say what kind of mom I am to him. And it’s not parading. My friends want me to parade. And I just want him to come over but my ex is in the way which is why I was searching for advice. ",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Wait up above you said his name is on the lease, now you're saying your name is on the lease. \n\nCall the cops and have him evicted. It sounds like you still have feelings for him and you're trying to punish him for treating you unfairly. He doesn't care. You're gonna have to move on. ",
              "id": 29,
              "comments": [
                {
                  "score": 0,
                  "content": "Where did I say his name was on the lease? It’s not but I guess I’ll have to look into how that’s done.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Tell him it's your apartment and he has to pack his shit and leave or you're calling the cops. If he doesn't leave, call the cops. \n\nMaybe it's not that simple and there's squatter law or something. You can ask on r/legaladvice",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "ESH. You’re the asshole and he is the asshole. It seems like you like playing along to his game which makes me think you’re either really young or simply immature. If you were really done with him, you’d make it a point and not let him do things to you as you claim. It also seems to me that because he is/was cheating, you are just playing the game along and want him around for when you want him but have the convenience of being with someone else for the days you don’t want him (your “ex”).  Grow some cajones. Break up with the dude, figure out a different living situation. Seems the relationship is toxic and will only get worse. ",
      "id": 32,
      "comments": [
        {
          "score": -3,
          "content": "I push him away and he grabs me, and I tell him we’re not dating and he always contradicts what I say. I don’t care about him being around. I go out with this other guy to stay away from my ex and my apartment and I am gone sometimes for a week at a time. I broke up with him, told him to move out. Apparently that doesn’t matter to him. I realize it’ll only get worse I have no feelings left for him but I feel like I’m stuck right now. ",
          "id": 33,
          "comments": [
            {
              "score": 10,
              "content": "HOW ARE YOU STUCK??? Again, he is not on the lease! Don't want him grabbing you? Don't let him in!!! Don't like him coming at you in your bedroom? Don't cave in and sleep with him? Like, these problems could be easily fixed and you're the reason why they are still happening!",
              "id": 34,
              "comments": [
                {
                  "score": 0,
                  "content": "I can’t make him homeless. I’m not that person. I just need him to understand I’m serious and I guess I came here for advice on how to kick someone out that refuses but I have the answer now. ",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Call the police on him and tell them he's trespassing since he isn't on the lease.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You contradict yourself. ",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "INFO\n\nWay to long.   What I need are the pertinent facts:\n\n1. When did you break up.  \n\n2. Did you break up before he moved into the apartment?\n\n3. Why the fuck is he still living there?",
      "id": 38,
      "comments": [
        {
          "score": 0,
          "content": "We were together when we moved in and we broke up NYE I believe. But I couldn’t tell ya why he’s still living here. ",
          "id": 39,
          "comments": [
            {
              "score": 10,
              "content": "I can tell you why he's still living there: \n\nBecause you won't grow a spine and tell him to leave. Grow the fuck up and kick him out of your life. ",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "We want to know too. He's still living there because you let him. If his name isn't on the lease, then you don't have to let him in. You know he's going to clubs and strip clubs and you still allow him inside. I don't get it. You act like poor me, but you aren't stuck with him. Nothing is keeping him there legally. You're letting it happen and enabling his bad behavior.",
              "id": 41,
              "comments": [
                {
                  "score": 1,
                  "content": "I can’t just make someone homeless. I tell him everyday to move out. And he won’t. I’m not going to just take his key without him taking his belongings. If he moves out it’ll be a whole month event or more of him trying to find a place which is impossible with a felony and he needs to pack his things because there’s too much. ",
                  "id": 42,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Stop making excuses. He's your Ex his problems are no longer your problems.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "Yeah...YTA. You sound like my gf when shes mad at me for not paying attention (she doesnt know I had adhd). One question, who oays the rent? If its 50/50 then he has as much of a right to that room as you do, and if you're so mad you wont sleep with him then atleast alternate with him. He doesnt sound like a great guy by any means, but you dont seem like a great girl either.",
      "id": 44,
      "comments": [
        {
          "score": -2,
          "content": "I put 3 months rent down so he pays for our small electricity and heat bill. He’s staying here illegally basically because he has a felony. But we do alternate. I don’t hate him anymore. I’m numb to it I’m just trying to do other things and him being here is getting in the way. ",
          "id": 45,
          "comments": [
            {
              "score": 6,
              "content": "Then kick him out, or admit that you're just as bad and be happy",
              "id": 46,
              "comments": [
                {
                  "score": 4,
                  "content": "\\^ This!!! AntiRegios is saying what I've been saying. If only your name is on the lease then it's your fault if he keeps coming around. Change the locks and call the police if he makes a scene. And you talk about your \"single life\" but he's paying for stuff too?? That isn't living the single life. And you're allowing a felon to live with you. Gross.",
                  "id": 47,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Allowing to let a felon live with me is gross? Okay that statement pissed me off so we’re making a thread about discriminating felons when they probably live the hardest life. I hate him but I still feel bad for him everyday that he has to drive 40 minutes to work and back because he can’t find another job where we moved. He’s a asshole but now you’re the asshole. I won’t allow insults against felons here that’s fucked up ",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "You're both major assholes.",
      "id": 49,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH. Why is he still living with you? Why do you let him touch you, kiss you, and sleep with you? Actions speak way louder than words. It seems like you are only going out with these guys to make your ‘ex’ jealous. Maybe you just like the attention. There is no way in hell I’d get involved with someone who claims to have broken up with someone while dating me, yet the guy still lives in the house and sleeps in the same bed as you. ",
      "id": 50,
      "comments": [
        {
          "score": -6,
          "content": "Because I don’t know how to physically remove him from my apartment. I’ve told him many times to leave. Everything he owns is in the front room but he just won’t do anything with it. But I’m not going out with anyone to make my ex jealous. We’ve been dating for 3 years and he cheated on me multiple times, I can’t explain all the hurt he’s put me through but I’m really numb to him. He still makes me happy but I started going out on dates to forget about him and to leave my apartment so I’m not around him and it was mainly to make new friends since I just moved here. And the second guy I ended up going out with is like really good for me and I’m aware of this. Just this whole ex situation is weird and I want to continue this thing I have going with the person I’m seeing but my ex isn’t moving out anytime soon it seems like especially because he has a felony and he’s living here without my landlord knowing. I don’t want to snitch because I feel like that’d get me in trouble too. I’m just really confused ",
          "id": 51,
          "comments": [
            {
              "score": 2,
              "content": "You definitely tell the landlord and you pay to get the locks changed. I don’t think you want him to leave because if you did it’s pretty simple. Your name is on the lease, his is not. He is illegally living there. ",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "OP, you're REALLY immature. Wow!\n\n&#x200B;\n\nYour ex stumbles in drunk, cheats and goes to clubs, ignores you while you miscarriage? And you allow him to live with you?\n\n&#x200B;\n\nYou want the new guy to sleep over so you can watch classics because he doesn't have a tv. OP, you need to grow up. Stop worrying about going from guy to guy. Move out or kick him out. Don't live with your ex! Cut him completely out of your life. \n\n&#x200B;\n\nYou need to learn how to be single. You need to learn about YOU. You're so young. I wish desperately that I could go back to my early 20's. Focus on either going to school or learning a skill. Focus on making an income for your future. Boys around your age aren't ready to settle down anyway. It's time to start making adult choices, even if they're the harder choices. ",
      "id": 53,
      "comments": [
        {
          "score": 1,
          "content": "I don’t know how to remove him from my apartment is the issue I’m having. I did as much as I thought I could. I folded his clothes, I put everything together in the front room. I told him to move out. I tell him almost everyday. But that’s really good advice. I do have good things going for me though. I have the dream job I went to college for. Currently enrolling CNA classes to further the licenses I can put under my belt with the degree I have. I can’t be single and that’s the worst trait about myself. I did start talking to this other guy to be friends with him though. He owns a business I admire and I came to his gallery to buy a painting I’ve been looking at and we started talking about artists we admired and he said he’d show me around the city since I know nothing. And now I see things in him I never seen with my ex. We’re not dating but with the situation I feel awful and I should of expected the reaction I’m getting ",
          "id": 54,
          "comments": [
            {
              "score": 4,
              "content": "Understand WHY you can't be single. Go to therapy. I myself go to therapy, so there's nothing wrong with it. It's toxic to go from guy to guy. How can you really know yourself if you won't let yourself be single? And you'll think every new guy is different.\n\nTo get him to leave your house. When he is at work drinking, clubbing, any way leaving the house: Put all of his stuff into boxes. Call him and say they are outside of your door and he needs to come pick it up or you'll throw it away. He'll be angry, but make sure the locks are changed if he has a key. If he doesn't DON'T LET HIM IN. If he starts to yell, make a scene, or even get violent (even banging on the doors) call the police. Tell them that he was \"visiting\" you, but he's an alcoholic and he won't leave. They will force him off the property. And after that maybe you can talk to the landlord and move to a different unit? But yeah, don't let him inside! He leaves all the time, that shouldn't be an issue",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}