{
  "post content": "I have an 11 year old daughter, Ellie. She has a best friend, Sophie, (12). Both of the girls have special needs and are around 6 years old mentally. \n\nSophies mom called me yesterday, said that they were at an indoor playground, and Sophie wanted to know if Ellie could come and play. Sophies mom offered to put me on her punch card (she prepays for 10-20 visits at a time because it’s cheaper) so it would be free for me so I got Ellie in the car and we met them at the playground. \n\nAfter about an hour of playing, the girls started to get hungry. I packed a snack for Ellie but Sophie’s mom didn’t have any snacks on her. I told her they sell snacks in the front but she claimed that she didn’t have any money on her and asked me to buy Sophie some goldfish. I said sure, Venmo me and I’ll grab some. \n\nI said no, I took care of my kid and it’s not my job to take care of hers too. She says she paid for my kid to get in so I could cover the $2 for the goldfish. I told her if she wanted me to bring snacks she should’ve told me when she invited me but I won’t be wasting $2 for a $.50 bag of goldfish because she was unprepared. She went up to the front and I don’t know if she lied about not having money but she came back with goldfish and fruit snacks. Now she’s being petty by asking me to pay her back for all of the times we’ve used their memberships and guest passes so we’re not getting along. \n\nI’m going to have to see her at school drop off/pickup, ballet class, gymnastics class, and the girls weekly play dates so I wanted to know if I was the asshole for not buying her kid a snack.",
  "id": 1,
  "comments": [
    {
      "score": 29029,
      "content": "YTA…you were invited to a place for free that you would otherwise have had to pay for.  You only packed snacks for your child?  Why?  Why didn’t you also take snacks for the other child?  Yes, you did not have to do so, and that child is not your responsibility, but if I was meeting someone for a playdate for my child, not paying to get in, knowing, at some point both girls were going to be hungry, I would have packed snacks for both, as a thank you for the invitation and just because.  I would call the other mom TA as well, because if she has passes to this place, she knows her child will want a snack, but from your other comments, this seems to be a recurring theme for you.  Your daughter is invited numerous times?  You accept the generosity, but do not reciprocate in any way?   At least not that you state.  So, due to a pack of goldfish, because of you, your daughter might not see so many invites to playdates any longer.  Exactly, who is mentally 6 years old in this snenario?  The children or the parents?,",
      "id": 2,
      "comments": [
        {
          "score": 10883,
          "content": "The other mom is not an AH. People make mistakes and oversights. I can’t tell you how many times I’ve had to turn the car around half way through a trip because we’ve forgotten something. Luckily, we have FRIENDS who would gladly help out if we forgot something our baby girl needs.",
          "id": 3,
          "comments": [
            {
              "score": 6282,
              "content": "100%. As a mom I’m constantly helping other moms with whatever they need: snacks, wipes, bandaids, water, sunscreen. Not just my friends but random folks at the park too. And folks are always helping me out. It’s hard enough raising a kid, we can’t shut each other out. It always comes back around",
              "id": 4,
              "comments": [
                {
                  "score": 2787,
                  "content": "This has been my experience too. I bet the other mom was shocked",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2749,
                      "content": "I was shocked just reading this.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Extremely rude and selfish, possibly this was a test of what kind of person you are and guess what? You FAILED.  My guess is the other Mom suspected what your reaction would be.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I mean, I'm not a parent so I don't get the sense personally that failure to pack for others justifies \\*shock\\*, although having done so would certainly be viewed as the better choice.  But the refusal to cover the snack for the other young girl is problematic behavior that the other mom is justified to be peeved about.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah when I go on play dates I always take enough snacks for the other child too! There have been times when I’ve forgotten something but the other parents are always willing to help out!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My money is on OP actually being the dad and is oblivious to this kinda thing",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 955,
                  "content": "As I mum that one time didn’t have wipes (the pack was in the change bag and empty! 😱😱😱) and was given wipes but a random other mum I did not know - thank you thank you thank you.\n\nTurned out to be a leaked poop and I don’t know what I’d have done if that mum hadn’t given me wipes as I walked in to that change.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 754,
                      "content": "I once had to rush to the pharmacy, sick baby and all, and the second I got the meds I realized I didn't have any way to coax my kid to take them. A random mom came and handed me a juice box, just like that. Seriously, fellow moms/ people have saved me so often",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 674,
                      "content": "We were at a museum at Pearl Harbor that if you didn’t have a military ID, you had to take a bus to- and couldn’t bring backpacks, diaper bags, etc. \n\nWent into the restroom while my husband was out in the museum with our toddler and preschooler. The mom had a baby on the changing table, and she was trying to wipe poop off the diaper to attempt to reuse it- she had ridden the bus and didn’t have any more diapers. \n\nWe drove our car, and I had diapers in the car. I offered her a diaper, and she looked like she was about to cry. I ran out to our car, grabbed diapers and some wipes, and brought them in. I had the means to make her and her baby comfortable and clean, why wouldn’t I?!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 373,
                      "content": "I've been on both sides of that experience. There's no reason NOT to take care of each other and every reason to do it.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 279,
                      "content": "I was with my infant at the Chicago airport alone. I took her out of the carrier to breastfeed and change her. I was anxious with how busy it was and getting to the terminal, and was fumbling with the straps. Without a second thought, another mom came over and helped me get her strapped onto my back. \n\nI've had mom's help without question so many times. Mom's that came up to me to tell me how amazing I was for breastfeeding in public. My experience as a ftm was great! Now that they're older I'm the one who gets to help when a tired mom just wants to sit down and eat. Let me bounce that baby for you, mama",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 195,
                      "content": "[deleted]",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 151,
                      "content": "The original post is so sad / ridiculous. I agree 100% with you. I am always happy to help out and never feel weird asking another mom for help.\n\nI kind of wonder if OP was that stingy you-know-what with the Lexus at the pumpkin patch parking lot last fall when I realized I forgot the sunscreen and asked her for a squirt for my boys. The gal gave it to me begrudgingly, but she was pissed. So weird to be that petty. I mean, it’s one thing to not be used, another thing to be a miser.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 128,
                      "content": "I mean, this right here is a good example of \"it takes a village.\" She didn't give you wipes because she owed them to you, but because someone else has probably helped her out before or will help her out in the future.\n\nSome people have this weird bug up their ass about doing any favor that isn't \"owed.\" I suspect that if they really looked at their lives objectively, most of them would have had much harder lives if no one ever tossed them a favor without being in their debt.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 117,
                      "content": "My friends husband brought his daughter out and forgot the entire change bag. Between us all we cobbled together clothes after an accident, wipes, snacks… we got it all covered!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "That reminds me of a time recently a mom asked for two wipes when we were both changing our kids in a restroom (two, specifically). I handed her more than she asked for, then just started laughing when she pulled her kid's pants down. I could see the liquid poop pushed up against the diapers elastic. I handed her a great big handful more wipes and wished her luck as we left. \n\nSometimes you are the one receiving wipes. Sometimes you are the one giving wipes. Thank goodness most of us aren't as ridiculous as OP.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Yup. Thank goodness it wasn’t this mum. She would’ve asked you to Venmo her $2 for the wipes😂",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 630,
                  "content": "As a dad, I whipped a diaper out of my diaper bag when I was at a flu clinic with the kids and I overheard another couple lamenting a poopy diaper and no spares. Just help out other parents when you can.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 338,
                      "content": "My bad for saying moms. A dad definitely saved me once when I had no wipes and a blow out diaper at the park. Dads, grandparents, babysitters, Nannie’s, day care providers. All people taking care of babies and kids, we all gotta help each other out.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": ">As a dad, I whipped a diaper out of my diaper bag \n\nI remember this story my Mom told me but the guy wasn't a Dad, he was just a caring person.  This happened in the 60's:  My Dad was in the Air Force and was stationed overseas.  He told my Mom to move from Texas and go stay with his family in Michigan because her family were giving her so much trouble and not much help.  My Mom was trying to lug 2 babies (me-11 months and brother-1 month old) and two luggages around a Greyhound bus station.  She said this young White man wearing an army uniform asked her where was her husband and she told him stationed overseas.  He too was traveling to Michigan so he told her that he would help her until they reached Michigan.  She said he slung his military nap sack over his shoulder, picked me up and grabbed one of her luggage.  She said she was sort of embarrassed because they were getting strange looks because she was a Black woman and he was a White man.  And since both my brother and myself were very light skinned, people assumed that they were a couple/married.  She said he was a trooper, and when people would look askew at them, he would ask them if they had a problem.  She said he sat in the seat right across the aisle from her so that I could have sleeping space for myself and my brother could have his own sleeping space next to our Mom.  He stayed by Mom's side all the way to Michigan until we got off (he had to go to upper Michigan).  She said she was so appreciative of his kind gesture and have never forgotten it.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Over the summer as we were leaving the park my daughter tripped and got a little scrape on her hand. A dad saw me digging through my bag for something to wipe it off with and immediately said “Excuse me, I have some magic boo boo wipes with me today” so he not only helped me clean the scrape but he also saved me from a preschool meltdown. I still think of him and wish him well!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 388,
                  "content": "Exactly. When going to a playdate, I just pack duplicates of all the snacks I am bringing. I am bringing gold fish for my kid, then I have gold fish for the other kid too. Sometimes we are at places (say, playground) where you don't have shops around and kids love to share - its so sweet to see them eat and giggle around...",
                  "id": 26,
                  "comments": [
                    {
                      "score": 112,
                      "content": "I’m a Nana and I always pack extra snacks when I take my grandsons out. When we are responsible for snacks at soccer or baseball games I bring extra drinks and snacks because there is bound to be a sibling who wants to join in.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Even if the other kid has their own snacks kids often want to eat the same thing as their friend and it’s more fun for all to share.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I always did this too. Even if everyone has snacks, the other kids might be jealous or interested in trying. I distinctly remember giving a little boy we didn't know some apricot slices (with parental permission). He said, mom, I like apricots! Lol",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yeah, I always pack double snacks on play dates too! I've learned that kids ALWAYS want what the others have, so I make sure to bring enough for everyone. Plus my son just likes to try & feed everyone so I have to stay prepared. He feels like if he's eating, then everyone should be!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 314,
                  "content": "Seriously. I don’t even think I could tell a stranger no when it comes to feeding their hungry child, much less a person I know and spend time with!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 267,
                  "content": "This lady seems like someone who won’t pass TP under the stall for someone who needs it because “you should have checked first. I did.”",
                  "id": 32,
                  "comments": [
                    {
                      "score": 72,
                      "content": "\"Not a square to share!\"\n\nHas anyone ever passed TP under the stall in a men's room?  I've never heard a stall to stall request.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "She won't hand an extra pad or a tampon under a stall either.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 225,
                  "content": "Yes, moms just... provide. I learned when I became a mom, my MIL is endlessly generous...and prepared for everything!! My mom is a bit like OP, only willing to do the bare minimum for HER kid and everyone else's kids suffer. \nI don't live by that philosophy. I ALWAYS pack extras of what we remember to pack, and I'm happy to share if another parent looks like they need something, whether I know them or not. \nI've shared diapers, given away my daughters' clean change of clothes, a tube of sunscreen passed around the park for moms who forgot, etc. IT ALWAYS COMES BACK AROUND ✨️ \nI won't be that mom who teaches my kid (special needs or not) to be stingy and frugal to the extent of harming others!!!",
                  "id": 35,
                  "comments": [
                    {
                      "score": 65,
                      "content": "Not just mums, I am not a mum and if I am going out with friend, with or without children, and I am taking snacks with me I will pack spares for other people, just in case anyone else wants stuff and hasn't got anything!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I had a friend like this. Once we both had kids I started noticing this more and more. Never packed snacks to share, venmo'd for the smallest amount, it went on and on. The worst was she would always keep a list of what people got her for showers, birthdays, etc. After her kids birthday she would make sure she gave the corresponding kid an exactly equal  gift for their birthday. When I had a second I figured out that if I gave her kid a $30 gift, mine were getting a $15 gift each. Once when I was looking for something specific for my daughter birthday that was sold out everywhere and she found it but wouldn't purchase it unless venmod her that second. It was $9 and I was seeing her the very next week. The final straw was when she made me pay for some hand me downs of clothes that were well worn that I had actually gifted her son for birthdays. Maybe that makes me the AH but I was done.\n\nEdit: she was not having another kid and selling all her baby stuff; these were not expensive clothes just some Mickey target outfits that I really liked that were no longer sold",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 218,
                  "content": "Exactly! When I pack snacks, I pack snacks for all possibilities of children needing snack. Otherwise, it’s just not nice to let your kiddo eat something in front of their friends",
                  "id": 38,
                  "comments": [
                    {
                      "score": 10,
                      "content": "When we were kids and playing out the front, if my mum didn’t have enough ice pops for everyone we were playing with to get one, no one got one",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 188,
                  "content": "[deleted]",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 155,
                  "content": "Yes, the other mom is NOT the AH. These are both parents with special needs kids. OP should have at least some empathy for the other mom. And special needs or not, sometimes it’s half-a-day’s work just to get a child dressed, into the car, and to a destination - let alone to do it flawlessly without forgetting anything. \n\nMy response assumes that the $2 is affordable for OP. For some, especially those with special needs kids and very little support available (at least in the US) for families, then OP will need to explain that to the other parent in order to repair the relationship.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 15,
                      "content": "And the amount that other parent spent using her card for OPs kid to get in, probably cost much more than the $2 that the snack would've cost.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 659,
              "content": "Agree, other mom is not the AH. More than likely they weren’t originally planning to be there that long but then invited OP and her kid. Of course now they’re gonna stay and keep playing. Then OP’s kid gets hungry and gets a snack, of course Sophie is gonna want something too. That’s how kids are.",
              "id": 43,
              "comments": [
                {
                  "score": 6,
                  "content": "Just what I was thinking. They probably stayed longer because friends joined them.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 598,
              "content": "Like frankly a complete stranger could ask me to buy a bag of goldfish for their special needs child and I would oblige.",
              "id": 45,
              "comments": [
                {
                  "score": 172,
                  "content": "Wouldn't even need to be special needs. Your kid needs a snack? I got you.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Right? I hear a kid saying they're hungry around me and the paarent saying they don't have anything, I'm offering whatever we have on us, or a few bucks.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 172,
                  "content": "As a mom of a special needs kiddo with VERY limited foods he will eat; thank you. Some people don't realize how such a simple thing can really mean so much.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 71,
                  "content": "Maybe it’s how we were raised because my mum fed everyone. She would make extra dinner for the neighbourhood children i played with. She bought food for everyone when we were out if they had no money. And on picnics with family everyone’s food was for everybody. I could never refuse to buy a snack for a kid and i have never. Op is definitely the asshole",
                  "id": 49,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Some of us weren’t raised like that, but we watched our parents and learned what not to do, and chose to be generous as adults 😊",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "when my mom found out my bff and her brother didn't get lunches she started sending me to school with three lol",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "Same. I’ve been known to share my plate lunches with total strangers who seemed in need, a parent and a kid? Absolutely, I’d buy something or share the food I have, if they’re comfortable with it. I’m not a parent, just a guy who comes from a poor family, tbh. But that’s how we were raised; you take care of each other, because chances are, no one else will. Kids especially.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Honestly a stranger could ask me to buy any kid a bag of goldfish and if I had the means at the time I would. I hate punishing kids if I can at all avoid it.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 286,
              "content": "I agree, also, the other child may only wanted a snack because OP’s daughter had one. OP sounds very selfish and entitled. Why couldn’t her daughter share her snacks with her friend.\n\nOP sounds like a freeloader. It sounds like she has taken advantage of this other mother (take, take, take) and not given anything in return. \n\nThe sad thing is it’s the daughter that will suffer. She won’t be invited anymore and will wonder why she doesn’t get to spend time with her friend.",
              "id": 54,
              "comments": [
                {
                  "score": 11,
                  "content": "Or have ANY friends, once this gets around.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 244,
              "content": "Right?! She asked for a $2 snack for her kid because she forgot cash AND she got your kid in, which was probably a lot more $. If OP were always getting her kid in or this mom always forgot her wallet, or was asking for $20 pizzas, fine. But OP, YTA for taking advantage of the free passes, but not packing enough for both kids or giving $2. You are ending a friendship over $2???",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Bingo!!",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I am also know some kids are not hungry until someone else they are playing with is hungry and suddenly want to eat.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">Luckily, we have FRIENDS who would gladly help out if we forgot something our baby girl needs.\n\nWe got a giant snowstorm yesterday and my fiancé works the desk at a hotel like <1mile from our house. Around like 8pm he FaceTimed me to show me that one of his friends from high school that we haven’t seen or talked to in *years* had just checked in because they weren’t able to make it home with the roads. Turns out they had their 6mo baby with them. \n\nWhen I found that out, the very first thing in my head and out of my mouth was “do they have everything they need for the baby?” I was legit ready to go dig my daughter’s bassinet out of the very back of my closet if they needed it. It was the only thing I thought they maybe didn’t have, but I legit have everything here (minus formula) for babies newborn to 3-4yo, and I *gladly* would have loaned/given any of it. \n\nThat said, I also forget something for my own daughter almost every time I leave the house. I have SO many things of sunscreen because they kept being taken out of the diaper bag for some reason. There’s zero shame in forgetting stuff for your kids. I think it’s amazing that anyone can get out of the house and *not* forget stuff!",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 794,
          "content": "YTA. Big time.",
          "id": 60,
          "comments": [
            {
              "score": 14,
              "content": "Completely and utterly. How selfish.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I can’t imagine how OP felt she was in the right and needed to type this. Shit like this makes me lose faith in humanity.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 673,
          "content": "I always pack double the snacks even if both parties are paying equally. Kids always want what the other has, sometimes my snacks and sometimes the other parents snacks\n\nI would do this anyway as that’s how my mind works but if I was getting in for free I would pack double and offer to go buy the parent a coffee\n\nThis is such selfish, entitled behaviour",
          "id": 63,
          "comments": [
            {
              "score": 172,
              "content": ">I always pack double the snacks even if both parties are paying equally. Kids always want what the other has\n\nThis so much.  It took me exactly one awkward playdate for me to learn this.  Don't sacrifice your kids' potential friendships to your desire to be a cheap bastard.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "When I go out with my friends and their kids (I don’t have any) I pack extra snacks because the kids always want what I’m eating instead of what they have.",
              "id": 65,
              "comments": [
                {
                  "score": 6,
                  "content": "Someone else's always looks better when they're little, lol.\n\nWhen the kids in my life were little, we could have the exact same order from a pretzel cart, but somehow mine tasted better, so we'd have to share, or swap.\n\nNot their slushie, because that was special, but my pretzel bites were somehow superior.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Exactly. It doesn't matter if the kid had a five course lunch. They will be hungry as soon as another kid pulls out a snack. I am far from well off but a couple bucks for a snack so my child could play for free would be amazing.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 421,
          "content": "Seriously. OP, YTA. I have never been to an event or a play date or any kind of thing with my kids without bringing plenty of snacks. You just don’t ever feed one kid and not the others, to the best of your ability. That’s just not how it is. And you’ve been using her punch card for the playground too. You should try and fix this before your daughter loses this friend.",
          "id": 68,
          "comments": [
            {
              "score": 17,
              "content": "I believe its to late already",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "My son who is 6 has his best friend over once a week and he had his first sleep over last week and you bet your arse I bought them both snacks , I even buy snacks for my 16yr and her friends when they visit n guess what, I don't charge them for it n I'm not that well off",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 375,
          "content": "Even if the mom didn't prepare, that doesnt make her an ah, just someone that made a mistake and needed help",
          "id": 71,
          "comments": [
            {
              "score": 92,
              "content": "I've packed my toddler a snack for an outing only to have her scarf down the whole container of goldfish in the car on the way there. I've since learned my lesson and pack a backup Ziploc bag full and a few nutrigrain bars, but sometimes even being prepared isn't prepared enough. I'm sure the mom felt bad enough about the whole thing before OP's comments, poor thing.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Someone who ALWAYS pays for OP’s kid, and needed some help with a $2 item. The amount of insult I would feel the moment “okay, venmo me the $2” directly after I paid way more for your kid…and not the first time. \n\nThat would be the last day I paid for this woman’s child",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "For real. The amount of times I forgot something in the bag. I’ve had to buy formula, snacks, water, and even bottles/cups while actively out because I forgot to put one of those in the bag",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 269,
          "content": "So glad too comment has “bring snacks for both”. My kids are 8&10 and I still bring extra snacks for the other kids we are going with. My friends bring extra snacks for my kids. Why? Because if one kid has it, the other kids want it. Doesn’t matter if they shouldn’t be hungry or really don’t like that snack. They want it and will eat it. Especially with a six year old mentality.",
          "id": 75,
          "comments": [
            {
              "score": 136,
              "content": "If I'm at the park with my little there's extra juice boxes, water, pull-ups, wipes, sunscreen, bandaids, snacks for the littles to share. He has a bucket of toys and bubbles to share as well (except Dinotruck. No one touches dinotruck lol) Mamas I got you too. My thermos has coffee, I have tampons, pads and Tylenol. I'll hold your little one A next to you while you are changing little one Bs butt. Because sometimes we need an extra set of hands more than anything else. MaMas I GOT YOU. And if the icecream man comes and you're short 2 bucks your little is getting a darned icecream too.",
              "id": 76,
              "comments": [
                {
                  "score": 11,
                  "content": "I don't even have kids but holy fuck you sound like an amazing person to know and I wish I knew you in real life.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I’m that mom who will cut up and take a whole freaking watermelon because I feel bad when other kids are watching my kids eat and clearly want some. I mean, no child left behind, right?",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "We always shared on playdates. We shared what we had and they shared what they had. I can't imagine leaving a child hungry.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Love this response! So well said! YTA. how self unaware can one be? Did Op really believe that she would get validation here? Feel bad for her poor daughter",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I wouldn't call the other mom an AH. first, because Shyt happens when you're dealing with kids. Most caretakers are always just 1 overstimulated braincell away from catastrophe. and forgetting things is our superpower.  \n   \nSecondly, they were already at the playground, we have no clue how long right? Maybe Sophie had already eaten all her packed snacks before she even thought about inviting OP's daughter.  \n\n\nI def question the intrinsic value of anyone who makes a big deal out of feeding kids. Even if the other mom  was sitting there blinged out and wiping her nose with Benjamins, I would've gotten Sophie a snack.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "They don't have to pack snacks for the other kid but refusing to buy a $2 snack is such an AH move to do. It's double the AH move since that parent got OP in the place free.\n\nDouble YTA for OP",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12740,
      "content": "YTA.\n\nYou mention she has paid multiple times for your daughter’s entrance fees. She clearly doesn’t usually ask you for money or take advantage of the friendship.\n\nNow this strong friendship is in jeopardy because she’s generous with you but you won’t return the favor in a smaller one off ask. \n\nYou wanted a transactional friendship and are going to get exactly what you asked for. Don’t expect free invitations in the future and make sure to budget accordingly - gym costs are way more than goldfish. \n\nWas saving $2.00 really worth it?",
      "id": 83,
      "comments": [
        {
          "score": 4071,
          "content": "In jeopardy? Lol, that friendship is over",
          "id": 84,
          "comments": [
            {
              "score": 2544,
              "content": "I wouldn’t be surprised if the other woman tried to savage it. The special needs community is much smaller than a typical friendship pool. Finding another child with similar age and mental abilities to yours that your child also gets along with is often hard to find.\n\nThe cynic in me thinks the OP knows that and therefore also knows she can get away with far more than with other types of friendships.",
              "id": 85,
              "comments": [
                {
                  "score": 1278,
                  "content": "That’s a really good point which makes her callous behavior that much worse, and frankly stupid. Even for her own best interests it’s stupid. You don’t ostracize friends that you also need",
                  "id": 86,
                  "comments": [
                    {
                      "score": 294,
                      "content": "I commend the other mom for speaking up and not just venmoing her the $2. Knowing me, I would’ve venmoed the $2 but avoided play dates with self centered mom in the future…but I also don’t have a special needs child",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 170,
                  "content": "Ooh. I hadn’t thought of that! You make excellent points. Thank you for expanding my understanding of the nuances here",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 63,
                  "content": "So true, I cringed at this story. My son is autistic and the rare occasions when he invites his friend out I cover everything (movie tickets/snacks etc). Not leaving anything to chance or ruining his few times out with a peer.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "As a mother to a child with special needs, yeah. It fucking sucks when you lose one of those very very few you have. The special needs community is isolating enough I cannot wrap my mind around OP not helping out another special needs family ESPECIALLY OVER TWO EFFING DOLLARS!",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "My sister has infant special needs identical twins (quite the mouthful) and they don't start nursery until September, but reading this has me very worried and I hope she never comes across such an experience. \nShe is very lucky to have some great friends around her, also a nail tech as a side hustle along with her part time job as an administrator assistant and her job as a mother and some of her clients are experienced with special needs (either have a special needs child or works with them)  so I am hopeful that even if she does, she will still have lots of support. \nThat being said, with all of the support she has, she does sometimes feel completely alone. Her Boyfriend is amazing, so is my mum and her friends. I like to think I am too. But she is rightfully scared for her babies' futures.  After reading this, I completely understand why.\n\nETA she has 2 part time jobs as well as being a mother. Her partner who also works looks after the babies when she works. My mu did 1 day a week until she got too unwell, I live too far away. They are a hard working family.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Finding another child of similar age and mental abilities that your child gets along with is damn near impossible. My partners kid is special needs and has no friends where she fits perfectly. She's left behind by some and frustrated by the capabilities and interests of others.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This is really good point, which just makes this situation more frustrating to read about. \n\nA slightly less cynical (but still not great) take would be that she’s not deliberately taking advantage of these parents and their tolerance, but that she’s been given more leeway and is just completely oblivious to how selfish she is towards other people in the community.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "If OP is given the chance to salvage it, they could apologize and maybe pay next time as a gesture of goodwill.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Flip side is it could just get OP (and sadly her daughter) ostracized from that community. With how rude OP was, I’d have nothing to do with her.",
                  "id": 95,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 393,
              "content": "My first thought!! Cheap-o mom just cost her daughter a friend over a two dollar bag of snacks. OP, good luck explaining to your daughter why she isn't allowed to play with little Sophie anymore.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 279,
              "content": "It was only worth $2, so OP and her daughter (who is blameless here) won’t miss it/s… Yta",
              "id": 97,
              "comments": [
                {
                  "score": 219,
                  "content": "The really sad this is, her daughter WILL miss it.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 134,
                      "content": "Which is why it’s so stoopid that she threw it all away for $2!",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 56,
                  "content": "Oh, her daughter will miss it. Poor kid.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 80,
              "content": "[deleted]",
              "id": 101,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Well the kids hopefully don’t absorb their mom’s problems so if they have any decency those moms will stay polite for the kids sake. Hopefully.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "You put up with a lot of crap for your kids, and that includes keeping their best friends in their life. My kid is not even special needs, but I hang around with parents that give me a headache on a weekly basis in the park, just so he can be with his best friend. But then... Those parents bring snacks for everyone, as do I.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 639,
          "content": "OP was acting as if the mom was demanding 100$ or smth. Its a fucking snack, for her kid. Helping her out is the least they could do",
          "id": 104,
          "comments": [
            {
              "score": 272,
              "content": "I think Op was also complaining about not wanting to pay $2 for a .50cent bag of crackers.\n\nDoes OP not understand that it's perfectly normal and okay to pay for mark ups, especially tiny markups like this? OP is acting like  they were being forced to buy 100 units for $2 a piece. \n\nPaying a high markup of $1.50 ONCE is not a bad thing. Sometimes you're paying for an expensive employee's salary, health plan, etc. the extra cost is the cost of the human that was hired to sell it to you.\n\nI bet you OP is the type that complains about having to pay .10 centd for a cup of mayo lol. They don't understand that business have a ton of expenses. Snack bars aren't required or expected to sell things at Costco wholesale prices. \n\nOnly smooth brains will compulsively complain about havint to pay a little extra for a tiny inexensive snack.\n\nOP is double, maybe tripple YTA",
              "id": 105,
              "comments": [
                {
                  "score": 30,
                  "content": "And, I would bet the admission fee for her daughter was more than the $2 snack.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Right? I keep telling my husband, and no matter how many times I SHOW HIM, he STILL refuses to drive 10-15 minutes to Wal-mart to get our non-quality-dependant groceries (chips, soda, etc) because it's SO MUCH CHEAPER than paying literally about a 50-70% mark-up to buy them at the other-brand grocery store two stoplights away from our house.    \n    \nNo joke, a $2-$3 bag of the biggest size Cheetos at Walmart costs almost $7 at the \"corner store\". Now multiply that by every other product you can think of.    \n   \nThe one thing I DO NOT mind going to our grocery store for though is fresh produce and things like poultry, meat, and seafood, because they are what I'd consider a \"real\" grocery store and dear Lord Wal-mart has NO SENSE of quality control or product rotation with their produce....",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I mean, I bitch about markups at theme parks and fun fairs all the time. But I'm still buying the snack for the kids I am bringing to the park. I just complain while we're eating our $12 funnel cakes. It's one thing to be bothered by the markup, but not letting the kid eat is really awful. \n\nI remember going to Disney as a teen with my friends, and I had a whole huge ass backpack filled with snacks and water because park food is pricey and (and often not vegetarian friendly). My friends who were wealthier did not, but during lines when we got hungry, I'd bust out the snacks to share, and it was such a good time together. I'd feel like such a tool if I ate while they were hungry.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 139,
              "content": "Like I will buy my *adult* friends a $2 snack literally any time, no questions asked. Let alone a hungry kid.",
              "id": 109,
              "comments": [
                {
                  "score": 7,
                  "content": "My neighbor's kid came over to ask for food bc her stepdad wouldn't let her have lunch bc she raked my yard. I gave her whatever she wanted and let her know she can come over anytime. I don't owe her, I don't have to owe her, we're supposed to be a village and care for each other. Op needs to stop being selfish with this I take care of my own attitude, it's gross.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I couldn’t believe it was $2!\n\nI was expecting it it to be $9.99 for 6 pretzel bites or $10 for a small popcorn.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 345,
          "content": "The indoor play places here are about $12. I can’t imagine balking at a $2 pack of crackers!",
          "id": 112,
          "comments": [
            {
              "score": 100,
              "content": "That was my thought! The one by us is $22 for 3 hours. Those places can be costly.",
              "id": 113,
              "comments": [
                {
                  "score": 10,
                  "content": "Dang! The one I work at is a steal compared to that. $6 for city residents and $8 for non residents and the ticket is good the whole calendar day.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "OP needs to get themselves tested for autism.  Their behavior shows a complete lack of understanding of what is considered normal social behavior",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 236,
          "content": "She may have asked just to see if it was a reciprocal relationship",
          "id": 116,
          "comments": [
            {
              "score": 33,
              "content": "Good point.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 218,
          "content": "OP strikes me as really cheap, that one friend who mooches off other members of the group.",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 78,
          "content": "Dunno. If she wanted a transactional friendship, she would have been offering snacks to make it \"even\", since the friend keeps paying her way into places. Sounds more like she's just a leech.",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Sounds like OP is the one that takes advantage of the friendship. The other mom is probably building up resentment because of it. Her asking for snacks and saying she didn't have money on her was probably her non-confrontational way of trying to even out the friendship.",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Potentially blowing up their daughter’s friendship over $2.00 adds another level to YTA too. My goodness.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "What’s really sad about this is that it’s only going to hurt her daughter.\n\nFriendships for special needs kids are often few and far between, and now her daughter is going to wonder why she doesn’t see her best friend. Really sad.",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Yep, all of this. \n\nYTA, OP.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5422,
      "content": "Yta, The friend's mother basically paid for you and your daughter to get into the play area, and you couldn't afford $2 to buy her a snack and help pay her back for letting you in for free. You are so cheap. Silly. If I was the friend's mother I would never offer you a guest pass and you would have to pay your own way from now on. And it could be a chance that there are going to be no more play dates because her mother should be very upset with you and a lot of times that affects the friendships as a girls.\n\nSo you'll take her money to let you in for free. But you couldn't take $2 to buy a snack. You need to look at your entitlement. Just a smidge",
      "id": 124,
      "comments": [
        {
          "score": 1292,
          "content": "Agreed. Even if the snacks were overpriced you have to factor in your overall costs. Like if a friend took me to a baseball game I'd be fine spending $15 on their beer because in the end I'm still \"saving\" money. \n\nAlso I know times are tough for people. I'm broke. But I'd add $2 to my already debt filled life to give a child a snack lol.",
          "id": 125,
          "comments": [
            {
              "score": 642,
              "content": "People who keep score on every single dollar and need to feel everything is *exactly* fair are so tiresome.",
              "id": 126,
              "comments": [
                {
                  "score": 239,
                  "content": "Also people who fail to see their own disproportionate score (always having your daughter paid for) and acting insulted when it’s perfectly reasonable to ask them to pick up ONE thing are tiresome.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Yeah, there are 3 of us that are close. 2 of us can be counted on to put our hand in our pockets first and the 3rd always seems to end up with a cheaper round, or not paying her way. We have started mentioning when we buy things about the other being out of pocket because it became tiresome, frustrating and felt unfair. (It wasn’t a case of income).\n\nMe and the 1st friend don’t count what we spend on each other, we figure it all evens out in the end (in fact we often fight to pay when we are together). But we have definitely started to ensure that the 3rd person is paying more equally now. \n\nHad it have just been occasionally we wouldn’t have bothered, but when people do it consistently it begins to feel like you are being used.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Ugh, I had a friend swipe me on the subway and venmo requested me the next day. She was the one who didn’t want to wait for me to load my metrocard",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Those people will end up with less. I treat my friends all the time (always pay when we go out, free rides, etc) but if they start nickel and diming me, the treats will stop.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 342,
              "content": "In my experience, people who have to take the $2 snack out of their own tight grocery budget are the first to immediately and graciously do it.",
              "id": 131,
              "comments": [
                {
                  "score": 150,
                  "content": "100% this, those who know what it's like to struggle are often the first to help when they see others in need in my experience",
                  "id": 132,
                  "comments": [
                    {
                      "score": 44,
                      "content": "To get a researcher's insight into this, read \"Nickeled and Dimed\" where the author goes undercover and learns about the culture where people live hand to mouth.  She was amazed at the generosity from the people who had nothing.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "For real. I'm on food stamps with unstable income and I wouldn't have even thought twice about scraping pennies from the bottom of my purse if need be for so very many reasons. Hungry child? No-brainer. Friend in need, also no-brainer. I would have been sad that she even had to ask, because even if you have never experienced it, BASIC EMPATHY SAYS THAT THIS IS A HUMILIATING THING TO HAVE TO ASK. \n\nUgh.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yes!! I’m working full time after a year and finally have a little money between checks. And after having random strangers help with food and gas and school fees for the past year…whatever I’ve got y’all the world can have it!",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "My best friend is broke, like really broke. She works hard and her dad offered to take her and the kids out to lunch. Then when the bill came he tried to haggle for discounts and left a 0 tip for the server. She was so embarrassed and ashamed. She had no money in her account so she went back in after digging through her purse to give the server her last $3 in change. Poor people are some of the most generous people I know.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I still remember in middle school—I tutored a classmate in math. After she got a B on her math test, her mom took us to Dairy Queen and got us Dilly bars (the cheapest thing they sold). I felt so awful because they were so poor—no reliable running water in the house. With adult eyes, I can look back and see how important it was to take me out for ice cream, however they had to scrimp to do it.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Years ago I was in a bad financial hardship and I was very depressed. I was chatting online with one of my best friends telling her how depressed I was (didn’t even imply I needed help since I knew she was barely getting by but was just venting).\n\n\n20 minutes later my door knocks and it is a food delivery. My friend spent the last $25 she had to get me some fried chicken so that I could eat and feel better.\n\n\nTill today I still remember that and tell her how I appreciate it. She says it wasn’t even a thing, but to me, last $25 in your pocket is of more value than - say - $100 out of thousands.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "Right? I paid to take my brother to an event for his birthday. Even though the ticket cost was a gift, he insisted on buying drinks because I’d paid for entry. And equally, he paid for us to go to an event as my Christmas gift. Again, I got the drinks and snacks because my entry was ‘free’.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I got free tickets to an NFL football game and I invited friends.  When we got near the stadium, I started looking for cheap parking.  One of the guys said, \"We're going to the close-in parking.  I'm paying.\"\n\nWe got to concessions and another guy asked what I was drinking.  I wouldn't normally pay $15 for a beer for myself, but he wasn't taking \"no thank you\" for an answer when he bought a round for everyone and offered a second [which I successfully declined] later in the game.\n\nThat, folks, is how you do it.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The friend’s mother didn’t BASICALLY pay she DID PAY. OP states she “prepays for 10-20 visits at a time because it’s cheaper.”",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4002,
      "content": "YTA. Why are you nickel and diming a person who isn’t doing that to you? She lets you use her membership without asking for payment but you can’t buy her a $2 snack? If money is tight then maybe you can make that clear but you went about it in such a rude way. It’s not your job to take care of her child, but it’s basic human decency to return a favor and feel a little gratitude for the free entry.",
      "id": 142,
      "comments": [
        {
          "score": 917,
          "content": "Keep in mind, it's not even a membership. Other mother is literally paying for OP's daughter to get in. I know the places she is talking about. Say it's $8 per kid to get in each time, but if you buy a 10 pass, it will only cost $60. So other mother used one of those pre-paid entrance fees on OP's kid. \n\nAnd what grown adult asks someone to Vemno $2? Especially someone who just paid for your kid to get in.\n\nOP being YTA is going to hurt her child in this lost friendship and future lost friendships because no other parent is going to want to deal with her. I'm sure this kind of pettiness and lack of acknowledgement for another's generosity goes beyond this single instance.\n\nEdit: seeing OP comments, looks like entrance fee is $15 but it's $100 for a 10 pack. So not only did other mother save her $15, other mother has paid for OP's daughter *multiple times.* But OP justifies refusing to pay $2 for a snack because other family has more money and a 2 parent household, and that's supposedly not fair that she has to give them anything in return. And it's not fair that she has to explain to her daughter about why they have more things. Ugh, I feel for OP's kid.\n\nOP, here's the thing. You started all this over literally *two dollars.* Let's ignore everything else for a second- cost of entrance fee, whether she remembered to pack snacks, etc. You have a special needs daughter who, I'm guessing, does not have a lot of friends. You are ruining her friendship over $2. Further, it seems this family has paid multiple times for your daughter to play somewhere you admittedly said you'd never take her to had you had to pay. So your daughter has an enriched life with a good friend to play with and from a family willing to pay for your daughter to enjoy what she otherwise couldn't. And yet you ignore all of this and get petty over $2. Then you come on here and by your pushback on comments, still think you are the victim. The only victim here is your daughter who now has to deal with the detrimental effects to her life because her mother ignored what was at stake for a measly $2.",
          "id": 143,
          "comments": [
            {
              "score": 126,
              "content": "When I read I was invited and since it was free I decided to take her I was already like oh boy but it just kept getting worse. So if her daughter was invited and she was expected to pay her daughter wouldn’t have gone. To not pay back a $10-15 favor with $2 is crazy and so sad for that daughter. I have a feeling she isn’t going to be invited places in the future for no fault of her own. Really sad to see. Yeah OP YTA.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Furthermore, why does OP think that she is entitled or owed free entrance to things just because her friend has a higher household income? That’s fucked. YTA, OP. Generosity is never owed to you and should always be appreciated, no matter how much expendable income the person giving to you has. And then to ask for a Venmo over $2? Unreal. Cringy and tacky and utterly lacking in class or grace.",
              "id": 145,
              "comments": [
                {
                  "score": 5,
                  "content": "Agree there. What's with people nowadays? They feel anyone with better income owes them something. It's their money, be it hard earned or inherited, and you are not owed anything at all. They had no bearing on your circumstances or choices and no responsibility towards making your life better. If they generously give something accept it with grace but don't go demanding stuff or feeling entitled to it just because they can afford it.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Also, if the money is the issue, couldnt she pack more snacks to share? I cant imagine not packing a bit extra for sharing when you are going for playdate. It's one thing there is allery or something but normally people would pack abit more for other kids.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 322,
          "content": "100% this. Don't bite the hand that feeds you.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I couldn't have phrased a better response. This exactly.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2331,
      "content": "YTA - Dude…respectfully, get over yourself. Yeah, she’s the parent so she’s responsible for her own kid. But parents are humans and can unfortunately forget things sometimes. That’s why it’s good to have friends to count on in those scenarios…I sure wish she had one, cause you ain’t it!\n\nShe’s paid for you and your daughter to do things *for free* multiple times. Springing less than 5 freaking dollars so a child wouldn’t have to go hungry wouldn’t have killed you.",
      "id": 150,
      "comments": [
        {
          "score": 315,
          "content": ">But parents are humans and can unfortunately forget things sometimes. \n\nSpot on. OP is gonna have a forgetful day at some point and need to rely on someone else. Her not having a single extra snack in her bag is gonna bite her in the ass, too. One can only hope Sohpie's mom is there for that humbling moment.",
          "id": 151,
          "comments": [
            {
              "score": 76,
              "content": "OP is going to now need to pay for her own child, and I guarantee she will act shocked over it.",
              "id": 152,
              "comments": [
                {
                  "score": 84,
                  "content": "OP said she wouldn't have taken her daughter if she had to pay the $15 entry fee. Ellie isn't going back to this playground.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "It's likely that it's already happened and will undoubtedly happen again. And I bet there was someone to help out",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "Right? Honestly even if her friend hadn't paid for her to get in, I wouldn't hesitate to buy a snack for another child.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1941,
      "content": "YTA I have read some petty posts but you take the biscuit. You're enjoying the indoor playground on someone else's dime and you get on your high horse about $2 worth of snacks!?\n\n>I’m going to have to see her at school drop off/pickup, ballet class, gymnastics class, and the girls weekly play dates so I wanted to know if I was the asshole for not buying her kid a snack.\n\nYes YTA. Don't worry tho, you and your daughter won't be receiving an invitations for play dates any time soon.",
      "id": 156,
      "comments": [
        {
          "score": 547,
          "content": "Sad that the mother’s selfish actions just ruined a friendship and playmate for her daughter.",
          "id": 157,
          "comments": [
            {
              "score": 203,
              "content": "All because of a goldfish snack.",
              "id": 158,
              "comments": [
                {
                  "score": 79,
                  "content": "There's plenty other fish in the sea...and at the snack bar.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "My thoughts exactly you just blew up a potential life long friendship for your daughter over $2.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 220,
          "content": "Agreed.  Read her comments.  She talks about how they make more money than her so that's why she can be entitled over $2.  She's a piece of work \n\nI feel bad for her daughter.",
          "id": 161,
          "comments": [
            {
              "score": 73,
              "content": "She's sounds delightful. Sadly, it's her daughter that will pay the price.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "Omg her comments are just...she really thinks she's entitled to this woman's money for some reason. I feel bad for these girls. They probably already have an extremely limited social circle.",
              "id": 163,
              "comments": [
                {
                  "score": 13,
                  "content": "She sounds bitter because the other mom has a husband for additional support and OP doesn’t honestly.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Grrr. I had a \"friend\" like that. I enjoyed her company and was very generous with paying her way because I wanted her company. That said, I finally began to realize I was a piggy bank actually included in her house hold budgeting.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Both families apparently make enough money for multiple activities like gymnastics, so $2 shouldn't break the bank for either.",
              "id": 166,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Yet she's still paying for ballet and gymnastics, so she's not actually poor, just cheap",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Yeah and I'm gonna guess those playdates are not gonna happen weekly anymore.  Jeez OP YTA",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "The full needs to go out to Costco or wherever at 5 big box of the prepackaged goldfish and give it to the lady at the next beating. And apologize. Say some bullshit lied about how they're just being stupid didn't think it through or how's having a bad day and hopefully a big 50 pack of goldfish makes her life better. Because you don't fuck over a mom who is being nice to your kid for $2. Now your Specialty's daughter is not going to have as many opportunities to play with her special needs best friend.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Don’t give her a biscuit. She won’t give you anything back.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1146,
      "content": "YTA she paid for your kid at the playground. Weird how you know its cheaper to pay upfront",
      "id": 171,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 773,
      "content": "YTA.  And all over $2.  Extremely petty, I feel like there’s more going on here you’re not sharing.  Were you already irritated with friends mom for some reason?",
      "id": 172,
      "comments": [
        {
          "score": 14,
          "content": "op responded but some people are really like this, for no reason whatsoever. just pure pettiness and ungratefulness.",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 757,
      "content": "YTA\n\nSo she regularly lets you use her memberships and stuff for things, but a $2 bag of goldfish is too much. Yes, she should have done X Y Z ahead of time but people forget things, it happens. You could have just done her the solid.\n\nDo you *ever* spend money on her kid? Ever let them use a service you already pay for? If not you're mega the AH.\n\nAll this over $2, what are you? 12?",
      "id": 174,
      "comments": [
        {
          "score": 14,
          "content": "OP is not 12, she’s just a MASSIVE AH",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "But you don’t get it! It was a $.50 bag of goldfish being sold for $2, OP clearly had a moral obligation to not give in to those capitalist pigs at the playground /s",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 514,
      "content": "YTA  100% she spotted your daughter for the entry fee to the indoor playground and you can't spare $2 for a pack of goldfish? Do you hear yourself? You also jeopardized your daughter's friendship with this girl. I really hope this is a fake story because it's hard to believe anyone can be this dense.",
      "id": 177,
      "comments": [
        {
          "score": 17,
          "content": "Also, this could have been a good opportunity to teach her daughter about sharing. They could have split the snack. Neither child is going to starve from one meal to the next.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}