{
  "post content": "... and apparently starting WWIII.\n\nMy husband and his brother go back and forth every Christmas about this gift list for their kids. The kids make the lists and we are expected to buy their presents off this list, and never anything else. We enjoy picking unique gifts we think would be fun and different so... sometimes we do.\n\nLast year they became very belligerent when they thought we hadn't bought items off the list in a timely (for them) manner and insinuated we would ruin their Christmas.\n\nThis year we decided to buy a gift NOT on the list (one niece had only gift cards left) \nand brother stated that they previewed the gift, an age appropriate game from an educational site and stated \"this does not play to her strengths, we will return in and give her a replacement\". He said it gives her anxiety to get something that isn't on her list.\n\nMy husband and I were a upset by this. 50% by the fact that they didnt give it to her, and 50% by the fact that he told us he wasnt going to give it to her. I mean as parents they can do whatever they want with gifts but I believe you shouldnt make the gift giver feel badly.\n\nMy husbad replied to his brother that the message was unkind and we were sorry to hear it and disappointed she didnt like it (we thought they had given her the gift) but in the future just say something polite if you hate our gifts. \n\nBrother became incensed and told us if via a long scathing, condescending reply, saying that because we didn't consider the neices feelings on the matter we are contributing to \"subjugating them (the neices) as female children \" and they (brother and SIL)  will be deeply offended if our children don't enjoy the archaeological texts they bought our 16 month old or the my little pony outfits they bought our 17 year old. (I assume this is sarcasm, not their real gifts).\n\nHowever the nieces are caught in the middle. My husband cut off contact with his brother at this point and blocked his texts and calls. Said only cards for all kids from now on. But we want to have a relationship with the nieces, maybe not so much with brother. \n It feels like a relationship-destroying act(s). \n\nBut are we just the a**holes because we should have just sucked it up and bought the gift cards off the neices gift list?",
  "id": 1,
  "comments": [
    {
      "score": 126,
      "content": "ESH. It sounds like your BIL is being annoying, controlling and ungrateful. Ideally, he would just appreciate any gift you got you nieces. However, if you intend to get them presents and he's made it clear that it's important to them to get specific presents from a list...why not just do that? It sounds like you and your husband got into a bit of a battle of wills with him that just caused unnecessary drama.",
      "id": 2,
      "comments": [
        {
          "score": 41,
          "content": "Because that isn’t really how gift giving works.  If someone ASKS for a list or gift ideas, fine.  But thoughtfully selected gifts shouldn’t be sneered at.",
          "id": 3,
          "comments": [
            {
              "score": 35,
              "content": "Honestly, it reminds me of my grandmother's favorite saying: Do you want to be right or do you want to be happy? Absolutely, any gift should be accepted with the spirit with which it is given. But in this case it's not going to happen. So OP and her husband can continue to exercise their right to give any gift they want, or they can take a fairly minor step to keep the peace. Personally I would just keep the peace even if I didn't fully understand or agree with the request.",
              "id": 4,
              "comments": [
                {
                  "score": 23,
                  "content": "I would just stop exchanging gifts.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That's not a terrible idea either.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "But if you are given a list, and you get something that it is not on the list, isn't that totally disregarding the wishes of the recipient? Gift giving is supposed to be about the recipient. If they ask for something on the list, get them something on the list, if you ask me. Getting someone a gift on a list is a minor ask, and it takes out thinking about what to give as well.",
              "id": 7,
              "comments": [
                {
                  "score": -6,
                  "content": "It depends.  My niece’s list last year was entirely Barbie related items and I will never buy anything Barbie related ever.  \n\nIt’s also not reasonable to demand gift cards, because it’s essentially the same thing as demanding cash.  Rude.",
                  "id": 8,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I see your point. It has become a battle of wills at this point but I think the worse sin is treating family so poorly over an unwanted gift. That is what is so upsetting.",
          "id": 9,
          "comments": [
            {
              "score": 16,
              "content": "I totally understand what you're saying. I don't think the \"bad\" behavior is equivalent on both sides - it does sound like BIL is doing more to cause the tension. I just wonder if something is going on in the family that is making him so nutty over this issue.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I agree. \n\nThat said, if your BIL and nieces really didn't like the gifts, they have/had the right to return the gifts and exchange for what they do want. People do that all the time (and customer service personnel at retail establishments HATE this, but it's been happening for at least 50 years).",
              "id": 11,
              "comments": [
                {
                  "score": 6,
                  "content": "They did not give niece the gift at all but returned it before she recieved it and gave her a gift card instead\n\nIn case redditors were wondering if it was an age-appropriate gift, it was a game rated for 8-12 year olds (recipient was an 8 year old) from Fat Brain Toys - an educational website",
                  "id": 12,
                  "comments": [
                    {
                      "score": 15,
                      "content": "You know what? There is no rule that says you MUST give a physical gift, or a gift card, to niblings for Christmas. If this has become the source of drama, but if you also want to do something to recognize your nieces, you might open a couple of savings accounts, add the cost of a gift to the accounts annually, and the Christmas following the year the younger niece turns 18 you can turn the accounts over to your nieces, who will have a lot of use for the money then.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 56,
      "content": "INFO: Do you know what your niece has anxiety around receiving gifts off her list? I only ask because I have a very distinct memory of my parents having to set similar boundaries with my grandparents for my sister’s gifts. She was a tomboy and hated dolls, etc. My grandmother would never buy my sister things off her list and she was left opening multiple gifts that she hated and made my sister feel left out because the rest of us were given things that matched our interests.",
      "id": 14,
      "comments": [
        {
          "score": 23,
          "content": "One of my nephews has autism, and the stress of unknown presents used to ruin Christmas for him & his family. We solved it by letting him help pick out his own presents from around 7/8 when sister figured it out. \n\nOr I guess we could have forced “unique and imaginative” presents on him & made him miserable. /s\n\nYTA.",
          "id": 15,
          "comments": [
            {
              "score": 14,
              "content": "But in your situation everyone knew the reasoning. If someone gave me a wish list and the only thing left was gift cards, I'd pick something else too. Sounds like they didn't know this would cause anxiety and that's really not that common among kids so why would they assume? \n\nI love that unique and imaginative are bad words to you. Way to throw a kind gesture in someone's face. OP is NTA but you might be.",
              "id": 16,
              "comments": [
                {
                  "score": 5,
                  "content": "I was quoting OP. \n\nThey used it in the context of being asked to do one thing, but deciding (incorrectly and without discussion) that they knew better than the kid’s parents - so yeah, in that context I feel sarcastic about her wording choices. :-)",
                  "id": 17,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I'm aware. I find your sarcasm misguided.\n\nUsually gift giving isn't following a list of demands. If there is additional information needed before an 8 year old can graciously accept a gift that the giver put thought into, then they need to give that information *in advance* or say no gifts.\n\nHow entitled to think that picking an age appropriate gift when there was nothing left on the list is a bad thing. I would be embarrassed if I acted any way but grateful and appreciative for their effort. It's not like they picked out a rattle or a paintball gun.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 36,
      "content": "NTA. Just stop buying them gifts all together. If they’re going to be that picky, ungrateful and bratty then there’s no reason to continue doing it. The entitlement and audacity of your husband’s family is beyond ridiculous.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 27,
      "content": "ESH - BIL shouldn’t have reacted the way he did, you guys should have made sure the gift was okay. Some parents are weird about gifts being given to their kids. Their reasons why they want gifts to be done that way is likely bizarre but it’s their reason and you can’t really force people to parent differently. Granted they sound pretty entitled and with gifting rules that like their kids probably are/will be as well. You can also choose to not give gifts at all in the future and only give a gift card.\n\nMy husband and I are kind of strict about our son when it comes to toys but our reason is because my son has diagnosed developmental delays and disabilities. Our restrictions are based on his need for toys made for younger kids with less small (choking hazard) parts and that are made more durable. However, the occasions when people get him toys we know he shouldn’t have just yet we put them away until he is ready for them. We never tell the person who gave it to him things like “stick to the list we’re returning/exchanging that” either because we don’t believe in being disrespectful about things that were given as gifts with good intention.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "I’ll go with ESH, because their reliance on your gifts and not having them somehow ‘ruining their Christmas’ is absolutely bizarre and entitled. They’re definitely being AH\n\nAt the same time, their behaviour is so regimented that I wonder if we’re missing details. If the nieces really do develop anxiety over unexpected gifts, that sounds like they have their own difficulties with mental health, or possibly neurodivergence.\n\nI know I hated the stereotypical ‘gifts for girls’ when I was a child, such as scented soaps, ‘jewelry’, baby dolls etc. Maybe the nieces feel like their opinions are ignored when they don’t get what they asked for? There feels like there is info missing from this, but I don’t know what it is.\n\nAlso, it’s not your brother in law who decided to end everything. That was your husband. It sounds like your husband and him need to set some boundaries. \n\nRather than cutting him off, maybe simply state that you have decided it will be best to only do cards between families from now on because of how challenging the situation has been?",
      "id": 21,
      "comments": [
        {
          "score": -6,
          "content": "Yes I think maybe one niece is maybe neurodivergent but BIL hasnt explicitly said that.",
          "id": 22,
          "comments": [
            {
              "score": 11,
              "content": "In that case I suggest you research neurodivergency. There are many different kinds, but I’m thinking of the possibility of a full meltdown over something unexpected- crying, sobbing, stimming (to try to regulate), but ultimately suffering. \n\nIf that’s the case then it actually would ruin Christmas for that child. The BIL controlling to prevent that would make sense, and he probably incorrectly assumes you know this would happen. \n\nThat would explain the rage, because I would be upset if I thought someone was deliberately trying to make my child suffer. I feel like this could all be huge miscommunication between ND and NT that is causing trauma. That’s an unusual possibility, but it is a possibility.\n\nI think the only way to salvage this would be to communicate more effectively. Maybe research neurodivergent communication styles",
              "id": 23,
              "comments": [
                {
                  "score": -13,
                  "content": "I suppose its possible, but really unlikely. When they have visited us before she is a slightly shy but otherwise none of the behaviors you describe. She is in mainstream schooling, and acts and participates in the local children's theater.  When they have visited we did all sorts of activities and other than not wanting to hike far I didnt recognize any thing different from other kids.  If she is ND, it doesnt look like what you describe at all.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 33,
                      "content": "ND adult lady here. Female children are typically given more guidance on how to appear and behave in public than male children. \"Oh honey, you should smile!\" \"Ladies sit/stand *this* way.\" And a lot of us adapt to fit what is expected of us. It's called \"masking.\" It's a skill some of us develope that has a lot of overlap with theater/acting. Over time it becomes exhausting. \n\n\"She doesn't look ND\" is pretty meaningless here.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Being neurodivergent isn’t necessarily visible at all to others. Most neurodivergent people mask their behaviour around others so they don’t get abused or harmed, especially females. \n\nND people can also put off showing breakdowns around others and then have them in private or when they reach a certain point or problem. It’s very common for other to not know a person is neurodivergent, but just maybe think they are ‘quirky’ or ‘weird’ sometimes. When a meltdown occurs it’s often the last straw on the camel’s back- and nobody else thinks of the things that are happening as straws",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I wrote a response further up about my autistic nephew, before I saw this part of the comments. \n\nTypically their behaviour can be a lot worse at home, leaving family to suffer.  Just because you’re not seeing the extreme, low-functioning behaviour you believe would prove autism, doesn’t mean it’s not there. \n\nMy nephew is pretty high functioning, in large part because my sister has fought for his world to make sense to him, as far as that can be done. Unnecessary stresses are removed - because why wouldn’t they be.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Female children are so often underdiagnosed and misunderstood and it sounds like you're guilty of that here. If her parents have identified something that helps her (having a specific list) and it's no trouble for you to adhere to it (buying something from the specific list), it feels petty and unkind to cause drama because *you personally* don't get the fuss.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "YTA. There are wish lists for a reason and my neurodivergent child would have a major meltdown if he got a gift that wasnt on his list",
      "id": 29,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "NTA.  Brother sounds like a entitled little shit.",
      "id": 30,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA those kids and the parents are super entitled lol, you aren't obliged to buy anyone a gift",
      "id": 31,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA it's a wish list, not a demands list. But if you want a relationship with the kids I would probably just meet in the middle and get them a gift card every year from now on",
      "id": 32,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA. This list seems to be making them entitled spoiled brats. What happened to having a surprise gift at christmas. The brother sound out of touch with the world.\n\nThe list needs to stop.",
      "id": 33,
      "comments": [],
      "relation": "Support"
    }
  ]
}