{
  "post content": "(Sorry if my formatting sucks & its kind of long)\n\nSo, in January I(F23) moved in with a close friend(F42) & her son(20) because she offered better & cheaper rent. \n\nOne of our issues we have & found a comprise to was having guests over after she went to bed because even though we were quiet she still didn't like us walking past her bedroom & opening the front door because it disrupts her sleep. The comprise was that she would close her bedroom door & I would turn down the alert system so it didn't beep everytime we would open the door. \n\nSo this is where I might be TA: My best friend(M28) got off work & came over at 2AM. I know its late but we both work nights & it was my day off & I wanted to see him for an hour or so. Plus, its only two nights a week that he comes over that late. We had only been hanging out for about 30 minutes when my roommate texted me to tell me something a long the lines of \"I thought we agreed no guests past 10PM\" which no we didn't agree to that at all. I didn't reply & sent my BF home. Then around 9AM she texted me & told she decided no guests over past 10. I went & asked her son if me & my BF were loud last night & he said no; so I left it at that & went to bed. Now, I'm not going to lie I have a bit of a temper sometimes so I knew not to reply or have a discussion with her about anything until I knew I could be calm and composed. \n\nWhen I was walking to my room tonight while on the phone with my BF & she stopped me & said we needed to talk. I said I was on the phone & wanted to sit down & eat my dinner. She said too bad & that we were going to talk anyways. She was visibly angry & I knew neither one of us were in the right state of mind to have a calm & productive conversation so I said we can tomorrow but not right now.\n\nShe started ripping into me & followed me into my room to continue telling me it was disrespectful of me to talk to my BF about me & hers issues & that I was disrespectful for having him over the night before and just laying it into me, honestly. I just kept telling her she needs to walk away, she needs to leave my room, & just leave me alone but she said its her house & she can do whatever the hell she wants. I let my anger get the best of me & said I didn't care about her or her sleep & that she needs to walk away or I would call the police. She started yelling even more but left my room. I went back to the phone & started angry crying to my BF. \n\nEven though he saw where I was coming from he said I shouldn't have lost my temper at the end & that I shouldn't have threaten to call the police. He basically said it was an asshole move & it did make me look like I didn't care about her. My question isn't just was I an asshole for saying that stuff was I also being the asshole for having my BF over late at night even though me & her agreed that it was ok?",
  "id": 1,
  "comments": [
    {
      "score": 46,
      "content": "ESH I would say.\n\nYour friend sucks for suddenly deciding there is a 10pm curfew without discussion. However it is her home so she is within her rights to do this. \n\nYou suck for inviting house guests over at 2am. Even if you weren’t noisy, I wouldn’t want a stranger entering my home in the middle of the night when everyone else is asleep without even being asked.",
      "id": 2,
      "comments": [
        {
          "score": 27,
          "content": "Ehhhhhhh I don’t know. If you rent out a room, no matter your relationship with the tenant, you’ve agreed to having a tenant with their own schedule and rights to conscious socialization. That’s a pretty fine line of, this is my house and my rules but I need your rent check for the space I’ve agreed is yours.",
          "id": 3,
          "comments": [
            {
              "score": 10,
              "content": "Yeah, I also kinda feel like she is being a hypocrite, too. Because her boyfriend comes over during the week at like 1AM. I was going to to put that in the post but character limit and all.",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "You're right; except he always comes over at this time on this specific night and she is very aware of this. That's what makes me so upset and confused tbh :// like she knew he was coming over and she is very good friends with him, as well.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "NTA\n\nWell first things first, I feel like your biggest mistake here was moving in with someone who is almost 20 years older than you with a child around your age. I feel as if she’s grouping you in with her child in her mind. So, when you do something she wouldn’t let her child do it’s an issue for her. I’m sure she doesn’t let her son have guests over at 2am. That is probably a big no no for him, so she’s applying that same rule to you. It’s hard living with people that are older than you because you guys don’t live the same life. You’re not in the same stage of life. She’s been there done that stage that you’re going through. The dating, I just want to see you, I just wanna spend time with you stage. The cupcaking lovey dovey stage. So, she isn’t going to relate to you or see where you are coming from. I would just sit down and have a conversation with her and let her see where you are really coming from and explain to her that you are not her child, you are her roommate who pays to live here and you should feel comfortable to do what you want in your home as long as you aren’t causing a disturbance.",
      "id": 6,
      "comments": [
        {
          "score": 2,
          "content": "Funny thing is, me and her already had that discussion almost exactly a week ago. Though, I have a temper issue sometimes, I feel like I am really good at communicating my thoughts and feelings. I thought everything was cleared up until last night. Also, he's my best friend not my boyfriend so we don't exactly feel the need to see each other all the time just once or twice a week when our schedules match up.",
          "id": 7,
          "comments": [
            {
              "score": 0,
              "content": "Oh gosh I’m sorry lol, I saw “BF” and thought you meant boyfriend haha. But, yeah you’re just gonna have to bite the bullet here and compromise and not have guests over at 2am since you have already had this conversation and she isn’t budging. Also 2am is really late and I personally wouldn’t like it either, but I have a hard time saying you are in the wrong because those rules were never put on the table. So, maybe you guys as a group need to have a house meeting and write a list of rules together.",
              "id": 8,
              "comments": [
                {
                  "score": 2,
                  "content": "Its ok haha! A lot of people assume we are a couple. Yeah, we sat down before I moved in and explained that because me and him work nights we can only ever see each other at night or really late in the evenings (like 6 or 7) and she said it was fine! She was fine with it before this COVID stuff started happening (she works in the medical field) so we decided he would only come over once a week until things calm down. The more I think about it now the more I realize it is probably just stress from work making her this upset, but I still feel like the way she went about it was overly aggressive. But, I'm too emotionally involved obvi so thats why I thought I'd ask Reddit lol",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NtA\n\nShes a control freak and sees you as a subordinate, not a peer.    I know this type, I've done the roommate thing many times.  This might not be the best place for you.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH. You (mildly) because of how you reacted and her mainly due to the fact she seemingly did not make you sign some sort of contract? She needs to sit down and write one up with everything that’s acceptable and unacceptable. She can’t just make rules up as she goes as you are her tenant, not her child. Generally the landlord provides renters with a contract that they must agree to  (no smoking, no doing laundry on weekends, no guests after 10pm, etc.). She set both of you up for failure by not doing that.",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Nta \nYou are renting and paying so you have the right to bring over however you want \nIf she can bring her bf at 1am you can bring your best friend \nShe is a massive hypocrite and I don't think this is going to change \nIf you are in a good financial spot I would suggest you to find another place to rent",
      "id": 12,
      "comments": [
        {
          "score": 1,
          "content": "Wish I could but I'm in college and work retail in a small-ish town. Not a lot of options. I was doing pretty ok at the last place I lived in, but she asked me to move in because of her financial struggles. Now if I try to find a new place to live (especially while my town is in quarantine) its going to be hard as fuck. Like I either stay here and never get to see my BF who is basically my only family (seeing mine disowned me for being gay and trans) or idk seeing there really is no affordable options in my town.",
          "id": 13,
          "comments": [
            {
              "score": 2,
              "content": "I'm so sorry that you had to go through all that \nBut not only are you doing her a favor of renting the place she also treats you like a child \nShe is a massive AH \nTry to use to your advantage that if she can't accept the 2 weekly visits you will find somewhere else to live \nMaybe this will put her in her place \nI wish the best of luck and I really hope that you will find a solution that works the best for you",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. You have worked to compromise, and you have tenancy rights after loving with someone a certain time, especially considering that you pay money. The people telling you her house her rules are in the wrong and are giving bad advice and/or venting their own frustrations. They also appear to have an inability to empathise with someone who works shifts.\n\nCalling the police was not an asshole move  you have rights and she was violating them.\n\nI recomend you gather what money you can and move out, you shouldnt have to tolerate the disrespect this 'friend' has given you.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YTA for having your bf over late at night while she was trying to sleep.  You knew she didn’t like it and did it anyway. \n\nYour attitude is like a petulant teenager arguing with your parents. \n\nI’m not sure why she’d let you stay there with the way you’re acting, you’re not her child and she doesn’t owe you anything.",
      "id": 16,
      "comments": [
        {
          "score": 2,
          "content": "You're very much right. I am not her child. That is why putting a curfew is ridiculous. My BF isn't a loud person neither am I. We walk to my room quietly, put in dual headphones, and watch a movie. If we really need to talk we go for a drive and I come home alone after to avoid making too much noise. This is one of the only issues we have had so far and we were communicating about it in a very productive way until yesterday. She made it clear that we could work it out with a good compromise where both our needs were met. She communicated that it wasn't a huge issue because it was only once or twice a week and that she knew we were doing our best to be as quiet as possible. That is why I am still confused as to why she came at with such aggressive behavior and only a week after we had worked out a compromise.",
          "id": 17,
          "comments": [
            {
              "score": 3,
              "content": "Apparently you didn’t understand the agreement because she thought you agreed to no visitors after 10 pm.  She has a right to know who’s in her home while she’s sleeping. \n\nAnd asking her son if you were loud was not helpful. The argument was between you, the tenant and her, the homeowner. You acted like a child by trying to get her son on your side.",
              "id": 18,
              "comments": [
                {
                  "score": 3,
                  "content": "Sge knew who was coming over and when. Plus, my BF had been there when me and her came to our compromise and she said word-for-word he was allowed over that late as long as we followed certain rules. Which were close her door before I let him in and turn off the alarm so it didn't beep when I opened the door. All of which I did. So, no idea why she said what she last night. Oh, I wasn't trying to get him on my side. I wanted to make sure we weren't loud because if we had been I would have apologized immediately and tried to see if we could figure something out or just not have my BF come over for a while until we found a good solution. I wouldn't put her son in that position, but maybe I did without thinking about it.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "You’ve got to know having someone over at 2am while someone is trying to sleep is not very considerate.",
              "id": 20,
              "comments": [
                {
                  "score": 2,
                  "content": "You're right again. But, she is being a bit of a hypocrite seeing her boyfriend comes over that late during the week as well. So that is where its just makes me upset because I am not allowed guest and am treated like a child, but she can have her boyfriend over at 1AM to 7AM? Like I know I come off whiny while I say that, but I am tired and slightly fed up with her not being able to make up her mind and being so hypocritical.",
                  "id": 21,
                  "comments": [
                    {
                      "score": -1,
                      "content": "It’s her house, she can do what she wants.  When you live in someone else’s home, you need to follow their rules.\n\nAnd show a little respect.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n(Sorry if my formatting sucks & its kind of long)\n\nSo, in January I(F23) moved in with a close friend(F42) & her son(20) because she offered better & cheaper rent. \n\nOne of our issues we have & found a comprise to was having guests over after she went to bed because even though we were quiet she still didn't like us walking past her bedroom & opening the front door because it disrupts her sleep. The comprise was that she would close her bedroom door & I would turn down the alert system so it didn't beep everytime we would open the door. \n\nSo this is where I might be TA: My best friend(M28) got off work & came over at 2AM. I know its late but we both work nights & it was my day off & I wanted to see him for an hour or so. Plus, its only two nights a week that he comes over that late. We had only been hanging out for about 30 minutes when my roommate texted me to tell me something a long the lines of \"I thought we agreed no guests past 10PM\" which no we didn't agree to that at all. I didn't reply & sent my BF home. Then around 9AM she texted me & told she decided no guests over past 10. I went & asked her son if me & my BF were loud last night & he said no; so I left it at that & went to bed. Now, I'm not going to lie I have a bit of a temper sometimes so I knew not to reply or have a discussion with her about anything until I knew I could be calm and composed. \n\nWhen I was walking to my room tonight while on the phone with my BF & she stopped me & said we needed to talk. I said I was on the phone & wanted to sit down & eat my dinner. She said too bad & that we were going to talk anyways. She was visibly angry & I knew neither one of us were in the right state of mind to have a calm & productive conversation so I said we can tomorrow but not right now.\n\nShe started ripping into me & followed me into my room to continue telling me it was disrespectful of me to talk to my BF about me & hers issues & that I was disrespectful for having him over the night before and just laying it into me, honestly. I just kept telling her she needs to walk away, she needs to leave my room, & just leave me alone but she said its her house & she can do whatever the hell she wants. I let my anger get the best of me & said I didn't care about her or her sleep & that she needs to walk away or I would call the police. She started yelling even more but left my room. I went back to the phone & started angry crying to my BF. \n\nEven though he saw where I was coming from he said I shouldn't have lost my temper at the end & that I shouldn't have threaten to call the police. He basically said it was an asshole move & it did make me look like I didn't care about her. My question isn't just was I an asshole for saying that stuff was I also being the asshole for having my BF over late at night even though me & her agreed that it was ok?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 24,
      "comments": [],
      "relation": "No"
    },
    {
      "score": -1,
      "content": "YTA\n\nIf this were a flat share, I'd say ESH. Maybe. \n\nBut you are a lodger in her home. Your refusal to talk or engage with her over text or in person, despite her angry attitude is immature and disrespectful in itself to your landlord. She may be your friend, but this is a different relationship issue that is professional. \n\nAnd 2am? That's insane. And also I wouldn't want a stranger I've not met in my home that late at night. It may work for your schedule but the many don't have that and for me it would make me on edge waking up to that. And why would you call the police? Wtf?",
      "id": 25,
      "comments": [
        {
          "score": 0,
          "content": "The reason for not immediately responding is because I have temper issues I am working on with a therapist and find that responding when I get upset usually just makes things worse. I wasn't just ignoring because I wanted to be rude I was trying to work through my emotions before I talked it out with her. All of this she knows. She, also, knows my BF because they are good friends, as well. Me and my BF both work nights so we only see each other once or twice a week after he gets off work. The reason for the police thing is because she wouldn't disengage herself and leave my room. She was legit blocking me from closing my door. I asked her to leave multiple times and she just kept telling me its her house she doesn't need to leave my room. I know there is alot I should or shouldn't have done, but I did try my best to try to stay calm and de-escalate the situation.",
          "id": 26,
          "comments": [
            {
              "score": 3,
              "content": "Fair enough about the existing relationship between her and your boyfriend.\n\nThat said, your anger issues aren't as combustible in person compared to text are they? You could of told her, 'can we discuss this at X time tomorrow? Hopefully we can clear this up'. It's clear that her house isn't a good option for you and your lifestyle as she has a son, and doesn't work the same hours as you or your boyfriend. Why don't you go over to your boyfriend's instead? No guests after 10pm is perfectly reasonable in NY opinion. \n\nIt is her home, and as a lodger you have less rights compared to an actual tenant. Unfortunately. But that's what you get with cheaper rent and living with a landlord.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}