{
  "post content": "I live in the country, awful area for wifi and I've got seven siblings doing online school right now, 3 have special education needs. I'm a secondary school student so I change calls multiple times a day. I've been having issues recently since some line went down after a big wind. \n\nIf there's too many of us on a call the wifi will crash entirely so I took to asking my teachers to record the lesson and posting it on the team so I can keep on top of the work, my sister is doing the same so the younger ones can concentrate on theirs in real time. I'm pretty much a straight A student, and don't need a leaving cert for what I want to do after school (only a few months left in school as is) so I can afford to do this. \n\nI got a message off my principal today, asking me why i haven't been engaging in certain class and i explained my issue and what i asked the teachers to do and all were doing it. He said that he understands but I should rotate with my siblings so I can attend classes. I said my solution works perfectly fine for us and that I've not been falling behind. I'm back in real school Monday anyways so it's not an issue.\n\nHe said maybe look at getting better wifi in, which i said isnt possible right now and he kept saying how I need to fine a better solution. I said \"Sir, I understand you want me to attend these classes but I can't pull fiber optic broadband out of my hole (aka ass) just for the next 3 days\". Anyways he called my mom and she thinks I'm an asshole for disrespecting him so much. AITA?\n\nEDIT: 6 to 7 because I forgot one\n\nEdit: she/her\n\nEdit 3: Lads, I've something to confess. Níl mé 100% duine Gaeilge, tá mo aithar Prod salach ón An Tuaisceart",
  "id": 1,
  "comments": [
    {
      "score": 9565,
      "content": "NTA. If you could pull fiber optic broadband out of your ass, you wouldnt need to go to school.",
      "id": 2,
      "comments": [
        {
          "score": 1010,
          "content": "Hahahaha got my upvote",
          "id": 3,
          "comments": [
            {
              "score": 837,
              "content": "Mine too.  OP you were disrespectful but NTA. You sound extremely mature and responsible and your headmaster sounds pedantic and not able to see the big picture.",
              "id": 4,
              "comments": [
                {
                  "score": 499,
                  "content": "Headmaster wasn't deserving of respect. OP was being responsible about keeping up with classes while also helping their siblings-- they should be rewarded for that, not reprimanded.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 159,
                      "content": "NTA.\n\nHeadmaster was embarrassed at being set straight by a teenager, so he called your mom to try to get you in trouble for being “disrespectful”. He’s the asshole. What a pathetic excuse for a man.\n\nI’m glad he won’t be able to affect your future, OP, because this is the type of person that could be vindictive.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I totally agree with you, but she could have just said \"nowhere\" instead of \"my hole\".  She is the one who is right, he is the one who is wrong. So why undermine her whole message by delivering it in a \"disrespectful\" way? we might just not like the word \"disrespectful\" in this context.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 263,
                  "content": "OP was respectful at first until the headmaster kept pushing them to “find a better solution” in which they already had. I agree NTA but I feel that there wasn’t much else that could’ve been said as to why they can’t get a better connection.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 293,
                      "content": "And also, can we just recognize that headmaster is talking to a teenager? If there is a \\*real\\* issue with the learning infrastructure, headmaster should full stop be talking to OP's parent(s). NTA.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 74,
                      "content": "When this sort of \"impossible demand\" happens (usually from a boss) my go to is, \"I agree the situation is not ideal, but this is the best solution I have been able to come up with that allows us all to learn and pass our classes. How do you suggest I handle this issue without compromising the educations of my siblings who require real time interaction to learn? I am happy to consider any solutions you might have.\"\n\nHowever, this is coming from a middle aged adult with FAR more life experience dealing with idiots who feel the power given them means they can demand the impossible and then blame whoever isn't able to make it possible. \n\nNTA, you did your best.  You were a bit cheeky but he didn't complain because he was outraged by your horrible \"rudeness\", he got caught being an idiot (by a student) was chastised and embarrassed so wanted you to be punished. I think you taught him and important lesson and you should be proud of yourself (even if you don't tell your mom so).",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 85,
                  "content": ">my principal today, asking me why i haven't been engaging in certain class and i explained my issue and what i asked the teachers to do and all were doing it. He said that he understands but I should rotate with my siblings so I can attend classes. I said my solution works perfectly fine for us and that I've not been falling behind. I'm back in real school Monday anyways so it's not an issue.  \n>  \n>He said maybe look at getting better wifi in, which i said isnt possible right now and he kept saying how I need to fine a better solution. I said \"Sir, I understand you want me to attend these classes but I can't pull fiber optic broadband out of my hole (aka ass) just for the next 3 days\". Anyways he called my mom and she thinks I'm an asshole for disrespecting him so much. AITA?\n\nNTA, it sounds like you tried to be Reasonable, and he escalated to Unreasonable. Disrespectful, yes, so maybe an opportunity to work on word choice.... but you made my day with that comment :-)",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Just because OP said \"asshole\" doesn't mean it was disrespectful. It's honestly just a fact and it matches the ridiculousness of the headmaster's disrespectful requests.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "LMAO.\n\nOP, you could've handled it better, but he was acting like a dick, and sometimes, harshness is needed. \n\nNTA.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I think this is a brilliant idea for the next generation of Spiderman films.",
          "id": 14,
          "comments": [
            {
              "score": 16,
              "content": "Spiderman Spiderman he can do anything that Greenlight can\nThe friendly your neighborhood does have service Spiderman",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "OP would be fiber-optic goose!",
          "id": 16,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "you'd need to go to the hospital, that is real sharp and fractures so easily, optic fiber is 1/15 the size of a human hair (5 microns)",
          "id": 17,
          "comments": [
            {
              "score": 11,
              "content": "Omg. I thought it was much thicker. It's barely visible then.",
              "id": 18,
              "comments": [
                {
                  "score": 18,
                  "content": "The reason the wire is so thick is so the cable does not snap, I've only made a few cables and just the slightest imperfection in polishing the end can lead to the entire thing not working, it's a very delicate process. You can see the fiber in the light though, but if you snap a piece off, good luck finding it, it's like spotting a spec of dust.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Freaky. In a Zompocalypse the zombies would be too irrational to protect the cables. People working with servers and crap would get turned and mess up the whole internet!",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Most of what you see is cladding to protect the fiber.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Like a beautiful butterfly that needs protecting. And OP's yanking it out of his butt. 😄",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Agreed, but why did the principal call OP first and not the parents? You know the ones who own the house and can actively change things that their kids cant?",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Jumping on the top comment to say this. \n\nSo let me get this straight. He wants you to break covid law and leave your house and go to the store for something that is not a necessity, just for the sole purpose of attending classes for 3 days? NTA\n\nEDIT: Also this is for something that you already solved just because they want you to conform to their will as opposed to doing what works for you and your family. This principle needs to step back and think before encouraging someone to break the law just so he can control you",
          "id": 24,
          "comments": [
            {
              "score": 67,
              "content": "Idk what I'm supposed to go to the shop for, because getting better Internet just isnt going to happen to matter what kind of fancy router I have or what it says it can do because it'll work the exact same",
              "id": 25,
              "comments": [
                {
                  "score": -12,
                  "content": "For the optical cables",
                  "id": 26,
                  "comments": [
                    {
                      "score": 19,
                      "content": "lmao that wont work, there's no point spending money because it  w o n t  w o r k  . How many damn times do i have to say i live in the middle of nowhere",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I would personally use a different supplier though.",
          "id": 28,
          "comments": [
            {
              "score": 24,
              "content": "Since they are in a rural area there is probably only one provider. Where I live we only have one. One of my friends a few miles away doesn’t have any at all.",
              "id": 29,
              "comments": [
                {
                  "score": 14,
                  "content": "I think you missed a joke there.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "With that kind of skill OP could certainly support themselves with a niche OnlyFans.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "It'd be gross but awesome. NTA. The guy was rude to OP in a different way. The annoying bureaucrat way.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2417,
      "content": "NTA.\n\nNot respectful, but you've been trying to find a reasonable workaround for broadband issues. Seven children doing online schooling simultaneously isn't feasible if the broadband connection is poor. Your teachers should not have an issue with recording lessons, and it makes sense that the siblings who can work independently, like you and your sister, do so, while those who need the engagement with teachers more do their schooling in real time.\n\nYour principal shouldn't have suggested that you get in better WiFi in any case. You're a teenager. The choice of WiFi package is not yours to make, it's your parents' so, if anything, he should have taken it up with them.",
      "id": 33,
      "comments": [
        {
          "score": 1164,
          "content": "I'd previously told him we can't get in better wifi, there's simply no point when we live in the middle of nowhere, our broadband is the best we'll get even with a better package for why pay more for something that wont work",
          "id": 34,
          "comments": [
            {
              "score": 475,
              "content": "I can't imagine that your family is the only one having problems with WiFi access. Between people working from home, doing online schooling, and using it for entertainment, there's a higher level of demand on the service than was anticipated, even in areas with a good level of access. \n\nIf you're in an area where broadband access is limited, your school should really have been operating on the assumption that some of their students would not be able to access classes, and made provision for that, like having recorded classes posted online.",
              "id": 35,
              "comments": [
                {
                  "score": 224,
                  "content": "Hell I live in the suburbs. My internet has been shit this whole last year with how much people are on it. Bf playing online games, streaming shows, or on the internet doing literally anything, gives me problems with my live sessions. \n\nIt’s not just you, it’s literally everyone. I don’t think the internet is actually capable of supporting this much use.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 101,
                      "content": "I'm in a very recently built development, but the broadband infrastructure was not designed on the basis of most of the residents being at home all of the time.\n\nMid-morning would have been expected to be a quiet time in terms of traffic because most people wouldn't be there but a household could now have one or both parents working from home at that time, with the kids doing online schooling.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "Exactly. The first day of virtual school in Fall 2020, all the kids and all the teachers in my town logged on to the internet and tried to stream meetings at the same time...and it crashed. It was a disaster. Even after doing some virtual schooling in the spring, the infrastructure wasn't in place to handle that much traffic.\n\nIt's gotten a bit better, but the internet is still unreliable enough with all that traffic that everyone knows our schools' protocols for when your internet is down.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I live in the suburbs too but the phone company installed fiber optic lines 7 years ago, so we switched from Spectrum to the phone company and haven't had *any* internet/TV issues, even with a ton of people at home.  My nephew and brother-in-law use it for live meetings and there's no lag.  Other people that still have Spectrum are having issues ( I think Spectrum secretly meters data) and don't get me started on the people with satellite internet and tv (cloudy day they lose signal).  If fiber optics comes to your neighborhood I highly recommend switching.\n\nI honestly think it is the old cable lines and phone lines that can't handle the traffic.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Right, but by telling her to get better WiFi he makes it Not His Problem^(TM).  The first goal of most school administrators.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "The first day of back to school after Christmas break internet service was down in my whole region. Over 500000 people.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I can't fathom being an adult and trying to scold a child into getting better wifi. You have no control over your parents wifi! He should have taken his concerns to your parents.",
              "id": 42,
              "comments": [
                {
                  "score": 17,
                  "content": "Plus if the infrastructure isn’t there, the customer can’t do much. Even with government subsidies there’s areas where it’s not economical to provide broadband service. The more rural you are the fewer options you have. This isn’t something the consumer can do anything about beyond moving to somewhere with a higher population density.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I think you are NTA. However, your mother has a point... about the disrespect. I’m not saying you’re wrong to think it, but it would have been better not to say it. I’m a very impulsive person when it comes to words, and one of the things I’ve had to learn is that even though I may be right, I don’t have to say it that way. I haven’t got in trouble (yet - averted it narrowly a few times) for something I’ve said, but chance is a bit dicey and it could go wrong for either of us anytime. You’re doing a really fantastic job helping your younger siblings, and I hope you have great success with your future plans :)",
              "id": 44,
              "comments": [
                {
                  "score": 12,
                  "content": "To be fair, if someone repeats a point that you already sufficiently countered, without amends, he was the first to disrespect. Op is almost graduating. So what, 16?17?18?, its an age where you can not expect them to respect you while you actively disrespect them.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "From your writing, I wonder if you're in Ireland? If you're rural, it sounds like you're doing ok with seven kids doing online school. Everyone has had all sorts of issues here,.we get regular emails from the principal assuring us it's ok and offering help to get around it. Your principal sounds oblivious.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Are you Irish? As someone from out the sticks (Cavan) I hear ya!",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I’m working from home in Ireland too and in a lot of parts of this great island you can pay a king’s ransom and still not get good WiFi. Purchasing better packages or hardware will not improve a dodgy infrastructure. There’s probably absolutely nothing either the op or his parents can do and the headmaster will know that well so OP is definitely NTA but the headmaster is a major ass.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -6,
              "content": "Use the ethernet cable instead of WiFi. The connection will be more stable. \n\nIs it a wired connection like Eircom or satellite broadband? Even with 5 people sharing the quality shouldn’t really be dropping like that. There’s plenty of bandwidth. It could also be a modem issue.",
              "id": 49,
              "comments": [
                {
                  "score": 9,
                  "content": "Sky, not sure the type, we've called them and it's an issue with the area.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Even if they found a better package no one would show up for weeks or months to fix it.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "If they're rural a lotmornthe issues will be caused by the internet  not really reaching the area\n\nMy town growing up was rural and in a big dip surrounded by hills. They'd sell us epxenice packages knowing that it was well above the maximum they could actually provide.\n\nEthernet helped a little but not muc",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Exactly. It isn't as if the kid is skipping all together. It's completely unnecessary to stress a kid about network connection. If the principal had an issue he/she should have gone to the parents, not the child.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I live in the middle of town and doubt my Internet package could support that many zoom meetings simultaneously, my word.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah I agree, the headmaster was disrespectful to OP",
          "id": 55,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 446,
      "content": "He is being unreasonable- as a teacher we are all in my school working really hard to support our students who struggle with tech and are really understanding of those who dont have good wifi/a laptop etc etc.\n\nHowever it is completely unacceptable to phrase a comment to your teacher in that way. \"Cant pull wifi out of thin air\" would be slightly rude but ok in the circumstances of him being so unreasonable. What you said was not ok and if my children spoke to their headteacher like that under any circumstances they would be in deep trouble.",
      "id": 56,
      "comments": [
        {
          "score": 244,
          "content": "Respect is earned not divined. There are many circumstances that cursing out an asshole is totally acceptable regardless of their piety.",
          "id": 57,
          "comments": [
            {
              "score": 11,
              "content": "I disagree.\nSchool is about learning more than just academics. Teachers represent authority figures, some of whom you will like and respect, some of whom you won't. You have to learn to treat authority figures with respect because if you are disrespectful to your boss, whatever your feelings on them, you are risking your job. I'm not saying you need to bow and scrape. But you need to be polite. And not just to authority figures, to be fair. Rudeness isn't a good trait.",
              "id": 58,
              "comments": [
                {
                  "score": 184,
                  "content": "There's a big difference between rudeness for the sake of rudeness and deserved rudeness. It could 100% be difference of culture, but teaching children to respect authority regardless of context turns them into spineless boot lickers, even if you don't encourage it directly.\nJapan is an extreme example, but respect regardless of context has created a national crisis in their country. The population is driven to work and schmooze their bosses so much that they aren't having children. Not to mention their suicide rate.\nThis child has been taught well. Trying the polite approach several times even beyond where the headmaster deserved. This kid did better than I would have.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 57,
                      "content": "I think the word the other person is really looking for is politeness. I agree that respect is earned, but politeness, especially for someone in a position of power above you, should be maintained. It's not that hard to get OP's point across without being as crude as they were (can't pull wifi out of thin air is a good example). If the principal really won't let up, get your parent involved. The principal shouldn't be going to the kid for this issue anyway, I highly doubt OP has any say in the internet their house has even if there were better options. \n\nSo OP is NTA but it isn't hard to stay polite even when others are being unreasonable.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Maybe it is cultural.\nI was raised to be polite at all times, and assertive where necessary.\nIt's perfectly possible to be polite without being a \"bootlicker\", and in my experience firm, assertive but polite behaviour reaps far better results than rudeness.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "I fucking hate this comparison between bosses and teachers. If you have a super toxic teacher or Hell a super toxic principle in even worse circumstances that controls your whole school life and if you are assigned to a certain district there is absolutely nothing you can do you cannot leave, most people’s parents cannot afford private school and most of the time the school you are in is the school you are stuck with. When it comes to jobs, sure there’s not just free jobs dropping out of thin air but as an adult you can always make the decision to quit or leave a toxic environment and children cannot do that so teaching them to respect toxic people and telling them that that’s what adulthood will be it’s just priming them for abuse and to be taken advantage of. As adults we have choices to quit, leave, go to HR or many many other forms of action children just do not.",
                  "id": 62,
                  "comments": [
                    {
                      "score": -11,
                      "content": "If you have toxic teachers where I am you can complain to the governors, to Ofsted, you can request to move school, you can be pulled out and homeschooled.\nAre these all easy options? No, but nor is proper life as simple as \"I dont like my job so I'll quit\", when there are bills to pay.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 41,
                  "content": "And unfortunately, in this situation, you are wrong. Whilst you do have to treat authority figures with respect, there comes a point where if said authority figures don't get the message, harsher wording is required.\n\nThe headteacher/boss examples are like apples and pears anyway - if your boss starts being unreasonable, you escalate to HR before you risk your job. In school, there's no HR equivalent but equally the headteacher has no real power over students.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 17,
                      "content": "But what the OP needs here is a workable solution to get through school.  He made a choice to use language that's inflammatory.  And where did that get OP? In trouble with his parents and the school.  There is a lesson to be learned here -  if someone is frustrating you,  what is the best option to get what you want or need? In this case, he could have escalated to a parent.  He could have simply not references buttholes.  Being blunt might be called for, but he went one step further than that and it isn't helping his case.  A better approach would be to say \"I cannot change my internet situation. Do you have a better solution\" or \"I can't pull internet out of thin air.\"",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Again perhaps a cultural difference. Here, there are pastoral teams who could be spoken to if there was an issue with the teaching staff, and the headteacher has the power to exclude students if their behaviour warrants it.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "[deleted]",
                  "id": 67,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Reverence? No.\nI dont revere my boss. But I wouldnt swear in front of him. You do have to behave differently in professional circumstances than in casual circumstances. It's weird that this is contentious.",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "NTA, if authority figures want respect they need to give respect. He wouldn't listen and that's not respect.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 1,
                      "content": "😎",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Ok so then what's your determination of the rudeness coming from the principal? He was talking to a CHILD that they needed better internet. As if the child has any control over their situation?  Talking down to them that they needed to fix this situation. It was fixed. OP handled the situation amazingly well and was being condescended to by the principal who had no business being involved as much as they were.\n\n Respect is earned not a given. I will not ever respect an authority figure simply because of their position. I will respect them as a person until they give me a reason not to. Teaching kids to blindly respect their elders opens to door for abuse of power and leads people down the path of cult culture. Look at almost every religion ever. Blind respect allows priests to run rampant with abuse of children and their position over their congregation.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Again. I have stated twice now that the principal was also wrong. Two wrongs dont make a right.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "It’s also completely unacceptable for a grown adult in a position of power to attempt to brow beat a minor student into performing miracles.\n\nThe principal wasn’t listening and honestly it sounds like they had already made up their mind that OP was just not bothering to participate. So he wasn’t even trying to hear what the issue actually was and to support the student through it.\n\nETA: I’m a parent and if this situation went down as reported? The principal would be very sorry they decided to go up the chain to me. \n\nNTA",
          "id": 73,
          "comments": [
            {
              "score": 10,
              "content": "THANK YOU.  He'd be having quite a discussion with me, and I use words that are a bit saltier than \"hole\".",
              "id": 74,
              "comments": [
                {
                  "score": 1,
                  "content": "How do you think that conversation would end?\n\n*Your son is not participating in class despite the fact he has the capacity to do so. I've offered a very reasonable alternative (rotating usage with siblings) to which he refused to do. He spoke to me an impolite manner using crass language.* \n\n*We are clearly getting nowhere and I am not going to put up with verbal abuse from you. There's 1000 other students in this school and almost double that many guardians I have to oversee and I do not have time to engage in your obtuse discourse. I will be reporting your son to the school truant officer (OP is in the countryside so this is likely the police) and  also reporting yourself for condoning his behavior.*\n\nNobody wins, headmaster is pissed because you wasted his time whilst he was just doing his job, you are pissed because you have the cops on your case and the cops are pissed because you're wasting their time on something petty, but they too are just doing their job.\n\nThe only person not doing their job and acting like an entitled jerk is you.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 2,
                      "content": ">I've offered a very reasonable alternative (rotating usage with siblings) to which he refused to do.\n\n\"So you want to deny my special needs kids their education? Because you don't think one of your A's students is not capable to learn on their own?\n\nHe is fully capable of learning on his own, with the resources provided by the teachers, while I have kids with special needs that NEED support from their teachers. And if you took a look at his grades, you can see that this is reflected.\"\n\nOnline school should not be about online classes.\n\nIf your students can work individually, like OP, it should be about providing resources that students can watch/work through at their own pace.\n\nThe resources/time spend on online classes should then be spend on individual support for the students that need it.\n\nThere are several youtube channels with hundres of thousands of subscribers that do nothing but teach math from 1st grade up to a masters degree, why not use those resources and instead spend your time as a teacher helping those students that need help?",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "I believe I stated in my first response the headteacher was also very much in the wrong.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "If OP were my kid they'd get a cake for that.  The headmaster a) needed a clue, b) needed to end the call when he realized the kid had a workaround, and c) needed to bring up any further concerns with the kid's parents.  If that headmaster had given me that bullshit I'd have told him what to pull out of HIS hole.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I agree with you and I'm not sure why people are arguing about it. The headteacher was being unreasonable, a teenager is not going to be able to change their internet, and OP had their school work under control. But OP could have conveyed the same sentiment in a different way, without being crude. Or let a parent handle it.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 244,
      "content": "NTA. I’m guessing by the leaving cert mention you’re irish, if so then absolutely NTA. The weather here has been a nightmare and the governments been worse for handling this and if it’s not affecting your grades you’re fine. Hopefully the exams go well for you regardless if you need them or not and your headmaster should be more understanding, every family situation is different",
      "id": 80,
      "comments": [
        {
          "score": 105,
          "content": "I think I'm gonna go for calculated grades purely based off how I reacted with the junior cert, it went shit because I was an anxious mess, I'd be much better off going for predicted",
          "id": 81,
          "comments": [
            {
              "score": 43,
              "content": "If you’ve been a straight A student you’re probably best off, especially if you’re going the (I’ll assume) apprenticeship route which is always a good idea. I did my lc a few years ago, was a nervous wreck for the exams and didn’t do great but got a decent course. Worse case you try again as a mature student in a few years. Life works out",
              "id": 82,
              "comments": [
                {
                  "score": 10,
                  "content": "Doing an emergency care personell PLC as back up mainly, goal is tattoo apprenticeship but the pandaexpress has made me realise it'll be years before I manage to get one",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Be careful with the calculated grades though. Just because you're a straight A student doesn't mean you're gonna get the same exact results in the calculated grades. The government made a major mistake with last years results and many straight A students dropped 2 or 3 grades as a result. I was one of the lucky ones who got a fair result but I guess it kinda depends on the secondary school that you attended.\n\nWishing you the best of luck with your exams/calculated grades! ❤️❤️❤️",
              "id": 84,
              "comments": [
                {
                  "score": 2,
                  "content": "What does any of this meeeeeean? Or what should I Google? -Signed the ignorant, but curious American.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Well the calculated grades are a replacement for the end of year exams that make up the Leaving Certificate. They were introduced last year when COVID was happening in Ireland. I was one of the many students who recieved calculated grades last year. It wasn't the best and was based on your performance throughout your school years, mainly 5th and 6th year. It also included your Junior Cert exam results which was done in your 3rd year of secondary school.\n\nThe Leaving Certificate is set over 2 years; 5th year & 6th year. 6th year is your last year of secondary school before you head off to college or not. It kinda depends on the person's choice. Usually you'd sit 7 exams in June; Irish, English, Maths, your 3rd language (main ones being Spanish, French and German, although it depends on what your school offers) and 3 other subjects. I did Geography, Art and Home Economics (These subjects also differ depending on the school you attend.)\n\nHere in Ireland, the grade and level(Higher or Ordinary) at which you sit your exam earns you a certain amount of points. Your best 6 subjects are added up and that is your total. Every single college course in Ireland requires a certain amount points to get in. The more competitive/popular/complex the course is, the higher the points, an example would be medical related courses would have higher points than an Arts course.\n\nHonestly I could go on and on about every single detail of the Leaving Cert but it would take too long.\n\nHere's the points system for Leaving Cert grades. http://imgur.com/gallery/OjRV8kt",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 59,
          "content": "I was thinking the same. Also, I wouldn't say that the word \"hole\" in that context (if Irish) is that bad",
          "id": 87,
          "comments": [
            {
              "score": 25,
              "content": "Exactly, just part of the vocabulary",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "So much this. I'm guessing a lot of people on here aren't used to how us Irish curse. Saying \"out of my hole\" is cheeky here for sure, but absolutely not the same as saying it to a teacher in America.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah, I wouldn't say it's a particularly shocking thing to say in the context.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Well it entirely depends on context, because you know \"I will in me hole\" means \"I won't\".",
              "id": 91,
              "comments": [
                {
                  "score": 2,
                  "content": "Haha true",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I laughed,  definitely Irish.\n\nFunny.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 129,
      "content": "Nta, don't worry op, The Irish government will have fibre broadband out to your area by the time your grandkids are in school.",
      "id": 94,
      "comments": [
        {
          "score": 32,
          "content": "I chuckled at this, not because its funny (it is) but its true. I like to think I'm lucky tho, the wifi is so shit that none of us were able to be iPad rared, so even my non verbal brother has thick irish grunts (sorry to whichever ❄ I'm about to offend) thanks to listening to the cows with their regional accent so much",
          "id": 95,
          "comments": [
            {
              "score": 32,
              "content": "My ex died when our daughter was 12. One teacher would constantly tell the kids to bring in a note/get something signed by their mother.\n\nMy daughter said my mother is dead so it'll be my father. She kept saying mother. My daughter reported it to the year head, it carried on. She said it to the principal, it carried on.\n\nThen 6'2 18 stone me went to see the principal. I told her, it's a month to the parent/teacher meetings and if it happened again I'd be taking her(the teacher) head off at the shoulders. Either she stop it or I would but either way it'll be stopped permanently in a month.\n\nThat teacher was so nervous at the meeting but she never done it again in the 4 remaining years.\n\nThat principal deserved what you said and more.",
              "id": 96,
              "comments": [
                {
                  "score": 23,
                  "content": "I'm really sorry that happened and that the teacher kept on after it was reported. \n\nTeachers/principals need to be put back in their box sometimes, you did good.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Despite my size I'm normally the most easy going nicest guy you'd meet. But mess with my family and hell hath no fury.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "And will eventually tell us it's actually gone live when the great-grandkids start.",
          "id": 99,
          "comments": [
            {
              "score": -4,
              "content": "By then the Chinese will have taken over and the kids will be in a mine working 14 hour days.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "You sure about that?\n\nAt the rate it’s going I think Elon will have Starlink up, going, and affordable before the government choose what colour the wires will be.",
          "id": 101,
          "comments": [
            {
              "score": 4,
              "content": "Ha, my brother lives in the arsehole of nowhere with no decent broadband, he placed his order for Starlink today!",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 99,
      "content": "Disrespectful but NTA\n\nYou were in the right with your position and haven't done anything wrong but you should've stayed with neutral language and respectful.\n\nYour headmaster is being an entitled prick assuming everybody has access to modern technology. It's not available or affordable for everybody and he should congratulate you for doing your best still and putting your siblings needs above yours.\n\nThat being sad you should always stay diplomatic with anybody in a higher power position. Not because it's nececarily fair but just because they can make your life hell if they get offended.",
      "id": 103,
      "comments": [
        {
          "score": 0,
          "content": "How the fuck is being disrespectful not being an asshole. Its a fuckin cinnamon for fucks sake people",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 49,
      "content": "Nta. Rural Ireland and broadband is a joke. You are doing your best and making sure that your siblings, who need it more, are able to do their school. God knows what is going to happen after some classes go back on Monday. Good luck with your leaving!",
      "id": 105,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 49,
      "content": "Nta. You approached it respectfully several times before saying it like this, and it honestly needed to be clearly said. Making sure the content is accessible for people with limited WiFi access is entirely the schools responsibility and they cannot bother you to get better internet.",
      "id": 106,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 36,
      "content": "NTA\n\nAs someone who like you who lives in the sticks in the midlands with patchy broadband for years I get it. Our fibre optic finally rolled out just before september thank god. \n\nI wouldn't have used your exact wording but understand why you did, and that principal should know what the state of internet is like here. \n\nBest of luck with the leaving cert. I said last year it was going to be tougher on this years students than last years but hopefully you get what you want/need from it.",
      "id": 107,
      "comments": [
        {
          "score": 8,
          "content": "As you said, surely most students would be in the same boat with internet in the area? The principal was taking the piss, since he clearly knew what OP was working with.",
          "id": 108,
          "comments": [
            {
              "score": 3,
              "content": "Honestly where I am its that ridiculous that the difference in 200mts could be fibre optic at 100mbps and using a sim card based modem at 13mbps.",
              "id": 109,
              "comments": [
                {
                  "score": 3,
                  "content": "Fibre optic runs down the road my lane comes off, I'm the first house on the lane, literally on the corner, and have been told it'll be 18 months to 2 years to get connected. It's a load of balls.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 2,
                      "content": "We were told we would get leaflets posted when it went live. They never arrived. And the online tracker never updated either. It was by sheer chance talking to engineering with EIR one day (tree fell on line)that we found out was live about 3 months and no one knew.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "We're the only family with students in the area, our 4 neighbours are old farmers with kids who fucked off to America or Dublin to do a fancy psychology degree",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I live in West clare, so I think that'd be midwest but i hated geography.",
          "id": 113,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 29,
      "content": "NTA even if you DID pull that last comment out of your....",
      "id": 114,
      "comments": [
        {
          "score": 19,
          "content": "[removed]",
          "id": 115,
          "comments": [
            {
              "score": 11,
              "content": "Good bot",
              "id": 116,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "\\*pats head\\*\n\ngood bot",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}