{
  "post content": "\n\nOkay, So this happened last night while me (M23) and my family were visiting my brother's (M30) girlfriend's (F30) house for the first time.\n\n\nWe were all sitting at dinner table and I remembered when my brother's girlfriend, who's a widow, saying that she keeps an urn of her late husband's ashes in the house. Conversation let from one thing to another then, I looked at my brother and asked him quietly if he was comfortable with having his girlfriend's late husband's urn in the house. he gave me a long stare so I figured the answer was yes but maybe, he couldn't tell his girlfriend about it fearing she'd misunderstand maybe?. So I brought it up with her and told her it was quite weird to have her late husband's urn in the house. She looked at me and was apparently caught off guard by what I said. she said that she didn't think so and that it wasn't like the urn was on display, also said this is her late husband's house and where the urn should be. I told her it felt weird especially, since she just had my brother move in with her and he must be feeling uncomfortable with the idea, his girlfriend looked upset and got quiet. my brother shouted \"none of your goddamned business, shut your mouth Elijah, jeezus!\" I responded with \"I mean..personally I wouldn't be cool with my girl keeping an urn of her ex within close approximate, at best best it'd make me feel uncomfortable, at worst it'd make me feel creeped out.\" his girlfriend then replyed by saying that I have no business dating a widow then and I shrugged. She excused herself to the kitchen and stayed there, my brother went off on me calling me an obnoxios asshole for making dinner awkward and upsetting his girlfriend. I told him I was just giving my opinion but he lashed out more.\n\n\nmy parents and I left and they told me my brother's girlfriend was being hypersensitive, but I too went too far and upset my brother and probably sparked an argument between them and I should reach to apologize but I'm not sure.\n\n\n[edit] Guys! please, One thing you should know is that I had no intentions of being hurtful. I do not hate my brother's girlfriend, infact, we get along pretty well but I just wanted to add that I had no malicious intent here. I'm not the the type of guys who go out of their way to act maliciously but I feel kind of guilty for how the situation played out. [edit2] my parents are the ones who said she was being hypersensitive, not me. [edit3] Yes, I overheard my brother venting about the urn when he first moved in just so you know.",
  "id": 1,
  "comments": [
    {
      "score": 44051,
      "content": "YTA. News flash, dude. You are not always entitled to your opinion. This is none of your business whatsoever. Think about this whenever you open your mouth to speak...\n\n1. Is what you're about to say helpful?\n\n2. Is what you're about to say necessary?\n\n3. Is what you're about to say kind?\n\nIf the answer to all or even two of these is \"no\" then keep your mouth shut. \n\nThis incident? The answer to all three is a definite \"no\".\n\nEDIT for clarification.",
      "id": 2,
      "comments": [
        {
          "score": 7765,
          "content": "Nice list! 👍\n\nYou're always entitled to hold an opinion but NOT always entitled to give it!. Especially when it's not asked for.\nDEFINITELY ask yourself those questions before deciding to spout an uninvited opinion. \n\nI'd also add in this case; who gave @op the right to decides how anyone grieves? A surefire YTA",
          "id": 3,
          "comments": [
            {
              "score": 3047,
              "content": "See, I don't agree that everyone is entitled to even hold an opinion in certain circumstances. I guess it comes from my mom always expressing opinions (often outlandish ones) about people and situations that don't concern her.\n\nFor example, when she heard my cousin and her husband were divorcing, she immediately expressed an opinion that it was probably because my cousin was working too much in her business. When what actually happened is that her husband cheated on her when he was working away. To me, nothing about my cousin's marriage had anything to do with my mom so she wasn't entitled to her opinion on it. \n\nMy thoughts when I heard about the break up? \"Oh, I hope my cousin is OK.\" There's a difference.",
              "id": 4,
              "comments": [
                {
                  "score": 1261,
                  "content": "That's not an opinion, that's an assumption. A wrong one as well.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 481,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": "That’s an opinion as well as an assumption, and your mother is “entitled” to have both.  Sharing either one, however, would be rude and hurtful.  \n\nSaying “that’s just my opinion,” as OP explained, doesn’t make it OK to share out loud.  Maybe when OP is a little older and has more life experience under his belt, he’ll realize that.\n\nOP is an ignorant young AH who hurt a grieving widow and inappropriately shared his brother’s private confidences.  But that’s just my opinion so I’m sure OP will approve of me sharing it.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 147,
                  "content": "I think it’s hard to not form an opinion. It’s natural to weigh information that we have in front of us and assess it.  I doubt people can stop that. However, nobody’s entitled to sharing their opinions.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Yeah, everyone is entitled to their own opinion, but you are not free from the consequences that can come from expressing that opinion.  If you express an opinion that could hurt someone, you are subject to the response that comes from them being hurt, like them wanting nothing to do with you anymore.  Hopefully that is the case with OP's brother's girlfriend.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "[deleted]",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "There is a difference between having an opinion and expressing/displaying that opinion.  It is perfectly fine, and in most cases actually unavoidable to have an opinion.  If anyone tells you something, you will have some kind of immediate thoughts/feelings/emotions regarding whatever it is they tell you that will form your opinion.  There is no stopping that from happening.  \n\nWhat people are NOT entitled to do is spout off their opinions whenever they want without consequences.  Sure, freedom of speech and all that, you can say whatever you want, but that doesn't protect you from other people thinking you're an asshole.  OP is entitled to have his opinion that the GF keeping the urn is creepy.  But if he lets others know of that opinion, everyone else is also entitled to their opinion that OP is an asshole for having it.  \n\nSidenote, but his parents are absolutely assholes for their \"hypersensitive\" comment, too.  This woman was married and lost her husband by the time she was 30.  There is no way that was a comfortable death due to natural causes.  It is almost guaranteed that there is some major trauma relating to her late-husband's death.  To say that she is hypersensitive for \"looking upset, getting quiet, and leaving the room\" after someone basically just told her \"you should be over your last husband by now, my brother is so much better anyway\" is such an asshole thing to do.  This entire family except the brother have 0 tact whatsoever.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4377,
          "content": "One more for your list...\n#4. Is what you are about to say something you know absolutely nothing about?\n\nLosing a partner, parent or child before their time (or at all) is one of the worst experiences you can ever have in life. Grieving never ends and how a person deals with it is not up to anyone's judgment. Period.\n\n\nAlso, she was *not* being hypersensitive, OP was being blindly, righteously insensitive. YTA and so are your parents for entertaining what you said in any capacity.",
          "id": 12,
          "comments": [
            {
              "score": 813,
              "content": "Glad to see that someone else got the parents in this mess - they absolutely added on and the fact they even thought this was an okay thing to say shows exactly where OP got their attitude from.",
              "id": 13,
              "comments": [
                {
                  "score": 60,
                  "content": "Was looking for this. Hypersensitive? Wow. Did not know it was frowned upon to grieve or have feelings about the death of a loved one, ffs.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Ditto. That’s exactly what I was thinking (and what I included in my comment too).",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Right? Can you imagine some 23-year-old kid telling you what he thinks you should do with your late spouse's earthly remains??? Holy shit.",
              "id": 16,
              "comments": [
                {
                  "score": 35,
                  "content": "And the smug shrug when she told him never to date a widow. I would have kicked him out at that point. \n\nYTA.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Exactly what I was thinking. How can you be hypersensitive to your spouse being dead? Sounds like his parents don’t want him to be in the wrong. If the person I was talking to AND someone outside of the conversation got upset at what I was saying/ had said I wouldn’t think twice on whether or not what I said was called for because obviously it wasn’t. Of course there’s gonna be a situation where I know I’m right and the people are trying to gaslight me but those situations, at least to me, it’s obvious when it’s happening. If OPs brother truly had a problem with the urn he needs to deal with it himself since it’s his relationship and he knows all the nuances of it. Not his brother",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "He even referred to her deceased husband as her ex!!",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Also if you're threatened by someone's ashes, you're way too immature to be in a relationship anyway. If it was a parent or child no one would bait an eye at keeping an urn around. Unless you think she's gonna cheat with her deceased husband's ghost, this doesn't affect anyone at all.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": ">4. Is what you are about to say something you know absolutely nothing about?\n\nahh Nextdoor syndrome. Everyone has an opinion, even if they have no details, facts or knowledge",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "There can be more to this as well . The GF is young and may not have been prepared to deal with the urn/ashes. In time she may have a burial or scatter them. Why anyone would make a comment about something so personal is beyond me. People and their mouths!",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4093,
          "content": "can we also point out that these are not the ashes of her \"ex\" as op kept saying. She is a widow, that loss will stay with her forever. The urn is in the house; OP confirmed it isn't \"on display\" as a shrine to her late husband.",
          "id": 23,
          "comments": [
            {
              "score": 2006,
              "content": "And even if it was? Meh. My dad had one of my late stepmom's favorite sweatshirts put in a shadowbox with a few little things and hung in his hallway. He's currently in Florida with a new lady friend. If new lady friend can't see that the woman he spent 40 years with holds a special place in his heart, forever? Then ladyfriend is gonna have to go.",
              "id": 24,
              "comments": [
                {
                  "score": 764,
                  "content": "I'm 45 so my chances of getting into a relationship with a widower go up each year. I would totally be cool with something like this. \n\nNews flash - you aren't going to be the first person they loved.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 186,
                      "content": "Yeah. The older we get, the more experience we have. (i'm 45, too.) And that's just part of life. It doesn't mean that people who came into it later are somehow lesser, or being compared, its just timing. you can definitely tell this is a young man's perceived problem.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "And frankly you might not be the last.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "The older you get, the larger your heart has to be to fit all the people you care about.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "One of my least favourite things about Reddit is the prevalence of the attitude that if someone fondly remembers a past relationship, keeps mementos from a past relationship, stays close with an ex, or stays close to the family of a past partner then they're somehow still stuck on that relationship or trying to get back with the ex or some other variety of cheating, stringing along their new partner, or otherwise unfit to be in another relationship. It's such a heteronormative highschool mentality and super toxic.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "Exactly.  Any reasonable woman would be happy to honor a widower's deceased wife along with him.  It's evidence of what a loyal, faithful, loving man he is.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Exactly! I mean, he's said straightforwardly that he's not getting married again. And that he probably can't love again in the same way. But that he's looking for companionship and someone to spend time with, and in this specific case, his new ladyfriend has had 2 husbands die of cancer, so she has ZERO problems with it.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "My (step)dad's urn is currently sitting on the the mantel of the fireplace that he built for Mom.  Thing is, unless you're looking for it, you think it's just another picture frame at first glance.\n\nIt's kinda nice, though - he's still hanging out with us and watching over us.\n\nOP needs to back alllll the way up.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 25,
                      "content": "My dad's urn is on top of a display in my stepmom's house in her living room. It's exactly where he should be, in his favorite place. She also displays her late pet's urn boxes on the same display but lower down. That would amuse him.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "My mom died 3,5 years ago, she and my dad had been together for 29 years. You know what the new girlfriend of my father does? She helps choose the best pictures of my mom to put on display in the house",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Yup. My mom basically does have a shrine to my deceased father. Tough shit if she ever dated again and that guy had an issue with it.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 945,
              "content": "Weaponised ignorance on display by OP. But guuuyyyyssss I didn't mean anything malicious I was just giving my unwanted, unrequested, ignorant opinion on something I have no experience in or prior vicarious knowledge of!!! I'm not TA! \n\nAbsolute tool.",
              "id": 36,
              "comments": [
                {
                  "score": 297,
                  "content": "I'm not even buying the \"I wasn't trying to be malicious\" bs either, frankly. I think he absolutely wanted to be mean, he was getting a reaction and repeatedly doubled down. Gross",
                  "id": 37,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Yeah. The way OP stared at his brother about the urn and then figured “his brother is too gutless to mention it, so I will, in front of the entire family”",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Accurate! Sounds like a proper tosser",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "This is the PERFECT example of weaponized ignorance. Totally agree.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "I love it when people say “Whoa whoa whoa I wasn’t TRYING to be an a-hole!” Like they slipped on a banana peel and just slid right through the shit that ended up coming out of their mouths.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Funny thing is his brother is the one moving in her house. The balls on this idiot and his parents.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Deserved roast",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": "Yeah I love how op is jealous on his *brother's behalf* of the literal *ashes of a dead man*. Like holy CRAP.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Yes! This really turned me off. Her deceased husband isn’t an “ex”. He’s her husband who has died. Referring to his as an “ex” is callous and cruel, not to mention factually incorrect.",
              "id": 45,
              "comments": [
                {
                  "score": 26,
                  "content": "I feel like he probably doesn't grasp that it wasn't a willing loss. And if that's the case, what if she also had children's urns. Would he be weirded out then too? And why is it bothering him so much.  That's the actual weird part.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "So much this. I just read this post and shake my head. OP reads so so young with limited life experience. I do, however, feel for OP’s brother. My own brother died young and left a young widow, and it was hard for her when she started dating. It’s hard to compete with a ghost. Infinitely more tricky than dealing with an ex IMO. That said, OP is TA, especially as he “overheard” his brother venting, as opposed to a conversation his brother had with him. Not that a conversation would make it better but OP is guessing.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Also, where exactly does OP expect her to put the ashes? In storage? In the trash? In her trunk? What kind of question is that anyway?",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Right. My husband is the love of my life. If something happens to him, I will miss him forever. If I were to get into another relationship, I'm not taking down family photos, etc. He's raised my daughter from the time she was 11 and I'll be damned if I would take our family pictures down because it made someone else uncomfortable.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I have two urns for the two dogs my wife and I have had during our marriage. I doubt our current dog minds. But I could not imagine throwing out those urns just because we got another dog. We spent 14 and 17 years with those dogs, they were a part of the family. They still are. They deserve the spot in the house.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "OP owes his brother's girlfriend a huge apology. I don't quite buy the edit that his brother was complaining about the urn before he moved in. Like, who *are* these insensitive people?\n\nI dated someone whose brother's urn was on display in his parents' house. When we began seeing each other, I knew the circumstances of his death, although I had no idea that he was cremated. My boyfriend's mom was very open with me about how much she missed her son, especially since his death meant that his own son would grow up getting to know his dad through stories and pictures.\n\nThings having to do with death make me feel uneasy, but as soon as I saw the urn, the incredible sadness that my boyfriend and his parents went through hit me like a ton of bricks. Not once did I **ever** feel such an overarching need to make an audacious request that the urn be relocated because it creeped me out. You just don't do that.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I have my ex husband's ashes in my house. He was my ex but he was also my children's father. No one else's business.\n\nI actually thought it was creepy at first and felt uncomfortable when I \"inherited\" his ashes after his mother died just a few months after he did. He's tucked away in a corner for now and I may give him a Viking funeral someday. But what we do with his ashes is up to my children and me, not a current or future partner (and certainly not any meddling in laws offering an unsolicited opinion).",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2512,
          "content": "Craig Ferguson had a similar list:\n\n1. Does this need to be said?\n\n2. Does this need to be said *by me*?\n\n3. Does this need to be said by me *now*?\n\nI like your list better.",
          "id": 53,
          "comments": [
            {
              "score": 802,
              "content": "Those lists used together would eliminate 3/4 of the posts on here",
              "id": 54,
              "comments": [
                {
                  "score": 22,
                  "content": "You may be on to something there.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Man I miss Craig Ferguson hosting that late show.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I’ve actually heard them all as a list, with yours being 4, 5 and 6 respectively.",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 545,
          "content": "You should feel guilty. It wasn’t her ex, it’s her late HUSBAND. And how was this any of your business? What did you think you would accomplish? You sound extremely immature and rude. YTA.",
          "id": 58,
          "comments": [
            {
              "score": 22,
              "content": "And oh yeah, his brother *totally* told OP he was annoyed by it before. Which was why OP trying to question him about it in the beginning. I can't stand this dude",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 285,
          "content": "And what's worse is his BULLSHIT edit.... He absolutely meant to be mean unless he's so fucking stupid that he doesn't understand being told to shut the fuck up. After that point, *everything* he said was malicious",
          "id": 60,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 112,
          "content": "Also on OP’s edit he says he had no intent to be offensive. Dude unless someone removed your brain through your nose, you are old enough to know that what you say can could be offensive. The only thing getting in the way is ego. YTA - and l’lol throw another for your parents, and another to your brother for bitching about how she remembers her late husband. Jesus Christ.",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 100,
          "content": "Nice list.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Did it occur to OP that the brother gave a stare because he was mortified by the question and not because he is  bothered. plus the brother had a right to not move into that house if he is bothered by the urn. OP is so immature and selfish to a weird level, the lack of empathy is concerning. What an AH",
          "id": 63,
          "comments": [
            {
              "score": 21,
              "content": "Yeah, I don;t buy his #3 Edit, where he said his brother said before he didn't like the ashes being there -- OP would have had that in the original text.\n\nAnd, IF OP's brother thinks that, he sucks, and his GF deserves better.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "My late husband’s urn is on the mantle. In the center, displayed for in front of a mirror. Our relationship made me who I am. Anyone who who walks into my house and can’t accept the urn can GTFO. end of conversation. YTA.\n\nEdited for typo.",
          "id": 65,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23865,
      "content": "YTA. An absolutely massive one. It's not her 'ex.' She didn't dump him. He didn't leave her. He was her husband and he died. That love doesn't just disappear. You don't just erase all memory of a loving marriage. Who else should have his ashes but his wife? Why would you even think to question her or pass comment on this? Do you have no social skills or empathy at all?\n\nYour brother already knows her past and accepts it and it's precisely F all to do with you. Your parents are also AHs if they agree with you.",
      "id": 66,
      "comments": [
        {
          "score": 7181,
          "content": "Agree. Re-marrying after divorce is NOT the same as after the death of your spouse. Widows/widowers are not divorcees. OP’s super insensitive",
          "id": 67,
          "comments": [
            {
              "score": 2666,
              "content": "Super insensitive and extremely immature. It's awfully childish to be \"creeped out\" at the presence of an urn in the home. OP's attitude about the entire situation reminds me of a preteen bratty kid.\n\nEdit: I (45f) changed the gender as some people assumed I was being sexist. In reality I had a particular cousin of mine in mind when I wrote it, who happens to be female. She terrorized everyone in our youth and I dreaded going to visit her.",
              "id": 68,
              "comments": [
                {
                  "score": 957,
                  "content": "Don’t blame preteen girls for this behavior. OP is a whiny crybaby all by himself.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Yep. If the brother and his widowed gf don't go the distance, then this awful conversation will probably just remain a hurtful memory for her. Should they marry, then OP has just established himself as someone his new SIL won't trust, and possibly never even like. YTA",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 521,
                  "content": "That's a little offensive to preteen little girls...",
                  "id": 71,
                  "comments": [
                    {
                      "score": 232,
                      "content": "My eleven-year-old daughter would certainly have more compassion.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 118,
                      "content": "Preteen girls are actually pretty sensitive about death. They may give their parents a run for their money, but they generally don't want to be seen by the public at large as foolish and immature. Tough believing OP's parents supported his astoundingly entitled rudeness in any way.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 232,
                  "content": "I myself, nor any of my friends ever acted anything like this as preteen girls, come on. This stereotype needs to die.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 27,
                      "content": "As someone who once was a preteen girl, and who regularly interacts with current preteen girls, I totally agree. None of them would ever even think of behaving like OP (who is totally TA).",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 143,
                  "content": "Even preteen girls would have more sense then OP. \n\nAnd if anything, the most creepy thing in this post is how insensitive and (apparently) ignorant OPs comment was",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 113,
                  "content": "Lose the “little girl” part, and I love your comment. The OP is very immature.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Hey! I know for a fact that most pre-teens girls would act far more maturely in this situation (and they are probably all voting him TA too! 😂)",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Idk what kind of teens/preteens you know, but my preteen 12 year old daughter or any of her friends wouldn’t ever act this way. They’re full of empathy and compassion (perhaps a little *too* much even, at times) and know much better than to comment on something as sensitive as a widow keeping her husband’s ashes.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yeah, OP's being awfully fragile if he feel his brother relationship is threatened by a dead man.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "Even if it IS after divorce, that doesn't mean that those years just disappear from the world.  They happened, and you are here now. Hopefully they were growth years, but either way there is nothing that can change it.  Especially an urn with ashes, does OP think that she's going to have an affair with her Ex?!?\n\nIf you're in a relationship with someone, and you are more concerned about them cheating and going back to their ex, you're in the wrong relationship.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I'd like to echo OP's brother and emphasize, \"shut your mouth, Elijah, jeezus!\"",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1591,
          "content": "I have a friend who married a widow with a child. Together they celebrate his birthday, their anniversary, the day he died, because they are adults. They even invite her deceased husbands family to events. My friend understands what he meant to her. That was a huge piece of her life that was taken away in a horrible way. \n\n\nOP’s brother needs to stop dating her, she deserves someone who treats her with respect. And OP, YTA",
          "id": 83,
          "comments": [
            {
              "score": 529,
              "content": "His brother obviously stood up for her and tried to push back on op's blatant assholery. Idk where you're getting the idea he doesn't respect his gf.",
              "id": 84,
              "comments": [
                {
                  "score": 228,
                  "content": "The edit where the OP says his brother had complained about the urn.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 914,
                      "content": "Definitely one of those \"guys please stop calling me the asshole\" edits. If his brother had vented about it before, why would the OP have \"quietly asked him if it was weird\" and then taken his silence as a \"yes\"? He'd already know the answer.\n\nOP is just trying to save face.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 252,
                      "content": "They said when they first moved in, maybe he didn't know about it then but got used to it?\n\nSeems fine with it now.\n\nAlso OP is in damage control mode, who cares what they say at this point.",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 191,
                      "content": "He complained, to someone who wasn't his GF, when he first moved in. My dude's allowed to have feelings and to vent his not-so-nice frustrations. He didn't put them on his GF. That's human.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "he said he “overheard it” when his brother first moved in but doesn’t want to say how long ago that was. The fact that it wasn’t even being said to him and he basically spied on his brother’s conversation from gods know how long ago just makes him appear even worse. And him trying to pin the “hypersensitive” thing purely on his parents is a dick move but also shows that his parents likely have no social skills either",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "Yeah I don’t believe he said that, especially since it was the third edit.",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "My brother is in the same situation. He does the same things your friend does, & her husband's family treats him just like another member of the family. I asked him once if it bothered him, & he said \"Is it supposed to? I'm not trying to replace him, so should it bother me?\" I told him that he was way more mature than most people & as long as he was happy, it didn't matter.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 883,
          "content": "exactly this like what was she supposed to do with the ashes once she got in a new relationship just…get rid of them? imagine being so insecure a dead guys ashes would make you “uncomfortable” in your relationship wow yta and definitely the hypersensitive one",
          "id": 92,
          "comments": [
            {
              "score": 174,
              "content": "it's not even his own girlfriend!",
              "id": 93,
              "comments": [
                {
                  "score": 11,
                  "content": "yeah it’s not his place at all to bring it up and force his opinion",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "It would be concerning coming from a new bf/husband who is jealous of a dead guy. But the bf is fine with that, OP is her boyfriend's brother who literally has no say in this whatsoever. Now I feel for them, must be frustrating for them to deal with OP, but to me personally reading this was pure comedy.\n\nOP: Hey your wife keeps her late husband's ashes, innit weird?\n\nBro: Umm, no?\n\nOP: Hey but still, it's weird that you keep his ashes in the house\n\nHer: No it's not\n\nOP: It is though (because I say so)\n\nHer: It's really not though\n\nOP: rEEEEEeeeEeeEEEeEe",
              "id": 95,
              "comments": [
                {
                  "score": 37,
                  "content": "op: presses the issue over and over\n\n&#x200B;\n\nalso op: omg y u sensitive im not trying to be mean lol its just my opinion\n\n&#x200B;\n\nsame energy as the kind of guys that say theyre joking based on someone's reaction to their shitty hot take. Schrodinger's douchebag.",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Your quick review of the convo, made me chuckle lol",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Then OP, instead of taking the outcome of this convo and reflecting on her awful behavior, ran off to reddit, clearly expecting a much different judgment than has actually been rendered. OP's post edits give that away loud and clear. Even after a resounding YTA rejection of OP's atrocious behavior, OP is still scrambling hard to save face and soften the harshness of the judgment.\n\nInstead of, you know, taking this opportunity to grow and learn how to do better next time.\n\nSo much of this sub's commentary includes genuine, honest and excellent advice that is wasted on those who came to post for validation only and who have no intention of doing anything different next time.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Uh yeah, what do you think Goodwill is for? \n\nSeriously what a dick.  I wouldn't be surprised if OP doesn't hear from his brother for quite a while.",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 374,
          "content": "I thought this when I saw he had referred to her deceased husband as an \"ex\"! Like dude! He isn't an ex, he was someone she loved very dearly and was ripped away from her too soon under circumstances that are most likely quite traumatic!",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "He has no social skills because he was raised by people that think she’s being hypersensitive. Poor girlfriend should probably run away from this family.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Also, while we don’t know the circumstances surrounding the husband’s death, it’s safe to assume she didn’t expect to be a widow before turning 30. (Slight assumption that he died in her 20s since she’s 30 now and has been dating OP’s brother long enough to move in together.) Imagine saying you want to spend your life together, and they don’t make it to your 30s. That poor woman. She can do whatever the hell she wants with her deceased husband’s ashes. And they’re not even on display somewhere! OP, grow the hell up. Put yourself in her shoes. What happened to her is tragic. She’s allowed to do whatever she thinks is best to honor him and the relationship she lost, whether she’s with someone new or not. Honestly, how heartless can you be?",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "The parents are definitely AHs for calling the girlfriend oversensitive about her husband's passing. She can be as sensitive as she likes about the subject.",
          "id": 103,
          "comments": [
            {
              "score": 12,
              "content": "She’s allowed to be sensitive, but I don’t think she’s being sensitive at all in this situation. I think she reacted pretty normally to a bizarre comment from a relative stranger.\n\nI imagine in her head she’s like wtf? Why would my bf care? What am I supposed to do, throw the ashes away? Why would anyone say something like that? Why is no one jumping in and correcting this weirdo?",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11266,
      "content": "Everyone else is pointing out that YTA (and you absolutely are) but I haven't seen a comment yet point out that THIS IS NOT HER EX!!\n\n>I wouldn't be cool with my girl keeping an urn of her ex\n\nAn ex is someone you (or they) have made a decision to end a relationship with. Her husband died. They didn't choose to end the relationship (no matter how he died). He is her husband. Her late husband, but her husband nonetheless.\n\nShame on you for this behavior. You owe her a massive apology, assuming she's even willing to hear you out - I sure wouldn't be.",
      "id": 105,
      "comments": [
        {
          "score": 1152,
          "content": "That stood out to me too.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 876,
          "content": "Agreed. Unless, they broke up, she killed him and cremated his body to hit the evidence. Then it would be her ex, but this scenario seems highly unlikely.",
          "id": 107,
          "comments": [
            {
              "score": 557,
              "content": "Tell me you script Lifetime movies without telling me you script Lifetime movies. lol",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Lol why was this my first thought in response too? I was like well in this very specific case it would be creepy, but then he'd have bigger problems than an urn.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 700,
          "content": "Are they worried shes going to start cheating on her boyfriend with the urn??",
          "id": 110,
          "comments": [
            {
              "score": 191,
              "content": "Better watch out for those horny ghosts of past husbands!",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "Next week on ID Discovery— Dust to Dust: Your Dead Husband’s Ashes Are Calling Every Night",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Stop I'm trying so hard not to laugh",
              "id": 113,
              "comments": [
                {
                  "score": 14,
                  "content": "Maybe the urn is ashes inside a big glass dildo",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 533,
          "content": " Seriously, \"an urn of her ex\" turned my stomach.",
          "id": 115,
          "comments": [
            {
              "score": 456,
              "content": "Also anyone who says \"my girl\" just grosses me out. It's so skeezy.",
              "id": 116,
              "comments": [
                {
                  "score": 82,
                  "content": "It’s also so often used to refer to “theoretical” girlfriends too, which I think adds to the skeeze. Like, yes totally OP, whatever you say goes with your non existent future girlfriend.\n\nEdit after seeing thread below - “my girl” IS skeezy in this specific context, I didn’t think we meant ALL uses of “my girl” ever.",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Yes it comes off as very possessive. Maybe not always, but in his sentence, definitely.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "Yeah that is what shows OP’s astounded level of immaturity.  Even when I was 8 years old, I knew the difference between my uncle who got divorced and a family friend whose spouse died.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I came here just to comment this. They're not an ex if they are dead... the new partner probably never would have come into their lives if tragedy had not struck",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7361,
      "content": "YTA - WHAT DO YOU EXPECT HER TO DO WITH HER HUSBAND?\n\nYou are a mega asshole. You don't through people asses away because you have a boyfriend. That is somone she loves.\n\nThe way you went about it is completely hurtful, that is not a topic to even touch.",
      "id": 121,
      "comments": [
        {
          "score": 2657,
          "content": "My mother (who is a narcissistic alcoholic nut job) married a widower whose wife (Jane) of 25 years died of cancer about five years prior. When she moved into his home and found his wife’s urn in the basement she lost her ever loving mind that she would not share her home with Jane and needed her gone NOW. So rather than giving the urn to Janes adult children (who my mother already made her new husband cut all contact with for them expressing concern about how quickly they married after meeting) she marched him down to a retention pond in their neighborhood to dump his wife out. Then called me to brag about it. The only people who get jealous of ashes are sick in the head and they should be avoided at all costs IMO.",
          "id": 122,
          "comments": [
            {
              "score": 991,
              "content": "Wow. That is so cruel on so many levels.",
              "id": 123,
              "comments": [
                {
                  "score": 312,
                  "content": "If I were Jane’s child I would sue. Would I have even have a case? Who knows. If legal actions fail I can’t say what I’d do to that woman.",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 436,
              "content": "Please tell me that marriage is over. Because, I mean....",
              "id": 125,
              "comments": [
                {
                  "score": 581,
                  "content": "Nope but it’s her 5th marriage and she’s only in her early 50s so I’ll be shocked if it lasts. Then again, she’s got this one so wrapped around her finger that he’s dumping his life partner out like trash and he co-signs every lie she tells no matter how vicious or blatantly false they are…so who knows.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 541,
                      "content": "No offence, but your mom can go fuck herself. That is next level cruel.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "I fear there are special places in hell ready for both your mother and the widower.",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Sounds like my stepmother. I'm lucky that we were Jewish (stepmother was not and father later converted to her religion for \"purely practical purposes\" after I left at 16), as my mother was buried. However, we never got to visit her grave after the stepmother came along. All mention of my deceased mother stopped, they isolated us from my mom's family, and then added fun emotional and psychological abuse. My mom's side is now my only family (except from my sisters, who are the only connection I have to my awful father). They are still very upset about what my father did and feel awful that they didn't (couldn't) intervene. I'm now older than my stepmother was when she married my father, and I absolutely could not even imagine being so awful to a child.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "OP is a part of the \"I was just being honest\" aka the 'keeping it real', 'I'm just a blunt person', 'speaking my truth', 'telling it like it is' group of assholes who seem to think that their unsolicited, useless, and unwelcome opinion just needs to be said no matter what. \n\nOP you (and your parents) are AHs. Your opinion didn't matter and like the above comment said, it was hurtful and not your place to say anything. \n\nThis was not her ex. This was her husband. He passed away. Leave her alone and develop some tact. Also - she is NOT hypersensitive like that your parents have noted.",
          "id": 130,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "Is she just supposed to throw them away?",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "There's no way that his brothers stare meant anything other than \"you'd better keep your fool mouth shut\" because he knew what was coming. From the very little we get about what the brother said I'm guessing OP has a habit of being an \"obnoxious AH\" followed immediately by \"it's just my opinion.\"",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "\"You don't through people asses away because you have a boyfriend. \"\n\nMy new favourite typo.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "It's not on the same level, of course, but I have an urn with my dog's ashes in it that I \"display\" (read: put on a shelf with a photo of her and me) in my house. I would be very upset if someone said that was weird, and it isn't even truly comparable to having a spouse die and keeping their ashes. \n\nShe is keeping the only piece of him she has left and there is nothing wrong with that.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And it's not even like the widow moved into the BFs house and placed the urn there. It's the Dead Husband's house ffs... I'd be rolling in my grave (urn?) wishing I could say \"It's a bit uncomfortable for you assholes to be in my house\"\n\nOP is an idiot",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6299,
      "content": "YTA for referring to the husband as an \"ex\" as well as for being rude and insulting. Just because he is dead does not make him an ex. He is still a treasured part of her life. Let me put it to you this way; if your mother died when you were a child and a lovely person who you love just as much adopted you, would your mum be your \"ex mum\"? Would you want to get rid of everything to do with your mum now that you love your adoptive parent? Or would you expect your adoptive parent to let you love both your deceased and them?\n\nIt is the same.\n\nYou only find it weird because a) you have a childish idea of ashes being \"creepy\" and b) i suspect you think your brother should feel weird because he's competing with the deseased husband when in reality there is no competition. \n\nGrow up.",
      "id": 136,
      "comments": [
        {
          "score": 851,
          "content": "This is the best one I've seen. Could you imagine your mother dying and then your stepmother comes in, does a wonderful job helping to raise you, and then tells you it's creepy and disrespectful to keep your ex-mother's ashes. I hope this kid realizes how much of an AH he is and genuinely apologizes.",
          "id": 137,
          "comments": [
            {
              "score": 227,
              "content": "The sad part is that this “kid” is 23 years old",
              "id": 138,
              "comments": [
                {
                  "score": 53,
                  "content": "I only read the title and skipped to the comments because i knew he was TA, but I thought he was 12. You're telling me this is an adult???",
                  "id": 139,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Might as well be 12 years old with the mentality he has",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Nah, I’d imagine this is someone who hasn’t formed a human relationship and barely left his house since highschool. Guy might be 23, but he’s nothing but an entitled, impertinent child.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Exactly this, and it's bizarre how many people like OP do not seem to get it. If it were literally ANY other loved one with a different kind of relationship, a deceased mom, grandfather, sibling, best friend, no one would ever question it or think that it was weird to keep their stuff or not \"move on,\" but because this was the girlfriend's husband OP stuck his nosy nose where it has no business and says that it's weird? OP is a dink and has a whole lot of growing to do before he's ready for an adult relationship.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3418,
      "content": "[deleted]",
      "id": 143,
      "comments": [
        {
          "score": 373,
          "content": "I feel like everyone is missing your second point! Like sure if this was your own relationship and it was something you were uncomfortable with, you should discuss. But this isn’t OP’s relationship! Your brother is a fully grown man who, even if he was uncomfortable, can discuss any issues HE has with HIS girlfriend (no you involved).",
          "id": 144,
          "comments": [
            {
              "score": 202,
              "content": "[deleted]",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Even his edit doesn't help:\n\n>Yes, I overheard my brother venting about the urn when he first moved in just so you know.\n\nJust because his brother vented about something doesn't mean he wanted anything done about it. Sounds like he had an emotion about something and then processed and accepted it. Like a normal person. Part of the reason venting to people is so beneficial is because you need to say something out loud to process it internally",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "That’s the part that got me but that’s because I (28yrs old) had a recent issue with one of my parents trying to control me and get involved in my relationship. I’m a grown woman. Why are you sticking your nose in my business?",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "That's the biggest thing that stood out to me too. He also said his brother's silence *probably* meant yes, he was fine with the ashes, and he *still* decided it was reasonable to butt in and give his two cents.\n\nHis behavior and attitude shows he has absolutely no concept of how complex grief can be, but his behavior towards *his brother* is honestly just as concerning. It's like he asked his brother how he felt just to open up the conversation so he could start imposing his own feelings on to them.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I can’t believe he felt so high and mighty to even HAVE an opinion about their relationship. Who tf does that?!",
          "id": 149,
          "comments": [
            {
              "score": 16,
              "content": "[deleted]",
              "id": 150,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Not even uranium is that dense.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2240,
      "content": "YTA, seriously read the room.....\n\nAlso why did you feel the need to meddle in your bros relationship, and then double down repeatedly",
      "id": 152,
      "comments": [
        {
          "score": 867,
          "content": "For real, I bet that long stare the brother was giving was actually a “shut the fuck up” stare and OP totally missed it",
          "id": 153,
          "comments": [
            {
              "score": 586,
              "content": "I mean the if the stare wasn't enough the .....\n\n> \"none of your goddamned business, shut your mouth Elijah, jeezus!\" \n\n\nShould have been!",
              "id": 154,
              "comments": [
                {
                  "score": 97,
                  "content": "And then doubling down AGAIN... Jeez.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "Or it was a stare of sheer bewilderment at how his brother could be such an insensitive ass!",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I'm surprised bro didn't hustle him out of the house \"sorry honey, but my brother has to go....\"",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "The stare was the brother wondering how the hell his sibling could be so far up his own ass.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Right? His brother gave him a warning/STFU you moron/WTF are you doing glance and he misreads it as my brother must secretly agree with me so I must attack this woman to protect my brother's honor. So he does. He is clearly upsetting her but he just keeps yammering obnoxiously at her until his brother blows up and she leaves the room.\n\nNot once during this whole aggressively rude interjection of his unwanted opinions, in spite of noticing that both his brother and his brother's girlfriend are upset, does he ever stop and say, \"hey, this is clearly upsetting you and derailing our night, I'm sorry for bringing it up\". He just keeps trying to justify his shitty and insensitive opinion. And then on the way home he thinks \"Should I maybe apologize?\"\n\nNo buddy, what you should do is tell your shitty parents to stop reinforcing your total lack of social awareness, boundaries, and empathy with their callous hypersensitive assessment and then do some serious self-examination of your own to try to figure out why you couldn't see why that was likely to upset your brother and his girlfriend. And then apologize. Sincerely. \n\nI mean really. That's a question a 13 year old should have known not to ask at this social gathering. At some point, in spite of your protestations, it doesn't matter if it was malicious or just complete dumbassery. The effect is the same.",
          "id": 159,
          "comments": [
            {
              "score": 11,
              "content": "Best comment in this thread. The big things I noticed were:\n\nA. Misinterpreting what was likely a “stfu dude don’t do this right now” stare as an “I agree with you but don’t want to say it out loud” stare. \n\nB. Not realizing after the first or second comment that this was a sore topic and it would be wise to switch to something else.\n\nC. After it became clear that it was a touchy subject, instead of displaying any level of introspectiveness or empathy, doubling and tripling down on his position in order to justify his take on the matter. \n\nFucking weird.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "The fact that OP thinks his edits about intent change a thing. Every time he doubled down showed a complete lack of empathy and care towards anyone and anything but his own narrative. I'm amazed at how ignorant one person can be.\n\nYTA",
          "id": 161,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1347,
      "content": "[removed]",
      "id": 162,
      "comments": [
        {
          "score": 731,
          "content": ">\"It's just my opinion\"\n\nSomeone once said in AITA Reddit that if they wanted a shitty opinion, they would just fart.\n\n'ItS jUsT mY oPiNiOn' has the same vibe as 'ItS jUsT a JoKe/PrAnK'. I'm starting to hate these two sentences so damn much lately.",
          "id": 163,
          "comments": [
            {
              "score": 158,
              "content": "Haha I remember that one! I think she said “If I wanted an asshole’s opinion, I would just fart” sooo goood",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I think I hate \"It's just my opinion.\" So much, because it oozes confidence of knowledge, like the person knows everything. And therefore, their opinion is the most valid.\n\nIronically, it's the people who say \"It's just my opinion\", whose opinion's are so often the most invalid.",
              "id": 165,
              "comments": [
                {
                  "score": 19,
                  "content": "It always gets me when people say “it’s just my opinion” when they are *factually incorrect* too. Like no, not every dumbass statement should be respected as equally as the truth just because you claim it’s yOuR oPiNiOn, and it’s baffling to me that so many people think that’s how it works.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Let's add the old \"I was just being honest!\" to that list of sentences to hate.  All of them are the rallying cries of AHs everywhere.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 205,
          "content": "I wouldn't want his apology. I don't care if he understands or not. His personal growth is none of my business. Don't ever talk to me again at that point.",
          "id": 168,
          "comments": [
            {
              "score": 23,
              "content": "the fact that he even came here and typed this all out shows that he still didn’t feel guilty in the least and was probably looking for support to further prove why he’s not in the wrong.",
              "id": 169,
              "comments": [
                {
                  "score": 20,
                  "content": "And then the edit where he tries to pin it on his brother too, despite saying in the story that he didn’t know his brother’s opinion before the confrontation. Zero personal responsibility.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Even if the brother did vent in private, so what?\n\nHaving complicated feelings about stuff like this is normal.  Discussing these feelings in private, with people who aren't his wife, is the healthy way to handle it.\n\nThat's how Ring Theory works.\n\nI'd say that OPs an asshole with the empathy and emotional intelligence of a rock but that'd be an insult to rocks- and assholes.",
                      "id": 171,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "I agree. I wouldn't accept an apology for this. Anyone giving me a hard time for continuing to grieve someone I care about doesn't need to be in my life\n Full stop.",
              "id": 172,
              "comments": [
                {
                  "score": 23,
                  "content": "I've cut people out my life entirely for a whole lot less.\n\nI cannot disagree with either of you.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 156,
          "content": "I don't believe his doe-eyed \"who me?\" portrayal. I don't think he likes her that much and wanted to say something regarding a subject that he's more than aware is none of his business. The fact that his brother didn't look shocked, probably means he's tried to bring this up with him previously, and his brother shut him down. He knows he shouldn't have said what he said. He just thinks his morbid curiosity is more important than literally anything. The truth is he doesn't get to be curious about her deceased spouse outside of his own head. THE AUDACITY!",
          "id": 174,
          "comments": [
            {
              "score": 16,
              "content": "I have a cousin, who I have cut out of my life, he's younger, and numerous times has commented on my life and then said, \"It's just my opinion.\"\n\nSo it wouldn't surprise me either if this isn't the first time. But also, I think people like this actually enjoy getting under people's skin. I've seen how my cousin is with his mother, and some of the things they say to each other at times are disgusting, but then they are friends after. It's a weird relationship to me. But whatever, y'all wanna be toxic? You do you, I'm out. - Also, that cousin, does the doe-eyed \"who me?\" bullshit too. It's not cute, and it isn't funny. It's just offensive and makes that person look like an insensitive fuckhead.\n\nAll of that being said, I don't have a problem with the curiosity part so much, so long as it's respectful. So I personally might inquire and ask if the girlfriend feels solace, or if it is even solace that she feels by having the ashes in her home.\n\nBut I would be doing it for my own personal growth, to understand other people, and also how to grieve when that times comes for me.\n\nBut I would also be waiting a while to ask, once I felt I knew the person well enough, and would have spoken to the brother first to make sure it's a topic I can ask about. Because maybe she isn't able to talk about it at all. And you know what? That's totally understandable, and if she needs to grieve in silence, I get it.\n\nThis idiot dismissed all sense of decorum and barreled in there with his, \"You're kind of weird\", bullshit.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "And what the heck is wrong with his parents???",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "\"this clown is going to have a hard time in life\"\nHad a damn good laugh at that  🤣",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Not to mention, he belittled her relationship with her HUSBAND and his death by calling him her “ex”. This dude obviously needs some maturing if he doesn’t understand the concept that that man is not “some ex” that man was her husband that she loved and lost.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": ">none of your goddamned business, shut your mouth Elijah, jeezus!\n\nBtw, can we make this a flair. I feel like this is flair worthy.",
          "id": 179,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1301,
      "content": "YTA- the audacity to walk into SOMEONE ELSES HOUSE and voice an unwanted opinion. You owe her a very sincere apology, and you need to take space and a moral inventory before setting foot in their house again.",
      "id": 180,
      "comments": [
        {
          "score": 159,
          "content": "That's if he I is invited back. I was surprised the girlfriend didn't ask him to leave and just went in the kitchen. I would have kicked him out permanently if I was her. The disrespect to call him an ex like he left her and she isn't over it.",
          "id": 181,
          "comments": [
            {
              "score": 16,
              "content": "Sounds like she just didn't want to deal with OP by that point. An \"I'm was done, my husband can handle taking out the trash.\" sort of deal.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "Not only that but he KEPT ON TALKING! He had *so many chances* to say “You know what, you’re right, I’m so sorry, that was a thoughtless thing to say, I can’t imagine what you’ve been through.” The gf kindly gave an explanation, yap yap yap. Brother says shut the hell up, yap yap yap. Just ridiculous",
          "id": 183,
          "comments": [
            {
              "score": 33,
              "content": "LOL and I love the astounding lack of empathy that he has to have in order for him to not even have the thought of \"I can't imagine what you've been through.\" Nope, in OP's mind, it's all about what a boner killer having her dead loved one's ashes must be for his big bro.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1226,
      "content": "YTA\n  \nShe's not hypersensitive.  \n\nHer feelings for her husband didn't vanish because she started dating someone else.  She may have plans to be buried or interred with him.  Maybe she wants to be cremated and have both of their ashes released.  \n\nMaybe she's still grieving and not ready to let go.  \n\nWhatever her reasons are, it's not your business to pressure, judge or criticize. \n\nMyob",
      "id": 185,
      "comments": [
        {
          "score": 568,
          "content": "I'm struggling to understand what about her behavior is even being construed as \"hypersensitive.\" She made an astute comment, which is that OP shouldn't date a widow if he's not comfortable with someone memorializing their late spouse, and then excused herself from the inappropriate conversation. She didn't make a scene or have a meltdown. She handled the rude behavior extremely graciously.\n\nIf anything, the brother was the one who responded more sensitively (though completely warranted and not an overreaction at all), but I guess men can't be oversensitive when they express emotions, just women.",
          "id": 186,
          "comments": [
            {
              "score": 186,
              "content": "Because she's a woman.",
              "id": 187,
              "comments": [
                {
                  "score": 201,
                  "content": "Her ovaries were vibrating too fast—it made her hysterical. Happens all the time. Just yesterday my girlfriend got too mad and then just helicoptered away on a stiff breeze. \n\n(/s Jesus Christ)",
                  "id": 188,
                  "comments": [
                    {
                      "score": 27,
                      "content": "oh man, I want to learn to helicopter!\n\n\"ovaries engage!!!\"  <brrrrrrrrrrrrrRRRRRRRRROOOOOOOOOOOOOMMMMMM!>  off like a flash.\n\nyour comment was a nugget of joy born from this utterly infuriating post - ty.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "It's funny you say that, I heard someone say women are bad drivers because the bumpy road has the same effect - vibrating them, stirring up their hormones, putting their emotions on high, ultimately messing up their ability to make judgment calls, and can't drive.\n\nGuess they're fine in the passenger seat or back, just not driving. 🤷‍♀️🤦‍♀️",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "I feel like these parents do a lot coddling with this child. \n\n\"Oh he doesn't mean it\"\n\"He just jokes like that sometimes\"\n\"Boys will be boys\" \n\nLike, wtf... If that was my kid I would have apologized profusely for his shitty words and spent the whole way home explaining exactly how shitty what he just did was.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "That got me too. How could she possibly be hypersensitive for not capitulating to some stupid hang-up that her boyfriend’s immature little brother has? \n\nA widow having an urn is *NOT* a red flag but someone demanding that their partner delete all traces of their late partner would be.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Um yeah gotta love a world in which a woman having LITERALLY NO REACTION AT ALL to something outrageously rude and un-empathetic is considered being \"hypersensitive.\"",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "She’s not hypersensitive at all. They sure wouldn’t be allowed back in my home that’s for damn sure.",
          "id": 194,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "Yup! After my older sister's mother (who was a 2nd mom to me) passed away, her husband kept her ashes so he could be buried with her. While I personally wasn't super excited about not having a gravesite or such location to visit, it is moving that he wanted to make sure they were together.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}