{
  "post content": "Last week, I was using my sister Ashley’s phone because mine was dead and I needed to call a friend to confirm plans. Dialing my friend’s number, I saw a tinder notification of some dude messaging her. Immediately, I asked why she’s on tinder (she’s 17) and she grabbed her phone back and said “none of your business” \n\nI decided that I wanted to have a little fun with this. I wanted to give her the benefit of the doubt (maybe she’s just swiping for fun?) so I didn’t want to go straight to ratting her to our parents. To test if she was just using for fun, I decided I was going to make a tinder profile (of someone else) and message her and see if she responds. I asked a good friend from back in college (who happens to be a male model) Kevin if he’d mind if I used his pictures and explained the situation. He thought it would be hilarious and told me to go for it. \n\nI created the account, set my age to 22, set my swipe radius to a mile, and quickly found my sister’s account. Her age was set to 19 (lie, she’s still in **high school**) so I was definitely more suspicious of her now. I superliked and less than an hour later, she matched AND messaged me. \n\nI decided to set up a date to a fancy restaurant downtown for Sunday afternoon and told her we could “head to my place afterwards”. She was completely receptive and said she’d meet me there. She told our parents she was hanging out with one of her track friends and spending the night at her place. \n\nAfter she left, I told our parents EVERYTHING and showed them all of the messages. They were pissed, and I suggested we all go to the restaurant. My dad and I just went instead and saw her sitting at a table alone all dolled up waiting for “Jim”. My dad went up to her and said “Jim’s not coming” and she screamed and asked what we were doing there. I told her that there was no Jim and that it was fucking stupid of her to be trying to meet grown men on tinder at her age. My dad harped on to that and lectured her on lying and meeting strange men on the Internet, and being so willing to go back to a *stranger’s* place. We were a bit loud so people were starting to look at us and my sister eventually bursted into tears and ran out. \n\nI told my friends in a groupchat the situation and they all agreed it was hysterical, except 2 of my female friends who said I was a “fucking dick” and “cruel” to her. My other friends defended me and said she needed to be taught a lesson. Wondering who’s right and if I went too far?\n\nEDIT: Yes, when I asked if she wants to go to my place afterwards, it was heavily implied that she would’ve had sex with Jim. That’s why I went the extent that I did.\n\nAlright after reading all these judgments, I came to the conclusion that I’m TA. But I’m TA she needed. If anything, she knows not to be a complete moron when finding people to hook-up with on tinder. \n\nAnd to the people who said she’ll never speak to me again, we just finished playing fifa for the last hour so ¯\\\\\\_(ツ)_/¯",
  "id": 1,
  "comments": [
    {
      "score": 16827,
      "content": "YTA - You played a cruel ass trick on your sister because it would be “fucking hilarious”. I would have had difficulty, but ultimately probably came down on your side of you’d just told your parents when you first saw it. But you devised an elaborate trap first? No, asshole move.",
      "id": 2,
      "comments": [
        {
          "score": 8426,
          "content": "However I think that it’s clear that him getting his sister to meet this fake person really drove the point of how dangerous her behavior is home. He proved that his sister could be lured by any random person posing to be someone else. If he had just told his parents what she was doing, everything would be speculation of what COULD happen and would not reveal the danger of her actions anywhere near as clearly.",
          "id": 3,
          "comments": [
            {
              "score": 3953,
              "content": "She's 17 and I guarantee you she knows perfectly well what *could* happen. It's hardly OP's place to \"teach her a lesson,\" particularly when he seems far more interested in laughing at her humiliation than actually making a point about keeping herself safe.",
              "id": 4,
              "comments": [
                {
                  "score": 2967,
                  "content": "Eh, teenagers downplay risks like that. It’s only thing to objectively tell her you don’t know who you’re actually meeting, it’s another to show her it’s this easy for a guy to get you alone and that’s a huge risk. \n\nBut ya, he definitely doesn’t seem like her safety is actually his #1 priority. He’s an asshole for sure.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 521,
                      "content": "I agree. They do downplay risks like that, but she's about to be an adult who's entitled to make her own choices and she's going to have to learn how to navigate these situations. At least she met up with him in a crowded, public place. If he was someone other than OP and still a catfish, there would have been opportunities for her to get out of there.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Teens are not as stupid as we think. She probably had her location Live shared with at least 2 people.\nBut you just don't do what op did. If op wanted to  show sister the real risks he would have shown her some Christian hensen shit. Not humiliating her because it's \"fucking hilarious\"",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": ">it’s this easy for a guy to get you alone\n\nexcept that never happened....... she wasn't alone. she was in a crowded public restaurant getting accosted by her father and creep of a brother. he's exactly the kind of person I imagine thinking \"If anyone's gonna have sex with my sister its gonna be me\"",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My fifteen year old neice was staying with me for the weekend and talking about how hot 18 year-olds were...and was just trying to talk to fucking strangers.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 197,
                  "content": "You're delusional if you think any 17 year old would fully comprehend the dangers around that situation.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 380,
                      "content": "you're delusional if you think her takeaway from this is \"Ahh, Tinder is a risky way to meet up with people. They could fool me and be creeps, or just someone other than their picture!\" instead of \"My family is the worst. I'm so excited to move out, and I hope something terrible happens to them.\"",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 75,
                      "content": "No one can \"fully comprehend\" just about anything at any point in their life. The frontal lobe isn't fully developed until around your mid twenties but as a society we still permit young adults to drive, enlist in the military, smoke, drink, and partake in all sorts of risky behaviors. Part of growing up is learning how to navigate these kinds of situations. No one expects perfection, but she's less than a year away from being an adult.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm 23 and I didn't comprehend a situation which led to my assault. Age has nothing to do with it.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "Yeah, how dare the OP try to show his sister how deceiving people on Tinder can really be. And obviously she doesn’t know what could happen, either that or she is blinded by an ignorant “it can happen to other people but not to me” mentality. If she knew that people can be deceiving and fake then I don’t see why she would be so shocked when Kevin didn’t really turn out to be Kevin. Whether she knew the consequences or not, what she did was wildly irresponsible and needed to be taught a lesson.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 525,
                      "content": "I think the issue here is simply how he administered said lesson (assuming of course we actually go with the notion that it's an older brother's responsibility to do so). Just because she \"needed to be taught\" doesn't justify the severity of the response.\n\nThere were ways to do this in a manner that could have been impactful and less hurtful, but instead they turned it into a gag, and made it as embarrassing as possible.\n\nThere's several stages where OP could have stopped:\n\n1. Could have personally warned sister against the dangers of dating apps.\n\n2. Could have informed parents and let them deal with it.\n\n3. Could have told Sister before actually going ahead with the \"date\" after she agreed.\n\n4. Could have told parents before letting her go out on her own, potentially putting her safety at _actual_ risk.\n\n5. Could have found an excuse to extricate her from the restaurant in a less devastating manner, such as texting from the fake persona to come outside.\n\n6. BONUS POINTS: Could have _not_ bragged about it to his friend group and then have the gall to be surprised when they call him out on his shit.\n\nSure, maybe now she's learned not to trust people on Tinder.\n\nYknow what else she's learned? Not to trust her brother with anything again.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 116,
                      "content": "Needed to be taught a lesson for... going on a date with someone slightly older than her? I understand the issue with legality here, but she is 17 not 14 and she can fully make her own decisions. There are dangers for women to go to the GROCERY store alone but no one is teaching anyone a lesson about that.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 62,
                      "content": "And you think what her brother did taught her any kind of lesson? In case you’re unsure: No it did not.\n\nHe admits to doing it to fuck with her and admits to laughing about it w his friends. What he did was shitty and quite possibly the *only thing* it taught her was how to be more sneaky.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "[deleted]",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "You mean like how deceiving her brother was? He showed her in spades that he is if nothing else. Now am I saying what she did was not dangerous? I actually think those kinds of apps are crazy dangerous no matter how fucking old you are. But let’s just think about how her brother and parents showed up at the restaurant and got loud then and there. They could have taken her home and talked about how this kinda proves that you have no idea who you are agreeing to meet on shit like Tinder. They are the assholes, loud ones at that, and ones who should expect her to get waaaaay more secretive in the future.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "What? This is how you think people should show how tinder can be dangerous? Are you going to show how driving can be dangerous by pretending to wreak with her too?",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "She wouldn't of learned a lesson she would've thought her family are assholes and she can't wait to really do somthing like this to spite them. The OP didn't wanna teach her a lesson they wanted to laugh at her",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "He didn't try to show her that, he was deliberately humiliating her. If you're trying to teach your little sister a lesson you're not going to call her out on promiscuity in a crowded restaurant and then go on to laugh about the story with your buddies.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "“Hey, Sis, I noticed you’re on Tinder and I just wanted to give you the big brother rundown on being careful because there’s a lot of shitty guys out there”\n\nIs that so difficult?",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "Agreed; 17 sounds young from a 21+ y/o standpoint but think about it: when you were in high school you were probably on Hot or Not, and maybe Tinder too. I was on tinder before they made an age limit and there were plenty of high schoolers on there that I matched with while I was around the same age. \n\nDisrespecting your family's privacy is one thing, but humiliating one of them and making them feel miserable in public for no reason? YTA. \n\nIf you were actually concerned about her behavior, you should've been okay with sitting her down and letting you know that you car about her safety and that not all guys are what they seem. This might not have been as effective in your eyes, but you're probably not stopping her from using tinder in the long run by playing a mean prank on her.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Definitely. I look back and cringe thinking about how mature I thought I was at the time. Now when I see 11/12 year olds with Instagram profiles I freak the fuck out thinking about how young they are to be on a platform like that. Still, my generation was all on MySpace/Facebook from a young age. It was \"normal\" and expected. Some people made stupid decisions and there were definitely creepers, but my parents' generation was certainly sneaking out to hang out with the college kids and party in high school as well. We're just more aware of it now.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Legal age is 16 in a lot of other places in the world. As far as I'm concerned, 17 is a fine age to be a having sex. She didn't do anything really wrong and now he's humiliated her.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 343,
              "content": "OP’s attitude has as much to do with it as the behavior itself. Talking about deciding to have fun with it. Sharing it with other people, like the dude the photo came from, and friends in a group chat because it was hilarious. Suggesting a fancy restaurant for the date to make the biggest possible scene. None of it reads like someone acting out of genuine concern. It reads like someone trying to pull the cruelest prank they can. In the right circumstances, with a little more care, I could be convinced that this was a necessary way to teach the lesson and give sister the benefit of the doubt. There’s no doubt from the tone in which the story is told that it isn’t what’s going on here. OP is just being cruel, and so is the asshole.",
              "id": 28,
              "comments": [
                {
                  "score": 44,
                  "content": "This should be higher up. It’s one thing to teach your sister a lesson about safety and what not but this guy did it out of pure malice. He’s using the guise of “I wanted to teach my sister a lesson” and actually just humiliated her in a restaurant and in the group chat. Maybe if it was done in a different way I could go with NTA but he’s clearly the asshole here.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "Yup, this is the key. He did it for the theatrics and the lulz, or even worse out of some weird \"I need to punish her for being sexually active\" mentality. It's just all focused on maximizing the \"OH SHIT, YOU PLAYED YOURSELF, LOL YOU DONE FUCKED UP SIS\" moment for the lulz. Treating your sister like a vehicle for your own self-amusement and rationalizing it with \"well uh it's to teach her a valuable lesson\".",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 310,
              "content": "[deleted]",
              "id": 31,
              "comments": [
                {
                  "score": 78,
                  "content": "Seriously, she did everything right by setting up their first meeting in a public place where she had her own transportation.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 34,
                      "content": "So lying about her age is what ....? Everything right is horseshit she making grown people decisions without grown people backup. Had she met a serial killer none of them would have known anything or would be able to help in anyway.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Except, you know, the part where she lied about her identity. If this girl and a guy had done anything sexual, it would be grounds for statutory rape; which in all states (except California) is grounds for a VERY large sentence. \n\nShe also broke Tinder's ToS, which requires an honest age from the user. If anything had happened to her (ie. a case of statutory rape, Tinder could sue the hell out of her for abusing their platform and giving it a bad name over her lies.) This has implications that reach much farther than you think.\n\nSo, no. She did one thing right by meeting in a public place. She did everything else wrong.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 78,
              "content": "She agreed to meet somebody in z crowded upscale restaurant, that doesn't imply that she'd meet somebody in a crack den.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "She's 17 dude. Not 13.",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 70,
              "content": "And the price is likely the permanent loss of his sister's trust.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "[deleted]",
              "id": 38,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "What exactly is dangerous about her behavior?\n\nBest case scenario,  they meet, they click, and they go to the guys house to have consensual sex?\n\nWell what if is is lying about his identity? Suppose she stills meets/talks/eats with him, and doesn’t walk away immediately. Then either they click or they don’t . For all intents and purposes it carries the same risk of meeting someone on the internet who isn’t lying about their identity. Anything that could happen with a catfisher can happen with someone who isn’t lying about themselves on the internet. At worst, she’s a little more suspicious of someone who catfished (which is a bad thing).\n\n\nWell what if they don’t click? Typically the date ends there and they go one their separate ways. But we’re doing worst case scenario, so let’s assume he doesn’t want the date end but she does. Suppose she gets some weird vibes and begins to feel uncomfortable. So she goes restroom to think. Maybe she tells another woman in the bathroom, or calls a friend, or goes up to the bar/maitre de/any random waiter(ess) and tells she feels uncomfortable and ask for help. Either way someone else is alerted to the scenario, and she goes home alone.\n\nOkay, but what if he grabs her? She screams/yells/fights and everyone in the restaurant is alerted. Basically the same scenario as above.\n\nWhat if he has a gun? And won’t let her go to the restroom? Okay yeah, I’ll give you that one. I can’t see anyway out of a gun scenario. Guns are dangerous weapons. \n\nBut what if he spikes her drink? Okay, let’s suppose she leaves her drink unattended and he slips something in.  The vast majority of date rate drugs are fast-acting, and people don’t drink unattended drinks at the end of the date, so the date rate drugs would kick in before they leaves. I’m going to assume she’s wearing heels because it’s a classy restaurant. Well date rape drugs make your disoriented and clumsy, so she’s probably going to fall and slur her words. Of course, someone could just assume she’s drunk, but she’s 19 and hopefully hasn’t had any alcohol and the waiter would notice. Or she might starting fighting/yelling or she could call 911. Or she could straight up pass out on the ground. \n\nIdeally, she would have a friend near by or tell the staff that she shouldn’t leave with him unless she gives the okay. But she may not have known to do so, because this isn’t common practice or at least I don’t believe it is. \n\nBut what happens if they leave together and she changes her mind? The sad fact is when she’s alone with a perpetrator, it becomes much harder to get out of a rape scenario. Of course, this is true regardless of how long they’ve known each other and has nothing do with them being romantic. It could be a friend, a coworker, or a boss. \n\nIn 93% of juvenile rape cases are committed by someone known to the victim [Source](https://www.rainn.org/statistics/children-and-teens) . 8 of 10 rape cases, the victim knew the assaulter [Source](https://www.nsvrc.org/sites/default/files/publications_nsvrc_factsheet_media-packet_statistics-about-sexual-violence_0.pdf).  55% that occur at or around the victim’s house vs 15% that occurred in some public place like the street or a park or in “other” locations [Source](https://www.bjs.gov/content/pub/pdf/fvsv9410.pdf).\n\nThe fact is if she is going to be raped, it’s most likely going to be by someone she knows, not a stranger. The OP was TA and clearly wasn’t acting in his sisters best interest.",
              "id": 39,
              "comments": [
                {
                  "score": 31,
                  "content": "I mean worst case scenario is the guy's a serial killer, seduces her, takes her home, skins her, and then eats her. Pretty unlikely though.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 13,
                      "content": "That could also happen once she's 18, and could also happen to any one who meets any one on Tinder, or in fact people who already know each other and go on a date.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "> Best case scenario, they meet, they click, and they go to the guys house to have consensual sex?\n\nHonestly, the issue is less about her trying to exercise sexual independence and more about her lying.  Depending on the country/state, the age of consent could be 18.  In which case, she would be causing the unsuspecting fellow to commit statutory rape which could result in a prison sentence and a lifetime sex offender registration.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I agree on the lying, complete dick move. But I doubt that is the ‘lesson’ the brother was trying to give. Age of consent shouldn’t really matter in relation to the danger this girl faces, it’s just a number (when someone is this close to being 18 obviously). I mean this would be perfectly legal in the UK, assuming the girl lied about her age so she appeared over the age of consent, which is likely.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "[deleted]",
              "id": 44,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 323,
          "content": "Is no one bothered that the sister was lying about her age and \"Jim\" would have been having sex with a minor (state depending)?",
          "id": 45,
          "comments": [
            {
              "score": 274,
              "content": "Yeah several people have brought that up and people keep saying \"well most states that's totally legal for people of those two ages to have sex or it's \"just\" a misdemeanor.\" Well how about maybe the guy doesn't want to have sex with a fucking high school student. She's tricking this guy into probably having sex with her. Regardless of the legal consequences that's fucked up. Just gets extra fucked up if it is illegal where they are.",
              "id": 46,
              "comments": [
                {
                  "score": 100,
                  "content": "Thanks for saying this. It’s beyond fucked; i couldn’t look at myself if I found out the girl I was fucking was actually a sophomore or junior in high school. That’s beyond fucked up and the fact that people are pretending it’s no big deal astounds me.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Maybe because those posters are also in high school currently.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "It’s the age thing. They can’t think hard on it because it’s just not in their scope yet. When I was in high school, a girl in my grade skipped school to meet someone at a local mall. She thought he was 14/15 like we were at the time. He was substantially (40s?) older and abducted her from the crowded mall in the middle of the day. She was found about a month later. Alive but very much worse off. She followed the rules of public place for a first meet, though, so there goes THAT theory. \n\nThe other thing is that every state has different laws around the age of consent. So if OP lives in a state where consent is legal at 16 or 17 (and there’s no conditional clause limiting the age range between partners who are under 18), this was a dick move by the sister but a completely legal one. BUT if the sister lives in a state where there IS conditional consent or where the age of consent is 18, she is putting the futures of these men at risk. There’s no defense for not knowing the age of the other person. \n\nPlus, what relationship is formed on a lie and lasts?",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "THANK YOU\n\nThe girls actions could arguably be considered sexual assault (if she had sex).\n\nIt’s sex under false pretenses that would drastically change the likelihood of a 22 year old guy wanting to sleep with her (regardless of legality).",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Legally it’s rape to have sex under false pretenses, but in this case the man would get charged anyway. He probably saved some poor bastard’s ass.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "This makes her the bigger asshole imo. She's being irresponsible and risking fucking over anther person's life. Lying like that. Even if no legal consequence came off it, she could create a world of complications for someone. \n\nThey alsom let people set age ranges for a reason. It would be an asshole thing to set age to  22 when you are 20. Not just because of alcohol, different ages mean different stages of life and maturity. Lying in her situation is especially shitty.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 173,
          "content": "I agree. OP should have talked to their parents. And you know how i know that? Same thing happened to my sister who had provocative pictures online when she was underage.   \nI was concerned, because there were legitimate creeps writing her, but I also didn't want to rat her out. Like I used to rat my sister out for stupid stuff, but this time it actually seemed legitimate. It was a tough choice, so I told my mom. Who explained to my sister that when she's 18 she can do and post whatever she wants, but not before that. My mom also said that I didn't tell her but that she walked in and saw it on the desktop and it worked.  My sister started being more careful up until she was 19 even. When someone else brought up her provocative photos from this and last year, my mom is like \"She's 23 she can do what she wants with her body\"  \nHonestly my mom my sometimes have been judgey (and I have complained about it on reddit) and had her problems, but some things she handles quite well. \n\nWhat you and your family did was fucked her up. Teaching responsibility on the internet and social media is not done this way. YTA.",
          "id": 53,
          "comments": [
            {
              "score": 4,
              "content": "By careful, do you mean she stopped posting the pictures or just was better at hiding she did it?",
              "id": 54,
              "comments": [
                {
                  "score": 7,
                  "content": "She stopped posting pictures",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "Fake Jim could have gone to jail if he were real\n\nNot cool. ESH\n\nEdit: actually depends on the state. \n\nINFO: what is the age of consent OP",
          "id": 56,
          "comments": [
            {
              "score": 7,
              "content": "18 where I am",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 117,
          "content": "100%  right. The goal was to humiliate and punish, not educate and/or protect his sister.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "Yeah, I'm torn. I think she did need to be taught a lesson, baiting people into Catch a Predator territory is 100% awful and holy shit, but I question OP's intentions. Did he really want to help his sister, or just see an opportunity to prank/humiliate her?",
          "id": 59,
          "comments": [
            {
              "score": 200,
              "content": "To me, four things convinced me that it was for the purpose of pranking and humiliation. \n\n1) OP’s throwaway name is basically “funny tinder prank”. I think that speaks a whole lot to the primary motivation when he makes sure to note that it was funny in his username. \n\n2) “I decided I wanted to have some fun with this.” He starts off discussing the scheme by noting that he was doing it because he wanted to have fun. I believe him. \n\n3) Bragging about it to the group chat afterwards. If you’re really just doing what is necessary to protect your sister and teach a lesson, you don’t go giggle about it with your buddies afterward. \n\n4) He make sure to mention twice, both in discussing the group chat and in talking to the guy providing the fake pictures, that they agreed it was hilarious. The hilarity is the important message for him to communicate.",
              "id": 60,
              "comments": [
                {
                  "score": 8,
                  "content": "Honestly, pretty much all of this. Looking out for your sister and teaching her a lesson (that lying about your age on the internet as a minor can have serious consequences) is a totally fine thing to do, but the execution and the OP’s actual intent are both pretty shitty.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I still don’t see how this was teaching her a lesson what so ever.. \nso because she was catfished by her brother it was a lesson? Because at the restaurant it turned out to be her brother and dad rather than her date? It didn’t teach her a lesson.\nShe’s definitely just hating her family right now and isn’t thinking oh I should be careful when I meet up with someone on tinder.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 99,
          "content": "So the Sister is not an asshole for putting those poor guys in a place where they unknowingly commit statutory rape?\nESH\nMostly Sister because what she does it jepordizing those guys future while OP only humiliates her with no future reprecussipns.",
          "id": 63,
          "comments": [
            {
              "score": 49,
              "content": "In 40/50 states, the sister was the age of consent.",
              "id": 64,
              "comments": [
                {
                  "score": 25,
                  "content": "True, but how many want to bang a 17 year old?",
                  "id": 65,
                  "comments": [
                    {
                      "score": 164,
                      "content": "the answer to this question may shock you",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "Probably a lot of horny 22 year old guys who are ok with having sex with women of the legal age..?",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Why do you think it would be statutory rape? The OP didn't say he was in a state where the age of consent is 18. In almost all states the age of consent is 16 or 17.",
              "id": 68,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "Telling friends was the big thing for me.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I could tell from the title he’s an asshole. “Teach her a lesson”, that’s not your fucking job dude. Like you said, just tell parents and let them handle it.",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": ">YTA - You played a cruel ass trick on your sister because it would be “fucking hilarious”. \n\n\nHim mentioning how he and all his friends thought it was hilarious bothered me too. I think it was a necessary action take, but I am in part doubting it was all for the benefit of the sister and not also in part a gag/prank.",
          "id": 71,
          "comments": [
            {
              "score": 7,
              "content": "I think the combination of his attitude, (“I decided I wanted to have a little fun with this”), combined with not telling the parents much, much earlier than he did, combined with the laughing about it with friends, combined with him even making his throwaway name basically “funny tinder prank” leads me to believe this was done in order to humiliate her and the lulz. There were just so many better ways to handle the issue than this. Not saying it wasn’t an issue, but c’mon.",
              "id": 72,
              "comments": [
                {
                  "score": 4,
                  "content": "Agreed. Juvenile way to handle a serious situation.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9103,
      "content": "ESH. The execution was a bit over the top, but the underlying lesson was an important one  - she ignored the age requirement and was willing to go back to a stranger's place.\n\nBut what stopped you guys from telling her to come home and then giving her a lecture?",
      "id": 74,
      "comments": [
        {
          "score": 1144,
          "content": "I mean, she was going to meet him at a restaurant in public first. Who’s to say she really would have gone to his house?",
          "id": 75,
          "comments": [
            {
              "score": 2561,
              "content": "> She told our parents she was hanging out with one of her track friends and spending the night at her place.\n\nShe laid the groundwork for it",
              "id": 76,
              "comments": [
                {
                  "score": 168,
                  "content": "It's concerning but it'ss not that out there. I knew people from other countries that were in my year at university who were 17 for example. I presume they had one night stands in that time",
                  "id": 77,
                  "comments": [
                    {
                      "score": 681,
                      "content": "In some states she is under the age of consent so she could be setting this “guy” up to commit a felony. Also really shitty to lie to someone you plan on being intimate with.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Do you think if a guy was 30, and lied and said he was 20 to hook up with an 18 year old, he’s l NTA? How’s this different? She lied to secure dates/sex under false pretenses...",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Ummm, yo, she can say no if she doesn't like him. It's not legally binding.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yes, absolutely. But she demonstrated a willingness to consider it, which is alarming in its own right.",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "There's a reason tinder is known for hook ups and why couples who meet on tinder tend to be in the minority.",
              "id": 82,
              "comments": [
                {
                  "score": 100,
                  "content": "Idk if you've been on Tinder in recent past, but it's no longer a hook up app. I'd say 1-3% of girls I see are on there to hook up. \n\nThere is a good percentage that straight up says \"looking for friends\" and almost every one says \"not interested in hook ups\" or \"NO HOOKUPS.\" \n\nTinder in this day and age is filled with people looking for Mr. Right, not Mr. Right Now. Not to say they don't exist, but not like it used to be.\n\n\nEdit: JFC. Apparently I need to clarify. Not everyone who puts \"no hookups\" in their bio actually necessarily means it. I've met plenty of people who just throw that in there for whatever reason, whether it's meant to filter or some who just don't really *intend* on hooking up, but hey you never know what will happen when you meet someone and sparks fly.\n\nMY POINT IS: When Tinder first came out, it was 100% for hookups. Now there are shitloads of girls on there that are just looking for friends, new to town, whatever. Hell, I have seen couples on there saying \"Happily married and not trying to do anything weird, we're just new to town and don't have any friends! Let's go on a hike!\"",
                  "id": 83,
                  "comments": [
                    {
                      "score": 200,
                      "content": "I hate to break it to you, but I've hooked up with women on Tinder who've had the \"NO HOOKUPS\" on their profile. \n\nIMO its not that they don't want hookups, its more of an attempt to preemptively shut down the endless stream of really aggressive/no tact men who borderline harass all of their matches.\n\nTinder, imo, is still very much a hookup app, in the sense that the vast majority of the people I talk to on there are not interested in a relationship. If anything, I feel like most women are on there for the instant gratification/male validation (although this doesn't have to be hooking up).",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "> almost every one says \"not interested in hook ups\" or \"NO HOOKUPS.\"\n\nOh well if it's in their profile, it must be 100% accurate.",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I have to agree, maybe I’m just unfuckable to the mainstream as a crip but I met my two best friends on tinder. It’s not like there’s no hookups happening obvsly but friendships do happen quite often",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Do you give the guys on *To Catch a Predator* the benefit of the doubt? Of course you don't. Stop bending over backwards to make the sister seem like the victim here. The sister was willing to let a college student unknowingly commit a felony and get on the sex offender's list for life. You necessarily have to condemn her.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 164,
          "content": "Yea this whole thing is so odd, I frankly don’t believe it. I couldn’t imagine messaging my younger sister on Tinder saying I’m bringing her back to my place, I don’t want to see what she says to that. Imagine tricking your sister into shaving and getting all ready for a date with yourself. \n\nYounger sister is young and needs to learn some things but the response was completely over the top and will likely be damaging to the relationship.",
          "id": 88,
          "comments": [
            {
              "score": 20,
              "content": "So there was a time before smart phones, when the internet was finding its way into mainstream. AOL chat rooms were really toxic and a lot of people were taking advantage of impressionable teens (pedophiles). It definitely made the news in my area that parents needed to have a talk with their kids about the dangers of the internet and how someone may not be who they are. This is just this generations aol chat room and I can very much see something like this happen because it has happened in the past.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Because the point was to shame her. Which is really crazy if you think about it because shes legal in most places. Will they stop when shes graduated high school? Turn 18? Move out? Idk this is not making me comfortable",
          "id": 90,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5825,
      "content": "ESH. What she's doing is extremely dangerous, for obvious reasons. Unfortunately what you did is more than likely just going to push her further away. She will probably just try harder to hide things. Something else is likely going on in her life that's encouraging her to seek attention from older men.\n\nInvading her privacy, lying to her, and humiliating her is going to make her less likely to open up to family about her life and make it harder for you and your parents to support her.At Seventeen is unlikely she's really going to learn anything from embarrassment or punishments from parents.\n She's either going to have to learn things the hard way, or she's going to have to learn them by maturing. \n\nLegal age of majority or not, she's viewing herself as an adult able to make her own decisions, so any interference from family will be unwelcome and resented. And considering that she will be turning 18 soon, there will be very little your family can do to keep her from dangerous situations if she wants to put herself in them.\n\nEdit: spelling\n\nAnother edit: Apparently what I thought were obvious reasons are not that obvious to others here. What makes this dangerous is not her age. Doesn't matter if she's 17,18, or 40, what makes this dangerous is the deception. She's going on a date with a man that she does not know and has told no one where she is going or who she will be with except possibly a friend who is helping her lie. \n\nGoing out with someone you have never met before, even if it does in a public place, without telling somebody (besides someone who has an interest in keeping their own mouth shut) where you are going and when to expect you to return is what I consider dangerous.",
      "id": 91,
      "comments": [
        {
          "score": 1139,
          "content": "This is why the whole thing was such a bad idea on OP's part. I sure as hell wouldn't trust anyone if they did that to me now, even less if I was a 17yr old girl. There's very little chance that she's going to rely on OP or the parents anymore, which is going to be disastrous when things really go wrong and it isn't just a prank.",
          "id": 92,
          "comments": [
            {
              "score": 426,
              "content": "Exactly this. No way in hell would I feel comfortable going to my parents/sibling for ANYTHING after this. There is a way to express concern and teach a lesson without all this extra shit. She is likely going to be using Tinder even more now, to get out of the house and away from them and what makes them think that if something DOES go wrong in that situation she would ever reach out to them for help? 17 is such an impressionable age especially in today's society with the pressures of social media and appearance. She won't want to risk being embarrassed again.",
              "id": 93,
              "comments": [
                {
                  "score": 39,
                  "content": "I feel like no matter what she's go back. Ok went big, she doenst trust them anymore and goes right back to it, they have a nice small talk? She decides they don't know what they are talking about and she knows what she's doing.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 318,
              "content": "This post feels almost like OP isn't even concerned about being TA and is more concerned about bragging about pranking his sister in a \"fucking hilarious\" way.",
              "id": 95,
              "comments": [
                {
                  "score": 199,
                  "content": "This whole \"I did it to teach her a lesson to be safe\" is a bullshit excuse for playing a shitty prank that can have a serious effect on their family. He did do it for himself and his own reputation as being smart and cool. The \"teach her a lesson\" part only adds to the brag.",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 98,
                  "content": "Definitely:\n\n>I decided that I wanted to have a little fun with this.",
                  "id": 97,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Completely and wholeheartedly agree and thank you for saying in words why I was uncomfortable for that girl in this situation",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "I wouldn't even say everyone sucks. What the sister did was dumb, but naive, not being an asshole.",
          "id": 99,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "I know you're swamped my dms but this is my viceral response. \n\nMy sister was a \"bad\" kid. I was \"good\". As a result any time a slipped up I got punished HARD in krder to \"right the wrongs\" to correct behavior. What ended up happening was I became a big ads liar to my parents. I learned how to hide things and just not be a good person - and it worked! Until ot didn't. There is a fine line between being a good parent to being a utilitarian parent and if you are the latter even good kids will turned out a little messed up and will hide shit from you.\n\nWhat OP did was utilitarian parenting - and hes nkt even the parent. If his sister ends up a stripper thats going to be partially end up on him. I should know: my family did a mutially a fucked up thung to me which made me seek out \"real\" human interaction. \n\n\"Good job\". OP.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "\n>Invading her privacy, lying to her, and humiliating her is going to make her less likely to open up to family about her life and make it harder for you and your parents to support her.At Seventeen is unlikely she's really going to learn anything from embarrassment or punishments from parents.\n> She's either going to have to learn things the hard way, or she's going to have to learn them by maturing. \n\nYou're right because:\n\n> [Adolescent brains develop in a way that overemphasizes reward and underemphasizes risk, which may help explain teenager's decision making and susceptibility to peer and emotional pressures.](https://www.ncbi.nlm.nih.gov/pubmed/?term=Blakemore%2C%20S.%20J.%2C%20%26%20Robbins%2C%20T.%20W.%20%282012%29.%20Decision-making%20in%20the%20adolescent%20brain.%20Nature%20neuroscience%2C%2015%289%29%2C%201184-1191)\n\nI learned about this from listening to the [Useful Science podcast](https://www.usefulscience.org/podcast/9). I wish I had known about the differences in the rates of development on brain regions when I was a teenager... it would've saved a lot of 'the hard way' life lessons.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3623,
      "content": "YTA big fucking time. \n\nThere is a difference between wanting to keep your sister safe and wanting to embarrass her. You could have had a conversation one-on-one to talk about why using tinder maybe isn’t the best thing at that time for her, both for her own safety and for the legal aged men who use it. You could have mentioned it to your parents, although that would be a shitty thing to do imo. \n\nInstead, you trapped her, embarrassed her publicly, and also got her hopes up for a date with some male model. Think about the boundaries you crossed, man. She said shit to this “guy” that I’m sure was flirty. Think of how embarrassed you would feel if text messages you sent to SO’s of your past were actually forwarded to your parents. Imagine if the same shit happened to you. \n\nSo cool. You taught her a lesson. Even if she’s not an “adult”, she’s not a child either and she will remember this. You have probably irreversibly damaged or even ruined your relationship with your sister, and have likely done the same with the relationship between your sister and your parents. And for you to be her older bro, sounds like you are super fucking immature. Comes to show that being of legal age does not mean being a mature adult. \n\nI’m actually pissed",
      "id": 102,
      "comments": [
        {
          "score": 1184,
          "content": "And that’s the thing, isn’t it? You are posting this to see if you are “in the right.” But our opinions don’t matter here. Neither do your friends’ opinions. Even now, you’re not even considering what your sister is going through and how she feels about all of this. Our opinions on your asshole-ness aren’t going to change the fact that you fucked up your relationship with her in HER eyes. \n\nI had a childhood like this shit. When I turned 18 I left home and moved to a different fucking country. Think about that shit asshole\n\nEDIT: also wonder if you had done this if it were a brother instead of a sister",
          "id": 103,
          "comments": [
            {
              "score": 519,
              "content": "[deleted]",
              "id": 104,
              "comments": [
                {
                  "score": 17,
                  "content": "I'm always thankful that as a male I was the younger sibling to a sister. That girl did everything for me when I was little, it was like having a second mom. She'd boil me spaghetti and make scrambled eggs after school when my parents were working. I'd take a bullet for her in a heartbeat. OP is a scumbag. He should be protecting his sister, not alienating her.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "Seriously. I hope someday he needs a kidney or something and she tells him to go blow a goat. This isn't how you treat someone you love. This is fucking with someone for your own shitty amusement.",
              "id": 106,
              "comments": [
                {
                  "score": 18,
                  "content": "Imagine caring so little about your family that you wouldn't save one of their lives because they embarrassed you for being a moron when you were 17. You're immature and selfish and it shows.",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "The fuck? My cousin did some fucked up shit to me. My brother did some fucked up shit to me. My dad is an unrepentant asshole with like 2 and a half good qualities. My grandmother and mom have both shattered any trust there was.\n\nAll these people, if they needed a kidney to not die, I'd gladly give it to them because despite all the problems, they're still human beings and I can do the right thing. Especially over this. I sincerely hope you grow the hell up. What did OP do that was so evil? Lied to her like she lied to people? Told the parents about her acting shitty? She's lying about her age and going on a hook up app. She could ruin people's lives, and you're pissed to the point of hoping for organ failure and death because she was embarrassed? \n\nThat's gross.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 12,
                      "content": "These people are basically sheep.\n\nThey get caught up in some stupid outrage nd next thing you know they are wishing death on OP or serious bodily harm because they get high off of their own righteousness.\n\nPretty disgusting if you ask me.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "The fact that this comment got 80+ upvotes tells me a lot about this sub.\n\nConsider that you are hoping that OP gets seriously harmed by not getting a kidney because he humilliated his sister when she was younger. He did an asshole move but you are definitely an asshole too.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "You need to take a breather; maybe get off the internet for a while or consult a mental health expert? Because it’s pretty clear you need to if you’re wishing a complete stranger on the internet would suffer from kidney failure and be turned down by their own family.",
                  "id": 111,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Omg he was tryna teach her a lesson but he took it too far by making it public. And do u REALLY think a One on One talk is gonna make her change? If he did it privately it would of been fine. And maybe not told the parents? Calm down with the kidney shit omg lmao at least he didn’t do something that was life threatening.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "I've seen similar situations with underaged gay brothers on Grindr lying about their age, and the consensus seems to be NTA for calling out underaged person for lying about their age and tricking someone into statutory rape. Still, OP was way over the top with this and should've just went to the parents.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This was part of my response to him also. If he had any sort of relationship with his sister before this (which I doubt he did cause he seems like a real fuckwit) it is 110% gone now. She's never going to trust him again.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly this. Wasn't allow to date in senior year. Did anyways, que chauvinistic bro and dad threatening to shoot or beat him up for dare wanting to date me. But for my brother? My parents didnt even know he was dating till two months after the fact and all they did was go \"k cool\". Oh but for me? I was the devil, I caused all our family problems, how could i betray my family like that etc. Well i can certainly tell you their attitudes pushed me farther away from them and  made me rebel even more. (Just one instance out of many that caused me to become more deviant)\n\nWho would have thought Helicopter parents would raise an anxiety ridden child who wasn't allow to do shit for themselves who ended up with mental illness and they wonder where it went wrong lol",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Read his edit. Everyone saying that their relationship is ruined is just wrong. I love how this sub thinks that any little mishap between family members will ruin their relationship. I dont know why either because most family members stick together through hard stuff.",
              "id": 116,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "God not everyone has had shitty relationships with their parents. We have all been embarrased by our parents. And got into big fights with them. Not all of us grow to resent them and move out because of it. \n\nUsing your mindset for every reasoning is just so toxic. And it usually ends up in a cycle where your kids will have similar relationships with you than you did with your parents. \n\n\nBreak the cycle.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "Yes.\n\nBut also\n\nShes 17, presumably underage, and lying about her age meeting up with older men\n\nShe also sucks, but OP is TA.",
          "id": 118,
          "comments": [
            {
              "score": 16,
              "content": "There is also an ESH option",
              "id": 119,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "How tf is the sister not an asshole for lying about her age to someone she was considering being intimate with and putting him in a position where he could have committed a felony or gone against his personal morals?",
          "id": 120,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Plus he was sure to let his whole friend group know - no doubt for the laughs!  /s. Plus - Kevin is a douche for letting his pictures be used for this.  The idea of teaching her about the dangers of internet hookups was ok - but the execution was horrible.  OP’s TA.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Also that he talked with his friends about it, who found the idea of catfishing hilarious doesn't really help his case",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "That’s a mighty fine white horse you rode in on.",
          "id": 123,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Chilll gurl",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1574,
      "content": "Yeah YTA. \n\nYou should have gone straight to your parents and let them deal with it but instead, you chose the nuclear option.",
      "id": 125,
      "comments": [
        {
          "score": 146,
          "content": "Interrupting to say I absolutely love your username. SG-1 rules.",
          "id": 126,
          "comments": [
            {
              "score": 54,
              "content": "\"Indeed\" best voiceline in the entire series",
              "id": 127,
              "comments": [
                {
                  "score": 7,
                  "content": "I havent watched the show in years but that line was immediately read in Teal'c's voice",
                  "id": 128,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Indeed! Ahhh feelsNostalgicMan",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "Yeh I feel like if OP really cared and was worried about the situation he would have gone straight to their parents or had a serious chat with his sister. Rather than publicly humiliating her and thinking it’s hilarious.\n\nYTA",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Or, you know, be an older sibling and handle that themselves instead of getting parental awkwardness involved.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1346,
      "content": ">catfishing...underaged sister...humiliating...teach her a lesson...told my friends\n\nYes, YTA. You should have simply told your parents about your concerns at the outset.",
      "id": 132,
      "comments": [
        {
          "score": 270,
          "content": "[deleted]",
          "id": 133,
          "comments": [
            {
              "score": 107,
              "content": "She's a minor communicating with a male of unknown age on Tinder. Her parents are best equipped to handle this, and it's their job.",
              "id": 134,
              "comments": [
                {
                  "score": 11,
                  "content": "Not sure what you all are on about but most of the world and most of America, 18 is NOT the age of consent.\n\nAt 17 in most states she is legal and allowed to do what she wants. The fact that so many people are willing to vilify her for being 17 is ridiculous.\n\nIt is immature but not worth vilifying someone.",
                  "id": 135,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1129,
      "content": "YTA clearly. You don't need to humilliate someone in order to let them know what they're doing is wrong. You didn't even try to talk to her about it, but decided instead to have fun at her expense. It seems like you were way more interested in ridiculing her and appearing in front of your parents like \"the good kid\" than actually caring for her safety.",
      "id": 136,
      "comments": [
        {
          "score": 118,
          "content": "She doesn't really do much wrong tho. Nobody would give a fuck if she would be a guy.",
          "id": 137,
          "comments": [
            {
              "score": 48,
              "content": "So true. 17 year old and 22 year old woman? No one would care.",
              "id": 138,
              "comments": [
                {
                  "score": 49,
                  "content": "She likes to have sex with guys. Who cares? Just tell her to be safe and go on with your live.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Yepp. Only problem is the possibility of her getting guys in trouble for being under age",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Literally the point is that shes not being safe...",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This makes it even worse. Think about it from the guys perspective for fucking once. If this guy had been caught with a 17 year old he would be in prison.",
              "id": 142,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 874,
      "content": "YTA if this is true. How you thought this would be helpful for your sister in ANY way is beyond me. Also you weren't doing this \"to teach her a lesson,\" you were doing this because you wanted to have fun at her expense.",
      "id": 143,
      "comments": [
        {
          "score": 70,
          "content": "Exactly this.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "> YTA if this is true.\n\nIt's probably not. It reeks of a mediocre creative writing exercise with too much unnecessary detail and a happy ending.",
          "id": 145,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Good news, it's not true. Fake ass post, guy knows way too much about the functionality of tinder, needlessly uses pictures of his real life friend who just happens to be a model when you could easily pull this stunt with a selection of ripped instagram shots, far too elaborate of a hoax to set her up at a restaurant and then claims she screamed, *SCREAMED* when they approached her, caused a scene burst into tears bla bla fucking blah. No girl would do this in public under these conditions. \n\nOP is an asshole alright, for concocting this lame ass tryhard story.",
          "id": 146,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 573,
      "content": "YTA\n\n\nCompletely. If you were actually concerned about her, you would have taken the profile to your parents without catfishing her. You did this solely to embarrass and shame her (as evidenced by the fact your friends 'agreed it was hysterical'). \n\n\nYou need to look at yourself and your motivations here. You were cruel and spiteful.",
      "id": 147,
      "comments": [
        {
          "score": 98,
          "content": "Sounds to me like OP was using his “concern” as an excuse to execute this “hilarious prank.” If he even truly cares, he’s an absolute retard and took the worst possible approach to solving the problem",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "> you would have taken the profile to your parents without catfishing her. \n\nOr, keep the catfish (to establish a willingness to sleep with someone 5 years older than her, and lie about it), but then immediately turn it over. \n\nLetting get as far as humiliating her in a public space *and then telling his friends??* Yeah that's the fucked up part IMO.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 490,
      "content": "YTA (a Mega one at that)\n\nSo let me get this straight. Your sister made a tinder profile and you found out and then you decided to go 30 steps further than what’s appropriate and humiliate her? Yeah good luck dealing with her now. She’s not going to trust you and will resent you for this. And if you were truly trying to teach her a lesson you would have sat her down and told her to wait a year or less when she turned 18. This is so incredibly sickening to read for me. Your friends are right, you were cruel to her and made her into a joke. It’s even more horrible because you mask this as “helping her” when in reality you are humiliating her. I mean honestly how could you do this to her? It’s so awful to read it’s not even funny. Christ, it’s sick.",
      "id": 150,
      "comments": [
        {
          "score": 278,
          "content": "He's acting like she did something wrong to him. She gets all this because she let him use her phone. She's going to be 18 soon. On some arbitrary day coming soon this will be fine. She probably shouldn't be doing it, but she's not committing some horrible crime for which severe punishment is warranted. I wonder in what other ways this guy feels her life is his business.\n\nEdited to add:  Not only that, but he told the story to multiple people so they could laugh at her!! Clearly shows this is not about protecting her. Major asshole. I hope this is fake.",
          "id": 151,
          "comments": [
            {
              "score": 94,
              "content": "it’s just like insane to me how someone could do this to their younger sibling!!! like we may fight but I’m the older sibling and I’ve got a responsibility to them. i could never do something so horrible",
              "id": 152,
              "comments": [
                {
                  "score": 85,
                  "content": "I'm sitting here wondering if OP would have pulled this stunt if it was his younger brother, not his younger sister. \n\n100% odds lean he would've never pulled this shit. Probably would've even slapped his bro on the back with an \"atta boy!\" Sick, honestly.",
                  "id": 153,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "> She gets all this because she let him use her phone. \n\nExactly. She did him a favor and trusted him with her phone. Then he decided to invade her privacy and snoop around. That's the first messed up thing he did and tells you a lot about this guy.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 64,
          "content": "Not just humiliating her, but bringing the parents into this and letting dad confront her at the restaurant. I totally get if OP himself was the only one going into this and explained something like you never know who you meet online, etc., but no.... he brought mom and dad on the fake date and let them call her out in front of everyone. This is 'homegirl going to run away and have a big ol' glass of fuckitall' territory.\n\nSister sucked for lying about her age (how long has she been baiting like this?) but I agree, OP is the Mega AH for setting her up like this, so publicly, with the parents.",
          "id": 155,
          "comments": [
            {
              "score": 15,
              "content": "she was def in the wrong for the lying about the age but at the end of the day, he took it too far and just totally humiliated her. I might have said E.S.H but I don’t know when she’s gonna turn 18. He’s in for a real shock when she finally turns 18 and he can’t fuck with her anymore.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "That's what really gets me. I mean even with the catfishing this is NOT the kind of thing my sister and I would EVER tell our parents because they have a tendency to overreact. Maybe if he actually had a trusting and open-discussion based relationship with his sister this would have never happened. He probably could've convinced her to delete Tinder till her 18th birthday even. Instead he pulls this shit.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}