{
  "post content": "So I was recently talking to a girl over text after she saw my photo with my cousin on instagram, and she knows my cousin. My cousin then gave her my number, and this is where it all took place.\n\nSo we started chatting, when she abruptly asked me how tall I am out of no where. I answered and she sent a sighing emoji telling me that short guys suck (in a nutshell). I figured since she wanted to distinguish a barrier between her type and not her type, I decided that I might share mine.\n\nI asked her how much she weighed, which she then left me on read for nearly an hour. The reason why I asked her how much she weighs is because I pride myself in the hard work I put in to my workout to stay feeling well and to possibly increase my chance at finding the type of women I like. \n\nAnyways... She responds telling me that I’m a dickhead and that she is gonna try to spread this news to everyone at my school to lower my chances with other girls. I did not realize that the question would offend her, and my intentions were good, just trying to make sure that I was gonna talk to a girl that I  would be glad to meet once this whole thing is over. \n\nAnyways, although I may have accidentally hit a sensitive topic without realizing the repercussions, I promise I had good intentions and was not trying to make her upset, so Reddit, Am I the A-Hole?",
  "id": 1,
  "comments": [
    {
      "score": 1941,
      "content": "Oh dont lie, you knew damn well you were clapping back at her for the height comment, ya both suck ESH",
      "id": 2,
      "comments": [
        {
          "score": 427,
          "content": "ESH. Op and her are two peas of a pod. That’s clearly a retaliation act",
          "id": 3,
          "comments": [
            {
              "score": 284,
              "content": "Oh absolutely, which was a justified asshole move, just didn't need the added little \"OHH I am SOOO innocent, I didn't REALIZE this would upset you~ Oooh why is she mad at meeee~?\" Crap.\n\nDon't take any crap about what height you are, and don't give anyone the time that starts shitting on you for it either.",
              "id": 4,
              "comments": [
                {
                  "score": 54,
                  "content": "Yup! Would have fit better under the category #pettyrevenge without the pretence",
                  "id": 5,
                  "comments": [
                    {
                      "score": 40,
                      "content": "I mean it would be a BORING #pettyrevenge story, because I've seen this exact scenario like 5000 times but it would be categorized correctly and that's important damn it!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Yeah but he was just asking because he puts in a lot of work at the gym or something and he had no clue that it would offend her (eye roll)",
              "id": 7,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "you know you can change your weight but not your height?",
          "id": 8,
          "comments": [
            {
              "score": 65,
              "content": "You know you don't need to be a dick about either of those things to potential partners? And yeah you can change your height, they're called high heels",
              "id": 9,
              "comments": [
                {
                  "score": -35,
                  "content": "you gotta be fkn joking with your shit high heels comment",
                  "id": 10,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Yes, that was a joke,  if I were serious I would have suggested stilts~",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 930,
      "content": "ESH it's fine that she has a preference, but she sucks for insulting short guys. It's fine that you have a preference, but you suck for pretending like you didn't know exactly what you were doing.",
      "id": 12,
      "comments": [
        {
          "score": 255,
          "content": "Right ?? Thats the only thing in the OP that makes him an asshole “Oooh I didnt know it was a mean questiooooon, totally didnt do it to show her how it feels”\n\nLike own that shit! Ya clapped back and she got a taste of hernown medicine, dont play innocent.",
          "id": 13,
          "comments": [
            {
              "score": 36,
              "content": "Yep, blatantly disingenuous and passive aggressive. People who regularly display that combination of qualities are usually pretty insufferable to be around. It's like they are constantly negative and looking for a fight but with none of the honesty or confidence in their own behavior.",
              "id": 14,
              "comments": [
                {
                  "score": 6,
                  "content": "Absolutely agree",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 314,
      "content": "ESH. She can like tall guys without disparaging short ones,  but you were being petty and you know it.",
      "id": 16,
      "comments": [
        {
          "score": -34,
          "content": "So was she? Atleast he had a reason to ask her and pome fun at her. She just started out shallow af. ESH but he atleast was just returning the favor rather than insulting someone.",
          "id": 17,
          "comments": [
            {
              "score": 28,
              "content": "Yes, that's why ESH.",
              "id": 18,
              "comments": [
                {
                  "score": -19,
                  "content": "Yeah but the way you worded it was basically \" she could have been nicer but your just petty\"",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 216,
      "content": ">I did not realize that the question would offend her,\n\nUh-huh, suuurreee you didn't...\n\nESH. She sucks for being shallow about height, and you suck for *acting* like you didn't know what you were doing. It's fine for the both of you to have preferences, most people do. But you both sound super immature imo.",
      "id": 20,
      "comments": [
        {
          "score": -59,
          "content": "Wtf if she's asking about height she can answer about weight. She has no right to be offended or sensitive.",
          "id": 21,
          "comments": [
            {
              "score": 72,
              "content": "He sucks for being a coward.\n\n\"Ohhh I didn't know it would offend her...\"\n\nIf you're going to be petty at least own up to it.",
              "id": 22,
              "comments": [
                {
                  "score": -1,
                  "content": "[deleted]",
                  "id": 23,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Stop being so dramatic.\n\n\nIf the agenda isn't as clear as day to you, there is no helping you.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 193,
      "content": "ESH and you can drop the innocent act, noone believes that for a second.",
      "id": 25,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 159,
      "content": "NTA. \n\nWere you petty AF? Absolutely. But sometimes people need to be knocked down a size or two, get a taste of their own medicine. \n\nSincerely, \n\nA Fatso.",
      "id": 26,
      "comments": [
        {
          "score": 32,
          "content": "I think it's ESH. It would have been NTA, but he won't own up to the fact that he knew asking her weight would offend her.\n\nIt's ok to respond to a rude question with a rude question of your own, but you need to own up to the fact that you asked a rude question on purpose and let the person who asked the first rude question realize how their question made you feel.",
          "id": 27,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -1,
          "content": "It’s so cringey to me when overweight people on here call themselves things like “fatso” or “fatass”. It’s like it’s supposed to just upfront and acknowledging ones weight, but it always comes off like a bad attempt at trying to self deprecate and get laughs than anything else.",
          "id": 28,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 99,
      "content": "ESH. My judgement would've been N - T - A if you had just owned the fact that you were being petty, rather than trying to lie to us about your intentions. You know damn well what you were doing.",
      "id": 29,
      "comments": [
        {
          "score": 4,
          "content": "Right?\n\nI'm super tall, but I always respond to questions about my height with questions about her weight, and when she gets offended we either have a conversation about how asking objectifying questions is rude, or (more frequently) just stop talking to each other.",
          "id": 30,
          "comments": [
            {
              "score": 2,
              "content": "I remember before my first date with an ex almost 2 years ago I asked him how y’all he was, not because I gave a shit, but because I was just curious. He told me he was 4’5 as a joke. He was actually around 5’10 or 5’11, but I thought it was a hilarious way for him to answer the question.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 76,
      "content": "ESH\n\nOf course you realised that this question would offend her! You could have just told her that her question and reaction are very offensive and shallow",
      "id": 32,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 58,
      "content": "NTA \n\nIf she is going to judge people by their looks you have every right to do the same.",
      "id": 33,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 30,
      "content": "You wouldn’t be TA simply for clapping her back, but you are TA for playing innocent.\n\nESH.",
      "id": 34,
      "comments": [
        {
          "score": 1,
          "content": "[deleted]",
          "id": 35,
          "comments": [
            {
              "score": 1,
              "content": "It’s a double standard, hence why I say everyone sucks.",
              "id": 36,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}