{
  "post content": "I'm basically at the point of breaking off me relationship with my fiancé because I'm so frustrated by this whole thing. I guess this question is among my last salvos to see if i'm being an asshole and unreasonable. Or if the problem is on her end. \n\nBeen with fiancé for several years now. She recently graduated and got an amazing HR job with a pretty high profile \"we get your DUI charges dropped!\" type law firm. The guy who started the firm is known across as being an ambulance chaser, shyster and scammer because very frankly he's trying to portray that in his commercials. I've met him a couple of times and in person, he's a little better but I stew kind of feel like I needed a shower. \n\nSo right after New Years, wife came home and announced that Lawyer dude is taking the whole staff out to celebrate on January 20th because it was the firms biggest year ever. This is the timeline as near I can remember:\n\n- January 5th, she tells me to keep January 20th open because SO's are invited. Cool, I can do that. \n\n- January 8th. Sorry she was mistaken, it's just a work party she tells me it's cool if I make other plans that night. No problem. \n\n- January 13th. She lets it slip, it's not really a party for the whole office, just for the people boss thinks were part of the success. I'm starting to get a little WTF'y here. \n\n- January 14th. Miraculously, all the people going to dinner with the boss are under the age of 30 and female.  Now alarm bells are really going off. \n\n- January 18th. The list is down to two people, my wife and another new attorney. So, if I'm hearing this correctly, the two people mainly responsible for this 20 year old company's \"biggest year ever\" are both recent college grads, both female and both around 25? Fiance says \"aren't you proud of me!\" \n\n\n- Today, the big day boss texts her at like 11AM and says \"hey since this is supposed to be a celebration, don't drive! I'll send a car service for you!\" Fiance still doesn't smell anything fishy so I ask her just for my own edification ask what he says if she tells him \"that's a great offer, but my fiance knows the restaurant and he can drive me.\" Boss replies back in seconds \"sorry if I had to change restaurants at the last minute, I'll send the car!\" \n\nMy fiancé looks at me, apparently without the screeching submarine klaxon and klieg lights that are going off in my head, and says \"see it's all cool, I'll just take the car service.\" \n\nI'm freaking the fuck out. I told her that she can't go. She called me a controlling asshole. I told her that this whole thing has bene shady as fuck and I relayed out the timeline I just posted above using my texts and emails from her as evidence. She said that me \"hoarding evidence\" like this is an example of how I'm a \"controlling asshole\" and she wants to go to the dinner now more than ever. I told her I might be an asshole but I'm not stupid. \n\nShe told me over and over again \"he's married, he CAN'T do anything that would affect his marriage, so you're being the stupid one!\" That leads me to believe that even she understands the larger implications that are at play here. \n\nShe locked herself in our bedroom and hasn't come out for at least an hour. \n\nI don't know what to do. I can't beat the door down or yell at her and I think if this is one of those situations where the shoe was on the other foot, she'd be freaking the fuck out and I'd see her reaction and just call it off.\n\n AITA?\n\nEdit: it's 5:30 here, car service picked her up at 5:15. I guess it's up to fate now if I'm a controlling asshole or if she didn't see it whatever is coming coming.\n\nEdit 2: she just got home and said only \"I don't want to fucking talk about it\" and she's back talking to who I assume is her sister. I'm defying my every desire to eves drop so I don't know what happened. It's only 8:45 so I don't think anything super crazy happened. I'm just glad she's home. If it's appropriate, I'll update again when I know more.\n\nEdif3: this really doesn’t pertain to aita anymore rather just people asking for an update...she gets to dinner and it’s just she, coworker and boss in a private dining room at hotel. Boss says strait up hes banging other girl and wants fiancé to join them. Has “understanding” with his wife and says he can do amazing things for fiancé. Fiancé is pissed she didn’t see this coming, but she’s still pissed at me for being controlling. She’s not happy at all and talking about breaking up. Sucks All around but I’m relieved she’s safe. Just giving her some space for a while.",
  "id": 1,
  "comments": [
    {
      "score": 2305,
      "content": "NTA for being weirded out and concerned for your fiances safety. Guy sounds like a sleazeball. However, YTA for saying she can't go. That's controlling behavior and she's a grown woman, you don't have the right to tell her what she can and cannot do. Don't blame you for being nervous but there was a much better way to approach this. ",
      "id": 2,
      "comments": [
        {
          "score": 207,
          "content": "Yea, I say let her learn from her own mistakes. She's either extremely naive and needs this wake up call, or she knows exactly what this 3-way date is and is planning on walking away (or not). Tell her to have fun, but make sure she knows you're worried about this situation and for her to keep her phone with her at all times and just be safe (leaving her drink unattended, etc.)\nShe could call you, call a cab, call 911 - she has options so if you eventually update us saying some nonsense about how she says she didn't have a choice to do xyz because she'd lose her job...kick her to the curb. But let it happen first. It will either happen now or 10 years from now, which would you prefer?",
          "id": 3,
          "comments": [
            {
              "score": 214,
              "content": "Lol what? it's better for him to let her risk getting date rapped than be \"controlling\" by telling her not to go? You guys are wild.",
              "id": 4,
              "comments": [
                {
                  "score": 132,
                  "content": "He wasn’t telling her not to go. He was saying she “can’t” go. I actually agree that he should have told her not to go, but I don’t think he should have made it sound like he was forbidding her to go.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 100,
                      "content": "She ended up going regardless, so you're just arguing semantics at this point.  By \"forbidding\" her to go, he was telling her that if she went it would have negative repercussions on their relationship -- but it was ultimately her choice whether she wanted to go or not.\n\nTurns out that his suspicions were correct -- the creep wanted to have a threesome with her and one of her colleagues.  So you can't even argue that his concerns were simply due to wanting to control her and/or jealousy.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "I would forbid you to go somewhere you could get raped. Be mad all you want, I'd be content with you not getting raped.\n\nSometimes caring about someone means ignoring their feelings for their safety.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "This what happens in every relationship subreddit or post.\n\nThese subs are filled by single people(or people who are in the dating scene) and don't know anything about serious relationships.\n\n&nbsp;\n\nAny serious relationship as rules and boundaries that the couple sets. But how would people here know that?",
                  "id": 8,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "NTA for realizing she was completely clueless about the reality. But you really could’ve been more diplomatic about it. I get that you were worried but I was cringing over your saying she couldn’t go. \n\nUpdate if/when you can. From what you’re saying, it sounds like she got a wake up call. LOL ",
          "id": 9,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "\"However, YTA for saying she can't go.\"\n\n&#x200B;\n\nYup. That right there. If you had phrased it, \"I don't think you should do and here's why\" then you would be totally clear. But making unilateral commands is a dick move.",
          "id": 10,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "If this ends up being the top comment won't it get counted as NTA since you started the comment with that or is it less automated than that?",
          "id": 11,
          "comments": [
            {
              "score": 9,
              "content": "I honestly couldn't tell you. I am kind of a Reddit noob. ",
              "id": 12,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yep she can certainly go on the dinner date. And he can certainly change the locks on the doors to his apartment. ",
          "id": 13,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "[deleted]",
          "id": 14,
          "comments": [
            {
              "score": 23,
              "content": "[deleted]",
              "id": 15,
              "comments": [
                {
                  "score": -4,
                  "content": "[deleted]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Forbiding someone to do something isn’t letting them make their own decisions.... ",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -53,
          "content": "You absolutely can tell a grown woman what she can and cannot do. That's exactly what monogomy is. \"You can't sleep with other people\". We place all sorts of restrictions on our partners.",
          "id": 18,
          "comments": [
            {
              "score": 39,
              "content": "....expecting your partner not to cheat on you isn’t the same as telling them what they can and can’t do. Monogamy is expected in most relationships, that’s not a “restriction.” ",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "Boundaries are for yourself, not for other people. \"I am not willing to be in a relationship with someone who is not monogamous\" is a boundary you set for yourself, not your partner. If your partner will not respect that boundary, it is on you to enforce it (by walking away). ",
              "id": 20,
              "comments": [
                {
                  "score": 0,
                  "content": "That just sounds like playing semantical games. \"I am not willing to be in a relationship with someone who is not monogamous\" and \"you can't sleep with other people while in a relationship with me\" are effectively the same. You walking away is the known consequence either way.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 10,
                      "content": "One acknowledges the agency of each party. The other does not.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yep it's all semantics but it boils down to the same thing. These people have weird semantic games with relationship rules to not upset the progressive autonomy NPC reply. No one implied someone was stopping someone from actually leaving or doing something. They sound like they are 13. I mean look at some of their replies\n\n> tell me not to and I'll do it\n\nYou and I are not talking to well formed adults.\n\nThere are rules and expectations in a good relationship. It seems most people here are unmarried and younger.\n\nShe willingly put herself in risky situations because of her refusal to accept the facts. Her ego and pride was worth more than her fiance and more than her safety\n\n\nGuess what other people are probably assuming Monday morning? OP is going to get a few smirks everytime he brings her flowers.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1441,
      "content": "NTA: Your wife seems like she’s just now realizing that the great job she thought she was doing was just her boss getting her in a position where he could fuck her.\n\nThis is a really really really shitty feeling. She thought she was doing amazing at her job and now she has to deal with the fact that not only was it a lie, but that it took her by surprise. And part of her brain is whispering that YOU don’t think she could possibly be smart/talented enough for any of this to happen.\n\nBe gentle with her. It’s a pretty soul sucking experience to find out someone you thought genuinely valued you was only around to use you.",
      "id": 24,
      "comments": [
        {
          "score": 149,
          "content": "Agreed. Had an experience like this with a professor I looked up to like a father. I can't tell you how violated and betrayed I felt. I can't imagine having to deal with these feelings while having the person I love/trust the most on the side saying I told you so.\n\nNow is not the time to rub it in her face.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "This was a great take. Honestly.",
          "id": 26,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "agree with this. you were also pretty forceful when you confronted her about it, so she probably feels even dumber because you obviously saw it coming and she didn't. her talking about maybe breaking up seems like either a way for her to feel better about her shortsightedness, or is indicative that this isn't the first time you've expressed yourself like this to her.",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -128,
          "content": "I think she realizes it, and she's using it to her advantage. \n\nThere's a non-insignificant chance she wants to cheerfully fuck her way up the ladder. \n\nAnd \"she wants to go to the dinner now more than ever?\" Yea she's going to fuck her boss and blame OP for it because he was against her going.",
          "id": 28,
          "comments": [
            {
              "score": 34,
              "content": "She's 25.  Which most likely means she hasn't quite figured out what her fiance already knows:  some dudes will lie, cheat and steal to get laid.  ",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 894,
      "content": "ESH — seems like it would’ve been more productive to ask her not to go instead of telling her she “can’t”. She sounds pretty naive (or is playing at it) but you also do seem kind of controlling in the sense that you don’t trust that even if he had ulterior motives that she might not fall for them or might respect her relationship enough to walk away from those advances. Just one person’s perspective though. ",
      "id": 30,
      "comments": [
        {
          "score": 203,
          "content": "I agree. He could have said, \"honey, this seems really strange and I don't think I'm comfortable with you going out to dinner with him like this.\"",
          "id": 31,
          "comments": [
            {
              "score": 119,
              "content": "Exactly. It’s about creating a dialogue, not just laying down the law because you’re scared of what might happen. ",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 603,
      "content": "YTA\n\nlooks like the nta train is already rolling so everything else will get buried, but IMO its ok to be worried and mention those concerns. however she is an adult who can make decisions, not a child you need to protect. you sound very controlling",
      "id": 33,
      "comments": [
        {
          "score": 185,
          "content": "An extremely naive adult. It's perfectly natural to want to protect your ignorant spouse. He just went overboard by trying to forbid her from something.",
          "id": 34,
          "comments": [
            {
              "score": 4,
              "content": "What was OP protecting her from though? Even if you're worried about boss's intentions, if you trust your SO it isn't a big problem.",
              "id": 35,
              "comments": [
                {
                  "score": 73,
                  "content": "From getting fucked. You do realize this right? Like am i going crazy and everybody here doesnt understand that the boss might rape them or some shit? Yeah learn your lesson by getting raped? ",
                  "id": 36,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Is that a realistic concern? She was picked up by a car service (i.e. not by her boss) and taken to a restaurant. She wasn't really in danger of anything more than him attempting to coerce her into sexual favours, which basically happened and she declined. He hasn't done anything for you to assume that he's dangerous. ",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "She's naive enough to not see anything wrong with what happened so far which tells me she's probably naive enough to not understand not every man is a stand up guy and there are a lot of bosses who will sexually abuse or rape their employees. Have you heard of the me too movement? ",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah I've heard of it and I'm aware of the problem, but the situation described doesn't really make rape seem like a concern to me. The guy made an inappropriate advance, but she was always able to say no. Because of his position of authority and the way he went about it it could certainly be deemed abusive imo, but I wouldn't be fearful enough of entering that situation to not go.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Omg. Are you dumb? Her boss is a pervert who is crossing many professional barriers. He’s a full on MEGA creep who could’ve raped her. This isn’t about trust. He wasn’t scared she’d cheat, he was concerned this creep would try something fishy and that’s exactly what happened. ",
                  "id": 40,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Are you able to disagree with somebody without insulting them? Really, do you think that's a good way to enter a discussion? Fuck you and your completely irrational rambling.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I mean she basically went on a date. Would you be as blasé if OP went on Tinder to “make friends?”\n\nAfter all, shouldn’t she trust him?",
                  "id": 42,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I don't think that she should have gone, but I also don't think she was ever in any danger.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "She sounds like a child though, the whole thing was so obvious to see coming and she still went, and then has the audacity to still be angry at her fiance  when lo and behold her boss turns out to be fucking scum bag. OP is very rational and logical to me. Wheareas, his fiance is quite immature and a completely disingenuous person.\n\n I genuinely cannot comprehend how anyone can think this is a YTA situation. As men and women, especially if we tend to be impulsive and a bit stupid at times we should relish a partner who can make us see sense and look out for us. Who can pull us out from our petty mindsets and see things for as they are. We should all strive for SO's who have this positive form of control in our lives.",
          "id": 44,
          "comments": [
            {
              "score": 46,
              "content": "I agree that he’s in the right for wanting to protect her but it’s a little unfair to tear into this woman when we have so little information on her. \n\nPeople operate based on their perspectives and what they can put together. If she’s never encountered a boss with wandering hands, she would have no idea how to recognize it and her boss is just her boss. Yes, she’s naïve but she isn’t willfully ignorant or stupid. \n\nI was 30-years-old when my husband told me he was really uncomfortable with me spending time with one of my single guy friends. He would always ask how my relationship was (and it was great!) but what I didn’t know was that some guys use this as a way to fish for information. To me, it was just my friend checking in to make sure I was ok (he knew my ex was abusive). I ignored my husband’s concerns and two months later my guy friend started saying really inappropriate things about how attractive I was now that I was pregnant and talking about how he’d always wanted to sleep with a pregnant woman. \n\nOPs fiancé is just trying to do what she thinks is normal at her new job. She doesn’t see the bigger picture. It’s like someone telling her a tree is about to fall but she doesn’t know how to look for rotting wood so she doesn’t believe them. \n\nDemanding your SO do something is a surefire way to get them to dig their heels in and fight back against being controlled. People deserve their autonomy and we do have to learn from our mistakes in most cases. They don’t market pink tasers so you can fight your boss, but most women won’t go wandering about in dark alleyways at night because they know it’s dangerous. \n\nI feel for OP. He cares, he’s just expressing it wrong. This is a great learning opportunity for them both, and putting down one or the other because of a unique and tense situation is unfair and presumptive. ",
              "id": 45,
              "comments": [
                {
                  "score": 20,
                  "content": "I would agree with you wholeheartedly if it wasn't for 2 things.\n\nFirstly she clearly knew that it was going to be only 3 people in attendance to that work soiree. Yet she lies about it to the point where she is continuously modifying her story over a 15 day period. This is why I don't agree with your presumption that she is naive because why wouldn't she be upfront and honest about the number of people in attendance if she truly believed it was just a friendly after-work engagement.\n\nSecondly, the fact she acted so defensive and childish when confronted with a very rational concern instead of discussing it like an adult and trying to alleviate her SO's concerns, tells me that she is wholly to blame.\n\nLastly, I agree that this is a great learning opportunity for both of them. She can learn to listen to her fiance's concerns and address them like an adult and he can definitely benefit from keeping his cool when discussing these things with his SO.\n\n&#x200B;",
                  "id": 46,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Denial is a very powerful drug. Who wants to believe their boss is only out to sleep with them? She’s 25 and new to the workplace. Maybe her boss has always been flippant with details, so it isn’t abnormal to her that he kept changing plans. \n\nIt’s not necessarily that she’s modifying “her” story, but giving her SO the most up-to-date information she has. \n\nNo one wants to believe they don’t have value and admitting her boss just wanted to sleep with her would mean she doesn’t have value at the firm. That’s a huge ego hit for someone so young. I wouldn’t say anyone’s to blame here except the deceptive boss. \n\nOP over reached and said something he shouldn’t have in a tense situation. OP’s fiancé wanted to believe she is a valuable member of her team. I don’t think anyone sucks here, it’s just a life lesson that everyone (hopefully) learns. ",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "\"Lo and behold\", FYI. I agree with you, though. I've given him advice downthread to reconsider marriage with this person.",
              "id": 48,
              "comments": [
                {
                  "score": 2,
                  "content": "Lol thanks bro",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "> I can't beat the door down or yell at her \n\nThis bit. Why would your mind even go there? Why \"can't he\" beat the door down? Who's suggesting such a thing?",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Disagree with this comment wholeheartedly. I asked my SO to read this post they agreed they would never feel comfortable attending an event as described by OP without me. \n\nIt is a step in the wrong direction and playing with fire. Honestly she should have seen this coming, sounds like an ego problem if she thought she was single handedly driving a law firm without making partner...",
          "id": 51,
          "comments": [
            {
              "score": 3,
              "content": "As a recent college grad and therefor being new at the job. This firm has operated successfully for how many years? But you coming in new to the workforce and being there for a few weeks or months is turning it all around? Ok",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Lol, only on reddit. \n\nTelling her she can't go isn't an asshole move. Not in this context. If anything it's undiplomatic. \n\n",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "You're wrong. He voiced his concerns to which she ignored and went anyway. Coming back to prove OPs concerns. She's an asshole for being naive and trying to flip the script on op like he's the bad guy. Girls go straight to the controlling card when they don't get their way.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 505,
      "content": "I wanted to chime in and say NTA. A majority of the people here are taking you saying she can't go as being controlling, but imo, it's not. Saying \"can't\" is much more different \"won't\". If you had said you wouldn't let her go, then you would be an asshole. If you had physically barred her from going through the door, you would be an asshole. If you had followed her to the restuarant, then possibly confronted her boss when it turned out you were right, you would be an asshole. But you didn't do any of that, other than expressing your opinion through the word \"can't\".\n\nEven more so, people are expecting absolute perfection during moments of high tensions. That's a common trend with this subreddit, as if everyone has perfect composure during an argument. Granted, \"can't\" wasn't the best word to use, depending on your relationship, bit it definitely isn't in any way controlling. \n\nI would say your fiance is TA in this situation, especially with her behaviour afterwards. I get that she's angry that she didn't analyze the situation correctly, but she had no right to take it out on you and *incorrectly* call you controlling. I think you need to both sit down and talk things out and that you personally need to evaluate your relationship. Not saying break off the engagement or end things, but this behaviour is a bit intense for a supposed grown woman. \n\nI just think it's a bit weird, honestly, that she's in HR and didn't recognize these signs. How is she supposed to be a valuable member if she couldn't even see for herself that the situation was weird. She seems to be completely in denial and needs to report her boss or even find another job, because this situation is going to blow up, either with the second girl or the boss.",
      "id": 55,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 440,
      "content": "Your fiancé is straight up stupid",
      "id": 56,
      "comments": [
        {
          "score": 48,
          "content": "lol",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 229,
      "content": "~~YTA.~~ ESH.\n\nThinking that something fishy is going on? That's ok: I also do think it sounds fishy.\n\nBut if you truly trust your fiancée, you let her go and she'll report to you afterwards whether you were right or not.\n\nSo what if it's likely that her boss is just setting her up for a threesome or something similar? I know I would trust my eventual fiancée to get the fuck out of there if he'd dare to try something like that.\n\n* Edited because of wording.\n\n* Edit 2: changed to ESH because fiancée's naivety is too big to just be ignored.",
      "id": 58,
      "comments": [
        {
          "score": 124,
          "content": "> What are you expecting? That her boss will force her and the co-worker into a threesome or something?\n\nIt went from being a plus-one invite for the whole firm to being two young women.  How much do you want to bet the other one couldn't make it?",
          "id": 59,
          "comments": [
            {
              "score": 57,
              "content": "The boss is 100% being shady, so yeah, it wouldn't surprise me at all if it turns into dinner for two. But the boss's intentions shouldn't matter--if OP's fiancee is trustworthy, even if the boss makes a move she'll say no. It never makes sense to me when a person gets mad at an SO for a third party's bad actions (here, it's not even actually actions--OP is mad about the boss's potential bad actions); women could hit on my husband all day long, and as long as he's not encouraging them or doing bad things himself, it doesn't matter to me.\n\nOP is right to express concern, but it should have been in the form of a dialogue and he needs to respect the decision his fiancee makes. Telling her she CAN'T go makes him controlling, and thus TA. She may be perfectly aware of what the boss is doing, but women are often unfortunately put in the position of balancing how much harrassment they should just deal with in order to keep a job they like/need. Maybe she has decided she can handle whatever the boss has planned, and has to do so in order to keep the job she's excited about. That makes the boss the bad guy; not her. Unless OP is actually worried for his fiancee's safety--which based on what he's said, it doesn't sound like that's his concern--he needs to only be concerned with his fiancee's actions and she hasn't done anything wrong. ",
              "id": 60,
              "comments": [
                {
                  "score": 40,
                  "content": "This is what I was going to say. OP has basically said he doesnt trust her at all, and that he thinks she's an idiot not to see the signs. I have a feeling she sees the signs, but the boss hasn't really crossed the line yet into \"inappropriate behavior  that can be called out\" or \"shit I'm willing to lose this great job over\"",
                  "id": 61,
                  "comments": [
                    {
                      "score": 9,
                      "content": "No. OP did not say that. Nice way to craft a narrative to make yourself right. ",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "I'm sure he trusts his partner. It's the boss he doesn't trust",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I mean how are you supposed to trust the wife that couldn't conceive the obvious... everyone here could tell halfway through the story how shady this was and she had to wait till he specifically explained how he would fuck her before she considered the possibility he was trying.\n\nPersonally if my gf/fiancee behaved this way about something this obvious, I would think she actually wants something to happen. Cheating is a common thing and if everyone follows the advice of blind trust, they're in for a surprise.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": ">How much do you want to bet the other one couldn't make it?\n\nI place 9.99 cookies on the table",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I edited my comment because I worded that sentence pretty badly.\n\nRegarding your comment, my reply would be about the same as Ginger_ish. How shitty the situation may be, how dangerous it may seem, you can't force her to not go. Well, you can, but that probably means that the relationship is done, because most women can't stand a man who tries to control her. Especially a naive woman who believes her man is preventing her from going to a simple dinner with her boss.\n\nThe most you can do is warn her and try to talk her out of it, and if you really think that shit is about to hit the fan you can call the police. But police won't do shit unless you have some decent proof. Besides that there's simply not much you can do without coming across as an asshole to your significant other.",
              "id": 66,
              "comments": [
                {
                  "score": 0,
                  "content": "Personally I wouldn't try to control her, but I would definitely dump her then and there if she insisted on going after the obvious signs of bullshit going on with the dinner invites.  I wouldn't even waste any more time because I would no longer trust her judgement.  Even if it were something she \"had to do to keep her job\", no partner should feel constrained to tie themselves to that trainwreck.  Your post at the top speaks as if trust occurs in a vacuum independent of things happening to change that trust while you can easily lose trust at any given point.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": ">What are you expecting? That her boss will force her and the co-worker into a threesome or something?\n\nWell as you can see after all OP's edits it exactly the opposite of what you said. You shouldn't be so naive. This is super obvious where two young females with a boss are having a \"dinner\".\n\nAnd it's not even about OP's trust in her gf, it's more about a chance that boss is a creep and can put a roofy in her drink and then what?",
          "id": 68,
          "comments": [
            {
              "score": -2,
              "content": "It's not \"the exact opposite of what I said\". I now see that I worded myself badly.\n\nWhat I meant was more along the lines of \"So what if it's likely that her boss is just setting her up for a threesome or something similar?\".\n\nEven though it's expected, I think it's best to trust your wife and let her go if she's so adamant about it. If she loves you she's just gonna walk out of there if it actually is something sexual. And that's what happened here.\n\nYou are right though that the boss can roofy her, but at that point there's no good outcome in this situation. Either you forcefully prevent your wife to go, which will very likely mean the end of the relationship because it comes across as controlling, or she gets raped because of her stubborness.\n\nIt's just a shitty scenario overall, and I'm inclined to give the benefit to letting her go to the \"dinner\". Because as I said, if you don't it's probably gonna be the end anyway.\n\n\nI also think that the boss wouldn't be dumb enough to rape her in this scenario, which just further makes me tend to let her go. There would be way too much evidence. \"Oh so you went on a dinner with two women and one of them (or both) just randomly blacked out?\" That's a pretty hard case to fight against as the rapist.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "\"Yeah! You're such an asshole for being scared and suspicious and protective!!! I mean, let your wife potentially get put into a very compromising situation where she could get molested or worse because like, you don't own her MAN!\" \n\nI think if we can excuse the finances blind naivete, we can excuse OP's not so tactful way of expressing concern. ",
          "id": 70,
          "comments": [
            {
              "score": 1,
              "content": "1. You're twisting my words.\n\n2. Read other replies of mine under the parent comment. I've already explained why \"letting her go\" is the better option, but all in all this was just a very shitty situation.\n\n- You prevent her from going: she will see you as a controlling asshole and probably end the relationship.\n\n- You let her go: (1) it's actually a nice dinner [obviously not], or, (2) boss tries to fuck her; maybe she'll decline [best outcome], maybe accept [shitty outcome], maybe get raped [very unlikely because boss knows how much evidence there'd be against him], who knows?\n\nSo, pick your venom.\n\nNever did I say OP was an asshole for being scared, for being suspicious, for being protective. He becomes an asshole if he physically prevents her from going.\n\nIf her health is in apparent danger, you could try calling the cops. But obviously in this scenario there's way too little proof to say boss is most definitely gonna rape her. So the next best thing you can do is trust her.\n\nI do think in hindsight that I should've been a little more harsher on the fiancée's naivety. So instead of \"YTA\" I think \"ESH\" would be more fitting.",
              "id": 71,
              "comments": [
                {
                  "score": 2,
                  "content": "You're also twisting the situation and taking OP's words as literal. OP didn't say he was actually going to physically stop her. Nothing of the sort was even attempted. He simply used the wrong words out of suspicion and fear. \n\n",
                  "id": 72,
                  "comments": [
                    {
                      "score": 1,
                      "content": "You're right on that. My initial judgement was too harsh on OP. Still think the situation could've been handled way better on both ends, even when taking into account that OP was scared.\n\nFor example, I don't think the fiancée locking herself in the bedroom is to blame solely on a possible overreaction of hers. Seems to me that both parties let the situation escalate.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "You called it :)",
          "id": 74,
          "comments": [
            {
              "score": 1,
              "content": "Yep. It was pretty obvious. Almost everyone sees the fiancée as extremely naive in this story.\n\nThis was just a shitty scenario for OP. He could either force his fiancée not to go, which most likely means the end of the relationship because he comes across as a controlling asshole to her, or he lets her go and just hopes for the best.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 212,
      "content": "You’re not ready for marriage if you think forbidding a woman to do something is acceptable. Express concern, fine. Dictate to - no effing way. ",
      "id": 76,
      "comments": [
        {
          "score": 91,
          "content": "His fiancee is also pretty damn gullible though. If she's looking at this situation and going \"oh this is fine\" it changes pretty quickly from \"I am jealous\" to \"I am worried she is gonna get roofied or fed shots all night and raped\".\n\n&#x200B;\n\nLike I'd be PISSED if my husband ever forbid me from doing something, but I also would have recognized about 18th that this guy was 100% a sleaze ball and wouldn't have been attending. I really can't figure out at what point it crossed from \"controlling\" to \"trying to avoid having his fiancee get raped\" ",
          "id": 77,
          "comments": [
            {
              "score": 14,
              "content": "I don't think you're wrong but the way he said it probably made her very angry and that might have prevented her from analyzing the situation more thorougly. She probably thought she was doing a good job and that was a recognition of that. I imagine she must be double pissed not only because she was wrong but that her boyfriend acted like an asshole towards her and was right in his judgement of the situation. He's right about giving her space, she sure as hell needs it right now. \n\nOP, YTA, you were right but find better words next time, it's important. ",
              "id": 78,
              "comments": [
                {
                  "score": 35,
                  "content": "You'll notice that he seems to have spent a lot of time trying to talk to his fiancee about this before trying to forbid her. ",
                  "id": 79,
                  "comments": [
                    {
                      "score": 4,
                      "content": "His snarky way of describing it makes me believe he wasn't very respectful then either. But of course that's just my suspicion. \n\nIts hard to judge without her point of view as well. I just imagine she wasn't angry for no reason. ",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Nor does her behavior make her sound ready for marriage. The problem wasn't that they argued, it's that it went down in a toxic way. You also make it sound like wives don't regularly dictate to husbands, explicitly or implicitly, what they expect the husband to do.",
          "id": 81,
          "comments": [
            {
              "score": 1,
              "content": "I agree, but she didn’t put it out there for our judgment. ",
              "id": 82,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "This is true, but she’s not either. She’s incredibly naive and gullible. Who knows what else she’ll fall for.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 132,
      "content": "NTA. Your fiancée sounds suuuuper naive & her boss sounds like a sleazy predator. It would’ve been fine if it was a true work event, but now it just sounds like an excuse for this man to get your fiancé alone. ",
      "id": 84,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 118,
      "content": "ESH. Well, I'll split from everyone else. I would agree that he's likely either a creep and she's naive, or he's a creep and she is fine with it. But forbidding her to go was clearly not the right move. Tell her your concerns and even say you'd rather her not go, but she's an adult. If it turns out to be a mistake, then it's her issue. If it turns out that she's being sketchy, then forbidding her from going isn't going to make her suddenly become trustworthy.",
      "id": 85,
      "comments": [
        {
          "score": 95,
          "content": "[deleted]",
          "id": 86,
          "comments": [
            {
              "score": 24,
              "content": "I'd assumed if she fell into that category that she'd express that to her fiance, though, rather than maintaining that it's not weird. I'm not commenting on her choice to go, but just the way she's justifying it.",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Maybe she just needs some good legal advice on harassment.... wait ",
              "id": 88,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}