{
  "post content": "Not good at making titles so let me explain, also sorry for bad formatting. \n\nI am a 16 year old high school student with a rigorous course load this semester and an even worse one next semester. I work as a busboy in a restaurant and am currently scheduled for two days a week. I work Sundays about 11-6, and Mondays 3-11. My schooling is important to me and will come first and my Sunday shift is always fine but Monday’s are tough. This school year is an awkward one due to Covid, I have lots of homework and often have to re teach and study subjects. My school gets out at 2:30 and my shift starts at 3 so I have zero time to actually do my homework. The busser I work with is in the same position and we switch off closing shifts every other week and it’s sucks. We stay until 12 if we close which leaves zero time for homework. Anyway, I have been working here for quite awhile and haven’t closed and even in this manner. The bartender I work those days makes us do a ton of stuff and doesn’t make any compromise to get us home early. One day I asked”what do we need to do” with some attitude in my voice and last week my boss called me into the office and threatened to fire me and ave me the solution to my problem by calling in and asking to come in at 3:30, I explained that this doesn’t even give me time to finish my math homework and I have 4 classes. \n\n\nI understand that he has a business to run but it is unrealistic to say that and expect us to stay that late. I understand the attitude wasn’t good but it is upsetting, to be stuck there. \n\nIs unrealistic of me to be upset about having to stay all night and having no help closing from the bartender and being stuck late at night and told not to prioritize school? \n\nTL;DR: I work at a restaurant and also have school, my shift starts right after school and am upset Bc I don’t have time for homework, boss threatens to fire me and than tells me not to prioritize school.",
  "id": 1,
  "comments": [
    {
      "score": 24,
      "content": "ESH\nIt sucks your work won't accommodate your schooling, but that's up to you to find a way to work around it or get a different job.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "I agree but it is the best place to work at, I make $10 and hour and still get tips for bussing. I try to work around it but the scheduling isn’t helping, what should I do? I also am scared of getting fired when I say I can’t work at all next semester. I have 4 AP classes and my SAT to study for.",
          "id": 3,
          "comments": [
            {
              "score": 16,
              "content": "If you can't work you should just quit your job.",
              "id": 4,
              "comments": [
                {
                  "score": 9,
                  "content": "You should reduce your hours and say you’re not available to work after 8. You’ll lose some of your pay check but if you can’t work and get homework done, and by your own admittance you can’t, then something has to give. Put school first and cut your hours, or only work on the weekend. Work can accommodate you to a certain extent but if they need closers they need closers and you’re not the person for that job.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Well that is what I am asking for really and am texting about scheduling I am just scared because I don’t want to look like I am telling her how to do her job. It’s just to put two highschoolers with homework and other responsibilities on a shift that goes until 12 is not a good idea imo, I have no problem staying until like 9:30 or 10 but I just can’t stay that late, I need to do my homework and necessary studying and I also need sleep.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "It’s not that I can’t work, do on the weekends and work well but this was not in my availability and I am just looking for an accommodation, I don’t feel that is unrealistic to ask for.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Its not unrealistic and if it wasn't in your availability then they should accomodate you better, sometimes you really need to stand up for yourself and say \"I am only available to work on the weekends, and I'm not going to be able to cover any more shifts beyond that\" and they need to hire somebody else for the position coz you're not willing to budge on this issue.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Sorry to say it but your outside of work life is not their responsibility and you can't expect them to cater to to your needs sinply because you got busy now.",
              "id": 9,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "YTA man, your job and your tasks at work are your responsibility. It's great that some coworkers are willing to work things out with you, but no one owes you a compromise. If it's too much homework-wise, ask to be taken off the Monday shift.",
      "id": 10,
      "comments": [
        {
          "score": -3,
          "content": "That’s the thing though I have and try to work around it and realistically I feel it falls to the bartender that makes to high schoolers stay late af night to do minute tasks, 10pm is fine and big hard tasks I get but standing around until 12, which is past my towns curfew for me, to wash a metal grate that just gets sprayed down in the sink is kinda a problem imo.",
          "id": 11,
          "comments": [
            {
              "score": 5,
              "content": "So do you think the bartender should stay extra late so you can go home early? If part of the job is closing down, then stay til you're closed down. You don't get special treatment cause you're in high school. Of course, there's nothing wrong with prioritizing school, but if you can't make your job work with school, change jobs. That's on you, not anyone else.",
              "id": 12,
              "comments": [
                {
                  "score": 1,
                  "content": "It is not staying extra late. But make a compromise, cleaning the grate thing before you go takes maybe 10 minutes. But when we have done everything we can and have to sit and wait to clean the grate it is a problem imo. Especially when I am closing everything and she is sitting at the bar eating and drinking. I have no problem cleaning the floor Mats, mopping and whatever else but small tasks that I have to wait around until 11:30 to complete and can be done by her to helps us out does not seem unreasonable in the slightest to me.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 2,
                      "content": ">can be done by her to helps us \n\nBut are any of those tasks part of her job? Or is she just there to supervise?",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "so the problem is really that the bartender is lazy or inefficient with their own closing tasks? that wasn't really clear in your first post. you could try to frame it that way to your boss, but in a confrontation between a part time hs student and a full time adult, you're gonna have a hard time coming out on top.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NTA - Being frustrated with someone wasting your time is understandable.  Just know that because you are a teenager that no matter how justifiable your criticisms or frustrations might be with an adult co-worker...they can always resort to the \"teenage drama\" explanation.  Hell, that's the first thing I thought was going to be involved when reading this post.  I'm glad I got some extra information.  \n\n\n----------------------------\n\nORIGINAL COMMENT:  INFO - You've given the before and the after, but very little information on the actual event you want to be judged on.\n\nIt seems like a huge leap from saying one thing with an attitude to a boss saying you might be fired.  What about the write-ups/verbal warnings/etc.?",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "Well basically the incident was me and my friend who is the other busser being there at 10pm. We were both a little upset because we have homework to do and we’re basically standing around in an empty restaurant as our closing tasks have to be like ‘approved’ by the bartender. She tells us to stop standing around even though we had done all we could, he asks something along the lines of “ok what can we do right now though” and I say “what do we need to do” that was it for that night and two weeks later I get to work on Monday and am called into my bosses office. That is all of it, no warning no nothing about it. I have asked multiple people and this is a problem with this bartender.",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "So it's frustration with bad delegation and time wasting, not frustration with having to work for money.  That's understandable.",
              "id": 18,
              "comments": [
                {
                  "score": 1,
                  "content": "Exactly thank you for that. I couldn’t quite put that into words. I have no problem doing those tasks but I do have a problem when I am getting no help and am there for two extra hours because I need to wait to do small things. Filling ice bins, stocking, cleaning bathrooms, floor mats, sweeping I am all fine with, closing half the bar fine but waiting around for the last person to leave so I can plug up the keg tapper is kinda annoying imo. Not something I have a problem doing generally but if I was getting help on it rather than doing it all by myself it is upsetting.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA Your schooling does need to come first and you need to explain that to your boss. I would also apologize for your “attitude” earlier. Take this opportunity to explain to him how stressed you are. Humanize yourself so you’re not just another worker to him. He might be more lenient in the future. I’m sorry OP. Try to keep your head up, things will be better soon. Is it possible to cut down to just one day a week? You’d be surprised how much that can do for your mental health and well-being.",
      "id": 21,
      "comments": [
        {
          "score": 1,
          "content": "I am going to try but it is difficult and I don’t want to put my coworkers in a bad spot. I have also tried to explain that to my boss and his answer was to not let school seep into work. I have also apologized for my attitude, idk to me it seems that what is left rests on management to understand that it is illegal for us to be there.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNot good at making titles so let me explain, also sorry for bad formatting. \n\nI am a 16 year old high school student with a rigorous course load this semester and an even worse one next semester. I work as a busboy in a restaurant and am currently scheduled for two days a week. I work Sundays about 11-6, and Mondays 3-11. My schooling is important to me and will come first and my Sunday shift is always fine but Monday’s are tough. This school year is an awkward one due to Covid, I have lots of homework and often have to re teach and study subjects. My school gets out at 2:30 and my shift starts at 3 so I have zero time to actually do my homework. The busser I work with is in the same position and we switch off closing shifts every other week and it’s sucks. We stay until 12 if we close which leaves zero time for homework. Anyway, I have been working here for quite awhile and haven’t closed and even in this manner. The bartender I work those days makes us do a ton of stuff and doesn’t make any compromise to get us home early. One day I asked”what do we need to do” with some attitude in my voice and last week my boss called me into the office and threatened to fire me and ave me the solution to my problem by calling in and asking to come in at 3:30, I explained that this doesn’t even give me time to finish my math homework and I have 4 classes. \n\n\nIs unrealistic of me to be upset about having to stay all night and having no help closing from the bartender and being stuck late at night and told not to prioritize school? \n\nTL;DR: I work at a restaurant and also have school, my shift starts right after school and am upset Bc I don’t have time for homework, boss threatens to fire me and than tells me not to prioritize school.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA - Are you legally allowed to work to 11 on a school night? Where I am from the latest a high school student can work is 9:30 pm. You should double check that your employer is following the law. \n\nIf you don’t have to work. As in your doing it for “fun” or extra money. You should consider just quitting. Or look for another job that is more understanding towards high school workers.",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "I don’t really need to but want to work as much as possible and I make above minimum wage while still getting tips and I am trying to take an EMT course this summer and go on a trip to Rome for school. I am looking into laws right now and don’t think an accommodation like this is that difficult/too much to ask for.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Talk to your school counselor. Many times they will be able to provide your work with something stating the legal hours you are permitted to work being underage and still in school.",
      "id": 26,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Your superiors don't owe you anything except a paycheck.  That is the reality.  Your schoolwork is your problem.  If you can't do both, you need to change jobs.",
      "id": 27,
      "comments": [
        {
          "score": 2,
          "content": "My original post didn’t cover this well but I explained it to someone else. 1. This is out of my availability. 2. It isn’t that I have a problem with working it is that I stand around for 2 hours to do simple tasks that the bartender could do, it is no secret I have school and all the big labor intensive tasks I can do but waiting around as she eats and talks to the server so I can wait all night until I can take a grate and spray it with water is my problem, it is bad management, comes across as lazy and inefficient and bad delegation.",
          "id": 28,
          "comments": [
            {
              "score": 4,
              "content": "It is hard to transform from teen where your parents have a responsibility to manage your tasks to a level where you can prioritize schoolwork, to a worker bee whose employers have no such responsibility.  Their responsibility is to turn a profit so that they can pay everyone and stay in business.  Your worries mean nothing to them, you can be replaced easily.\n\nIt's worth a shot, if you are indeed just standing around for hours, to ask if you can do your homework while waiting for closing chores.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}