{
  "post content": "My mother passed away last year. And the entire process is about to come to an end in just a few weeks. \n\nFor the past six months, my husband has been looking at a multitude of things that on a regular day, we definitely can't afford. He'd have to use credit or save up for weeks or months. A person can wish for stuff or want to work towards a treat for themselves. But he hasn't made an effort to save up for these expensive purchases. \n\nInstead he's been asking for updates on the legal process and asking how much longer it's going to take. He's even asked me several times about an estimated amount. I've given him very little to no information because at this time, things can still drastically change. With a creditor popping up and saying that money is owed or etc.\n\nHe's not the most responsible person with money. I've manage the finances full time for the past three years straight. He used to manage our finances. But he has a history of sabotaging our financial goals and blowing our budgets. \n\nMy intention is to use half of my inheritance to move our family into a house. Then save 40% to help my children in the future. Like graduations, college, trips, their first cars, etc. And have a small emergency fund. \n\nSomething we couldn't do before because my husband kept giving money to his side of the family to help them with bills, groceries, legal troubles, etc. Draining our accounts and leading our family to homelessness three separate times. I understand that if it's family, you have to try and help somehow. But letting your three children and wife become homeless because an adult family member couldn't be responsible enough to pay their own bills or got into legal trouble is a hard thing for me to fully understand.\n\nI really don't want to wake up one day and find out that every cent has been spent behind my back. I'd like to open an account in my name and follow through with the plan I mentioned above. He has made it clear that intends to buy a new vehicle, tech, game system and other items just for him. Not our children or to improve our family's future. \n\nWhen I talk about investing or saving, he says that life is too short for that. I told him that it wasn't about us. It was about our children. And his response was that when our children become adults, they should work for what they want.\n\nThat statement seems backwards considering his actions as of late. I know for sure that if his parents pass, we will have to pay off their debts and cover all of the unknown costs out of pocket. Financially speaking, started my marriage with my husband completely debt free. And I have worked for years to finally get him to be debt free as well. But over the past ten years, he's paid off his parents credit card and IRS debts. They live paycheck to paycheck and think saving money is pointless.\n\nI'm not sure if I'm making the right choice. But I really just want my children to have the same happy and stress-free childhood I had. \n\nAm I The Asshole?\n\nEdit: I'll post an update on Tuesday.\n\nEdit: Update.\n\nThank you to everyone who gave me the advice I needed. My Mom was the only person I trusted enough to ask for advice on serious issues. Thanks for the awards and giving awards to those who gave me sage advice. I wasn't expecting any responses and my post to be buried by more interesting ones. Maybe five at most.\n\nSome people asked questions that I would not like to address. On the off chance that my husband, his family or family friends find this. I would like to keep those details to a minimum. So I can have the time I need to leave and ensure that my children will be properly cared for and safe. \n\nYou're all correct, I was a sh*t parent in the past. I was too focused on making the money to for our financial goals and not paying attention. I was too trusting without doing my due diligence. For that bit, I can accept responsibility and fight tooth and nail to make changes to be a better person and parent for my children. \n\nI spent two days lining up appointments for the first week of October. When I know I'll have time alone to handle everything privately. I found a divorce attorney, a financial advisor and a bank that's a bit out of the way. I also made an appointment to visit the firm handling my Mom's estate to find out what my options are with them. Everyone was correct about their assumption that I live in the US. That's the most I can say. \n\nSome things to clarify:\n\nI truly am unsure if what kind of financial ties my husband has created with his family members. That's why I said that if his parents pass, I'm sure there will be debts to pay. But I'm definitely not going to be around long enough to finance it.\n\nA lot of people asked how I could be with him. And he wasn't like this while we dated and after we got married. It probably started midway through my fourth pregnancy, with our now first born. It made sense that all of the trouble we faced, just to have a child, could have drained us. I believed because we kept all of our bills paid and filed away. \n\nMy binder of medical bills was three inches thick. From my first pregnancy to the day our first born came home from the NICU. With that in mind, I just accepted it as the blanket reason for everything each time. He would reopen that wound about how expensive it was for all of that. How it's going to be more expensive the next time. \n\nI purposely had a birth control procedure done after I had a near death experience with my last child. I did it for health and moral reasons. I never told him about the procedure.\n\nI'm still with him because my situation isn't so cut and dry. I had to dig our family out of hole and got an apartment. I tried to create as much stability as possible to focus on my Mom. All of this came out around the time I was taking care of my Mom. From the day I first took her to the hospital last year, I had to table it until now.",
  "id": 1,
  "comments": [
    {
      "score": 10373,
      "content": "NTA. Inheritance isn't marital property. But you need to be straight up with him and tell him he isn't going to have access to it. You're gonna have to have enough spine to put your foot down. If he doesn't like it let him leave because it doesn't sound like he's contributing anything.\n\nEdit.\n\nThanks for the awards! I wasn't expecting to have the top comment.\n\nPlease read the other comments and talk to someone that can give you financial advice and help you protect that money. Keep it wholly separate from any joint funds. Don't even use the same bank if you don't have to and don't tell him when you have it.\n\nBe prepared for an epic tantrum when he finds out he isn't going to spend your money.",
      "id": 2,
      "comments": [
        {
          "score": 2593,
          "content": "This ^^^\n\nI would also add that you should look at a financial planner/advisor to ask questions and explain this situation so you can get clearer advice from a professional.\n\nBut seriously, be upfront and direct that your inheritance isn’t his spending money. Don’t tell him when exactly you’re getting the money, or how much you’re getting. \n\nAnd listen to all the other comments about keeping the account/place with the inheritance money separate with no way for him to access stuff. He is *so* bad with money that it has lead to you and your children being homeless 3 times and once is too much, and if he argues or complains don’t hesitate to bring this up; some people might say not to bring up the past but this is related to your current dilemma and just hits home how incompetent he is with finances and how he ABSOLUTELY CANNOT be trusted with them.",
          "id": 3,
          "comments": [
            {
              "score": 908,
              "content": "If the guy’s not recusing himself from financial operations he’s not only incompetent he apparently doesn’t give a shit about the family’s security either.",
              "id": 4,
              "comments": [
                {
                  "score": 2449,
                  "content": "And for God’s sake, if you don’t divorce this leech make sure your name is the only one on the house title.  Also, establish a signed rental agreement with him so he can’t claim some ownership of the house later.\n\nI don’t know how the two of you have lasted this long given you’re financially incompatible.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 659,
                      "content": "Omg good point. She puts his name on the house who knows what lines of credit and shit he might establish that she won’t know about.\n\nETA: thanks for the award! 💜",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 424,
                      "content": ">And for God’s sake, if you don’t divorce this leech make sure your name is the only one on the house title.\n\nI can't empathize this enough, OP don't put his name on there. Don't let him have access to the money either. NTA.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 222,
                      "content": "The dude made their family homeless more than once, is looking at a money that isn't his as spending cash, people agree he shouldn't be on the deed and there's a real possibility that OPs savings may end up being eaten by his parents debt.\n\n\nAt this point, is that the male role model OP wants their kids to have?",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "This! I was reading the post thinking why hasn't she divorced this guy? What is he bringing to the relationship that makes her want to stay? \nAlso protect any money you get and trust funds for the kids because he was take them. \nBut honestly leave him and you and your kids will have a much better life. \nNTA Op",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "Also, mention how hypocritical it is for him to insist on bailing his parents out, but is willing to let his wife and children to go homeless!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "She sounds like she’s raising four children, not three.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "She won’t. He’ll do exactly what he has planned. It’s the same story on here over and over. People post for help and advice but don’t usually take it and it just gets worse.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Incompatible?  It sounds like you're right.  Husband is a leech.  I know a spend/save couple but even the spender makes sure her half of the bills are paid first.  She's not nearly as reckless as OP's husband with money.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Buying your house while married is considered a marital assets no matter who’s name is on the deed. Meaning shared at a divorce in most states. Talk to a professional",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Yes or put the house in some sort of heirs trust NTA.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 359,
              "content": "I think that its time to leave this husband. He is the opposite end of financial abuse in that he is mismanaging their money. He is emotionally immature and selfish. Any time that you need to hide money from your spouse then its over. OP is just wasting time and finances on someone that doesn't value longevity nor their immediate family.",
              "id": 16,
              "comments": [
                {
                  "score": 190,
                  "content": "I agree with you. Even if OP doesn't let him touch the inheritance he'll just stop paying his share of the bills and support for the kids, run up credit card debt and bleed her dry in other ways. I kinda wanna call OP an AH for allowing this man to make her and the kids homeless three times. I'd have left the first time.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 56,
                      "content": "At this point she is a wilful victim to her husband's abuse.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "As someone who divorced a person like this, also agree. She will have a miserable life where she will be playing catch-up with her husband’s bad decisions permanently. And the kids will be dragged into it. \n\nIf she wants to be happy and not take care of an adult who should be her partner, she should end this. People try and pretend money is not important when it comes to love but how both people handle money is a huge part of a relationship.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 18,
                      "content": "It's also a sign of his immaturity and unwillingness to cooperate. He's acting like a child, not a parent.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Same. It sucks having to hide accounts and actually pull money *out* when you find out they are complete liars. Fun times. The best part is when *they* accuse *you* of stealing 😆, like they weren't the one burning through it all along",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "Past is prologue...homeless not once, twice but three times. That isn't just bad luck, that's crappy planning and poor priorities. Her husband has already spent money in his head that he doesn't actually have. Agree with everyone saying OP has to protect her and the kids. Keep the money separate and safe.",
              "id": 22,
              "comments": [
                {
                  "score": 86,
                  "content": "And honestly by the THIRD time their children were homeless because of it... OP is just complicit in this man's negligence. I cannot imagine not divorcing someone on that basis alone.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 47,
                      "content": "IKR, the first time he did that to my children would be the last time.  I cannot fathom being with someone who drove his family to absolute ruin three times.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "Absolutely this. Inheritance is separate property.\n\nYou need to meet with an attorney to see what you need to do to ensure that this money stays separate.\n\nAlso, neither you nor your husband are liable for his parents debts.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Maybe even imply to him that the $$$ is way less than you had thought.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I am a financial planner and the OP has the right idea in opening a new account in her name only to hold the funds. As long as they are deposited into a separate account and never comingle with marital assets then she's fine. \n\nIf she gets a financial advisor to manage the funds then she should give them strict instructions to never speak to her husband. He is obviously eyeing her money. For bank deposits set up alerts and ask for any security measures they have.\n\nOnly set up transfer instructions on the accounts in her name to the family checking or wherever else they might go and get 2FA. Maybe even see if transfers can only be processed verbally and with a verbal security password. I do not trust the husband at all.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This exactly but I'd like to add that you shouldn't even have this separate account at the same bank as your current banking accounts with your husband. He cannot, I repeat, CANNOT have access to these funds. Set your family up for success the way you're planning. If he can't get on board with that, that'd be a hill to die on for me.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Sounds like everything should go into trusts that he cannot access, including any house purchase.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "As she's married to him, can't he just respond to her not giving him access to her inheritance by running up debts, and leave her liable to pay them? She needs to divorce this dumpster fire of a husband and find someone with basic morals and some humanity. What sort of man risks homelessness for his wife and kids to bail out someone from their family of origin?",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It would be smart to tie up the money in a life insurance policy that she can borrow against, then buy a multi family dwelling and pay the mortgage with the rent, or if she doesn't want to be a landlord, just a single family dwelling and make the payments herself. After she divorces this guy of course, inheritance can't be divided as martial property in a divorce. This guy feels entitled to what isn't his, and no amount of telling him \"no\" is going to have any effect, he'll figure out a way to get his hands on it if he has to steal it.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 512,
          "content": "And don’t put his name on the house deed if you do spend some of the inheritance on buying a house.",
          "id": 32,
          "comments": [
            {
              "score": 344,
              "content": "i really think she should divorce him, and then buy a house. i'm so sorry, but she said when his parents die they will be on the hook for their debts - that's going to come straight from her money. if there's any left after his spending spree. \n\nshe should leave now. i know it's not marital property, but she's stayed with him while he took their hard earned money and gave it to family when doing so meant they became homeless. she hasn't been able to truly stand up to him before. this is not a good guy, she needs to get out. he has taken too much from her already.",
              "id": 33,
              "comments": [
                {
                  "score": 162,
                  "content": "Adult children are not responsible for their parents’ debts, unless they co-signed the debt. Any assets the parents own will be sold to pay off the creditors and anything left will go to the heirs. If they have more debts than assets, they rest just doesn’t get paid.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 91,
                      "content": "Yeah, but what if husband *did* co-sign the debt? OP talks about all of the financial help he has given them.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "In general, most states, if they're in the US, the children will not be responsible for the deceased's debt. Any creditors will be paid from whatever assets the estate has until  the money runs out. Then, the creditors are stuck. Now, if you're husband co-signed any debts, then he is on the hook, not the wife. And they won't be able to go after her own inheritance.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Please do not commingle your inheritance.  Get legal advice regarding the law where you live asap but be cautious about buying a house with your husband.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "Or ever allow his kin to move in, which will absolutely be tried.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "I know that they have kids, but why stay with this man?? I would leave him prior to getting the inheritance. Then he can’t try to claim anything or get his hands on the money or any property. Once you’ve left him and get your inheritance follow through with your plans. This man has let his wife and children become homeless THREE times! He cares more about bailing out his parents than his family having a roof over their heads!!",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "This is the thing. If marital money is spent on it, it might become joint property. She should talk to someone to protect her assets from her irresponsible husband or he will take half of that money if they divorce",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Omg yes this!!! ^^^",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 172,
          "content": "Just want to piggy back on this.  Once his parents pass you're not responsible for their debts.  DO NOT let a creditor try and trick you.  Don't pay their debts at all once they pass.  You shouldn't have to anyway before then, but your husband is a problem.  Why stay married to a man who has put you through so much?",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 160,
          "content": "Inheritance isn’t marital property UNLESS it’s commingled through things like being deposited in a joint account, being used to buy a home that is in both your names, or used to pay off joint debts. Each state is also slightly different in intake treatment.\n\nNTA, open an account in only your name and deposit the cash there, transfer any investments into a brokerage account in your name only, if you buy a house put it in your name only.\n\nA man who has made you homeless THREE TIMES through reckless spending will do it again and again if given the opportunity. When you get sick of it and realize you deserve someone who prioritizes you and your children, you’ll be happy to have kept it separate.",
          "id": 43,
          "comments": [
            {
              "score": 19,
              "content": "Exactly, be ever so careful before you spend anything. You may want to talk to a financial advisor first to learn the rules.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Just to reinforce this comment - that inheritance represents ***your*** generational wealth, not his.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "They as in kids need to work fir this own stuff as adults, yet he doesn’t nor his family? Nice",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "This is true, at least in my state in the US. Just check with a lawyer to see how to prevent co mingling money, just in case. A separate account should work but laws differ so much it's worth an hour or so with a lawyer.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "This!! DO NOT put it in a shared account. Stick to your plan and open up an account that is just in your name!",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "High jacking the top comment to say—it’s only non-marital property if you don’t commingle the money with marital property. In other words—separate account, in your name only.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Yes this and make sure any money is transferred to an account he doesn't have access to, preferably at a completely different bank too.\n\nNta",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2040,
      "content": "NTA. Get a lawyer to help set everything up so he has no claim to the money EVER. Open a separate account and don’t put his name on the house deed. Also are you in the US? Because you won’t have to pay off his parents debts. It comes out of their estate and if the estate doesn’t have any money it doesn’t come from family.",
      "id": 51,
      "comments": [
        {
          "score": 646,
          "content": "This! This is outside this subreddit pay grade. **Get a lawyer NOW.** Find out what your options are and how you can protect your inheritance. Do not delay as it could cost you.",
          "id": 52,
          "comments": [
            {
              "score": 15,
              "content": "Lol, this subreddit isn't paid anything. EVERYTHING is above its paygrade. It's just a bunch of internet strangers shooting the shit, possibly while they're drunk or high.",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 237,
          "content": "THIS.\nWhen his parents pass, DO NOT pay off any debts in Us).\nNTA. He is 100%. \nHe’s right that when your kids grow up, they can decide. You’re a grown up. It’s your inheritance. You can do what you want (of course within reason).",
          "id": 54,
          "comments": [
            {
              "score": 94,
              "content": "To clarify this, any debt that can be covered by the estate must be paid by the estate before probate can be concluded, but any debt exceeding the value of the estate is written off and kin are not held liable",
              "id": 55,
              "comments": [
                {
                  "score": 24,
                  "content": "Random question! Not sure if it's something you would be able to answer? If my parents have timeshares and haven't been able to escape them, upon their death that won't fall to me and my siblings' shoulders?",
                  "id": 56,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Nope. Unless you want them. Same as a mortgage on a house. You have no requirement to pay them.",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Nope, unless, as u/HardRaisinsFalling mentioned, your name is on the contract you’re not obligated to pay/do anything. They may try (most likely will try tbh) to coerce you into paying something, but unless the money is coming from your parent’s estate (which is separate and distinct from life insurance monies) they are entitled to nothing. We’ve gone through that with both my husband’s parents and they try until you threaten getting lawyers involved usually.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "That separate account should be at an entirely separate bank, too, just in case.\n\nThe estate thing is the same in Canada: you can't inherit anything of more-than-purely-sentimental value without dealing with the creditors, but if you're willing to let that go, then correct: the debt dies with the debtor.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Why even stay together",
          "id": 60,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 934,
      "content": "NTA. Do not tell him how much it is and *DO NOT LET HIM ACCESS ANY OF IT.*\n\nHe is not entitled to your inheritance. It's yours and yours alone. He has proven that he cannot manage money and it's no wonder, given his parents are not responsible either. For the sake of your kids, protect this money from him. \n\nPut it in an account only you have access to and make sure your kids are the beneficiaries on any accounts you set up, including investment accounts. \n\nIf you use part of the money to buy a house, put only your name on the deed and set it up so your kids inherit if something happens to you. \n\nIf he responds to this with anything other than \"you're right,\" consider whether you want to stay with someone who would rather spend money on himself than help your kids have a better future. If a new car is more important to him than college for your kids, your goals are not aligned and it's not going to change. He is who he is.",
      "id": 61,
      "comments": [
        {
          "score": 478,
          "content": "Also how gross is it that husband is excitedly talking about how HE is going to benefit off *the death of OP's mother???*",
          "id": 62,
          "comments": [
            {
              "score": 103,
              "content": "Not only is he excited about it....but, he also said F dem kids.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "Extremely gross!",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "OP would be a fool (and an AH to herself and her kids) to give the husband access to her inheritance. He has already told her that he fully intends to blow it all since life is short. He also said F dem kids and their futures. \n\nThis man's actions has resulted in OP and her kids being homeless 3 times, and yet here is, salivating at the thought a blowing through any money OP gets without a second thought for his family's wellbeing....\n\nIt honestly sounds like this man (and his family) are making OP's life harder instead of enriching it.....",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 766,
      "content": "YTA why are you still married to him????? You're risking the entire future of your kids to be with a guy who couldn't find fiscal responsibility given a x marks the spot map and a guide. He can still just spend the money without knowing how much it is and you'll be responsible for the fallout and have to use the inheritance anyway.",
      "id": 66,
      "comments": [
        {
          "score": 303,
          "content": "Even if she doesn’t give him access to the money he’s going to run up a shit ton of credit card debt. OP needs to leave him and file for separation before the estate is settled.",
          "id": 67,
          "comments": [
            {
              "score": 119,
              "content": "This, she is endangering her children by sticking with someone legally who doesn't want to do right by them.",
              "id": 68,
              "comments": [
                {
                  "score": 76,
                  "content": "Apparently she prefers making her kids homeless (three times!) rather than breaking up and looking out for their future...",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Crap, good point. That’s exactly how he could access the money.",
              "id": 70,
              "comments": [
                {
                  "score": 3,
                  "content": "Yep just because it isn’t a marital asset doesn’t mean that OP is safe here. In the best interest of herself and the kids that he clearly doesn’t give af about, she needs to file for divorce.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "homelessness 3x with children, fkn hell",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "This. OP it won't matter if you put the money on a separate account and say you don't want him spending that money. If he can spend whatever he wants from other pots of money you have, he will. When you don't have money to pay rent/ groceries/whatever because he already spent that, what are you going to do?",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 708,
      "content": "NTA \n\n  >leading our family to homelessness three separate times.\n\n\n  I'm sorry WHAT!? How on earth are you even entertaining the idea of giving him any kind of access to a large amount of money? Looks to me like he has told you, many times, what he's going to do with that money. He's going to blow it. Just like he has been doing. He's going to blow the money, your investment plans, and your kids futures. \n\nSorry but...I'd have divorced his ass ages ago. If you hand out my money to the point of making me homeless, there's no way in HELL that trust could be earned back.",
      "id": 74,
      "comments": [
        {
          "score": 188,
          "content": "I mean, I may understand one time, shit happens, but three? Hell no! I would've taken the children and left his sorry ass on the street.",
          "id": 75,
          "comments": [
            {
              "score": 91,
              "content": "Right?! I'm sick reading this post, you know for damn sure he's pressuring/guilting her. I hate the thought of him getting his hands on it and destroying everything. Again.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "Not even that, but notice that everything he wants to get with *her* money is all fun boytoy stuff for *him.* Not for his family. Just for him.",
          "id": 77,
          "comments": [
            {
              "score": 54,
              "content": "This man will never change. He is clearly immature and has zero impulse control. Time for OP to move on. She should divorce him immediately.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "All of this but also, CHILDREN ARE NOT A RETIREMENT PLAN. How are you not saving for retirement. You can not count on your children to take care of you in old age or pay for your care in old age. What if you become estranged from your children? What if they have zero desire to take care of their aging parents? Which is completely valid btw. What if they die? What if they grow up with their own money problems? They are going to grow up and have their own lives. No one should be expecting their kids to be their retirement plan. Does your spouse not plan on living to an old age? You need to take this into serious consideration.",
          "id": 79,
          "comments": [
            {
              "score": 4,
              "content": "Exactly. They’ll end up repeating the cycle if she doesn’t leave him and teach them proper money management.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Yeah I’m glad someone picked up on this rather important point.  While I understand the balance between saving for the future and living for \ntoday….I think experiencing homelessness would make anyone see the value of emergency savings.  Especially with children.  They need stability more than a gaming system.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": ">Looks to me like he has told you, many times, what he's going to do with that money.\n\nLooks to me like he's told OP many, many times what he thinks of their children and the life they've built together.\n\nPlease realise OP, your husband is just not fundamentally interested *in being there for you or the kids.*",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "right choice? it’s like the only choice unless you like being homeless",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 280,
      "content": "NTA. But I don't know why you stay.",
      "id": 84,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 149,
      "content": "NTA. But talk to a financial planner asap. They can have the inheritance funds transferred directly to them so your husband can't \"accidentally\" buy a big ticket item. Any inheritance is usually the asset of the inheritor and not a marital asset.",
      "id": 85,
      "comments": [
        {
          "score": 42,
          "content": "[deleted]",
          "id": 86,
          "comments": [
            {
              "score": 44,
              "content": "What she needs is a divorce. He caused his fanily to be homeless THREE times. He will not change.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I sincerely hope if that happens, OP will tell him to pound sand.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 125,
      "content": "NTA.\n\nKeep your money as your money and you use it to do what's best for your family.\n\nI grew up with a gambling-addict of a father...there was a point where he drained all of their savings and hid the bank-book because he knew he did something bad.\n\nLEAVE HIM.\n\n&#x200B;\n\nETA  (because now I'm angry) This guy will bleed you dry...he has absolutely NO CONCEPT ABOUT FUTURE PLANNING...DUMP HIM NOW!\n\nYou seem to have some common sense...aside from marrying this loser...dump this dude...Anything he signed for (loans,  etc.) his parents will be on you two.\n\ndump him NOW!",
      "id": 89,
      "comments": [
        {
          "score": 6,
          "content": "Don't forget he is a financial abuser, too. He is openly planning to financially abuse her yet again after celebrating her mother's death all because he believes it means he gets new toys all for himself. Even if he can't access this money, he will just go in debt and force her to repay the loans with her money later on, likely to avoid a fourth homeless period.\n\nHe neglects his child and wife in favor of helping his own leeching family, to the point of *repeated* homelessness.\n\nHe manipulates and coerces his wife, because she's been convinced he's \"a decent father\" and that she will be responsible for his parent's debt. She's all worried his awful leech family will judge her for dumping an abuser! Her normal meter has been utterly shattered by this selfish narcissist of a man who cares *nothing* for her or his children.\n\nHe's super disrespectful to OP.\n\nHe is a bad father, but even if he was a good one, so what? He can be a decent father *somewhere else* just as well, without her having to support and pay his way while putting up with his terrible treatment of her. \n\nStaying with a man like that for the kid's sake actually does ***far*** more harm than being a child of divorced parents. That mentality of an unhappy home -where one parent mistreats the other- being better than a \"broken\" divorced home needs to die. It's a proven myth. It also sets a terrible example of what a healthy relationship looks like, so kids who grew up with parents who were unhappy together grow up to think that's normal.\n\nMy parents hated each other. My sisters and I desperately wished they would divorce from the time we were in middle school, but they felt they had to \"stay together for the kids\". All it did was make for an unhappy, stressful home, where we grew up thinking that was a normal marriage, and eventually got in our own unhappy relationships. \n\nI hope OP reads the hundreds of comments telling her to get herself free of her abuser and takes heed before he makes them homeless a fourth time. An actual decent father and husband would never allow his family to go homeless because he'd rather buy toys for himself and support his leeching adult family members, let alone twice or three times.\n\nIf OP stays with this man, thier fourth period of homelessness will be just around the corner. She will never be able to hang onto that money if she stays married to him, he will get it eventually through blackmail, coercion, manipulation, or just plain old theft. She will have no home they can keep for long, nor any college funds for the kids, because he's 100% convinced that money is all his, all for his own fun toys, and he will never give up until he has it.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 100,
      "content": "If you have the ability to do it, pay cash for a house and put it in your name only.  If he contributes to a mortgage payment, it can be claimed to be a marital asset.   Do not mix ownership if you are using inheritance.  Otherwise, he could file for divorce, force the sale of the house and take half.  \n\nWith no rent or mortgage, put your money into savings accounts that are in your kids names - maybe the educational savings accounts that he cannot get to if he tries to withdraw or force a split in a divorce.  \n\nNTA. And good luck.  He is going to cause problems for you no matter what you do.",
      "id": 91,
      "comments": [
        {
          "score": 20,
          "content": "I was thinking of this point too. This is also another reason to have a seperate account for the inheritance. It will help create a chain of evidence that the house was paid for solely from the inheritance and not comingled funds.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 80,
      "content": "What children? He is your child.",
      "id": 93,
      "comments": [
        {
          "score": 58,
          "content": "We have three. But I see what you meant. He's acting childish.",
          "id": 94,
          "comments": [
            {
              "score": 101,
              "content": "He's not only acting childish. He's demonstrated already he's a selfish, entitled, greedy AH that doesn't care you or the kids. Why are you still allowing him to ruin your life?",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Please don't let this man have any access to your money. You'll be on here again in a year asking of ywbta if you divorced him for spending your inheritance.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "He’s not a decent dad as you said before. A decent dad and husband would put his children’s needs and well being above his own wants, he would be saving for their future and not going into debt on frivolous items. He’s selfish and do you really think that will ever change? I think in most US states inheritance is not marital property so save that money in a separate account so he has NO access.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "He’s not just acting. He’s irresponsible, needs instant gratification, he can’t plan anything long term i assume because T H R E E  T I M E S you almost ended up homless. And so on. He’s not able to be a mature person. \n\nWAKE UP! What future do you want for your kids?",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Ma’am. Leave him. I don’t mean to be unkind, but if you don’t then you are complicit in what amounts to child neglect. This man has made your children homeless 3(!!!) times. Why are you still there?? You have the money now to divorce him and save your kids. Stop making excuses and protect your children. \n\nI truly don’t mean to be unkind. I know sometimes when things have been messed up for a long time it feels like it’s normal. We are all trying to tell you this is not normal. \n\nGet out, protect your finances and your children’s safety. Your husband has already told you he plans on wasting this money and continuing to neglect your family. He is an active danger to you and your kids. You need to take immediate action to protect your children. You will likely never have the funds to get out if you don’t do it now. \n\n3 times. He’s made his own kids homeless 3 times. He does not care to protect his own children. You must \n\nGood luck",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}