{
  "post content": "So I had a baby some weeks ago with my partner to whom I'm not married.\n\nWe've been together a while, and I've given many compromises in this relationship. While discussing baby's name, we had a few disagreements on names but ultimately decided on a name we both liked well enough. The surname was a sticking point: he wanted the baby to have his name alone. I offered to hyphenate b/c logistically it's easier for the baby to have both of our names. He's been drinking the red pill cool aid lately - a large bone of contention in this relationship - and went off about how it's 'tradition' and 'the right thing to to' and 'his right as a man' to have the baby have his surname. He told me I'd be emasculating him and may as well be a single parent if I won't grant him this one little ask. 'My word is final - baby's having one surname'. This was late in my pregnancy and I didn't have it in to fight, so I told him that I understood what he was saying.\n\nFF to 3 weeks ago when baby's birth certificate came. He blew a gasket when he saw that I'd given the baby my surname. He rehashed the conversation above, saying I agreed to giving baby his surname. This is where I might be TA. I did nothing of the sort. I told him I understood him, which I did - but I never said I agreed with him. I told him there was no way I was doing all the work of making a baby for him to stick his name on it. When we bought up tradition, I told him it's also traditional for him to marry me before having a baby but he was happy to ignore that, I told him it was traditional for him to be the provider but I do that too - and I pointed out other holes in his logic. I told him trying to bully me into submission with his red pill bs when I was exhausted from pregnancy didn't work. He should have known better than to expect me to not share a surname with my child. He said the baby should only have one surname - they do. So why's he mad?\n\nHe went crying to his brothers and mother - all 'traditionalists' and misogynists - and now they're all up in arms.\n\n\n\nAITA?\n\n  \nETA \n\n  \nThere seems to be some confusion - we are not married or engaged. I don't believe in it, and he's never seen the point of 'bring the state into your relationship', so we agreed to never marry. \n\nHe's on the birth certificate as the father - baby just has my last name but father is listed. \n\nThanks for your feedback. I'll be asking him to come for a talk so I can plainly address the issues you guys have helped me see. Thank you for that. ",
  "id": 1,
  "comments": [
    {
      "score": 7968,
      "content": "NTA. You told the truth and nothing more. If I read your post correctly, you agreed the baby would have one surname. You didn't agree to which one. \n\n So, why are you still with this guy? He doesn't respect you. He doesn't provide for you and the baby? Please don't say because you need him or love him. Needing him is like a fish needing a bicycle. If his family is of the same mindset, things will NOT get better so don't try to talk yourself into believing that they will. Go find someone who deserves you and your child or go it on your own if you can and want. Lots of women do. While it's true that children statistically do better socially, scholastically and generally otherwise with two parent families, your child does not need to learn misogyny, disrespect and selfishness which could easily degenerate over time to emotional or verbal abuse. You obviously don't agree with him on very basic, fundamental issues that are the foundation of a family. He can stay involved with the baby if he wants to--I'm betting he won't if you don't give in to his wishes-- but you would be wise to break off your relationship before it damages you and your child.",
      "id": 2,
      "comments": [
        {
          "score": 4249,
          "content": "I am reconsidering the relationship. \n\n  \nThe truth is he wasn't always like this. He fell on hard times and unfortunately chose to cope with that in an unhealthy way. At his core, I believe he is of good but I need to have a frank conversation about the ideologies he's leaning into and the harm it's causing in our relationship.",
          "id": 3,
          "comments": [
            {
              "score": 2617,
              "content": "r/QAnonCasualties may be a place for you. There are probably groups devoted to dealing with red pilled men, too.\n\nThese folks who get pilled, and otherwise invested in these ideologies, are a long-term nightmare. They will sacrifice their real-life relationships for online gurus. Be careful.\n\nNTA",
              "id": 4,
              "comments": [
                {
                  "score": 1018,
                  "content": "This is going to sound horrible, but I am so glad my mother died before qanon became a thing. I can only imagine the havoc she would have wrecked for those around her.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 613,
                      "content": "2020 melted minds. It's horrifying how poorly so many people fared.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 134,
                      "content": "Wanted to add my sympathy and empathy. My mom died in 2014. I don't *think* she would have gone too far down the Q hole, but I'm certain covid would have killed her. She was too social, and too immunocompromised, living in an area where masks were mocked.\n\nShe died fairly peacefully in Hospice, not alone with a ventilator in a hospital hallway. I was able to hold her as she passed. The absolute horror folks went through in 2020, losing their loved ones that way or suffering alone in a hospital themselves... I simply cannot forgive folks who deny that shit, or fabricate fantasies around it. Fuck them.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "I feel that. My mom was housebound due to bad health and she went all in on Fox News, Jerry Falwell and Pat Robertson, the Home Shopping Network, the OJ trial - whatever she could watch on TV for hours that reinforced her view on the world. She’d be a nightmare if she was still alive. I’m glad I never had to throw down over vaccines or election results with her.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "I have said this many times and I always get a side eye. (And it's always been from people who still have both parents) \n\nIt would have broken my fucking heart if my Dad were a Trump supporter. At least I didn't have to see that happen. He will never disappoint me in that way. He grew up in a very racist household and as an adult worked really hard to unlearn that poison. My brother and I were raised very differently.   \n\n\nMy still living mother is a hardcore MAGAt. But I am used to being disappointed by her. Oddly enough, she was raised in a fairly progressive non-racist (for the 1950's-70's) family.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "My mom (61) had never even cared enough about politics to be registered to vote before all this shit. I don't even recognize her anymore because of how much she's changed.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "As someone who has had similar thoughts, it isn’t horrible and you aren’t alone. I thought it was good my grandmother passed away before COVID because I know she would have gone full conspiracy and died of it.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Yeah I loved my dad SO much but literally the only thing good about him dying when he did (2010) was that I didn't have to see him join the cult of Trump. It's bad enough my mom went from not liking him in 2016 to telling me straight faced in 2020 that he was the best president we'd ever had 😬",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "My dad is super conservative but thankfully too tech-illiterate to know much about QAnon (he uses a 15 year old Macbook as his \"email machine\", that's the only internet access he has). He's heard of it but doesn't really know what it is. He's exhausting enough, it would be so much worse if he knew how to use a cell phone.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Is it bad to say I almost wish my father had passed before that bullshit came around? Wish I'd never had to see him go down that road, info wars, Alex Jones, so much stupid bullshit. I'll never forget the day he told me he was into that shit and that it \"made a lot of sense and Alex really seems to know what he's talking about\" to which I replied, \"what, you mean the guy who said they're putting chemicals in the water to turn the frogs gay? That guy?\" And he didn't have much of a response to that. Just kept blindly believing.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My dad died in 2019 and I am forever grateful I didn’t have to see how he would have handled Covid/qanon/vaccine conspiracies. Because I do have a strong suspicion that it would have ended with us not talking.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "Saw one one here called them Qcumbers",
                  "id": 16,
                  "comments": [
                    {
                      "score": 53,
                      "content": "That's unfair for cucumbers. When those stew in an acidic environment for a while they turn into something good like pickles. Qanon types stew in acidic online environments and become entirely worthless human beings.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I like this. Their viewpoints are pretty cumbersome for those who they are affecting the most with this bull.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Qcumbers and Tater tots.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I read in that sub and so far the reality seems to be that the Qanon/Red Pill folks seldom snap out of it.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I spoke to my therapist about this and she said it's pretty rare for people to break out of delusions they've chosen. Arguing does nothing because what they believe in is their reality despite any evidence to the contrary.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm lost. Which sub and what is red pill? I've heard of Qanon but don't know much about it and have never come across it myself. I don't tend to watch news programmes, read newspapers or follow politics but have recently taken an interest due to Trumps many law suits. I do hope he serves time. Horrible human being.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "For 4 years+ I had to stop watching the nightly news because it made me so anxious and frustrated. I worry for this small family and think that, indeed, OP would be better off without her red pilled partner. Especially for the baby's sake.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Oh.  Oh dear.  I read just 3 posts on that sub and had to nope right back out again, the crazy is too strong.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 8,
                      "content": "To be clear to others: The people posting aren't crazy. They're victims of those who have fallen into this shitty false reality. \n\nAnd it's affecting untold numbers of relationships. \n\nIt's utterly depressing.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Off topic, but can someone explain the red-pill to me? I do not know what that is about",
                  "id": 26,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Broadly speaking - it's the various manosphere spaces, MGTOW, incels, pick up artists, anti-feminism, all broadly misogynist.\nThe red pill is a reference to The Matrix - when you take the red pill, your eyes are opened and you can see the world how it really is.\nWhich is apparently a world where white men are increasingly under attack, women control everything by leveraging sex and through Illuminati-level feminism, and men's lives are ruined by women who are all greedy, manipulative gold diggers who use men for their resources before moving on to someone better.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 393,
              "content": "Remind him if he wants to be \"traditional\"..... traditional men didn't have sex outside of marriage. Traditional men marry women before getting them pregnant. Traditional men become husbands before they become fathers \n\n\nHe doesn't get to pick and choose what \"traditional\"   aspects he wants to follow... Especially when the only ones he wants to enforce are the ones that benefit HIM and not you",
              "id": 28,
              "comments": [
                {
                  "score": 490,
                  "content": "Traditionally, one reads a full post before commenting.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Lmao sick burn",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Fuck 🤣😂🏅",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Ouch",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "So what? The point of that comment is that 1. He’s a hypocrite picking and choosing 2. He doesn’t align with OPs values overall. ",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 148,
                  "content": "Man, the post ain't even that long and you still couldn't be bothered to read the second half",
                  "id": 34,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Give the 🦞  a break ",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 113,
                  "content": "Traditional men also were willing to die to defend the honor of their women. :) these days, many men who call themselves traditional are just soft babies who want a mommy replacement",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "Correction traditional men didn't have sex outside of marriage without it being  discreet.  Also, traditional married men were often the providers but had their mistresses. Women were for making babies and keeping  the house clean.lol, so no, thank you  .\nand not the AH. If we don't have the same last name, then the child has my last name.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Actually, that IS traditional for out-of-wedlock children.  They took their mother's surnames, or sometimes her maiden name as a surname, and taking their father's was a special case - usually the father gave them his permission.   \n\nThe famous actress Sarah Bernhardt's son, Maurice, had her name, and she had her mother's, with the addition of a \"T\" on the end.  His father, who was Prince of Ligne was so proud of Maurice when he grew up, that he said that he could use his name.   The story is that they were trying to get some sort of service, and the people were unimpressed by his father rank, but when Maurice said his name was Bernhardt, and the realized that he was Sarah's son, they rushed to help.    Maurice kept using Bernhardt.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I mean traditionally men do have sex before marriage, at least upper class men did with prostitutes.",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 310,
              "content": "I’m not usually in favor of scorched earth tactics when dealing with breakups or divorces… but..\n\nRemember that if you break up with this guy he’s gonna be hating even worse on women - and single moms in particularly. Even worse if he’s in a tough spot and you dare to demand money for the kid he was part of making - this kind of ideology hates child support with the intensity of the fucking flames of hell. And he’ll likely be spouting this bullshit to basically everyone.\n\nThis is not a reason to stay. It’s a reason to get your kid away from him as completely as possible. No kid deserves to be indoctrinated with this kind of shit.\n\nSeriously, who the fuck says “my word is final” to a pregnant woman about her baby?",
              "id": 40,
              "comments": [
                {
                  "score": 137,
                  "content": "I'm very fortunate to be in a position where I don't need anything from him. I'm financially secure, I have a good job and a good support system. I don't need his financial backing to raise this child. \n\n  \nI've texted him asking him to come home so we can talk. I'm thinking of having a mediator/neutral party there to avoid things getting out of hand.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 66,
                      "content": ">I'm very fortunate to be in a position where I don't need anything from him. I'm financially secure, I have a good job and a good support system. I don't need his financial backing to raise this child. \n\nThis is all well and good, but your child is entitled to that money. If you don't need it, open up an account and have it deposited there for unexpected medical bills, college fund, wedding fund, house deposit for your child because it isn't your money ITS THEIRS.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Please have that neutral party by all means. I am concerned for your safety.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "The most danger you’ll ever be in in your life is likely the break-up moment. He sounds like a walking murder-suicide in the making - the whole “I’m the man so my word is final” thing is straight up scary when he gets confronted with the fact that no, his word is in no way final.\n\nPlease, please make sure that you have a third party around",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": ">and you dare to demand money for the kid he was part of making \n\n\nIf she's in the US, this isn't her choice to make. If she or the kid applies for help from a government program like WIC, food stamps, the ACA, etc, then the government will go after him for child support so they can count it as part of her income before they determine what benefits she gets.\n\n\nThe kid fully deserves financial support from both parents. Please don't shame OP for going after that support. The baby daddy can die mad about it.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Please read my comment one more time and you’ll probably realise that you’ve misunderstood what I wrote.\n\nBecause of course OP need to get as much for the kid as possible.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Germany, too. I'm willing to bet that child support belonging to the child, with the parents unable to turn it down, because legally it's not theirs is a thing in most western countries (possibly eastern, too, but I'm not familiar enough with them to guess).",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "*This is not a reason to stay.*\n\nAmen.  I see NO REASON to stay.  OP is much better off with this ridiculous, self-absorbed AH out of her life.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 222,
              "content": "I understand he wasn’t always like how he is now. My ex was that way too. The pandemic and the previous president played a real number on him. But at the end of the day, he’s showing you how he is *now*. Don’t hold your breath hoping that he’ll go back to the way he was. He’s making choices every day that reinforce his “new” way of thinking and behaving.",
              "id": 49,
              "comments": [
                {
                  "score": 78,
                  "content": "Yup! And just because he wasn’t always acting this way doesn’t mean he didn’t feel it before. He probably just found that someone is validating what he already felt, giving him the confidence to act on it. Plus, adding a baby to anything escalates everything.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 19,
                      "content": "So true. Looking back, my ex was always the way he is now, he just did a better job of hiding it.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "This! There's a lot of us out there, isn't there?",
                  "id": 52,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Another member of the club checking in. I have to have a looot of conversations with my daughters about the bullshit daddy spouts these days.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 184,
              "content": "The woods are full of women in your position right now, ma'am. The best of luck to you.",
              "id": 54,
              "comments": [
                {
                  "score": 7,
                  "content": "I don’t get this comment, what does it mean?",
                  "id": 55,
                  "comments": [
                    {
                      "score": 7,
                      "content": "That men like him are likely to kill their (ex-) partners. Remember: The main cause of death during pregnancy is murder.\n\nThe path from red pill to black pill is shorter than unpilled sheep like us want to acknowledge.",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "The fact of the matter is, the longer you stay with him the more harm he can do for you and the child. Do you want your child either picking up his logic, or worse, being a direct victim of it?",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "Frankly I had to look up \"red pill\" (new to a lot of this.) But I've lived a long time too. My second (present) husband got into the survivalist mindset about 15 years ago, it almost ended our marriage. With a lot of hard work, I was able to help him see that it was not what he thought it was but by then I was ready to leave. We finally got through it but not every person or relationship is strong enough to do that.\n\nI wish you the best of luck, for your sake and your baby's. And his to be honest. We don't need more rancor and intransigence in our society.",
              "id": 58,
              "comments": [
                {
                  "score": 67,
                  "content": "You should create a post about your experiences. I would be thrilled to hear about the strains of the survivalist mindset. Like, does he avoid food storage now?",
                  "id": 59,
                  "comments": [
                    {
                      "score": 8,
                      "content": "yes, as a matter of fact, he gets mad if I get more food at the grocery than can easily fit in the pantry! *Conversely*, we have a garage lined with boxes of MREs  he bought years ago. Sadly, I have developed celiac disease and if we ever did come to a point in time where we needed them, I'd starve. but he still can't bring himself to part with them.\n\nFor years he worked on his garden and permaculture, sure that if he just got it big enough and the perfect soil he could grow enough food to feed us for a year. In fact, when we were deciding about living arrangements after he retired--we had a commuter marriage for the first 8 years because we had jobs and houses in different parts of the state--he refused to even consider selling his place and us buying a place together. His answer was \"do you know how long it takes to build up garden soil?\" That was one of the points where it almost ended. BTW the garden is now shaded by a \"food forest\" some permaculture guy talked him into. The trees have never born fruit and now I can't grow beans and tomatoes in the garden because there's not enough sun. Yes, I did end up moving to his place, another long story.\n\nMaybe I will create a post.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "I would also love to hear about this. My parents have been prepping and just generally falling down this hole for about 15 years.  I have almost given up hope for them.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 39,
                      "content": "There can be a good side.   My husband is a bit of a closet prepper, but it's by way of being an Eagle and an avid home gardener (we had more than 40 tomato plants alone last year).  So he's all into learning to put up food he grows and each car has its emergency kit with blankets etc, and he loves taking off for days long hikes through the woods.   But he's socially progressive.  \n\nFind ways to share their pride in making and growing things, it can be totally separate from the doomsday paranoia.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "*Surviving the Survivalist*… sounds like a compelling read!",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I would also be interested in hearing more. I have a close family member with a survivalist mindset and obsession with the end times",
                  "id": 64,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I feel for you. My husband always called himself (still does) an \"idea junkie.\" He started out with a privacy fetish and then gravitated to survivalist websites, chats and blogs. It just snowballed. He really got wrapped  up in the TEOTWAWKI (the end of the world as we know it) and \"peak oil.\" He would daily regale me with all of this BS. I asked him to just walk away from the internet for a week and he got extremely angry. That was my tipping point. I started fact checking him and presenting the alternative information. It did almost break our marriage. But fortunately, he does respect my intelligence and knowledge and I am blessed with patience, thus preventing me from screaming \"they are so full of it and I can't take any more of this!\" We could chat about this tomorrow if you like.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Having and raising kids is hard too, he’s going to be like this for the next 18+ years. You don’t need the stress of the relationship along with the stress of raising this kid. Especially if you’re providing for yourself and the kid. Is this the kind of guy you want your kid growing up like?",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "Sorry but this is a very toxic way of dealing with his feelings of inadequacy. He needs to figure out where his beliefs really lie. Because if this is how he really feels, adios MF. Part of me wonders if he was always like this and just hid it better because he was successful, so he felt he could be magnanimous about letting you be a more equal partner. Now that he’s fell on hard times his masculinity feels threatened, so he’s trying to enforce this “I’m the MAN I’m in charge” mentality. Good luck",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "I wish you luck, because to me this is like the argument that \"alcohol changed him.\" No it didn't, he's showing you who, deep down, he really is. Get out while you can, but you've had a baby with him, so you will be tied to him in some way for the rest of your life.",
              "id": 68,
              "comments": [
                {
                  "score": 21,
                  "content": "Sorry, but alcohol does change people.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 9,
                      "content": "100%.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yup, an explanation isn't an excuse, and it's dangerous to act like people can't change either for the better or for the worse.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "I think it bears repeating \"Your child doesn't need to learn misogyny\"",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "NTA OP...Been there, done that, got screwed! Especially if the family is just as \"traditional\" as he is, I caved and now during the divorce, me going back to my 'maiden' name, I'm realising that I'm going to be a bit screwed trying to travel with my kid with his surname only, just because I agreed to only have his. And no matter how they seem, and their potential, that freaking red pill shite ruined so many men and so many marriages! I can tell you that even a year later, after I filed for divorce because of how much red pill/ alpha male shite he was throwing up, he changed his act around the house. However, the other day we were on the couch and he got some suggested content on his feed from no other than \"Hustler University\", so yeah he's still watching that type of shite, but acting differently hoping that I'll stay in a relationship even after the divorce is final. \nPoint is, don't cave, you're the sole provider and you're not married to him, so just break it up now, before the kid starts grasping concepts of family and stuff, as it's going to be heartbreaking for the kid and for you to watch them suffer if daddy isn't the same house anymore. It's easier to break up while they're still so small, and easier for you to get used to the whole motherhood experience, without his toxic ideas around you or the kid.\n\nBest of luck, and enjoy the little bundle of joy, they make it all worth it!",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Not to mention HE told her that she may as well be a single parent. Ok. Done and sounds like had been for some time. She did exactly what he TOLD her to do.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1865,
      "content": "Was he not there when you were filling out the forms? Cause that's pretty telling too 👀\n\nNTA. What to name the baby is definitely a valid conversation to have, but he wasn't having a conversation with you. He was trying to bulldoze you without compromise.",
      "id": 75,
      "comments": [
        {
          "score": 961,
          "content": "I registered the baby on my own. He was there for the birth and everything but his paternity leave was pretty short so the admin of registering fell on me.",
          "id": 76,
          "comments": [
            {
              "score": 1108,
              "content": "All of the actual un-fun work of raising the kid is going to fall on you, too. You should leave this misogynistic asshole and just get on with raising your kid. The kid should have at least half the time in a household not soaked in gross manosphere ideology.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 361,
              "content": "As you noted. As soon as he didn't marry you or provide for you, he lost all rights to talk about tradition. Sounds like a family of AHs.\n\nNTA",
              "id": 78,
              "comments": [
                {
                  "score": 284,
                  "content": "I love that Mr. Red-Pill Traditionalist went crying to his mommy when he didn’t get his way.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 197,
              "content": "You know that babies have their mothers name, not the fathers? Traditionally the baby has the fathers surname because they are married to the mother who took his name. Unmarried mothers gave the babies their name and were unable to give them any random man's name. It's only been fairly recently that there have been so many unmarried mothers in relationships with the fathers that it changed.",
              "id": 80,
              "comments": [
                {
                  "score": 129,
                  "content": "An old friend of mine (male) made a whole post about how he feels names should be passed through the maternal line instead, and he made some really good points. The mother doing the bulk of the child rearing in most cases was one of his major points, but he also pointed out how the mother is indisputably the child’s parent (paternity can be questioned, but maternity never is), and in cases of divorce, the children usually live primarily with mothers. He had more points that I can’t remember right now, and he explained them way better than I am doing, but it was overall a very interesting post and made me think about a lot of things we tend to take for granted.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 59,
                      "content": ">(paternity can be questioned, but maternity never is)\n\nHey, fun fact, this has happened. Lydia Fairchild was accused of not being her biological children's mother because she is a genetic chimera https://embryo.asu.edu/pages/case-lydia-fairchild-and-her-chimerism-2002",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Honestly even as a kid I never understood why it was the dad’s name, cause my mom was way more my parent than my dad ever tried to be, and yet it’s his last name I’m stuck with.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I agree. Mother does all the work of growing, carrying, birthing and then sometimes feeding that baby since conception. She provided the seed and the garden and the labor of tending that garden and growing the seed. He provided some fertilizer. Why should he get to claim ownership (which let’s face it, that what taking the husbands name and giving the children his name was all about from the beginning) of what grows?",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 133,
              "content": "Where I live if you're not legally married to the father and he isn't there at the registration office when you register the baby you can't even put the father's name on the birth certificate without a signed declaration from the father.",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Oh gotcha. Well just think, if he did the registration with his name, he'd expect you to just get on board. Better tell him to buckle up!",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 139,
          "content": "His definition of compromise = do things my way.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "I live in the US and they hand you the birth certificate information to fill out while you’re in the hospital post-birth. My husband wasn’t in the room with me at the time, so I filled it out without him. It’s just a form.",
          "id": 88,
          "comments": [
            {
              "score": 34,
              "content": "With all 3 of mine they brought the form to me to fill out while the father was not there.",
              "id": 89,
              "comments": [
                {
                  "score": 59,
                  "content": "Honestly, it makes sense to do this intentionally. For precisely the reasons that are in the OP. I am sure he is far from the only shitty biological parent who will try to put pressure on the mother",
                  "id": 90,
                  "comments": [
                    {
                      "score": 16,
                      "content": "That has always been my guess honestly",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Not everywhere is the US, each country works differently and from this post it seems that she lives in a country that works similar to the UK with births.\n\nIn the UK, you have to make an appointment to go to your local registry office within 6 weeks of birth. My daughter was registered when she was 3 weeks old.\nYou have to sit with a registrar and give all the information. The father has to be there to sign otherwise won't be on the birth certificate.\nYou have to provide ID and then sign the birth certificate which you are then provided a copy of. If you want any additional copies you have to pay.",
              "id": 92,
              "comments": [
                {
                  "score": 2,
                  "content": "Back in the 40s when my Great-aunt was born her dad went to celebrate that evening. The next morning, still drunk, he rose the bike to the authorities to register her birth.  \nGot her birthday wrong for some reasons. Only by a day or two, but they never had it fixed. \n\nGranted, that was waaaaaay back in the 40s or maybe very early 50s in semi-rural germany, but he just walked inside without any documents.",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "It’s just a form sometimes, but for my wife and I it was two of the happiest moments in our life. The first was because we finally had a living, breathing child after years of trying and a terrifying birth experience. The second was because the biological mother of our daughter wanted us to be there for her birth and put down the name we had chosen for her and our last name.",
              "id": 94,
              "comments": [
                {
                  "score": 3,
                  "content": "That's beautiful. Thank you for sharing!",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1445,
      "content": "NTA and this belongs in r/MaliciousCompliance\n\n💊🚩Isn't funny how the red-pill and red flags are the sa*me color?*\n\nHonestly - no matter what the sex of the baby is - get your son/daughter out of there.\n\nYou DO NOT want them growing up in this environment. It's not \"tradition\" it's oppression and your kid is going to grow up learning they either need to be sneaky or bow down to dad's wishes to keep the peace.",
      "id": 96,
      "comments": [
        {
          "score": 66,
          "content": "What is red pill? I am not familiar at all.",
          "id": 97,
          "comments": [
            {
              "score": 340,
              "content": "It originally was a matrix movie reference when neo was offered the red pill or blue pill to stay in the current reality or open his eyes to the real world. But the red pill is now big anti women movement - women belong bare foot in the kitchen and sex slave.",
              "id": 98,
              "comments": [
                {
                  "score": 103,
                  "content": "I was completely clueless. Thank you for taking your time!",
                  "id": 99,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Me too! Thanks for asking!",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 103,
                  "content": "I'm so freaking nettled by this. Guys took symbolism of choice, freedom and rise against oppression from a movie made by trans women and somehow managed to appropriate it and make it the very name of a cult for insecure bigots.\n\nThe very expression of \"taking the red pill\" was so good before it was damaged beyond repair.",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 103,
              "content": "Ever see the movie *The Matrix*?  There's a point at which the protagonist is asked to symbolically swallow a pill to decide which worldview he will believe in.  \n\nA red pill if he accepts that the world is dangerous and he will open his mind and commit his life to join the freedom fighters.  A blue pill if he wants to continue to be a contented pathetic sheep, accepting the propaganda from the evil overlords.  \n\nThe movie isn't about gender equality.  A bunch of very misogynistic people have stolen the metaphor and turned it into a sexism thing.  \"Being redpilled\" means deciding to believe that feminism is evil, etc etc etc.",
              "id": 102,
              "comments": [
                {
                  "score": 117,
                  "content": "The Wachowski SISTERS have stated that while it wasn't an explicit allegory for transgenderism, it was definitely a reflection of their closeted transgenderism that they didn't know how to truly express. Its why Switch was a character.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Switch was written as trans? Never really thought about it",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "The current world is really upside down, huh?! Thank you for your answer!",
                  "id": 105,
                  "comments": [
                    {
                      "score": 31,
                      "content": "They haven't made a specific statement but the general sense is that the Wachowskis (directors of the Matrix series) were *pissed as hell* about their metaphor being taken over by the right wing edge lords.   I haven't seen it myself but some reviewers describe *The Matrix Resurrection* as 2 hours of cultural commentary that refutes the whole concept.  This makes me actually want to see it.  \n\nhttps://www.politico.com/news/magazine/2021/12/23/matrix-resurrections-review-red-pill-america-526038",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Oh shit. I thought it was because red was the color of republicans.\n\nI wasn’t even thinking of the matrix.",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "This is a pretty good video about it. But once you go down the rabbit hole, the nastiness just gets worse and worse. Misogyny is a major facet of fascism. [https://www.youtube.com/watch?v=CDrJo8d45gc&t=1s&ab\\_channel=KnowingBetter](https://www.youtube.com/watch?v=CDrJo8d45gc&t=1s&ab_channel=KnowingBetter)",
              "id": 108,
              "comments": [
                {
                  "score": 2,
                  "content": "That is crazy!!!!",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "To continue malicious compliance, he did say that if she didn't grant him this one ask she might as well raise the baby alone. . .",
          "id": 110,
          "comments": [
            {
              "score": 27,
              "content": "I have the feeling that she was going to end up doing that either way",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "THIS!!! ^",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 739,
      "content": "NTA, you are unmarried and I’m assuming will likely be the default parent. He doesn’t uphold any other traditional practices from your perspective until it benefits him. That’s definitely a pretty selfish trait in him. \n\nWhen the baby has the same last name as mom, it makes things a lot easier with travel, doctors, legal issues, etc. Also when most people talk about babies or bring them up, nobody is calling the baby by their first and last name 😂 \n\nEnjoy your new baby and if needed down the line if you get married to this man or someone else you can always change the last name.",
      "id": 113,
      "comments": [
        {
          "score": 140,
          "content": "Yep. Both my kids have my last name, not their dad’s. I had to step up and be the sole full time parent when he obviously wasn’t going to participate, so I had my son’s last name changed to mine after my daughter was born and I gave her my last name. They are now teenagers (17 and 15) and it’s worked out just fine. Honestly, it’s worked out better this way.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "Maybe he can take OP's last name if they get married.  Then he'd have the same name as the son.",
          "id": 115,
          "comments": [
            {
              "score": 8,
              "content": "That’ll never happen. Men like this think they’re Henry VIII and need to carry on their family line.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I gave my son his dad’s name when he was born, because that’s just what you did (he didn’t even bug me about it fwiw, it just was what I figured we would do), and my son has actually considered switching to my name now that he’s an adult because he doesn’t have a great relationship with his dad, and my parents had a bigger hand in helping to raise him anyway.  If I started again now as a single parent, I would definitely use my name; as you pointed out, it makes the logistics so much easier. I have been called Ms. {son’s last name} his entire life, and it kind of drives me nuts.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 618,
      "content": "NTA.\n\nWhy are you with this man?",
      "id": 118,
      "comments": [
        {
          "score": 343,
          "content": "I hate that I sound like every enabler - and perhaps I need to do some introspection to see if that's what I've become - but he wasn't always like this. Life's been hard for him lately and his coping strategies have led us here. I need to have a frank chat with him about how it's affecting us.",
          "id": 119,
          "comments": [
            {
              "score": 451,
              "content": "How the fuck is drinking the Red Pill kool-aid a *coping strategy???* Have some respect for yourself, girl.",
              "id": 120,
              "comments": [
                {
                  "score": 310,
                  "content": "I mean, that's how cults work. They have promising beliefs for struggling people that make the world simpler and less scary. Unfortunately, they make you worse.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 154,
                      "content": "Right. And red pilling does a lot of “It’s not your fault. It’s woke society’s fault. Women are doing this and it goes against biology” bullshit. It’s not shocking that someone would find comfort in blaming their problems on someone else.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 127,
                  "content": "That’s literally the point of any men’s rights/neonazy/bikergang/whatever cult.\n\n“You lost your masculinity because of the [others*], they stole it from you! Join us and we can give it back to you”\n\nBy it’s very nature it’s designed to be a coping strategy, because vulnerable people in need of a coping strategy is easy victims for brainwashing.\n\n\n\n*women, yews, black people, gays are favourites for this category",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Condition 1) live in a society that placed outdated expectations of your worth, and you haven't reconciled they're out of date.\n\nCondition 2) have those expectations subverted by society in some way (IE A man is suppose to be the sole provider, but the plant, mine, well, whatever closed, or they got fired for a mistake, anything really where they are the ones needing to be supported by a woman), and unable to find agency in this new role.\n\nIf above conditions work, this is basically how you lure them in.\n\nDeflect all blame away from the individual, and reassure them that they're not wrong, society is. \"its societies fault that you can't find a job, all these women and minorities taking all the jobs so you can't provide like you're suppose to\" thats the hook. \n\nThey reaffirm their beliefs. They talk about how they are going to change it. This is what soothes the persons negative feelings. \"I am not the problem, society is the problem\" and thats how they find coping in it.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That makes a *ton* of sense, thank you for breaking it down. That last sentence especially sheds new light onto why he would be acting the way he is.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Not all coping strategies are good ones. Drugs are a coping strategy. They're not a good one.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "It's the definition of a coping strategy.  \"Its not your fault you got laid off/arrestted/dumped/etc. It's all those man hating femi-nazis who have ruined the world for good strong men like you. If this was the good old days you would have a huge house, secure job,  and a wife who cooks, cleans, greets you with a drink and is never too tired to have sex with you.\"\n\nIt (in his mind) absolves him of responsibility for his failings.",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Believe it or not the political group that doesn’t actively attack and alienate men constantly might be alluring to a man who’s fallen on hard times (shocking I know)",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 89,
              "content": "I don't think you'll get anything out of that. Have an exit plan and leave. NTA",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": "Life is hard for literally everyone. That is not an excuse.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "When life's hard, people show who they truly are. \nBelieve him, when he's acting like a misogynistic ashole. He is one, he has no longer the energy nor the desire to pretend being a nice guy.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 49,
              "content": "I have relatives who are trying to figure out the logistics of disentangling from a red pilled husband. Yeah he seemed like a reasonable guy until he was just being weird and then he was a raging asshole. \n\n\nYou haven't married this guy, and your baby hasn't bonded to him. It sucks, but for your own mental and physical health you should not be with him until he's un red pilled and doesn't use \"emascualted\" as a serious complaint",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "You sound like you'd be a lot happier just being you and your baby. Enjoy motherhood and don't manage his shit. I learned that having children makes or breaks a relationship, in my personal experience.",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 45,
              "content": "He's going to abuse you. Red pilled men are abusers. They don't believe you as a woman are a PERSON. Run. Run far, file for child support and full custody now. These are the men that perform honor killings. They murder the mothers of their children.",
              "id": 134,
              "comments": [
                {
                  "score": 9,
                  "content": "I wish this was an exaggeration but it is not. More and more you see these guys legitimately being encouraged toward physical violence.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "Life **is** hard.  \n\nThis guy is showing you exactly he will default every time life gets hard.  **Listen to him.** \n\nYour man gravitates toward toxic coping mechanisms. Don't kid yourself, it is a **choice** - no one has put a gun to his head and told him adopt this hateful ideology, or else- he has chosen it willingly.  That's baked in. Sounds like it's a family trait, actually. \n\nYou should think about mama bearing up and protecting your precious child and yourself from this man's and his family's toxicity. He needs to chose now - You and his kid or his cause. It doesn't get more stark than that.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "It’s never like this in the beginning because they know that they won’t hook you if they act like that. They wait until they think they have you trapped to be who they really are because they think you are too committed or enough of a doormat to leave. As if being a single mother will be harder than dealing with a baby **and** his bullshit.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "That sounds like a good idea. Communicate with him and tell him the hard cold truth - it’s your only hope.\n\nI wish you the very best.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 388,
      "content": "All the red pillers will downvote me to hell, but IMO, you aren’t married so if it were me, my child would not have his name. Period. It is understandable that he was so overpowering in the moment that you let him believe you would put his name on the birth certificate. Especially if you were outnumbered because he brings his enmeshed family into your disagreements. Also, you are entitled to change your mind at any time for any reason. Underneath this argument is the fact that he is an AH in general, and that would motivate me to distance myself and my child from him in whichever ways I could.",
      "id": 139,
      "comments": [
        {
          "score": 112,
          "content": "She didn’t let him believe anything. They didn’t come to an agreement. If he believed anything, that’s on him, not her.",
          "id": 140,
          "comments": [
            {
              "score": 59,
              "content": "That's true.  Saying you \"understand\" is not saying you agree.  He chose to interpret it as agreement.  It was a masterful dodge that people should probably employ more often.  Not a true AH move -- it butts right up to the line close enough that depending on your perspective it can be seen as a clever move, or an AHlish move.",
              "id": 141,
              "comments": [
                {
                  "score": 14,
                  "content": "Although to be fair, when you say I understand to someone who thinks they're giving orders, it's totally understandable that they would think they were going to comply",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I’m adding it to my repertoire",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 333,
      "content": "Nta why do men get to put their names on a child when all they did was have an orgasm.  Nope!  Gone are the days when the man ruled the house and women and children were possessions. Give the baby your last name and tell him when he spends 9 months growing a child in his body and then goes through labor he can have the honor of naming the child after himself. Why are women still allowing the men in their lives to dominate them.  You care either a adult woman or you are his possession.  What will you be.  The decision is yours. ",
      "id": 144,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 292,
      "content": "NTA\n\nTraditionally, babies are given the same surname as their MOTHER. Traditionally, mothers are married and take their husbands’ names, which is why babies have their fathers’ last names. Traditionally. But you’ve already pointed out that he only wants traditions that favor him. He doesn’t want to do the work. ",
      "id": 145,
      "comments": [
        {
          "score": 30,
          "content": "THIS COMMENT RIGHT HERE!!!",
          "id": 146,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 173,
      "content": "INFO REQUEST:\n\nJust to clarify, are you still together? And if so, why...?\n\n&#x200B;\n\nI mean, you said you occupy the \"provider\" role (which I assume means \"financial provider\"), plus he's a raging misogynist. For the love of god, break it off now, before he does any more damage.\n\nAlso, NTA.",
      "id": 147,
      "comments": [
        {
          "score": 127,
          "content": "We haven't broken up.\n\n  \nI don't know why we're still together. Tbh, I guess I hadn't realised it had gotten this bad.",
          "id": 148,
          "comments": [
            {
              "score": 114,
              "content": "Get out before he gets worse and teaches your kids this stuff",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "The following link is the free pdf for a book many women have praised for saving them from a toxic relationship. Maybe something in there can help you, and by extension, your child, as well.\n\n[Why Does He Do That?](https://archive.org/download/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf)",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "If you have a son, you know what he will teaching them.",
              "id": 151,
              "comments": [
                {
                  "score": 43,
                  "content": "A daughter too. We don’t need anymore girls internalizing this mindset for themselves either",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You're a frog in a pot of water. It's coming up to a boil.\n\nYour choice now is to hop out or boil.",
              "id": 153,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 166,
      "content": "NTA\n\n\nIf he's so \"traditional\", has he proposed?  It isn't a bad thing for the entire family to have the same last name, especially in a traditional family where the parents are married and Dad is a breadwinner.  That all kinda makes sense.\n\n\nBut it's hypocritical for this guy to cry about \"tradition\" when he isn't actually taking on all the traditional responsibilities.",
      "id": 154,
      "comments": [
        {
          "score": 34,
          "content": "Right?\n\nTypically kid's have the man's last name because he already gave his name to their mom. Unmarried can go either which way.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "She said in another comment that she doesn't believe in marriage.",
          "id": 156,
          "comments": [
            {
              "score": 18,
              "content": "Well, I wouldn't believe in marriage with this guy, either. ",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}