{
  "post content": "Hey I’m 14f and I am currently on camping holiday with my family. It’s our 3rd day here and I think I kinda messed up. Maybe.\n\nSo I’m sharing a tent with my older brother 17m, nicknamed Rio. Basically last night, our parents went to hang with the other parents and neither of us wanted to go socialise with other kids, we stayed back to. It was gonna be a good night, brother and sister bonding. It was getting a bit stuffy so he went and unzipped the tent while I set up the monopoly board. We having a great night and everything was going well but of course we slowly got tired. It was like 1 am I think when we were gonna go sleep so we packed up and closed the tent since we had a mini fan to keep us cool.\n\nIt got too stuffy again so he asked me to open the net cause I was closer so I kept the mesh net part down and rolled up the windbreaker part up and went back to sleep.\n\nIt was before the time the sun started to rise ish went it got a bit cold so Rio started to use his foot to bring the windbreaker down so I just helped and put it down cause I don’t want his stank foot in my face while I was trying to sleep. Later I heard something shuffling and crunching next to me (we had our stuff on “walls” of tent). I'm a light sleeper so I woke up by turning over and my hand hit whatever was making that noise. It squeaked. It was a possum. A whole cute possum. I petted the possum talking to it, you know automatic stuff when you see something pocket sized. That woke Rio up and his first reaction wasn't 'aww the possum is so cute' it was 'MY PHONE!' The possum ate the peach I was saving and the juice kinda got all over his phone. There was a hole in the mesh net part and since the wind breaker part was never zipped so I guess that's how the pocket sized furball got in.\n\nNow he's mad at me for not zipping up the tent and getting fruit juice into the changing port bit and its all sticky and it's not charging properly. He's getting payback by hiding my canoe oar that I painted  myself HTTYD theme so now I'm sitting on the grass, itching an ant bite. My parents told both us that we should've zipped up our bags.\n\nAm I really the a-hole?  Also I'm letting him use my phone just to be nice and I'm using my Ipad.\n\nupdate: I talked him when came back and said I was sorry and that if he needed anything he could use my things. He was nice about it and told me where he hid my oar so I can go canoeing now!! He said next time he'd just get up and close the windbreaker. Only problem now is that the charger is sticky and ew. Also thanks, yall are so sweet.\n\nedit: its my first time outdoor camping and ill take note to have food in my tent (: and yes I do live in australia and have encountered possums before, they are sucker for fruits \n\nand I think I'll have more to post on reddit cause i know it's gonna be a long one more week",
  "id": 1,
  "comments": [
    {
      "score": 14,
      "content": "NAH  \n\nIt was an accident.  It could easily have been your brother who left the fly open\n\nBut it's poor, and dangerous, camping protocol to leave *ANY* food in your tent.   It could have been a bear smelling that delicious peach.   \n\nEven things like toothpaste need to be in a locker in the car if you're in bear country.    \n\nIf you were not in bear country it's still an object lesson for you to keep all food in the cooler in the vehicle.  \n\n\n\nAnd *please* don't pet wild animals.   If the opossum was that small then its mother was surely nearby and they are very protective of their little ones.",
      "id": 2,
      "comments": [
        {
          "score": 7,
          "content": "Thanks for the tip, I normally keep snacks in the eat throughout the night and I would rather not be mauled by an animal.   \nFor some reason the animals are very used to humans around, like last night when we were having a bbq, a kangaroo came out of nowhere and stole the lettuce.",
          "id": 3,
          "comments": [
            {
              "score": 4,
              "content": "Nice things about Possums is they don't carry rabbies and they eat tons of ticks.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Aha!   \n\nI apologize for assuming.   \n\nI think if a kangaroo wanted my lettce I would let it have it.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You are nta for not zipping up the rain fly. I sleep with it open all the time. Yta for having food in the tent. Be glad it wasn’t a bear!! Although, your parents should have taught you that, so it could be on them too technically",
              "id": 6,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "even if they're used to humans they still should be left alone especially baby animals",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "Hahaha. Not really an AH situation, but you’d be the one who gets made fun of for eternity",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "YTA for having food in the tent.  Never have any food in the tent.  Nothing good  comes from that.",
      "id": 9,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "The possum came in your tent because you had ripe fruit in there, and it could smell it. \n\nThe problem isn't you not zipping up the tent fly, the problem is you having fragrant delicious food loose in your tent to attract anything that wants to eat it. You need to practice better hygiene. \n\nNAH",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "Soft YTA - seems you've some things to learn! But, you're young; so that's ok. Above all - do NOT acclimate a wild animal to humans! That tiny furry dude might die young because it thought all humans were kind. And, your brother is right to feel frustrated at his damaged item.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "This must have been the plot of some 70s-80s sitcom episode at some point.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA, but camping 101 is “don’t have food in your tent.” You don’t want food *smells* in your tent if you can help it.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "lol, NTA. Love that you got to pet a cute possum and his phone will be fine. Isn’t camping usually device free anyways",
      "id": 14,
      "comments": [
        {
          "score": 0,
          "content": "It was supposed to be device free but we ended up going later then planned and brother has to study for his last year of highschool and I'm studying for my senior year of highschool. \n\nI wiped his phone down but I guess the phone is in shock lol",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH That was delightful. Glad you got it all sorted and have a wonderful time.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "You are lucky it was a Possum and not a bear. Never have food in your tent as now know that it draws wildlife. NTA",
      "id": 17,
      "comments": [],
      "relation": "Support"
    }
  ]
}