{
  "post content": "So I’ll start by saying my uncle is happily engaged now to his financée. \n\nToday I’m staying at my girlfriends families house for Christmas Eve. This morning I was watching a movie with her family while my girlfriend was at work. I haven’t always been able to bond with her family like this so I was quite excited to be hanging out with them without my girlfriend needing to be around. \n\nThe rest of my family is staying at my grandparents house which includes my mother, step dad, uncle, uncles now financée, grandma and grandpa. \n\nHalfway through the movie I get a FaceTime call from my uncle. Which is kind of odd but I didn’t wanna be rude and answer a FaceTime call in the middle of the movie we were enjoying. So I ignore it and he FaceTimes me again. At this point I’m thinking oh it’s probably some Christmas gag he’s put together, so I text him saying “what’s up?” He just FaceTimes me again. So I text my mother who’s also there saying “what’s going on? I don’t wanna be rude and interrupt the movie” Nobody would tell me what’s going on, which made me believe it wasn’t some sort of emergency just something silly that they wanted to fill me in on. If it was an emergency I know my mom would call me to tell me so. \n\nAt this point my uncle has tried FaceTiming me 5 times and I’m getting annoyed so I texted my mother saying “I’ll call you later I’m turning my phone off”. So I turn my phone on airplane mode. \n\n About half an hour later and the movie being done I got up to call my mom. And she yelled at me for being selfish and how I ruined such a great thing. And again nobody has actually told me what is going and and all I know is that I’ve ruined some sort of gag that my uncle put together. \n\nShortly after my uncle called me to tell me he’s now engaged to his partner. And he was trying to FaceTime me so I could watch the proposal. \n\nI can accept that I could have stepped out of the room to take the call. But I was happily enjoying a movie and some bonding time with my girlfriends family. Just sucks that I was given absolutely no heads up as to what was going on. \n\nIt’s shitty all around I can accept that, I just now feel like a mega asshole. Most of the family texted me saying how selfish I was for not picking up the phone and that I made it all about me. \n\n\n\nTLDR: My uncle was trying to FaceTime me so I could watch him propose to his girlfriend while I was missing the family get together. Me not knowing that anything was going on told him I’d call him later.",
  "id": 1,
  "comments": [
    {
      "score": 2327,
      "content": "i find this to be a very difficult judgement.\n\nsomeone trying to contact you 5 times should be a strong signal that it's important!  anyone who does that for something NOT important is an ass\n\nbut on the other hand, you were busy and specifically asked him what was going on in a text.  he should have texted \"this is important, please accept it\"\n\nI think this is an ESH.  but I don't have strong arguments against N.A.H, Y.T.A, or N.T.A.\n\nto be clear, no one was really asshole-tier here.  but i do find both parties to be marginally wrong, which is what \"you're the ass\" means in this forum.\n\nreally curious to see what other people think.",
      "id": 2,
      "comments": [
        {
          "score": 1052,
          "content": "Why didn’t the uncle just communicate by text with everyone involved just before or an hour before and say,\n\n “keep the secret\n\nand answer FaceTime\n\n I’m asking Melissa \n\nTo forever be mine”\n\nWithout the heads up I would have done the exact same thing if I was in your shoes. NAH",
          "id": 3,
          "comments": [
            {
              "score": 801,
              "content": "No shit. I don't think OP was an asshole in this case. Fucking plan that shit or shoot a quick text between the five missed phone calls lol. It clearly wasn't important enough to plan ahead for...\n\nAlso, honestly, who FaceTimes a proposal? Lol.",
              "id": 4,
              "comments": [
                {
                  "score": 279,
                  "content": "Yes, I don't get the performance proposals either.  That said, if someone wants others to witness it, they should make a plan to face time or whatever at a specific time.  Not just assume others can drop everything for them.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Someone who just cares about people seeing it happen",
                  "id": 6,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Why do they care, though? Isn't a proposal an intimate moment between two people?",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 147,
              "content": "I can see both sides. I don't know why it was so difficult for OP's family to just say, \"Hey Uncle is going to propose! Get on the phone!\" On the flip side, if someone called me 5 times in a row that's a pretty clear indication there is something important going on and I should pick up. And if turns out to be unimportant, then I'd tell them directly, \"Don't blow up my phone for no reason. I'm turning it off now.\"",
              "id": 8,
              "comments": [
                {
                  "score": 147,
                  "content": "[deleted]",
                  "id": 9,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Ah yeah, if they have a track record of doing this then I can easily see why OP ignored the calls after not getting a reply. For our family, except my dumbass cousin, calls are for time-sensitive things and texts are for everything else.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "This times a million.  Repeated calls means an AH more often than it means an emergency, and it seems like that goes triple for this uncle.  NTA - not even close.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I've got a relative like that too, only it's a male relative, otherwise I'd wonder if we were related.  His record was 14 calls/video requests in a row.  I've learned to use the block feature.  I feel badly about it, because I love this person dearly, but it's the only way to get any peace.  He'd call at 11 pm at night.  And unless you want to be rude and hang up, it's a half hour to get him off of the phone, minimum.    I get up at 5:30 in the morning.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "My 2 year old leared how to whatsapp video call. He loves the big red button, so will end all my calls early. Whenever we call his aunt or grandma we called 5 times before they even pick up, because he loves to hang up. We're blowing up their phone just to say good morning.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 59,
                  "content": "If they called, sure, but if they’re FaceTiming I’m not going to assume it’s important",
                  "id": 14,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Yea no one ever tried to FaceTime me because it was an emergency but they also HAD to show me.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Five phone calls, yes. Five FaceTimes? Doesn’t seem like an emergency, seems more like dude got drunk and wanted to tell him the funniest new joke.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "I have a relative who blows up my phone.  He doesn't believe in leaving a message so he'll keep calling you back repeatedly.  Nor does he seem to understand the concept of \"is this a good time to talk?\"\n\nI love this person dearly, but I've had to block his number because of this.  I once got 14 calls/video chat requests in a row before I turned off my phone.\n\nThe problem with turning off your phone is that nobody else can reach you.  And you can't use the phone for photos, etc.  That's why I learned how to use the block feature.\n\nAnd while I think a proposal is exciting, it's not an emergency.  The uncle should have planned ahead to Face time with OP or at least texted, I have big news, please answer.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "My dad, who usually never uses a phone once rang me 20ish times while I was at work.\nWhen I finished work and saw all the missed calls I panicked thinking something was seriously wrong. \nI rang him back for him to just tell me he wanted me to bring him pizza on my way home from work....",
                  "id": 18,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Lol that’s such a dad thing to do",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Without a heads up Id have done it regardless of what I’m doing.\n\nI’m not picking up a phone call because I don’t like talking in a phone. And a phone call that requires me to put on my pants? Oh hell no. With extra hell.\n\n(I know op had pants on in this case, it’s the general idea)",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "My proposal story is a good reason why you want to limit who all knows you're going to propose before the fact:\n\nAs we're leaving her parents house where we're living at the time, her neighbor (who's been a close family friend for well over 20 years) comes over and congratulates me before we even get in the car to go to dinner, right in front of her. So we have dinner where she already has more than a strong sneaky suspicion and as we're walking around a busy downtown entertainment district, I see about half the friends that we invited to celebrate with us afterwards walking towards the bar we're meeting up at after the question, even after I had told them all the times to be where and the route we were gonna take for the night. One person even had to run across the middle of a busy ass street to avoid running directly into us.\n\nPoint is: I sympathize with the uncle and OP is not really an asshole for it, but it was certainly impolite to not at least answer one of the facetimes to see what was clearly very important",
              "id": 21,
              "comments": [
                {
                  "score": 26,
                  "content": "I get it but OP texted them several times, they couldn't have sent a text?  It had to be FaceTime?",
                  "id": 22,
                  "comments": [
                    {
                      "score": -6,
                      "content": "Hard to experience the moment of someone proposing through text, and certainly facetiming it is the best way but its certainly the best option considering the circumstances and I'm sure that's what they were thinking",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "[deleted]",
                  "id": 24,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Thanks, she enjoyed it and I definitely tried to plan it with the idea in mind \"someone has a high probability of accidentally ruining part of the surprise\" so there was plenty that still surprised her",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "would have been safe for sure, definitely eliminated a lot of confusion.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Love the poem! But even \"this is important to me, please aswer\" would have done fine.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And it's a cute rhyme. I think ESH but a very soft ESH on OP's part.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 124,
          "content": "I appreciate that you’re seeing all sides of the parties here. Just an overall shitty situation from every angle.",
          "id": 29,
          "comments": [
            {
              "score": 89,
              "content": "Look man you tried to text them to ask what's going on.  They could've easily texted you to explain the situation.  Why is it so important your entire family saw this anyway?  To make sure she felt so pressured she couldn't say no?",
              "id": 30,
              "comments": [
                {
                  "score": 11,
                  "content": "Ya know, some people have healthy family relationships and want to include relatives in a big event - with no kind of \"force her to say yes\" motivations.\n\nI think the only assholes in OPs case are those giving OP shit for not picking up. And honestly if it was so important OP witness the event, Uncle should have waited until he was present.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Is one thing to include the family, but to argue that the proposal is ruined because one of them couldn't FaceTime? That's what makes OP NTA.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "That's fair, I usually assume that's something people want to do in private.  Personally I'd be uncomfortable for someone to propose to me in front of my family unless we'd already agreed we wanted to get married but to each their own.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Could you clarify what makes OP an asshole here? I think you are saying he should have answered the facetimes at some point, but why was texting back to the uncle and texting his mom to see what is up not enough?",
          "id": 34,
          "comments": [
            {
              "score": -19,
              "content": "facetiming 5 times sounds like an emergency.  and they ignored it. not 100% convinced i'm right, but i'm leaning in that direction.",
              "id": 35,
              "comments": [
                {
                  "score": 71,
                  "content": "But it wasn’t an emergency and nothing was stopping them from replying to his texts.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 48,
                      "content": "yeah, this. A proposal isn't an emergency.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Problem is that it isn't an emergency.  It's not \"holy fuck, I sliced off a finger and am bleeding out\" or \"your mom is unconscious\" it was \"hurr, I'm putting on a big show and need my nephew to see me proposal. Yay!\"\n\nKid was right to not pick up.  Well scouted.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "People call for emergencies. Not FaceTime.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "I'd argue that the mother is a bonafide asshole in this case, and everyone else is marginally wrong. Yelling at her son and telling him he ruined a proposal? Seems assholish to me.",
          "id": 40,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "I agree with this. No one is really an \\*asshole\\* but everyone does kind of suck for the lack of communication.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Yeah, I’m in the same boat as you. I’m annoyed with everyone in this situation because they’re kinda all idiots and let something that shouldn’t have been a problem turn into a problem.\n\nOP could have stepped out for a second and said, “excuse me, let me see what he wants real quick.”\n\nThe uncle and OP’s mom obviously could have texted. They all failed to employ basic problem-solving skills.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I mean, they could so easily send a text. It's rude to answer a FaceTime when you're spending time with others. \n\nI think OP is NTA.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Except for the fact that what people consider an emergency these days often isn't. An emergency is if someone is dead, dying, or bleeding in which case I would hope people would have the common sense to not frigging face time.",
          "id": 44,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": ">someone trying to contact you 5 times should be a strong signal that it's important! \n\nIt wasn't thought. He was proposing. Is OP supposed to fuck his uncle's fiancée when uncle is out of town, or why the hell was it important for him to witness the proposal? Does he have a say in whether they're getting married or not? \n\nIf someone calls you from the landline, yes, answer the phone, might be important. If they are insisting on a video call and ignoring your texts, and you know there are other people around them so it's not like their hands are literally on fire and they physically can't text you back, it's clearly not particularly important. \n\nExpecting people to take your unscheduled video calls while they're hanging out with other people is entitled and rude. \n\nNTA, OP. Your uncle sounds like a dick.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "No see, uncle could have TOLD him. If you want to be able to demand I talk to you and hop up to answer each and every call, you can pay my phone bill and pay me to be on call. Otherwise, no. If it’s an actual emergency, OPs phone would have had people actually fucking texting him or calling on the phone to tell him to get to the hospital. FaceTime doesn’t lend itself to emergency calls the way multiple phone calls would have. NTA, OP. Watching an uncle propose is not something people can demand of you without prior approval. He could have given you a heads up literally any time before that but decided not to.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 994,
      "content": "NTA. You were given no warning, no reason and no text. All of which could’ve been easy for anyone to tell you, especially since you texted first.",
      "id": 47,
      "comments": [
        {
          "score": 595,
          "content": "I don't understand why the uncle didn't just text back with \"there's something you need to see\" or \"this is important\". Or even \"I'm proposing to \"girlfriend's name\". OP isn't the one being proposed to, there's no reason it had to be a surprise.",
          "id": 48,
          "comments": [
            {
              "score": 580,
              "content": "Because my uncle is semi controlling and needs theatrics for everything he does. I just wish he could have said I’m about to propose pick up",
              "id": 49,
              "comments": [
                {
                  "score": 461,
                  "content": "Well then he can just fuck right off then.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 210,
                      "content": "I wouldn’t say it to that level but ya I’m little disappointed.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 217,
                  "content": "Let's be real, he's probably enjoying the drama of you not answering your phone then. Your family can get the hell over it.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Two stories for the price of one!",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "Definitely NTA then.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Honestly, it sucks you missed the proposal, but I'm glad he got a lesson in consequences. Whether he heeds it or not is tbd, but he needs to realize the effect of unrealistic, uncommunicated expectations.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "This is why I am leaning towards NTA tbh. The repeated FaceTimes were performative, proposals are for the couple in any event. If he wanted everyone to be involved he needs to give you a heads up. You could have been doing anything at that time including being at church or some other “genuinely can’t answer the phone right now” situations.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This should have been in the OP, NTA",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "If they could FaceTime they could record it. Fuck that.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "MAyBe InCLudE ThaT iN yOUr PoST",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Exactly",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -6,
              "content": "Info to understand after 5 calls op couldn’t figure out it might be important",
              "id": 61,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 452,
      "content": "ESH\n\nAfter 5 times (honestly before 5 times) you should take the call.  That being said, him responding to your text \"Just answer the call, it's important\" wouldn't have been too much for him to do, it wouldn't have ruined his plans or anything.",
      "id": 62,
      "comments": [
        {
          "score": 225,
          "content": "I’m very accepting of the ESH vote. I obviously wish I would have picked up. But he knew what he was about to do. And telling me he was about to do that wouldn’t have ruined a surprise on his behalf.",
          "id": 63,
          "comments": [
            {
              "score": 49,
              "content": "Right, that's why he's included.  If trying to facetime didn't \"ruin the surprise\" then texting wouldn't have either.",
              "id": 64,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -70,
              "content": "[deleted]",
              "id": 65,
              "comments": [
                {
                  "score": 64,
                  "content": "N-no ?? I've been called like 5 times in a row only to pick up and have someone ask me if I've seen a comb laying around. If there's an emergency they text like a normal person.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 7,
                      "content": "> If there's an emergency they text like a normal person.\n\nWoah, this is totally backwards in my experience. I text for things that aren't time sensitive. Call for emergencies and urgent matters. If they don't pick up, I text and call again. \n\nSome people have a shitty definition of an emergency. But unless they've pulled that shit multiple times, I'll usually pick up.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Nah fuck that.  I am not available on demand to everyone who knows my number.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Great, I'll give your number to a relative who hates to leave a message and will keep calling, even hours after you're supposed to be asleep.  His record so far is 14 calls/video requests in a row.  It's never an emergency, he'll just keep calling because he wants to talk.",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I have my phone for my convenience, not someone else’s. I pick up on my schedule, and if it’s an emergency they could have replied to the text telling OP that it’s important.",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Not unless it’s one of my grandparents. They don’t quite *get* texting and I can absolutely see them not thinking of it in an emergency. But if I’m otherwise busy (like OP was) and someone just keeps calling but refuses to respond to me texting what’s up? They can leave a voicemail. I have my phone on me but I am not obligated to answer it.",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "No. I have other things to do. Calling more times isn't going to make me call back any faster.",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 28,
          "content": "Nobody FaceTimes in an emergency. They call like a normal person, so 5 FaceTimes is just obnoxious.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "No, you should not continue calling 5 times if you get a text asking whats up you should answer the text and not continue calling, op could aswell be sitting on the toilet having a massive diarhea at that moment... I dont think that you are obligated to answer just because someone is calling you non stop, even more so when u have already sent a text asking whats going on...",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 441,
      "content": "NTA. Does your uncle think that you just sit around all day poised in wait should he beckon?  No. You have your own life. If he needed you to be available at a certain time, he should ask in advance and not just assume you’re going to drop everything immediately. \n\nAlso if his proposal was “ruined” because  he couldn’t FaceTime his nephew, I have to question his priorities. Weird AF that he even wanted to do that.",
      "id": 75,
      "comments": [
        {
          "score": 132,
          "content": "It wasn’t weird because normally I’m with the family on Christmas Eve. I’m spending it at my girlfriends house this year. I actually appreciate he was trying to keep me involved. \n\nBut I’m just disappointed that I was expecting to drop whatever exactly I was doing to accept his call without question. Even when I tried to say what’s up? So I agree with the first statement.",
          "id": 76,
          "comments": [
            {
              "score": 132,
              "content": "Ok, but the proposal was “ruined” over it? If that’s what is important to him, he’s a dumbass for not coordinating better, and he has some really fucked up priorities. I mean, getting the woman I love to say yes would be what would matter to me. Not so much whether my nephew could see it on FaceTime. \n\nAgain, if somehow his need to include his nephew in his proposal is so devastating, he really should have thought it through better.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "[deleted]",
              "id": 78,
              "comments": [
                {
                  "score": 52,
                  "content": "I’ll admit this bit was selfish but I just finished working 3 days in a row of 13 hour shifts. I was ready to have a chill morning. Tomorrow being Christmas Day I’m ready for the madness",
                  "id": 79,
                  "comments": [
                    {
                      "score": 10,
                      "content": "It's not selfish to take care of yourself, especially with your family the way they are!",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "How is it selfish to have your own life and not just snap to it like a trained dog because your uncle beckons?  It's not even your mom, dad or grandparent.  Uncle is kind of a low rent relative, but he apparently thinks he is way more important than he is.  You shouldn't be shy about telling him that.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "To the es.h votes, what if you had been in the shower, or toilet, helping cook... All of which would mean you can't answer. You texted put to several people and not one responded. You were in an important family moment trying to for once feel welcome with her family. And nobody gave a reason to answer. I would vote es.h if you had made no effort to reply, even then you don't have to when doing something, but you did reach out. Feels like they've put you in this position on purpose. Mum could've said answer, uncle could've told you. Everyone calling you selfish makes no sense",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "> But I’m just disappointed that I was expecting to drop whatever exactly I was doing to accept his call without question\n\nI think this statement and attitude just sums up how millennials see phone calls vs previous generations. In an era where we have text-based instantaneous messaging, where you can respond at your own pace (be that immediately or at a later point, or even not at all), a phone call is an interruption. It's not a positive connection, it is a demand to be present and available then and there, for who knows how long. \n\nHonestly, I believe your uncle is TA because who the fuck needs an audience to propose? Was an audience of 4 not enough? Why did he need to include you in the moment vs just telling you the good news afterwards? Why couldn't he have said, \"hey, can you be available for a call at 11am?\". But I think another factor might be the difference in phone attitude between generations. Maybe they thought you would see a phone call from your family on Christmas as something you'd be excited to receive, not an interruption to the day you were having.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "It also seems a bit weird that he was proposing on such a major holiday? Maybe I’m reading too much into this but maybe he was trying to make sure that he was the centre of everybody’s attention. There are so many other days in a year.",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -3,
              "content": "But it was a phone call, dude, not a flight. Just answer the phone. Idk man, anyone calls me twice I fucking answer the phone. It would have cost you literally nothing to step out of the room for a minute.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "I also think that it is weird to insist on other people \"being there\" for a proposal.\n\nIt's not really anyone else's business other than the two people who are (hopefully) going to get married.\n\nDoing it in front of people **at all** is a bit unnecessary. Calling in people who are not there is just attention-seeking.",
          "id": 86,
          "comments": [
            {
              "score": 1,
              "content": "Amen.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -21,
              "content": "He was trying to include him in a special moment...not attention seeking",
              "id": 88,
              "comments": [
                {
                  "score": 27,
                  "content": "Your engagement is not that special for anyone except you and the person you're getting engaged to.",
                  "id": 89,
                  "comments": [
                    {
                      "score": -11,
                      "content": "I find that really hard to believe. My family and friends were incredibly excited when I announced my engagement. And my SO's friend was particularly excited to get to be there for it (he kept texting me to ask when he could post on social media!). An engagement doesn't mean the world stops, sure, but good news like that is usually a joyful thing for the whole family.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -14,
                      "content": "Says you about yours may be. Not everyone feels that way",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "If it were that goddamn special, he should have put some thought into coordinating.  \n\nThere are a zillion reasons why someone may not have their phone on them, such as they're in the bathroom laying down a brick, taking a nap, or just because they \\*gasp\\* aren't tethered to their phones 24/7 and may want to interact with people and events around them.  So, if it were really, truly important and this uncle wasn't just being a diva, he would have said \"hey around 11:30, I need you to watch your phone because....\"\n\nAbsent that, unless you're EMT, fireman, or other first responder, you are not obligated to watch your phone like a hawk and take every call.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I never said he was, but he literally told us what he was doing at the time of the call.",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "> Also if his proposal was “ruined” because he couldn’t FaceTime his nephew, I have to question his priorities. Weird AF that he even wanted to do that.\n\nI had no idea proposals were high stakes for anyone who isn't the couple until today.\n\nNTA",
          "id": 94,
          "comments": [
            {
              "score": 2,
              "content": "I can definitely agree that a proposal is ruined if the person being proposed too doesn't pick up. But that would be a weird situation too.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I wish I could give you Gold",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 136,
      "content": "[deleted]",
      "id": 97,
      "comments": [
        {
          "score": 14,
          "content": "100% this. Just because it's your happy moment doesn't mean it's mine, or anyone else's. And unless you are 100% sure your partner is OK with it being shared, just don't.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 92,
      "content": " NTA. I’ve been accidentally facetimed more times than i can count. No one facetimes for an emergency. I would have assumed it was a mistake since there wasn’t a response to the text. He should have let you know in advance that he expected you to participate in his proposal.",
      "id": 99,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 72,
      "content": "NTA. They can’t expect you to respond perfectly to a situation when you have no idea what is happening. To say that you ruined it is a joke because nobody can ruin a proposal by not seeing it. (Unless I guess they’re being proposed to)",
      "id": 100,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 66,
      "content": "NTA.\n\nYou asked several times what was going and they didn't reply. They can't reasonably accuse you of being selfish when they were the ones withdrawing information that you were asking for.\n\nIf you would've known what was going on, you would've picked up. They suck for ignoring that fact.",
      "id": 101,
      "comments": [
        {
          "score": 14,
          "content": "Thanks for your opinion. Kinda sucks here",
          "id": 102,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 57,
      "content": "NTA. He could just as easily proposed and had video so you could see later. This sounds like a power play because you had the “nerve” to be somewhere else. \n\nPersonally I think you played this right.",
      "id": 103,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 35,
      "content": " Nta.     You texted what’s up.    They could have said.   I agree it’s rude in someone else’s house to pause a movie.",
      "id": 104,
      "comments": [],
      "relation": "Support"
    }
  ]
}