{
  "post content": "So this happened yesterday and I still feel pretty bad about it so I wanted to ask Reddit’s opinion. I (25F) went with a friend to watch the new 007 movie at a pretty popular theatre. We booked our seats in advance via online, and our seats were M10 and M11, towards the back in the middle. We got there 10mins before the movie started, and saw that there was a couple (20s?MF) sitting in our seats. I asked if the seats they were sitting were  M10/M11, and they might be sitting in our seats. The guy in the couple said this was N10/N11. My friend and I were confused, so we asked the row in front of us to see what row that was. They said it was L. So if we go by the alphabet (and the row letter was also on the carpet) the couple were not sitting in their seats.\n\nI asked the couple again nicely that they might be sitting in the wrong seat, and the guy started to get really frustrated saying that “these are just seats” and that they even asked a worker here and mentioned that this was N10/N11. This is where I might’ve been the a-hole. My friend said let’s grab a random seat, but I went outside the theatre and grabbed a worker and explained the situation. The worker came up to the row with me but mentioned that “there were still empty seats”. I replied to him that people were still coming in so I didn’t want to take someone else’s spot if the seats the couple were sitting was actually our spot. The couple saw us bringing a worker in and the guy came up to us and started to talk bad about me in front of the worker and how I’m blowing it out of proportion and said crude things about me. The worker went out and got another person (I assume the manager) to verify the seats. At this point the movie didn’t start yet but people that overheard us was also saying that these are just movie seats and that I should just sit anywhere else.\n\nTurns out the couple was wrong and those were our seats. The guy started to yell that he wanted a refund because the N10/N11 seats are not in the middle (any row after M only had seats on the left and right side, and empty in the middle for accessibility reasons). He said that I ruined his “f-ing birthday” and I told him ok, and told the worker to give us a seat that’s not taken and we’ll sit somewhere else and he said no, it’s too late and I ruined his birthday night. He stormed off and his girlfriend walked out and cursed at me that I ruined the guy’s birthday. The movie began shortly after so we didn’t cause a scene during. However, I feel bad for things to escalate so much, but I didn’t know where else to sit as it could’ve been reserved. Plus, it was his birthday. Should I have just let the couple have my seats? AITA?",
  "id": 1,
  "comments": [
    {
      "score": 9049,
      "content": "NTA. They ruined their own day. They bought different seats, they refused to move when the actual ticket-holder showed up. They decided to dig-in and react with anger… you simply asked for what you paid.",
      "id": 2,
      "comments": [
        {
          "score": 3666,
          "content": "And that worker sucks too, he told them to sit in other seats because he wanted to avoid the situation. There are people coming into the theater all the way up until the movie officially starts at so they most likely would have taken another person's seat causing a bigger mess",
          "id": 3,
          "comments": [
            {
              "score": 1353,
              "content": "Yeah. In a place with saved seating and an event that hasn’t started or just starting, you can’t just grab any seat because yes people might show up and you end up moving several times and missing your favorite song because the usher brought you to the wrong place(s). Oh, was that just me? Anyways, yeah it seems like no big deal, it’s just seats. But that only applies when seats are not assigned. It sounds like they just wanted better seats and were being jerks.\n\nNTA",
              "id": 4,
              "comments": [
                {
                  "score": 474,
                  "content": "At least where I live they still do covid seating so everybody has to sit in their assigned seats no way around it not the asshole",
                  "id": 5,
                  "comments": [
                    {
                      "score": 119,
                      "content": "Ive had movies with covid seating only to come in and ppl decide to sit wherever. Putting us next to them as they sat there without masks. We just moved a row bak and if someone came to those seats we were gonna get a person.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 388,
              "content": "It’s ridiculous because then it becomes a game of musical chairs.\n\nAt the Wonder Woman movie, I had a woman refusing to get out of my seat because someone was sitting in hers, that I should just find another seat.  I told her to get her ass up and make him move.  Then waited for my hubby to bring an usher to boot her.\n\nIf they aren’t going to enforce assigned seating, why have it?",
              "id": 7,
              "comments": [
                {
                  "score": 113,
                  "content": "You should have the right to your seats since you paid for it. Smh, the nerve of some people.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": ">If they aren’t going to enforce assigned seating, why have it?\n\nExactly. I used to work in a cinema and part of my job was handling folks in the wrong seats. So many times folks would cuss me out etc. and then scream about getting a refund after their movie.  Thing was you just showed me your tickets which is how I know you were in the wrong seats. \n\nas soon as I’m out of the room it’s \n\n“ushers to box”\n\n”box here”\n\n”we have a code brown theater 6 seats C 6 and 7 for the 7pm movie. Please confirm”\n\n”copy that’s a code brown theater 6 seats C 6 and 7, 7pm. Please confirm code 1 or 2”\n\n”code 1”\n\n”confirming code 1”\n\n”confirming code 1”—\n\nyes we had so many bad customers we had a code to warn the box office about the ones that might try to play victim. Code brown was our word for “shit customer” and code 1 was seat hoppers (2 was talkers or other forms of disturbance)",
                  "id": 9,
                  "comments": [
                    {
                      "score": 18,
                      "content": "every cinema should have that coding system.   \n\n\nNo refunds for those people! If you want to be a dick expect to be handled like one!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Did they at least boot the guy out of her seat? I'm not saying what she did was right; but, a lot of women don't want to start shit with some strange man especially if they are alone.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 69,
                      "content": "No, she was arguing and refusing to leave so they asked her to step outside to discuss it while the movie began.  Every time people came in the doors (it was still credits) we heard the “SCREEEEEEE” of this lady.  It eventually stopped, so I assume she was booted.\n\nDumbass.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I once got a parking ticket AT MY OWN APARTMENT because someone parked in my spot, so I parked in a different spot and that person called the cops and got me ticketed.\n\nFrom then on, any time a car was in my spot, I was on the phone with the landlord.",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "It's all fine until someone shows up and the only seats free are right at the front, they demand the seats they actually booked and then the whole house of cards needs unwinding.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Exactly. I tried to do the “nice” thing once and just sit somewhere else because I thought the theater would be pretty empty on a Tuesday matinee. Yeah, it ended up causing a big scene in the middle of the movie. Definitely NTA.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "The worker sucks the most here.  The birthday dude and his gf are miserable people who are miserable everywhere they go but the worker was in the position to squash this quickly but instead turns on OP.  NTA OP",
              "id": 16,
              "comments": [
                {
                  "score": 3,
                  "content": "True, but these workers tend to be teens earning minimum wage and simply aren't invested enough to give a shit. Hard to rely too much on them to stand up for you.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "yeah i’m a manager at a movie theatre and if one of my staff members did this i’d be pissed, it just causes unnecessary chaos to be apathetic",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Indeed. By not removing them from these seats immediately, he basically told everyone that you can sit wherever you feel like because nobody will do anything about it even if the other party politely complains.\n\nThese are the kind of things that aren't very important, so people don't care too much. Which means if you don't enforce the rules, eventually everyone will ignore the rules and then it's too late to ask people not to break them.",
              "id": 19,
              "comments": [
                {
                  "score": 3,
                  "content": "but it's already broken in the US for sure.\n\nthat's why people think it's just fine to sit wherever they want. \n\nCome to Germany...we know how to follow the rules without being reminded ;)\n\n(I am american so I know the difference on this one first hand)",
                  "id": 20,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Oh how I miss Germany... (Also American, only visited Germany for 3 weeks after taking classes for 3 years, but envying you right now haha)",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "I ain't gonna be mad at a minimum wage customer service worker employed during Covid trying to avoid a conflict.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 561,
          "content": "AH: They’re all just movie seats, they’re all the same\n\nOP: Okay, then you don’t mind sitting in the ones on your ticket, right?\n\nAH: Shut up",
          "id": 23,
          "comments": [
            {
              "score": 54,
              "content": "NTA Yet somehow the people saying this are almost always the ones who are occupying the back/middle seats of the theatre..  if a cinema specifies seating these will almost always be the first to go so they are just banking on people not standing up for themselves. This happened to me too, though it was an emptier movie theatre - but I booked online and chose those specific seats so I have the right to demand they get up on out of them",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "THIS ^ \n\n“It’s just movie seats, relax.”\n\nRight… so that means you can move them, right? Because it’s just movie seats.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 164,
          "content": "Likely they waited until the last minute to get their tickets and couldn't get seats where they wanted to.  They figured they would just do what they did.  They counted on the actual seat holders to just roll over and let them have them.",
          "id": 26,
          "comments": [
            {
              "score": 41,
              "content": "When it got to the bit where the rows after M are split in the middle, I was like “ah, so the only seats they could get weren’t actually next to each other and they just figured they’d bully someone else out of their seats.”",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "And was there any PROOF that it was his birthday?\n\nNTA",
          "id": 28,
          "comments": [
            {
              "score": 177,
              "content": "Who gives a fuck if it’s his birthday?",
              "id": 29,
              "comments": [
                {
                  "score": 80,
                  "content": "It sounds like a personal problem.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 14,
                      "content": "This made me laugh",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "Waaaah, his birthday was wuined! What was he, five?",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "It probably wasn't.",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "i would just say \"and my mom died today what's your point?\"",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Usually on my birthday, I choose not to be an AH.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "speaking for birthdays and fucks, there was the very awkward time that we had to remove a couple for having sex during the movie.",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 59,
              "content": "I would have said: \n \n#Happy birthday to the ground!\n \ncuz that's where you sittin'",
              "id": 37,
              "comments": [
                {
                  "score": 17,
                  "content": "I threw his popcorn there too! Welcome to the real world, jackass!",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "And don’t be so positive it really was his birthday. And if it was, it wasn’t his 10th. Hard to imagine an adult using that excuse to get his way. .  \n\nNTA",
          "id": 39,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "NTA. Everyone in here stinks except you guys. The couple were in the wrong and felt entitled to your seats. The workers should have handled it better. OP did everything just fine.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "NTA. Where I am cinemas are reduced seating capacity. If I book two seats, the two seats left and right of our booking are locked and can't be booked by anyone, and the row in front and behind, and one seat diagonal are also locked. It's all for social distancing. \n\nIf someone wasn't in their correct seats, it affects everyone in the theatre, someone doesn't get their social distance, or I have seen a guy move 4 times before a.kovie started as they booked the front row, didn't want to sit there and kept inconveniencing everyone else(moving from their seats, taking another, moving from that, asking others to move or let them pass by etc..) \n\nYou book a seat, you sit in that seat, end of story. That's what the entire booking system is about. You can only pick your seat without issue, if it's free seating/general audience with no assigned seating. Even then, don't sit in the disabled spots or their assistants/carers spots. Recliners, premier seating, VIP areas etc... Are reserved unless you buy it, so don't be surprised if you're moved. \n\nHe chose his own hill to die on, then shot himself, and complained while dying. If he didn't like the seats he booked, and he was so happy to walk out without seeing the movie, he should have just booked other seats, another showing or another day.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "And if it are \"just seats\" why can't he move his ass and take other seats? They are just seats! You bought exactly this seats, so you have the right to sit there. And i bet he didn't had birthday. \n\nNTA",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I cannot belive how entitled some people can be. Just so it is your birthday doesn't mean random strangers have to cater to your whims and simply give you what they have paid for. NTA.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Wow, the birthday boy is such a loser \n\nBut, it’s his party and he can cry if he wants to",
          "id": 44,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2411,
      "content": "NTA - I hate people who do that, if tickets have specific seat numbers then SIT IN YOUR OWN DAMN SEATS.",
      "id": 45,
      "comments": [
        {
          "score": 575,
          "content": "Me too. Why should I have to sit in some random seat anxiously waiting to see whether the person who's booked it turns up half way through the trailers, meaning I then have to scrabble around in the dark looking for somewhere else to sit.",
          "id": 46,
          "comments": [
            {
              "score": 154,
              "content": "Had this situation happened to me just the other weekend with campsite location after backpacking 10 miles with my toddler.  I didn’t want to just set up camp in the remaining spot (albeit better) since I don’t want to get kicked out so I made an effort to locate the morons who couldn’t interpret their permits.  After we confirmed the other parties mistake, we were then willing to switch.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "NTA also replying to say - we once booked seats and an entire family had sat in our booked seats. We didn’t say anything but went and sat in different seats. Then the people who had booked those seats we were sitting in turned up late & asked us to move during the movie. Just a lot of stress - sit in your assigned seats to avoid awkward movie encounters!!",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "Was at the movies one time when this woman came in just before the movie started and started ranting at my friend that he was in her seat. Turned out that was her seat, but she was actually watching a different movie in another screen ...",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Exactly. And this wasnt a mistake. This couple picked those seats knowing there was no nothing in the middle available, and took your seats because they figured they could sit where they want, and the persons who purchased those seats would be too uncomfortable to ask them to move. And if they do ask keep escalating to bully them further.  \n\nThere was no accidents here.",
          "id": 50,
          "comments": [
            {
              "score": 12,
              "content": "Yup, they tried to bully OP into submission. These type of people would escalate the situation by being loud in the hopes that OP would give in. When that didn’t work he tried to guilt trip OP into thinking that OP ruined his birthday.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Plus, there is generally a booking fee attached to online bookings, meaning you are paying for the privilege of choosing your seats in advance.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "it may have been a genuine mistake, after all it sjust one row off. For me the issue is not just checking and moving.",
          "id": 53,
          "comments": [
            {
              "score": 11,
              "content": "Nah, they claimed that they checked with a worker and apparently in their row, the seats weren’t actually next to each other. Unless the worker made the same genuine mistake, it doesn’t add up.",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1261,
      "content": "NTA. You didn't ruin his birthday, he did that ALLLLLL by himself. If it even WAS his birthday. Lots of jerks like this throw out comments like that because lies are all they've got to make a justifiably upset person like yourself feel even worse. Don't sweat it.",
      "id": 55,
      "comments": [
        {
          "score": 269,
          "content": "Spoiler: It isn’t his birthday.  He just used that to amp up the pressure on you to switch",
          "id": 56,
          "comments": [
            {
              "score": 159,
              "content": "That's when you counter with \"What a coincidence, it's my birthday too! So please don't ruin it by sitting in my seat.\"",
              "id": 57,
              "comments": [
                {
                  "score": 70,
                  "content": "Its my birthday, our anniversary, we both just got promoted, and I found a four leaf clover on the way here",
                  "id": 58,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Not to mention my friend recovered from cancer just today, I founded my own business, we made our first contact with an alien race, our favourite TV show got renewed, our least favourite TV show got cancelled, it's my country's national holiday, my wife just got a baby this morning and Logan Paul got banned from the Internet.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Honestly after he tried to guilt me with the birthday thing, petty me would have been like \"well according to you they're JuSt SeAtS, so JuSt Sit SOmEwHeRe ELSe. \n\nDude sounds like he deserved to have his birthday ruined, but he 100% did this to himself\n\nI'd bet anything they planned this from the get go when they saw someone had reserved those prime middle seats",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 631,
      "content": "NTA. Birthday or not, they were wrong and threw a hissy fit about it.  You didn't ruin anything, they were just using 'birthday' as leverage to make you feel bad, which makes them assholes.\n\nYou paid for your middle seats, just like they paid for their not-middle seats.  Most theaters have maps where you can choose where to sit - and it's not your fault they didn't pay attention to what they bought.",
      "id": 61,
      "comments": [
        {
          "score": 124,
          "content": "This!!! There was a map to choose the seats from so they knew they didn’t have center seats.",
          "id": 62,
          "comments": [
            {
              "score": 62,
              "content": "Exactly! The guy gave himself away when he demanded the refund because his real seats were not as good.",
              "id": 63,
              "comments": [
                {
                  "score": 16,
                  "content": "Yeah I love how the guy felt “these are just seats” when he was arguing that OP should sit in the worse ones, but suddenly he needed a refund for being off center once he was required to sit in the same “just seats.”",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "I'm pretty sure they knew exactly what they were doing, right down to the tickets they bought. They just thought they could away with stealing OP's seats.",
          "id": 65,
          "comments": [
            {
              "score": 13,
              "content": "Yep. He knew exactly what he was doing.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "There were probably no center seats together when they bought their tickets and they just said “fuck it, we’ll just sit together where we want and whoever’s seats these are can sit somewhere else.”\n\nThey 100% knew those were not their seats and just figured they could bully OP into skulking off somewhere else. \n\nI’m glad OP (NTA) escalated it.",
              "id": 67,
              "comments": [
                {
                  "score": 2,
                  "content": "This 100%. They probably figured they would take the better seats and then hope that whoever showed up for them would be too embarrassed to cause a scene and just take their empty (worse) seats.\n\nBut the whole point of reserved seats is to make sure you and your party can all sit together in seats that you want to sit in instead of just relying on luck when you show up to the theater. These people waited too long to reserve their seats and got stuck with whatever was left over after people had already booked all the good ones. It sucks, but it happens. You don't get to try and take other people's seats though.\n\nAnd all the people saying \"they're just seats, just sit anywhere else\" - no. These are the seats you reserved specifically because that's where you wanted to sit, and these people took it upon themselves to ignore the protocol and etiquette of assigned seating. They should be forced to move, not you.\n\nNTA",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I agree NTA at all. But the map isn't always accurate and I can sympathize with getting to the cinema and discovering your seats aren't where you thought based on the map. I get often overwhelmed in the cinema if the movies too loud (don't get me started on Tenet 🤬) or headaches and neck pain if I'm sitting to close too the screen.  So if I get there and the seat doesn't work I need to move or leave. *But* there's a correct and polite way to do it!\n\nWhat I always do is take a look around from my assigned seat, scout out where the empty seats that won't be painful for me are and then wait until they darken the room the final time and show the ratings panel, signalling the actual film is starting. Then I quickly move before the company intros are over. And I make sure the seat I'm moving to doesn't involve getting by other cinema goers and blocking their view. Even then if someone turns up and I'm in their seat I'd immediately move and normally have a 'backup seat' I can move to if needed. Though most folk who turn up after the film has properly started just grab the closest free seat I'm my experience.\n\nOf course if you know the film isn't busy and you have plenty of time you can also just go ask the staff. I mention I've sensory issues and made a mistake with my seats and 9/10 they're more than happy to help.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 329,
      "content": "next time I go to a baseball game I'm gonna go sit right above the dugout and tell the people who actually bought those tickets that \"they're just seats\". \n\nIf the theater wasn't sold out then he could've just sat somewhere else where they could sit next to each other. OR even better, if it really mattered that much cause it was his birthday they could have booked tickets in advance so that they had reserved seats next to each other.",
      "id": 70,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 269,
      "content": "NTA - The guy knew they were in the wrong seats, and it's that simple. You sit in the seats you paid for.",
      "id": 71,
      "comments": [
        {
          "score": 107,
          "content": "Yep.\n\n>The couple saw us bringing a worker in and the guy came up to us and started to talk bad about me in front of the worker and how I’m blowing it out of proportion and said crude things about me.\n\nDidn't even try to convince the usher they were his seats, immediately just started into insults. If he honestly thought they were his seats he'd have just handed his  tickets over to confirm.",
          "id": 72,
          "comments": [
            {
              "score": 25,
              "content": "which suggests they didn't have ticket, which is probably why they rage quit rather than taking \"their\" seats",
              "id": 73,
              "comments": [
                {
                  "score": 5,
                  "content": "ding ding ding",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "This is the clincher. If he genuinely thought he was right, why didn't he just show his tickets?",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "And he said the others were no good, cause not in the middle, so they just took OP's seats on purpose.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 124,
      "content": "NTA, your birthday doesn't entitle you to someone else's seats.   Also, you had no way of knowing it was his birthday.  Dude was acting like an entitled baby.",
      "id": 77,
      "comments": [
        {
          "score": 30,
          "content": "For all we know it may not even be his birthday! He could be lying about that the same way he lied about the seats.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 95,
      "content": "You don’t *know* thus was his “f-ing birthday” and they could have easily moved *or* reserved those very seats-if they had wanted to. It sounds like that particular theater  makes you pick your seat when you buy your ticket- so *you picked*. That birthday boy had an argument and drama was all on *him*. NTA",
      "id": 79,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 79,
      "content": "E N T I T L E D \n\n\nIt's quite literally your seat. They knew what they were doing when they got there. Didn't like their seats and hoped no one would give them shit when they took it upon themselves to switch.\n\nYou didn't nothing wrong. NTA",
      "id": 80,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 53,
      "content": "NTA those people were in the wrong and they knew it but doubled down because it was his birthday. So what? Check your seat numbers first and make sure you get seats together, ain't that hard to do. That couple ruined your experience. I'm sorry you had to deal with them.",
      "id": 81,
      "comments": [],
      "relation": "Support"
    }
  ]
}