{
  "post content": "My son (we'll call him Jack Emmett Smith) was born just over 6 months ago and we decided to use my grandfather's name (Emmett) as his middle name to honor him and because I have always been close to my grandfather. My sister in law is now pregnant with their second child unexpectedly after her first just had her first birthday. There will be about a 19 month age gap between them.\r  \n\r  \nThe big thing here is that they already announced the name of the baby when she is only a month along.\r The name, is the same name as my grandfather and my son's middle name- Emmett.\r  \n\r  \nThey already announced this to both sides of her family and announced that they won't even be calling her by that name but by a nickname for her entire childhood.\r  \n\r  \nMy brother with all of this doesn't really care what they name the kids and really just lets my sister-in-law decide what she wants, which is fine. But the fact that they announced the name and never even talked to us about it beforehand and we only found out due to a group chat text stings especially since my son is barely 6 months old.\r  \n\r  \nMy sister-in-law struggles with severe mental health issues and I honestly don't know if I can bring this up to her without her having a complete meltdown and her end up thinking that we hate her and so on and so on.\r  \n\r  \nI spoke to my mother about it and she said that she thinks it's great that we all like the same name and that name's take on a different meaning for everyone and that it is completely fine. (My mother has also had to go through a lot of struggles in her relationship with my SIL due to the mental health struggles and all sorts of issues there).\r  \n\r  \nWIBTA for telling my sister-in-law that she needs to change the name of her unborn child because it is too soon after my own son being born?",
  "id": 1,
  "comments": [
    {
      "score": 33306,
      "content": "YTA. You don’t have sole rights to your grandfathers name, or any name actually. Your child is called Jack for a start.\n\nEdit: Jack being the first name (not Emmet) - nothing against regular Jacks.",
      "id": 2,
      "comments": [
        {
          "score": 9599,
          "content": "Perfect reply...i dont understand why people think they own a name or a date. OP is clearly the asshole here. Worry about bigger things and stop bad mouthing sil by saying mental illness. Get over it.",
          "id": 3,
          "comments": [
            {
              "score": 3381,
              "content": "Yeah I hate people who think stuff like “omg my son has the middle name Emmet and now she wants to name her child after Emmet too”. Weirdos.",
              "id": 4,
              "comments": [
                {
                  "score": 3174,
                  "content": "I have 23 first cousins. With middle names, that would be like 68 kiboshed names. 72 with me and my sister, then also partners family. Then another 7x2 for all their kids so 86 names I couldn't touch. My kid would end up being named Zebra at that point.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2060,
                      "content": "Kinda cute, little Zebbie",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 509,
                      "content": "haha I have about the same number, and I have a cousin whose first name is my middle name. it has caused 0 issues or impact on either of our lives. op sounds like she just doesn't like sil and is grasping for reasons to beef.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 122,
                      "content": "One of my  oldest sisters has the middle name Anne, my youngest sister, who has the middle name Ann.\nAnn and I are from our Dad's second marriage and have 7 older half siblings from Dad's first marriage.\nAnn and I agreed as kids to use each others name/middle names for a daughter, I have a neice who shares my middle name, and unique nickname, and if I have a daughter, her middle name will also include Ann.\nAnn and I also discussed using our Mum's name for any children we have - her eldest daughter has Mum's middle name as her middle name. \nI'm not a fan of Mum's middle name, and using Mum's name (Rose) would be a bit awkward for me, as even though it's my Mum's name, and my husbands Nan's name, it's also his ex-girlfriends name. So we discussed, and future daughter would have the middle name of June Ann (month Mum was born, and sisters middle name)\n\nAnywho, OP YTA, they are using it as a first name, imyou as a middle name, and at the end of the day, it's you're Grandfather's name.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 99,
                      "content": "Oh, but you may want to put Zebra on the forbidden list as well!  People with rare genetic illnesses, particularly EDS, refer to themselves as zebras. Might I reccomend naming your children numerically?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 81,
                      "content": "I have 7 cousins male cousins, 1 called James, about half with a middle name of James, my brother's middle name is James and is my boyfriend's, and is his father's name. So far there has been zero confusion. It's also traditional that the first born male is named Richard again no confusion.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "Same. I have 47 cousins.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Ya, pretty much the same for me, but at 17, 20 counting me and my siblings. We're are currently at 18 with number 19 due in the next two week for the next generation. Like four of the girls have the middle name Mae, including my daughter. I used it after one of my great grandmothers, I don't know where the others got it, and middle names aren't used alot until they get older, so with the oldest of them turning 2 this year and my daughter under a year, we didn't even realize it until my wedding in June. Mine was already 9 months old by that point. Drop the subject",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Boys in my family have basically two names. Let’s say Daniel and Tim. We have Grandpa Tim, Big Tim, Ted (Tim), Teddy, Daniel Jr’s Tim, David’s Tim, Dr Tim, Tim Smith, Tim Jones and Tim(diminutive). At a family event in the spring they took a picture of seven Daniels in the same room. It’s not the best system, and when I was pregnant and Young Daniel (age 7) suggested that I call my son Young Young Daniel, I didn’t go for it, but no one owns family names.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I have 20 first cousins. 7 if us have the same middle name. We are thinking of starting a club. OP is AH.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Yep I have 38 on one side of my family. It’s dumb. We were gonna name my daughter Jude but I forgot my SIL was giving her daughter (due two weeks before me) that as a middle name. You know what she said? Aw that is cute go ahead. We didn’t because it was just on our list of possibilities. Point being, it’s a name. Who cares!!!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 107,
                  "content": "My parents had the laziest, least creative \"solution\" to this problem.  I have 2 brothers.  All 3 of us have the same middle name.  WTF!",
                  "id": 16,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Myself and both my sisters have the middle name Ann/e. My older step sister after her mum's mum, me after my dad's mum, and my younger half sister after her dad's mum (hers is spelled without the e, whereas mine and older sister's have the e).",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "So this is a few generations ago, but my grandfather was born to very Catholic French Canadian parents and they named multiple sons Joseph [insert middle name here]. As I understand it, it used to be quite common to use Joseph as a first name for boys and Mary as a first name for girls and then just use different middle names to differentiate siblings.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Knew a guy in high school...every male in his family has the exact same name.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "My brother and I have the same middle name as my my father and his siblings, goes back 4 generations to distinguish our branch of the family tree.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "LOL Are they named after anyone special? :D",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 792,
              "content": "I thought the fact that she brought SIL's health into it was so tacky and gross. Also, by any chance, do you know all of your cousin's middle names? Do you think all of your aunts/uncles know your middle name? SIL was probably just thinking of baby names and made a list of all parents, grandparents and great grandparents.",
              "id": 22,
              "comments": [
                {
                  "score": 313,
                  "content": "I was trying to figure out the connection between SIL’s mental health and the point of the post. And the emphasis on the age gap between SIL’s kids. Just overall felt like attempts at shade for us to run with but it didn’t work lol\n\nEdit - LOL @ everyone assuming OP is a she",
                  "id": 23,
                  "comments": [
                    {
                      "score": 144,
                      "content": "OP is trying to imply that his SIL is \"fragile\" and they have to walk on eggshells around her...Could be. Never met her. However, based on OP's irrational response to someone else in the family using the name Emmett, it's coming off as projection.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 76,
                      "content": "OP is trying to figure out if she can bully SIL and get away with it",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 234,
                  "content": "Also why mention that SIL is having kids close together? What does that have to do with anything? Irrelevant.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 185,
                      "content": "I mean, *clearly* it's supposed to indicate that SIL is impulsive and makes bad decisions like... \\*checks notes\\* not caring that OP *also* used Emmett as part of her baby name. /s",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "It’s like perfect timing actually if you are trying to have siblings close together. This was the first thing I thought of. Why is this in here? 18 months is like a year and a half. What if this woman was 34?",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 182,
                  "content": "My older cousin and I share a name in common. It's her first name and it's my middle name. My first name is also very close to our shared name. None of us ever cared about our names being so close together, nor did it ever affect us in any way.   \n\n\nOP YTA",
                  "id": 29,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I have the same thing with my younger cousin! My family always thought it was cute, vetoing a name because of a meaning to you, fair enough, not because someone else has it as their middle name",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "same exact setup for me, and I've literally only thought about it like twice— once when I was a kid, and first realized, \"wait that's cute that we share a name\" and once when I read this post and noticed this is applicable to me haha. I don't even think my cousin remembers my middle name is hers.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 147,
                  "content": "The fact that there will be 19 months between SIL's two children is also completely irrelevant to the story - it's only in there because OP is being judgy about it.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 137,
                      "content": "And the fact that this is an unplanned pregnancy. AND the history between the SIL and mother. It is all to defame the SIL. OP is repulsive.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 72,
                  "content": "This is what I thought too. SIL mental health isn’t an issue here it was OP’s way of trying to disparage her sil to everyone reading so they’d be on her side.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 10,
                      "content": "For a moment I thought that the story would go on with examples of the SIL having an unhealthy fixation with OP, or something to contextualize it. When that didn't happen, I was repulsed. I wish OP included their age and the age of their spouse, and the in-laws. Very curious.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "My younger first cousin’s middle name is the same as mine with a different spelling because my aunt and uncle liked the name and didn’t remember that it was my middle name. Because why would they? No one cares. Hell, I just tried to remember all of my cousins’ middle names (we’re pretty close), and I can only think of about half of them.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I have 12 cousins on my mom's side. I know 5 of their middle names and have 1 that I may know or it may just be something he uses on Facebook. Of the ones I know, one shares her middle name with our cousin's kid (our grandmother's name), and two share middle names with their niece.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Same here, my cousin and I share a middle name with slightly different spellings. We thought it was cool when we were kids, and that's the most that's ever been said about it. No one cares, and no one will care if OP's kid and his cousin share a name - especially since, as you said, most people won't remember what OP's son's middle name is.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Me and two of my cousins share a middle name. My niece and nephew share one too. It’s fine, literally none of us have an issue with it.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah, my father actually has two cousins with the same name as him (Joseph). My maternal cousin is named Alison, and one of our other cousins is named Alyson. Beautiful names. Never a source of contention",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I knew a family who adored their father/grandfather Wesley. There are now so many Wesleys and variations of that spelling, first and middle for the boys and even one girl named Wezlee. :D NO ONE GOT PISSED about it! :D",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Fr, wtf is mental health has to do with the name??",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 206,
              "content": "It has to been an unhinged person thing. My sister wants to name her son Theodore so she can call him Teddy. I want to name mine Theodoro (after my PawPaw) and will call him Theo. We both know (we talked about it for a decade). Neither of us care, because we are adults will real problems that require our energy.",
              "id": 43,
              "comments": [
                {
                  "score": 148,
                  "content": "OP’s SIL may have a mentally illness but OP is *crazy*",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 80,
                  "content": "Can confirm it's for unhinged people. My sister asked me to change a middle name so she could use it. She wasn't even in a relationship and nowhere near having a kid. I said no but told her to feel free to use the name if she still wants to when the time came. 5 years later and still no baby.",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "This. My son and my SIL’s son have the same honor middle name. Nooooo one cares lol",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 179,
              "content": "Yeah all the mental health shade-op is an ah for that alone.  Like that is gonna make her more endearing or obviously right? You sound like you need therapy.  I’d much rather hang with someone who owns their mental health struggles than someone who is in denial about them (looking at you op)",
              "id": 47,
              "comments": [
                {
                  "score": 7,
                  "content": "What I didn’t like is the “if I made her” how on earth are you going to make someone? Seems very odd.",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "Especially a middle name. Nobody knows anyone’s middle names lmao. I don’t even know some of my best friends’ middle names. Who cares",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Seriously. I love how OP even says “make” her change the name, not ask her. Who in the fuck does she think she is?",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah we've all seen really weird ones on her.  \"My cousin is naming her child after my dead baby.\". Well yeah.  That's weird and should be a no.\n\nBut for now NEITHER kid is going to be called Emmet so who cares?",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Why do people even think that names can't repeat in families. I come from a family of Italian descent and, across my generation and the previous ones, there's several each of Rose, Grace, John, and Anthony; that's like 50% of the names of _everyone_ in the family.",
              "id": 52,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I don't think you can trademark a name (not a business name) but they could try. They should Google how many Jack Emmett's are out there.\n\nOP YTA.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I found it weird for OP to say too “unexpected pregnancy” and the age gap between her brother’s kids. Totally came off as some type of dig too like the mental health comments.",
              "id": 54,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 627,
          "content": "Would it be okay if she would have a baby a year from now and name the baby Emmet? What’s with the “it’s to soon after my son being born”",
          "id": 55,
          "comments": [
            {
              "score": 582,
              "content": "There are a few Emmetts in my family.... OP did not ask my permission and, tbh, I'm a bit hurt and offended.",
              "id": 56,
              "comments": [
                {
                  "score": 397,
                  "content": "“I want the name to be unique” picks a family name 🤷‍♀️",
                  "id": 57,
                  "comments": [
                    {
                      "score": 71,
                      "content": "It’s also just an extremely popular name.",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 49,
                  "content": "Make her change it or take her to court. Her son is only 6 months old so she definitely stole the name from your family.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Definitely/s",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I have a hard time finding “Emmet Smith” that unique for some weird reason…",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Good idea.\nSince he's only 6 months old, he can easily learn a new name.\n\nI will prepare a pre-approved name list for OP.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "[deleted]",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Look a lady I used to work with has a dog named Emmett and I think op was being a bit insensitive to her feelings naming her son that",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "Nooo but she's ~stealing her thunder ~~😂",
              "id": 65,
              "comments": [
                {
                  "score": 5,
                  "content": "I think this is a ding ding ding moment",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "It will take the attention off OP and her newborn",
              "id": 67,
              "comments": [
                {
                  "score": 10,
                  "content": "They can’t kiss grandpa’s ass solo anymore",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You can tell she's mad that SIL is pregnant so quickly after her son was born. SIL is stealing attention away from OP, and her fragile ego can't handle it! That's why she makes a point of saying it was \"unplanned\" and her kids will \"only be 19 months apart,\" as if that makes them bad people. I wonder if SIL was mad that OP was already pregnant when her own son was born. I mean, they're only about 6 or 7 months apart, according to this post.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "You know damn well if this was 5 years in the future them it would be that OPs kid has been the only Emmett for so long and how dare SIL steal the name",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I read that as her judging sil for having her kids so close together tbh maybe I picked up.on something not there, but it came over as judgy. But then she judges sil for a lot of things by the sound of it, casually tossing her mental health issues as if those having some bearing on her choice of name.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 418,
          "content": "I'd love to see how OP intends to \"make\" her SIL change the name. Any confrontation is more likely to \"make\" SIL dig her heels in. \n\nOP, find a new hobby that doesn't involve controlling your brother's family.",
          "id": 72,
          "comments": [
            {
              "score": 83,
              "content": "This is the part that caught my attention. Is she going over there with weapons drawn and force her some how? Ffs. I understand “asking” if it’s that important to OP (for some nonsense reason) but ultimately it’s not up to her, she can’t make SIL do anything unless were talking about blackmail or violence. OP sounds unhinged so distinct possibility.",
              "id": 73,
              "comments": [
                {
                  "score": 4,
                  "content": "Plus the part where OP is outraged that they have a nickname planned and \"won't even be calling her by her name for her ENTIRE childhood\" now.......wait. OP is mad they are using the name, then mad they aren't using the name? What?",
                  "id": 74,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 404,
          "content": "Also, a middle name, not even a first name. And a name that is being passsed down in the family",
          "id": 75,
          "comments": [
            {
              "score": 112,
              "content": "All the oldest girls on one side of my family share the same middle name, which was also our grandmother’s middle name. I think it’s really special.",
              "id": 76,
              "comments": [
                {
                  "score": 43,
                  "content": "All the girls in my family had the same middle name for generations.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Same here, except my mom thought the name was ugly (it is lol) so she picked a similar name that sounds much prettier to give to me.  If I'd had a daughter I would've happily passed it down to her.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 319,
          "content": "I’m from a Mexican family and there are so many duplicates of names. Three of my cousins are named after my grandfather. Two after my great grandma. There are infinite Marys.  Many people naming after the same person is the norm.",
          "id": 79,
          "comments": [
            {
              "score": 194,
              "content": "LMAO I was going to say you can tell homegirl isn’t Italian or Spanish. My family has infinity symbol Frank, Frankie, Big Frank, Big Uncle Frank, Little Frank, Pete, Petey, Peter, Cousin Peter 😂",
              "id": 80,
              "comments": [
                {
                  "score": 32,
                  "content": "Or Greek. Pete, Pete the son, Re-Pete, Uncle Pete, George, Uncle George, Georgie, Georgia, Uncle John, Cousin John...",
                  "id": 81,
                  "comments": [
                    {
                      "score": 14,
                      "content": ">Re-Pete\n  \nlol",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "The Irish too… Big Bob, Robbie, Bob, Bobby, Jeannie and Bob Bob, Rob, Big Mike, Big Mikie, Mike K, Little Mikie, Big Steve, Stevo, Big Jim, Jimbo, Jimmy Joe, Uncle Jimmy, Maureen and Maureen Elizabeth, Big Barbara, Barbie, Big Ann, Ann, Aunt Betty(Elizabeth), Beth (Elizabeth Ann), Big Jeannie, Jean-Jean",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Don’t forget Frank Jr!",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 144,
              "content": "From Goodfellas, \"Paulie and his brothers had lots of sons and nephews. And almost all of them were named Peter or Paul. It was unbelievable. There must have been two dozen Peters and Pauls at the wedding. And they were all married to girls named Marie\"",
              "id": 85,
              "comments": [
                {
                  "score": 75,
                  "content": "My Big Fat Greek Wedding too! \"Welcome to my home. Over here is my brother, Ted, and his wife, Melissa, and their children, Anita, Diane and Nick. Over here, my brother Tommy, his wife Angie, and their children, Anita, Diane and Nick. And here, my brother George, his wife Freda, and their children, Anita, Diane and Nick. Taki, Sophie, Kari, Nick, Nick, Nick, Nick, Nick, Nick, Nick, uh, Nikki, and I am Gus.\"",
                  "id": 86,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I thought of this too. And I can never think of this scene without also thinking of the bundt. ‘Bun? Bon? Bump?’ …. ‘Oh, it’s a KEEEHHHHHHK.’ 🤣",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "This. Every time this topic comes up, I just think OP would never last a day in an Italian family. Naming your kids after their grandparents is the norm, and when you run out of grandparents you name them after aunts/uncles. Somehow we survive.",
              "id": 88,
              "comments": [
                {
                  "score": 34,
                  "content": "Mary Angela, Angela Mary, Anthony Michael, Michael Anthony 😂",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Oh man, OP will loose her mind in your family 😂",
              "id": 90,
              "comments": [
                {
                  "score": 26,
                  "content": "She already has.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 131,
          "content": "Piggy backing top comment.\n\nPeople sharing names is so common. All my male siblings have my dads first name as a middle name. All the women in my family have someone else's first name as their middle. I have two middle names that are bith someone else's first name. \nMy cousins have been named after my siblings. Its beautiful. \n\nIf they had the same first name, it may raise an eyebrow but can be worked around. But a middle name, that most people will never even learn about, is a bit insane to nitpick about. Especially when considering the original owner of the name.\n\nYta OP. I do feel like youre coming at this at a competitive view, rather than a loving appreciative one.",
          "id": 92,
          "comments": [
            {
              "score": 4,
              "content": "Wonder if OP has ever heard of the naming system in George Foreman's family.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 129,
          "content": "This is so YTA that I’m thinking it has to be fake. No other post history either..",
          "id": 94,
          "comments": [
            {
              "score": 21,
              "content": "This isn't fake I think because I just can't fathom a reason to fake a post so trivial.",
              "id": 95,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Lot of people create a dummy account to post for anonymity's sake.",
              "id": 96,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "People are really this controlling/ stupid. I've overheard folks having a similar disagreement in real life. \n\nNobody cares what you name your baby.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 121,
          "content": "Also It sounds like this is her brother’s wife, right? So this is his grandfather’s name as well as hers.",
          "id": 98,
          "comments": [
            {
              "score": 47,
              "content": "Yes and apparently it's also a family name on her side",
              "id": 99,
              "comments": [
                {
                  "score": 8,
                  "content": "My kid and my nephew share my grandfather’s name for a middle name and no one gave a crap cause it was OUR grandpa. The more people to honor him the better!",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 91,
          "content": "Yep. A family name. Kids in families tend to have them appearing somewhere in their names. Our son has Francis as a middle name and his cousin’s first name is Francis. No one freaked out. It’s nice to the names going down the different branches of the family",
          "id": 101,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 66,
          "content": "Perfect comment. I don’t understand these petty, entitled moms who think they can tell other people what to name their kids-and think that they can gatekeep family names. OP-grow up. You do not own the name, and, for that matter, you did not give your child this first name anyway. The world does not revolve around you. Gross. YTA.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10532,
      "content": "YTA just thinking that it's your business.",
      "id": 103,
      "comments": [
        {
          "score": 3434,
          "content": "yta for thinking she can “make” someone change the name of their baby. how you gonna do that, op? you mad strong? or do you just think your word is law? newsflash: it’s not.",
          "id": 104,
          "comments": [
            {
              "score": 1065,
              "content": "The \"make her\" made me laugh",
              "id": 105,
              "comments": [
                {
                  "score": 383,
                  "content": "Yes, what is she going to do? Sue her SIL? Get a restraining order? Or just stamp her feet and have a tantrum?",
                  "id": 106,
                  "comments": [
                    {
                      "score": 84,
                      "content": "OP is a man",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "They're going to start spinning their hands around in a windmill fashion and if SIL gets in the way it won't be their fault.",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "I know right? \"If I made\" why do you think you have a chance?",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 147,
              "content": "and “you mad strong?” made me legit laugh out loud. 😂",
              "id": 110,
              "comments": [
                {
                  "score": 5,
                  "content": "But op's 260lbs lean and would win in a street fight with his sister in law\n\n\nBefore downvotes, this is a reference to Bradley Martin and is sarcasm and a joke.",
                  "id": 111,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "Yeah honestly, I'm even wondering if sil actually does have mental health issues?\n\nOr if that's what op and her mum tell themselves, coz they think she's difficult....which is just code for not bending to their will when they think their word is gospel and they're the bosses of the family 🙄",
              "id": 112,
              "comments": [
                {
                  "score": 35,
                  "content": "....oh, I bet SIL has a mental health problem.  I also bet its name is the same as OPs.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Also why does she need to tell her SIL to change the name, and not tell her brother not to name his son after... His grandfather.",
              "id": 114,
              "comments": [
                {
                  "score": 4,
                  "content": "I hate that English doesn't distinguish the 2 kinds of brother/sister-in-law: \nYour sibling's sibling\n=/=\nYour spouse's sibling \nBut the word is the same.",
                  "id": 115,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "“You mad strong?” 💀💀💀😂❤️",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "like you gonna hold a gun to her head as she fills out the birth certificate sis? 🤣",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 129,
          "content": "I never understand when people think they would even matter during something like this. And how does OP think they could get them to change the name? Lmao",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 67,
          "content": "totally not her business. and it’s not like they’re both using the name as their children’s first name. definitely failing to see the problem here. it’s another way to honor the grandfather. how is that a bad thing?\n\nmy friend gave her two daughters the same middle name because she liked it so much. asking your SIL to change so that the cousins don’t have to share the same middle name is absurd.\n\nOP, YTA.",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Permission to use it????????",
          "id": 120,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8574,
      "content": "YTA. It’s your son’s middle name. People hardly ever use middle names. It’s actually kind of neat they are using it as a first name. It’s something they’ll have in common.",
      "id": 121,
      "comments": [
        {
          "score": 1494,
          "content": "Yep good reply...if sje was so enamored with the name it should have been his first name.",
          "id": 122,
          "comments": [
            {
              "score": 605,
              "content": "It's almost as if she's angry because they are making it more of a tribute than her.\n\nShe would be the type to get mad someone donated more to a little league team than her.",
              "id": 123,
              "comments": [
                {
                  "score": 257,
                  "content": "Yep this the real reason. Op should just change their kid’s name to Emmett Emmett Emmett the Second and claim ultimate victory",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I read it as she's just pissed in general someone in the family dared to have a baby so soon after her own. Is it even about the name or the fact her little cherub will no longer be the littlest and get the most attention?",
                  "id": 125,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I’m wondering whether there’s something else OP isn’t telling us. Like she wanted to use Emmett as the first name but her husband vetoed it or something. Might explain why she’s so hung up on the name. Either ways, YTA.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Seriously! My husband goes by his middle name, but he is the 5th Joe in his family. His parents always knew they were going to call him by his middle name. He hates having to clarify that he goes by his middle name because his parents were focused on \"honoring\" him with his first name. \n\nNews flash OP: Some lines of work don't care about your middle name. No one would call my grandfather by his middle name in the Navy, and he didn't respond often to his first name. Thank God the hospital wrote it down wrong and refused to correct it, or he would have died at war.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 512,
          "content": "I can't believe when this stuff comes up. my dad shares his name with two second cousins, his father, and his son. That's what family names are for. \n\nMy grandmother's name is the middle name (in one form or another) of three of her great granddaughters. \n\nMy middle name is shared with half of all white women born between 1980 and 2000. \n\nNone of this matters.",
          "id": 128,
          "comments": [
            {
              "score": 213,
              "content": "So your middle name is either Anne or Marie. Maybe spelled slightly different.",
              "id": 129,
              "comments": [
                {
                  "score": 120,
                  "content": "I literally thought “Ann, Marie, or Michelle” because those are the middle names for EVERYONE I know in this age group.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 60,
                      "content": "I have both michelle and Ann for my middle name 😂😂😂",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "I thought Ann, Marie, or Lynn. \n\n(I’m a middle Marie myself 🙄)",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Hahaha one of those is my daughter's middle name, my mom and sister's middle name, and my middle name.",
                      "id": 133,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "My older sister has Marie, I have Michelle, and my younger sister has Ann 🙃",
                      "id": 134,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Yes, add Renee and Nicole and it’s probably 99% lol.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Or Jane! I know so many classmates where our middles names were Ann/Anne, Marie or Jane",
                      "id": 136,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 73,
                  "content": "Don’t forget Elizabeth or some variation of Catharine.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 8,
                      "content": "😂 I feel called out now having both of these names.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I’m salty because my middle name is Marie, after my grandma’s supposed middle name. I figured it’s an incredibly common middle name, but whatever, it’s a nice tribute to my grandma.\n\nShe had to pull her birth certificate out for something a few years ago and turns out her middle name is Maria, which makes sense given that she is Mexican. She’s also been misspelling her first name her whole life. 🤦🏻‍♀️",
                  "id": 139,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Or Louise\n\nEditing to add this: https://www.mamamia.com.au/middle-name-louise/",
                  "id": 140,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Or Lynn!",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 102,
              "content": "Not white, but shared a middle name Lynn with 11 white girls in elementary school in the 80s.",
              "id": 142,
              "comments": [
                {
                  "score": 27,
                  "content": "Haha I was coming to say Lynn! That was my middle name. I changed my middle name to my maiden name when I got married.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 5,
                      "content": "My middle name is Lynn and also the middle name of my son's MIL. We think it's great!",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "Yeah. I have a \\*wildly\\* rare name, one of those that hasn't been used regularly in about 250 years (according to one of those social security data trend widgets, I have about a 1.2 percent chance of ever meeting another person with my forename in my entire life).  My slightly-younger cousin was given the same name as her middle. I always loved it as a kid, even if I knew that the meaning behind someone saying just \"Alazne\" was way different from \"*Brianna ALAZNE!*\" and if I heard both names at once someone was probably about to get spanked.",
          "id": 145,
          "comments": [
            {
              "score": 41,
              "content": "Imagine if this was a typical Eurocentric white family and she said she owned the name Mary, or James.",
              "id": 146,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I love your Reddit name!",
              "id": 147,
              "comments": [
                {
                  "score": 29,
                  "content": "Thank you! I took it originally to remind myself to be moderate in my responses, but now it just feels like me.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My grandmother had an incredibly rare name--it's worth actually quoting this:\n\n*How popular is the name Noveline? Noveline is the 56,125th most popular name of all time.*\n\n*How many people with the first name Noveline have been born in the United States? From 1880 to 2021, the Social Security Administration has recorded 34 babies born with the first name Noveline in the United States.*\n\nI just found that interesting! I always loved her name and wish I'd had a daughter to pass it on to.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "If name was so important why not give it as a first name?",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "My son has a biblical middle name and I have to think about how to spell it when filling out certain paperwork lol I rarely ever say my kids middle name.",
          "id": 151,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6180,
      "content": "Stopped reading after \"they announced the name and never even talked to us about it beforehand\". This is over the top entitled and it's their business naming THEIR kid. You don't own a name lol look at how many families have like 8 people named John lol YTA\n\nEDIT - okay, we made our point here, you all have people in your families with similar names, we can stop bombarding me with your comments that are the exact same as all the others.",
      "id": 152,
      "comments": [
        {
          "score": 528,
          "content": "Yeah, there are definitely families out there with Big John, little John, baby J, Johnny, and Jojo. So not a big deal unless you make it a big deal. If this is truly a tribute to an amazing relative then why should it be a big deal if two cousins share a name (that’s not even one of their first names)?",
          "id": 153,
          "comments": [
            {
              "score": 86,
              "content": "This just reminded me that my father and his first cousin have the same first name. We have an uncommon family name too so it's not even like it's two John Smith's",
              "id": 154,
              "comments": [
                {
                  "score": 11,
                  "content": "In my husbands family there are three men with the same first name and and rest have it has their middle name. So we have John, his son John Jr, and John Otherlastname (nephew/cousin with his dad's last name) , but no one even calls them that - it's Uncle John, Big John and Little John. I was married into this family for TWO YEARS before I figured out that I was confusing big John (John Jr) with John Othername because I assumed they were titled by height, not age. So Little John is 6\" taller than Big John, but Big John is 2 years older than little..... We now just use their full first/last name to avoid confusion.",
                  "id": 155,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "In my dad’s family the tradition is to name the oldest grandson after the grandfather. My dad was the oldest grandson, but the decided to name him after his dad instead - middle name after the grandfather. So the next cousin got the grandfather’s name. Basically OP’s exact scenario, except that it had hundreds of years backing the tradition up to use those names. There are plenty of families where names double up - I even know a family with first daughter Anne Marie and second daughter Maryann (which might be the worst I’ve heard, but ymmv).",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I have two nephews named Dylan. My father has 2 children from 2 different women and they both loved the name for their first born. No one bats an eye at it.",
                  "id": 157,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "This reminds me of the scene in the movie “my big fat Greek wedding” where most of the men in the main character’s Greek extended family have variations of the same name: “Nick, Nikki, Nicholas, Nick, Nicky.” lol",
                  "id": 158,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "My boyfriend's family has Big Sally (dead of old age), Little Sally (elderly), and Sally Jo (heading off to college). Yeah, no one owns a name.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My husband’s family:\n\nFIL, husband have the same name. FIL’s sister married a man with the same name, who became best buddies with FIL. Everyone can figure out which “Paul” we are talking about. \n\nGet over it.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Me at my sister's wedding. \"Hi, I'm Frank. This is my dad, Frank, and my grandfather, Frank. Over there is my cousin Jim and my uncle Jim and over there is my cousin Tom and his son Tom. My grandfather constantly confuses the names, so all of us cousins will respond to any of them.\"",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "There are so many Josephs in my family, no one knows who my brother is named after.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I am this family. Myself, my dad and my grandpa all have the same first, middle and last names. And we're all John lmao. I'm not gonna have kids, but if my brother wanted to continue the tradition and name his first son john 4, I would be elated.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Is that a JoJo reference?",
              "id": 164,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "Remember when George Foreman named all his kids \"George?\"",
          "id": 165,
          "comments": [
            {
              "score": 12,
              "content": "That's ok though because George owns the name.",
              "id": 166,
              "comments": [
                {
                  "score": 16,
                  "content": "He'll fight you for it. Or grill you a nice burger and talk to you rationally about how he feels it's his way of having his legacy carried on, but you know you'll be thinking about how many hits to the head he must have taken during his career. Then you admit to yourself, damn...he makes a really nice burger.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 47,
          "content": "Yep! A middle name John here. We got like 10 or so  with that middle name in our family if not more.",
          "id": 168,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "If anyone should be asked it’s the grandfather.\n\nEdit: typo",
          "id": 169,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "My favorite part is where this is the grandfather's name and the SIL is an in-law through OP's brother because that's his wife. That means grandpa is both OP's and brother's grandpa so he gets to use or in this case be ok with his next child sharing a name with his grandpa.",
          "id": 170,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Notice how OP is also like \"if I make SIL change it\" instead of \"if I ask her to change it\"? OP is entitled af",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yeah she called her sil mentally ill, but this post made OP sound like she needs mental help. Her mother tried to say it was great people wanted to have the name of her father, and op didn't like that. Brother just brushed it off as he doesnt care to her, when of course he cares, he just doesn't want to deal with OP. OP really thought they should ok a nephews name with them before deciding on it.",
          "id": 172,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "SO entitled. Like Who who whooooo the fuck does OP even think they are? Miss queen of the world apparently. I wonder who they talked to beforehand when they were naming Jack 😂",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Facts, I have 3 Jessie’s in my family. We say big Jess, little Jess and messy jessy",
          "id": 174,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Right?\n\nGrandfather is William. Between our kids and their cousins we have 6 boys with either the first or middle name William. No issues at all.\n\nOP, you are flat out being a Petty Patty. YTA",
          "id": 175,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3601,
      "content": "[removed]",
      "id": 176,
      "comments": [
        {
          "score": 1432,
          "content": "I have to wonder if the SIL honestly has \"mental issues\" or if she's just surrounded by AHs? \n\nThe sheer audacity of OP to think she can tell two grown adults that they're not allowed to choose their *own child's name* is pretty jaw-dropping. I can only imagine how fun their family gatherings are.",
          "id": 177,
          "comments": [
            {
              "score": 484,
              "content": "We don't actually know that SIL has mental health issues, we just know that OP says she does. In my experience, it's not uncommon for controlling AHs like OP to belittle and dismiss people they can't dominate by writing them off as \"crazy\".",
              "id": 178,
              "comments": [
                {
                  "score": 150,
                  "content": "Why did they not consider my feelings when naming their child they must be \"crazy\"",
                  "id": 179,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Or, OP’s just using ‘mental illness’ as an umbrella term to get us to think that SIL’s mental illness is something that makes her attention seeking or something, when in reality SIL has anxiety.",
                      "id": 180,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "Right and the meltdown she thinks the SIL will have is really just the SIL establishing boundaries and reminding OP that she doesn’t own a name. Lol. People like this are a trip.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "it's also not uncommon for them to use actual mental health problems as an excuse to write off your entire being. So even if she did have mental health problems, this is still incredibly shitty.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": ">I have to wonder if the SIL honestly has \"mental issues\" or if she's just surrounded by AHs? \n\nThis. I think that is the case.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "‘Mental health issues’ is such a cop out. ‘She’s crazy and unreasonable’ because OP doesn’t have good boundaries and thinks this shit is her business, and SIL probably calls that shit out.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "OP: I’m going to explain in my native language of passive aggression how much I hate and resent my SIL\n\nSIL: I’m upset that you hate me so much\n\nOP: [shocked pikachu face] I have no idea where you got that idea! I express my love and support through the medium of bullying!",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I mean even if she did, using that to discount her feelings and choices is INCREDIBLY goddamned shitty",
              "id": 186,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yep. This definitely stood out to me. SIL's mental issues (if she even has any) didn't need to be mentioned here, at all. It comes off as a way to deflect from OP's entitlement over something that doesn't even really matter. Making SIL the \"real issue\" in all this. I bet money that OP (and possibly other members of OP's family) might bother SIL and make her feel hated (possibly making her jump through hoops for their approval, which falls in line with OP's offense at not being asked before they decided to name their child), which is why OP is worried about it now. Oh no, I'm bringing another outrageous demand to my SIL and she might be upset over it. Yeah, I wonder why.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "OP is a man",
              "id": 188,
              "comments": [
                {
                  "score": 5,
                  "content": "Ooops!",
                  "id": 189,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Op seems to be a he not a she, so it’s likely that he views any emotion from sil to be “hysterical”, because that fits his narrative better than someone else having reasonable boundaries.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "See that was what I was thinking reading this. Because there is definitely an unhinged individual in the post, but it's not SIL.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 65,
          "content": "She seems be jealous tbh. I get the feeling she feels “one-upped” since the new baby will have the name as a first name instead of middle name.\nBizarre.",
          "id": 192,
          "comments": [
            {
              "score": 36,
              "content": "It also seems a little bit like gaslighting behavior in this post. She's insinuating that her SIL has mental health issues. Then she's not sure if she could make a crazy entitled request to her SIL without her having a meltdown. Like, come on already. I would be embarrassed if I was OP right now.",
              "id": 193,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Op is a man. Funny how everyone is assuming it’s a woman",
              "id": 194,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1936,
      "content": "YWBTA for two reasons. \n\n1. Thinking you can \"make\" her change the name as if you had that type of power to control what others do. \n\n2. For feeling ownership over the name. It's a name. I'm sure you'll meet other people in the world with that name. Get over it. \n\nMy cousin named her son Samuel. My cousin's sister had a kid and named him Sam. So the two kids are Sam and Samuel. No one took issue with this. \n\nThis is not in your control. I suggest learning to just accept it. If you hate it so much, change your own kid's name because that you can control.",
      "id": 195,
      "comments": [
        {
          "score": 339,
          "content": "Plus, one kid has it as a middle name and one has it as a first name, so it's not like anyone is going to get confused between the two.",
          "id": 196,
          "comments": [
            {
              "score": 109,
              "content": "And I think it’s even funnier that she mentions SIL would call their child by a nickname and wouldn’t be saying their real name often. Like does she realize people care about middle names even less? Most people I know don’t even like their middle names lol",
              "id": 197,
              "comments": [
                {
                  "score": 6,
                  "content": "No one even knows mine 🙈🙈😂😂",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "The SIL even said they wouldn't be calling her Emmett, but a nickname. I'm guessing something like Emma or Emmie.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Someone needs to tell this to my sisters baby daddy. I can’t stand that dude, he’s like OP. \n\nI’m in my late 30’s, I was named after a character in a popular 80’s movie. I’ve never met another female with the name, only men and boys so it’s pretty unique. Here comes this dude, he couldn’t give his first child the name, so it’s a middle name. He literally told me to my face that he can’t call me by my name because it’s his sons middle name, and that’s what he calls him. 😑 I had to tell him that 1. I don’t care, it’s my name and I haven’t given you permission to use a different one 2. It’s your sons middle name, get over it.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "We named my son after my husband’s wonderful grandfather. When my sister in law got pregnant she said that she always wanted a son named after him too. I told her to go ahead. No reason why both our boys can’t be named after him. He was a great guy. She named her boy something different. But I wouldn’t have minded a jot.",
          "id": 201,
          "comments": [
            {
              "score": 6,
              "content": "My granddads middle name is Alexander and my brothers middle name is the same, my granddads passed away this year, both my nephews middle names are Alexander, no one has a problem with it.",
              "id": 202,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Wouldn’t your cousin’s sister also just be your cousin?",
          "id": 203,
          "comments": [
            {
              "score": 35,
              "content": "Yes! I just wanted to point out that they are sisters and they're both ok with Sam and Samuel. \n\nI think if two cousins (not siblings) both named their kid Sam and Samuel or something identical, it wouldn't matter as much unless they saw each other as often as siblings and their kids.",
              "id": 204,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Jack “Difficultmom” Smith has a nice ring to it.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "My son is named after my husband and his two grandfathers. My nephew has the same name, named after both of HIS grandfathers. It’s also the name of my husband’s uncle, both grandfathers and cousins 😄 \n\nNo one is confused. \n\nNo one has ownership over a name.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1030,
      "content": "YTA, you are being really childish and weirdly possessive over a name. You do not have the ownership of the name and have no right to even ask your sister-in-law.",
      "id": 207,
      "comments": [
        {
          "score": 158,
          "content": "She is upset because she tried to say they honored the grandfather by using his name as a middle name, which is meaningless. A real honor is using the name as a first name, which is what the brother and SIL are doing.",
          "id": 208,
          "comments": [
            {
              "score": 174,
              "content": "While I firmly believe OP is the AH, I disagree that using it as a middle name is meaningless. My middle name comes from my grandmother and has been meaningful to me all my life.",
              "id": 209,
              "comments": [
                {
                  "score": 11,
                  "content": "Agreed on that point. I actually gave my youngest son my grandpa's middle name as his middle name because I always thought it was cool. My aunts still cried when they heard it because it was honoring their dad.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This guy is willing to start a family war over a name, yet he can't even name his own child the name he is fighting for, he is using it as a second name which will be rarely used.",
                  "id": 211,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "OP is a man",
              "id": 212,
              "comments": [
                {
                  "score": 42,
                  "content": "Oh, i’m surprised by this.  Probably for sexist reasons.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I admire this self reflection",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "> OP is a ~~man~~ *little piss baby.*\n\nFTFY",
                  "id": 215,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "\\*\\*\\*\\*he\n\n&#x200B;\n\nidk why everyone is assuming OP is a woman",
              "id": 216,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 555,
      "content": "Has anyone else noticed how in an aita post there is always someone who has mental health issues or autism or adhd?? There is like 1% of the population who has autism, but on reddit everyone has it. \n\nEither way, YTA.",
      "id": 217,
      "comments": [
        {
          "score": 152,
          "content": "Too many self diagnosing these days. Everyone is mentally ill or a narcissist in these posts",
          "id": 218,
          "comments": [
            {
              "score": 74,
              "content": "I agree. And i find it kind of insulting to people who actually have mental health issues",
              "id": 219,
              "comments": [
                {
                  "score": 15,
                  "content": "Autism and ADHD are not mental illnesses. They are neurodevelopmental conditions. Not the same thing at all.",
                  "id": 220,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I know. that's why in my original comment i said mental illness *or* autism and adhd. Here i talked only about mental illness cause that's what the comment above mentioned.",
                      "id": 221,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "It’s actually not that rare. 1% with autism, 5% with adhd, 5% with bipolar, 5% with depression, etc - adds up to about 30% of the population having some sort of neurodivergence or mental health disorder. Self diagnosis aside - even if every single person self diagnosed as adhd or autistic or mentally ill - that takes nothing away from anyone else. More accommodations, more support systems, more awareness is a good thing. \n\nAlso just because op claims she’s mentally ill doesn’t mean she thinks she is or has a dx. This is just op’s perception.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "too many people weren't diagnosed or misdiagnosed as children, hence the uptick in adult diagnosis",
              "id": 223,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 86,
          "content": "There are also a TON of posts about generational wealth or 20-somethings making mid-6 figure salaries or their step-brother has a trust and doesn't need to work or \"gee wiz how should I divide my $10mil inheritance between kids who don't love me.\" \n\nWhy is every 1%er on this sub with a problem lmao",
          "id": 224,
          "comments": [
            {
              "score": 10,
              "content": "It's because a lot of these stories are made up, lol\n\nHowever, it's fun acting as if they aren't. If one ever happens to be a real one, hopefully they get good advice.",
              "id": 225,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My favourite thing about this sub is just how many people who are twins/have twins post.  You'd think half the population was a twin based on how often this is included in AITA",
              "id": 226,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 85,
          "content": "That 1% stat is so wrong lmao about 1 in 36 children are on the ASD spectrum and that doesn’t include the adults",
          "id": 227,
          "comments": [
            {
              "score": 22,
              "content": "And diagnosis for adults who were not picked up as kids is insanely expensive and difficult to access. Some people self diagnose because it's their only choice.",
              "id": 228,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 36,
          "content": "Someone in this post might suffer from mental issues, but signs are not pointing to it being SIL.",
          "id": 229,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Yeah, I am not sure I believe this story. Mainly because the SIL is a month along and has announced the name, and somehow knows it's a girl? (\"Calling HER by a nickname for HER entire childhood). Like, one month in most women are just getting two lines on a pregnancy test. And not telling people. Unless this person did IVF and picked a girl, they wouldn't know. And if they went through IVF, that indicates they have struggled and paid a ton of money and they can name their kid whatever they damn well please.",
          "id": 230,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I’ve noticed *a lot* of AITA posts center around conflict between a SAHP and a working parent. Obviously this is in no way a valid scientific study, but I do wonder sometimes if that’s because one person staying at home and one being a breadwinner makes the relationship more prone to conflicts in terms of division of labor.",
          "id": 231,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "That might sound like a little but it's more than you think. Take a look at the number of comments in this post, as of right now it's almost at 5000. 1% of that is 50. That's a lot of people. I personally have 4 niblings that are on various levels of the spectrum. They have been diagnosed by a professional.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 422,
      "content": "YTA.\n\nThe name someone chooses for their kid is their choice.\n\nNobody else has something to do with that.",
      "id": 233,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 366,
      "content": "YTA. Why does it matter? It’s a nice gesture on both families to honor someone. And what the hell does too soon mean? She has the right to use that name the next day if she wants.",
      "id": 234,
      "comments": [
        {
          "score": 39,
          "content": "My cousin had a baby the same week as my brother's wife.  Both babies have the same 1st and middle name.",
          "id": 235,
          "comments": [
            {
              "score": 14,
              "content": "That's kinda annoying",
              "id": 236,
              "comments": [
                {
                  "score": 11,
                  "content": "It was actually funny.  Neither knew the other was doing it.",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Hopefully they have different last names as that could wind up being a real hassle down the road.",
              "id": 238,
              "comments": [
                {
                  "score": 5,
                  "content": "They do.",
                  "id": 239,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}