{
  "post content": "\n\n**situation**\n\n\nI (M34) recently bought a one-story house. Note that it was purchased solely by me, my wife did not help save for it (I started saving for it before I even met here) and it's in my name.\n\n\nWhen my parents threw us a party for this happy ocassion, mom asked for a copy of the key in case of an emergency. I let her have it which made my wife upset. She didn't say anything at the time but she waited til we were alone and started arguing with me saying I shouldn't have let my mother have a copy of the key. I said \"why?!\" Since my mother is known to respect privacy and is a very trusted member in the family. She said that she does not feel \"comfortable\" with the idea of someone else, who's not a resident to have a copy of the key. She also brought up how my mother didn't pay a penny towards the house so this should \"disqualify her\" from getting the key. I said it was not a big deal but she kept presisting saying I need to take the key back. Quite frankly, this had me fuming. I pointed out that I'm the one who bought the house and it's my decision to decide who gets to have a copy of the key end of story. She screamed at me saying that \"technically\" she did contribute towards the house savings back when she used to pay for our rent and daily expenses while I saved money. I told her that she was acting as if I put my mom's name on the title which's ridiculous but she said that I have no respect for her opiniins and keep undermining her input.\n\n\nWe've been going back and forth on it since then. She's now \"letting me know\" that if I don't take the key back then she'll do it herself. I think she's being irrational and unreasonable acting like that over a copy of the house key. This decision I made could save us in case of an emergency but she kept downplaying it.\n\n\nE.T.A I think it's crucial to mention that there's no conflict between my mother and my wife. They're on near perfect terms, alright? I thought that I've already established that above.",
  "id": 1,
  "comments": [
    {
      "score": 56516,
      "content": "YTA\n\n\n\nAnd that is why you can't trust no one when it comes to money.\n\n\nYou played your wife.\n\n\nYou probably told her you would save for a shared home and thats why she should support you and pay your share of the rent.\n\n\nNow \"she didnt contribute a penny\" to your house. \n\n\nYour house.\n\n\nShe gets no say. But you mom does- lol\n\n\nYTA- you are an ahole.",
      "id": 2,
      "comments": [
        {
          "score": 23811,
          "content": "I’m a bit confused as to how OP can admit that the wife paid rent while he put his savings towards a house, then go back and say the wife didn’t contribute. \n\nThere’s *a lot* of unanswered questions here.\n\nDoes he really not understand that if she wasn’t paying the entirety of the rent then he would not have been able to save as much? How long was she paying rent and how much did he have in savings before she started doing that? What was the actual agreement there? \n\nAnd on that note, why is the wife not making a bigger deal out of not having her name on the house? Did she agree to it for some reason that benefits her? Is this actually a bigger deal to her than OP is letting on and that’s why she’s so resistant to the idea of his mom getting a key? Does he pull the “it’s my house” thing often?\n\nIt feels like OP left out a huge chunk of the story here.",
          "id": 3,
          "comments": [
            {
              "score": 11623,
              "content": "She paid for everything, not only his rent. Dude is something else!",
              "id": 4,
              "comments": [
                {
                  "score": 5476,
                  "content": "A freeloader! He is seriously taking advantage of his wife.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3101,
                      "content": "I'm literally disgusted for her. Sad you can't even trust your husband to do the right thing.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1564,
                      "content": "A freeloader who ends up with a house in his name. I bet he throws that fact in her face daily!",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 742,
                      "content": "my ex husband did this. it is called financial abuse. im guess8ng she sacrif9iced more than just savings. if like me, I sacrificed doctor and dentist6 visits and all sorts of things.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 175,
                      "content": "[removed]",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 100,
                      "content": "I hope Op's wife keep ALL the receipts of paying for everything while op \"saved all by himself\" . Why do you ask? So when she gets enough of his selfish freeloading momma boy butt she can divorce him and get half. Btw OP is clearly an YtA",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "her name needs to be on that house yesterday",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 31,
                      "content": "Unless they had a prenup that states everything in the marriage belongs solely to the person who bought them (which I seriously doubt his wife would have signed after paying ALL the rent while he saved for *”his house”*), he’s gonna be *super* surprised when the divorce judge rules that it’s half her house too.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "Well on the plus side I’m sure divorce court will take all of her contributions into account even if her future ex doesn’t.\n\nYTA- your wife contributed most of the money for the place. She paid all your bills and supported you while you did nothing but hoard your money to buy your future home.\n\nIt’s real easy to save money when you have no actual expenses.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2164,
                  "content": "My ex husband was like this. I supported him through a lot. There was once almost 2 years where he didn’t work. He would get a job and then quit for reasons like working as a grocery store clerk was beneath him. He played a lot of video games with his best friend and then at some point went to school at night for training to be an EMT although that lasted just a few months. He passed his exam and then still didn’t get a job. Fast forward 5 or so years and we decided to purchase a home, but his credit was horrible from before we met, so the only way the loan would go through is if he wasn’t on it. He had finally had a job he liked and was working consistently for a couple years. I was miserable at my job and had a long commute so we discussed it and he said I should quit and find a new job. I quit and was job free for a couple months while I job hunted. Anyway 2 years later, we separated and started going through our divorce process and he kept referring to the time I didn’t work and saying how he should get the house because he paid for everything and his parents gifted us 2k towards the down payment. I wanted to sell and split it 50/50. He got cruel and hurtful and it went to court. The judge didn’t see it his way and I got 100% of the house. Oddly enough his parents and I are still close. I take it as a testament that my ex is an AH. His dad texted me the other day to tell me they were thinking about me and hope I was well because I deserve happiness. I have a feeling things will work out for ops wife in the long run.\n\nEdit: typo",
                  "id": 14,
                  "comments": [
                    {
                      "score": 898,
                      "content": "[deleted]",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "Those are my favorite ones, lol. Working in a grocery store is beneath them but being unemployed isn't. 😂",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "I'm glad things went the right way even if it hurt getting there. I'm also glad to hear about in-laws who recognize their child was an asshole and are decent people and still treat you well.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Never trust anyone for sure, so glad you kept your house ☺️",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "Were we married to the same man?!",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 28,
                      "content": "Glad you got out of that marriage.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I think it's nice that your \"outlaws\" are still close.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 934,
                  "content": "I wonder if OP knows that, assuming this is a community property country, that his wife indeed does own 50% of that house whether he likes it or not",
                  "id": 22,
                  "comments": [
                    {
                      "score": 170,
                      "content": "I hope so !! She deserves it !",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I’m going to assume the 505 in the throwaway username is an area code. That area code belongs to New Mexico, which according to a Google search is a 50-50 state. \n\nThis whole situation is bizarre and OP is an AH. This isn’t even over a key, it’s over his wife feeling like she isn’t heard or even matters in this relationship",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Even if its not judges aren't stupid. They've seen what he's trying to pull a thousands time over- if it's possible to throw the book at OP they'll throw it at OP. This isn't their first rodeo.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "OP also put only part of what his wife said in quotes. That \"technically\" she contributed by paying rent and daily expenses.\n\nSo she didn't really contribute, only \"technically\" contributed /s\n\nDefinitely YTA, she contributed, maybe not half, but she should be part owner and if it's really that important to you, OP, yall can calculate how much she's already contributed and how much more she needs to contribute until it's 50/50. Then put her name on the deed to the house, too.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "yta   he's a selfish person who seems to nor get what marriage is, in court even if her name isn't on the house the fact they are legally married gives her protection\n\nthis dude should be saving up for a divorce attorney cause I'd have already left and let him enjoy his one story house or whatever",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "This makes me so happy for my marriage. Our financial “fights” are all about trying to be selfless. I want 50/50 split, he demands he pay more because we work the same hours but he makes more money. I don’t have to make up by doing more chores (again, same hours of work). I bought a place and he thinks I should get more casual spending money to pay it off faster even though it’s not in his name.\n\nNow I’m in a good mood just thinking about that :)",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Grifter. All the way.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3777,
              "content": "Holy …..! The wife’s name is not on the house?!!! Oh that’s a deal breaker.",
              "id": 30,
              "comments": [
                {
                  "score": 2327,
                  "content": "It would be for me as well, assuming the house was bought while they were married and there isn’t a *very* unique, *very* compelling reason for the wife to not want her name on the house.\n\nOP hasn’t offered any explanation aside from what’s in the original post so I can only conclude he’s a controlling AH who took advantage of his wife to buy a home in his name alone and is now holding that over her. A real prize, truly.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 1425,
                      "content": "Oh but he \"started saving before he even met her\" so clearly she contributed nothing by covering all the expenses for what sounds like years. /s",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 225,
                      "content": "[deleted]",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 47,
                      "content": "My ex did this. He took advantage of me and my family to get the house in only his name. A year later he tried to divorce me and say that the house was his and not mine. Too bad it was purchased during the marriage. We ended up splitting the profit at sale, despite me contributing the most when we purchased. But by then I didn't want to fight him anymore and I just wanted out.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Hopefully they are in a community property state where it won't matter if her name is on or off, she will still be entitled to half the marital home upon divorce.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Young people in Canada who are buying their first home get special perks when purchasing. If only one person is on the house, you save the other person's perks for a later purchase.\n\nOnly thing I can think of, here.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "That's exactly what he's doing. My husband's name isn't on our house. But it's because he didn't have income (SAHD) so we were told by our mortgage broker it would be better to just be under my name. However, it's just as much his house as mine. My dad has a key, but we decided that together.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Don't worry about the wife. (a) Asset bought during the marriage, (b) for both to live in. That's almost universally a joint asset. In divorce, we spell \"joint\" as \"50-50\".",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "My husband’s father has been talking about giving us a chunk of change toward a downpayment on a house. I somewhat anxiously brought this up to my husband, saying, “Now, even if your dad gave us the whole downpayment, would I still be listed as co-owning the house?” (I grew up in a very abusive home, used to people trying to take advantage of me, got a bit nervous about the conversation).\n\nMy husband looked at me like I was completely insane and said, “Of course your name will be on the house. It’s your house! You’ll be paying half the mortgage and upkeep! Why the hell wouldn’t you co-own the house?!”",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1226,
                  "content": "Glad this is what got everyone else too. OP wife didn’t contribute one bit. Oh she paid all our bills so I could save. What a dick",
                  "id": 40,
                  "comments": [
                    {
                      "score": 325,
                      "content": "In a strange way I hope he keeps putting his foot down about this. The less he compromises hopefully the sooner she leaves him lol\n\nPlease die on this hill OP, cold and alone",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "This reminds me of how when my parents divorced I peeked at papers left on the counter, where he had scribbled “Not bad for living in this house for free!” In the margin. Mind you, my mother had been the one with all the savings and the main child rearer of the house. I have never forgotten that shitty comment and never will.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Beck's old song \"Loser\" comes to mind reading this, surprised she married him tbh",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1187,
                  "content": "Right? I’m HORRIFIED. My mom was a SAHM when we were children, and everything is in my parents’ names. They have equal access to all things financial and managerial. He never makes her feel it isn’t her money; she never makes him feel bad for the years she was a single-parent (for childcare duties, not finances). OP is such a raging, gaping asshole I can’t even reply to him directly.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 948,
                      "content": "As a husband with a SAHW, we share everything 100%. I was even chastised for putting her on my bank account saying we should have sep finances and it's like, if I can't trust this woman with my money what are we doing together raising children?\n\nI will never understand folks that get married to someone, just to remain roommates who occasionally fuck. If you aren't going to be 100% committed, just don't get married.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 625,
                      "content": "My dad was sooo grateful for my mom staying home to raise the four of us. He would just go on and on about what a sacrifice she was making, how much she loved our family and how hard she worked to support everyone. He treated her like an absolute goddess at home, it was so sweet. Even though he brought the money in, he recognized that it was only possible for him to thrive at work because my mom gave up the career she loved to hold down the fort for him...I can't imagine a reality where he would've held his income against her like this.\n\nOP, you need to figure out a way to fix this, and you also need to show your wife the respect and gratitude she deserves. Without her help and support, you wouldn't have the house you BOTH contributed to and BOTH live in now. You're being ridiculously difficult, and at this rate that house really will be all yours soon when she leaves to find a real partner.\n\nDo better, ffs. YTA",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "IKR? I haven't worked outside the home in almost 30 years and my mom still can't understand why it doesn't bother me to not have 'my own' money. I have money, Mom. Sorry that that wasn't the way it worked with you and Dad, but not all marriages are like yours was.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "Yep. Get the wife on the deed.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "My SO saved the vast majority of our deposit for our house as I was paying for the majority of our expenses. If she turned around and told me she only wanted her name on the deed because \"it's her money she saved\" I would be fuming. \n\nThat's not just a deal breaker on buying a house, that's a deal breaker on the entire relationship. I'm cutting my losses and I'm gone.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Depending on where they live it’s possible she will still have right to 50% ownership as it will be considered marital property.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "He's quite the lord of the manor, isn't he? You just know the phrase, \"This is *my* house,\" is one he often puts to use during an argument.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Right? My now husband bought our house when we were engaged with his better credit, his inheritance, and some money from his parents, but my name was put on the deed! And we shared expenses when we lived together up until that point. This is so weird to me",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "This! My name isn't on the mortgage, because we would have had a higher rate. But we were damn sure my name was on the house deed in case something ever happened to him. \n\nIf you were married at the time of purchase, and her name isnt on the deed, red flag 🚩🚩🚩🚩 the size of Mars right there. Poor woman.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 512,
              "content": "[removed]",
              "id": 54,
              "comments": [
                {
                  "score": 33,
                  "content": "Yep, and he's going to hold the \"it's my house, I paid for it\" over her head every chance he gets as a power move regardless of her contributions.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 243,
              "content": "Right, she may not have *directly* contributed to the down payment or closing costs, but she allowed OP to save that money by covering short-term expenses.",
              "id": 56,
              "comments": [
                {
                  "score": 30,
                  "content": "I also suspect that she's now paying him 50% or more of the mortgage payment as \"rent\".",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "My ex-fiancé did this to me - I paid nearly all of our living expenses including his half of the rent so he could put all his income into “house savings” that he always called ours, even if my name wasn’t technically on the account. Biggest mistake of my life. \nHe bought a house when we were on the rocks near the end of our relationship using those savings. His name was on the mortgage only despite all our pre-approval paperwork being in both our names (he went behind my back and had separate paperwork done). Now he has a house and I have absolutely zero savings to my name because I lived paycheck to paycheck for years while he saved money. And zero legal recourse to try to get back my money either because we weren’t married and my name wasn’t on any shared accounts. \n\nI will never, ever trust someone with money like that ever again. Shared accounts or fully split expenses. No in between, someone always gets screwed. \n\nOP, YTA. Your mother doesn’t need a key if your wife doesn’t feel comfortable with that. And she deserves a say in what happens with the house because a) she’s your wife and b) she did help pay for it whether you think so or not.",
              "id": 58,
              "comments": [
                {
                  "score": 13,
                  "content": "I'm so sorry you went through that!! \n\nThis is exactly why women are often so much more reserved and careful about sharing expenses and splitting things 50/50 no matter the income. Because it's so much easier for us to get screwed if we're not looking out for ourselves. Too many dudes only care as long as things are good, as soon as things get rocky all bets are off. \n\nAgain, I'm so sorry you lost all that. It legit makes me really sad for you.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I want to know why it's \"my\" instead of \"our\".",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "Why isn't she on the deed? This is very odd.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "I was thinking the same thing. The wife has a bigger problem than the key here if she was paying the rent so he could save for a house…and now he’s saying that it’s his house (and only in his name). Sheesh. OP…YTA.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": ">And on that note, why is the wife not making a bigger deal out of not having her name on the house? \n\nYes, that surprised me too.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I think he's being obtuse on purpose.",
              "id": 64,
              "comments": [
                {
                  "score": 14,
                  "content": "Weaponized ignorance",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3054,
          "content": "It’s okay she can just divorce him and take him for half of everything since apparently he don’t understand marriage.",
          "id": 66,
          "comments": [
            {
              "score": 1643,
              "content": "And OP doesn’t realize that any property bought during a marriage is half his wife’s anyway if (when) they divorce. It sounds like OP was trying to pull a fast one here on his wife. If I was married to you I would be calling a lawyer to get my name on the deed or divorce your lying butt.",
              "id": 67,
              "comments": [
                {
                  "score": 348,
                  "content": "That depends on the laws of the state.   What the wife could do, is present a statement of her outlays on his behalf while they were living together and ask for payout in lieu of an interest in the house.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 55,
                      "content": "I hope to hell they live in a community property state. She should take her half and go find someone who sees marriage as a partnership, not a damn sponsorship.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "When I divorced in Colorado a few years ago, I got a 50% stake in the house we had bought together 11 years before. I didn't want the house, he did. I asked him to buy me out of my half. It took nine months of pushing him to get him to finally buy me out and take my name off the mortgage. This dungus wanted me to leave my name on the house as long as he lived there and to split the profits 50/50 if he ever chose to sell.      Ummmmm that was a hard fucking pass",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 45,
                  "content": "Exactly! Due to someone appropriating my identity years ago, my credit was in the tank, so only my husband could be on the loan, but I was on the title.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 661,
              "content": "I'm very curious what state he's in... most states are community property if it's purchased during the marriage. He's an absolute fool to think she has no rights to the house, especially if they file for divorce down the road. Even if they are in an equitable distribution state, a judge will see she paid the rent all those years so he could save up and grant her half or a good portion of the home. \n\nBut in regards to your question OP, YTA. It's her house too. All decisions need to be joint. If you keep playing the 'my house' card, she will get tired of it and have the courts prove its not 'your house'.",
              "id": 72,
              "comments": [
                {
                  "score": 44,
                  "content": "Given the way he was writing, it doesn't sound like English is his first language. He could quite literally be in almost any country in the world, so don't assume he's in the US or that his wife has any legal protection.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 62,
                      "content": ">Given the way he was writing, it doesn't sound like English is his first language.\n\nIf only.  Sadly there are lots of Americans who have a poor grasp of the English language - especially when writing it.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "He lives in the state of denial and fantasy. Totally the AH",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My dad tried this and lost.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 901,
          "content": "I just read this and it hit home…this is what my other half is doing to me right now. He put my car in his name but I pay it. Because “oh we’re getting married it doesn’t matter.” But when he gets angry suddenly it’s “his car”, Now the house were looking for I’m putting down the down payment and paying half the mortgage but he wants only his name on it because. “I can’t have you on the deed with a VA loan.” I just realized I bought him a Mercedes’ and am about to buy him a house!! WTF am I DOING WITH MY LIFE!!!",
          "id": 77,
          "comments": [
            {
              "score": 463,
              "content": "Plz don’t buy him the house",
              "id": 78,
              "comments": [
                {
                  "score": 502,
                  "content": "Dear god it’s like my blinders have been ripped off…and the sun hurts.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 252,
                      "content": "Good. Keep those blinders off. Don't buy anything else and insist on couples counseling (non-religious) before even thinking about going through with a wedding.\n\nAlso th VA loan stuff is bullshit. My sister is married to a former military guy and her name is on the damned house.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Timing is everything.  It’s before home purchase.  Good for you.",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "You should look into financial abuse and look into counseling, to be honest. What you've said makes it sound like he's deliberately manipulating you to be dependent on him.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "And PLEASE STOP paying on that car and get another one. Also, pay attention to how he treats you, not just money wise. You might be a place holder until he gets everything he wants. Just a thought.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 215,
              "content": "Keep financial records of all the car payments! Also do not buy a house with this person. Do not mix finances with this person. Your name needs to be on everything you pay for, even if it would disqualify you from a specific type of loan (it shouldn’t) if he wants only his name in the mortgage because of the loan type, sure. You can put anyone you want on the deed to a property.",
              "id": 84,
              "comments": [
                {
                  "score": 48,
                  "content": "So thar was a lie? He can put my name on the deed with a VA loan If we aren’t married?",
                  "id": 85,
                  "comments": [
                    {
                      "score": 63,
                      "content": "I highly suggest you call *A* loan officer who does VA loans or see if you can do a google search. Use duck duck go. It blocks most tracking software and you can \"burn\" your search history and cookies in case your concerned. Get the info straight from the source, but don't call THE loan officer as they might unwittingly tip him off. If he is lying, this will not be good he'll start manipulating. At worst your husband is highly manipulative and abusive, at best he's being an asshole. Protect yourself either way, because you do not want to fuck with a highly manipulative abuser. Never show him all your cards.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "I don’t think having any loan would disqualify you. But you should still be able to be put on the deed even if you’re not on the mortgage.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Yes. Look on the veterans united website. I was able to pull up the answer with a quick Google search. The VA will only \"back\" what's considered his financial liability of the loan. \n\nResearch VA loans with how they work to explain that part.\n\nSounds like you need to save for a car and leave the dude.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I’m not a loan officer, nor a realtor, but from my experience  (4 VA loans, 1 before and 3 after marriage) a VA loan has nothing to do with what’s on the deed. My wife wasn’t on the first house because I didn’t know you could do that. I’m pretty sure she’s on all the rest. The only difference is she signs some of the papers at closing, the loan is with the bank. The deed is with the state.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "The deed and mortgage are not required to be the same.  Like, my husband put me on his deed back before we were married just as a gesture/engagement present.",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "You are most likely being financially abused. This happened to me. I somehow ended up covering so many expenses and my ex would never tell me the truth about what he was making and why he suddenly couldn't pay this bill and I ended up having to put it on my credit card raising my monthly payment. He would frequently push to have us have joint accounts, but he wouldn't be honest with me about his income and status of his account. Everything in my gut said not to. He has committed so much fraud over the years. It goes deeper, this is just a general overview of one of the abuses I experienced. \n\n*Because someone is likely to: I was very young and taken completely advantage of by someone 14 yrs older than me. He love bombed hard and I was the poster child for what happens when you have shitty parents and an abusive and chaotic childhood with no one but yourself providing resiliency. The cards were absolutely stacked against me because that was my normal.\n\nI really hope you take some time to reflect on paterns in your relationship. You do not have to be hit to be abused. Abusers can be very intelligent in how they abuse and not behave like raging hot heads. Society at large teaches us they have to be gun wielding nut jobs who've beaten us black and blue. \n\nThat being said, people can be toxic and not necessarily an abuser. But that takes looking at overall behaviors and with a professional. But what you described does not sound ok.",
              "id": 91,
              "comments": [
                {
                  "score": 69,
                  "content": "Yeah. I have a plan in place. He doesn’t know I’m no longer paying for the house. It’s been hitting me harder and harder mentally. I have purchased a tiny cheap shithole property in a very good neighborhood I plan to fix it up. I purchased a new car that I hide from him but I still make the payments on the old one. I’ve been moving small unnoticeable  things out so far. He smells I’m up to something but doesn’t know what. I was going to post about it in full detail. I might still do that at some point.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 37,
                      "content": "If you need to move something bigger, say that your friend/sister/mother needs it and you're lending it to them. So it's less suspicious. Have some stuff ready in bags, so if one day he isn't home you can move them much faster.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Good for you and I'm sorry you have to experience this. You can do this. It's scary and hard but it is so worth it in the end. Don't give up. \n\nI would caution about giving out plans and any other information. The guys are so fucking tricky. Do not underestimate them. Mine took my daughters house key and used it to get into my apartment to get information about me. I know because he suddenly asked questions about things he didn't know about. I went back to school and got a call from admissions because he had called saying he was my boyfriend and wanted to surprise me by taking the same classes, so could he know my schedule. Thankfully they didn't give it to him. I have a laundry list of things he did and learned he was capable of anything.\n\nBecause I wae young so throughly traumatized I kept showing my cards and giving him ammo. I wouldn't make that mistake now. Get a therapist if you need someone to talk to. It helps to get it off your chest, but that way the info is protected. I don't know how bad your husband is, but if he's anything like mine, learn from my mistakes and gaurd information with everything you have.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Thank fuck this served as a wake up call for you before you ruined your life with this man. Good for you!",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Thats a lie. We have a VA loan, I am on the deed,",
              "id": 96,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Plan an exit strategy. If your name isn't on the loan for the Mercedes, dump it on him/his problem. If it is, contact a lawyer asap. Eitherway your being exploited and need to run for the hills(change all your financial stuff).",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "You can be on the deed with a VA loan, he’s full of crap.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 557,
          "content": "And this is how my ex became my ex. Luckily only wasted 5 years with a man that only looked at his money as just that, his, and mine was for everyone. \n\nAnd YTA. This should have been a conversation before handing out keys. Just because you “paid” doesn’t give the occupants no say in their own privacy.",
          "id": 99,
          "comments": [
            {
              "score": 12,
              "content": "I had a stepdad like that. When (if) he was working he kept every penny for himself and mum’s money was for all of the household expenses etc. Wanker.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "INFO: Does your wife know she’s married to a grifter?",
          "id": 101,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 99,
          "content": "Financial abuse happening here. Taking advantage of the wife. I don't think the key is the real issue here, it is the fact that wife is realizing she has been played.\n\nIn a divorce situation it will count in my understanding that she provided for OP while he saved. So she might still have right to the house.\n\nIf OP was fair they would have wife's name on the house. Now he is using the \"owning\" to make power moves over her.\n\nYTA.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "It looks like OP replied to you but I can’t see it? Do you know what it said?",
          "id": 103,
          "comments": [
            {
              "score": 131,
              "content": "https://www.reveddit.com/y/keyissue_505/?sort=top&all=true&removal_status=all",
              "id": 104,
              "comments": [
                {
                  "score": 60,
                  "content": "The real mother fucking MVP right here.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 110,
              "content": "He thanked me for the response and ask me to point out exactly where he played his wife because even though the name is in his house, he would ndot stop supporting her (?) and that he \"just mentioned that he owns the house to give context\". Also that just because she might have indirectly contributed to the house he doesn't have to listen to her when she ks wrong. That a key is a basically nothing and that she is making a fuss of it.",
              "id": 106,
              "comments": [
                {
                  "score": 37,
                  "content": "Ah thank you he’s a major Asshole I feel bad for his wife she needs to run",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 45,
          "content": ">She screamed at me saying that \"technically\" she did contribute towards the house savings back when she used to pay for our rent and daily expenses while I saved money\n\nShe did contribute to the house, though.  He thinks that HE saved the money for it while she paid the rent and other stuff.  WTF?!?  There is SO much more I want to say but, it would probably be removed.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Hopping on this thread. OP, YTA. If she didn't 'contribute' to this house, pay her **EVERY PENNY** back for the rent she paid so you could happily save. \n\nWhat a red flag. Let me guess, for every argument you have (or a decision she wants to do) you are going to throw the 'its my house' argument at her.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "The only, ONLY acceptable reason for \"him\" buying a house in his name only after they were married would be if she has really bad credit, and buying without her gave them better terms/interest.\n\nBut judging from her ability to support them otherwise, that's unlikely to be the case.  And yeah, she has ABSOLUTELY contributed to their ability to purchase a house.  Even if she didn't, it's a marital asset and she should be on the title anyway, honestly.\n\nAnd even if all the above points weren't the case, it is HER residence as well, and she should get a say in who has access to her personal space.  The fact that OP considers her financial contributions not equal to his, and that his \"sole\" ownership of the house gives him the right to make unilateral decisions is frankly ridiculous.\n\nI am on great terms with a lot of family, that doesn't mean I want them all to have keys to my house on demand.  And when someone ASKS for a key for \"emergencies,\" it makes me wonder what they consider an \"emergency.\"\n\nOP is a multi-faceted AH",
          "id": 110,
          "comments": [
            {
              "score": 17,
              "content": "Even then, she could be on the deed without being on the mortgage.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21981,
      "content": "Yta\n\nShe paid all your expenses while you saved and she's not even on the title to the house? She's right, she did contribute.",
      "id": 112,
      "comments": [
        {
          "score": 7912,
          "content": "This right here!\n\nIf you “saved” by letting your wife pay for rent and expenses, then you did not “save” — you *freeloaded* off your wife so that you could buy a house in your own name. This is not fair to your wife!  How about for the next few years you pay all mortgage and expenses so she can put all her money in a savings and buy her own house. \n\nI will also vote **YTA** on the specific topic you asked for which is giving your mother a key. Assuming your wife also lives in the house she should be consulted before you give the key to anyone.",
          "id": 113,
          "comments": [
            {
              "score": 996,
              "content": "This, since it’s your house… you pay for it. Then you get all the say. Let the wife save all her money and then you get to have the say over your house.",
              "id": 114,
              "comments": [
                {
                  "score": 740,
                  "content": "Seriously, if I was his wife I wouldn't pay a single dime at this point. OP doesn't show his wife any respect in this post *at all*.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 54,
                      "content": "I have a feelz this marriage isn't gonna last\n\nhope she gets the house or leaves IT ALL to you to deal with it, have fun OP, literally everyone on here thinks you are TA,  and hell yes to anonboogers on all that, in fact it would really suck if she started giving keys out to some dudes who are friends or about to be........just cause",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "I don’t get why people like him even get married. It’s so bizarre the way they treat their spouses.",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "Right? If this is HIS house, then HE has to pay for everything. She gets to save all HER money since she has zero stake in the property, and he should be 100% accountable for maintaining HIS property.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "The house is purchased with both their money, since the wife previously covered their rent and living expenses while he saved money for their joint home. Regardless, even if that were not the case, when a married couple buys a house as their family home, it should belong to both of them together. OP, you need to put your wife's name on the title of the house, it will badly damage your marriage if you have the attitude of \" this is my house, not yours, I get to make the decisions\". Put her name on the title of the house. And yes, take back the key from your mother until you both agree on who, if anyone, gets a key to your joint family house and under what conditions.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "People underestimate just how important privacy is. It is mentally exhausting having to constantly worry if someone is just going to walk through your door whenever they feel like it and you can’t do anything about it. Just because historically OP’s mother has been trustworthy doesn’t change the fact that the mother could now just walk into their house. And the wife didn’t even get a say on whether she was okay having her private space violated like that. \n\nAlso, what classifies as an emergency? To some that may mean literally dying. To others that could mean the store was out of sugar and they needed some ASAP. Either way, giving someone complete access to your private home isn’t a decision only one person should be making.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Right?!! They should have BOTH been contributing to rent equally and then saving the same amount together in a fund for the house where both of their names are on the deed. Instead he literally freeloaded and then said MINE all mine when it came to the actual purchase of the home. Such an AH. If I was his wife I’d divorce him and take what was rightfully mine.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": ">How about for the next few years you pay all mortgage and expenses so she can put all her money in a savings and buy her own house.\n\nThis! It's his house. I hope she's not paying a dime towards it.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1959,
          "content": "Yup! Op YTA big time. This should read, my wife supported me financially and paid our rent and expenses so I could put all my\nmoney toward our house. I bought the house, denied her any rights to it bc her supporting me doesn't matter, and now am giving away keys to her home even though she isn't comfortable with it.",
          "id": 123,
          "comments": [
            {
              "score": 294,
              "content": "“I also didn’t realize that since I bought the house while married, half the house legally belongs to wife anyway, oops”  \n\n...unless Op lives somewhere where these laws don’t apply, I really don’t know what he’s going on about",
              "id": 124,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 562,
          "content": "Even if she isn’t on the house, you bought it as a married couple. Most states make that a martial asset and she’s at least part owner of that asset. She contributed, you just refuse to see it. Even if she didn’t, it’s still BOTH of y’all’s home and she gets a say simply by being your wife. \n\nYTA infinite times over for not discussing this with her first, for claiming it’s YOUR home and for playing her so that you could be the one that the money came from for the house. Also, your wife should be on that title. Period.",
          "id": 125,
          "comments": [
            {
              "score": 48,
              "content": "It doesn't even matter if she is on the title, in most places it's half hers.",
              "id": 126,
              "comments": [
                {
                  "score": 40,
                  "content": "Oh I know. I just think it’s the principle of the thing. That’s your wife, dude… put her on the title!",
                  "id": 127,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Oh, 100%. This isn't how to be a good partner. If you don't want to share your life, don't get married. At best, it's selfish and controlling, at worst it's financial abuse.",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Agreed YTA. \n\nBut WHY did they get married? Like the entire point of marriage is combining assets and building a life together. It’s literally a legal ceremony saying “we’re a a single family unit to be treated as such by the government”. It sounds like his wife was under the rightful impression that they were working together for marital property and then at the end, he swerved her. Like I’m team prenup, 100% protect your original assets and define terms and conditions for what happens to marital property. But this guy, it seems like he never even bothered looking at what he was signing when he got married, much less considering it’s future impacts. It’s not his house, it’s THEIR house and if she ever divorced him, he’s going to find that out very fast.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "**Right?!?** This guy is a joooooke! Good gravy, YTA OP, did you really type this out with a straight face??",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14715,
      "content": "Info: if she paid all the rent while you were saving, why isn't her name on the deed?",
      "id": 131,
      "comments": [
        {
          "score": 15741,
          "content": "It’s called [financial abuse](https://www.womenslaw.org/about-abuse/forms-abuse/financial-abuse/all) and it’s a common tactic used by narcissistic assholes to maintain power in their relationship.",
          "id": 132,
          "comments": [
            {
              "score": 8367,
              "content": "Came here to say this. For him to have sole ownership over the home, despite her paying for their rent and daily expenses while he “saved money” is his way of having full control over their living circumstances today. \n\nWould he have been able to save for the home if she wasn’t covering their rent and living expenses? Would she have been able to contribute to the down payment if she weren’t covering all these costs?\n\nThere’s a lot of crucial details OP isn’t giving, but from this info alone it makes him look greedy at best and abusive and controlling at worst",
              "id": 133,
              "comments": [
                {
                  "score": 1885,
                  "content": "Yes but it doesn't work that way. If they divorce, he's still going to have to buy her out of the house. \n\nSource: my divorce. Poor ex  hubby was so upset his little trick didn't work. He had to go to a 30 year mortgage to pay me off!! The horror....",
                  "id": 134,
                  "comments": [
                    {
                      "score": 943,
                      "content": "Yup, he took preexisting assets (his savings before they were married), mixed them with shared assets (money saved as a couple), and created a 100% shared asset.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 218,
                      "content": "That's delicious. Could you maybe tell us more?",
                      "id": 136,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 36,
                      "content": "I’m glad it worked out that way for you! Here’s hoping that OPs wife gets similar outcome",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Yes. There are separate asset states where you can declare separate assets prior to getting married. But even in those states, buying a house to live in explicitly converts the home to a joint property. \n\nOP just doesn't know it yet! Shhhh! Bwahahaha!\n\nIf OP was in a separate property state AND legally kept his property separate AND bought and used the home strickly as an investment that the couple didn't use AND the wife didn't help clean/manage/rent that property unless explicitly compensated for that work, THEN it would still be separate property. YTA OP, and not only that, your wife already owns 50% of dat ass ets.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "My ex did it the other way. I had good credit and he didn’t so my name was on the house and actually everything else including the cars. I was in my 20’s so I could not have paid for everything if we split up. Made even worse when the market dropped and couldn’t have sold the house without a loss. I felt so stuck because he would have absolutely let me take the hit to my credit by walking away. At one point we flipped a house and after it didn’t sell right away he actually tried to convince me to let it get foreclosed on. The way he trapped me became crystal clear when I got a new job with a significant salary increase. He tried to convince me to quit or not take my job because he suddenly wanted to move out of state. I am happily away from him now and actually got to focus on my career without him deciding 20 other projects I had to take on b/c he decided on a whim.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "You pay the rent electricity food and I pay for the furniture and the saving.  So if we split everything is mine and you have nothing.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 947,
          "content": "Exactly what I wondered.  I'm also wondering if wife always assumed that OP will treat her fairly and do right by her.  I'm wondering if she's starting to realize that OP regards her rather poorly.",
          "id": 141,
          "comments": [
            {
              "score": 205,
              "content": "Yeah, she should know better. Men who get their wives to pay everything and put their own careers on hold end up getting screwed once their husbands become successful. Fuckers “trade up,” leaving the woman destitute. This asshole used her so he could save, gives his mother access - weirdly Oedipal - and then doesn’t understand why he’s the asshole? Bullshit. He knows, he was hoping for validation. I’m sure he got a couple, because men, but he’s a pig",
              "id": 142,
              "comments": [
                {
                  "score": 18,
                  "content": "Unfortunately victims of any sort of domestic abuse don’t always know better, because their partner seems like a nice enough person at first, until they spot an opportunity where their victim is vulnerable and unable to leave. That’s why cases of domestic abuse happen more often when the couple first move in, when they get married, or when they get children. In all of those cases it is much harder to leave, and that’s when they show their true colors.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "That’s exactly what this is. This isn’t about his mom or a key. OP even says himself that wife and mom are on great terms. It’s about the fact that she’s never included in any decision making because, by the sounds of it, he doesn’t even like her very much.\n\nYTA, obviously.",
              "id": 144,
              "comments": [
                {
                  "score": 23,
                  "content": "“They’re on near perfect terms.” Something in the telling of the rest of the story makes me sincerely doubt this.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 535,
          "content": "What I'm seeing is that OP used a technicality to fuck his wife, and not in the good way",
          "id": 146,
          "comments": [
            {
              "score": 39,
              "content": "Based on how he acts I don’t think he’s ever fucked his wife in the good way either",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Legally it is still half hers when they divorce.",
              "id": 148,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 534,
          "content": "You already know he’s gunna make his wife pay for most of the home expenses too so he can “save for emergencies”",
          "id": 149,
          "comments": [
            {
              "score": 51,
              "content": "And then buy himself shiny new cars every few years.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "He probably making her pay rent and using the money to pay the mortgagee.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 527,
          "content": "Who buys a house and doesn't put their wife's name on the title??",
          "id": 152,
          "comments": [
            {
              "score": 255,
              "content": "Especially since he wouldn't have been able to buy the house without her, as she was covering rent and necessities for months, probably years.",
              "id": 153,
              "comments": [
                {
                  "score": 99,
                  "content": "It's like homie forgot they were a family.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Seriously, even if they were a single-income household that would be bizarre IMO. But when she covered all the household expenses at their old place? How does that make any sense??",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 135,
          "content": "Yeah what the hell?",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "Financial abuse.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Another info: maybe others can also clarify: we have always kept a copy of the apartment/house key with my partner's parents and also one with my parents. They would never in a million years enter the house on their own if we didn't ask for it. Even if we invite them over etc. The key is only for emergency. This is a totally normal behaviour in Germany. Is it different in the states? Because otherwise I don't get why the wife is apparently upset about the key, as she has a good relationship with her MIL, but not rather upset about OP stating she contributed nothing to the house.",
          "id": 158,
          "comments": [
            {
              "score": 81,
              "content": "American here.  No, it's normal for other people to have a key to your house in case of an emergency - and to only use it for an emergency.\n\nThe only thing that struck me as weird was the mother asked for it.  In my experience, it's usually the homeowner who offers the key to someone \"in case of an emergency.\"  People don't usually ask for keys.",
              "id": 159,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "It's normal when you discuss it with your partner first. I don't think the point is whether the wife has a good relationship with the in-laws or not, it's more about giving access to the home without discussing it first. Personally that would upset me as well.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "If I had to speculate, my guess is that MIL has demonstrated some boundary-breaking behavior before and OP is omitting it because he knows it would make him look bad. Who cares if she's a \"very trusted member in the family\"? That phrasing is weird as hell. Him saying that makes me think that his wife has been browbeaten into playing nice with his mother because it's a battle she won't win and he's taken that as them having a perfect relationship.\n\nIt seems like there's a lot of info missing here. Would love to hear the wife's side of the story.",
              "id": 161,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10547,
      "content": "YTA.\n\nYour attitude of 'I paid for it' isn't on. You're married; it's 'our home' not 'my home' now. In any case, your wife is right, she absolutely has financially contributed to the property. She paid the rent which allowed you to save. Pretty disgusting of you to dismiss this.\n\nYour mother having a key to your home is a big deal and something you and your wife both need to be comfortable with. If you aren't mature enough to make joint decisions with your wife, you shouldn't be married. I think your wife is right; you don't seem to respect her at all. \n\nHuge red flag that you only put the house in your name. You've basically used your wife to enable you to do what you want.",
      "id": 162,
      "comments": [
        {
          "score": 936,
          "content": "Everything about this is SPOT ON and i hope OP sees!!!!",
          "id": 163,
          "comments": [
            {
              "score": 266,
              "content": "Oh he'll see this alright. It's just unfortunate that his wife never will.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "I hope OP's WIFE sees it",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I hope the wife sees it too.\n\nProbably the reason the wife and mom get along is because mom is relieved to finally get him out of her basement",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 557,
          "content": "And it's like... *even if* the edit is true and your wife *really is* on good terms with your mom, you know what strains terms really quickly for a lot of people OP? Someone else having unfettered, easily abused access to their home!",
          "id": 167,
          "comments": [
            {
              "score": 41,
              "content": "yes, how to make sure their relationship deteriorates, turn it into a power struggle by choosing mother's wishes over wife.",
              "id": 168,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I mean, mom is kind of an asshole too. I would never say to my child. Hey give me a spare key you know just in case. That's for them to say they might have somebody they want that lives closer. Who knows. Not for me to say.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "He's not married. He just owns a wife. \n\nYTA.",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "I suspect that his mother has been talking about it a \"his\" home all along and doesn't consider her DIL as an equal partner.   Neither one realizes that if his wife were to divorce him today, she could present a bill for one-half of their joint living expenses to be deducted from \"his\" down-payment.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I’d like to point out that even if she *hadn’t* contributed financially to the home, she would STILL deserve input about who has a key, as she LIVES THERE and all of her personal belongings live there, too. OP’s attitude is absolute shit. “This is mine, not ours, so I call all the shots.” That’s not how marriage works, dude. That’s not even how a friendship works. Heck — even if she were a roommate you had no personal relationship with, she’d deserve more consideration and respect. I’d suggest couples counseling, but I suspect what’s really needed here is a large head-shaped pair of pliers.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8910,
      "content": "Anybody thinking of making financial sacrifices to enable their partner to buy a home in their name only? Read this and think again.\n\nYour wife sacrificed her earnings to enable you to save to buy a house, which despite the fact that if she hadn't done so you wouldn't have a house, you clearly think of as just yours. Your whole tone is that she has no rights and should thank her lucky stars that, despite her contribution, you even let her through the front door and you seriously wonder if MAYBE you are an asshole? Let me remove all doubt - YTA.",
      "id": 173,
      "comments": [
        {
          "score": 1667,
          "content": "I made financial sacrifices for an ex when it wasn't even about a house and when he left me I was basically destitute while he was fine, because I was taking a real leap of faith and he had parents with money to cushion him. He admitted he let me make said sacrifices knowing he didn't love me anymore. He told me he realized that \"you were doing it for us, and I was doing it for me.\" \n\nOP, your wife was making sacrifices for \"us\" while you were saving money for a house for you. YTA.\n\nAlso, my ex and I couldn't decide who got a key to our place, so we compromised. Lock box with changeable combination in the mailbox, and then we could give people access as needed and change the combination after.",
          "id": 174,
          "comments": [
            {
              "score": 530,
              "content": "I was engaged(both women) and she let me quit my job, sell my house and finance her and her kids move across the country for her new job because she was getting relocation reimbursement. Purchased new furniture for the whole house. 3 weeks later, The day the living room furniture got delivered, she dumped me via text while I was at the house alone.  \nLucky for me I kept receipts(literally) and plenty of messages for a judge to see things my way.\nFunny enough her F*ck around and find out attitude cost her a few thousand cause I had agreed to just accept whatever she got back in reimbursement but ended up with more from court.",
              "id": 175,
              "comments": [
                {
                  "score": 258,
                  "content": "I work for a family law firm that primarily handles divorces and prenups and honestly I thought I couldn't be shocked by people's bad behaviour, but every day is a new adventure in how poorly people can treat their partners. And it's true, I notice that the courts are considerably friendlier to people when they're not the one causing trouble or drawing things out. I watched one of my lawyers on a zoom with opposing counsel and a judge and opco had been drawing things out while we were just telling the judge we'd accept their decision, and the judge went OFF on the other side. I'm amazed that lawyer didn't burst into flames with how hard the judge went in.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 192,
                      "content": "This is exactly what I kept telling my uncle from the day he asked for his divorce: You do not want to be the one that the judge thinks is being a jerk; you want to look like the reasonable adult in the situation. Don't ask for things just to piss her off. Don't say *anything* to her directly unless instructed to do so. Don't glare from across the room, smirk, or in any other way give the judge a reason to see you as the AH in the room. If she's dumb enough to put her foot in it, don't respond/react. Save the impulse to gloat/argue/express whatever feelings for after things are finalized.\n\n(My uncle was definitely being an AH about everything before I talked sense to him. She cheated with one of his friends, so I understand the impulse, but it wasn't reflecting well on him.)\n\nI actually rewrote several items on his asset division proposal, too ... e.g. \"box of antique oil lamps\" became \"box of *my dad's* antique oil lamps\" because they had all been gifted by or inherited from his father. The optics look pretty bad insisting on a box of lamps worth less than $750, even if you're a collector, but given the truthful framework that they came from his Dad? It looks less unreasonable.\n\nI also told him several times that his lawyer was a lazy idiot and he should be lawyer-shopping, but he didn't listen to me on that one. (I'm pretty sure chose his by looking up divorce lawyers and picking the first male name in a convenient location.)\n\nIANAL, nor have I ever been trained/worked in anything law-adjacent, but trying not to irritate the judge who will be deciding things that will affect your life going forward just seems like a no-brainer. Divorce court, civil court, criminal court, hell, traffic court ... don't piss off the judge.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Similar happened to me. Married to a pilot just starting at a big company. The deal was I supported us (pilots make shit in their first few years until they make captain) for about 2 or 3 years until he made captain. After, he would support us while I went back to school for my graduate degree. He left me 2 days after he made captain, and I had held up my end of the bargain already. \n\nTook 6 years after we divorced for me to finally be able to get back to school.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Holy shit, your ex is an evil shit weasel.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 254,
          "content": "I don't understand how they can be *married* and he doesn't consider the house to be both of theirs? Like I literally can't wrap my brain around it, what even does marriage mean to people like OP?",
          "id": 180,
          "comments": [
            {
              "score": 48,
              "content": "Luckily most states in the US recognize that martial assets are half when it comes to a divorce, despite whose name is on the account.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "\"What's yours is mine, and what's mine is mine!\"",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "This exactly, I hope the wife leaves him",
          "id": 183,
          "comments": [
            {
              "score": 14,
              "content": "I super hope wife finds this on reddit, sees all our posts, realises she's way too good to put up with this, takes him to court, and gets half of his precious little house.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Next post from OP is gonna be “AITA for being upset my wife won’t contribute to expenses for the house?” And all of a sudden it’ll be OUR house, but not enough hers that she gets a say in anything. 🙄",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4050,
      "content": "YTA for leeching off of your wife and giving her no rights to the home she enabled you to save for. Do you even like her?",
      "id": 186,
      "comments": [
        {
          "score": 638,
          "content": "Wondering this too. He seems to show in his actions he doesn't like her or love her. I hope she finds someone else. That poor woman. 🥺",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 315,
          "content": "_\"She used to pay for our rent and daily expenses while I saved money.\"_\n\nHard YTA. I feel for this woman. She has a spouse who doesn't respect her, and if she paid all of their bills while letting OP put all of his money into saving for a house that her name is not on, she is a fool. \n\nI wonder how long she paid their bills and how much those bills were. Because, 50% of that was her direct contribution to this home. I also wonder if she would have any legal protection since this home was purchased after they were married.",
          "id": 188,
          "comments": [
            {
              "score": 27,
              "content": "It's not even mention... Oh wait... Let's. There is literally zero reason to keep your wife's name off of the house. If he dies she immediately she has to do nothing. She owns the house. Her name is on the house already. And yes she would eventually get the house but she'd have to go through probate and tick around with all that just to get her name on her house. Who wants to put their spouse through that?",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 250,
          "content": "This is the most important question. Does he even like his wife.",
          "id": 190,
          "comments": [
            {
              "score": 23,
              "content": "He likes her...when she listens to him and knows her place. Also never as much as mommy",
              "id": 191,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "Wait a minute now, i'm sure he used her for sex too. It wasn't just free housing.",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "[removed]",
          "id": 193,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2964,
      "content": "YTA. Gotta love how you started with \"I paid for it and my wife did not\" while you were able to save for it only because your wife paid other expenses and maintained both of you. So it is her house as well. She basically made this purchase possible. It should have been a mutual agreement on who gets any extra keys of the house. You're a massive AH.",
      "id": 194,
      "comments": [
        {
          "score": 432,
          "content": "Literally. I feel as though we should start counting the number of posts per day where a married man’s mother comes into play. OP, cut the umbilical cord. Would you like it if your mother in law had a key to your house? That’s the only fair reasoning I see here. Either you give a copy to your MIL, or take the copy from your own mother. If you feel that your house is yours only I don’t think you should’ve gotten married. You’re sharing the space with someone you married, like maybe just …divorce and marry your mom and have her move in?\n\nBtw. YTA.",
          "id": 195,
          "comments": [
            {
              "score": 15,
              "content": "This one, the mother part isn't the actual issue. My mom has a key to our house and it isn't an issue. I was almost on his side with the key not being an issue until his immediate response was the \"it's my house.\" It seemed odd that the wife would be that worried about it but given his response there has to be more to this story.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "She financially contributed to the purchase of the house, and they are married. There are very few places in the western world where the law agrees with OP that this is only his house.",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1587,
      "content": "INFO: \nAre you fucking kidding?",
      "id": 198,
      "comments": [
        {
          "score": 155,
          "content": "If I had any awards, they’d all have your name on them",
          "id": 199,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 50,
          "content": "Lmfao I spat my drink a little.",
          "id": 200,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "Yeah, brilliant! If this post is fake, we'd all feel better about the planet.",
          "id": 201,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1516,
      "content": "YTA - so you wife paid the rent while your income went into savings, and you don’t consider that contributing towards saving for the house? That’s a wild technicality. Stop acting like this is only your house. It isn’t and that’s the fast track to a divorce.",
      "id": 202,
      "comments": [
        {
          "score": 338,
          "content": "A divorce where the wife will get half the house.",
          "id": 203,
          "comments": [
            {
              "score": 40,
              "content": "on the bright side, the OP (OP: still, YTA) will get his mom",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 53,
          "content": "Rent AND daily expenses. This woman sounds like she was a fool in love, while OP was a user..... I hope she has some legal protection since the hosue was purchased after they were married....",
          "id": 205,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1369,
      "content": "Wait a minute.. your wife DID help pay for the house.. by paying expenses while YOU saved for the house. Marriage is a two way street and I can’t believe that you think she didn’t help. You need to give credit where credit’s due here and why in the world wouldn’t you put her name on the house too? What if you suddenly die? You’re not protecting your family!!! \n\nIt’s ok that she feels uncomfortable by your mom having a key as mom could walk in any old time and there’s privacy issues here! \n\nI feel you should have asked your wife first and explained why you felt mom should have a key and also made it known to mom if she has a key she’s to call before coming over to make sure it’s ok instead of barging in. I get a emergency but still.. your other reasoning sucks. \n\nYTA",
      "id": 206,
      "comments": [
        {
          "score": 260,
          "content": "I have no idea how he got away with not putting her name on the house. I was a SAHM during the time we bought our house and never was it a question wether my name would go on the title or not. In fact I’m pretty sure the broker mentioned it as something that we should do. We’re a family and it’s the family home. This guy is not just YTA but you’re right he’s not protecting the family by being petty and not putting his wife’s name on the title. \n\nI wonder if legally it’s half her house anyway because they’re married and it was (I assume) purchased while they are married. If he’s trying to be selfish with the house, it may not even work. \n\nAll this and I haven’t even gotten to the part where he gives his mom a key despite it making his wife uncomfortable. There are plenty of ways mom can get in “in an emergency” like giving her the garage code, or hiding a key in a lock box, getting a keypad lock, etc.",
          "id": 207,
          "comments": [
            {
              "score": 13,
              "content": "> I was a SAHM during the time\n\nMy household is one income and we make sure that SAHM has a full credit report / rating even without income, _just in case_. Her car and its loan _is 100% in her name_. My name isn't on any paperwork; in fact my credit report was locked so the stealership wouldn't even take a joint check as a down payment because they \"didn't trust me.\" 😂\n\nThis is something that was driven into my head by my mother, who did home health care for a bunch of elderly women who outlived their husbands by decades and were legally only ever \"just\" Mrs. So-and-so with not a damned thing in their own name. Meaning that our modern interconnected financial systems treated them as _nothing_.",
              "id": 208,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "I don't even care if she paid or not, they're married and she lives there. Regardless of pay, giving out keys should be a joint decision",
          "id": 209,
          "comments": [
            {
              "score": 13,
              "content": "Agree",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Upside is that the house was purchased while they were married, so hopefully it becomes communal property for the likely, if not inevitable, divorce.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}