{
  "post content": "This is literally really stupid but she's really upset about it. So my (48) daughter (23) has a blue tongue skink who she heavily adores. She jokingly refers to it as her daughter, I've found it weird but she says it's because it's the closest thing she'd have to a child and she feels a strong emotional bond similar to a child. She has decided to remain child free for multiple reasons and I have been very supportive of this decision.\n\nWell she recently took her Skink to the vet for a checkup and she was excited to find out her Skinks gender. Afterwards I got a text asking if I'd come to her gender reveal party she was having. She explained it was just a small get together with cake and food for her friends she hasn't seen in a while with the gender reveal being mostly a joke (and a way to make fun of real gender reveals).\n\nWell I didn't come. I didn't see a point. It's just a lizard and I'm a busy person. She later called me and expressed she was kind of sad I didn't come cuz it'd been a while since I'd seen her but she understood I was busy. I told her she couldn't actually expect me to come to a gender reveal for a lizard. She said that it wasn't a real gender reveal, that was more of a joke and it was really just a small gathering to catch up with everyone. I told her if that was the case she should've just called it a gathering because I'm not coming to a gender reveal unless it's for a real grand daughter.\n\nShe got quiet for a minute and then turned my words around, claiming I wasn't supportive of her decision to be childfree. I told her she can't possibly expect me to treat a lizard as a grand daughter, she said she didn't expect me too but it was clear I didn't respect her bond with her lizard and her decision, and she just wanted to see me and my reason for coming was hurtful. I told her she was being ridiculous over a lizard, she claimed it wasn't over the lizard and it was a gathering and not even centered around the lizard, but I stick by to what I said. It's ridiculous to have a gender reveal for a lizard.\n\nShe hung up and I got a message from her best friend about how I'm an asshole for treating her that way, but I don't think I'm the asshole for not wanting to go to a party for a lizard?  \n\n\nEDIT: In the time I was away I got many replies and it was a lot to read through. Let me clear a couple things up.\n\n1. My issue is that she said the party was a gender reveal, if she had called it just a party I would have come. But calling it a gender reveal makes it sound like it's for the lizard, and I'm not going to that even if it is a \"joke\". \n2. I don't know why it matters but the Skink is a girl which is why I said \"I'm not coming to a gender reveal unless it's for a real grand daughter.\" \n3. Even though I don't agree with my daughter for being childfree, I have been supportive and only shown mild frustration. The reasons she decided to be childfree is she claims she's asexual, she just doesn't want one, she has emotional baggage and feels unable to care for a real child, she fears pregnancy, and she has a carrier gene like me and \"doesn't want to go through what I did\" (I had 4 miscarriages and a highly defect child that died after 3 months due to the gene). Yes there has been slight tension between us because I think she just hasn't found the right man (she never dated growing up) and her other fears are unnecessarily exaggerated, but it's ultimately her decision and I don't resent her.\n4. We haven't seen each other in three months. I'm a single mother and we have always been close which is why she invited me with her friends, I just didn't want to go to a party with a lizard, and if it wasn't for the lizard she should've called it a party instead of a gender reveal.",
  "id": 1,
  "comments": [
    {
      "score": 54186,
      "content": "YTA. That’s your grandlizard.\n\nETA it was obviously not just about the gender reveal and your daughter wanted to see you.",
      "id": 2,
      "comments": [
        {
          "score": 7734,
          "content": "So wait...\n\n\"*Afterwards I got a text asking if I'd come to her gender reveal party she was having. She explained it was just a small get together with cake and food for her friends she hasn't seen in a while with the gender reveal being mostly a joke (and a way to make fun of real gender reveals).*\"\n\nbut two paragraphs later:\n\n\" *I told her she couldn't actually expect me to come to a gender reveal for a lizard. She said that it wasn't a real gender reveal, that was more of a joke and it was really just a small gathering to catch up with everyone. I told her if that was the case she should've just called it a gathering because I'm not coming to a gender reveal unless it's for a real grand daughter.*\"\n\nYou just told on yourself, OP. She had already told you it was a joke, and you refused to go out of spite because she won't have kids. Then you had the gall to fucking gaslight her.\n\nIn fact, she told you **twice** that the party wasn't actually for the lizard, but to the very end of your post, you keep saying it was for the lizard.",
          "id": 3,
          "comments": [
            {
              "score": 2980,
              "content": "Yep. She is completely bitter that her daughter isn't going to \"give\" her grandkids.",
              "id": 4,
              "comments": [
                {
                  "score": 1621,
                  "content": "Pretty sure at this point that the reason the daughter doesn't want kids is because she was treated so shabbily as one.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 790,
                      "content": "I was wondering about this as well, breaking the chain of generational trauma and bad parenting is part of why im permanently child free.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 61,
                      "content": "This, 100%, plus the SERIOUS GENETIC CONDITION THEY CARRY HOLY SHIT! I love how OP lists all these reasons like “she just doesn’t want to” and then casually drops in the fatal fucking genetic disorder they carry that basically makes producing children a ticking time bomb of pain and loss!!??? Like…isn’t that the reason you lead with and WHY ISN’T THAT ENOUGH for OP!!??",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "or maybe it's because she's ace. Why does everyone ignore this, where is the respect.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "OP says daughter \"claims to be asexual\" which tells me all I need to know about OP. She definitely doesn't treat her kid right.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "God, have you seen the edits? Daughter is apparently asexual but OP is convinced she just hasn’t met the right man yet. Also there’s a bunch of health concerns that the daughter doesn’t want to have to worry about or pass on to potential kids. But OP swears she doesn’t resent her 🙄",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This post reminded me of my mother. I stopped talking to her years ago.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I hate this grandparental obsession with being owed grandchildren. It really pisses me off.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Don’t forget “I’ve been supportive and only shown mild frustration.” So… you’ve not been supportive then.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "But didn't you read that the daughter 'claims' she's asexual and op doesn't resent her, honest 🙄 The whole post is dripping with condescension and disdain, what an awful woman.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Read edit 3 by OP. Daughter doesn’t want to have children due to carrier gene, etc.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 22,
                      "content": "OMG then OP contradicts herself multiple times. She's been supportive, but shown \"mild frustration\". Thinks her daughter's fears are exaggerated but \"doesn't resent her\". Man, she gave basically every bingo a childfree person can get all in that one paragraph. Hasn't found the right man...*eyeroll*",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "What also really bothers me is the phrase \"she claims to be asexual[...]she just hasn't found the right man. \n\nYTA OP",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1328,
              "content": "I thought the same… ‘very supportive’ of her choice to be childfree, my arse.",
              "id": 18,
              "comments": [
                {
                  "score": 4304,
                  "content": "and OP says: then she CLAIMS she's asexual \n\nand later OP says: I think she just hasn't met the right guy yet. \n\nOP in no way believes or supports her daughter. she only claims to. but through her words and attitude, it's clear OP does not support any of her daughters decisions",
                  "id": 19,
                  "comments": [
                    {
                      "score": 1482,
                      "content": "That part blew my mind. \n\nHaving the *audacity* to not accept her daughter's sexuality and keep the expectation that she will turn into the *opposite* of who she is now (an asexual daughter that does not want to be with a man vs dating/marrying a man and then having a child)\n\nIf the daughter is ace, she is not magically going to turn into someone else. It's fucked up to not accept your adult child for who they are.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1211,
                      "content": "I just want to say, as an asexual, childfree, twenty-something woman who owns a blue-tongue skink (two, actually, [proof](https://www.reddit.com/r/reptiles/comments/boeeqe/one_of_my_blueys_chupa_chup_showing_off_his_blep) ), and never dated growing up with a mother who thinks I \"just haven't met the right man yet,\"  WHOO BOY did reading this post give me some whiplash. And some flashbacks.\n\nAnd more of a reason to call OP YTA because _holy shit you do NOT want to be like my mother._ I feel for this girl, I really do; I wish I had a way to contact her because we could be asexual skink mums together LOL.\n\nEDIT: [More bluey tax](https://imgur.com/gallery/jzO3hOS) and here's [bluey numero deux](https://imgur.com/gallery/wSlzOFj)",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Totally agree with this.  She says \"her daughter just doesn't want\" a kid.  End of story, that person doesn't need a kid and shouldn't be pressured.  And it hurt my heart that a mom wouldn't want to see her daughter who so obviously wants to spend time with her because she's \"busy\".  OP has hurt her daughter in a way that won't be forgotten.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "Op sounds so dismissive of her daughter's choices. They should be a lady dr.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "OP only got worse in my eyes after seeing that edit, that is one of the most common and disrespectful things asexual people have to put up with hearing.\n\nEdit - also OP is STILL hiding behind the \"if it was a joke she should have just said it was a gathering\" excuse when their own story very clearly states the daughter was upfront in it actually being a gathering from the start. It's called having fun.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "That part literally made me seethe. This entire post should just say “AITA for being bitter I won’t have grandkids I’m not entitled to have?”",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "That pissed me off.\n\nNo OP if your daughter says she is asexual, then she is asexual.\nDo you support anything your does believes in??? YTA entirely",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "As if deciding not to have kids is hardship... She definitely does not like that",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 632,
              "content": "This is what I was thinking, as well. Seems pretty obvious the party wasn't ACTUALLY for the lizard. OP is just mad she called it a gender reveal, since there is no child involved.\n\nSeems like she was right about you not respecting her choice to be child free. Since you said, \"*I won't go to a gender reveal unless it's for a real grandchild.*\"\n\nYTA",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 341,
              "content": "Yeah, after it was clear that the 'gender reveal' was just a fun pretext for seeing human faces she loves, you became a true blue AH for continuing to be pedantic and petty about it just to punish her for not using her uterus as your dream factory.  Get. Over. Your. Damned. Self. OP.",
              "id": 29,
              "comments": [
                {
                  "score": 35,
                  "content": "The point here about punishment is so spot on.\n\nThe whole story reeks of pedantic spite and condescension. What an unnecessarily mean attitude to take as a mother about a party. You haven't seen your daughter for three months. Most mothers would be delighted to be invited to ANY social gathering but she deliberately withholds because what? Who gets this worked up about a fucking lizard?",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "Yup, that's exactly what I thought when I read \"_real_ granddaughter\". I can't even imagine what else this could mean.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Yup, and OP's edit makes it even more clear. She refuses to accept it when her adult daughter tells her that she's asexual, because \"she just hasn't found the right man yet\" 🙄\n\nOP is acting like a petulant child who isn't getting her way. She needs to grow up and accept her daughter for who she is. Before it's too late and she pushes her out of her life completely.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "also in her edits she explains there is tension because her daughter \"hasn't found the right man yet\" but right above that said she's asexual..? \n\nYTA for not going to see your daughter, but mostly for failing to understand why your daughter is childfree. do you even know what asexual means? if you do, you need to find a way to let go of the expectation of her finding a partner or having children. it's also really telling that you say she has trauma around that.. I wonder where she got that from. (it's you). \n\nalso, she sounds really fucking smart to me. you admit you had so many problems trying to get pregnant and that was probably very difficult. I completely understand why someone wouldn't want to pop it themselves through that. \n\ngo to therapy, OP.",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "OP is horrible",
              "id": 34,
              "comments": [
                {
                  "score": 23,
                  "content": "You also clearly want a human grandchild and that’s the real reason you’re doing this..ewww. Fucking ewww. If someone doesn’t want to have a kid and godforbid doesn’t want to give you a grand baby deal with it.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "OP's edit made that pretty clear too.\n\n*\"Even though I don't agree with my daughter for being childfree, I have been supportive and only shown mild frustration.\"*\n\n*\"Yes there has been slight tension between us because I think she just hasn't found the right man\"*\n\nPretty clear that OP doesn't respect their daughter's choice to be childfree. OP, you make decisions for your own life, your daughter makes decisions for her life. Get over it. Love your daughter for whatever she wants to do with her life, or she's going to want you out of hers.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "IT's like the \"missing missing reasons\"\n\nWhere they just refuse to listen to what their children tell them and then act like nobody ever told them.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7467,
          "content": "[deleted]",
          "id": 38,
          "comments": [
            {
              "score": 14711,
              "content": "[removed]",
              "id": 39,
              "comments": [
                {
                  "score": 3727,
                  "content": "Eddie Lizzard.\n\nEdited to remove the UK reference, delighted to find out she's reached you all.\n\n\n\n\nShe's still ours though, you can't have her.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 1074,
                      "content": "UK not needed. Eddie Izzard is funny as hell and loved her in Treasure Island!\n\nEdited for pronouns",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "They can offer cake or death at any birthdays.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Eddie Izzard is a damn legend in and out of the UK",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 116,
                  "content": "Genius",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 835,
              "content": "I was eating while reading this and laughed hard and the rice went up my wind pipe and it hurt bad. Y ta for that.  Have an upvote!",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 215,
              "content": "OMG *dead laughing*.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2828,
          "content": "I'm disappointed we still don't know if her grandlizard is a boy or girl.",
          "id": 47,
          "comments": [
            {
              "score": 2225,
              "content": "OP is an even *bigger* asshole for not telling us this.",
              "id": 48,
              "comments": [
                {
                  "score": 735,
                  "content": "let's go with the lizard is non binary for now.  As long as they are a happy lizard we're behind them",
                  "id": 49,
                  "comments": [
                    {
                      "score": 413,
                      "content": "Happy non-binary lizard with a large Reddit family who loves them",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1233,
              "content": "My water dragon is named Wallace.   One day,  I  found eggs in the tank (the only lizard in the hose).  Wallace turned out to be Wanda.  She identifies as Wallace tho.",
              "id": 51,
              "comments": [
                {
                  "score": 730,
                  "content": "Thank you for respecting your water dragon’s identity",
                  "id": 52,
                  "comments": [
                    {
                      "score": 523,
                      "content": "I try, and I may have used the wrong pronoun.  Wallace has not indicated which is the preferred pronoun.  However,  she/he/they like being called sexy.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 243,
                  "content": "She will be the downfall of the lizard king when he has to abdicate for love.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 11,
                      "content": "It’s so unfair that more people don’t appreciate this.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I loved the movie The Lizard King's Speech, about his brother.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 659,
              "content": "[deleted]",
              "id": 57,
              "comments": [
                {
                  "score": 39,
                  "content": "We named our leopard gecko Erica before he was old enough to know his sex. He’s comfortable enough in his masculinity to embrace his non traditional name.",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 339,
              "content": "[deleted]",
              "id": 59,
              "comments": [
                {
                  "score": 137,
                  "content": "FWIU it was an assumption. Blue tongue skinks can be notoriously hard to gender, especially when they are younger. Source: I have a late BTS grandchild.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 49,
                      "content": "I thought you were talking about the K-pop group and I got so confused before I remembered acronyms exist.",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 314,
              "content": "Grandlizard is obviously non-binary",
              "id": 62,
              "comments": [
                {
                  "score": 310,
                  "content": "The word grandchild should be commonly replaced with grandlizard tbh",
                  "id": 63,
                  "comments": [
                    {
                      "score": 19,
                      "content": "A skink needs a gender-reveal party like—um—a 'fish needs a bicycle'. \n\nFirst of all, a [skink's sex may change](https://www.sciencenews.org/article/heat-turns-wild-genetic-male-reptiles-functional-females) from female to male *depending on temperature*.\n\nSecond, female skinks may [store sperm for a year](https://phys.org/news/2021-09-female-skinks-sperm.html) with their bodies, and may *self-fertilize* if they do not encounter a male in that time. \n\nThird, [skink sex can get pretty wild.](https://animaldiversity.org/accounts/Plestiodon_fasciatus/) Skinks can have complex courtship and aggressive behaviors. Males tolerate females and juvenile males on their turf but actively fight any other males. They get turned on by touch pheromones (rather than aerosol). The males grab the female in their jaws and copulate with two hemipenes (double sexual organs that may have hooks or spikes) into the female's cloaca. *Skinky sex is kinky sex.*\n\nAlways remember: \"Life—uh—finds a way...\"",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 158,
              "content": "Me too. I wanna know the name too!",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2139,
          "content": "I adopted a stray cat and my dad will text me just to see how his “grandkitty” is doing. It’s just a funny joke and I would absolutely hate to have OP as my dad. Sounds like a major buzzkill. \n\nYTA",
          "id": 66,
          "comments": [
            {
              "score": 1354,
              "content": "My old cat had a bit of an attitude and would slap my mom now and then. Invariably, mom would say \"how could you? I'm your grandmother!\"",
              "id": 67,
              "comments": [
                {
                  "score": 548,
                  "content": "My mom takes it to a new level where she bribes my cat with treats because she's grandma. My cat might love his grandma more than me, his mother.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 349,
                      "content": "Same. My dog gets more excited when my mom shows up than she does when I get home. She knows that whenever grandma comes over, either we're going someplace new and exciting, or she's going to get play time, treats, and love until she drops. Mom loves to get to spoil her granddog and my dog loves her Gran",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Yup my mom does the same. She even has a human grandchild (also from me) but the furry ones ( 10 year old German Shepard & 4 year old reformed feral cat) are her first grandkids. Anytime she visits she has treats for both of them, heck the German Shepard (whose normally my shadow) becomes her shadow when she’s here and sleeps with her 🤣\nI feel bad for OPs daughter, my mom would have thought a lizard gender reveal was hysterical (she helped plan my best friends dogs first birthday “pawty”)",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "My in-laws got christmas stockings for each cat with their names on. They're concerned that the latest addition doesn't have a stocking and Mauricio might not fit on one.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 226,
                  "content": "I love your mom.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "My mother would talk to my bunnies in Korean because my own Korean is wretched and she insisted her grandbunnies need to know Korean.",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 696,
              "content": "My mom loves her grandlizard. She got him a bearded dragon harness and when she visits me she brings him farm fresh foods she grows. \n\nMy beardie pretends he doesn't care but he also comes to the glass when she visits when he ignores most other people.",
              "id": 74,
              "comments": [
                {
                  "score": 250,
                  "content": "That’s so sweet! My grandma always jokes that my parents dog is her favorite grandchild 😂",
                  "id": 75,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I have kids and can attest that even with grandchildren sometimes the grand puppy is better behaved lol 😂grand pets always have a special spot in hearts ♥️",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "We always knew my family dog was my grandmas favorite grandchild. We’d get on FaceTime and immediately she’d go, where’s Cody, show me my pretty boy",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 459,
              "content": "Exactly. I have 4 animals & my mom would always call them her “grandcats” and “granddog” just because she knew I see them as my “children”",
              "id": 78,
              "comments": [
                {
                  "score": 526,
                  "content": "My mother refers to her „granddogs“. She already has four actual grandchildren and her own dog, but apparently there’s enough love to go round.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 3556,
                      "content": "I think this is the issue right here. OP is stingy with love. \n\n“Why should I love a stupid lizard?”\n\nWhy can’t you get interested in the things your kid likes and share her excitement and joy? Just the little things? No, she’s never going to have kids, so you could have seen that adorable, quirky kid you raised to be as funny and sweet as she is and gone to her party and mingled with her probably also quirky, funny, sweet friends and had a lovely time, but no. \n\nWhat a loss. How sad.",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My parents refer to our cats as their grandcats.  My mum made them stockings to match ours :)",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 365,
              "content": "it's a great dialog opener! My kid still lives with me, but when I ask him like \"are ya winnin' son?\" while he's playing video games, it's really... not about the video game.",
              "id": 82,
              "comments": [
                {
                  "score": 43,
                  "content": "Yeah, I mean I'm a gamer myself, and I'm not particularly interested in the tournament his friends set up, but I damn well know the game, how he did, how his team played, and why.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 336,
              "content": "Dude right? OP is lame. My dad sends Christmas gifts for my cat and signs them \"from Grandma and Grandpa.\" She even gets adoption anniversary and birthday gifts. It's adorable.",
              "id": 84,
              "comments": [
                {
                  "score": 27,
                  "content": "[deleted]",
                  "id": 85,
                  "comments": [
                    {
                      "score": 13,
                      "content": "What a sweet man, but such sad way to find out! How long before you figured it out had he actually passed? Did you let them know they were absolutely wrong and you'd have liked to have found out the normal way?",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Love this!! Last year, I dropped my dog off at my parents house everyday while I worked. You better believe that my dog got her grandma a Christmas gift to say thank you! \n\nAlso, when I adopted my dog my mom was so excited that her two dogs would “finally have a niece” and is constantly calling her dogs “the furry uncles.” I’ve moved away and adopted another dog, and she asks me for daily pupdates on her grand dogs.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "My grandma is the same, she's always ringing up to ask how her great granddaughter is doing, it makes her day when I bring the cat down to see her.\n\nIt's my cat's birthday soon (xmas eve) and grandma has asked me to take her out so she can buy some presents for the cat, and always sends her a birthday card that says 'lots of loves, great grandma B'",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 230,
              "content": "Seriously! I have a horse and two cats and my mom is always saying “my grandkittens” and “my grandhorse” and it’s super adorable. With horse related things she’ll even introduce herself as “Reno’s Grandma”",
              "id": 89,
              "comments": [
                {
                  "score": 10,
                  "content": "One of the reasons my pets have human names is to enable my mom to talk about her grandkids, Cassie (f6 cat), Flynn (f4 cat) and Cal (f 4mo rosy boa). \n\n(Flynn: we thought she was a boy but the name stuck)",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My son's dog is my grandog. I buy her Christmas presents...My mom buys presents for my cats.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Grandhorse is adorable!!  My Mum took a while to come around to me not having kids (I'm also ace and carry genes for an assortment of shit I'd rather not pass on) but she now dotes on her 'grandcats' to the point if she looks after them when I'm out of town they won't eat their regular food when I get back because they've been getting, like, fresh prawns and kangaroo.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "My grandma calls my cats her grand kitties too! She actually got me a Petco gift card the first Mother's Day after we adopted our cats",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "Buddy (cat) knew who Grandpa and Grandma were, and got super excited when they came to visit. He had to stay with them when I was in the hospital for a month--I almost didn't get him back :)",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "So I am a long time Reddit lurker, but I JUST joined to specifically comment on this! \nMy mom calls them Gran-imals! The beloved pets of her kids🤣",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1196,
          "content": "I just want to thank OP for the opportunity to tell her *the Iranian yogurt is not the issue here*\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/bjd41e/aita_for_throwing_away_my_boyfriends_potentially/",
          "id": 96,
          "comments": [
            {
              "score": 400,
              "content": "[deleted]",
              "id": 97,
              "comments": [
                {
                  "score": 249,
                  "content": "Oh noooooo two years?!?\n\n*crumbles into dust and blows away*",
                  "id": 98,
                  "comments": [
                    {
                      "score": 155,
                      "content": "Don’t you mean *dissolves in a puddle of yogurt mold*?",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "THAT CAN'T HAVE BEEN TWO YEARS AGO? \n\nHOW LONG AGO WERE THE BEANS?\n\n(You guys gotta know the beans right. The buried beans?)",
                  "id": 100,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Ok, I thought you were talking about the baked beans, but then I found the buried beans story: https://www.reddit.com/r/tifu/comments/fy06bv/tifu_by_demanding_that_my_girlfriend_show_me/\n\n\nBaked beans copypasta: https://www.reddit.com/r/copypasta/comments/a5futi/my_25_m_girlfriend_26_f_baked_all_the_beans_now_i/",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "That… that was in the Before Times.",
                  "id": 102,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 111,
              "content": "WHAT A RIDE THAT WAS LMAO",
              "id": 103,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 52,
              "content": "A classic!",
              "id": 104,
              "comments": [
                {
                  "score": 9,
                  "content": "Right up there with the collection of lasagna-dudes and the guy who ate the entire sub.\n\nWe need the most famous submissions here to be stored and linked somewhere.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "I had not seen this before, so thank you for sharing it. Really, thank you from the bottom of my second favorite yogurt refrigerator.",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "It was obviously a ruse to get more yogurt space \n\n\n\n\nOne of the funniest things I’ve ever read lol.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 495,
          "content": "Literally, it was obvious ops daughter just wanted to see her and then she flipped it and said the lizard isn’t her granddaughter",
          "id": 108,
          "comments": [
            {
              "score": 106,
              "content": "No, it might be her grandson. That was never made clear though.",
              "id": 109,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 368,
          "content": "My family all attended our kittens’ joint first birthday party, brought cards and presents which they “helped” open, and even sang happy birthday. My sister has 3 kids, I have 3 cats - not for one minute have they ever made me feel stupid or that they’re not interested in my kitty pictures spamming the family WhatsApp group. Be more like my family and apologise to your daughter, OP. Then buy your grand-skink a nice birthday present to say sorry.",
          "id": 110,
          "comments": [
            {
              "score": 12,
              "content": "My MIL refers to our cats as grandbabies anyway, is always buying them gifts, comes to our place just to visit them and specifically requests pictures of them. We of course oblige and always send pictures! c:",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 247,
          "content": "Read this as \"Yer a grandlizard, Harry\"",
          "id": 112,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 75,
          "content": "Grandlizard... I laughed.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I cried of laughter at your comment.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 30434,
      "content": "Ok. So. First off, this is probably the most interesting topic I've ever seen on this sub. I didn't wake up this morning thinking \"I hope I get to weigh in on how the social contract relates to gender reveal parties for reptiles\" but here we are.\n\nIf this was as straight forward as the title suggested, you wouldn't be in the wrong at all. A gender reveal party for a lizard is just...well. It's silly. Gender reveal parties in general are silly, this one is double silly. It's fun, it's cute, but it's silly.\n\nHowever.\n\nYour daughter did make it clear to you that she was jokingly hosting a gender reveal party for a lizard. What she was actually doing was hosting a small get together and she wanted you to come over. She made it pretty obvious from the ~~get-go~~  *gecko* that she really just wanted an excuse to have a small party.\n\nSo...and I love that I get to use this sentence...\n\n***Let's remove the lizard genitals from the situation.***\n\nWhat your daughter was actually doing was inviting you over to spend time with her, and you declined because you're \"A busy person with important things to do.\" You didn't like that she jokingly called it a gender reveal party, even though it had been made clear that it was just a get together. You took a stab at her choice to be child free (She's obviously not presenting this lizard as your grand daughter, it wasn't necessary to say that you'd come to a gender reveal for an actual baby). Basically, you got so hung up on the silly name of the party that you completely ignored the intention and made your daughter feel like crap.\n\nSo yeah, YTA, but it's not because you won't be there to celebrate the revealing of the lizard genitals. It's just because your daughter wanted to spend time with you, and you brushed her off Cats in the Cradle style.\n\nETA: Your edit made this entire situation worse. Congratulations. With just a few sentences, you managed to\n\n\\-Demonstrate that you were entirely hung up on the name of the party. Despite being told multiple times what the purpose of the party was, you couldn't live with attending a party with a silly name.\n\n\\-Prove that you are not, in fact, supportive of your daughter's decision to be child free. There's a difference between being \"supportive\" and \"only bitching about it a little bit\".\n\n\\- Invalidate your daughter's sexual identity. She's not asexual, she just hasn't met the right man yet!\n\nBut I think my favorite part was towards the end. Where your daughter provided multiple VERY legitimate reasons not to want children. Not wanting kids, for one. But also a fear of pregnancy, genetic issues, and a maternal history of devastating loss. You suffered 4 miscarriages and lost a child in infancy. How in the world could you, as a mother, want your daughter to suffer like that? \n\nEveryone keeps mentioning the Iranian Yogurt, but after reading your update, I'm prepared to say it.\n\n***THE LIZARD GENITALS ARE NOT THE ISSUE HERE.***",
      "id": 115,
      "comments": [
        {
          "score": 8742,
          "content": ">Let's remove the lizard genitals from the situation.\n\nIf the genitals were removed, would that make it a lizard gender neutral reveal party? What is the correct terminology here?",
          "id": 116,
          "comments": [
            {
              "score": 3049,
              "content": "Oh man I know this isn't what you commented about but it burns me that we call these \"gender reveal\" parties. \n\nGenitals don't indicate gender; they indicate sex. \n\nSo, a \"lizard sex reveal party\"? 😏",
              "id": 117,
              "comments": [
                {
                  "score": 1862,
                  "content": "This sounds like something you pay a cover charge to attend.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 687,
                      "content": "And bring a copy of a recent full STI panel to",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 144,
                      "content": "In Tijuana no less.",
                      "id": 120,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 43,
                      "content": "I'm a vet receptionist. The verb describing the process of determining the sex of an animal is called \"sexing.\" When people make appointments to discover the sex of their reptile or bird (\"so you'd like an appointment for sexing?\"), it sometimes turns into an awkward conversation.\n\nWhat I'm saying is, this could've also been called a \"Sexing Results party.\"",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "And then, she slowly and seductively revealed her lizard. Let's hope it doesn't get reptile dysfunction.",
                      "id": 122,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1195,
                  "content": "I'm an ultrasound tech and absolutely cannot stand when my patients all me their baby's gender. I don't know how your baby will perceive themselves. I don't know their feelings and self identity \n\nI can, however, tell you this kid has a penis",
                  "id": 123,
                  "comments": [
                    {
                      "score": 690,
                      "content": "Mom of trans kid checking in. \n\n\nI appreciate you a lot.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 516,
                      "content": "You're my hero of the day. \n\n\"Its going to be a little princess!\" \n\nYou dont know that, she might want to grow up to be an demolitions expert & destroy sh\\*t with big plant machinery",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 137,
                      "content": "Everytime a tech has asked me if I want to know they have said \"the sex\" rather than gender. I've never had to ask for it though, they always ask at the very start so they can avoid that region if I say no",
                      "id": 126,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Lmao. All I can imagine is you looking a new mom dead in the eyes after they ask 'is is a boy/girl\" and you going.... 'It has a penis'",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 310,
                  "content": "That's too long, let's just call it a \"lizard sex party\"",
                  "id": 128,
                  "comments": [
                    {
                      "score": 227,
                      "content": "In Washington, they just call that Swingers Night.",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "Will there be lusty Argonian maids?",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "At first I read \"lizard sexy party\" and I thought: \"Ok this thread is getting weirder with every pass comment\"",
                      "id": 131,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 267,
                  "content": "[deleted]",
                  "id": 132,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I read that as \"Lizard Sexting Party\". Oh yeah, show me that freshly molted leg?",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 128,
                  "content": "The lizard it might experience dinosphoria",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 129,
              "content": "And I know what you’re thinking- won’t that just shed more light on the (lizard) penises? But that is a risk we have to take.",
              "id": 135,
              "comments": [
                {
                  "score": 155,
                  "content": "I do not care how long I have to wait. Someday, I will find an excuse to say \"And I know what you're thinking- won't that just shed more light on the lizard penises? The answer is yes, but that's a risk we'll have to take\". Maybe it will be in a board meeting. Maybe it will be how I get out of a traffic ticket. Maybe it will be the last words I utter before my rat bastard children pull the plug on my life support. But this phrase will live rent free in the back of my mind, waiting for the right moment, for the rest of my natural or unnatural life.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Don’t wait long: I know a friend of a friend who did stuff like this at every gathering/party/bbq, but he did it in a way that made the whole party stop and ask more questions. Man, I miss gatherings with those friends in real life ☹️",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I had a fuck buddy who called his penis ‘the lizard’. So he was in my phone as ‘lizard d*ck’.\n\nI blocked out why he had named it that because he was really hot and I was horny. He was the exception to the ‘named penis owners should be avoided’ rule as he was surprisingly normal and non egotistical unlike most other ‘name your penis’ people.\n\nAnd oh god I have just remembered I had a sex work client who invited me to the naming of his penis. Being able to dissociate has some advantages. There was whole well, ceremony and the second I had my cash and the appointment was up that penis was Ralph in my mind. All penises are Ralph if named thanks to Judy Blume and Forever who was my original sex ed guide and who has never failed me yet.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 79,
              "content": "> If the genitals were removed, would that make it a lizard gender neutral reveal party?\n\nWouldn't that make it a lizard neuter reveal party....?\n\nI'll see myself out.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "That depends on whether the genitals were neutralized before or after the party, wouldn't it?\n\nSecondary thought if you remove the genitals first what color do you reveal that with? Beige?",
              "id": 140,
              "comments": [
                {
                  "score": 41,
                  "content": "Fair point. I think it depends on what color skink blood is, because I'm thinking that's the color you would reveal by removing genitals?",
                  "id": 141,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Didn't think I would be googling that today, but apparently it depends on the species of  [skink](https://www.livescience.com/62589-lizards-green-blood.html)",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "I don’t know but I want to know if there was cake and was it themed out? Like I can imagine sun lamps, fake crickets in the ice cubes and just some awesome party decor!! Even if it’s just some fancy paper plates, I hope the Grandma gets to be known as lounge lizard from here on out!!",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Omfg I’m cryin 😂",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1089,
          "content": "“Let’s remove the lizard genitals from the situation” needs to be the sister phrase to “the Iranian yogurt is not the issue here”.",
          "id": 145,
          "comments": [
            {
              "score": 365,
              "content": "“The Iranian yogurt is not the issue here, so let’s remove the lizard genitals from the situation…” wondering how I can work this into my next conference call.",
              "id": 146,
              "comments": [
                {
                  "score": 24,
                  "content": "The Iranian yogurt becomes the issue here when one finds lizard genitals in the Iranian yogurt.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "Oh my god  what's the context for Iranian yoghurt?",
              "id": 148,
              "comments": [
                {
                  "score": 257,
                  "content": "Enjoy: https://www.reddit.com/r/AmItheAsshole/comments/bjd41e/aita_for_throwing_away_my_boyfriends_potentially/?utm_medium=android_app&utm_source=share",
                  "id": 149,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Thank you so much, holy shit",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Oh my god.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 91,
              "content": "And it's even funnier.",
              "id": 152,
              "comments": [
                {
                  "score": 29,
                  "content": "It really is. I’m going to write it down and start using it as an idiom whenever applicable, whether people understand me or not.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1053,
          "content": "Thank you for crafting the most considered piece I'll ever read on the politics of lizard genital identification.\n\nAlmost makes me forget how sad it is that the daughter \"understands\" her mum is too busy to make time for her.\n\nOp YTA",
          "id": 154,
          "comments": [
            {
              "score": 25,
              "content": "> Almost makes me forget how sad it is that the daughter \"understands\" her mum is too busy to make time for her.\n\nThis is the saddest part. The daughter is clearly used to this kind of belittling and emotional manipulation and still tries to reach out to her mom anyway. She doesn't seem to realize (yet) how callous and cruel her mom is being to her. Odds are she and OP will not be speaking by the time the daughter is 30 if OP doesn't clean up her act.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Definitely a huge asshole",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 561,
          "content": ">Let’s remove the lizard genitals from the situation. \n\nr/brandnewsentence",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 533,
          "content": "I’d also like to point out, OP is probably harboring resentment about grandkids, and that is coming through as well.\n\nEveryone just needs to feel loved.  Daughter wanted to share her love for her chosen family (lizard) with her other family.  OP seems really hurt by the childless decision, but hadn’t come to terms with what daughters decision means.",
          "id": 158,
          "comments": [
            {
              "score": 149,
              "content": "This, for sure. OP is lowkey mad about the childfree choice and feels entitled to grand parenthood. Having a happy daughter who has fun little gatherings just because she misses people is Not Good Enough for OP.",
              "id": 159,
              "comments": [
                {
                  "score": 14,
                  "content": "i feel like since OP went through a difficult pregnancy and the troubles of parenthood for her daughter, she feels like her daughter also needs to go through that. that and the entitlement towards grandkids",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Yup. All op had to say was, \"sorry but I have plans that day. I'd really like to get together soon though.\" OP made an issue where there wouldn't have been one.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Did you read the edit? OP is definitely harbouring resentment about grandkids. \n\nBut holy shit, the reasons her daughter gives for not wanting kids… I was reading them thinking, that’s fair, also fair, makes sense… WHAT? Wow OP is a bigger AH than originally thought.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "I mean also it seems like OP just didn't show up, rather than politely declining or something? Because the daughter called afterwards and seemed surprised and hurt that OP wasn't there. It's just basic manners to just...not show up like that without even a text or something, IMHO.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "Why did Cats in the Cradle style hurt me deep 🤣😭",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 198,
          "content": "> Let’s remove the lizard genitals from the situation \n\nI don’t see what the lizard has done to deserve this",
          "id": 165,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 192,
          "content": ">She made it pretty obvious from the get-go that she really just wanted an excuse to have a small party.\n\nI'm only here to point out the missed opportunity of \"...pretty obvious from the gecko that she...\" I know, I know, I'm leaving right now.",
          "id": 166,
          "comments": [
            {
              "score": 55,
              "content": "No wait come back, I like your moxie. I'm kicking myself for missing it.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "I wish I could upvote this more than once just for the \"Let's remove the lizard genitals from the situation\" comment",
          "id": 168,
          "comments": [
            {
              "score": 260,
              "content": "Okay, but why is everyone sleeping on “I didn't wake up this morning thinking \"I hope I get to weigh in on how the social contract relates to gender reveal parties for reptiles\" but here we are”?",
              "id": 169,
              "comments": [
                {
                  "score": 24,
                  "content": "I fucking cackled.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "I wish I knew about this sub when my ex and I broke up. I texted her, \"Stop telling everyone I broke up with you over ramen noodles. The ramen noodles were just the catalyst.\"",
              "id": 171,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11860,
      "content": "YTA. Your daughter sounds cool tho",
      "id": 172,
      "comments": [
        {
          "score": 4161,
          "content": "right? I'd totally go to a lizard gender reveal, that sounds hilarious.",
          "id": 173,
          "comments": [
            {
              "score": 1798,
              "content": "Same, I’d call off work and bring a gift or something too, sounds tight as hell",
              "id": 174,
              "comments": [
                {
                  "score": 696,
                  "content": "What kind of food/drink do you serve at a lizard gender reveal?",
                  "id": 175,
                  "comments": [
                    {
                      "score": 1430,
                      "content": "Dirt cups! I don't know if anyone remembers these but they're cups of pudding and crushed oreos with gummy worms in them. The perfect reptilian party food",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 126,
                      "content": "Don’t forget the gummy worms! And I agree, I want to be the daughters friend. I love a good creative excuse to get together!",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "You can get food grade crickets and mealworms in a variety of flavors.",
                      "id": 178,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "[Grasshoppers](https://www.acouplecooks.com/grasshopper-drink/).",
                      "id": 179,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 305,
              "content": "I'd much rather attend a lizard gender reveal than a human gender reveal.",
              "id": 180,
              "comments": [
                {
                  "score": 137,
                  "content": "Probably less likely to have explosions that start wildfires.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I don't know, man. Ain't no party like a lizard party.",
                      "id": 182,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I attended a dog breed reveal party a couple summers ago and it was delightful. Two of my friends had their weird looking shelter dog genetically tested to figure out what breed(s) he was and decided that was a reasonable excuse for a party. There were snacks, drinks, merriment, and every guest was invited to buy a ballot to try guess the breeds. It was like $10 per ballot and all of the money was donated to the dog rescue where they had adopted him. Whoever guessed correctly or got the closest won a bottle of bourbon. A+ party and no one died because they just shared the information verbally instead of blowing stuff up.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 9,
                      "content": "You have top notch friends.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 212,
              "content": "legit the only gender reveal i'd ever attend",
              "id": 185,
              "comments": [
                {
                  "score": 13,
                  "content": "SAME. I lowkey want to meet OP’s daughter and her much-loved lizard. Not OP, though, since she sounds like an asshole who deliberately misconstrues things and plays dumb when called out and I’ve already got a mom like that.",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "I read this title and just cracked up, this girl sounds like a lot of fun!",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 270,
          "content": "Seriously, I want to be friends with her! My bearded dragon turned out to be female after she suddenly laid eggs (we were told she was male). She's really popular on my IG stories. People will even DM asking how she is if I haven't shown her in a while lol",
          "id": 188,
          "comments": [
            {
              "score": 11,
              "content": "Yay beardies.   https://i.imgur.com/0jvgALU.jpg",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 138,
          "content": "This is the second cool and interesting kid I've read about on here recently with asshole parents who don't support them. Sad!",
          "id": 190,
          "comments": [
            {
              "score": 86,
              "content": "[deleted]",
              "id": 191,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "who's the first?",
              "id": 192,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "That’s it we are now doing lizard gender reveal parties now. I’m gonna go buy a lizard 😂😂",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "Right? All I can think is where did this fun daughter come from cos OP is an absolute dry shite",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Sounds like the apple fell far, far from the tree.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8749,
      "content": "[removed]",
      "id": 196,
      "comments": [
        {
          "score": 1595,
          "content": "Yeah, OP don't be surprised if your relationship changes after this. All she wanted was your company and you sh@t on her for it.",
          "id": 197,
          "comments": [
            {
              "score": 1047,
              "content": "The sad part is that when their relationship inevitably falls apart, OP will definitely tell people it’s because of the lizard gender reveal and not her complete lack of respect for her daughters sexuality and decision to not have children",
              "id": 198,
              "comments": [
                {
                  "score": 261,
                  "content": "Ok but hear me out …. Think of the initial reaction when OP says lizard gender reveal ruined her relationship.\n\n The emotions that will cross over the persons face will be 💫 magic💫",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "I hope her daughter and the grandlizard go no-contact.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 59,
                      "content": "Very sad for the grandlizard not knowing her grandmother but it’s for the best",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "OP's definitely going to be one of those \"missing missing reasons\"-people",
                  "id": 202,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 699,
          "content": "Yep, especially because OP didn't have any real reason for not going except for \"I didn't want to because I think your way of life is not right\" - I would've been so hurt.",
          "id": 203,
          "comments": [
            {
              "score": 211,
              "content": "Maybe OP is salty because she's 100% the person out there going to and pushing for gender reveal parties.",
              "id": 204,
              "comments": [
                {
                  "score": 30,
                  "content": "\"It's not about you! It's the principle of it all - you're mocking the sacred institution of gender reveal parties!\"",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 571,
          "content": ">You don't have a grand-daughter, and if you carry on acting like this you won't have a daughter for much longer either.\n\nOP is just using this as an opening to air her resentment about her daughter being child free. \n\n>she should've just called it a gathering because I'm not coming to a gender reveal unless it's for a real grand daughter.\n\nI rarely use the word triggered but “gender reveal” seems to have massively triggered OP. \n\nOP cannot possibly be so pedantic that she can’t differentiate between a joke lizard gender reveal gathering and a serious one, especially after daughter told her over and over it was just a joke. It’s like she got invited to a “serial killer Halloween party” then primly said she wasn’t going to go because of serial killers and that it should just be called a Halloween party. What a prig.",
          "id": 206,
          "comments": [
            {
              "score": 440,
              "content": "Also, according to the edit, her daughter 'claims' to be asexual. So... Yeah. This mother is not okay with many things in her daughter's life.",
              "id": 207,
              "comments": [
                {
                  "score": 383,
                  "content": "And topped with the the other gripe being she \"just hasn't found the right man\"\n\nGod, even if the circumstances landed in which she DID find \"the right man\", that doesn't mean you'll want a kid with them. It's like saying a vegan just hasn't found the right steak or something.",
                  "id": 208,
                  "comments": [
                    {
                      "score": 173,
                      "content": "Exactly. I’m also child free and constantly get told I’ll change my mind when I meet “the right man”. I always remind people that “the right man” for me would also be child free. Why would OP’s daughter be with someone who isn’t compatible for someone who is child free and asexual?!",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "I'm fond of, \"Oh, honey, you just *think* you're straight. You just haven't met the right lesbian yet!\"",
                      "id": 210,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 224,
                  "content": "That edit just blew my mind. Lady, that's not what \"very supportive\" means (as she claims to have been). That's \"barely containing my resentment\".",
                  "id": 211,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Yeah, I shudder to imagine what OP would do if she was \"unsupportive\"?",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 190,
                  "content": "I honestly thought that was going to be the worst part of it, but then OP *goes on to top it* by downplaying the fact that her daughter is carrying a gene that can cause severe birth defects and pregnancy loss and, all of her already-valid reasons entirely aside, doesn’t want to risk pregnancy because of it. When I say that my jaw *dropped* at the way this was just casually tossed out like it’s some silly little thing.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Miscarriages are traumatic as hell. I've had one and I'm still dealing with it. OPs medical condition led to *four*. It's fine if OP considers that to not be a big deal, but it's clearly a big deal for her daughter who doesn't want to go through that shit. It's really shitty of OP to dismiss those concerns because they're 'not a big deal'. Ugh.",
                      "id": 214,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 48,
                  "content": "I thought OP was a total asshole until the edit; now I’m mad as hell. It’s the same playing dumb to cover a shitty stance as before, now with the quiet part said out loud and some amazingly tiresome acephobia. \n\nI wish I’d been wise and strong enough to listen to myself when I was OP’s daughter’s age. It would have saved me decades of trying and failing at relationships I never really wanted in the first place. Now in my 40s, I have at least the certainty of self-knowledge to say that I’m ace and stand firm. Of course my own mother is like “Oh, I went through phases like that too,” like in my 40s knowing how I feel about sex/relationships/children is “just a phase.” I don’t try to talk to my mother about my feelings or inner life anymore, since she seems determined to dismiss all of it. \n\nI’m sure OP will be all kinds of puzzled when her daughter goes LC and/or starts gray rocking her. If she notices. Honestly, my own mom has such a self-centric worldview that she hasn’t noticed that I just vaguely agree with whatever she says, communicate facts, then disengage. OP seems like she might be the type.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 364,
          "content": "Nothing is worse then doing something fun and light hearted only to have a loved one shit on it for no reason.",
          "id": 216,
          "comments": [
            {
              "score": 37,
              "content": "It wasn't for 'no reason'. Op isn't happy her daughter isn't going to give her a grandbaby.",
              "id": 217,
              "comments": [
                {
                  "score": 26,
                  "content": "Op isn’t happy her daughter won’t put her sexuality, mental and physical health on the line to give her a grandchild. That edit was the worst edit I’ve seen in the whole. Who writes that and thinks “oh this will make me sound better”.",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Exactly this. My mother never made an effort to come to get togethers I arranged and for years I made the effort to see her until one day I didn't. Havent spoken in 2 years and from my end, it doesn't make a difference.",
          "id": 219,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": ">because your fee fees got hurt\n\nI never get tired of this expression.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "THIS. She TOLD YOU what it was. YOU CHOSE to ignore that. YTA.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6256,
      "content": "YTA \n\n> Well I didn't come. I didn't see a point. It's just a lizard and I'm a busy person.\n\nIt wasn't for the lizard, it was for your daughter. If you're too busy to do nice things for your family (or apparently even tell them you aren't coming) then just say that. But don't hide behind some ridiculous moral stance of it being \"not a real gender reveal\"\n\nHonestly this whole post just screams \"I only give a shit about my kid if she's having babies\" and that's pretty vile.",
      "id": 222,
      "comments": [
        {
          "score": 1486,
          "content": "This, it feels very much like this was a passive aggressive way for OP to get back at their daughter for choosing to be child free and not giving them a “real” grandchild. YTA",
          "id": 223,
          "comments": [
            {
              "score": 57,
              "content": "\"How dare you invite me round for a sub par reason?\"",
              "id": 224,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Sent my mother this post. Her reply: \"I have enough grandfurs, no lizards.\"",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 552,
          "content": "Yes and when you as TA mom ask your daughter to come spend time with u, don't be surprised that she has more important things to do. Like look at nursing homes",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 439,
          "content": "This post makes me appreciate that my in laws are always the first to RSVP for my dog’s birthday party and they always bring a gift. Even though i know they’d much rather have human grandchildren. I understand that she’s just a dog and she doesn’t even know it’s her birthday, but dogs in party hats are a great accompaniment to a barbecue. They come because they want to see us and we appreciate it. I don’t understand why OP isn’t flattered that her grown daughter wants to spend time with her.",
          "id": 227,
          "comments": [
            {
              "score": 263,
              "content": "Silly themes also really take the pressure off events. A birthday party- don’t ruin it!!!! A *birds* birthday party? Eh, she’s a bird, she’ll forgive me if I get a little drunk/misspeak/ruin the cookies I was supposed to bring.",
              "id": 228,
              "comments": [
                {
                  "score": 25,
                  "content": "I’ve never thrown a birthday party for my dog but I suddenly want to. She’d be really cute in a party hat and she’d enjoy seeing all our friends (even though she already sees them just about weekly), and we always love an excuse to hang out and drink.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Oh my god, I would just whistle Tequila at the bird the entire time. I want an invite to a bird birthday party.",
                  "id": 230,
                  "comments": [
                    {
                      "score": 20,
                      "content": "A birdday party, if you will. And for those preferring a more marine mammal party theme, why not have a sealabration?",
                      "id": 231,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "No less with her friends there too! I think it's incredibly sweet to want to have your MUM AND FRIENDS at a random get together just to see them! OP is definitely TA!",
              "id": 232,
              "comments": [
                {
                  "score": 12,
                  "content": "Last year after a big surgery our family threw a belated birthday lunch for our dog's 13th birthday. He died four months ago and I am so glad we did it- even if he was the only dog in attendance.",
                  "id": 233,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "> she doesn't even know it's her birthday\n\nNeither do human babies.",
              "id": 234,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My mom is equally proud of her grandkids AND her grandkittens. She sends them gifts and has family ornaments made for us with their names on them.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 350,
          "content": "> Honestly this whole post just screams \"I only give a shit about my kid if she's having babies\"\n\nYep.  I don’t think the daughter would mind Mom not making time for the party if Mom seemed genuinely invested in other aspects of her life, but she pretty clearly feels like she’s not being heard when it comes to the things that matter to her.  Including OP accepting that whether she bonds with the lizard or not, it’s the closest she’s ever getting to grandkids.",
          "id": 236,
          "comments": [
            {
              "score": 21,
              "content": "Not only that but mom also doesn't validate her daughter's sexual identity either from the sounds of it with her \"she hasn't found the right man\" comment.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 198,
          "content": "My mom’s gone but my MIL would 100% be providing food and decorations for a gender reveal party for our pets, and drive the 9 hours it would take to get here. She calls our cats her grandkitties.\n\nNot only does she love our cats and respect that we see them as family, she’s down for literally any excuse to see us and socialize and, of course, pet the kitties.\n\nWould she be a little sad it’s not for a human baby? Of course, she does really want grandkids. Would she find it silly? Yep! But she’d be there",
          "id": 238,
          "comments": [
            {
              "score": 17,
              "content": "Your MIL sounds like a wonderful person",
              "id": 239,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "That would absolutely be me as a mother / grandma / MIL. I love kids and I'm sure I'd love to have grandkids, but however my child will choose to live their life is their choice and I'll support it. (Besides, kittens are the best!)\n\n&#x200B;\n\nNot everyone wants to have kids and honestly, if you don't want to be a parent, there's good chances you'll be a bad one. So I have immense respect for people who recognise parent life doesn't suit them and have enough empathy to spare possible children of trauma/neglect. These are intelligent people who know their limits. Any idiot can breed, but it takes A LOT to be a good parent -- and a lot of self-awareness to admit you don't have it in you. Besides, it's about time we (as a society) break free of the chains of [amatonormativity](https://lgbta.fandom.com/wiki/Amatonormativity).",
              "id": 240,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "> It wasn't for the lizard, it was for your daughter.\n\nI wonder if OP thinks you go to a regular gender reveal to hang out with the fetus?\n\nNews alert, OP: every gender reveal is just a gathering to see the parents, and they’re all silly.",
          "id": 241,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "You really think OP would or will give a shit if daughter changed her mind and decided to have kids? She’ll be excited for the book of faces but a human grandchild would rarely see OP either. YTA OP",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This is the one.\n\nI'm thankful my mother didn't think less of me when I told her many years ago that I didn't want kids. She even made it a point to remind me who I am and to not sacrifice or compromise my desires for any man that I was dating, including my wishes to be childfree. And when my sister also announced she didn't want kids, and this meant our mom was never going to have grandchildren, it didn't faze her one single bit.\n\nOP has many things to learn and you said it best here.\n\n>\nHonestly this whole post just screams \"I only give a shit about my kid if she's having babies\" and that's pretty vile.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "[deleted]",
          "id": 244,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Idk if you’ve seen the edit where OP states her daughter “claims” to be asexual and OP thinks she just hasn’t found the right man yet, but yeah you’re 100% correct.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2774,
      "content": ">I told her if that was the case she should've just called it a gathering because I'm not coming to a gender reveal unless it's for a real grand daughter.\n\nYTA for this. That was pretty insensitive.\n\nSounds like your daughter explained clearly she had the party as an excuse to get together. Yes it would have been better for her to tell you that upfront, but you doubling down after the fact was unnecessary.\n\nI like your daughter - she sounds like fun.\n\nEdit for clarity: I find OP's comment insensitive because it heavily implies she's not okay with her daughter choosing to be human child free.\n\nEdit: I missed the part where the daughter did tell OP it was a joke part upfront!",
      "id": 246,
      "comments": [
        {
          "score": 623,
          "content": "I knew OP was the AH when I got to that part about a real grandchild. OP says she supports her daughter being child free but that sentence screams that she doesn’t. OP might want to get some therapy for that. OP hasn’t seen her daughter in some time, her daughter did the adult thing and reached out and mum is looking for weak ass excuses not to go.",
          "id": 247,
          "comments": [
            {
              "score": 155,
              "content": "For reals OP needs some help... my mom still refers to my beagle as her first grand baby even now that my brother has produced two \"actual grandchildren\"",
              "id": 248,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Yup that was the point in the story that I turned solidly YTA. That was obviously meant to be a dig at the daughter for not producing a \"real grandchild\" for her.",
              "id": 249,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Oh, it gets better. Or worse. OP edited to add some bullshit where she talks about how her daughter just hasn't met the right man yet.",
              "id": 250,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": ">Yes it would have been better for her to tell you that upfront\n\nShe even *did* tell OP that up front: \"She explained it was just a small get together with cake and food for her friends she hasn't seen in a while with the gender reveal being mostly a joke (and a way to make fun of real gender reveals)\"",
          "id": 251,
          "comments": [
            {
              "score": 77,
              "content": "You are right! I missed that. Thank you for pointing that out - it further reinforces my judgement.",
              "id": 252,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "Yeah, OP sounds bitter and kind of petty about her daughter not GiVinG hEr GraNDbABieS. \n\nEven if the daughter changes her mind and decides to have children, who wants their children around someone who can't be a little silly about things? Not sure if OP is aware, but little kids generally tend to be kind of silly.",
          "id": 253,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yeah and OP’s phrasing of saying that her daughter is “claiming” to be asexual. No, the daughter IS asexual and OP is an ignorant bigoted asshole.",
          "id": 254,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I feel like I can hear my own mother disappointing me with this sentence; it says “the things you enjoy are stupid and you can’t possibly expect me to entertain this”. What a terrible message to get from your mother.",
          "id": 255,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2390,
      "content": "Daughter: \"Hey, I'm having a pirate-themed party\"\n\nOP: \"I can't go, I don't own a boat\"",
      "id": 256,
      "comments": [
        {
          "score": 1161,
          "content": "\"I'm not going to your Murder Mystery dinner if no one is going to be killed.\"",
          "id": 257,
          "comments": [
            {
              "score": 567,
              "content": "“You’re having a house warming party for your new home…what do you think I am, a fucking heater?”",
              "id": 258,
              "comments": [
                {
                  "score": 8,
                  "content": "Yes. Yes, I do. The human body radiates ~350,000 J of energy per hour which is roughly equal to energy given off by a 100 Watt light bulb.",
                  "id": 259,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 206,
              "content": "\"Why would you call it a Murder Mystery if no one is actually murdered during the party?\"",
              "id": 260,
              "comments": [
                {
                  "score": 43,
                  "content": "I mean, if you insist...",
                  "id": 261,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 572,
          "content": "Daughter: “I’m throwing an ‘80s party!” \nOP: “Time travel is impossible.”",
          "id": 262,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 291,
          "content": "It’s almost more like “I’m having a pirate party” “oh sorry I’m not coming because you’re not really a pirate”.",
          "id": 263,
          "comments": [
            {
              "score": 44,
              "content": "I would have come for a real pirate tho",
              "id": 264,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 210,
          "content": "Later:\n\nDaughter: \"I'm sad you missed my party because I really miss you :(\"\n\nOP: \"Well, if you got me a real boat, I would go\"",
          "id": 265,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "You can't sing shanties if you don't have a beard...",
          "id": 266,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Piracy is a crime! I will not be implicated in your pillaging!",
          "id": 267,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "Or \"I'm not going, pirates were criminals and I would never be caught consorting with criminals\"",
          "id": 268,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2122,
      "content": "YTA\n\nShe made it clear the whole \"gender reveal for lizard\" was a joke and the party was meant to be just a get-together. Why are you so salty about your daughter having sense of humour?",
      "id": 269,
      "comments": [
        {
          "score": 1097,
          "content": "I'm getting the vibe that OP doesn't really know or understand her daughter, and I think that's a real shame - girl sounds like a fun person to know and be around.",
          "id": 270,
          "comments": [
            {
              "score": 332,
              "content": "I know. Gender reveals in general make me want to set myself on fire, but I'd attend the hell out of one for a lizard because, come on, it sounds fun! I like fun, unlike OP apparently. And I want to be her daughter's friend.",
              "id": 271,
              "comments": [
                {
                  "score": 85,
                  "content": "Hahahaha oh my god... Yes, gender reveals make me want to set myself on fire too. I hate them. But one for a lizard....I'd be there with a gift!! Haha.",
                  "id": 272,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Yes, I'd be there with gifts and snacks and vying for a spot on the godparent list. When is the christening?",
                      "id": 273,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": ">Gender reveals in general make me want to set myself on fire\n\nGood news! Often the gender reveal will set you on fire itself!",
                  "id": 274,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I swear if I ever have a gender reveal party I'm having rainbow M&Ms fall out of the cake and the reveal banner will say \"BABY, PROBABLY HUMAN\"",
                  "id": 275,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 332,
          "content": "because no grandchildren.  OP is in denial and thinks she is \"very supportive of this decision\" when in reality she insults and belittles her daughter for not having children.",
          "id": 276,
          "comments": [
            {
              "score": 45,
              "content": "And also her daughter can't *really* be asexual, she just needs to go do all that dating she doesn't want to do and then she'll change her mind, decide that she does want a man and pop out some grand babies, *as is her duty to her mother!*",
              "id": 277,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "and OP’s doing her best to make sure that if her kid(s) do decide to have human offspring in the future, that they’ll keep them at arm’s length from her because of what a generally mean person she was to them before they had little humans for OP to ~~support~~  belittle and insult!",
              "id": 278,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 228,
          "content": "Seriously, her daughter said on like 4 different occasions, including during the invitation, that the gender reveal thing was just a joke and she wanted to see her mother. And OP just kept doubling down on how having a gender reveal party for a lizard was stupid. She is NOT listening to her daughter at all. \n\nYour daughter is right, OP. You clearly do not support her decision to be child free, or you wouldn’t have picked this hill to die on.\n\nAlso, you’re a crappy mom. I’d go to a real gender reveal party for my daughter’s pet sea monkey if I hadn’t seen her in a while.\n\nYTa",
          "id": 279,
          "comments": [
            {
              "score": 26,
              "content": "Yep. OP kept dragging the \"a gender reveal for a lizard is stupid\" spiel but was told several times that the party wasn't even for that and more of a **get to hang out and see mom + peeps for quality time yeah!** type event. OP stating that they wouldn't go unless it was a real gender reveal was uncalled for and wouldnt have been said unless they were salty their kid wasn't have babies (which is the case and seems like OP dislikes despite saying their supportive). OP is gonna find themselves without a daughter real soon",
              "id": 280,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 117,
          "content": "She's not salty about her daughter having a sense of humor, she's salty about her daughter choosing not to have actual human children after all.",
          "id": 281,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "I went to a cat’s bat mitzvah once. Was it about the cat? No. Did the cat read Torah? No. Did we all have a good time? YES!!! \n\nOP needs to loosen up.",
          "id": 282,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It probably reminds OP of their daughters other parent too much because the daughter clearly didn't inherit that humor from OP",
          "id": 283,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1789,
      "content": "Huge YTA!  At first I was like, ok I get it, she jokes about it being for the lizard.  Then I got to your updates.  \n\n>she claims she's asexual,\n\nYou have totally invalidated your 23 year old daughter who knows very well by now who the h@ll she is.  Your following comment \n\n>I think she just hasn't found the right man (she never dated growing up)\n\nUmm hello!!!!  She was waiving a HUGE flag here!!  She is Asexual!  If she came out as lesbian would you say she just has not meet the right man????\n\nNext you invalidate her fears of going through the same heart break that yourself went through trying to have other kids from miscarriages to a child who passed after a so short life!  Not everyone is as emotionally stunted as you that they could speak of those situations so devoid of feeling.  I am actually tearing up thinking about what you went through and how in your small mind you wish your own surviving child would go through it as well just to pop out a kid.  \n\nGet over yourself \"Mom\", and yes quotes, because you do not deserve that title any longer.  I hope this shows your amazing Asexual daughter that her life is 1000x better with out you in it.  Also, for your sake OP, go get therapy, you need to reconnect with your emotions.",
      "id": 284,
      "comments": [
        {
          "score": 600,
          "content": "As a therapist who works with LGBTIA+ young adults, I can tell you that you are in fact very invalidating to your daughter. You are so invalidating that that if I didn't have to organize a parent group session every Tuesday for 2 hours explaining how your actions/language will result in your children not talking to you anymore, I would think you are a troll. But this sediment exists, and I deal with it for 2 hours every Tuesday. I just got back from my group, and here is this mindset on my reddit page. \n\nI would seriously consider looking into the Trevor Project and the AVEN (Asexual Visuability and Education Network) for their information on Asexuality and Aromanticism.   \n\n\nYTA.",
          "id": 285,
          "comments": [
            {
              "score": 194,
              "content": "I'm ace. Never dated in high school and made up crushes to get people off my back \n\nMy mum tried to be supportive but took years to actually realise that me being asexual meant I wasn't going to suddenly find a male partner and be attracted to them and make babies. Same with friends. They 'accepted' it in theory but never in practise.\n\nOP is pretending to be supportive but really isn't good at hiding her disdain for her daughter not following the Life Script",
              "id": 286,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 177,
          "content": "As a lesbian I really want us talking about this more. The “just hasn’t met the right man yet” line is a page ripped right out of the homophobic parent playbook. I’ve heard it, you’ve heard it, the daughter has surely heard it plenty, time to stop rejecting your daughter’s identity and personal choices OP. I will not stop being the way I am and your daughter will not stop being the way she is just because you are the way you are (presumably straight). It’s time to accept diversity in the human population as a fact not a feeling. \n\nI’m proud as hell of your daughter and her lizard. Good for her for being so high-empathy that she can bond to a reptile like that. The world needs more people like her. More affectionate blue-tongued girl lizards like your grandchild. And fewer like you, who can’t see your way clear to loving them both. \n\nBtw I am in exactly this situation. 23f choosing to be childfree and I have a rescue pitbull who is (only slightly ironically) my daughter. And you know what my mom did? Started unironically referring to herself as a grandma. Whenever she sees my dog she asks her, “how’s my grandbaby!!!” She just leaned in to the whole thing and she is having a fantastic time. She’s super serious, I’ve now got a kitten too and she was like, “YAY! More grandbabies!!!”\n\nBe like my mom.",
          "id": 287,
          "comments": [
            {
              "score": 26,
              "content": "I teared up at this, your mum sounds awesome <3",
              "id": 288,
              "comments": [
                {
                  "score": 26,
                  "content": "She has whole conversations with them too, as a greeting, instead of just doing the happy baby voice nonsense talk while the dog’s jumping up and down happy to see her.  She asks all about how her “first grand baby” is, whether she’s having a good day etc. She’s too pure",
                  "id": 289,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "As an asexual, I have also been invalidated by my mum who has actually said (in a harsh tone) to me after a casual conversation about crushes that I am not asexual. She has no issue with any of my four gay family members being gay, but all of a sudden me being asexual is unacceptable? She’s also told me that I just haven’t met the right person yet. Obviously I haven’t told her that I’m not cis either, because like being ace, I’m the only non-cis person in my family. OP is definitely the AH",
          "id": 290,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "big agree. OP sounds exactly like my mother lmao. we don't really talk much anymore. YTA.\n\nedit: a word",
          "id": 291,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1698,
      "content": "YTA. Yikes. The joke flew waaay over your head didn’t it. You being hung up about the jokey lizard gender reveal, telling her you would do it for a “real kid” is a low blow. You’re not as comfy with her being child free as you say huh.",
      "id": 292,
      "comments": [
        {
          "score": 332,
          "content": "For me, this misunderstanding is indicative of a massive generational gap. Choosing to interpret this lighthearted excuse for a party as something it isn’t is revealing her real feelings towards her daughter’s childfree preference. I know for my mother’s generation, having kids wasn’t up for discussion (it was expected), let alone parody. Thankfully this generation seem to be having more fun and taking things less seriously.",
          "id": 293,
          "comments": [
            {
              "score": 186,
              "content": "I mean, the daughter DID tell her it was a lighthearted excuse for a party. And we aren't interpreting the refusal to go as the revealing of her real feelings, we are interpreting the \"I'm not coming to a gender reveal unless it's for a real grand daughter\" part as indicative of her true feelings. It's rude and hugely judgemental.",
              "id": 294,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "OP is 48 which is really not that old to be so crotchety. They just sound uptight as hell. I'm 42 (childfree) and totally would have been there. This sounds hilarious.",
              "id": 295,
              "comments": [
                {
                  "score": 37,
                  "content": "Yea, 48 is not old enough to use the gap as an excuse. Op would have been a teen in the 80s-90s… not exactly the 50s.",
                  "id": 296,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Imo OP understood it was a get together and just “missed the joke” intentionally to get uptight about the daughter not having a child. i don’t understand how in the world someone would actually be offended by a party for a lizard unless OP is really that dense.  and thought it was a genuine party for a lizard.\n\nedit: YTA",
                  "id": 297,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Nah, I’m older than OP and I thought the party was cheeky.   In fact, I’m on the edge of my seat wanting to know the reveal.  Also, my mom would have have been excited to go, so definitely not generational.  OP is just an asshole.",
              "id": 298,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Nothing goes over OP's head. She would catch it.",
          "id": 299,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}