{
  "post content": "I(22F) have been dating my boyfriend (25M) for two years. Last year, he broke his leg which left me to do allllll the driving in the relationship (which i had no issue with). One day I picked him up, and he threw a tantrum about us driving my car because it “isn’t comfortable”. He begged we take his truck to my house, and I reluctantly agreed, and made him aware I wasn’t comfortable driving it/never had driven a truck before. Later that day, he wants me to go pick up something for him and the only vehicle available to drive was his truck. I sucked it up and drove it, then scraped it along a cement pole. Long story short, damages are $1600. I believe we should split this bill, as he was the reason I was driving his truck at all. Also, I am a full time student with no income, meanwhile he makes a healthy salary. Should I pay the entirety with my life savings, when he makes enough in one week to cover the bill? AITA….",
  "id": 1,
  "comments": [
    {
      "score": 39,
      "content": "ESH. Without reading the details I was ready to vote against you, but honestly you were coerced into driving his truck, on an errand for him. I don't know if 50/50 is absolutely fair, as you were still behind the wheel and ultimately responsible, but since he can afford it and you can't it would be \"nice\" of him to be willing to pay half.\n\nAnd I hope your lesson learned is not to cave in to his coercion even if he says he's not comfortable. If you're not comfortable driving something, don't do it.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": ">but since he can afford it and you can't it would be \"nice\" of him to be willing to pay half.\n\nThis would be the decent thing to do on bf's part.",
          "id": 3,
          "comments": [
            {
              "score": 5,
              "content": "Totally agree. It will say something about his character how he handles it.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Right. Her comfort driving overrides his comfort as passenger",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 14,
      "content": "ESH: while the responsibility is technically yours for being behind the wheel, your bf put you in the situation to allow this to happen. \n\nAll that aside, a relationship is a partnership. It isn’t a good sign that a hardship comes up and it’s finger pointing instead of solving it together. You may want to rethink your future with this person.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "This is what insurance is for. But also, you damaged the truck and you are responsible for the cost of repairs. In this case, at least covering his deductible.",
      "id": 7,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "He's TA for throwing a tantrum when you're just helping him. At 25 that's just childish behavior. \n\nYTA for getting into an accident and not wanting to pay for it. If you couldn't drive the truck well enough to not scrape a concrete pole you should have stopped driving entirely tantrum or not, that's a safety issue. What he makes should not be a reason why you don't pay for it, responsibility should be on the driver. Maybe not immediately but over time at least. At the end of the day you chose to drive the truck. If you don't want to do something, don't do it (I understand it's not always easy but giving in to things like that ends up in situations like this). \n\nI sincerely hope this isn't the normal dynamic of your relationship.",
      "id": 8,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "You say he threw a tantrum, and that he begged, and that you reluctantly agreed. Those are some pretty strong words. If that's all accurate, then you're NTA, but also why are you with him in the first place? That's a ridiculous way to act about which vehicle to take.\n\nOn the other hand if you're overstating things to make it sound better, then Y T A.",
      "id": 9,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH\n\nNormally you'd be 100% responsible for the damage since you were driving. However, he made a situation in which you have to drive his truck, so some of the responsibility is his. Had he sucked it up and let you take your car, you would've been comfortable driving and probably not had the accident.\n\nSalaries aside, splitting the bill seems like a decent option to pay the deductible.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "Your accident - your responsibility. He shouldn’t be paying a cent. YTA.",
      "id": 11,
      "comments": [
        {
          "score": 4,
          "content": "he knew she doesn't drive a truck, i wouldn't pay crap",
          "id": 12,
          "comments": [
            {
              "score": 9,
              "content": "Well she did drive a Truck tho. Because in the end she choose to. Of course the Boyfriend heavily influenced her decision but it was still her decision, so ESH",
              "id": 13,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "But she decided to make that chose to drive one anyway - personal responsibility is a thing. Her inability to stand her ground to her partner is a whole other issue as is his treatment of her… doesn’t negate the fact she had the accident and she has to pay for the damages. Big lesson to learn.",
              "id": 14,
              "comments": [
                {
                  "score": -5,
                  "content": "there is no lesson, she warned him and he insisted. get off your weird high horse.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 4,
                      "content": "The lesson is if you sometimes need to say no … you don’t need a high horse to see that.\nYou must be American. Do what you want and them blame someone else when it goes wrong.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "[deleted]",
              "id": 17,
              "comments": [
                {
                  "score": -4,
                  "content": "clearly they didn't call the cops so she isn't being held liable, so here we are",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "This sounds like an expensive lesson on not driving a vehicle that you don't feel competent to drive. The only reason to put life/limb at risk by driving such a vehicle on public roads is if life/limb are already at risk and there is no other way to get help. (Pursued by axe murderer? Dead phone/no phone and someone is bleeding out? Go for it.)\n\nSurely, with a decently high salary, he also has decent insurance. If so, pay the deductable (regardless of whether or not he chooses to submit a claim). If not, cover the damages but do not drive him anymore. Let him Uber and never, ever drive his vehicle again.\n\nUnfortunately, it comes down to choice. He's an AH for manipulating you (and you should 100% consider whether this is a relationship that you should continue if he is prone to it), but in the end you chose to drive the truck when you knew that you shouldn't. He acted like a dang toddler and threw a wobbly to get you to agree, but you voluntarily got into the driver's seat.\n\nWhere I live, he could sue you for the damages (or at least his deductable and related expenses) and he would win. This is why you pay and this is also why you shouldn't give him a penny until he signs a statement agreeing that the payment covers all damages and releasing you from further responsibility. (IANAL, just paranoid.)\n\nShould he force you to pay after manipulating you into driving in the first place? Hell no. \n\nCould he legally come after you for it, provided whatever applicable statute of limitations on seeking damages hasn't expired? Yes. \n\nIs he likely to do this while you are still together?  Probably not. \n\nMight he do it if you happen to break up before such a statute expires? Yes, particularly if he is butt hurt over the breakup.\n\nBest to settle up and then decide if you really want to be with him. That said, given the emotional manipulation to get you to drive his vehicle, you are NTA for *wanting* to split the bill. \n\nI'd pay it anyway unless he'll sign something saying that the half payment releases you from any further responsibility. Again, IANAL, just paranoid.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Pay for the car and dump him. If he can afford to pay and he knows you can't afford it, then he doesn't care about you enough. Pay the bill, keep proof that you paid and only be in contact with him for this business purpose.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "Nta. You should pay none of the bill. If you said you cant drive it well and he had you do it anyway then its on him",
      "id": 21,
      "comments": [
        {
          "score": 7,
          "content": "[deleted]",
          "id": 22,
          "comments": [
            {
              "score": -3,
              "content": "Sounds like she tried to say no and he wasnt having it, sounds like his fault. I drive a truck and if someone said they werent comfortable driving it and never had before, I wouldnt let them. He fucked up still begging her to drive it knowing that info",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}