{
  "post content": "Okay for context, I’m 15 almost 16F dating my bf 16 almost 17M for around 8 months now. We’ve been friends for years before we started dating. We’re both Mexican but I was born and raised in Mexico before I moved to the United States while he’s a third generation immigrant so I speak Spanish and was raised with the culture while he was raised in America with Mexican family. Growing up I’ve always been a very affectionate person. I love to hug people I’m close to, and in Mexico and Spain, it’s a custom to kiss on the cheek as a greeting. As a culture we tend to be pretty touchy people in general and especially in my family I was raised as physical touch as the primary love language. So here’s where I think I may be the ass hole. Prior to me dating my current boyfriend, I’ve always been really touchy with my friends. Hugs, cuddles, forehead kisses, etc etc. So when we started dating, I honestly didn’t think anything of it especially because I’ve always been this way in front of him with other friends prior to us dating (while I had another boyfriend). And I’m only this way around my girl friends and it’s never meant anything to me except a platonic way of me showing my love to the people I’m close to. A few months back I hung out with some friends without my boyfriend and recently he let me know the way that I was touchy with my friend made him upset. I hadn’t even considered how this could’ve made him upset because it’s always been something that’s so normal to me and I know this sort of thing varies from culture to culture. I never intended to hurt him and I explained that to him and he was deeply understanding and told me it would just take him time to get used to it.  Up until that point we’d mainly just hung around each other so we’d never been on that situation before which is why it came up. But I’m starting to think I may be the ass hole because I struggle so much to give that form of affection up with my friends. And It’s never anything that I haven’t or wouldn’t have done with my close family members so am I the ass hole?\n\n(He knows I’m posting this btw)\n\nUPDATE: Me and my boyfriend talked about things and turns out the issue DOESNT have much with me being touchy at all. It was more specific to the person from the specific instance. They used to have a thing and they had a bad falling out so he’s been weary of her every since so his opinion toward her isn’t the most favorable and he said it spiked unreasonable jealousy in him. He’s been super sweet and understanding about everything and we’re working things through but yeah happy ending guys!",
  "id": 1,
  "comments": [
    {
      "score": 4,
      "content": "NAH\n\nThere’s nothing wrong w expressing platonic affection this way. Platonic intimacy is amazing!\n\nYour bf also clearly communicated his discomfort, and you responded as best you can. You’re both openly communicating and that’s the most important thing.\n\nMaybe if there’s some sort of —nonsexual—romantic physical affection you could show w your bf, both in private and w friends, that would comfort him? Seeing some difference in your affection for your friends vs your affection for him may comfort him by reminding him that that truly is how you show platonic affection and that your feelings for him are unique. You could also talk w him about if he’s uncomfortable w you expressing affection this way  in general or uncomfortable w witnessing it himself. Holding off when he’s present would be a reasonable compromise.\n\nIf at the end of the day, he’s uncomfortable w you being at all physical w your friends… this may wind up meaning that y’all are just not compatible.\n\nThe most important thing is to keep communicating openly",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "nta\n\nwhile this might be a cultural shock for him, its normal for your culture. you don't mean it romantically. has he told you why it makes him uncomfortable?",
      "id": 3,
      "comments": [
        {
          "score": 3,
          "content": "He told me it’s not soemthing he’s used to, especially because he only tends to act that way around me and he wasn’t raised with as much physical touch",
          "id": 4,
          "comments": [
            {
              "score": 1,
              "content": "as a fellow Latina, I also get these comments sometimes. but its our culture, and you shouldn't have to change it for anyone. ever. unless that someone is you. I would assure him its not at all romantic, maybe explain how its used in your culture and his its normal and *not romantic*. from what you said, it feels like he's insecure with your relationship because you do these things with people who aren't him. just assure him its completely platonic.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH\n\nFirst Gen mexican American here, I think he probably feels uncomfortable because it probably wasn’t something common that he’s seen. I am also somewhat a touchy person and also normal to me to kiss on the cheek as a greeting which is because im first generation so A lot of the Mexican norms and stuff are things I grew up with. There are some Mexican Americans that the more generations they are the more Americanized they are, depending if they try hard to maintain all or certain Mexican norms/traditions but it is inevitable that stuff slowly is erased out with each generation because they live in another country and exposed to another culture. I think he’ll come around especially since you guys talked about it and said he was understanding. It’ll take time but as long as you guys reach equal footing or are on the same page then you guys should be fine.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. This is how you grew up and it's a core part of your personality. I'm glad he was understanding so just go on doing you. If you feel like you want to change the way you act around friends, then go ahead, but don't feel pressured to do so. If he continues to have an issue with it, then you'll just need to have a discussion on your boundaries going forward if you want your relationship to succeed.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA I was raised like him but I accepted my ex when she did this I honestly felt like I missed out on a lot of my culture keep it up tell him to recognize that it’s part of the culture and maybe be less insecure",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. This is how you are and it doesn’t mean anything more than what it is. He needs to get over it or not and break up.  Can’t expect you to change who or how you are. In France everyone gives kisses on both cheeks it is what it is. Get used to it or go with someone else",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Being touchy with my friends while I have a boyfriend because it made him uncomfortable\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Nta",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay for context, I’m 15 almost 16F dating my bf 16 almost 17M for around 8 months now. We’ve been friends for years before we started dating. We’re both Mexican but I was born and raised in Mexico before I moved to the United States while he’s a third generation immigrant so I speak Spanish and was raised with the culture while he was raised in America with Mexican family. Growing up I’ve always been a very affectionate person. I love to hug people I’m close to, and in Mexico and Spain, it’s a custom to kiss on the cheek as a greeting. As a culture we tend to be pretty touchy people in general and especially in my family I was raised as physical touch as the primary love language. So here’s where I think I may be the ass hole. Prior to me dating my current boyfriend, I’ve always been really touchy with my friends. Hugs, cuddles, forehead kisses, etc etc. So when we started dating, I honestly didn’t think anything of it especially because I’ve always been this way in front of him with other friends prior to us dating (while I had another boyfriend). And I’m only this way around my girl friends and it’s never meant anything to me except a platonic way of me showing my love to the people I’m close to. A few months back I hung out with some friends without my boyfriend and recently he let me know the way that I was touchy with my friend made him upset. I hadn’t even considered how this could’ve made him upset because it’s always been something that’s so normal to me and I know this sort of thing varies from culture to culture. I never intended to hurt him and I explained that to him and he was deeply understanding and told me it would just take him time to get used to it.  Up until that point we’d mainly just hung around each other so we’d never been on that situation before which is why it came up. But I’m starting to think I may be the ass hole because I struggle so much to give that form of affection up with my friends. And It’s never anything that I haven’t or wouldn’t have done with my close family members so am I the ass hole?\n\n(He knows I’m posting this btw)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "INFO  are you touchy with guys or just girls?",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "Mainly girls. I’ll give my guy friends hugs and poke them but he’s never been uncomfortable with that",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "NTA You're not doing anything wrong. Even if you were touchy with other guys, you wouldn't be doing anything wrong - I only asked because his reaction to it would be more predictable. It's weird that you being physically affectionate with your girl friends would suddenly make him uncomfortable, but as long as he doesn't try to make you stop, he's not being an asshole himself. If that happens, it's a big red flag.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}