{
  "post content": "A friend of mine is an artist and has been doing an evening class in textiles. This term they’re making a dress. The instructor said they wouldn’t have enough of those tailor’s dummies and would anyone be able to use a live model. My friend volunteered and messaged me to see if I’d be able to help and I agreed. \n\nSo a couple times a week I’ve been going to his to have this dress fitted and altered and happily being pricked with little pins *its been a learning curve*. \n\nAnyway, the other night we were at a party. Me, him and friend (B) were chatting about the dress and she exclaimed that she was so excited to have it. Que my confusion. Honestly, I’d kinda assumed that he would want to keep it as a memento or he’d need to submit it or something. I’d have wanted to be offered. It’s literally a dress tailored to my exact measurements and B and I are not the same size. She’d have to get it altered anyway which IMO loses what’s special about the dress. I’ve also given up a lot of my time the last few weeks to help with the project, and we’re only half way there! \n\nClearly, I didn’t hide my reaction very well because she immediately said “hey, I asked first!” (INFO - we are in our late twenties, not 12yo). He awkwardly shrugged and agreed that she asked first. \n\nSo when I next went over I told him that I was a little caught off guard that he’d said she can have it. I pointed out her needing it to be altered and that it would mean a lot to me considering we’d worked on it together. He agreed and said it was all mine when finished.\n\nHe must have messaged her when I left because shortly after I get two angry messages from her, literally calling me an A-hole. So, what better place to ask, AITA?\n\nINFO - the reason I hadn’t asked for the dress was because I had assumed he was keeping it or would need it for his course. Hadn’t even occurred to me that he’d be giving it away.",
  "id": 1,
  "comments": [
    {
      "score": 7578,
      "content": "NTA. You have every right to ask for a dress that was custom tailored to your body while sacrificing your time to your friend. Hell, I would have just assumed it was going to be given to me by that point.",
      "id": 2,
      "comments": [
        {
          "score": 2068,
          "content": "Yep, and props to the friend for being good and decent to acknowledge that. Clearly, friend \"B\" doesn't share the same qualities. Why even get a piece of clothing if you're going to alter it? You don't go to a clothing store and buy the wrong size.. One could argue that it was free in this case, but still..",
          "id": 3,
          "comments": [
            {
              "score": 504,
              "content": ">Why even get a piece of clothing if you're going to alter it? You don't go to a clothing store and buy the wrong size..\n\nA lot of people alter their clothing to fit them. Off-the-rack clothing is made to fit an \"average\" body, which no one has. Altering your clothes can be an effective way of making you look expensive and put together, without actually being that expensive. \n\nEx. Men often wear shirts where the shoulder seam doesn't sit on their actual shoulder, because they needed to go up in size for a larger chest or belly. They can get the shoulder seam altered and look like they bought a custom shirt worth hundreds and it's only ~15 or 20 bucks.",
              "id": 4,
              "comments": [
                {
                  "score": 517,
                  "content": "True, but most people don’t buy custom clothes only to have them altered.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 128,
                      "content": "I agree. I felt like the person I was responding to had transitioned from \"here's my thoughts on the specifics of this AITA post\" to \"here's my thoughts on the altering clothes more generally\" so I commented in that vein.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 163,
                  "content": "I don't think that's what Dr. Purple is referring to though. There's a difference between buying the clothing that is the closest match for your size, then altering it, and simply buying a size 8 when you're a size 2.\n\nBesides, it doesn't really apply to OP's situation. Buying clothes from the store and altering it is way different than insisting a certain dress be yours in the middle of someone else's fitting.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "Off-the-rack is where I live",
                  "id": 8,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Ikr.  Hearing words like “tailored clothes” is like hearing a foreign language.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yeah like idk if it’s because my circle is mostly early-mid 20’s but I don’t know anyone who gets their clothes tailored, even those of us (like me) who are really into fashion and stuff. My friend got her wedding dress tailored but that’s about it",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "I'm keen on the idea of getting my off-the-rack clothing tailored to my size, especially if the price is less than 50 bucks to do it. What do I google, though? Last time I tried to investigate it sounded like I needed to invest hundreds.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Try searching for “clothing alterations”, your city. If you live somewhere with lots of business people or politicians, it should be pretty easy to find.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Depends on how detailed the work you need, but a lot of dry cleaning places will also do simple alterations or repairs. Higher end clothing stores (and even their outlet counterparts) may also offer it in-store, but it's more expensive and normally restricted to what you've actually purchased there. \n\nIt can add up if you're getting a lot changed but I think getting the shoulder seam placed correctly for a men's shirt/blazer is so impactful and affordable.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Whenever I've lived in a city centre I've always lived within walking distance of a clothing alterations place, I'm surprised others don't know where to find them. If you have a local mom-and-pop dry cleaners, they'll probably do it for cheap.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "You don’t even need to google, just take it into a dry cleaners or seamstress and they can talk about your options with you.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Shoulder seam alerted? So regular seamtress? I need to find those for my bf.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "If no one has an average body than it isn't average. That's why it's called average. If no one or very few people have it it's called an exception. I often find clothes my size, so does my brother, so do a lot of my friends. That's also why there are different sizes.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Like they say, an average person has one breast and one testicle.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "That's not how averages work. The average of 1, 3, 5, and 7 is 4, a completely different number. \n\nThe average height of a person is a single number, the actual height of individual people is a wide variety of numbers. Clothing designers can only choose one number. It won't be correct for most people, but it's still the average. People make it work or alter their clothes to actually fit. \n\nYou're describing a majority, not an average, which is not who clothing is made for.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Ok, as an old person, Imma gonna have to stop you there: if you work someplace that's 'business attire' only, the best thing you can do is get good quality, base pieces and take them to a professional to have them altered for you.  \n\nWarning:  Once you start doing this, you'll purchase clothes any other way cause you'll always be looking So Damn Good",
              "id": 20,
              "comments": [
                {
                  "score": 32,
                  "content": "Thanks for the input, I will be honest and admit that I don't have much experience with clothes-altering. I will look into that. \n\nI still believe friend \"B\" is salty because she is missing out on a free dress but that was obvious without my input.\n\nThanks again for the tip!",
                  "id": 21,
                  "comments": [
                    {
                      "score": 14,
                      "content": ">He awkwardly shrugged and agreed that she asked first. \n\nThis is such a stupid reply!   This guy needs to think a little more.  \n\nOP, you are definitely NTA!",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Can confirm. I will take something I bought from a store and have it altered. I only do it with very nice buttoned down shirts and suits. I love the way I look in them. I never quite understood the phrase \"Feel like a million bucks\" until I did. My wife seems to like it too, and her compliments when I wear them out for a meeting with a potential client gives me a nice confidence boost before something that is a little anxious and potentially frustrating",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "As a short person, I agree with you.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Most clothes that celebrities buy are altered to fit them exactly. The reason more people dont do this is the cost",
              "id": 25,
              "comments": [
                {
                  "score": 21,
                  "content": "Most clothes that celebrities buy are not even approachable by the average person, unfortunately. :/",
                  "id": 26,
                  "comments": [
                    {
                      "score": 7,
                      "content": "True, but even just regular jeans are fitted just for them. I'm saying that it's not unheard of for people to buy clothes that they will have to alter and for the friend she may just be excited to have something her friend made",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Having button up work shirts taken in at the waist used to cost me $7 and it makes such a difference on your silhouette as a female.  It’s inexpensive if you go to the cheaper parts of town as the tailors aren’t paying much for overhead on the building.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "> You don't go to a clothing store and buy the wrong size..\n\nI frequently go to a store and buy a slightly wrong size with the intent of having it altered. I've also had a dress gifted to me and had every seam on it redone making it one of my favorite dressed for years. Having a non-standard shape means off the rack doesn't fit right and it's frequently cheaper and better to have something tailored than to go hunting for that one unicorn brand that actually designs with your shape in mind.\n\nOP should have still had dibs if she wanted it, but if she didn't, I see nothing wrong with getting a gorgeous dress and having it tailored. The friend's reaction is the problem, not her *wanting* the dress.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "[deleted]",
          "id": 30,
          "comments": [
            {
              "score": 137,
              "content": "I'm thinking he didn't offer it.i can just picture that friend came over, saw the dress and gushed. Then when he explained it was an assignment, she asked to have it when it's done.\n\nFrom the story, he looks a bit pushover so he just went ok without thinking much.",
              "id": 31,
              "comments": [
                {
                  "score": 1,
                  "content": "That's a little flippant, no? Dude probably couldn't care less to whom the dress goes but got caught in the crossfire.",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "sometimes some men don't think about the social implications like some women sometimes do.",
              "id": 33,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "He probably just went wit the line of least resistance.  Friend B asked him for the dress.  He said yes.  Then OP was upset and he realised his mistake.",
              "id": 34,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "It's strange that the subject wasn't even mentioned during the lesson time though.  I think it's normal for the cost of materials to be covered when \"buying\" someone's educational project. \n\nIf it were me I wouldn't dream of taking any money in that situation though, and would be thrilled if a friend wore something they helped me make.",
          "id": 35,
          "comments": [
            {
              "score": 1,
              "content": "I would guess that he was covering the materials, since it was for his course.  He wasn't going to ask the friend who was already doing him a favor for money, and OP wasn't going to offer to pay for his schoolwork that she wasn't expecting to keep.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Assumed.\n\nWhy not just ask at the beginning? Assumptions lead to incorrect judgments. Much more reliable to research/experiment/ask whenever possible.",
          "id": 37,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "She did have every right, so why didn't she ask? She waited until someone else wanted it, then she made a big scene. ESH, especially the artist for promising it to the other girl and then going back on his word.",
          "id": 38,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "I agree with this.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -10,
          "content": "[deleted]",
          "id": 40,
          "comments": [
            {
              "score": 34,
              "content": "Let's say you were tasked with building cabinets for a kitchen and I let you use my kitchen as you don't have one.\n\nI let you come over every Saturday. I let you use my personal space. I let you pin and prick my walls without complaining. I let you make loud noises and send wood scraps all over. I make sure my kid is out of the house when you come over to work on your custom designs. I give you advice on what looks right. You make sure everything is perfect based on my personal standards.\n\nThen at the end your other friend says \"*OMGGGG I totallly want a new kitchen LOL!!! Can I, like, totally have all those cabinets?!?! They're liiike super-cute!\".*\n\nIf you said yes to them without at least *consulting* me first, I'd be pissed. Without me and my time, you wouldn't have those cabinets. Just because you were the \"builder\" doesn't mean it wasn't a dual effort.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "OP has been going over to his place twice a week for most of the term. That’s most likely dozens of hours that she’s given to her friend for the sake of his project, and the end result is a dress that’s custom fit to OP’s exact measurements. The friend is an asshole for not offering it to her in the first place. \n\nIf the friend specifically wanted to give it to someone else and made that clear, then I’d agree that he can do what he wants. But he apparently only gave it to the other friend because she asked, in which case he absolutely should have let OP have first dibs.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2737,
      "content": "NTA. Like it's literally a glass shoe and Cinderella situation. It's painfully obvious it was going to be yours. Your friend is a pushover",
      "id": 43,
      "comments": [
        {
          "score": 449,
          "content": "I read that as glass hoe laughed to death",
          "id": 44,
          "comments": [
            {
              "score": 187,
              "content": "[deleted]",
              "id": 45,
              "comments": [
                {
                  "score": 57,
                  "content": "Once there was a king- his kingdom was made up of houses made from the hay, mud and reinforced by waterproof grass fronds from the riverbanks. The king, naturally, had the biggest house, his being the only one in the kingdom to have two floors; a tricky bit of engineering for an all natural structure.\n\nEach year the king, on his birthday, would receive a new throne from his people - the first year they made him a wooden one from the finest trees in the forest. The year after, they had managed to find some tin and bronze, so made him a very happy king. Each year, the old throne would get taken upstairs to the storage as the king liked to walk amongst the collection and reminisce over years gone by.\n\nSo ten years had passed, and by now the nation of hut dwellers had become rich enough to buy gold. So this year, the king received a mighty throne. So his old one was taken away upstairs, the huge gold throne hauled in, and another year in the kingdom commenced.\n\nThis eleventh year however, was a tough year for the harvest. The sun belted down on the blacksmiths as they made swords and shields for the loyal warriors that protected the realm. They worked tirelessly for a month to make the biggest and most lavishly adorned throne anyone had ever seen.\n\nSo the king had his party, the new throne was presented. The grand entrance was only just big enough to get the throne through- but the skill and knowledge of the smiths made it possible.\n\nThe golden throne was taken upstairs to join the other nine from years gone by.\n\nThat night there was a tragic disaster- the whole royal family was killed as they slept, the whole place collapsed around them. The queen was dead, the heirs were crushed, and a new king was needed for the country. It was a sad night.\n\n*What is the moral of the story?*\n\n*Those who live in grass houses shouldn't stow thrones.*\n\n[Credit](https://www.reddit.com/r/Jokes/comments/11i6pj/the_king_and_the_thrones/) to u/squeaki, though I was told this one by my corny old botany professor nearly two decades ago. Figured I couldn't be the only one who'd heard it, and that a quick search would save me a lot of typing.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Thank you for the citation, I felt it was well relayed via my typed edition. It's fun to recall for a group around a campfire verbally. Can't say exactly when I heard it other than a vague recollection of being told it in the French Alps one evening.\n\nEdit: 7 years ago - hell's bells time flies, you have a [good memory](https://www.reddit.com/r/Jokes/comments/11i6pj/the_king_and_the_thrones/?utm_source=share&utm_medium=web2x) or epic google-fu.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "This is so cool! I don’t know how long it’s been around, but my mom told me that one when I was little, and I’m 50 now. This is the first time I’ve seen it anywhere else!",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "For a second there I thought this was a trojan horse thing lol. Thanks for the story.",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "lol",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Brick house glass hoes shouldnt throw tricks",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 101,
          "content": "The pushover comment hits here, it sounds like he planned to offer it to the op, but the girl B ambushed him about getting a custom dress and he didnt want to make her sad, and op hadn't asked so he probably was trying to play the sitcom guy who pleases both parties in an awkward situation but just never telling op the truth about where the dress was goin.",
          "id": 52,
          "comments": [
            {
              "score": 32,
              "content": "I can see how he got into the situation -- OP initially assumed she wouldn't be getting the dress, so he may well have had no idea she'd want it. Some things are obvious once you think about them, but if you don't think about them...",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "OMG, she's totally the evil step sister.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1964,
      "content": "NTA but artist friend is NTA too, because he did the right thing after discussing the situation.\n\nThe Ass is entitled friend (B) who pressured artist friend for the dress and acted like a spoiled child about it.",
      "id": 55,
      "comments": [
        {
          "score": 324,
          "content": "How did she pressure the artist for the dress?  She asked, he said yes.  No where in the post is it indicated that any pressure was applied.",
          "id": 56,
          "comments": [
            {
              "score": 592,
              "content": "With the \"I asked first\" nonsense at the party, when artist realized first friend wanted the dress",
              "id": 57,
              "comments": [
                {
                  "score": 288,
                  "content": "The 'I asked first' shows she wasn't surprised OP wanted and expected the dress.  She thought she found a loophole.  What a bitch.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 69,
                      "content": "Yeah, a nice person would have just let OP have the dress. Or at least asked OP. \"I asked first\" is bullshit.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 40,
                  "content": "Only because OP apparently made a face that indicated she wanted the dress.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 161,
                      "content": "She said she assumed he'd want to keep it as a memento or something but if the artists didn't want to keep it then wanting it back / having a bigger emotional stake on it and a greater \"right\" to it that a random friend or want involved at all is fair enough.\n\nNow being hurt that artist would give it to someone else not just want to keep it for memento is fair enough, ultimately it's the artists choice but still.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 267,
              "content": "\"you know that dress you're making with help from wiggle? I want it.\"\n\nWho just asks for people to give them random shit?",
              "id": 62,
              "comments": [
                {
                  "score": 234,
                  "content": "The same kind of person who yells \"I asked first\"",
                  "id": 63,
                  "comments": [
                    {
                      "score": 61,
                      "content": "If they are in their late 20s why are they still friends with this person is the real question.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "go look at choosingbeggers and you will see WAY too many out there.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Probably a female friend that knows their male friend doesn't want or need a dress for himself.\n\nIt's not really her fault OP assumed he would be keeping it and didn't ask. I imagine this happened quite some time after this project started and it would be an almost safe assumption that she would have asked first if she did want it.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 24,
                      "content": "they were about halfway through the fittings for the dress at the time of the party.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "see r/entitledparents with its many stories about parents who demand strangers give their kids something like the food they are eating, a toy, their seat, you name it. They're out there.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 17,
                      "content": "The anecdote subs are mostly karma farmers writing fiction",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "You mean normal people? Most people don't mind giving up things to friends when they don't need it themselves.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": "I don’t know how the initial conversation between them went down.",
              "id": 71,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 51,
              "content": "What kind of person asked for a dress that was custom made for someone else? That's a total dick move. If she wanted to dress she should have said, \"Hey. If your model isn't keeping it, I'd love to have that dress.\"",
              "id": 72,
              "comments": [
                {
                  "score": 29,
                  "content": "This, exactly. I think this is a clear-cut situation where dibs are: first the person making the dress (because he's putting far and away the most effort into it), then OP, then anyone else, in that order. \"Asking first\" doesn't disrupt that order -- and OP was respecting that order. B was not.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "“Well, I asked first” and getting defensive",
              "id": 74,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 99,
          "content": "He's kind of an ass for not asking OP if she wanted the dress before confirming to B that she could have it, especially given that OP spent time and got pricked in order to help him.",
          "id": 75,
          "comments": [
            {
              "score": 38,
              "content": "Sometimes you just have to apply Hanlons razor. It's just as likely that he was not being an ass but rather being a dumbass who was too afraid to stand up to somone who had the audacity to make a rude request.",
              "id": 76,
              "comments": [
                {
                  "score": 31,
                  "content": "But is a dumbass a type of ass?",
                  "id": 77,
                  "comments": [
                    {
                      "score": 22,
                      "content": "now we're getting somewhere",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Or that he figured if OP wanted it then she would have asked? It's possible he didn't give much thought as to where the garment would go and when friend B asked he just said yes because she was the person to express interest, but he revised upon being asked by the person who was donating their time.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 42,
          "content": "also the school? what kind of tailoring school doesn't have enough dress forms to have one available to each student?",
          "id": 80,
          "comments": [
            {
              "score": 3,
              "content": "Especially since they aren't even that expensive for a budget one. The OP's friend could have bought one and then kept it.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "I don’t think the friend is entitled, either. She asked and they guy said yes. Then he went back on his word. OP offered to help, I don’t think that entitles her to the dress, though I would’ve probably given it to her if I were the tailor.\n\nWhat’s wrong with asking for something? It might seem a little forward, but I don’t think it’s such a sin. The artist could’ve turned her down in a number of reasonable ways, but he did not. I’d be peeved too if a friend promised me something, but ended up giving it to someone who made a public scene about not getting something she never asked for. I wouldn’t send them messages, though. That’s the only asshole thing I think she did.",
          "id": 82,
          "comments": [
            {
              "score": 17,
              "content": "It's that \"might seem a little forward\" part. I wouldn't minimize it like that.",
              "id": 83,
              "comments": [
                {
                  "score": 4,
                  "content": "It’s on the artist to decide who he wants to give the dress to. We don’t know if girl B pressured him or simply just asked.",
                  "id": 84,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I think calling OP an asshole really takes it over the line. But, I also think B should have recognized that OP had a prior claim, as the model, whether she'd expressly asked for the dress or not.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Mostly agree, but I think the \"I asked first\" comment twists it around - it changes it from an innocent request to something where she expected it to be a contest, and she'd won because she 'got there first.' \n\nIn my eyes, that shows that B knew OP would want the dress, which is what makes her TA.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I dunno, the moment I realized the model friend wanted it and hadn't been consulted, I'd have backed off the dress and welcomed her to it. Not argued that I asked first.",
              "id": 87,
              "comments": [
                {
                  "score": 2,
                  "content": "That's because you are nicer than \"friend B\" We can't expect her to act like you, because She Asked First!",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "i feel like no one is the asshole. the artist probably just didnt consider it much.  was more like \"sure whatever\" approach at first.",
          "id": 89,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 793,
      "content": "NTA—OP did not know the dress would be given away. Had she known, she clearly would have asked from the get-go.\n\nFriend (ex-friend?) is not getting stabbed and the dress is not her size. First come first serve doesn’t apply here. She has no right to the dress if OP wants it.",
      "id": 90,
      "comments": [
        {
          "score": 192,
          "content": "Yeah I feel like in terms of claim and right to the dress her goes 1. Artist 2. OP 3. Anyone else in the entire world.\n\nAs in if artist wanted it for themselves whether for memento or to adjust to wear themselves after then they should get it unless prior discussed (tbh they should've discussed regardless at beginning if OP or artist keeping it). If artist does not want for themselves them the one who spent a while helping the artist by modelling repeatedly for adjustments etc should get it if they want it.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I agree NTA. When the artist promised to give the dress away neither him nor friend B had considered OP's  opinion, who was clearly a big part of this project. The artist made the right move by agreeing to give the dress to OP so he's not TA, but imo friend B should've realized OP has the right to get the dress if she wanted it.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 288,
      "content": "YTA. Everyone who's saying you are not the asshole seems to be unconsciously answering the question \"who should he give the dress to\". But that's not the situation.\n\nYou didn't expect to get the dress in the first place. You didn't assume he was giving it to you, and you didn't ever express any interest in having it - you just helped out your friend.\n\nThen, *after* you knew he had given it away, you put him in a very awkward position by asking him to break his word to another friend, in circumstances where it would have been very uncomfortable to refuse you - since you were, it sounds, there to wear it and \"help\" him some more.\n\nWould it have been nice of him if he had originally offered it to you? Yes. Are you an asshole for what you did? Also yes.",
      "id": 93,
      "comments": [
        {
          "score": 258,
          "content": "It makes no sense for friend to give it away to some rando.\n\nNTA",
          "id": 94,
          "comments": [
            {
              "score": 26,
              "content": "It’s not a rando, it’s a friend of the artist and she asked the artist if she could have it. The dress belongs to the artist and he gets to decide what to do with his property. He decided to give it to her. If OP wanted the dress so badly, she should’ve had the forethought to ask long ago. But instead she put the artist friend in an awkward position by asking for something that was already promised to another person. YTA.",
              "id": 95,
              "comments": [
                {
                  "score": 119,
                  "content": "It’s so obvious that if the friend was going to give the dress away to anybody, OP should have first dibs.\n\nNTA",
                  "id": 96,
                  "comments": [
                    {
                      "score": -1,
                      "content": "No such things as dibs in an adult world.",
                      "id": 97,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -12,
                      "content": "I do agree that it would’ve made sense for the artist to give the dress to OP if he never intended to keep it, but it’s still an A-hole move for OP to ask for it after it was already promised to another person and to put the artist in an awkward position (although the artist isn’t completely blameless either for how he ended up in this situation).",
                      "id": 98,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "Op and the artist made the project together. As a team. She should have a say in where it goes. It's not up to him to unilaterally decide where it goes. NTA.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 3,
                      "content": "They did not make it together. Was she helpful? Hell, was she vital? YES!\nIf I'm a model for a nude art class would I expect to keep every sketch or painting I posed for? No, that'd be insane. If I stated that I \"made the art\" together with the artists and should get dibs on the work produced, would people look at me like I'm a little crazy and very entitled? Yeah, I think they would.",
                      "id": 100,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "...You literally just said it was the artist's decision. The artist decided \"Hey, I was going to give it to this random girl, now I'm giving it to the model it's being made for.\" OP didn't put them in an awkward situation. OP expressed their opinion, and the artist agreed, then the friend called OP an asshole for the artist making their decision. If The artist had said friend was getting the dress and OP had then thrown a tantrum, they'd be TA. If the friend had been like \"Oh, OK, it's a bummer but it isn't my dress,\" no one would be TA. But the friend was a jerk about losing an item they weren't entitled to, so OP is NTA.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "OP would've asked to get the dress in the first place had she known it was going to be given away, though. She just assumed that artist friend was going to keep the dress as a memento- she literally says so in the post- and only asked *after* she knew it was going to be given away.\n\nOP's friend didn't offer. The friend was *asked*. The friend was also *asked* by OP after she realized the dress was to be given away, and since OP was actually there working for it she had a better claim to it, thus the friend said yes.\n\nOP is NTA, and though I understand *why* that friend (ex-friend?) Is angry, she's still being an entitled prick about it (\"I asked first\", seriously? Is she 12?).",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "I would say she likely didn't ask because she assumed he'd want to keep it for himself and deemed it appropriate when she realized that he would be okay parting with it. NTA",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "It's crazy how far I had to scroll to find this. Idk what this thread even is. OP is clearly YTA and idk how anyone else could even reach another conclusion.\n\nShe was perfectly fine with the dress ending up in the artist friends closet, or sitting in a classroom collecting dust somewhere UNTIL she heard that her friend was getting it. Now she wants to claim \"its our project\" \"we worked on it together\" \"all my time going into it\" etc. when 2 minutes prior to friend B asking for it she cared so little about it it hadn't even occurred to her to ask for it. If you were genuinely interested in the dress you should have just asked from the get go what artist friend was going to do with it. But you didn't do that because you didn't care about the dress. You just don't want friend B to have it. YTA",
          "id": 104,
          "comments": [
            {
              "score": 5,
              "content": "Normally I would agree with your line of thinking. BUT seeing as the item in question is a custom tailored dress I'm leaning towards esh. The dress was literally made for her. Edit: changed esh/nta to esh.  As others brought up it's kind of surprising she made it that long without inquiring about the fate of the dress. I feel like that's a pretty natural topic of conversation when you're at a fitting for said dress.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Now that you mention it, yeah that doesn't sound like she was interested in it in the first place. She's definitely an asshole and her artist friend is a real pushover. In fact the one in this situation who's not an asshole is probably the other friend B. I would be pissed too if i were her. YTA!",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "A lot of posts here are clearly YTA or ESH, but everyone always takes the side of OP. It blows my mind. And when someone finally speaks up and says YTA, everyone gangs up on them.",
              "id": 107,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Seriously - the time to have a discussion about OP keeping the dress was way before she found out it was promised to someone else. And before anyone says \"it's tacky to ask if you can keep the dress\" all OP had to ask was \"Hey, what's happening with the dress after you're done with it? Does the school keep it or do you get to?\" That's not tacky or rude, and then OP could have used that information to ask if he would mind letting her have the dress.\n\nSo now you have the artist who has upset a friend of his by promising her a dress and then taking it back, but what choice does he have? He still needs OP to help him with his project, so there's an element of coercion here in OP asking for the dress now. Can he really refuse her and risk OP walking away from the project and ruining his grade? What are the chances he'd be able to find another live model with OP's body dimensions on short notice.\n\nOP YTA for sure.",
          "id": 108,
          "comments": [
            {
              "score": 72,
              "content": "I like how you didn't realise your method is legit more conniving. In your scenario you only care about the dress but you framed it as if you were curious about what they're doing which is hella manipulative but you acted as if that was ok. Hilarious",
              "id": 109,
              "comments": [
                {
                  "score": 47,
                  "content": "Asking what happens to the dress afterwards isn't manipulation, it's consideration. Asking for it outright, no matter OP's timing, would still have been rude. You don't know if the artist is keeping it, the school is keeping it, if the artist is selling it, etc. It's rude to try to ask for possession of it before you know what he intends to do with it. If the artist says, I don't have plans for it, the BEST response would be to offer to BUY it. Which no one has mentioned. :( Poor artists, always being hit up for free work.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": ">I like how you didn't realise your method is legit more conniving.\n\nIt's also more polite. Knowing what you want and being respectful in trying to achieve it often works - I wouldn't really call it conniving.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 11,
                      "content": "No, being \"polite\" was exactly what OP was doing. Not saying anything during the fittings so as not to put him in an awkward position if he wanted to keep the dress. All that \"oh, by the way, what do you plan to do with the dress\" is more transparent than you seem to realize.\n\nI'm sure that you are correct that \"Knowing what you want and being respectful in trying to achieve it often works\" but that doesn't make what you suggested polite. Knowing how to get things from people has a different name. The name you don't like to use.",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "No, not really. If I know that I want to keep the dress, I'm not going to just ask straight out if I can keep the dress, because I don't know what's happening to the dress when he's done. That's rude.\n\nAsking what is happening to the dress will let me know if it's acceptable to even broach the subject of keeping the dress. That's not manipulative at all. I'm not \"acting like I'm curious,\" I'm genuinely curious about what happens with the dress because I'm interested in it. When I find out the artist keeps the dress, then I'll ask for the dress.\n\nJust asking straight out \"Hey can I keep this dress?\" is rude because you're making assumptions about what happens to the dress, but in any case, OP just straight out asking would have been better than assuming and then getting butthurt that someone else already asked for the dress.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "I knew there was something wrong with that. You put your finger on it.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Did you seriously not even read the post? Because \"you didn't even expect to get the dress\" is wrong.",
          "id": 115,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Reminds me of that Louis CK bit, where he's on a plane and it is the first ever time that they had Wifi on the flight. After 10 minutes, it ends up breaking, and one of the passengers gets super mad about it. Louis says 'you're mad about something you DIDNT EVEN KNOW EXISTED 10 MINUTES AGO\"\n\nOP didn't even expect to get the dress, and only got mad once she found out the friend was gettingit.",
          "id": 116,
          "comments": [
            {
              "score": 14,
              "content": "Except it’s more like being mad that you don’t have WiFi, when you are the one who helped wire the plane, but they gave it to the girl next to you.",
              "id": 117,
              "comments": [
                {
                  "score": 1,
                  "content": "...because sHe AsSeD FiRsT!",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He should have asked op if it was ok when the other person asked for it. NTA. Artist is an asshole for not considering her first",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "[deleted]",
          "id": 120,
          "comments": [
            {
              "score": 3,
              "content": "But if it’s a painting of you that you sat hours for, you have more of a claim to be the recipient if the artist is just going to give it away. In fact, in this example it’s creepy for someone else to want or have it.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "But if the painter isn't planning on keeping the painting then she should at least get first dibs on the painting if the painter is giving it away... she did afterall donate the time free of charge and the dress was literally tailored for her body. It's like saying the painter would have to paint over some bits to fit the asshole friend when it was perfect how it was first made.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I totally agree. It was my impression she helped her friend without the expectation of any kind of compensation; the fact that she did, in fact, expect to be compensated with the dress and didn’t make that clear from the beginning makes her TA. Making a big deal about it in front of the designer and B even further solidifies OP as TA imo. \n\nA favor is a favor unless *explicitly* stated otherwise. Coming in at the last minute and saying “ummmm actually I want the dress” when B had already expressed interest seems very assholish.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 180,
      "content": "So everyone saying NTA thinks the other girl is an asshole because she's mad that she's not getting a dress that she asked for and was told she could have?\n\nI don't think OP is an asshole either but I can totally see why the friend would call her one.\n\nNAH",
      "id": 124,
      "comments": [
        {
          "score": 177,
          "content": "I think she crossed a line by sending angry texts calling OP an asshole. Not cool.",
          "id": 125,
          "comments": [
            {
              "score": -5,
              "content": "Why shouldn't she be angry though? She asked the artist for the dress and was told she could have it, but then OP just gets to have it despite never showing an interest in wanting or even what will happen to it? From the friend's perspective, OP took the dress just so the friend couldn't have it",
              "id": 126,
              "comments": [
                {
                  "score": 20,
                  "content": "What makes me scratch my head, is why she would ask for a dress that was modeled for another friend?  If she really liked the dress and the fact that she would have to alter it didn’t bother her, she could have said to the artist “hey if you’re not keeping the dress, and OP doesn’t want it then I would love it”, take her place in line, so to speak.  \n\nI’m baffled someone would ask for a dress clearly made for someone else 🤷🏻‍♀️",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "I was gonna add that to my initial comment, but friend doesn’t know anything about OP’s motivations. It she had angrily asked “why did you only want the dress after I talked about it?!” and OP had answered honestly and nicely, might have been different. But she opened by calling OP an asshole.",
                  "id": 128,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "THANK YOU, WHY IS NOBODY SEEING THIS",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Nope, I think the friend is the asshole for not offering it to OP first.",
          "id": 130,
          "comments": [
            {
              "score": 2,
              "content": "Well the friend clearly didn't know she was interested in it, I don't think that's his fault.\n\nI get the whole being polite by not asking angle, but IMO that's on OP for trying to be too polite.",
              "id": 131,
              "comments": [
                {
                  "score": 3,
                  "content": "I mean, it also would've been the polite thing to do on his part that, when asked for the dress, his reply should've been \"I don't mind giving it to you, but OP's been helping me with the project. Let me see if that's alright with her before I reply.\"",
                  "id": 132,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Exactly this, he should have asked his friend who is helping him on the project.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I agree, it would have been polite, but I don't think it makes him an asshole that he didn't think to do that.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Cultural difference? Parents let aggressive child who \"called dibs\" on shotgun sit there all the time?",
          "id": 135,
          "comments": [
            {
              "score": 5,
              "content": "That's quite different, you can take turns with a seat.\n\nThey're not gonna take turns refitting the dress.",
              "id": 136,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "not sure being an aggressive child is a culture...",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I think the friend who wanted the dress is an asshole for acting so childish about it. It’s the artist’s dress not hers",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 178,
      "content": "NTA. I don't know if she's the asshole or him but if she wanted the dress she should have modeled for it.\n\nMaybe he's the asshole for not asking her.and then giving it away to the first schlub of the street who asked for it. Maybe it's her for refusing to model but wanting the dress anyway.\n\nBut you have up time being picked with pins and deserve something more than a shitty text out if it",
      "id": 139,
      "comments": [
        {
          "score": 51,
          "content": "Asking for something doesn't make one an asshole. The friend asking for the isnt in and of itself wrong. And to be fair, the dress belongs to the artist, to do with as they please. Modeling for the dress does not mean OP is entitled to it unless prior discussion took place.\n\nWhat makes one an asshole is the reactions. The friend shouldn't have acted all childish but on the other hand, we all would be upset if we were promised something only to have it taken away. \n\nI am really torn between NAH and ESH, but I guess this is a situation that I can see all sides of it and everyone does have a bit of a point.",
          "id": 140,
          "comments": [
            {
              "score": 38,
              "content": ">Asking for something doesn't make one an asshole. \n\nand that's the crux of it, because some of us think there are times you should not feel entitled to ask, and some think you should ask for anything you want and if you ask first, you win.\n\nIt's a clash of societal norms.",
              "id": 141,
              "comments": [
                {
                  "score": 5,
                  "content": ">some think you should ask for anything you want and if you ask first, you win.\n\nIt's not really that; I was raised with a \"it never hurts to ask\"/\"you won't know until you try\" type of attitude. It's not like I was taught to go around asking people if I could have their house or their car and feeling entitled to whatever (honestly I'm kind of the opposite), just that you can't really judge a book by its cover and you shouldn't limit yourself to what you think might happen. It's really strange being on this sub and having someone argue that if I ask if I can pet someone's dog, it's pressuring them to comply and I should feel bad that they can't say no for whatever reason.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 30,
                      "content": "See you do recognize there are times when you should not ask (for their house or their car) so it's not that \"it never hurts to ask\" it's about where you draw the line so as not to be rude. It helps to carefully think about what position you are putting the other person in. Some of my personal guidelines are:\n\nAsk for a raise? Absolutely, it's the bosses' job to say no if they can't. Ask if there is any additional discount coupon in a store? That's expected and can pay off. Ask a person you met if they'll go out with you? Sure.\n\nAsk someone you are eating with \"are you going to eat that\" before the meal is over makes them feel like they should give it to you even if they were going to finish it. Asking for favors from friends and neighbors all the time without doing as many things back that they appreciate, is not fair. Asking for a loan from a friend? Never, unless, of course, it's like $5 you need and you pay it back right away, like within a day. But not a real loan, tho.\n\nAbout the dogs, better to wait just a minute to see if the owner suggests you do or don't pet. Some owners know that their dog can bite but are reluctant to turn you down. That one is more a matter of safety.\n\nAsk an artist for a dress halfway through it being made when you know there is a person it will fit perfectly who is giving her time to the artist for fittings. That's way over my line.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I would’ve gone with NAH until I read Friend’s response.\n\nIf Artist promised me something, then realized they couldn’t honor that promise, I would never go and insult/harass the other party. Friend calling OP the asshole over a miscommunication caused by Artist is just rude behavior.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 156,
      "content": "[deleted]",
      "id": 145,
      "comments": [
        {
          "score": 17,
          "content": "This is exactly what I was looking for, everyone acted and reacted quite poorly. Not a life or death situation but everyone was being a dullard",
          "id": 146,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I agree with everyone sucks to some degree. Op I fee is the lesser of three evils though. While she assumed he would keep it, he also didn’t ask her if she would want the dress after if he would be able to keep it but not want it, offering it to your model should be the first thing you do.",
          "id": 147,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Yeah. I think you hit the nail on the head.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Underrated comment",
          "id": 149,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 74,
      "content": "YTA\n\nDont make assumptions (and why would a students project ever be permanently kept by the university?) - you couldve just asked up front.\n\nYou gave up your time to help your friend. Thats very nice, and consistent with normal friend behavior. Yay you. However, that gives you no right or reasonable expectation to your friends work product - you couldve asked first. You didnt.\n\nCongratulations, your failure to communicate well instead of making assumptions has led to conflict with another friend, a friend who was capable of communicating clearly, and who has now been betrayed by two of her friends - you, the poor communicator who selfishly worked to undermine the dressmakers promise, and the spineless dressmaker who took back his promised gift",
      "id": 150,
      "comments": [
        {
          "score": 78,
          "content": "I think B is a bit of an AH for saying \"you're making a dress, can I have it?\" Sure, that's clear communication, but it's also pretty much against social norms to ask for such a big gift from a friend. Like, if I had a friend and saw them knitting, it would be a faux pas to say \"can you knit me a blanket?\" (although there would be a polite way to ask for a gift for a special occasion or offer to pay.) It would be a whole new level of faux pas to say \"can I have that when you're done with it?\" \n\nIt is possible that it went more like \"oh cool, you're making a dress? What are you going to do with it when you're done? No plans? Could I maybe have it? It would be so cool to wear a dress you made.\" That's polite enough, but Artist Friend really should have considered OP at this point, and said \"I'll ask OP if she wants it because it's fitted to her, but if she says no, it's yours.\"\n\nIt is also a faux pas to ask Artist Friend to break his promise, but I'm giving OP a pass on this one because he shouldn't have promised it to B without considering whether she would have wanted it. And I totally give OP a pass for not asking for the dress because, like I said, it would have been a bit of a faux pas to ask for a gift that large and put Artist Friend in an awkward place of not wanting to say no even if he really wanted to keep it.",
          "id": 151,
          "comments": [
            {
              "score": 65,
              "content": "I give OP a pass as well because it was a custom piece of clothing fitted to her body specifically. It would be like if an artist painted a portrait of me without us explicitly discussing that I am getting it. Then I find out he's giving it to some random hipster friend who thinks it will look cool in their loft.\n\nWait, what? That is a picture of me and I sat for it! You aren't even going to ask me if I want it before you give it away?",
              "id": 152,
              "comments": [
                {
                  "score": 18,
                  "content": "Exactly.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This exactly.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Perfect metaphor!",
                  "id": 155,
                  "comments": [
                    {
                      "score": 6,
                      "content": "This happened to me... I found the portrait of myself in a restaurant!!",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "You don’t even know that that’s how they asked for the dress though. \n\nAnd how is it rude? I’ve had friends say things like, “yo if you don’t have anyone in particular in mind for that hat I’d love it,” and there were no hard feelings if it was already earmarked for someone else.",
              "id": 157,
              "comments": [
                {
                  "score": 12,
                  "content": "You wouldn't think it should first be offered to the person who it is being fitted to? \nFriend B is a giant AH for asking in the first place without a big fat disclaimer of OP getting first dibs.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 12,
                      "content": "If the designer didn't say anything about OP, there's really no fault. B had no chance of knowing if OP even wanted to have the dress or that the designer would give it away without asking OP.",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yeah, I get that and acknowledged that it may have been more like you said, in which case Artist Friend should have checked with OP first before saying yes to B's request. But I am personally more like OP in that I wouldn't want to accidentally pressure someone into doing a kindness for me, or have them feel bad for having to say no, so I wouldn't ask. It would have been fine for OP to ask her friend what his plans were for the dress, now that I think of it, but I guess it hadn't occurred to her to ask until she found out it was being given away. \nI also sympathize with how she must have felt to hear that B was getting the dress, like \"do you see me as a second-class friend? Did you never consider whether I would want it?\" I even suspect that if Artist had asked OP to help him make a dress for B (with that stated purpose) she might have agreed to help, but the way the news came out, it made OP feel like, even though she was going out of her way to help Artist, B was his favored friend and he never considered OP's feelings.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I can’t relate because I would have asked. And I wouldn’t feel like a second class friend because I was too much of a pussy to ask about it. But different strokes for different folks. \n\nand you’re assuming a lot about OP with zero backing evidence.",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "[deleted]",
              "id": 162,
              "comments": [
                {
                  "score": 1,
                  "content": "Good thoughts. Yes, after thinking about it more, your scenario is probably more likely for his she asked, and I think it may be very possible that the dressmaker thought OP didn't like it, if she wasn't gushing over it like B was.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "We have no idea how the conversation went between friend B and Artist. Just pointing that out. Everyone here seems to assume she just boorishly demanded the dress, \"GIMME THE DRESS!\" and Artist meekly responds, \"...yes, Master.\" It's technically a possibility it happened this way,  but we really have no way of knowing that, and it's a little ridiculous to assume.\n\nSpeaking more directly to your comment: you say that you give OP a pass because it would have been a faux pas to ask for the dress in the first place. I totally agree that it would have been a faux pas, but OP gave no indication that she knew that or considered that. She said she just never considered asking for it (because of some assumptions, but I don't think she actually considered why she never asked for the dress until she realized, \"O shit, she's getting it?! I have more claim than she does!\" ...paraphrasing and making assumptions on her verbage, I know.) I say that because an even bigger faux pas (much, much bigger IMHO) is how she handled the situation after finding out B was getting the dress. So I don't think she gives a tiny rat butt about social gaffes.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Making the dress was a team effort between op and the dressmaker. It was his failure to communicate when someone else asked for it that caused this situation, not her.\n\nNta",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 68,
      "content": "Nta- you soent hours being there for it and had assumed if he had wanted to keep it but to give it away and then have yto change the most special thing about it makes no sense and if she had wanted the dress that bad she should've seen if she could model for it and switch out with you to stop wasting your time as soon as she found out",
      "id": 166,
      "comments": [],
      "relation": "Support"
    }
  ]
}