{
  "post content": "So shopping yesterday, I told my wife that I would like a sandwich that we make that has some Pesto Basil sauce on it.  My wife asked what ingredients we needed to make the sandwiches and I stated one, which was the sauce.  She says \"We have that in the fridge at home, we don't need to buy more.\"  I replied with \"Well, it's probably over 2 months expired and I would like to get a new one just in case the one at home is no longer good.\"  (We live 20 miles from town so it would suck to have to go out and get more, yeah wasteful but I don't want to take an HOUR for a $6 ingredient that may or may not be good.)  She comes back with a snarky \"Why is it still in the fridge then.\"  I reply with \"Nobody threw it away.\"  She immediately starts to berate me saying that I should have included myself in the response.  I told her I did when I said \"NOBODY\" which includes me.  She didn't take that as acceptable and we fought for nearly 4 hours on little things because she thought I was being an @$$hole.  To me it was a perfectly normal and civil conversation until that moment.\n\nShe's constantly calling me a gas-lighter and saying how my responses are construed as me being a complete asshole and quite frankly, I think SHE'S the gas-lighter on how she is treating me and saying I am doing things I am absolutely NOT doing.  She thinks ANYTHING I say is not the right way of doing it...  I have no problems with anyone else and she always states \"You don't talk to your friends this way\" when I absolutely treat her no differently than anyone else, other than she is my wife and I do respect her and love her, but lately things are going down hill with how she portrays the way I act.\n\nSo, am I the asshole for not including referring to myself in the above situation?\n\nEDIT:  So we didn't argue for 4 hours over the sauce itself...  But it was that subject that caused her to start nit-picking EVERYTHING I said...  \"Should we get lettuce or sprouts?\"  \"I don't care, whatever the hell you want.\"  \"Well, I'm asking you what YOU prefer on the sandwich because I'm not picky, I'll eat just about anything.\"  So yeah, wasn't 4 hours of SAUCE arguing.  ",
  "id": 1,
  "comments": [
    {
      "score": 30,
      "content": "ESH - ya'll got more issues than condiments.  Find a therapist and work them out.",
      "id": 2,
      "comments": [
        {
          "score": -17,
          "content": "Right?",
          "id": 3,
          "comments": [
            {
              "score": 17,
              "content": "Jesus Christ...I can see how she's so instantly and easily annoyed with you.",
              "id": 4,
              "comments": [
                {
                  "score": -7,
                  "content": "Yo stop being negative",
                  "id": 5,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "Pretty sure it's not just the pesto that is past its expiration date.",
      "id": 6,
      "comments": [
        {
          "score": -25,
          "content": "Yeah, 21 years of marriage, bound to get old and rotten, huh?",
          "id": 7,
          "comments": [
            {
              "score": 12,
              "content": "No, not necessarily but it sounds like you two got some issues. Counseling?",
              "id": 8,
              "comments": [
                {
                  "score": -24,
                  "content": "I will admit, I am a disabled vet with some PTSD issues, but I feel if anything, I should be getting help from my wife, not getting yelled at.  I am in counseling and have been for a while.  I have gotten MUCH better, but things still exist on my side that I wish I could shake.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I think they mean COUPLES counseling. As in you both go and have a trained/neutral 3rd party determine who the AH is and give you both steps to fix it.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Your specific marriage might need some professional care and counseling, yes.\n\nMy parents are going on fifty years next month without your issues.  My grandparents had sixty three and fifty nine before one died - without old and rotten coming up.\n\nSo it’s not a “bound to be old and rotten” thing.  Just a normal “relationship needs work and communication” thing which can come up two, twelve, or twenty years in.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I've been married for 25 years. We are still happy. We also treat each other with care. And if one of us says something impatient the other one doesn't reply in kind.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "When sauce leads to a 4 hour fight, there is a lot more wrong than you are willing to admit.",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "YTA just because you're doing something my wife does that drives me crazy. You know there's an expired jar of pesto in the fridge. Why didn't you throw it out? She thinks there's usable pesto in the fridge, so she hasn't realized it yet, but you know it has to be old. So why didn't you just throw it away?",
      "id": 14,
      "comments": [
        {
          "score": 1,
          "content": "To be honest, I wasn't aware of the sauce in the fridge.  I hardly even go in the fridge...  My daughter helps me out due to my mobility issues and she's the one that helps me get the ingredients.  I probably haven't touched the fridge in 2-3 months.  I didn't know if it was good or bad IF we even had it.  I am usually the one that cooks dinner and breakfast, but always need help with it.  My wife is the one that always takes inventory of everything before we go shopping.",
          "id": 15,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "This could be interpreted either way depending on the tone that was used when you said it.\n\nBased on what you posted, it sounds like you both would benefit from marriage counseling, but that's just my armchair reddit diagnosis.",
      "id": 16,
      "comments": [
        {
          "score": -1,
          "content": "I said it with a normal tone and in no way had suggested anything otherwise.",
          "id": 17,
          "comments": [
            {
              "score": 3,
              "content": "Do you often leave her with the majority of household chores? Because your comment could have been seen as a passive aggressive slight about how she needs to clean out the fridge.",
              "id": 18,
              "comments": [
                {
                  "score": 1,
                  "content": "Negative.  I do a majority of the house work and work 11-12 hours a day with a 1 hour drive each day.  She works close to home and only 6-8 hours a day.  I do way more than my fair share of work around the house.  I do the deep cleaning at least twice a week of the bathroom and rest of the house.  My daughter takes care of the cats and my son takes out the garbage.  My wife literally does absolutely nothing when she gets home except reads her books.  I am the one that cooks breakfast and dinner almost every day.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Well, maybe clean out the fridge.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Ngl... I read this as pepto bismol sauce the first time.",
      "id": 21,
      "comments": [
        {
          "score": 2,
          "content": "Minty pink sauce...",
          "id": 22,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "This reminded me of my parents. ESH.",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "You both need to take a step back. she got mad because she didnt think \"nobody\" implied you, you told her it does. \n\nThere are ways to diffuse the situation and if she feels that you do this frequently with her a simple \"i meant neither of us threw it out, sorry I didnt mean just you\"",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "That's pretty much how I handled it.  But after the conversation with the sauce, she would nit pick EVERYTHING I had said, no matter my tone or the conversation subject.",
          "id": 25,
          "comments": [
            {
              "score": 2,
              "content": "Sometimes its a hard pill to swollow when you learn you need to let things go. I totally had moments where I was like her but sometime growing up had an epiphany that I can't always think \"someone's out to get me\"\n\n\nBelieve it or not but there are huge gaps in the way females and males communicate and understand eachother. With this is mind, you will have such a better time talking if you both can ease up on eachother a little and give into the idea that you both are on the same team, just having a misunderstanding.\n\nEasier said than done for sure. Might be worth having a mediator of some kind to get some perspective. Anyway, Good luck! Hope the food was good lol",
              "id": 26,
              "comments": [
                {
                  "score": 2,
                  "content": "It was almost perfect food except the sprouts we got for the sandwiches were moldy right out of the box...  \n\n\nCostco Chibata Bread\n\nCream cheese on top\n\nPesto Basil on bottom\n\nTurkey (your choice)\n\nSprouts (your choice)\n\nAvacado\n\nTomato\n\nRed onion\n\n&#x200B;\n\nEnjoy.  :)  Thanks for the kind words and understanding.  I honestly do what I can to diffuse the situation, but nothing works other than just staying quiet...  I feel I have let the subject go and didn't bring it up.  I was going onto other subjects and no matter what I would say, she would bring up something to be mad at.  So I'll let her have her fits and I'll continue to do my thing.  I value her input, but when it's difficult to get out of her when she's mad, I have to take action which SHE doesn't like...",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I explained that I wasn't the asshole because my statement would include EVERYONE.  I didn't think I'd have to explain I was part of NOBODY or EVERYONE.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 28,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH for literally fighting 4 hours just about a pesto sauce expiring date. \nYou guys are old enough to married, so old enough for communication.",
      "id": 29,
      "comments": [
        {
          "score": -4,
          "content": "21 years should be long enough to give everyone a good idea of the true meanings of their conversations...",
          "id": 30,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}