{
  "post content": "This happened a little while ago, but it did lead to a sort of split and a lot of coldness on the side of my brother and his girlfriend. So I wanted to get an opinion, looking back.\n\nAround my 16th birthday, there was a little comic convention happening in my state. I was super, super excited to go to this. A friend and I made plans to go together on the second day, my birthday. My older brother (20) and his friends were going for all three days of the convention and were staying in a hotel nearby. My brother was also going to meet a girl (his now girlfriend) that he’d been long-distance with for a while at the convention.\n\nI showed up on Saturday in my costume, and my friend bailed on me. I didn’t really have anyone else to hang out with at the convention. I went to go find my brother and his friends. I know my brother thinks I’m embarrassing, but let me join his group anyway because I was all alone. I knew they were annoyed I was there and I felt really bummed out. \n\nThey all decide to leave the convention and go back to their hotel room. There are like 10 people in this hotel room. My brother and his now-girlfriend get on the bed and start cuddling and making out. Another girl and her boyfriend were making out on the other bed. The other 6 were just watching them, drinking. I was grossed out and I said something like, “this is really weird.” My brother’s friend said, “if you’re bothered, you can just leave.” So I did. I went to the lobby and called my Mom crying, saying I was upset and wanted to go home. She asked why, I told her.\n\nI wasn’t here for this but my Mom called my brother and yelled at him for ruining my birthday, even if he had just met his then-girlfriend. She also said his friend who told me to leave was awful (she just hates him in general because he kicked a hole in our wall once). My brother called me and apologized, but sounded mad at me.\n\nNow this whole thing colors my relationship with him and his girlfriend, who thinks I was a drama queen. Was I an asshole for getting upset, leaving, and telling my Mom what happened? He did do me a favor by letting me hang out with him and his friends.",
  "id": 1,
  "comments": [
    {
      "score": 149,
      "content": "NAH. You are (were?) a 16 year old kid, it was your birthday. Of course you were upset. But also, I understand if your brother got upset since he wanted to hang out with his friends. I honestly can't really see the problem. They took care of you at the convent and then invited you to their party, you didn't like it and left. Of course your mother was upset at your brother, but it wasn't really his responsibility. Just sounds like normal family interaction when things don't go as planned.",
      "id": 2,
      "comments": [
        {
          "score": 11,
          "content": "This feels like a NTA instead of a NAH. Op was made to leave early and taken to the hotel to watch their brother make out and grope a person. Its also safe to bet that their brother was the one who brought them so its not like Op could have just left the party to go back to the convention. What were they supposed to do? Wait in the lobby for a couple hours for their brothwr to finish? \n\nAnd I say Op was the brothers responsibility the second he refused to let Op do anything on their own if they weren't with them.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 59,
      "content": "NAH You just wanted a nice birthday and I get that you were upset. Teenagers can be very selfish, it is part of growing up. Especially if the opposite sex is involved. Perhaps you could just talk to your brother and make it more of a story you can both laugh at? It doesn't sound like this is such big of deal you can't just talk it out.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 54,
      "content": "NAH since you didn't expect your mom to yell at him. \n\nIt sucks that your friend bailed but your brother was nice enough to invite you to do what he and his friends were doing. His friend was right, you shouldn't have expected them to change their plans for you. However it's totally reasonable that you were upset.",
      "id": 5,
      "comments": [
        {
          "score": 15,
          "content": "I was fine with the hotel room, not so much with watching my brother make out with and grope a girl haha. \n\nBasically when I was with them he said I couldn’t leave and do other things, he was afraid of getting in trouble leaving me alone at the convention...I just felt really forced to sit and watch my brother make out with a girl.",
          "id": 6,
          "comments": [
            {
              "score": 26,
              "content": "If he *made* you leave then NTA. However, then the asshole is your parent for requiring a 16-year-old to be chaperoned. You obviously had a phone to call your mom or brother in case of trouble.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "How old are you now?",
              "id": 8,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 37,
      "content": "Mildly YTA. I find it unlikely that you didn't know how your mother was going to react. If she blew up at your brother, she's done it before. \nAnd you snitched. Your brother trusted you enough to take you along, you didn't have to explicitly tell your mom what bothered you, just that you didn't felt comfortable among his older crew. \nYes, it was your birthday, but you being alone was your friends fault, not his. That 'friend' was the one that ruined your birthday, why did your brother had to face the consequences? \nHe did the right thing by bringing you with him, letting you enjoy a part of the convention, rather than non of it. Now, a GREAT brother would have made something special for your birthday. But it doesn't make him TA to just be a guy.",
      "id": 9,
      "comments": [
        {
          "score": 17,
          "content": "This. Your brother was 20, an adult. You snitched on him after he let you hang out with him and his friends. Birthdays don't always turn out perfectly; you should have just let it slide.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23,
      "content": "YTA. You sound like a 11 year old. You crash his plans then get upset at him and his group of friends for not making the day about you. Instead of leaving and just enjoying the event ( the whole reason you went there) you called your mother crying and blamed them and for what? The worst part is your brother was forced to apologize to you for your own immaturity and self centered bullshit. \n\nYou sound like your still 16 and haven’t grown up at all.",
      "id": 11,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 14,
      "content": "Yta you had to have known that telling this to your mom would bring heat onto your brother, yet you did it anyways. Its sucks your birthday didnt turn out great, but it wasnt your brothers fault. He had his own plans, and while his plans weren't perfect for you he tried to include you. So now you pretty much damaged your relationship with your brother because you couldnt turn the other cheek\n\n\nNext time, just leave the room and start cursing under your breath like the rest of us would do.",
      "id": 12,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "YTA, it sucks your friend bailed, but you aren't 11 years old. You're 16 and you told on your adult brother for not hanging out with you the way you wanted.",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "Kinda feel like YTA here, OP. Your brother let you tag along with him even though you annoy the piss out of him and his friends, and his friends but they had plans they didn't want to deviate from. When you expressed your lack of interest in what they were choosing to do with their time, his friend told you that you didn't have to stay with them but that this was what they planned to do with their time. Instead of accepting that you were horning in on already made plans (that they were paying for - they had a hotel room) you acted like a big baby instead of the grown-ass teenager you are/were and tattled to your mother, knowing full well he'd get reamed out. You should've been mature enough to handle that whole thing better.",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "A little bit of YTA. I think you knew on some level that what you told your mom would come back as heat on your brother. Granted, your brother should have been looking out for you, but he also had his own stuff going on. The real asshole in this scenario is your friend who bailed. There might not have been any good options after that point except for calling your mom right then and there. Your friend bailing really screwed everybody over.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. Your brother sounds like a dick and he didn't do you any favors by \"taking you in\" with his friends at the con. Their apparent disdain with you being there would be worse to me than just being alone. The hotel part just sounds like an awkward mess and it's reasonable you'd call your mom when your brother is \"occupied\" and your friend ditched you. His ensuing punishment was his own making.",
      "id": 16,
      "comments": [
        {
          "score": 4,
          "content": "I'll assume you're not an older sibling?",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "The poster might not be but I am, and believe me when i say that the older brother is an ass. It was their siblings birthday and they couldnt let them nerd out for one day and instead made them leave early so he could score with his sibling watching? Thats messed up.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}