{
  "post content": "I (58m) have two daughters. One from a previous marriage and another from my wife's previous marriage. Both daughters are around the same age (think mid-twenties). My daughter Allie has never gotten along with her stepsister Johanna. If Johanna invited Allie to a movie, Allie was suddenly super busy and had no time. If Johanna wanted to come with Allie to a party, Johanna wasn't invited and there was no way she could bring her. She'd rip up Joanna's things and would blame Johanna when she'd be grounded. \n\nJust the run of the mill petty teenager bullstink. Johanna was a good sport and always seemed to take things on the chin. Her explanation was always that \"sisters fight\". Until about maybe three or four summers ago Allie was home from college and was going through a rough breakup that was causing her grades to tank which put her on academic probation. Allie was upset and was taking it out on everyone, especially Johanna. My wife and I told her to cut it out and she seemed to catch on that her behavior wasn't gonna be accepted. Come to find out after Allie leaves to go back to college that she'd completely destroyed Johanna's scrapbook with pictures of her dad and destroyed a lot of the shirts she had left of his. Johanna didn't make a stink about it in front of us but that night the house stunk of E6000 and mod podge. You could guess what she spent the night doing. After that incident Johanna had completely given up on Allie. Allie has a birthday coming up, Johanna wouldn't even sign the card. Allie is in town for the weekend, unless it's a holiday or family event, Johanna wasn't there. And honestly we didn't blame her.\n\nNow the issue is that Allie wants Johanna to let things go and let bygones be bygones. Johanna is getting married soon, and Allie wants an invite. It was brought up this past week at a family dinner (Johanna and her fiance as well as their son attended/Allie and her wife and two girls attended as well). Allie brought up how the kids were the same age and how it'd be cool after the wedding if the kids could hang out. Allie also asked what she should wear to Johanna's wedding and if she'd be a bridesmaid. Johanna pretty much laid it out for Allie that she wasn't coming and that the kids wouldn't be seeing each other outside of family events.The night was pretty tense afterwards and I asked Johanna if there was any way she could forgive Allie. She said she wanted nothing to do with her and I told her I fully understand that she carries a lot of hurt from how Allie treated her. Allie came to me after Johanna left and pretty much begged me to convince Johanna to move past things. I told her that had she been a more considerate and kind person back then that maybe she'd have a chance at a relationship with her stepsister. I told her that she made her bed and she needs to lay in it. She said I'm a a-hole and that any good father would want to see his kids reunite. \n\nAITA for telling her she deserves this?\n\nInfo: For everyone asking and making assumptions about my parenting, Allie was never allowed to slide with anything she did to her sister. She was grounded, she had things taken from her, we replaced the things we would that she broke and we made sure Johanna was supported and validated throughout the years. We never told Johanna to get over anything, we never told her she had to forgive Allie. When we offered Allie therapy, she was 14. We weren't going to force our daughter to go to therapy where chances were, she could just tell her therapist she didn't want to be there and be uncooperative, and most likely have the therapist stop seeing her as we can't and weren't gonna force a kid to be somewhere she didn't want to be, just for her to lash out at her sister even worse.\nWhen Allie destroyed those things she was banned from coming back until she apologized and made things right by Johanna. Johanna said herself she didn't want the apology and my wife and I did our best to surround her with love while she was grieving the loss of those things she cared for. Johanna moved out so the punishment was moot. We are aware Allie sucks, we did everything we could within reason. I didn't raise Allie to be this way,we didn't encourage this nor did we allow her to believe the behavior was acceptable.\n\nEdit: This thread is an absolute pit of people who don't seem to understand some kids just aren't receptive. I'm kind of done seeking internet help here, you all seem wonderful and I'll be sure that on the next go around I toss my kid to a psych ward and pit all blame on the Healthcare system for not fixing them. Jesus christ, never become parents.",
  "id": 1,
  "comments": [
    {
      "score": 14994,
      "content": "ESH, apart from Johanna. Where were you when Allie was bullying Johanna? For *years?*",
      "id": 2,
      "comments": [
        {
          "score": 7880,
          "content": "This. Allie spent *years* doing her absolute best to make Johanna’s life miserable. \n\nIf Allie’s decided that she wants to make amends, she can start by offering a full and sincere apology to Johanna. You know, as opposed to telling you to make Johanna be nicer to her. And even if she does apologize to Johanna, Johanna is absolutely within her rights to tell her to go to hell.",
          "id": 3,
          "comments": [
            {
              "score": 6794,
              "content": "The part where she destroyed her stuff on COLLEGE break did it for me. She was a grown woman being sadistic by destroying her step sisters momentos of her father, not a child who may not have understood how much of an awful thing that would be to do to anyone let alone a family member. Johanna has the patience of a saint and Allie should consider herself lucky for it..",
              "id": 4,
              "comments": [
                {
                  "score": 2027,
                  "content": "This indeed. \n\nAllie knew full well what she was doing to Johanna. Allie's behaviour was really appalling. I cannot understand she would think that everything would be a-ok after a bit of time because \"bygones be bygones\".\n\nEven if Ellie gave the most sincere apologie in the history of humankind, I would still understand Johanna for being LC with her.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 594,
                      "content": "ESH...am i the only one thinking that Johanna has something cool that Allie now wants. Like her future hubby or one of gis family is famous or super rich. I find ot hard to believe that allie suddenly had a genuine change of heart am smelling her bs all the way from here.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1091,
                  "content": "[deleted]",
                  "id": 7,
                  "comments": [
                    {
                      "score": 672,
                      "content": "I think OP is just skipping the parents / Allie drama to focus on the issue at hand. Could be wrong. He / They sound like they're in-tune with what their kids were doing.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 344,
                      "content": "I don't disagree..I just meant to point out that this isn't little kids squabbling about petty things still. At some point the majority of people grow up and go shit that was all really stupid let's bury the hatchet..she pulled that during a break from college.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": ">and gave her only a pittance of punishment\n\nSo, what was he supposed to do? Take off his belt and beat her with it? Throw her out on the street? Starve her? What is it you'd recommend as punishment, oh, great parent?",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "He in no way implies that he let Allie do whatever she wanted. I cannot fathom why someone would assume there was no punishment or consequences for these actions. OP sounds like a parent that was present and aware of what was happening in his daughters lives and obviously wouldn’t have just done nothing.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 925,
                  "content": "Also..I wouldn't trust Allie to not ruin the wedding. She has literally ruined irreplaceable items from a deceased loved one. Johanna shouldn't even have to be in the same room as her, OP is lucky Johanna is a saint.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 364,
                      "content": "That was my gut instinct. Johanna should of replied when she asked for a n invite, “Why so you could tear some more of my lifetime memories apart?”",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 218,
                      "content": "Right. I could see her ripping up the wedding dress somehow, tbh",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 158,
                      "content": "Exactly does she actually long for a relationship or does she just miss her punching bag?",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 104,
                      "content": "She seems like the kind of person that'll now do anything to be at the wedding and mess it up royally because she's a petty sadistic b****\n\nPeople like her always find out where the wedding is and show up. Probably a good idea to get security for the wedding.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 81,
                      "content": "If I were Johanna, I would have security guards with Allie’s picture posted at all the entrances, including any used by the venue staff.  The expense would be totally justified by the peace of mind I’d get from having them in place.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I could see Allie making the whole day about herself and trying to outshine Johanna.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Johanna needs security for the wedding just in case Allie decides to show",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Johanna has been nothing but a Saint in all this. She let's her child near allies kids and around Allie. Never complain to not be in same room as Allie. Heck if it was me I wouldn't have been so kind. I wouldn't even want to be around her let alone have dinner with her. Johanna is a kind person and shouldn't have to deal with Allie's shenanigans or worry if she's going to ruin or destroy her wedding next.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 271,
                  "content": "If I was Johanna you can bet Allie's room would've been fucking destroyed.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 313,
                      "content": "But Johanna is kind to her core, obviously, and is taking a stand now because she needs to be kind to herself.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 125,
                      "content": "I had to google what e6000 was and found out it was glue, I was hoping it was the blackest paint they could buy and had painted every square inch of the sisters room black, carpet curtains and clothes and all.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 198,
                  "content": "Not only that, but she did it because she was upset about a breakup, something Johanna had nothing to do with. So she was a grown woman taking her anger out on her stepsister in the most harmful way possible. Sadistic and abusive.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 145,
                      "content": "u/JENNYJENNY8675\n\nYour daughter is an abuser. Get her the help she needs. This sort of behaviour and mindset doesn't change. Just gets worse. Who's her punching bag now? Her wife? Her children? The persons working under her? Her children's pets? I have never felt so disgusted in my life. ESH expect Johanna obviously. Oh and just by the way, \"forcing\" her to go to therapy? That's what parents do, they \"force\" their children. If one therapist wasn't working, find another. If she refused to take correction and change there are literally facilities to place persons in where they can get help throughout the whole day - I can't remember the correct term but sort of like a rehab facility in a way.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Yes! I work with men who are in prison for similar charges who have better insight into their own behaviour. This clearly went wrong long ago - typical teenage “bullstink” my ass!",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I can’t even imagine if someone did that with the few things I have left from my dad. And I’m in my 30s. I’m actually in tears at the thought. How cruel.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This. There are things that can never be made right. There are people who are so awful that you cut them out of your life. Sometimes there isn't one more chance. Sometimes consequences are permanent.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "100% agree with these comments!! And I'm glad you brought up the notion of \"apology\" because... OP didn't mention it once!!!\n\nDid he never ask his daughter to apologize...? So simple and yet, so overlooked :(\n\nNot that a mere apology will fix all this chaos but it would have been a start YEARS ago...",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1486,
          "content": ">Just the run of the mill petty teenager bullstink. Johanna was a good sport and always seemed to take things on the chin. Her explanation was always that \"sisters fight\". Until about maybe three or four summers ago Allie was home from college and was going through a rough breakup that was causing her grades to tank which put her on academic probation. Allie was upset and was taking it out on everyone, especially Johanna. My wife and I told her to cut it out and she seemed to catch on that her behavior wasn't gonna be accepted.\n\nApparently they didn't care enough until the girls were in college and Allie started being abusive towards **them** as well. Johanna has probably spent the entire marriage being the punching bag for her step-sister and the buffer between Allie and her parents. Same thing happened to me with my younger brother. Good on Johanna for setting her boundaries.\n\nOP, you're both TA and NTA. You're TA for how you raised your daughters and the fact that you allowed the abuse to go on for so long. But you do get points for recognizing that Allie has gotten herself into this mess, and that Johanna wants nothing to do with her. As long as you don't push Johanna to \"forgive and forget\", you should be able to maintain a relationship with her.\n\nEdited to correct the names",
          "id": 30,
          "comments": [
            {
              "score": 149,
              "content": ">Good on Allie for setting her boundaries.\n\nI think you mean Johanna.",
              "id": 31,
              "comments": [
                {
                  "score": 73,
                  "content": "I definitely did. I'll go fix that now",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Yeah, when I saw the \"just the run of the mill petty teenage bullstink,\" I was like, you better be sarcastic or facetious because THIS is bullshit.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "yup, and now OP is all butt hurt because he didn't get the answer he wanted. Apple didn't fall far from the tree here.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 510,
          "content": "OP said a few times in comments that they did punish her, talk to her and even offered therapy to help.",
          "id": 35,
          "comments": [
            {
              "score": 684,
              "content": "Yeah I dunno where people read ‘we didn’t punish her’ anywhere in the story. I read it as they tried and it just didn’t make any difference. Not mentioning the specific punishments doesn’t mean they didn’t do them. They also didn’t mention all the times they took a shit, but I still was able to assume they did that as well.",
              "id": 36,
              "comments": [
                {
                  "score": 304,
                  "content": "[removed]",
                  "id": 37,
                  "comments": [
                    {
                      "score": 279,
                      "content": "The problem with this sub is that is full of teenagers and people with very little real life experience besides these Internet dramas.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 112,
                      "content": "The problem with this sub is that if this were a post about how \"my parents didn't like that I wouldn't accept my step-sister as a real sister\" everyone would be calling the parents TA (I've seen it pretty recently, eta: obviously that example isn't perfect because the sister in question is a huge turd, but whatever). From what I read, the parents weren't perfect but they tried very hard to show Allie that her behavior was unacceptable and she thought she knew better.\n\nAs the parent of a 14 year old, by the time they reach teenagerhood they're pretty well convinced they know every and anything and make their choices accordingly. All I can do is my best to show her how to be a good human being, and hope she figures it out by example. Being the AH is part of parenting, I guess.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Welcome to reddit, where you are always a bad parent no matter what.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I dunno. Toward the end of the story, she’s an adult. If you’re going to say that Allie was a hopeless bad seed, why the hell are they letting her around Johanna? She was an adult. Consequences for a child are chores or being grounded. You can tell an adult to leave your house for being rude.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 112,
                  "content": "Right?\n\nI mean, there are some terrible people who were raised by great parents - Just like there are some very good people who were raised by horrible parents. Sometimes, children don’t reflect how they were raised.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Thank god there's a few sane people left here. Shitty behaviour doesn't automatically mean shitty parents",
              "id": 43,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 498,
          "content": "[removed]",
          "id": 44,
          "comments": [
            {
              "score": 185,
              "content": "[deleted]",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "And it sounds like maybe Allie wasn't there all the time, like her mom is still in the picture. It's hard to correct this behavior if a coparent is allowing it.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yes!!! NTA, OP!\n\nSome kids are just unmanageable. What was OP supposed to do - put her in some ranch? There's no such thing as \"kid gets punished = kid becomes good\" in parenting. Besides, Allie is an adult now - it's her responsibility to make amends if she wants a relationship with a person she tortured for years, not OP's. And if Johanna wants nothing to do with Allie, then tough shit, Allie better gets over it 'cause it's her own fault.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "If she really cared about Johanna, she’d let her move on. If Johanna is happy and doing well, I don’t see any reason that she should jeopardize that. It’s selfish.\n\nManaging a teenager is hard. We can try to hash out where parents could have gone wrong, but to let her as an adult come home for break when you know she’ll harass your other daughter is where I think anyone should draw the line. \n\nI wonder if Johanna was offered therapy.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 367,
          "content": "It was just typical teenage ‘bullstink’ apparently so OP saw no need to bother being a parent.",
          "id": 49,
          "comments": [
            {
              "score": 104,
              "content": "Oh yeah, just teens being teens. Why should he punish someone for typical teen behavior?/s",
              "id": 50,
              "comments": [
                {
                  "score": 44,
                  "content": "Right? And it’s not even typical teen behavior! I don’t remember people ripping up each other’s stuff, getting in trouble, and then blaming that person. Even if it was typical they should get in trouble but that’s not normal.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yeah, blaming the sister for her grounding is something my sister did, and it was NOT typical teen shit. Even with the edit, it still feels like it wasn’t enough, and they absolutely should have forced family therapy at the least!",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yeah I think I might’ve done something similar when I was like six or younger. But I did it once, got in a ton of trouble and never did anything like it again. I couldn’t imagine doing that even when I was nine and definitely not any older than that",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Where does it say she never got in trouble for her.shit behaviour? By the looks of it she certainly did",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Ok, so I was pretty much a single child by my teens and my brothers never did anything like that... *is* going in to a siblings room and destroying important personal things that have nothing to do with you \"typical teenage\" behavior? I don't remember any of my friends with siblings mentioning this either. And when my tween foster kids pulled shit like that it got locked down hard because no.",
              "id": 55,
              "comments": [
                {
                  "score": 8,
                  "content": "No. And my sister and I even had a fairly antagonistic relationship due to our parents pretty much setting us up to hate each other. It is not normal to sabotage your siblings’ stuff, *especially* precious reminders of deceased loved ones. Hell, I accidentally broke my sister’s hand painted piggy bank by tossing a pillow at her and spent two hours painstakingly gluing it back together in apology myself. And we were in constant conflict.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Nope and I have a brother and sister and we were all teens at the same time. There were screaming fights and slammed doors but definitely not destroying anything. I broke a brush of my sister’s when I was little and got in hell for it but that’s all.",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 339,
          "content": "I couldnt agree more with this!! Allie was not doing \"run of the mill petty teenager bullstink\" that was FULL ON bullying from a member of the family and neither parent intervened. Im surprised Johanna still wants you or her mother in her life after all the enabling you did to get Allie to where she is now. If YOU had actually stopped Allie's bullying behavior in high school the incident during college break would not have happened.",
          "id": 58,
          "comments": [
            {
              "score": 145,
              "content": "You're assuming way too much. I got the impression the parent(s) care an awful lot but the OP was staying on point with relationship between A and J. Also someone else said, read OP's comments here on the thread, which I haven't go to yet. Perhaps OP should edit update a little.",
              "id": 59,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 94,
              "content": "First paragraph last sentence. They grounded her. They did intervene.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 288,
          "content": "[removed]",
          "id": 61,
          "comments": [
            {
              "score": 52,
              "content": "Doesn't sound like it at all, some *kids* are just garbage, nobody at home has to teach them or allow it. Not everybody has an innate desire to be kind and caring!",
              "id": 62,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 250,
          "content": "Op answered in another comment.\n\n\n*I responded in another comment, as I ran out of space in the post, but we did punish Allie, we asked if she needed therapy, we kept them apart and tried not to force them together. We explained that even if she didn't like Johanna she didn't have any right to treat her the way she was. After the destruction of her dad's items she wasn't allowed back, but it didn't matter much as Allie Johanna moved out that winter.*",
          "id": 63,
          "comments": [
            {
              "score": 271,
              "content": "The thing is that this further illuminates how far off from parenting they were, though. \n\n*\"We asked if she needed therapy\"* \n\nI have kids referred to me for these things and we work on blended family dynamics and family conflict. Those kids are involuntary but some of the best progress *because their family is involved in their growth as a human*. \n\nYou can't force an adult abuser to change (they have to be willing) but you CAN influence a child and teen before they are an adult. Never should have been a choice for this girl given the behaviors he mentioned even before college. \n\n*\"We kept THEM apart\"* (emphasis mine)\n\nConsider some of the implicit messages these actions could translate to young Johanna: \"you are part of the problem for existing\" & \"her behavior is *just teen things*, just get over it\" and \"oh but you're always so good at taking the high ground!!!\".  OP's statement that she always seemed to \"take it on the chin\" made me feel horrible for that young woman who was expected to take abuse and look like some perfect saint vs. being allowed to be a damn teenager and have her feelings validated and real consequences for her bully in her own home. After dealing with some form of an absent bio father. So freaking sad. \n\nI bet that sounds like I'm \"reaching\" with some of this, but the clue is there as to the expectations Johanna was held to that his daughter wasn't when he knew Johanna had completely cut her out of her life and *he still asked if she could forgive her BEFORE his daughter begged him to*. He went straight to enabling his daughter's behavior vs. a single second of reflection for his step-daughter. Showing her, yet again, that she was never a priority despite always taking the high road. \n\nOh, and OP: YTA because you had the audacity to ask her AND because of that last statement of \"it didn't matter as much\" - what the heck, of COURSE it matters! \n\nSure, it was college, but I wouldn't let a family member step foot into my home if they actively hurt another family member like that unless they stepped up with a genuine apology and some form of compensating for the destruction (whether monetary or finding a way to find some old pictures for Johanna, etc). \n\nBlended families are not easy peasy but unfortunately this is a great example of how parent dropping the ball on at least forcing basic human respect and compassion never ever works in the long run.",
              "id": 64,
              "comments": [
                {
                  "score": 18,
                  "content": "This. As the red headed step child in my family, thank you for pointing out how complex blended families are and how badly OP dropped the ball. We pick up so make of these messages in the way we are treated versus the biokids. And, like, sure, he grounded her, but he was still giving her an allowance (less a damage fee to repay Johanna's things), and never thought about the messages that would send. To either child. And he seems very upset that we are saying that yes, he should have pushed therapy, because it was so obviously needed. He was responsible for their mental health - and that means making them get help when it's needed to keep the family safe.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Exactly. I get that OP might not have understood the depth of this or been told by others that it was \"typical teen\" behavior.  At first. But the escalation of her behavior over time is where the parents had a serious responsibility to try something different because what they were doing wasn't working. \n\nI really appreciate that you mentioned 'to either child' because this didn't hurt only Johanna. Now that it is actively hurting his bio daughter and future generations, he sees how the combination of many years of implicit messages and actions across the entire family (he is not the only one to blame, for certain) has gone downhill.  I see parents/caregivers get really angry for someone pointing the things out all the time: \"I did the best I could!\"  No one is saying he didn't do anything but that truly good parenting needs to be more than just survival mode \"get them through the 'tough teen years' then everything will be fixed\".  \n\nAnd I very likely wouldn't label him TA if we time traveled 10 years back because of course there's a ton of info missing. And I feel for the big load of guilt that probably hit him after reading people's replies (his *externalizing* that anger towards others is, much like the daughter, not ok though). But he is TA in the exact situation he posted about because after everything he described he still made the conscious choice to go to Johanna and ask *her* to change (though I'm glad he respected the no for now) before setting the limit with bio daughter. \n\nIt's really amazing that someone who has been through similar to this story like you have been can still be empathetic towards others like OP and daughter.  Keep doing you, /u/Dreamer_Lady. <3",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 202,
          "content": "I'm honestly surprised that J turns up to dinners with this worthless family, they still invite A and actually expect them to sit there together? OP is completely deluded if they don't think most of this is the parents fault.",
          "id": 67,
          "comments": [
            {
              "score": 80,
              "content": "While I agree that J didn’t need to show up, if you read OP’s comments and edits, they show that they in fact did punish A.  It just didn’t work.  So I don’t know where you and everyone else is getting the ‘they did absolutely nothing’ thing from.  What else are they supposed to do?  Put A up for adoption?  \n\nSo you’re assuming a lot when you say that it is entirely their fault.  How A got to be this awful person could’ve been OP’s fault, or maybe A was just an awful unreceptive person, or she wanted to ‘punish’ J for being her step sister and not her real sister.  We don’t know.\n\nEdit: just noticed ‘asked her if she needed therapy’.  That’s stupid, of course she’s not going to say ‘yes I have so many bottled feelings, please send me to therapy!’  But other than that, the original message of my comment stays the same.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 178,
          "content": "I don’t understand how a young person can get away with that much cruelty. My mom would have locked me up in my room until the world froze over if I was that mean to someone let alone a family member. \n\nComing from a blended family, I am also an only child, this truly hurts. They never had to be friends, but Allie didn’t even love her - how can you not love someone in your household that only ever loved you?! It’s insane and heart breaking. ESH but Johanna, and yeah OP you’re a dick too.",
          "id": 69,
          "comments": [
            {
              "score": 92,
              "content": "My ma would have just murdered me",
              "id": 70,
              "comments": [
                {
                  "score": 46,
                  "content": "I would have nothing left in my room or life and I would have to earn every single item back with “good behaviour.” \n\nOP dropped the ball with parenting. And there’s definitely more to this. Most children don’t turn out to be cruel monsters... usually that comes from neglect and bad parenting.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Growing up, I was a lot like Allie and I had a half bio sister. My parents were the definition of strict. I’ll be the first to admit I was a huge asshole to my sister even if she did absolutely nothing to me and every time I did something I would get the shit beat out of me. This continued well into my teenage years. I’d do something to my sister, my parents would beat me, take away everything that brought me joy, ground me from ever leaving the house except under supervision (like to the store with them), and even made me eat food I hated and would make me sick. (I can’t digest most red meat.)\n\nSo I get where OP is coming from. I’m grateful my sister forgave me after I, myself, realized just how awful I was and got some help. Some just don’t get that far.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5203,
      "content": "NTA, but this judgment is STRONGLY predicated on you addressing what steps you took to reign in Allie during her years of terror, and what punishment you meted out after she heartlessly destroyed Johanna’s precious belongings.\n\nRegardless, Allie can’t demand forgiveness.  That’s up to Johanna and I wouldn’t blame her for never granting it.\n\nSo, INFO: what steps did you take?",
      "id": 73,
      "comments": [
        {
          "score": 3138,
          "content": "I responded in another comment, as I ran out of space in the post, but we did punish Allie, we asked if she needed therapy, we kept them apart and tried not to force them together. We explained that even if she didn't like Johanna she didn't have any right to treat her the way she was. After the destruction of her dad's items she wasn't allowed back, but it didn't matter much as Allie Johanna moved out that winter.",
          "id": 74,
          "comments": [
            {
              "score": 2104,
              "content": "Why wasn’t therapy insisted upon?  In consideration  of everything, it sounds like her punishment for destroying J’s stuff was pretty light.",
              "id": 75,
              "comments": [
                {
                  "score": 1977,
                  "content": "She was an adult when she did that.  What punishment do you propose a parent give their adult daughter other than forbidding her back into the house?",
                  "id": 76,
                  "comments": [
                    {
                      "score": 590,
                      "content": "Withholding presents and invitations to dinners until she could properly make amends, failing to provide her with any finances beyond the minimum to help her with her education, limiting her access to a car or other things that they bought for her...so a lot, depending on the situation. While they didn’t have to do anything as severe as disown her, there are further consequences that could have been done in light of her actions",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 195,
                      "content": "[deleted]",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 92,
                      "content": "Idk, sticking to it? They invited both daughters to a family dinner. Maybe if they're going to see Allie they do it separately from Johanna. They've only ever punished *her,* not the AH torturing her.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "He should have made her go into therapy when she was a child, when she first began to destroy things that her sister owned, nothing normal about tearing up your siblings things and destroying her stuff.",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Sadly you can’t force teen to go to therapy. If they do mot want to engage the therapist will stop seeing them since you can’t force someone in therapy. It just doesn’t work.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Therapy is only effective for people willing to put in effort. You can’t force someone in and expect it to be effective. It’s not a pill, it’s complete re-education",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Therapy would have been an option when they were younger but when she’s an adult I don’t think you can force an adult to go to therapy. It has to come from within as an adult.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "She doesn’t need therapy. Allie sounds like she is a hideous brat from childhood and never outgrew that even in her uni years as a young adult. No wonder Johanna wants nothing to do with her.",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "To be fair, therapy usually doesn't work when it's forced.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1028,
              "content": "You don't ask a kid if they want to go to therapy. You take them.",
              "id": 86,
              "comments": [
                {
                  "score": 403,
                  "content": "[deleted]",
                  "id": 87,
                  "comments": [
                    {
                      "score": 317,
                      "content": "> Not really therapy-worthy at all.\n\nBlending families and moody teenagers is a good time to go to therapy, even whdn they don’t hate each other, imo.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 122,
                      "content": "I am going to disagree-- therapy is not just for reactive trouble but is good for proactive actions. There's a reason why a lot of ministers will do pre-marriage courses with couples, its to help them to figure out how to work as one unit before the wedding, rather than afterwards. I used to perform weddings and sometimes with blended families I'd take the kids out for ice cream or coffee individually to get a sense of how they were feeling about the transition and offer support to the families blend well\n\nParents who blend families, especially with kids the same age, would be well to be proactive and go to family counselling before merging the families together, to help learn what potential barriers may be, provide a safe space for children to talk about their anxieties etc.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "You can go to therapy for prevention, not just a cure.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "But this abusive behavior was going on much earlier when they were still under 18 - OP could have taken the kid to therapy instead of shrugging it off as kids being kids when it was clearly not improving and Allie was lashing out like mad.",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": ">I would need to know what kind of things... like some scratch paper notes/drawings or a favorite dress? And what ages?\n\nDoes this actually matter? Kid A going out of their way to destroy Kid B's things on a regular basis and then blaming Kid B when they get in trouble isn't ok. I mean, if someone you knew came over to visit and then just started tearing up papers and breaking shit when you went to the bathroom I doubt you'd come back and take the time to evaluate which letters got ripped up and which coffee mug they smashed in the sink before getting upset with them.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 388,
                  "content": "I wasn't asked as a kid if I wanted therapy, I was just taken. I just lied. I lied my ass off and either the therapist completely bought it or understood that you can't help someone who won't participate. \n\nI'm honestly not sure how my parents could have done better. The therapy was definitely needed and warranted, but it still basically felt like a punishment so I resisted.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 293,
                      "content": "Yeah this is what I don't get. Everyone is saying Allie should have been dragged to therapy but what exactly would that have achieved? You can't help someone who doesn't want help \n\nI was forced into therapy as a teen for some family stuff. Know what I did? Folded my arms and refused to look at her or speak a word. Eventually the therapist had to give up. I'm in therapy now and making great progress but it had to be my decision",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 238,
                      "content": "Some people seem to think that therapy is magic and a therapist just somehow fixes people without any input from the person going to therapy. \n\nTherapists don’t fix people. You fix yourself. Your therapist just guides you and helps you find your way.\n\nPeople who are forced to go to therapy against their will rarely see any benefit from it.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "Same experience here. I don’t see how OP insisting on therapy would’ve helped any. The parents punished Allie and tried to protect Johanna and let her get distance from her bully. Not much more they could do.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Yeah I'm not sure how the people here that are saying she should have been forced into therapy think it'd work like magic.  Forcing kids to do something they don't want to do tends to not go over well and sometimes does the opposite of what they want to happen.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 253,
                  "content": "You people do realize that you cannot *force* a child unto therapy right? Any good and well practiced therapist would've stopped seeing Allie the second she told her she didn't want to be there and was there against her wishes. Johanna doesn't hate me, we've discussed that at the end of the day Allie just didn't like her and that her own bitterness is her own problem. I never sat by and watched Allie do anything, she was grounded and disciplined as best as we could without bordering on abuse. I never asked about my parenting, I'm sure I should've just tossed a 14 year old into another household and let her believe she didn't deserve a family caus of her bad attitude. I asked about my current situation, not my past parenting.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 107,
                      "content": "Absolutely a therapist would take on a minor in that situation. It happened to me when I had severe depression and didn't think anyone could help me as a young teen. The idea that you decided she had to want therapy at an age and time in her life when she's lashing out and actively harming others emotionally and even destroying property is beyond illogical and frankly irresponsible on your part. Also, I can pretty much guarantee the only reason she cares to make amends now is to impress the wife, she clearly still isn't mature enough to even try to apologize on her own.",
                      "id": 99,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 76,
                      "content": "The way this post is written, there is a lot of focus on Allie first. The focus is only turned to  Johanna when Allie does something to her. That's also true of this latest event. You don't talk about what you did (or do) to proactively protect Johanna when she's been the victim here for years. \n\nYou're reactive in protecting Johanna, not proactive. At least in what you've shown/told us here. That's a large part of why some people are upset.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "Your current situation is a direct result of your past parenting. It's relevant, which is why *everyone* is asking.",
                      "id": 101,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 47,
                      "content": ">Any good and well practiced therapist would've stopped seeing Allie the second she told her she didn't want to be there and was there against her wishes.\n\nAt least you've made clear you didn't talk to a single therapist about it.",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 46,
                      "content": "Most children who go to therapy are forced to go what are you on about? You keep bringing them and a practiced therapist eventually gets them to in some way open up. Courts force therapy on kids. Some schools now force therapy on kids for bullying. Parents with kids who are depressed or are suicidal or have an eating disorder force therapy on kids because it's the only way they'll get help. You can't force therapy on ADULTS, but it's an entirely different situation for children. It's in the past so you can't correct your mistakes but please don't spread lies to make yourself feel better.",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 40,
                      "content": "No you cannot force her into therapy, but you can set boundaries on what kind of interactions she gets to have within the family until she 1. makes meaningful amends and 2. Gets therapy. We know Johanna doesn't hate you. She \"takes it on the chin\" because she knows better than to expect any kind of support whatsoever in her own family. This is so sad. You refused to be a parent before but you need to show some leadership and spine now. Stop acting like there's nothing you can do but watch Allie destroy Johanna's wedding like she did that scrapbook. You realize that is absolutely her plan, as she has demonstrated zero remorse nor growth. Take charge of your kid and do not let her sabotage that wedding. Anything she does is on your hands.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "Yeah, you were the adult in this situation and it was completely your responsibility to get your daughter into therapy whether she wanted to go or not. I am a therapist and I have worked with kids and teenagers. More often than not, they would come in sullen or refusing to talk. That didn’t stop me from taking them on as clients. If they didn’t want to talk, well then we played games. Guess what happened? Therapy. Had you actually tried, your daughter would have eventually opened up.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "I’m curious how you were ok with her blaming her sister for her punishment and how she even had a social life when she clearly showed no remorse for her actions. You don’t really sound like you focused on getting her to understand her actions besides punishment (which was warranted). Like did you ever make her do any acts of contrition to her sister? Or was it just be mean to her, have privileges revoked and repeat? My parents made me understand consequences were a result of my own actions and nobody else’s.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 846,
              "content": "NTA.\n\nI'd tell her that yes, any good father wants his children to get along. That's why Allie's behavior hurt you and your wife *for years.* When she was cruel to Johnna, she didn't just hurt Johnna, she broke you and your wife's hearts. Parents want their children to be good people, and every parent dreads their child being the bully.\n\nExplain that for years Allie didn't just hurt Johanna, she hurt you and your wife, and she to this day makes you feel guilty and like a failure as a parent. It was your job to raise Allie into a decent person who treated others with kindness, and somehow you failed. You don't know exactly what you did wrong but you're sorry that you weren't able to guide her into being a good person. It is the biggest regret and disappointment of your life.\n\nDespite how Allie acted, your love for her is unconditional because you are her parent. You are hurt and disappointed to this day, but you still love her. And you do forgive her. You also accept that this is partly your own fault for having failed to raise her to be a good person.\n\nBut you can't make Joanna forgive her. Sibling's love isn't unconditional like a parent. When you treat people like crap, they don't like it, and then they don't like you. You've talked to Joanna and you don't think she'll ever want a relationship with Allie, which makes perfect sense, since Allie spent years being cruel to her. Of course you want your children to reunite, but you can't control that. Everyone involved is adults who make their own decisions. Allie made the decision to mistreat Johanna for years. Even when Allie was an adult. Just like you couldn't control Allie and make her act with kindness and respect towards Johanna you can't control Johanna and make her over it and suddenly like or love Allie after all these years.\n\nYes, this situation makes you sad. It's one of the many reasons her mother and you told her for years not to act this way. If Allie has really changed, then she should take full responsibility and apologize to Johanna without expecting anything in return (like forgiveness or a wedding invite). That would show she was caring about Johanna's feelings and not just her own. If she did that, you'd feel less disappointed in her and as yourself as a parent.",
              "id": 107,
              "comments": [
                {
                  "score": 119,
                  "content": "Holy carp, a response with actual understanding, not just dragging your own person l history or history of all the drama people seem to have around them.\n\nAddressing THIS situation, this OP and not just assuming all the worst. Bravo - or brava.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "This is the best advice on this thread.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "\\^ This.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "This^^^ OP I hope you've seen this. Also. I agree. NTA. It must have been very hard as parents watching this happen and trying to figure out the best solution. And good on you for validating and listening to Johanna, as well as being straight up with Allie.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This. This is perfect.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "🥇🏆🥇",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "You should have told Allie that you love her but think less of her for destroying the scrap book of someone's parent who passed. That ALONE disqualifies her from everything in my book because:\n\n\\- she did it as an adult\n\n\\- she never apologized\n\n\\- her actions still haven't set in",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "As so evidenced by the family dinner both daughters were invited to? \n\nYou and your wife should be spending time with Johanna, without Allie, even if she has never said anything about it. Allie has been a supreme AH *for years* and Johanna should be asked to see you without an abuser present.\n\nI'm interested in hearing what Johanna's mother thinks, but at this point I wouldn't be surprised if she gives just as little of a crap as you. Shame on both of you. ESH.",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "Has Allie ever actually apologized to Johanna? Have you pointed at that she seems to want Johanna to \"let bygones be bygones\" without ever actually trying to make amends?",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 81,
          "content": "Before even *asking* forgiveness, Allie needs to express some sort of remorse.  I'm seeing none.  She wants to sweep it all under the rug and let bygones be bygones, without taking any responsibility for how horrible she was.",
          "id": 117,
          "comments": [
            {
              "score": 14,
              "content": "And not even because she feels bad, but because she wants to go the wedding.. a fun event she’s not invited to. She’s still in it for herself. If she truly cared, she would apologize and still not expect to go to the wedding. She has yet to realize that relationships are not repaired with apologies. They’re repaired with the work that comes after the apology.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": " “Allie came to me after Johanna left and pretty much begged me to convince Johanna to move past things.”\n\nAllie’s not even asking for forgiveness from her stepsister, she’s asking her dad to work things out FOR her. If Allie wants any shred of hope that she can right this relationship the person that she should be down on her knees apologizing to and begging for forgiveness from is Johanna, not her dad. Sounds like Allie still hadn’t grown up.",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3488,
      "content": "Honestly I'm not sure how, as a parent, I could ever look at my child the same way again knowing they purposefully destroyed someone's scrapbook of their absent parent. Of course she'd never forgive her, I'm struggling to understand how you even do.\n\nAlso she hasn't shown that's she's changed...at all? She's still completely lacking empathy, acting narcissistic and entitled. Why would anyone want to offer an olive branch to that? I'd be more concerned she's going to sabotage the wedding out of jealousy or something.\n\nNo vote - in this instance you're not the asshole, but you have been for even letting it get this far when they were younger.",
      "id": 120,
      "comments": [
        {
          "score": 1066,
          "content": "She only wants to be ‘friends’ to be in a wedding (that she would probably try and spoil / make about her)",
          "id": 121,
          "comments": [
            {
              "score": 546,
              "content": "She probably also wants free babysitting, thus all the comments about the kids.",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "And likely ruin the day on purpose",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I think it's probably more that her wife isn't aware of how badly she's behaved in the past and has been asking why they aren't involved/invited to the wedding so she's trying to claw back the narrative about how it's STILL all johannas fault.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 519,
          "content": "[deleted]",
          "id": 125,
          "comments": [
            {
              "score": 218,
              "content": "I completely agree with your sentiment here that the father hasn't done nearly enough to address Allie's horrible actions. That being said, do you really expect a parent to cut their child out of their life? Plenty of parents LIVE for their children, and would never turn them away, even when that might be the right thing to do.\n\nPlenty of parents maintain love and relationships with children who have MURDERED people; can we really be surprised that OP maintains a relationship with Allie?",
              "id": 126,
              "comments": [
                {
                  "score": 70,
                  "content": "[deleted]",
                  "id": 127,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Exactly. My childhood neighbors' kid burned down their house. The arson investigators found that he'd started the fire by pouring gasoline on things like their bed and anything that mattered to him. Prior to that, they had tried over and over with therapists and doctors. He had a mental health diagnosis, but they couldn't force him to medicate or change his behavior. They supported him in jail when the state punished him for arson. They tried to help him after he got out. They tried their hardest right up to when he killed himself. Sometimes, as a parent, there's very little you can do.\n\nI would be so, SO upset and disappointed in my kid for being like Allie. There would have been punishments and attempted therapy, and as an adult, he'd probably be on lowered contact from me. But, as I have told him many times, he's always going to be my kid, and I'm always gonna love him. That doesn't mean I always like his behavior, but it would take a LOT to actually cut him off completely. Parenting is hard.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "And daddy told her she got what she deserved. Which is pretty accurate, no?",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "You would give up two grandchildren? You would choose to never see your grandchildren ever again? I’m always completely fascinated by people who always know exactly what they’d do in a complex situation they’ve never been in.",
              "id": 130,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 221,
          "content": "That got me too, she wants Johanna to let bygones be bygones but has given no indication that she wants to make amends or is sorry for it. Basically she expects to be told it doesn’t matter that she was so awful because it’s already happened and can’t be changed. But that she did those things matters and even if she doesn’t care, Johanna does.",
          "id": 131,
          "comments": [
            {
              "score": 122,
              "content": "Also, what’s past is prologue. No way would I want my kids to try to be friends with someone whose parent had treated me so horribly, even if the kids might be decent. I don’t know what kind of parent an entitled bully makes, but I wouldn’t plan to find out the hard way.",
              "id": 132,
              "comments": [
                {
                  "score": 34,
                  "content": "Exactly. Extra points for Shakespeare.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Very much this! There is no sense that Allie feels any kind of regret whatsoever, and a complete absence of apologies or amends - she won't even speak directly to Johanna about it, she expects their dad to play middleman. I know this type of person, and they are not worth reconciling with.",
              "id": 134,
              "comments": [
                {
                  "score": 6,
                  "content": "They are mid-twenties. This College incident is not even that long ago. If I was J, even if A has the best most authentic apology I'd still not want her in my life.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This. “Please get over it” isn’t an apology. Allie should be groveling if she really wants a relationship with Johanna, and even then, Johanna has every right to tell her to pound sand.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "Exactly. I feel badly for OP, for his child to have turned out so terribly. Any good parent wants to raise kind decent human beings, and he completely failed. If he's a decent man, he should be utterly crushed and feel terrible.\n\nI hear from his comments he tried his best, and sometimes people's best is not good enough. People don't always know the right thing to do. His failure wasn't malicious, like his daughter is a malicious person.",
          "id": 137,
          "comments": [
            {
              "score": 23,
              "content": "TheHatOnTheCat, you're on fire! This and your longer comment earlier in the thread, you're picking up the facts and laying down the judgement! If I had Reddit gold I'd be giving it to you.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "> She's still completely lacking empathy, acting narcissistic and entitled. \n\nThe fact that she actually not only assumed that she'd be welcome at the wedding but a BRIDESMAID is the best indication of this, I think. Holy cow, that's some entitled bullshit right there. \n\nWhen Allie destroyed the keepsakes Johanna had of her father, she was an adult. Plus, she was upset over a breakup, which had NOTHING to do with Johanna. Allie was angry at her ex, and rather than raging on her own or throwing around her own possessions, she senselessly destroyed specifically Johanna's treasured keepsakes. This whole incident is so far from \"run of the mill petty teenager bullstink\" that pettiness is insulted by the association. This was not petty, it was a disturbing and frankly frightening display that would have made me worry about getting her evaluated for mental illness. \n\nThere really isn't any coming back from that, in my view. And she thought she would be a bridesmaid at Johanna's wedding. Jeez louise.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1721,
      "content": "NTA for being on Johanna's side now.\n\n\nBut what the hell were you doing when your teenage daughter was terrorizing your stepdaughter and destroying her property?",
      "id": 140,
      "comments": [
        {
          "score": 607,
          "content": "Asking the bully if she wanted therapy. 🙄",
          "id": 141,
          "comments": [
            {
              "score": 641,
              "content": "That's a pretty shitty response. OP has stated in the comments that they punished the bully and tried to seperate them etc. Are you suggesting OP should have just ditched his daughter and consider her a lost case?",
              "id": 142,
              "comments": [
                {
                  "score": 196,
                  "content": "Maybe Johanna could have benefited from some therapy, having to deal with all of that. therapy is not a punishment.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 56,
                      "content": "I agree, therapy is good and could help improve behaviour",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "They tried getting her to go to therapy. Therapy does no good if it's forced.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 172,
              "content": "And when she said no he's like \"iight cool I tried durr\"",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1379,
      "content": "ESH aside from Johanna.\n\nAllie sounds awful and you and your wife have failed Johanna as long as you've know her.\n\nIf they're mid twenties and were home from college 3-4 years ago... well a twenty year old behaving like that is a lot different than a 12 year old.\n\nJohanna sounds pretty amazing though, I know I wouldn't have \"taken things on the chin\".",
      "id": 147,
      "comments": [
        {
          "score": 542,
          "content": "Johanna probably put up with it because she figured she had no other choice.",
          "id": 148,
          "comments": [
            {
              "score": 420,
              "content": "Yeah the way she silently puts up with stuff now screams to me that she learned years ago that complaing to her parents didn't do anything and possibly made things worse. She lost hope of things ever changing or getting better. Decided the only option was to suffer alone and in silence. The parents completely failed Johanna and left her to be abused.",
              "id": 149,
              "comments": [
                {
                  "score": 14,
                  "content": "Yeah it’s kind of a red flag that Johanna never made a big deal about anything.  Any child that trusts their parents to protect them would go to their parents about this behavior, particularly the destruction of their property.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 895,
      "content": "NTA\n\nHonestly, Allie treated Johanna terribly. \n\n>she'd completely destroyed Johanna's scrapbook with pictures of her dad and destroyed a lot of the shirts she had left of his.\n\nThere is no way I would ever forgive a person who did this. The stuff obviously meant a lot to J. J was treated horribly and even then she kept an open mind. The line was crossed and I don't blame her for wanting to distance herself from Allie.",
      "id": 151,
      "comments": [
        {
          "score": 150,
          "content": "I would never forgive anyone who did what Allie did to J.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "But OP invites her over to dinner, along with her victim, and expects Johanna to just be okay with it.",
          "id": 153,
          "comments": [
            {
              "score": 12,
              "content": "I believe OP said ‘family dinners’ - couldn’t that imply that these are occasions at another relatives house? Like an event where both daughters are invited?  OP said that after Allie destroyed the scrapbook, she wasn’t allowed back at the house?",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 612,
      "content": "INFO: what steps did you take back then to try to stop Allie from bullying Johanna?",
      "id": 155,
      "comments": [
        {
          "score": 544,
          "content": "We'd ground her, sit her down and tell her to cut it out, offered to put her in therapy (not as punishment just to help) and we never tried to force them to get along. We told her she didn't have to like Johanna but it wasn't fair what she was doing and that if she kept treating her this way she'd be punished, which we did.",
          "id": 156,
          "comments": [
            {
              "score": 719,
              "content": "So what conversations did you and your wife have when those consequences and conversations with Allie didn’t work? Her behavior continued for years, did you just give up and decide that since Johanna wasn’t complaining, you wouldn’t try anything else?\n\nOf course you’re not assholes for telling Allie how it is now, but there’s some pretty lousy parenting happening here. You never actually dealt with Allie’s horrific behavior (FYI, much of this is not just typical teenage BS), and you did what so many people do — expected the reasonable person to just deal with it instead of demanding that the unreasonable person change their behavior. Poor Johanna. I hope the family she’s creating gives her more support and compassion than what she received growing up.",
              "id": 157,
              "comments": [
                {
                  "score": 197,
                  "content": "I completely agree. I'm shocked at how the parents completely failed to protect Johanna and still think they didn't do anything wrong. The reason Allie is the way she is, is due to how she was raised. If she had been properly punished then the behavior would have been corrected. If talking and grounding didn't work then it's time for more serious punishment, not thinking \"oh well we tried guess Johanna has to suffer\". \n\nDid Allie ever get denied to go on a school/summer trip as punishment? ~~Go to bed without dinner multiple nights in a row?~~ Ever have to write her sister a page long apology or do something substantial to make up for her actions? I bet not.\n\nHonestly, I'm surprised Johanna hasn't gone no contact with this family that basically left her to fend for herself against her abuser.\n\n\n\nEdit: Crossed out one of the examples of punishments I got when I was young and out of control. Withholding dinner worked in my case, it taught me to not be an asshole when I was violent and therapy didn't work. It was what my parents could think to do when they had promised themselves they would never beat me like their fathers beat them. But I agree this punishment is generally frowned upon and should not be the first choice for discipline.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 318,
                      "content": "You can't withhold food as a punishment...",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 176,
                      "content": "Going to bed without dinner is such an odd punishment especially multiple nights in a row",
                      "id": 160,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 101,
                      "content": "> I'm shocked at how the parents completely failed to protect Johanna and still think they didn't do anything wrong\n\nWhere are you getting this from? By the sounds of it they tried everything short of corporal punishment. Reality is that after a certain age, parents really don't have the ability to rein in problematic kids. If they did, every parent would.",
                      "id": 161,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 63,
                      "content": ">If she had been properly punished then the behavior would have been corrected\n\nThat's false. My sister and I were punished the same way. However, nothing ever stuck with her no matter how they escalated the punishment. Some people are not right in the head and nothing will change them.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I’m genuinely curious what the next steps would have been?",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 232,
              "content": "Hey dunno if you want to edit this but you used a different name for Johanna here",
              "id": 164,
              "comments": [
                {
                  "score": 217,
                  "content": "Accidently used her real name woops.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 95,
                      "content": "Haha I figured! Just wanted to give you a heads up",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Considering she destroyed Johanna's belongings, why didn't you take away her belongings? For destroying a scrapbook of memories from an absent parent, I would give it... A year without internet privileges and 3 months of being grounded. This might seem intense but it compensates good enough for losing that scrapbook. She'll have to earn those privileges back. I'm 16 and I'm in Johanna's place. I never plan on seeing my parents again for not standing up for me.",
              "id": 167,
              "comments": [
                {
                  "score": 8,
                  "content": "OP said she’d be grounded (stay home, no screens) for about 2 weeks for breaking something (not the scrapbook incident) and only get $10 of her usual $30 allowance because they’d put the rest toward replacing J’s stuff. As someone in Johanna’s place, I’m curious if that sound like an appropriate punishment. \n\nI’m also sorry for what you’re going through. No one deserves to feel unsafe in their own home, and you deserve respect.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 7,
                      "content": "If it doesn't work then I don't know how else OP would've helped her. I just wish my parents cared a bit more about me than my brother and would try to help. He tried going to counselling but my dad told the counsellor to give up, she wanted to anyways, because he was uncooperative and disrespecting her. \n\nHe eventually beat me really bad, choked me, and threatened to kill me if I called the cops. I texted my dad and hid in the bathroom. Police showed up. They didn't believe me despite the bite mark on my arm and red marks on my neck. Nothing happened to him. I'm sick of this family. I can't wait until I'm 21.",
                      "id": 169,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 383,
      "content": "ESH.  You allowed her for years to dump all over Johanna.  So you don’t get any kind of pass in The Who’s the ass contest here. \n\nShe of course the winner though.   She treated her like garbage all of their lives.    Fine she wants to reconcile.   I’m pretty much a solid guess on she’s never started with an apology to everyone...directly to Johanna of course but also you and your wife for making the family miserable. \n\nFor her to say ‘any good father would want to see his kids reunite’ is preposterous.  Tell her naturally you do in fact want that.   However you have as much control over that as you had over her shitshow.    And you have no interest in forcing Johanna to do anything.   She needs time, consideration, and yes one hell of a SINCERE apology to start with.  \n\nIt’s Allie who needs to put in the work, no one else.",
      "id": 170,
      "comments": [
        {
          "score": 62,
          "content": "OP and their wife need to put in the work too. They need to apologize to Johanna.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 344,
      "content": "[deleted]",
      "id": 172,
      "comments": [
        {
          "score": 124,
          "content": "Yes, it’s flabbergasting that someone who has behaved as hatefully as Allie has to Johanna can now be speculating about being a bridesmaid in the wedding of the person she used to torment.\n\nAllie is not taking ownership of her past behaviour, and her attitude is still highly entitled. She wasn’t just a problem then, she’s still a problem now.",
          "id": 173,
          "comments": [
            {
              "score": 22,
              "content": "It’s not flabbergasting if Allie is a spoiled brat or a narcissist; she’d expect her parents to gloss over things as they always have, and for Johanna to just accept it silently, as always.",
              "id": 174,
              "comments": [
                {
                  "score": 12,
                  "content": "Nowhere in the post or in their respose does OP make it seem that they just \"let\" Allie do things. He repeatedly states he did literaly everything short of corporeal punishment. \nWhat exatcly do you want him to do, abandon his own daughter in a psych ward and forget about her?",
                  "id": 175,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "Allie just wants another chance to hurt Johanna.",
          "id": 176,
          "comments": [
            {
              "score": 4,
              "content": "Yes! I believe the only reason she desperately wants to go to the wedding is to wreck it! I would seriously bet all my belongings on this guess, because it’s odd how Allie all of a sudden wants bygones be bygones. No way in hell she wants to be a „sister“ now.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 216,
      "content": "NTA. Frankly, she is lucky to still be treated cordially at family events. Maybe you should ask Allie what she has done to earn Johanna’s forgiveness.\n\n>the house stunk of E6000 and mod podge. You could guess what she spent the night doing.\n\nNo I could not. I thought this was some kind of drug slang and until I googled it. Figured she spent the night depressed and getting high, haha.",
      "id": 178,
      "comments": [
        {
          "score": 137,
          "content": "I believe it was gluing the scrapbook back together in case you hadn’t figured it out yet.",
          "id": 179,
          "comments": [
            {
              "score": 16,
              "content": "Thank you! Thought she was smoking away the sadness lol.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Thanks I was confused too",
          "id": 181,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "I was trying to think of some type of revenge, to be honest. I have no idea what E6000 is though!",
          "id": 182,
          "comments": [
            {
              "score": 48,
              "content": "Industrial strength craft glue. Using it on a scrapbook seems like way overkill though — it’s the kind of glue you use on wood or leather or metal, not on paper, and it smells horrible.",
              "id": 183,
              "comments": [
                {
                  "score": 38,
                  "content": "Ohhh ok. Thanks! That just makes it sadder, this kid trying to fix her scrapbook (assuming) with whatever she had at hand.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 28,
                      "content": "The thing is, OP said she also had Mod Podge, which is literally scrapbooking craft glue, so idk what she was doing with the E6000 as well. I wonder if it was something like trying to repair a purse or a pair of shoes that Allie damaged, which would imply either impressive strength or the use of a blade on A’s part.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}