{
  "post content": "For context: I 39, got married to my wife \"Nelly\" 36, months ago. I have to say that Nelly and my daughter (her stepdaughter) \"Megan\" 16, never gotten along. They have lots of disagreements and nothing in common and it was obvious since the first say they met but I didn't do anything about it thinking they'd move past their differences and warm up to each other the longer they spend time together. I was wrong because once we moved in together the fights got worse. Nelly would complain from Megan throwing away stuff of her's just because she thought it didn't belong there. It's been basically a mouse and cat game and I've lost track on who's right and who's wrong. I did try tk establish some boundaries to try to bring back peace to my home and had them agree that each stays in their own lane and not bother each other. Nelly said that I was wrong tk think that what Megan is doing is okay but I told her to let it slide.\n\n\nNelly has especial type of haircare products for her sensitive hair. Shampoo, conditioner etc etc. She put them in the bathroom but Megan ended up throwing them away saying that Nelly had no right to store her products in the bathroom cause it's not her house. To keep the peace I asked Nelly to just keep her stuff in the bedroom and take it with her whenever she wants to take a shower to which she agreed.\n\nLast night Nelly took a shower and forgot her hair products in the bathroom. Megan ended up going in there and then the shampoo collection was gone. Nelly freaked out and then had a fight after Megan told her she dumped them out saying she already warned her about leaving her stuff laying around in the bathroom. Nelly broke down and when I said I choose to stay out of this because of how petty it was, she blew up at me. She yelled about how I keep letting Megan get away with bad attitude and unjustified misbehavior. Told me to stop enabling her and start setting consequences for her actions. I told her she shouldve been more careful knowing how Megan is so I feel like this was preventable. but she said that she forgot her stuff there and didn't think Megan would go that far.\n\nWe had an argument and that was it. Megan is acting nonchalant sdespite me talking to her and Nelly went tj stay with her parents saying I need to step up and do something.",
  "id": 1,
  "comments": [
    {
      "score": 48834,
      "content": "YTA here absolutely. She’s your child, you should be acting like a parent. Why would you act like they should work it out when it’s literally your house and your child.",
      "id": 2,
      "comments": [
        {
          "score": 26194,
          "content": "God I hope she leaves him. YTA",
          "id": 3,
          "comments": [
            {
              "score": 7999,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 5999,
                  "content": "I think it worse than that. Op clearly has no idea what’s going on with his kid. He’s never bothered to check in and really know her. I’m betting there was no therapy or any kind of professional support from the divorce and that’s why he’s ended up with her in this much pain.\n\nETA kids don’t turn themselves into bullies.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3116,
                      "content": "Honestly, I feel most bad for the stepmom. OP’s kid is a brat, and I hope Nelly calls the police on her for stealing her stuff. If you bully someone for no reason, you’re “pain” doesn't matter. Take it out on your dad instead of the innocent women",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 543,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 394,
                      "content": "You've obviously never been bullied before. Kids will absolutely bully others for no reason. Not all kids are immediate angels, I know because I dealt with it for 6 years and not a single one of them could explain why they did that to me.\n\nOPs daughter needs therapy and a psych eval.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 172,
                      "content": "It was the opposite for me. My step mother was the bully and I was Cinderella. That’s what she called me. My dad was like you guys should get along if you love me. He’s been dead for 7 years and I still have never forgiven him. He should have defended me. \n\nThis man is about to, if not has already, ruined his marriage for not defending his wife. OP, you’re a turd.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "You’re right. We need to remember that this is a child acting out. The blame lies squarely on op. I hope he gets her help before these terrible character traits are cemented into her personality.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Why is this not voted up higher.  oP is SUCH AN ASSHOLE. he's completely sidestepping g responsibility to BOTH",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "What the hell is wrong with him??? Iam surprised she hasn't left his ass yet...he totally deserves it!! How many times are you going to let that spoiled ass little shit disrespect your wife? Shes old enough to know what shes doing! Shes no doubt laughing about all this while she destroys your relationship.\nIt will only get worse with every relationship you have unless you set some boundaries\nYour poor wife..she deserves so much better!!!!.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 439,
                  "content": "OP needed to get his kid into therapy WAY before marrying this woman. I can't even call the kid an AH when OP's never done anything to help them.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 256,
                      "content": "He should never have gotten married period. He states he just thought they’d work it out by spending more time together! Lol! This has to be a troll, right? I mean can this dude really be that stupid? Well , they both have lady  parts so eventually they’ll like each other, right? It’s like parents that think just because they have children the same age that they’re automatically gonna be fast friends. Uh, nah bro. That ain’t how that works.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 354,
                  "content": "PLUS, when he invited her to move in, it became her HOME as well. Wtaf. I wouldn't have even caved on bringing my shampoo out of the bathroom. And I'm pretty enough that I would pour out her shampoo and give her a taste of her own medicine.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 18,
                      "content": "This is me. I can't keep my shampoo in the bathroom of my house.... what? It's not my house.... what the fuck!?",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "That's my pettiness too.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 352,
                  "content": "What go me was he went one step further and put the blame on his wife. “Well you should have been more careful, you know how Megan is this whole thing could have been preventable”. Which just shows how out of touch he really is with the situation. Blame his wife for leaving hair care products in the bathroom where they belong instead of hauling them back to their bedroom to appease his entitle daughter. \n\nOP: YTA",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 278,
                  "content": "Can you imagine having to deal with a brat so entitled you can’t even leave shampoo in your bathroom for fear she’ll throw it out. And knowing that when she does, her parent will blame you. \n\nWow. Op YTA.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Didn't OP essentially endorse the behavior? \"That's not acceptable, we all live here together now\" needed to be the line from the start even if his daughter is unhappy about everything, if you destroy a bunch of expensive stuff someone else owns for no reason your parent should not simply say that they can't do anything to discourage that since it's none of their business.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 59,
                  "content": "I had a partner like this.  They enabled everything to the point where the young teenager involved was threatening to kill me, flying into a rage if I even spoke to them or looked at them wrong, putting things in my food, destroying/stealing anything they wanted from me... never from my partner, of course.  Partner insinuated I was \"causing\" the problems just by refusing to \"forget\" about them, called me petty for wanting something done... and partner both wanted me to leave the teen totally alone, and also simultaneously deal with the teen as a parent without involving my partner in our \"petty\" fights.  Which... you literally can't do both of those things.  (Especially when the teen was violent when on whatever drugs they could find... they were already into the hard stuff.)\n\nHad to put a lock on the bedroom door... which didn't work because my partner never kept it locked when I was out and the kid was present.  Finally culminated with the kid breaking my family heirlooms and stealing my INTIMATE items (yes, THOSE kind), and my incompetent partner just said it was \"too hard\" to deal with when I demanded they do SOMETHING.  Kid got what they wanted in the end.  No second parent to get in their way, leaving only the enabling, compliant, incompetent parent who wanted to be their \"friend\" more than their parent.\n\nGood riddance, my life did nothing but improve when I washed my hands of both.  I only regret the wasted time I spent trying to make it work, when I was the only one trying.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "It makes me tired thinking about what kind of partner and father he is. It feels sexist like all the active parenting is on the woman..",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "YTA. Plain and simple. Your daughter sounds AWFUL.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": ">Stuff like this is how some people get anxiety disorders.\n\nYep, I was in a marriage similar to this.  I was the wife and my then husband had full custody of his daughter.  He was never a parent to her, partly because we lived with his parents who got mad at us for setting limits and making their precious granddaughter cry over not getting her way.  \n\nI stayed for 11 years.  I've always had mental health issues (since age 6 at least), but I became crippled with anxiety and depression in that marriage.  Finally, after she (step-daughter) threatened to kill me, I left.  No one in the house cared and they acted like it was certainly an empty threat.  I'd have agreed if she hadn't been so specific about how and when she was going to do it.\n\nWithin about 6 months to a year of leaving, I was me again.  I no longer have such bad anxiety and depression.\n\nI am even friends with my ex-stepdaughter now that she is an adult and has matured a lot.  There were about 4 years from the time I left until we talked again, but it was one of the best things to happen to me in a long time when we reconnected!  Things had gotten bad, but I blame the bad parenting and not her.  She was only a child and she had/has mental health issues so I can understand why she behaved the way she did as a child.  Now, as a young adult, she is a great person and I am so glad for how things turned out between us.  She doesn't even speak to her father anymore and she even asked me how I managed to stay married to him for as long as I did.  It seems like she now sees how wrong he was about how he handled things.\n\nIf you got this far, I'm sorry for such a long comment!",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "And then when you ask him to actually parent he blames you, because you \"know\" his child will act out in destructive ways and it's your job to mitigate the destruction by erasing any evidence of your presence from where you live.\n\nMy heart breaks for his wife, she needs to get out now.  Daughter learned to be abusive somewhere and from the way dad defends, ignores, and justifies the abuse I have a feeling it's him.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 627,
              "content": "I would've left the mothertrucker the moment he told me I had to store my own hygiene products in the bedroom, otherwise his immature daughter would throw them out.\n\nWhat's the point of living together if you have to hide? Nooooooo freaking way. YOU are such an asshole, dude. Discipline your irrational, petty offspring.\n\nEDIT: Re-reading this I feel like I was too harsh on the daughter, I've never lived through a divorce so I don't know what it would feel like - but I know a lot of childhoods turn sour after that.\n\nHowever, behavior like this is NOT normal, and definitely disordered/deranged. At 16 years old she knows the mindgames she is playing, and the father having practically zero interest/involvement in disciplining her or setting up boundaries is genuinely concerning. What may seem benign now, could very well turn into something more menacing.\n\nHis kid is unwell, and so is he. They both need to put in tremendous work, otherwise the lives of several people could be ruined.",
              "id": 26,
              "comments": [
                {
                  "score": 259,
                  "content": "[deleted]",
                  "id": 27,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Exactly, this is no way of living whatsoever. She needs to put her foot down and they all need to collectively decide whether they are able to live in a civil household or not. I feel genuinely sorry for her, living with these two sounds like a living nightmare.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My parents got divorced and even though I was sad I never bullied my step parents. No beef with either of them at all. \n\nSome kids do really take it out on their parents new partners though. Usually in my experience their other parent is putting the idea in their head. Also in my experience they get over it as adults. \n\nThe dad is majorly TA though and whatever the reasoning behind it he can't let his kid treat anyone in the household this way. \n\nIm a high/middle school teacher and parents like OP are half the reason that this job sucks so bad.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I honestly preferred your comment before the edit 😂😂",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 485,
              "content": "That’s what Megan is hoping for too. 16 year old is playing everyone in the house and winning. YTA.",
              "id": 31,
              "comments": [
                {
                  "score": 118,
                  "content": "[removed]",
                  "id": 32,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Husband isn't worth shit.\n\nYou said it, best.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yep. He's a lousy husband AND a lousy father.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "For real… I’m just so confused… This poor woman can’t keep her toiletries in the bathroom?! WTF??\n\nYes OP—YTA!!!!",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I hope so too.  She doesn't deserve this treatment from OP. YTA, dude.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I know this thread tends to jump quickly on divorce, but this is a case I feel it's warranted. Nelly is getting no respect, being bullied by Megan and OP refusing to be a parent and ignoring the vows he made to Nelly at their wedding. Assuming they went with traditional vows, this isn't loving or cherishing at all.\n\nI'm curious to know the circumstances behind why OP isn't with Megan's mother, as I think this would go a long way to explaining her abhorrence for Nelly, a question OP has clearly not thought to ask.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3861,
          "content": "YTA control your child. It is your wife’s house too and she should certainly be able to leave her hair care in the bathroom all of the time without fearing it will be thrown away. It is unacceptable for your daughter to be touching anyones things without their permission. And you are failing her by not establishing boundaries and consequences. You need to step up and be a parent. Start establishing and enforcing those boundaries. And for the love of god apologize to your wife for not creating an environment where she feels safe.\n\nEdit:  Wow, first time awards!  Thank you!",
          "id": 38,
          "comments": [
            {
              "score": 963,
              "content": "YTA For heavens sakes why are you letting this go on??!! Step up and ACT LIKE A PARENT- your daughter needs to be told this is NOT in any way acceptable behavior. Your wife has every right in the world to have her stuff in that bathroom- she lives there too. And as for your spoiled, entitled daughter telling your wife it's not her house and you not shutting that down then and there- what is wrong with you?!\n\nYTA and you're probably looking at a divorce in the very near future.",
              "id": 39,
              "comments": [
                {
                  "score": 630,
                  "content": "\"I don't know, hon, parenting my own child is hard, so why don't you just accept that you're going to have to live like an unwanted guest in your own home?\"",
                  "id": 40,
                  "comments": [
                    {
                      "score": 256,
                      "content": "\"What do you expect me to do? Have an uncomfortable conversation with my daughter?\"",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "100% this. The fact shes sypposed to cart her shit in and out. Wtf.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 92,
                  "content": "This is the thing that made me scratch my head. Megan insists that Nelly can’t have her things in the house because ‘it’s not her house’. But what makes it Megan’s house? Is her name on the mortgage? Does she pay for a portion of the mortgage fees? Because if not, it’s not her house either, so same rules should apply!",
                  "id": 43,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Yes, there is an interesting level of entitlement there.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Sacks of shit don't grow themselves. It takes terrible parents like OP to raise children that grow up to be walking train wrecks.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 281,
              "content": "Seriously, OP is YTA times 1000. How he thinks it was ok to even ask his wife to keep her shampoo in the bedroom instead of the bathroom is beyond me. She doesn't live in a student dormitory. 36 months of marriage and he is ok with her being told it isn't her home and she needs to hide her belongings so they aren't destroyed or thrown out. I think after 36 mo it is a wonder she hasn't left OP or been broken to retaliate and throw the daughter's items out in frustration. \n\nZero punishment for a brat of a daughter and he completely washes his hands of everything? I would say that the daughter might be reacting to something but OP only mentions what his daughter has done to hurt his wife and that he thought things would magically become better. From the post I think the daughter is just horrible, spoiled  and OP deserves to be single.\n\nETA - ok apparently I missed the comma and wife is 36 years old and they have been married for months. But other than the marriage length I still stand by everything else I wrote. One month or 36 OP is treating his wife poorly by allowing the daughter's behavior to continue and accepting it as normal.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 130,
              "content": "Not to mention the cost of constantly having to replace her hair care products. She has sensitive hair so that stuff is not cheap. He should make his daughter pay to replace it every time she does it. YTA",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Wonder if OP got married hoping to get his wife to be the parent, since he's so incompetent at it.\n\nOP, a hint - YOU are the parent.  YTA",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Absolutely. His kid literally sounds like one of the teens you'd see on one of those Maury bootcamp episodes on unruly teens.\n\nOp, this is *your* kid and is also *your wife's* house. And, frankly, you're being lazy in not wanting to deal with it. you're telling your wife that she is not a valued member of the family and is not deserving of a safe place to keep her belongings. More so, you're setting your daughter up for failure by teaching her she can do these things with no repercussions and this behavior will only spiral as she gets older.\n\nHow you figure this is not an issue that you should be concerned with is perplexing... it's probably the *only issue* you should be concerned with.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1341,
          "content": "They're married but it's not her home? He's okay she said that? She has to live like she's in a dorm room?\n\nWtf is wrong eith OP?\n\nThis guy is letting his daughter go ape on his wife.",
          "id": 50,
          "comments": [
            {
              "score": 244,
              "content": "Remember having a little plastic sand bucket or carryall to go take a shower in the dorm? Unbelievable he's fine with her living like that, I wouldn't have lasted two days.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "Gave me dorm room vibes too. Did she purchase a shower caddy too?",
              "id": 52,
              "comments": [
                {
                  "score": 53,
                  "content": "Yep, first thing I thought of too.  And even in the dorms, you’re afraid of other people using your stuff. - not just viciously throwing it away.  OP, your wife is a Saint for agreeing to that stupid setup.  YTA.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 655,
          "content": "If I had to haul my hair products to and from the bathroom every time I showered because my husband couldn’t get control of his brat of a teenager? I’d move out and divorce asap. OP, this is bullshit. Your daughter is awful and entitled, and it’s your fault.",
          "id": 54,
          "comments": [
            {
              "score": 104,
              "content": "Imagine if the wife was doing this to the daughter. He wouldn't be tolerating it then would he",
              "id": 55,
              "comments": [
                {
                  "score": 35,
                  "content": "I mean... I kind of feel like he would lol... It would just be more of \"not my problem, they'll work it out on their own.\"",
                  "id": 56,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Fair enough",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "HARD agree",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Right?! This isn't a dorm room it's her own house, legally!",
              "id": 59,
              "comments": [
                {
                  "score": 10,
                  "content": "The audacity of the 16 year old…and the AH father that thinks a 16 year old should be dictating his wife’s life!",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 503,
          "content": "I had to double check after OP so plainly saying their kid told Nelly it wasn’t “her house”.  I thought I remembered wrong that it was the GF and not wife but nope.\n\nOP YTA.  That’s your wife, this is HER house and she should feel safe in HER house.  I hope she starts throwing your stuff away so you know what she has been dealing with.",
          "id": 61,
          "comments": [
            {
              "score": 92,
              "content": "Same.  I actually scrolled back up to verify that Nelly is his wife.",
              "id": 62,
              "comments": [
                {
                  "score": 8,
                  "content": "Lmao, I think we all did.\nI almost thought I had made up reading \"we moved together\"",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "OP best make it clear this is Nellies home too, before the divorce lawyers toss both OP and his daughter into the street. Demanding the house be sold so the assets can be split.  Part of that house now belongs to Nellie due to the marriage.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 391,
          "content": "[removed]",
          "id": 65,
          "comments": [
            {
              "score": 247,
              "content": "The first time my stepkid every looked at me and said, \"it's not your house,\" and my husband didn't back me up instantly and remind the kid who pays the bills, I would have my shit packed and moved into my own house real quick. Minus a wedding ring.",
              "id": 66,
              "comments": [
                {
                  "score": 21,
                  "content": "and hopefully gotten half the disputed house in the divorce.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I think you mean receded, not reseeded. I was so confused for a sec.",
              "id": 68,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 260,
          "content": "You need to elaborate more because OP doesn't even see what's wrong here. He doesn't think it's a problem for his child to bully and destroy someone else's property. He's happy to victim blame if it means he doesn't have to discipline. OP, this should've been nipped in the bud as soon as you could prove that Megan was tossing her stuff. You should've told her that it was inappropriate, and that while she doesn't have to like or spend time with your wife, she needs to respect her and her belongings. You own the house and wife has permission to live there. It's her space too and she's entitled to a safe space. Start charging her money for every item she tosses or damages. If she doesn't have a job, take away privileges until she decides to get one or takes on equivalent chores. Stop being a lazy sperm donor and start being a father. YTA",
          "id": 69,
          "comments": [
            {
              "score": 55,
              "content": "All of this. Look, story to put this in perspective, OP: My mother moved in with my now-stepfather when I was around the same age as your daughter. Specifically, she moved us both to England from North America. So I was stuck having to move to a whole new place where I didn't know anybody, to live with a man I didn't know well and didn't like much but who my mother loved. Was I bitter? Hell yes. Did I want him out of my life? Very much. But you can bet that even the slightest *bit* of out-of-line behaviour on my part got called out and dealt with appropriately by my mother.\n\nYour daughter obviously needs a long conversation about how you've chosen this woman to be part of your life and she doesn't have to like your wife but she does at least have to respect *your* decision to have her in *your* life and *your* home (because seriously, that \"It's not your house\" crack entirely dismissed your right to allow anyone you want to share *your* house with you). Get a list from your wife and get your daughter to buy all new shampoo. And then for pity's sake, get your daughter some therapy. She is clearly not dealing well with the situation and could probably use someone neutral to talk to about the really obvious jealousy issues.\n\nETA: YTA, OP. You should have got your daughter some help with coping with that major life change a long time ago, and definitely should have done the bare minimum of disciplining her.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 212,
          "content": "Also, where tf else would shampoo and condition go, but the bathroom? I bet Megan's hair products are in the bathroom. OP should have nipped this in the bud a long time ago. I hope she sends them a bill and then leaves.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "OP's also an AH for thinking the issue would go away on its own. Like if he forced them together it would work out... NOPE!",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "This guy is in some kind of weird fog. According to his own retelling:\n\n* daughter is throwing away wife’s property if it’s someplace she doesn’t want it (who does that?)\n\n* wife is “complaining” about daughter’s *theft* (who wouldn’t?)\n\nAnd yet….op “can’t keep track” of who is in the wrong *??*",
          "id": 73,
          "comments": [
            {
              "score": 8,
              "content": "Maybe he should check his CO levels. /s",
              "id": 74,
              "comments": [
                {
                  "score": 6,
                  "content": "The answer may be on a post-it note somewhere in the house",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12409,
      "content": "YTA.  Prepare to be a divorcee.",
      "id": 76,
      "comments": [
        {
          "score": 3725,
          "content": "YUP! OP is definitely TA.\n\nJust wow.... you are enabling and allowing YOUR child to dominate the situation, act out, and get away with bad behavior. You're not just \"staying out of it,\" you're running away from YOUR actual responsibilities.\n\nYTA, big time. And also, grow a pair and deal with the situation in an appropriate manner. Bad behavior should have appropriate consequences.\n\nETA: You told your wife she should take her products out of the bathroom and keep it in her room!? Like... what!? Is this a public restroom?!?",
          "id": 77,
          "comments": [
            {
              "score": 624,
              "content": "[deleted]",
              "id": 78,
              "comments": [
                {
                  "score": 20,
                  "content": "Seriously, it's not even like a critical thing. That OP thinks this is just tooooo much that he needs to sit this one out... just wow. He doesn't even need to say anything to the wife (except a major \"I'm SORRY, let me make this right, please don't divorce me\" ;p), he just needs to *parent* his own child!",
                  "id": 79,
                  "comments": [
                    {
                      "score": 9,
                      "content": "The whole, \"she warned you,\" bit would be where I just packed up and left. He's made his choice and while a parent should choose their child, he's just letting this kid bully and torment someone he supposedly loves. Choosing the child is when the partner is in the wrong...",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "OP lacks balls but somehow created a monster",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1052,
          "content": "[deleted]",
          "id": 82,
          "comments": [
            {
              "score": 1911,
              "content": "/u/throwawaythumb1 - so, basically ...\n\nWife: \"She has thrown away my hair care products that I bought and use and that do her no harm in any way.\"\n\nDaughter: \"Hell yeah I did, because I want to make sure she never forgets that she doesn't belong here and should never dare to feel at home for a single moment.\"\n\nOP: \"Ugh, how am I ever to get to the bottom of this?? Who's to say who was right and who was wrong? Wife, isn't it possible you share at least some of the blame for acting like my life partner who lives here?\"\n\n[Hey, thanks, kind strangers!]",
              "id": 83,
              "comments": [
                {
                  "score": 289,
                  "content": "You should make this a direct reply to OP. It's perfect and he needs to read it.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Haha sure, done!",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 215,
                  "content": "The \"this was avoidable\" part really got my goat. So he's saying as long as his poor wife bends over backwards and allows his brat daughter to bully her, things will be fine. It's her fault for not doing as told - not the daughter's fault for bullying her in the first place 😤",
                  "id": 86,
                  "comments": [
                    {
                      "score": 12,
                      "content": "My mom's boyfriends kid was like this. Constantly doing shit to get under her skin. Eventually, he started doing something (unsure what) that sounded like he was building furniture in his room. Every single day, hammering away at something. He has pretty serious intellectual differences, but his dad has never had him formally diagnosed, and his response is always \"just leave him alone, you know how he gets with confrontation.\" \n\nIt ended with him attacking my mother when he was in his 30s and her in her 60s. He spit in her face and started throwing things at her. His younger brother intervened and called the cops. Her boyfriend handled it by buying a house with an in law suite and sticking his kid in there. I cant believe my mom stayed with him, but I guess after 20 years of a kid being a shit ass to you, you get used to his dad not doing jack shit. \n\nOP is a huge YTA and his daughter's behavior will escalate.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "The daughter is saying it's not her stepmother's house. Even though stepmother has been married to dad for a few years, has lived there a few years. OP should have shut that down the first time his daughter tried the \"it's not her house!\" thing, instead of basically agreeing with her and telling his wife to live like she's just crashing with them for a few days.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Like, \"can I keep some toiletries in your bathroom\" is one of the most minimal indicia of couplehood.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "A prime, real-world example of [We’ve tried nothing and we’re all out of ideas](https://youtu.be/lkKwyjsJGxk)",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 225,
              "content": "Most cat owners would try harder to get their cats to get along than OP is trying with his wife and daughter.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "No no no. I treat my cats WAY BETTER than this. He’s treating his wife like the pieces of shredded up paper bag that I pick up after deliberately allowing my cats to shred it up.",
              "id": 92,
              "comments": [
                {
                  "score": 12,
                  "content": "I mean, he is pretty on point calling it \"a mouse and cat game,\" though. You know, because evidently the wife is an unwelcome pest and it's the daughter's job to chase and harass her out of their living space.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 6,
                      "content": "His wife is the paper bag that the cats tear up.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I have instilled more discipline in my cats than he has in his daughter.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 190,
          "content": "Serial divorcée, from the sounds of it…",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "I got 1/6th throw and had the Simpsons meme \"we've tried nothing\" playing in my head.\n\nAlso OP WTF\n\n>never gotten along. They have lots of disagreements and nothing in common and it was obvious since the first say they met but I didn't do anything about it thinking they'd move past their differences and warm up to each other the longer they spend time together.\n\nStop...\n\nThis is where you chose the mini-you to thats physically attached to you over the mini version of you that you should be looking after.\n\n>. I told her she shouldve been more careful knowing how Megan is\n\n... Do not want to get banned.",
          "id": 97,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "It’s so obvious Meghan wants to run off Nelly and OP seems prepared to let her. Hope he enjoys being single for the rest of his life because his daughter doesn’t want to share her daddy with anyone.",
          "id": 98,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8138,
      "content": "LOOOOL YES YTA!!!\n\n\"She yelled about how I keep letting Megan get away with bad attitude and unjustified misbehavior. Told me to stop enabling her and start setting consequences for her actions. I told her she shouldve been more careful knowing how Megan is but she said that she forgot her stuff there and didn't think Megan would go that far.\"  \n\n\nYour wife is 100% right. What you're allowing is unacceptable.",
      "id": 99,
      "comments": [
        {
          "score": 1717,
          "content": "[removed]",
          "id": 100,
          "comments": [
            {
              "score": 437,
              "content": "She's two years off being a legal adult. Not so little a monster.",
              "id": 101,
              "comments": [
                {
                  "score": 117,
                  "content": "OP had better do something before Meghan starts pissing on him to mark territory.",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Yep. Seems like Megan has a lot of strong emotions about the stepmother and has not had a parent help her work through them. Teaching her that it’s ok to act like a dictator when she’s upset will not do her any goods. I also kind of feel like OP is leaving out some important details regarding Megan’s past. Where is the mom in this picture? Did she die and Megan feels like stepmom is trying to replace her? Did they get divorced and Megan feels like Nelly was responsible? Does mom have partial custody and is encouraging this behavior? Is she completely absent and Megan feels abandoned? None of these scenarios justifies Megan’s behavior, but it does make OP more of an asshole for not helping his daughter through whatever she has going on",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "> raising\n\nThat’s a strong word for what OP is doing.",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 686,
          "content": "“She should have been more careful knowing how Megan is”??? As is she an AH who has receive zero parenting? OP, this isn’t just about being fair to your wife. If you keep not parenting your daughter, you are essentially unleashing an entitled AH to society. That is 100% on you, and the older she gets the tougher it will be to fix.",
          "id": 105,
          "comments": [
            {
              "score": 153,
              "content": "[removed]",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "She should've been more careful and never married this fool is more like it.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Oh the society will teach her a good lesson ❗❗❗ they have to learn it hard way but they definitely do learn...\nOther people won't be as soft as her stepmother and let her be ... Strangers will return her attacks twice as hard 🤣😈",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Exactly this!",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 311,
          "content": "“Look I’m sorry I can’t help my child is a dick” is not parenting. \n\nIf your child is behaving badly then, y’know, *be a parent*. She may be 16 but she does not have an equal say in this situation.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7162,
      "content": "[removed]",
      "id": 111,
      "comments": [
        {
          "score": 1723,
          "content": "A hostel is a good comparison, I immediately thought of college dorm days and having to carry stuff back and forth in a little bucket lol",
          "id": 112,
          "comments": [
            {
              "score": 405,
              "content": "Me too, only I lived in a suite with one other girl and a shared bathroom. She didn't think that the shared bathroom (between the two of us) was for storage, and would put ANYTHING i left in there on my desk. Shampoo, straightener, extra TP, sanitary products, the dripping wet poofy thing that isn't a loofa but doesn't have a name, body wash, perfectly normal things that should go in the bathroom. She also thought I should be wiping down all surfaces, including the floor, with a paper towel every time I entered the bathroom. And refused to recycle.",
              "id": 113,
              "comments": [
                {
                  "score": 207,
                  "content": "Omg I would have requested a new dorm mate. That’s insane.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 119,
                      "content": "I always thought I was fairly neat up until I met her, and then I learned there was an entire new category of clean.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "It’s a pouf. 😊\nGenuinely.",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Can you imagine sharing a college dorm or flat with OPs daughter? She would be a nightmare.",
              "id": 117,
              "comments": [
                {
                  "score": 8,
                  "content": "I can imagine it and I have to say I don’t like it",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Does his daughter also bring her stuff in and out of the washroom? I could see the shower being too crowded, so keeping specialized products in a bin under the sink possibly (I do that with my ‘date night’ shower stuff that I don’t use super regularly).",
          "id": 119,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5246,
      "content": "[deleted]",
      "id": 120,
      "comments": [
        {
          "score": 2382,
          "content": "YTA. Team wife on this one. OP, you’re a HUGE AH. She’s your wife now, and she is completely right. You’re an enabler for your daughter’s poor behavior. You are creating a monster who feels like she has zero consequences for terrible, abusive behavior. \n\nIt’s not petty. She is destroying things that belong to your WIFE in her OWN house. She shouldn’t have to take her belongings and hide them because your spoiled daughter can’t control herself.",
          "id": 121,
          "comments": [
            {
              "score": 422,
              "content": "He definitely thinks this is petty because it’s “just women fighting, you know how the ladies are…” Gross. He deserves to be alone.",
              "id": 122,
              "comments": [
                {
                  "score": 24,
                  "content": "It's just silly hair products I get the 100 in one and it works just fine! Stop being sensitive over these girl things /s",
                  "id": 123,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Pfft. Diva. I use dish soap and a Brillo pad for hair, body, and housework",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "*wont control herself. Not can’t. IMHO.",
              "id": 125,
              "comments": [
                {
                  "score": 10,
                  "content": "Good point. She probably is capable. She’s just never had a reason to since her father lets her do whatever.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Exactly! And the daughter is not a 2 year old, who destroyed something because she can’t control her emotions yet. She is a teenager, spoiled brat that now knows she can do everything without any consequences. \nOp your are a huge AH! Get your shit together and do something!",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2314,
      "content": "YTA.  Is this for real? You let your 16 year old daughter dictate where your wife keeps her shampoo, you let her say it's not your wife's house, you let her get away with throwing stuff away?\n\nIt's past time to address this directly. Apologize to your wife, set clear boundaries for your daughter, and follow through.",
      "id": 128,
      "comments": [
        {
          "score": 589,
          "content": "YTA I am concerned that your daughter's next step will be to \"spike\" her products with something that harms your wife's hair!",
          "id": 129,
          "comments": [
            {
              "score": 136,
              "content": "Or she’ll go searching through her property to find things to destroy and upset her. Clearly the shampoo is not the problem it’s the wife, and the daughter will likely escalate her destruction to push her out if she has any sense that it’s successfully driving the wife out. Could be clothes, jewelry, electronics, girl might just decide to cut up her pillow and bedsheets, who knows what an entitled and vengeful 16 year old might do?",
              "id": 130,
              "comments": [
                {
                  "score": 11,
                  "content": "Especially since until now she's been without consequences and has only seen the desired result \"I destroy wife's property; she leaves.\" It's going to be an uphill battle even if husband gets his shit together because of the precedent he's set and created.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "This",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I know someone whose visiting BIL did this - poured out all her expensive hair products & replaced it with something gross. Thankfully, she noticed right way before actually using it.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "This is exactly what I came to say!  Why is OP letting his daughter dictate where his wife can keep her hair products?  His should be making his daughter pay to replace the hair products she threw away and she should be grounded.  The 16 year old should not be running the house.\n\nOP is definitely the AH.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2228,
      "content": "Yup, YTA and you've done nothing as a dad and husband to help create a happy home.\n\nYou let your daughter run the house and get away with being totally shitty towards your new wife. You 100% need to step up, set 'real' boundaries for your daughter, and maybe do some family counselling.  A great way to start is by telling them both 'I am a huge AH for how I've handled the blending of our family.  I want to help make it right for you both'.",
      "id": 135,
      "comments": [
        {
          "score": 355,
          "content": "OP is definitely yta.  How can he sit back and never do anything to try to get some harmony in the house?  Megan needs to learn that this is nelly's home and that she has every right to have things wherever she wants in the home.  Nelly isn't intruding in Megan's room from what I can tell.\n\nOP needs to deal with this situation.  I think Megan should be made to replace the products she threw away.   She should also be made aware that she will have to replace anything else of nelly's that she destroys or throws away.\n\nPoor Nelly.  I can't imagine living in such a hostile environment and my husband not giving a flying fart.\n\nEdited to add...your WIFE shouldn't be forced to bring in a shower caddy with her products every time she showers.  This is her home not a dorm.  How degrading!",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "What totally got me was him saying he told them te leave each other alone to get some peace. As in: him getting some peace. Showing he doesn't care how his wife and daughter are feeling, as long as he doesn't get bothered by it too much.\n \n+It's not stated how long ago op and wife started dating but I dislike parents who just assume time will bond child and stepparent without putting much effort into it. Again, showing how op doesn't care as long as he's not bothered and gets his peace.",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I bet he'll claim surprise when he's served with divorce papers.  He seems like a creep.",
          "id": 138,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 987,
      "content": "[deleted]",
      "id": 139,
      "comments": [
        {
          "score": 299,
          "content": "It is very likely bait...but sadly, there are 'plenty' of people who are more than this dumb IRL (just probably not also posting on Reddit...)",
          "id": 140,
          "comments": [
            {
              "score": 228,
              "content": "Sadly, this happened to me. My husband is the sweetest man (why I love him) who does everything he can to avoid conflict. Our early marriage was awful because of step daughter and I almost left him many times. I just didn’t want to leave HIM, I wanted out of the daily gaslighting and anxiety from SD. He finally got therapy and realized how his lack of influence over SD made things worse. He found his voice and kicked her out at 24. Our marriage is super strong now that she’s not causing drama.",
              "id": 141,
              "comments": [
                {
                  "score": 74,
                  "content": "Girl, as a fellow stepmom, let me say- we are the most under appreciated people & only another stepmom understands what a complete bullshit hard place you get stuck in through no fault of your own. I’m glad you made it through & that your husband finally stepped up to be the parent AND spouse he needed to be. But I would have never made it until SD was 24, not a chance.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 16,
                      "content": "You could say I’m bullheaded - no way a child was going to best me! Lol \n\nAnd yes, step parenting is HARD. I’m a step child too. My stepdad is awesome! I have a new appreciation for what he experienced. My youngest step daughter is a step mom and she says she totally understands all of the fights she witnessed between her dad and me. We are super close now.\n\nAs for why I stayed when the oldest was being her worst? She got pregnant at 17, and I absolutely loved that kid. He was my heart and soul and I couldn’t leave him behind in all that toxicity. I raised him while she danced on bar tables and sent naked selfies from the family computer (not sure if she was stupid or left the photos out purposely for me to find them)… her best ammunition was to go NC and refuse to let us see him. That sucks.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "The mods really need to bring back the acronym for posts like this. I think your comment still gets removed if you mention it.\n\nEdit: Just tested it, automod still removes it.",
          "id": 144,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Oh but they are. My ex husband was just as bad (probably worse actually) than this with his kids which is why I divorced him. Guilty parenting syndrome after divorce is a real thing - some parents absolutely refuse to parent their kids out of guilt.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'm over here wondering is this for real and it kinda smells like bait, but wtf some people really are this broken. OP for sure, YTA, fiction or not.",
          "id": 146,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 462,
      "content": "YTA. You should back your wife - imagine if this was reversed and she had a child throwing your things out because 'it's not your house'. Obviously Megan is young and not taking this very well, but that doesn't excuse her behaviour and you shouldn't let it slide.\n\nI actually feel sorry for your wife. As a husband you should be supporting her as it is clearly making her upset to the point of breaking down. 'Keeping out of it' isn't really an option here. It's not her biological daughter and Megan clearly does not respect her as a parental figure, thus, you have to step in.",
      "id": 147,
      "comments": [
        {
          "score": 152,
          "content": "Megan doesn’t need to accept OP’s new wife as a parental figure. She’s 16, not a small child. Megan does need to show OP’s wife baseline respect as another human, and this is where OP is failing as a parent. \n\nMegan is going to go into adulthood thinking this is how she can treat any roommate she doesn’t like and get away with it. Better to nip it now before she gets thrown out of college dorms or school altogether, evicted from an apartment, served with a restraining order, etc.",
          "id": 148,
          "comments": [
            {
              "score": 12,
              "content": "I agree, she should not be forced to see her as a mother figure at all but she should give her decent respect of not throwing her things away. Definitely teaching her poor behaviour like you said",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Or if the wife was throwing away precious daughter's belongings, Op would raise hell.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 445,
      "content": "Just so we’re clear, you’re letting your teenage daughter terrorize your wife without even *attempting* to course-correct because you can’t be bothered to parent her? You might as well start referring to “Nelly” as your soon-to-be-ex wife because there’s no way in hell she’s going to stick around when you’ve shown her that you don’t have her back *at all.*\n\nYTA.",
      "id": 151,
      "comments": [],
      "relation": "Attack"
    }
  ]
}