{
  "post content": "I have a 16 year old daughter, and she has 3 big chores that we pay her allowance for. She puts out the garbage, cleans up the dog poop in the backyard, and empties the dishwasher. I refill the dishwasher, so when she doesn't do her job I can't do mine (yes, I could just do it myself, and I have, but we pay her to do it, so why should I?) \n\nThis weekend my wife asked her to empty the dishwasher, and take the trash out. She said \"Ok\" then just went up to her room. I went up to her room an hour later, and found her laying in bed watching youtube on her phone (Volleyball videos, nothing important, if anything on youtube could be considered important) I took her phone away, and said \"Your mom asked you to do your chores, not watch videos, please do them so i can do mine\" She said \"Whatever\" and just continued laying there. So I told her if she is not down in 10 minutes I was going to send a picture of myself to all of her friends on snapchat. Now we have tried plenty of different methods of punishment, but nothing really gets to her. I know how important social media is to the kids now a days, so i figured I would try that, and see if anything happened.\n\nI gave her 20 minutes, and still nothing. So true to my word my wife and I took a selfie on her phone and I sent it to all of her friends with the caption \"Someone didn't do her chores like we asked :'( \" I didn't go through her messages, i didn't even read the replies to our picture, that was it. A few of her friends know me, and know what I'm like, but apparently the picture went to a group chat from her school, and to a few boys she liked and just stalked on social media, but didn't message. She says it was so embarrassing, and I'm an a-hole for doing that.\n\nBut come last night, my wife asked her to do the dishes. She first refused and went up to her room, but I reminded her what would happen if she didn't listen. She was downstairs like a rocket and put the dishes away so fast she almost broke some of them. So obviously the punishment seemed to have worked (for now), but she screamed at me calling me an a-hole all night. I am just a Stepdad, so I'm still fairly new at this. So I thought I would bring the vote to you guys. AITA here?",
  "id": 1,
  "comments": [
    {
      "score": 11933,
      "content": "NTA. I'm a young (20's) woman and while I never really understood the obsession some girls in my age range have with social media, I find this \"punishment\" hilarious. I could totally see my own dad doing something like this. And honestly, you aren't really hurting anything no matter how big a deal she is making it out to be. And whatever embarrassment she is feeling will be short lived I'm quite sure.",
      "id": 2,
      "comments": [
        {
          "score": 2058,
          "content": "Same I laughed at this and thought of my own dad",
          "id": 3,
          "comments": [
            {
              "score": 494,
              "content": "Right! I can picture the selfie my dad would take",
              "id": 4,
              "comments": [
                {
                  "score": 277,
                  "content": "Yeah, she'll be laughing about this in 10 years.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1805,
          "content": "I agree, NTA, but I think once she started calling you an AH, your wife should have stepped in and put a stop to it. I’m in my 30s and am appalled she got away with swearing at the two of you, even in front of you. I do think though that since you’re there step-parent, mom should be doing the brunt of the punishment. You don’t have to be “friends” with her by any means, but it looks like mom needs to put her foot down more than she is.",
          "id": 6,
          "comments": [
            {
              "score": 186,
              "content": "Mom was in the photo too",
              "id": 7,
              "comments": [
                {
                  "score": 708,
                  "content": "But she let her daughter call step dad an AH all night, and wasn’t the one to go up to her room and enforce the rules.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 252,
                      "content": "True, Mom is letting the behavior happen without consequences.  However, if the step parents doesn't take on the role of parent in that situation, then no-one will be enforcing rules and consequences and the teenager's behavior will be left unchecked completely.\n\nEdit: I think I agree with your original comment.  There were people saying step parents have no right to discipline and I got mixed up.  I think I am spending too much time on Reddit this is the second stuff up I have made today.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 103,
                      "content": "That’s what I have an issue with, the enforcement.  Swearing?  Meh, depends on the family. I was cool with it as long as it wasn’t a grandma — theirs or anyone else’s.  Willfully disobedient?  Words and consequences. \n\nHave to say:  this is better than the time I stacked my kiddos dirty dishes on his bed when he didn’t get them out of his room like I asked. \n\nOP:  NTA.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "As a former stepdaughter, sometimes you have to pick your battles. If my parents had made a big deal out of it every time I called my stepdad an asshole, they would have been too exhausted for the real issues.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Shouldn't matter. The OP is stepping up to the plate of raising the kid and every parent (whether step or not) deserves the right to discipline the kid.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "Totally agree. She should not be allowed to call you names. Also, when she doesn’t do her chores does she still get an allowance?  She shouldn’t of course.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "[removed]",
              "id": 14,
              "comments": [
                {
                  "score": 77,
                  "content": "my step-dad (and my mom) would have yeeted me out of the house if i called him an AH.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Uh, yeah. Same. I’ve been yeeted out of the house before. I even died once.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Not only are you NTA, but you should step up your game and post another pic of you guys and caption it, \"the assholes\"",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I think there is a lot of backstory here that OP does not tell us. I mean, he starts out calling the girl his daughter, and at the end it turns out that he is her stepdad, and has only been so for a short while.\n\nHow long has he been together with his wife? What happened to the daughter's bio-dad? Did the girl's parents divorce because of OP? Or is the girl's bio-dad deceased? Did she maybe grow up only with her mother and is therefore resentful of OP? What other incidents happened in the past that might have fueled the girl's resentment toward OP?\n\nOh, and is the dog whose poop daughter is supposed to collect in the yard actually the daughter's dog, or even the family dog? Or do random dogs from the neighborhood do their business in OP's yard, and he is too lazy to put up a fence and send the girl out to collect the poop? This chore strikes me as odd. If it's the daughter's dog, then she is responsible for it, but that is by no means clear.",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 971,
          "content": ">And honestly, you aren't really hurting anything\n\nCould be hurting his potential relationship with her.  Public humiliation (even in such a tame and mild way) is dicey as punishment.   OP doesn't think of this as serious, but we should keep in mind that this is her whole life.  Her school and social group are important to her as they should be.  Intentionally publicly embarrassing your kid is a good way to sow resentment.\n\nOP says he is a \"new\" stepdad so he doesn't have the relationship foundation.  OP and his wife should set some house rules they agree on and then the mom should be handing out punishments.",
          "id": 19,
          "comments": [
            {
              "score": 100,
              "content": "This post should be higher. Spot on.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "Completely agree. How would the dad feel if next time they have a disagreement she emails all his contacts to moan about her 'mean stepdad' - which could include work colleagues, his boss etc, just like he didn't really know who he was sending the Snapchat to.",
              "id": 21,
              "comments": [
                {
                  "score": 16,
                  "content": "Jesus, I hope she does.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "This. Not the parent. No relationship. Just a bully humiliating her to her friends.   \n\"But it worked\" smh",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "I've seen tons stories where parents post embarrassing things on social media as a punishment/joke and there were real consequences like bullying at school and kids can actually kill themselves over this crap. This was essentially harmless but I'd be careful about it. Punishment should be kept in house and purposefully embarrassing your kid in public can backfire. NTA but I would find a different punishment. Maybe take the phone/internet away instead?",
              "id": 24,
              "comments": [
                {
                  "score": 5,
                  "content": "Taking away their access to social media also isn't work, because often social media is a big part of a teen's emotional support group.\n\nMaybe the stepfather should talk to her and ask why she doesn't have the energy to get up and do her chores, it's not necessarily laziness, there could be any number of reasons.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This. It was foolish and lazy parenting, as all humiliation tactics are. \n\nAnd if OP wants to rely on this, he will also need to escalate the humiliation factor each time for it to work. So he’s happily throwing away any chance of a respectful relationship, for sheer obedience because he can’t be bothered to help her structure her time, and base consequences around that (ie chores can’t just be done, they must be done by this time each day or no allowance). \n\n“I’ve tried nothing and I’m out of ideas”",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "So if OP, one time, acts unfairly or unreasonably to his step daughter (like most parents do sometimes) I'd like to see the step daughter hack into OPs email account and disclose his behaviour to work colleagues, old friends, friends he has lost touch with, relatives he doesn't like, ex-partners, etc. See how he likes it.\n\nThe step daughter needs to do the chores but this punishment is disproportionate and cruel.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm so glad to read this response! Especially since he's a new stepdad.\n\nThe above response isn't that insightful. She is a young woman who does't get other girls obsession with social media. Okay? So what? Clearly it's important to OP's stepdaughter and so judgment should be tailored to their situation. If he uses something she takes seriously to embarrass her he might damage their relationship. That's the truth. \n\nShe even admits that the daughter will be dealing with embarrassment but says it will be short lived. Honestly, a new step father using embarrassment to punish me, while assuming it was fine would because it would wear off, would make me dislike my new stepdad.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Exactly. YTA",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 521,
          "content": ">I find this \"punishment\" hilarious. I could totally see my own dad doing something like this. \n\nInteresting how the only way this punishment can be \"justified\" is as a joke.  That her anger and embarrassment are trivial silly feelings.  That her whole world and what is important in it is \"hilarious\".  The complete lack of respect for her feelings, her world and the daughter herself is corrosive to any relationship.  That fact won't be lost on her.  You are thinking of your father, but OP is a new stepfather.  He doesn't have a relationship foundation (and even if he did this would be a bad idea).\n\n\\>And honestly, you aren't really hurting anything no matter how big a deal she is making it out to be. And whatever embarrassment she is feeling will be short lived I'm quite sure.\n\nYou can't be sure of that.  It's just a likely she will remember the humiliation and at 16 OP is not going to have much of a chance to mend serious damage.  There is a reason not a single therapist or parenting authority will tell you to punish with humiliation.",
          "id": 30,
          "comments": [
            {
              "score": 67,
              "content": "She could have avoided all of this by just doing her chores.  \n\nShe was asked to do her chores, she refused.  She was asked again, she refused.  She was asked a third time and told of the consequences, she refused.  \n\nHer anger and embarrassment ARE trivial because she could have easily avoided all of this.  \n\nThe new parenting trend of kow towing to children as to avoid possibly hurting their feelings is ridiculous.  The first time my parents asked me to do my chores if I didn't immediately comply I would've gotten my ass beat.  Now do I agree with that?  No, absolutely not.  But the fact remains at no point in time did I think it was OK to disobey my parents and at no point in time did my parents allow their children to run their household.  \n\nWe're all a family.  We all live here.  We all need to do our part.  When Step Dad doesn't do his part the lights get disconnected.",
              "id": 31,
              "comments": [
                {
                  "score": 79,
                  "content": "Entirely illogical arguments.\n\nPunishment X is not justified simply because it could have been avoided, regardless of what is substituted for X.\n\nEmotional Response X is not trivial simply because  it could have been avoided, regardless of what is substituted for X.\n\nAndy Grogan-Kaylor, Ph.D. in Social Work, says \"The research is pretty clear that it's never appropriate to shame a child\" going on to include anxiety, depression, and aggression as longterm side effects.\n\nJennifer Lansford, a research professor at Duke Univesity stated that punishments that make a child stand out can often provoke bullying and \"it can lead children to perceive they are personally rejected by their parents\". With bullying an array of other side effects.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I don't understand this logic at all. Of acting like someone isn't the asshole because the other person could have avoided their strict punishment/wrath/whatever it is. I feel like I see it on AITA a lot. Just because something provoked the response doesn't make the response automatically not asshole-ish. \n\nDo these people also not understand why cruel and unusual punishment is banned by the constitution? We should just torture prisoners because they could have prevented being there so fuck it, anything goes?",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "well the jews could have avoided the holocaust if they just left germany.",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Wouldn’t it be easier for OP and his wife to just take away the allowance? Like if she’s being paid to do the chores and she won’t do them, take the payment away. Yes it may mean a few days of OP picking up the slack, but daughter will soon realise she values having money more than she hates the chores.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "[deleted]",
              "id": 36,
              "comments": [
                {
                  "score": 8,
                  "content": "If she was already being bullied the images being shared would have made her life a lot worse. \n\nSeriously just take away her phone and dont pay her for the chores she did not do or ground her. Dont seriously damage her relationships by humiliating her. Do some actual parenting.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Some of these comments are upsetting. OP didn't take this to extremes, but all the people claiming it isn't a big deal should Google it. I found 7 suicides with one fairly superficial search for \"teen suicide shaming punishment.\" Every one of the results was in national headlines for a while with people just losing it and attacking the parents in those cases, but what is the point when its obviously forgotten immediately. I don't think OP went nearly as far as most of those parents did (like the father that cut his daughter's beautiful long hair and took pictures to post on social media) but it is a big deal. Kids that are struggling in school or upset about something they can't handle on thier own need to know their parents are safe and on their side. Public shaming makes it very, very clear that parents can't be trusted in that situation. I\"m guessing OP and his wife wouldn't appreciate a picture on social media detailing one of their arguments for the world to see, and they aren't teenagers with very little control of their circumstances.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It is a selfie we’re talking about here, not public whipping. NTA",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I'm a teenager and couldn't imagine disrespecting my parents like this. This diet of punishment wouldn't work on me cause I'm not that damn sensitive about social media. It shouldn't be that serious and this is an instance where she'll either get over it or irrationally hold onto these feelings years later, and she'll be the one that needs to let go\n\nShe got to be a lazy brat, and keep her allowance and privileges intact. It was just a selfie. She can get over herself.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 372,
          "content": "Yeesh, this reads very Not Like Other Girls. What part of OP's daughter's behavior seemed \"obsessive\"? Her dad sent an embarrassing picture to all of her peers. It's easy to say it's no big deal now that we're out of high school, but just because it wasn't important to *you* doesn't mean it wasn't important to *her*.\n\nIf this is difficult to understand, imagine instead that her stepdad starting making funny faces and pouting while picking her up from school, loudly proclaiming \"Daughter didn't feel like doing her chores today and it makes me sad! :(\". This isn't a \"social media\" thing, it's embarrassing her to her peers...and purposefully so, otherwise, why would the dad call it a punishment?\n\nSide note, I'm a 30 year old girl, and most of my friends would have found it funny and I wouldn't have been embarrassed, but that's because I was already a fucking weirdo band geek drama club nerd, so it would have been par for the course. But I couldn't imagine how embarrassing it would be for anyone who just wants to get through high school without drawing attention to themselves.",
          "id": 41,
          "comments": [
            {
              "score": 60,
              "content": "It's... not really no big deal now as an adult either. Sure if someone sent something like that to my friends, it wouldn't be a big deal to me, but this went to everyone. Not just friends. \n\nHere's the adult version of this: Take your significant other's phone while they're in the shower, and texts a big group chat of their coworkers a picture of your face with a caption \"someone's not keeping up their end of the laundry-vacuuming deal :'( \"",
              "id": 42,
              "comments": [
                {
                  "score": 10,
                  "content": "~~I don't understand your point. Of *course* it's not a big deal as an adult. I'm saying it's a MUCH bigger deal to a child. Your entire world is so, so much smaller. If all of your friends in high school decided you were lame and didn't want to hang out anymore, the isolation isn't something easily overcome...while as an adult, there are plenty of opportunities to find friendship elsewhere. I suppose you could say they weren't true friends to begin with, but, again, it's *high school*. Even shallow friendships are better than none.~~\n\n**EDIT**: DISREGARD. I misunderstood the wording. I agree with you, shaming people is shitty as an adult AND as a kid.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 7,
                      "content": "If I'm understanding correctly, the commenter was saying that it's NOT no big deal for adults--a double negative, so it would be a big deal. I think their point was that it's never okay to shame somebody as a punishment, no matter their age.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Not to mention the fact that he's putting her friends in a really awkward situation. I'd feel super weird about it if my friend's dad started texting me every time my friend didn't do her chores at home.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Holy shit thank you. I couldn't believe the first comment I read was along the lines of \"I think this is funny. I'm a girl who isn't distracted by such silly things!\" \n\nLike why is this 20 something's opinion on social media even relevant? We all have some trivial things that are still important to us. Just because other people don't understand why we take them seriously doesn't make our feelings about them less valid.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You are not a girl after 30 sis, you are a lady.",
              "id": 47,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 310,
          "content": "She’s 16, you’re not in the same age range anymore. It’s not a girl thing, either. It was hilarious, but of course a 16 year old responds differently to social shaming by their dad than a young 20 something.",
          "id": 48,
          "comments": [
            {
              "score": 96,
              "content": "I Am sixteen and a teen girl. I most definitely back this person up This is beyond hilarious. Mainly because she was being disrespectful and rude. Like dawg this is your family; try to help, and love them as much as possible.",
              "id": 49,
              "comments": [
                {
                  "score": 151,
                  "content": ">This is beyond hilarious. \n\nTo you.  It's not hilarious to the daughter.  And OP is headed down the road of a bad relationship with his new step-daughter if he's not careful.  Public humiliation is not a good punishment tactic.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Look, try to be less short sighted. \n\nYou think it’s hilarious. Would you think it was hilarious if your new stepdad, who you were adjusting to with all those power struggles and new boundaries, showed you that he’s willing to embarrass you and stomp on your boundaries? Dude is in her house. She’s getting used to it. And he just showed her: he’s a lazy parent who uses humiliation parenting, and does not put the effort into parenting at all. \n\nSo imagine. You think it’s funny. You’re her peer. And she sees you all laughing because it’s funny. But to her? It’s like everyone is laughing at her entire situation. New stepdad calling the shots.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Could also cause bullying at school. He didn't just send it to her close friends, he sent it to everybody. He does not care about her wellbeing if he thinks public humiliation is the way to go.\n\nStudies even show that public humiliation can work, but ruins someone's confidence and is a good way to make sure your child will not want to talk to you ever again. \n\nYTA.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Right, the point I was trying to make is that I still remember vividly what being 16 is like, and was also a teenager in the era of social media being so widely popular, that's all.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 236,
          "content": "Yeah, this is hilarious. I'd be mad too, but that's just the teenager in me and her being mad is the teen in her as well. Don't fret over it.\n\nNTA",
          "id": 54,
          "comments": [
            {
              "score": 55,
              "content": "[deleted]",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 196,
          "content": "And while im not like the other girls",
          "id": 56,
          "comments": [
            {
              "score": 106,
              "content": "lol thank you.  such an unnecessary dig at someone else’s hobby.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 178,
          "content": "congratulations on being not like the other girls!",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "You never understood the obsession, therefore embarrassing her is ok? I think YTA.",
          "id": 59,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5976,
      "content": "YTA. You said she has three chores that she does for her allowance, this is the agreement. She chose to not do the chores therefore she won't receive her allowance, this was her choice. Granted that may not be clear to her until it comes to the day she's expecting money and doesn't receive any, but that's the lesson. \nyou have punished a person when punishment wasn't warranted, this wasn't a crime she simply didn't fulfill her part of the transaction.",
      "id": 60,
      "comments": [
        {
          "score": 2315,
          "content": "Oh, this is a fair point. I forgot about the allowance. If the allowance is contingent on the chores, you're right, OP shouldn't also be inflicting additional consequences.",
          "id": 61,
          "comments": [
            {
              "score": 616,
              "content": "Or its a valuable life lesson. I dont feel like going to work this week and dont mind not getting paid, heyho.",
              "id": 62,
              "comments": [
                {
                  "score": 381,
                  "content": "Except that in the working world, you typically don’t just get to go without pay for not showing up - there are usually other consequences, such as getting written up. Not many places just allow you to no-call, no-show with no other consequences.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 218,
                      "content": "Thanks for reiterating my point?",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "So you write her up, say I will allow you to do the chores for your allowance this week but if you don’t do it again, you won’t get allowance ever again even if you do them. You will have to enter another contract",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yes my boss also steals my phone and sends pictures to everyone on my social media when I slack off",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 159,
                  "content": "Show her how the adult world works. Kick her out and then adopt a 15 year old and pay them 80% what you paid her. Then write off both children on your taxes.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 14,
                      "content": "That's the real American way",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 67,
                  "content": "Agreed.\n\nNot only not getting paid, but most likely fired as well. Personally I think the step dad finding another punishment is more fitting for how the adult world works. Don't want to work? Fine, we'll find someone to replace you. Can't pay your bills? Fine, we'll evict you and take away whatever you still owe money on.\n\nUnfortunately for 99% of us, being an adult means doing the things we don't want to do, so that we can continue doing the things we DO want to do.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 3,
                      "content": "So for the record, that second thing sounds far more traumatic than the “public shaming” thing that people keep accusing the OP of scarring the daughter for life with. \n\nUnless the constant threat of homelessness and belief that your parents do not care for your wellbeing and safety is preferable to minor embarrassment, that is. I was thrown down a flight of stairs once for breaking up with a dude I’d known for a week because he was “handsome.” I think getting the shit kicked out of me was a nicer punishment than the threat of eviction would have been.\n\nOP should have just withheld the allowance, but I still think he’s NTA here. This is the most benign public shaming ever, and the daughter needs to get over herself and realize that everybody except her best friend has already forgotten that picture.\n\nBest friends, in my experience, never forget.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And you would just lose your job. It’s extremely unlikely your boss would publicly humiliate you on social media.",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "While you’re correct, that’s all written in the contract (or painfully obvious) for adults who have a lot of experience in the world. She’s a teenager who may or may not know all that’s implied or the severity of not following these implicit rules. Nevertheless, by offering your children the role of an employee in addition to being a loved family member is not something I agree with, since it can cause confusion to young minds and create rifts, especially if it’s a step parent.",
                  "id": 72,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "But you also get fired or written up and put on probation.",
                  "id": 73,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "this backfired on my mom, \"1$ if I clean up my entire room, OK mom here's 1.50$ if you clean up my room\"\n\nnow try explaining a 6 year old why his time is less valuable than yours",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You really have no idea what you’re talking about at all.\n\nHave you ever had a job?",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 544,
          "content": "That's not how chores and allowance usually work though.  The allowance is a reward for doing your chores but chores are REQUIRED, not voluntary.  You can still get your allowance taken away even if you do your chores (such as for atrocious behavior).",
          "id": 76,
          "comments": [
            {
              "score": 318,
              "content": "If teenage me had told my dad I was going to stop doing my chores in exchange for zero allowance, he would have told me it's fine if I don't want allowance any more but I'm still doing my chores.",
              "id": 77,
              "comments": [
                {
                  "score": 78,
                  "content": "Yeah. Hell, sometimes my dad didn't pay me for my chores on the basis of him having to ask me too many times. Got to the point that if i didn't get them done by the same time every week i didn't get anything. Seems fair now. Didn't then.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Growing up poor just makes this all seem really weird, we had to do \"chores\" like washing our clothes and ironing them and making dinner when our mum was at work and we in no way got paid for any of that. If we didn't do that stuff we'd have been going to school in gross clothes or wouldn't get dinner, seems way more effective than not getting money.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 130,
              "content": "Yeah, my brother hasn’t gotten allowance in a few months because he’s had really awful behavior lately. (Making my mom late for work, screaming at her, hitting me while I’m driving, etc.) Even then she still expects his chores to be done. They usually aren’t so she also has to add additional consequences.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "But that’s not what OP and his daughter had agreed on.\n\n>3 big chores that we pay her allowance for\n\nI read that in a transactional sense - doesn’t matter if it’s not how chores and allowance usually work.",
              "id": 81,
              "comments": [
                {
                  "score": 8,
                  "content": "> I read that in a transactional sense\n\nYes, that's why reading comprehension requires some common sense. Chores aren't an ordinary work relationship and there's usually an obligation involved to do them.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 253,
          "content": "It aint a business with employees and a W-2. you live in the house, you do the chores, and maybe you get some money at the end of the week if you're lucky.",
          "id": 83,
          "comments": [
            {
              "score": 105,
              "content": "[deleted]",
              "id": 84,
              "comments": [
                {
                  "score": 9,
                  "content": "Definitely teenagers.",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 192,
          "content": "No way. Chores may get you an allowance, but they are mandatory, not optional.",
          "id": 86,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "An allowance is contingent on doing chores when parents request it to be done, not when the child wants to do it. An extra \"punishment\" was warranted in this case.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Just because she didn’t do her job doesn’t mean there shouldn’t be punishment due to the agreement. If you no can no show for a shift, you get the benefit of the doubt the first time and a chance to explain yourself. You also don’t get paid. You make a habit of it you still don’t get paid and you get fired. Just because there is an agreed upon transaction doesn’t mean there aren’t penalties when you fail to meet your responsibilities.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "If you don't show up for your job, then the consequences are greater then simply missing a single paycheck.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I read in a study that the best way to discipline your child is to take away something to do with the problem. If they are hitting someone with a toy then you take away the toy as a punishment. The smart thing to do here would be to cut the allowance, not to humiliate her through social media, because it has nothing to do with the chores",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Im more concerned over the breach of privacy of accessing her phone to send snaps to her friends.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4963,
      "content": "I'll go with NAH, but there are a few things you and your wife can be doing better:\n\n1) As a new stepdad, let your wife be the one to handle consequences for now. You can tell her your idea and let her be the one to deliver the message. I don't mean forever, just until y'all gel more as a family.\n\n2) Both of you need to make your expectations clear the *first* time you ask for something. My own dad used to drive me crazy with this. He'd ask for something non-urgent to be done, and I'd agree, knowing I'd do it in X hours or whatever. Then he'd get mad that it hadn't been done right when he'd asked, even though it wasn't clear that was important. He wasn't consistent, either, so it was deeply aggravating. Giving her a reason it needs to be done within that timeframe will also help.\n\nTl;dr version: next time it's time for her to do a chore, the reminder/request should be: \"I'm filling the dishwasher in ten minutes, so I need you to empty it now.\" Or whatever.\n\nEdit: I forgot about the allowance part! I don't hate the social media thing, but if her allowance is contingent on her doing the chores, you already have consequences in place and the Snapchat thing made you a little bit TA.  If withholding the money isn't enough to get her to do her chores, though, cancel the allowance and continue to embarrass her until she shapes the fuck up.",
      "id": 92,
      "comments": [
        {
          "score": 884,
          "content": "I agree with your first point, but not as much with the second. \n\nI was always taught in my house, that if a parent asks you to do something, you do it then. Or within the next few minutes. They’re asking cause they want it done now, not in three hours.",
          "id": 93,
          "comments": [
            {
              "score": 910,
              "content": "That's a perfectly fine expectation, but the point is that the expectation was set. \n\nFor things like *load the dishwasher*, that is really clearly time dependent and interdependent on other chores. I can't unload the dishwasher until you load it, and you might want to wait to load the dishwasher until I finish cooking dinner. I might need you to start loading the dishwasher so I can wash the vegetables and clean as I cook. A 16 year old should be able to identify these dependencies and plan accordingly. \n\nBut I don't think it's asking too much to explain a non-apparent reason for wanting a chore done immediately instead of later. A lot of the time a parent will want something done *now* so they don't have to think about it and check up on it later. And that's perfectly fair, but I still think that should be communicated to the kid. If it is, that helps the kid get a better understanding of the mental load of managing a household. Then \"because having to keep track of everything and remembering to do it later is a lot of effort\" is a compelling answer. \n\nOther times, there's a more specific (and to a teenager, more compelling) reason. A parent might want their kid to wash his soccer uniform now instead of tomorrow or later this evening because they're planning to launder all the bedding and that will take 5 or 6 loads of laundry, which would not be readily apparent to the kid. Telling him why is a lot easier than fighting him on \"because I said so\", and it would teach the kid how to prioritize and order tasks in a logical fashion. \n\nThere's room for lots of different approaches, but I'm always in favor of explaining reasoning and clearly setting out expectations, especially if the kid is asking why and is old enough to understand the answer.",
              "id": 94,
              "comments": [
                {
                  "score": 374,
                  "content": "I also agree with being clear about urgency and  making it clear what exactly you want form them. For me the biggest mind fuck was apparently needed to read my mom's mind on when she wanted me to go above and beyond and when she wanted me to just do what she asked.\n\nWash the dishes? Ok done...10 minutes later she's upset because i didn't also clean the connecting counter nor did i sweep and mop the kitchen. \n\nNext week: wash dishes, ok. Half way through cleaning the counter She's upset because apparently she's been waiting for me to be done so she could make lunch/dinner and she only asked me to wash the dishes, nothing else.\n\nSame thing when it would come to getting dressed for my grandmas. Anytime i took longer than her to get dressed (even when she was already dressed when she would tell us) she would get mad and say \"it's just your grandma's you can go in pajamas if you wanted to\". But the one time i wore a faded shirt with shorts and didn't put on makeup or do my hair it turns out it was a party at my grandmas so every one was fancy and I looked like trash. She shouted at me in the car about how i should have known to always dress nice for my grandma's.\n\nI was so distraught that i had my dad take me home to get dressed better. She later got mad at me for leaving and said i should have just stayed.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 168,
                      "content": "Eh, in your case I'd say it's quite possible your Mom was looking for reasons to be annoyed, and it wouldn't have mattered WHAT you did.  Constantly changing the rules purely so that they can then get mad at you is a common tactic for certain types of people :-( \n\nI hope you don't have to put up with this sort of treatment any more :-)",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "your moms behavior was very unreasonable.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Oh yeah I've had that one before.\n\nOr it's like you don't something you get yelled at, and then when you do it next time you get a condasending 'why can't you always do that/is that so hard' etc",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Holy shit are we siblings cuz this sounds like shit my mom would pull",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 135,
                  "content": "my mom used to freak out every time i asked why she wanted me to do a particular task; i always did it with no issue, but i was just curious cuz sometimes it would be random stuff like “move this piece of furniture over here”. but her freaking out and pulling out the “because i told you so” every time just kinda made me... not take her seriously after a while? like there was no sense of urgency or importance because i never understood why i was doing the random bullshit she was asking me to do, which also meant i didn’t do it as thoroughly/meticulously as i usually would if i had a reason for doing the task. i think kids can always use a “why” behind what you’re telling them to do, even if it’s not a reason that’s particularly relevant to them any reason is better than no reason.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 82,
                  "content": "I personally really like this and I would appreciate it so much if my own parents did this. Getting yelled at and being told \"I say so\" is extremely annoying and it's rubbing off on me. I have to constantly remind myself not to pick up my parents bad habits when I'm babysitting my younger brother and remind myself to explain to him why I want something done now or why this thing has to be done and to not yell at him as much as my parents yell at us.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 34,
                      "content": "It's hard to break the habit. One of my parents was of the \"read my mind and do what I say without me explaining why\" mindset, and the other took great efforts to explain everything and anything I asked or was asked of me. Beyond just the obvious difference in relationships I have with either as a result, i feel one prepared me much better for adulthood on the subjects and habits I learned from them than the other did.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Honestly as a parent its way easier to just say \"I said so\" instead of explaining my reasoning. I still almost always explain my reasoning though so that when I have a \"because I said so\" moment theyre more likely to understand I do have a reason even if I'm not divulging it right that second. Sometimes I just may not have the energy to explain to a 5 year old why i have certain rules.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "But op said \"please do them so i can do mine\", that reason seems pretty apparent to me. It's less verbose than what you suggested, but it should be enough to get the point across.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 52,
                      "content": "I was responding directly to the commenter above, not really to the situation in the original post. \n\nI'm kind of in a NAH/ESH camp for the situation. Teenagers suck by default, and the way OP went about things sucked a bit, but everything is so mild here that it's almost just a low-level classic clash of parents and teens. \n\nThe way to punish her in my opinion is to withhold allowance since they pay her to do those three chores, not mildly embarrass her publicly. No work = no cash. Adding to that the fact OP is a step parent that (based on a single comment from the post) doesn't seem to have been married to her mom for a long time, I would have left this to her mom or withheld allowance.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "You said it all better than I could!",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Some things I think people forget is that while adults plan their day (ok, so first do grocery shopping, then we have dinner, then laundry, then we can relax, we can do the vacuuming tomorrow), so do teenagers. What I always hated as a teenager was the fact that a chore would randomly appear out of nowhere when I had other things planned, or had set aside some time to do fuck all because I was tired.\n\nSo when a parent gives a chore and a deadline (\"I need you to empty the dishwasher now, because I need to fill it, so I can relax later, because I am tired after work\") they generally never take into account what the teenager has planned. Maybe they had a shitty day at school and just need an hour to decompress before they get to it. Maybe they planned \"ok, I can clean my room tomorrow, because I really want to watch the latest Rick and Morty so I can talk about it tomorrow with my friends\". Etc. Etc. \n\nI mean, I'm an adult, and sometimes I put off things to the next day because I'm just too tired or unmotivated to do it today. Kids want to do that too. \n\nThis of course doesn't mean that you should never have a teenager do a chore immediately. It just means that both parent and kid need to talk to each other and have clear expectations. Sometimes the kid has to face it and just do the chore, and sometimes the parent has to accept that maybe they can do it later because it really doesn't need to be done on the parents schedule.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "Once, my mom said “do what I say when I say it!” \n\nSo I said “but you told me not to jump off a bridge just because someone tells me to?” (In reference to the your friends doing something or telling you to so you do it) \n\n>***Narrator: things did not go well for KinkyGCM that day***",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "Different kids have different needs and work best with different structures, it's about finding what approach works best for the kid and the family unit as a whole. As an example kids with ADHD can have difficulty with just dropping what they're doing to do a chore right then and there, their brains can't just easily \"switch gears\" like that, and they also don't do well with the vague instruction \"get x done today\", so it's often best to clearly spell out \"please empty the dishwasher in 10 minutes so that I can load it\" (i don't know if OPs kid has ADHD, it's just an example). I agree with the above commenter that having more clear outlines and time frames can't hurt to try",
              "id": 109,
              "comments": [
                {
                  "score": 49,
                  "content": "I had that problem so much as a kid, if I was told to do something I *had* to finish whatever I was currently doing first. I actually didn't know that was an ADHD thing. The consequences of that in my family were... not good.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Wow, this helps to explain so much of my childhood angst around “right now” parental demands. Never connected it with ADHD.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 6,
                      "content": "This is why parents are supposed to get counselling too when a kid is diagnosed with ADHD. They can teach their kid how to reframe demands so they can get stuff done while reframing their own expectations. \"Clear out the dishwasher\" wouldn't work for an ADHD kid unless it at a fixed time/place. Otherwise it would get way too stressful",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "While I'm fairly sure I have ADHD, I did not think about/know that consequence in a strict relationship with a parent, interesting, thank you!\n\nI think that would certainly explain a lot my childhood anxieties. Never feeling like I could commit to a task or activity because it could easily get disrupted. So many long walks alone in the woods for quiet. It's amazing how much our brains respond to being outdoors, and I feel fortunate for having been able to explore those spaces.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "I just want to make the point that once a kid is sixteen, they often naturally start to QUESTION “I’m an adult, do as I say”. Because that’s not actually logical, and this is the age where the child is able to recognise that it’s not logical. When I was that age I was picking that logic apart and going “but that’s not a real reason. WHY should I do X? Give me an actual reason”.\nIt’s a normal part of growing up and becoming independent- you start to realise that you DON’T have to do what an adult says just because they’re an adult. So this is the wrong time to be trying to instil that logic in her. If she didn’t already have that set up, it’s not going to work now.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Generally I'll agree. But my mother would usually ask me to do something then ask why tf I was doing it right then. It was infuriating but also hilarious.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The fact that you don't see the contradiction is hilarious\n\nThe person you replied to said to set time frame expections\n\nThen you say that you disagree, because you're parents taught you that they expected it right away \n\nUh... Thats called setting time frame expectations",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "It could be different upbringings. In my family unless someone asks someone to do x by y minutes it’ll get done whenever they feel like it. Setting a time just gets everyone on the same page",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Idk I’ve definitely had times where a task was not urgent at all and my mom was just telling me to do it at that moment as a reminder (before she herself forgot). In those cases doing it now would only have been required if I was the type to put it off and then never end up doing it. But if I was legit just going to do it at 8pm instead of 6pm, that wouldn’t have been a problem.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Honestly, my parents did a shit job of teaching that and 80% of our fights while I was growing up were for the exact point made in this thread. Parents don't always communicate very well and get angry easily",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "My dad would say something like, \"Could you do the dishes when you get a chance?\" when I was in the middle of something else, and I'd say yes, fully intending to do them when I finished the first thing. But then he'd be mad that I didn't drop what I was doing to get to the dishes. :-/",
          "id": 120,
          "comments": [
            {
              "score": 34,
              "content": "Right, exactly!",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "I agree about the allowance thing.\n\nIt's one of those things that always seemed weird to me - getting an allowance for doing chores, like you're a really poorly paid (or well paid, I guess) employee of your parents. \n\nMy parents gave us an allowance and expected us to do chores. Those were separate things - the chores were expected because it's part of being in a family.\n\nAnd then... the OP shows that actually all this \"you do chores to get your allowance! I'm paying you to do things!\" is just a lot of hot-air (at least in his family) and the real reason to do chores is \"because I said so.\"\n\nWhich is actually something I can relate to, but maybe he should just be clear about it and stop acting like there is no possible response to the daughter not doing chores.",
          "id": 122,
          "comments": [
            {
              "score": 31,
              "content": "Yeah, actually a lot of parenting advice I see these days says not to tie allowance to chores. Chores aren't optional -- you can't decide not to do them just because you don't care about your allowance that week. Chores are a thing everyone in the household does because it's part of living with other people (I'd say it's part of being a family, but you'll still have chores if you live with roommates -- heck, you'll still have chores if you live alone. Maybe just \"it's part of life.\")\n\nKids are best prepared for life if they get in the habit of doing a wide variety of chores consistently from a young age. Tying in external motivators like money (which you won't have for doing chores as an adult!) will only make it harder to adjust to doing these chores when she's on her own.",
              "id": 123,
              "comments": [
                {
                  "score": 9,
                  "content": "I agree. While giving an allowance *is* nice, if an allowance is all you're using as a method to get them to do chores and to take care of responsibilities without further explanation then you're just teaching them to expect a reward or compensation for doing what you're supposed to do, which is not reflective of the real world. Everyone's got bits of pieces they need to take care of to keep an organized, running and efficient household, and as a member of the family, you should be taught to do it because you *should* contribute to helping your family out (just as everyone else needs to pitch in, whether cooking meals as adults, or just taking out the trash as a kid) and not just because you get $5 for after completing it.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": ">Both of you need to make your expectations clear the   \n>  \n>first  \n>  \n> time you ask for something. My own dad used to drive me crazy with this. He'd ask for something non-urgent to be done, and I'd agree, knowing I'd do it in X hours or whatever. Then he'd get mad that it hadn't been done right when he'd asked, even though it wasn't clear that was important. He wasn't consistent, either, so it was deeply aggravating. Giving her a reason it needs to be done within that timeframe will also help.\n\nOh my parents do that one all the time\n\n'Do the thing'\n\n'Ok'\n\n'DO THE THING WHY ARE YOU NOT MAGICALLY DOING IT RIGHT NOW WHY CAN'T YOU INSTANTLY DO THINGS!'",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "I disagree with both personally but understand where you are coming from. \n\n1) my dad and step mom adopted that same idea with my stepsister of that he shouldn't step in for a while in terms of punishments or similar. It quickly turned into a situation of my step sister never respecting him and it's only gotten worse and I strongly feel if he was able to step in an it at times, it would have helped with the respect. Now shes committed to not respecting and nothing he does works anymore. \n\n2) I was raised that if my parent asks me to do something I do it right away and if I cannot for any reason, I explain why and when I will do it instead. If I did something like this where I said \"ok\" and walked off, I'd have about 2 min before my dad realized what happened and then immediately whooped me. Lol.",
          "id": 126,
          "comments": [
            {
              "score": 55,
              "content": "Fair enough to 1, but if 2 is the situation in their house, they'd better make sure that's also clear to the kid -- and I'd argue they should really still have a reason for it, even if that reason is \"we clearly can't trust you to do it otherwise.\" \n\nMost people, but especially kids, respond better to logic and reason than to rules for the sake of rules. You can say they should learn to respect their parents and take directions and such, and that's fine, but at the end of the day one approach is more likely to yield results than the other.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I feel like it depends on the kid really. For me, there were certain things I knew had to be done right away when asked and there were other things that no one was able to convince me were time sensitive at all.\n\nFor me, doing the dishes could be done after I finish my laundry or eat my sandwich or worked out at the gym. Vacuuming the living room could be done at any point during the week as long as guests are coming over. I learnt to manage my time by putting the things that we are time sensitive in my life first and then handling the generic cleaning up when I had time to do them.",
              "id": 128,
              "comments": [
                {
                  "score": 9,
                  "content": "It feels like making the kid do both the loading and unloading would be a smarter way to go here. More work, but she can do it all on her own time within reason. As someone who hates being interrupted I would hate having a chore that basically requires me to be “on-call” all the time like it seems step-daughter is, however simple and quick the task is.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Same with me. I would have a schedule I followed of clubs then homework then make myself food most days of the week. So having someone demanding I be on their schedule is annoying.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Re point 1: my ex-stepsisters were the same. They eventually realised they could scream and cuss at my dad, and later just anyone on my side of the family, and just get away with it.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "But... He did tell her to do it now, and for the reason that he can then refill it",
          "id": 132,
          "comments": [
            {
              "score": 16,
              "content": "Yes, the second time, and then she was like \"whatever\" so he threatened her and kind of escalated things. I probably could have also gone ESH, come to think of it. Anyway, my point was, I think they'd have more success making everything clear the *first* time. Maybe she'd still be a bratty teenager, or maybe shit would get done.",
              "id": 133,
              "comments": [
                {
                  "score": 13,
                  "content": "I agree he should have been more clear about doing them right then, but the second time he asked, she should have done it. I was that bratty teenager really not too long ago, so believe me I know both sides of this, but she should have just emptied the damn dishwasher.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh, sure. I've never argued that she shouldn't have done it the second time -- just that there probably would have been more success if the expectations were laid out the first time.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "An allowance is supposed to be a reward for doing chores, not a basic requirement. In my house, chores are done whether payment is given or not. Don't do chores, there's punishment plus the allowance money goes. Allowance is always extra.",
          "id": 136,
          "comments": [
            {
              "score": 5,
              "content": "Yes, this.\n\nI avoided addressing OP's \"payment\" comment.\n\nAllowance is a PRIVILEGE you earn for doing what you are supposed to do.  \n\nChores are things you have to do no matter what because you are learning how to take care of your household and how to live with other people.\n\nWhen you pay your kid to do something, you're just bribing them and it enforces the idea that they aren't obligated to follow your rules unless they get something out of you.",
              "id": 137,
              "comments": [
                {
                  "score": 4,
                  "content": "If allowance is a privilege that is earned by doing what you're supposed to do (chores), then you are literally paying them to do the chores.\n\nEither allowance is guaranteed and separate from any expectations of reciprocation, or it is payment for whatever it is you're expecting in return.\n\nI personally believe allowance is a crucial tool for kids to learn how to handle money, and that it should not be dependent upon work done - as then it becomes a bartering situation. The kid may decide that the chores aren't worth the money and just not do them, or claim they don't have to help out at home after they get their first job.\n\nExternal rewards have been proven to decrease internal motivation. Don't pay your kid for things you're expecting them to do anyway.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "It isn’t a chore if she’s being given an allowance to do so. She fails to pull her weight, payment is refused. No reason to take it further. Be the adult, handle the situation, and be firm about why she has less spending money.\n\nThe extra shaming is gratuitous punishment and AH behavior.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3330,
      "content": "YTA... You need to find a way to motivate your daughter that doesn't involve invading her privacy, and humiliating her in front of her peer group.",
      "id": 140,
      "comments": [
        {
          "score": 1333,
          "content": "This is the kind of thing that makes kids stop talking to thier parents when they move out",
          "id": 141,
          "comments": [
            {
              "score": 715,
              "content": "Not even parent, he's a STEP parent. Jesus Christ.",
              "id": 142,
              "comments": [
                {
                  "score": 114,
                  "content": "Depending on the type of relationship you have, the \"step\" part can be irrelevant. Reading the post, it sounds to me like OP clearly has a parental role in her life. Children and teenagers will just grab anything they can in order to undermine the authority of the parental figures, including one of their parents technically being a step parent. If OP had OCD instead of being a step parent, the OCD would somehow find its way into a reason to not have authority.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 274,
                      "content": "He even said he’s new to this parenting thing in his edit on this post. That leads me to believe she doesn’t have a strong enough relationship with him to be doing this kind of thing. Guaranteed she’s already acting out because she’s a pissed off teenager about the step dad situation, and this is not a good way to bond with your stepchild.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My Dad used to embarrass me in front of my friends all the time. Not specifically like this but plenty of other ways like blowing kisses to me at the school gate in front of the whole school. We laugh about it now, he's a great guy and was a great parent.\n\nPersonally I think the punishment is funny, but I can understand the violation of privacy argument. What I don't agree with is that this sort of behaviour is worth severing a relationship over. If the relationship ends because of this that's on the teenager, not the parent.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 579,
          "content": "Agreed. Hasn’t there been like, study after study about how using embarrassment as a punishment is counterproductive and harmful? And yet everyone still starts salivating and rubbing their dicks to these kinds of stories, “*Oh yeah* that’ll show her!”",
          "id": 146,
          "comments": [
            {
              "score": 325,
              "content": "All the “NTA” comments are making me kind of mad. Like no, public humiliation is not an okay punishment - for the most we don’t even allow that to happen to actual criminals, and you’re doing it to a teenager??\n\nI think it’s because it’s a gotcha at teens and technology - I know people on this sub are always accusing people of being teenagers because they disagree with them (which like, can we not by the way? Not everyone with a different opinion is younger or somehow inferior to you). But this sub can be pretty harsh on kids for doing normal kid things - especially when technology is involved in any way. Oh your kid was a little bratty once so you’re taking away the computer forever? Of course that’s fine, kids don’t *need* which means it’s okay to do whatever you want as a punishment involving that, and anyone who says otherwise is 12.",
              "id": 147,
              "comments": [
                {
                  "score": 220,
                  "content": "It's because no one wants to bother to actually consider the perspective of the other side.  If this post was written by the teen hurt and angry that they were publicly humiliated over some chores they'd be told to cut contact and sent to that parent/narcissist sub faster than lightning.\n\nNotice how the only way to justify this is to say its \"hilarious\" and that she'll get over it.  Essentially to say that her feelings and her whole world is trivial, it's okay to sabotage it.  Why would she respect OP when it is so clear he doesn't respect her.  Punishments are fine but they shouldn't degrade the person.  \n\nThis was an immensely foolish punishment for any parent.  But for a new stepparent of a teenager.  Rough waters ahead is my guess.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 14,
                      "content": "And she may not get over it until shes out of school. Internet makes it so the embarrassing things your parents do to you on social media last indefinitely. This could hypothetically become a meme and ruin her confidence and social life. Does it seem insignificant and stupid? Yes, to an adult. To a teen that just got her nose rubbed in the proverbial piss in front of her friends it's kinda mortifying.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "Plus to me it would be way different if he knew WHO he was sending it to. Still AH move, but I feel like I'd let it slide more if it was her close friends. Sending it to entire school, major AH move. And if you didnt know you were sending it like that, then you shouldnt be on it",
                  "id": 150,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Yeah, if my dad did this when I was a teenager to like, my best friend that he knew well, I would have been embarrassed but it would have been something I could laugh at now and that she would have thought it was funny. \n\nBut sending it to everyone? No.\n\nEdit: also is no one going to talk about how this girl has two of the worst chores in the house? Picking up dog poop and taking out the garbage?",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Cause social media bad!\n\nLike would people think it was hilarious if he made her wear a shirt to school with the same message? Or if this was the 80s and he took her phone book and rang every one of her friends to tell them he was mad at her?\n\nBut it's  sOcIaL mEdIa so the *new* old man in this girl's life is simply hilarious for humiliating her! Silly teen thinking she has a right to have feelings.",
                  "id": 152,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "A lot of the NTA comments seem to be pretty much fueled by thinking teenage girls taking social media seriously is stupid. We all have trivial things we take seriously. Other people not understanding why they are important to us doesn't make our feelings about them less valid.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 273,
              "content": "This! As inconsequential as it may seem to a parent to poke fun at their kids, kids just don’t see it that way and their emotions sure don’t either. \n\nFor example, when I was in elementary school, my Dad was visiting my school, and I told him something he was doing was embarrassing me. I don’t remember what. I do remember he responded by dancing around and embarrassing me more. As an adult, I totally get why that was funny and lighthearted to him. But kid me took mental note to never tell my Dad when I felt embarrassed (or similar emotions like shame or regret) again because he already had shown me I wouldn’t be taken seriously.\n\nNow, I’m in my early twenties. I keep in touch with my parents, and I love them. But they don’t know shit about my personal life, and when I do feel that they should know something, it is always very difficult for me to work up the courage to tell them. Obviously, this isn’t just because of one Dad dance, but other similar reactions to different life events — big and small — that ultimately led me to conclude that personal life and parents are not things that mix. \n\nOP, I can’t tell you how to parent your step daughter, but try asking yourself what kind of relationship you want with her as she grows up and becomes an adult. Then figure out what approach is the best way get to that place.",
              "id": 154,
              "comments": [
                {
                  "score": 11,
                  "content": "Are you me?",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "This! I know to OP “some boys she liked” seeing it is probably funny but that’s totally dismissing that this is her life and her world right now. I would die if someone sent something embarrassing out to my alumni peers or my coworkers and I think most adults would understand why. The thing is, those people are just as important to her right now as an adults higher standing coworkers. Being a teenager is fucking hell, high school is a nasty place. You couldn’t pay me enough to spend a day in my teen selfs shoes. Parents should never make this harder on their kids, it’s such a fragile time.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "[https://www.psychologytoday.com/us/blog/peaceful-parents-happy-kids/201405/why-punishment-doesnt-teach-your-child-accountability](https://www.psychologytoday.com/us/blog/peaceful-parents-happy-kids/201405/why-punishment-doesnt-teach-your-child-accountability)",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I had a classmate in high school whose dad used \"punishments\" like this. She got relentlessly made fun of for MONTHS after the fact, and lost several close friendships because of it. I'm sure her dad thought he was being funny and creative, but his actions had lasting negative effects on her social life that couldn't be fixed even if she changed her behavior.\n\nThe way I see it, there are two most likely outcomes here. Either her friends won't care and it will blow over quickly--in which case, it's not really much of a punishment, so why bother?--or they WILL care and it will blow up into a huge issue beyond the scope of whatever the original problem was. Not great either way.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 400,
          "content": "Agreed. It's easy to look at teen drama and dismiss it as trivial but you don't know what kind of dynamics exist at her school. I went to a middle school where the bullying was insane. I'm now early 20s and most of the girls I went to school with there still have eating disorders because of the bullying that started then. It might be silly but kids can be really mean and by doing this your essentially having her peers punish her for you.",
          "id": 159,
          "comments": [
            {
              "score": 132,
              "content": ">It's easy to look at teen drama and dismiss it as trivial \n\nAlso...  Looking at your teenagers whole world as trivial and a joke is a terrible way to build a relationship.  Dismissing her feelings as \"teen drama\" just alienates her.  She can see he doesn't respect her, her feelings or what is important in her life... and that begs the question why she should respect OP.\n\nOP is playing with fire by publicly humiliating his new step daughter.   If she is rude or refuses to do chores absolutely punish her... but it should be the mom doing it and it should be in a private constructive way.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "EXACTLY! Even though I've only been out of high school for about 4yrs, it can be hard to understand just how different social lives are. It can feel deathly stifling if your social groups are messed with because you generally have no social groups outside of school. As an adult you have free-er access to the internet, social groups, old friends from school or college or work, and friends from wherever. But for kids...they literally only have the people they've been forced to interact with since elementary. Screw with that and it can have way larger effects than it might for an adult.",
              "id": 161,
              "comments": [
                {
                  "score": 19,
                  "content": "Also you're stuck with these people until you're done. As an adult if I have an issue with someone, I can leave the group/find new job/etc. In high school yeah you can maybe find new friends but still in class with these people. I was surprised how many \"friends\" I almost instantly lost once we werent in school together and constantly forced to be with each other. Nothing dramatic happened, just suddenly realized how many of them were \"school friends\" and without spending 5 days a week with them we quickly drifted apart",
                  "id": 162,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yeah, looking back I wondered why I was so dramatic about a friend being shitty or having someone humiliate me. Realized once I was in college that as an adult you can just...distance those people. It's easy to say that high schoolers need to realize that there's a bigger world out there, but they've spent their entire lives until then under the control of their parents and within a single, largely unchanging social group.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Right? Someone compared this to sending something embarrassing to an adult's coworkers, and someone responded that it was different because coworkers are just strangers you're forced to interact with. Like huh? What else is high school but a group of strangers you're forced to be around for years and years and years with few viable outs ever.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Teenagers can be absolutely brutal. Empathy develops at very different ages. Most teenagers figure out by year 9 that must of the punishment at schools invole bluffing so they see that as being free to do what they want. It's essentially a group of sociopaths with little oversight mixed with vulnerable and emotional kids. Survival (or lack thereof) of the fittest.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I am in my late thirties and still messed up in ways no one really sees from the shit I dealt with in school. To have my parents facilitate and encourage that bullying would have been brutal.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "I think what gets me is social media/the internet has changed things so much, I feel like adults can't really gauge how much damage something like this will do. I'm 29. I got Facebook when I was 16, but social media didn't have near the consequences it does now. I just can't even understand all the normal teenage pressure on top of the pressure that comes from your online presence. So maybe this won't cause any lasting harm and she'll learn to do her chores. Maybe she's being bullied and this will exacerbate it. Not worth the risk, in my opinion.",
          "id": 167,
          "comments": [
            {
              "score": 5,
              "content": "I am so eternally lucky that social media and cameras were around when we did stupid shit in our teens.. Born in 84 and just barely avoided the \"all your stupid shit is on the internet forever\" trap.",
              "id": 168,
              "comments": [
                {
                  "score": 2,
                  "content": "Right? I still get facebook memories from 7 years ago that are so cringeworthy. Not like offensive, but just yuck. To have that be immortalized by everyone else would be horrifying.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Yeah why the *hell* is the top answer in this thread NTA, by far? This is mean-spirited and unhealthy parenting. Great way to create a garbage relationship with your new step-daughter.",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Yeah, speaking from experience, people stop texting you if they know your parents have access to/read your messages. This isn’t a good punishment.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2832,
      "content": "YTA\n\nThe embarrassment angle is unhealthy and unsustainable.\n\nMake a scoreboard for every day and every chore, mark off which chores were done and which were not. Pay allowance only for completed chores.\n\nNo work, no money. That's a better lesson than an immature social power game that degrades trust on both sides.",
      "id": 172,
      "comments": [
        {
          "score": 1497,
          "content": "One of the first things I learned as a teacher was to never embarrass students as a punishment. It may work, but it makes them hate you.",
          "id": 173,
          "comments": [
            {
              "score": 434,
              "content": "Agreed. I’m also a teacher and we got taught that punishments should have some kind of logic. Don’t finish your HW? Do it in detention. Waste class time? Stay late for the same amount of time. I don’t understand why OP didn’t just dock her allowance.",
              "id": 174,
              "comments": [
                {
                  "score": 344,
                  "content": "Because he, like many out of touch and insensitive parents, thought it would be funny to do what he did. \n\nYou arent really supposed to enjoy disciplining a kid. It's just part of the job.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 8,
                      "content": "That's a good way to think of it.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I work with kids too, and I hardly ever even use the word \"punishment\" because \"consequence\" makes more sense to me. In my view, a punishment is arbitrary, while a consequence is related to the incident in some way and focused toward solving or teaching about the problem. In adult life, there aren't many punishments, but there are tons of natural consequences for making bad choices.\n\nWhat the OP did in this case was a punishment. A consequence would have been docking her allowance, taking away her phone since it was distracting her from her chores, telling her she can't do fun things until her chores are completed, etc.",
                  "id": 177,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Fellow teacher, also vastly prefer the term \"consequences.\"",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 258,
              "content": ">it makes them hate you.\n\nWhich is honestly fair.  \n\nThe only way OP (and people in this thread) can justify embarrassing her is that it is \"hilarious\" or \"a joke\".  It's not a joke to the daughter obviously, it's her whole world and she is very angry and upset about it.  Turning that into a joke just says that her feelings and her world isn't worthy of respect to OP.  And that begs the obvious question - if OP doesn't respect her why should she respect him?  This tactic might get obedience but it will never get respect... and it certainly won't get a healthy, functional relationship.  OP is playing with fire here.",
              "id": 179,
              "comments": [
                {
                  "score": 8,
                  "content": "Not only that it will get the bare minimum. I had a boss like this and I would only do what he asked nothing more, even if I found a problem along the way I wouldn't fix it.\n\nUsing the dishes as an example. Daughter is tasked with putting the dishes away. We adults know that sometimes the dishes don't get 100% clean in the dishwasher and need to be cleaned again. Well since her job is to put dishes away now she will do only that. If food is still stuck to the dishes they are going into the cabinet.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 6,
                      "content": "This. \"You'll punish me for doing x so I'll do every shitty thing I can without doing x because fuck you.\"",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I had a teacher who did this, and took an odd sort of pride in it. She'd post everyone's grade on the wall of the classroom where everybody could see it and know who was failing. One time I made a very silly mistake on an in-class exercise (a genuine mistake on my part that had no bearing on the end result of what we were doing) and she showed it to the whole class and ENCOURAGED them to give me a bad time about it. I was already getting bullied a lot that year, which made it especially hurtful. This happened about 13 years ago and I'm still angry about it.  \n\n\nHer attitude was that if you don't want to be publicly shamed, don't mess up. But the fact is, kids DO mess up. Kind of a lot sometimes. Are we really going to purposely embarrass them over a completely normal part of learning and growing up?",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Works for some things.\n\nI'm still dealing with the fallout of 5 year period of elementary school at the age of 35.\n\nI did helicopter crash training, a 4 day course for offshore work.. the kind where they strap you into a metal shell, dunk you 8 feet under water, rotate the whole thing 180 degrees upside down and you get to try to get the hell out of there...\n\nAnd the thing that scared me the most about the whole 4 days was the 4 hour classroom part where we might be called on to answer a question.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "Absolutely. Kids whose parents interfere with their social lives get great at hiding information from parents. Dad's gonna go through your Snapchat? Time to use Reddit more. Parents are reading your texts? Delete them right after. Trust is very very easy to lose.",
          "id": 184,
          "comments": [
            {
              "score": 27,
              "content": "Yes. This. YTA",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "YES, THIS ^",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Terrible idea regarding the chores and money. It becomes \"oh I can skip chores today, that just a few dollars.\" When daycares started implementing fines for people late to pick up their kids, *more* parents were late since they no longer felt embarrassed by it but instead saw it as an additional service.",
          "id": 187,
          "comments": [
            {
              "score": 76,
              "content": "Eh, so find a better motivator.  Turn off the wifi.  Take away the car.  Lots of options that don't resort to humiliation.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": ">When daycares started implementing fines for people late to pick up their kids, *more* parents were late since they no longer felt embarrassed by it but instead saw it as an additional service.\n\nWait, is there a source for that? Thay sounds like bullshit. My daycare and almost every daycare I've been to implements late fines. In fact, mine charges by the minute. Why would parents continue to do it because they're \"no longer embarrassed\"? If you are habitually late, they just kick you out of the daycare. It's expensive enough as it is, and there's usually a wait list of parents waiting to get their kids in, so why waste time on shitty parents?",
              "id": 189,
              "comments": [
                {
                  "score": 9,
                  "content": "> Wait, is there a source for that?\n\n[There is](https://rady.ucsd.edu/faculty/directory/gneezy/pub/docs/fine.pdf). Data was taken from 10 daycare centers and researchers found a \"significant and positive\" relationship between the introduction of the fine and late arrivals. Of course it depends how large the fine is and yadda yadda, but it does serve as a good example of deterrents not working as intended, even if common sense might suggest otherwise.",
                  "id": 190,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Huh, well shit. That's fascinating. Thanks for the source!",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "[Here you go.](http://freakonomics.com/2013/10/23/what-makes-people-do-what-they-do/) A pdf of the full study is linked in there.",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "He could also start \"fining\" her every time she skips her chores. Like, instead of saying she gets $X per week for doing those chores and no money if she doesn't, start saying whoever does the chores gets $X. Either she does them and gets the money, or she's responsible for paying whoever DOES end up having to do them. That would quickly start to add up.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "More like \"no work = no money, no rides for unnecessary things, and shorter curfew\". She's 16, she's old enough to learn the responsibility to help around the house that she lives in. In the real world, if you refuse to go to work, yeah you won't get paid but there will also be other consqueneces if it becomes a habit. She's old enough to learn this lesson, chores shouldn't be optional. I think ESH.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Scoreboards work for toddlers. Teenagers can make the strategic decision not to do certain chores and suck it up when allowance comes time. I did this with my grades throughout university: worth 5% but will take 15hours? I’ll do 5 hours, get 50% (which is a 2.5% addition to my grade , if I start at 0.)\n\nThere’s a study where an elementary school tried to punish parents by charging them a fee for picking their kids up late. Instead, it turned into a transaction because some parents were *more than happy* to pay a fee to have someone watch their children after school, especially if it’s cheaper than a babysitter. Late arrivals increased.",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "I don't disagree about the embarrassment, but dang she's 16 years old, not 5? She doesn't need a damn chore chart, she needs to do what the hell she's told. I'm only 35 - I cannot imagine what would've happened to me as a 16-year-old if my mom or dad told me to do something I flat out declined to do, more than once. Allowance be damned - you don't just get to live somewhere and not contribute in some way, shape or form. These are extremely easy chores, and I feel like allowances are a privilege. I realize that's the deal they made, but this daughter just sounds like an entitled and spoiled teenager.",
          "id": 196,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2307,
      "content": "YTA\n\nDon’t *ever* use humiliation or embarrassment as a form of punishment.\n\n#Ever.",
      "id": 197,
      "comments": [
        {
          "score": 651,
          "content": "Especially a step kid you haven't even raised, holy fuck this guy is an asshole and extremely smug about it too. I'd be fuming if that was my daughter and her step dad pulled some shit like this. That's grounds for an ass beatin\n\nEdit: your wife is an asshole too",
          "id": 198,
          "comments": [
            {
              "score": 137,
              "content": "Idk why you single out the step dad as the asshole, clearly the wife supported it because according to the post BOTH he and the wife were in the selfie. Don't attack OP but leave the wife out of it if she took equal parts in the punishment.",
              "id": 199,
              "comments": [
                {
                  "score": 5,
                  "content": "No you're right, the mom is the asshole too. I should've included that.",
                  "id": 200,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "The are equal parts asshole but they will face way different consequences.  OP's consequences could be life long.  Including barely acknowledging his presence and existence as a human being.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "thank you, my moms husband used to try to do the same to me when facebook was new, i still hate him to this day (for reasons other than the embarrassment, but that still added fuel to the fire)",
              "id": 202,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 231,
          "content": "It's okay though, Reddit hates teenage girls! /s",
          "id": 203,
          "comments": [
            {
              "score": 85,
              "content": "[deleted]",
              "id": 204,
              "comments": [
                {
                  "score": 53,
                  "content": "😬😬😬\n\n\"It's true but you don't have to say it!\"\n\nBut yeah, if this was about a teen boy and/or OP was a step mom I feel like the judgment would be very different.",
                  "id": 205,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 115,
          "content": "EXACTLY. This is how you get your kid to hide their social life from you, which can have much larger reprocussions in the long run.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "[deleted]",
          "id": 207,
          "comments": [
            {
              "score": 15,
              "content": "For some reason every top comment in every thread recently ends up NTA.  The asshole threads are down to once a day and usually involve a transgression to a favored niche.",
              "id": 208,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1549,
      "content": "YTA...just don't pay her rather than invade her privacy and embarrass her.",
      "id": 209,
      "comments": [
        {
          "score": 310,
          "content": "Especially when its q step-parent who admitted he is new to the parenting thing. Not his place.",
          "id": 210,
          "comments": [
            {
              "score": 39,
              "content": "Yeeeeep. Guaranteed, if she doesn't hate him, he's at least indefinitely in the annoying category in her mind.",
              "id": 211,
              "comments": [
                {
                  "score": 2,
                  "content": "Nah it's probably torpedoed at this point.",
                  "id": 212,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "It's also worth noting that OP's daughter's friends didn't sign up to receive her parents' punishment spam and be used as tools to enforce their parental directives. They added OP's daughter to see snaps from her, not her parents hijacking her account. OP is breaking the TOS of Snapchat by spamming possibly hundreds of people with shit they don't care about and didn't solicit. That's wrong even if punishing his daughter is right in isolation.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1241,
      "content": "YTA-making a kid feel humiliated even if it feels silly to you is uncool, it's not gonna cause anything but resent and issues... It disturbs me how many people think this was an okay thing to do",
      "id": 214,
      "comments": [
        {
          "score": 296,
          "content": "I feel like a lot of parents don't personally see the repercussions because kids learn very quickly to hide their digital social lives from parents the minute that space is invaded.",
          "id": 215,
          "comments": [
            {
              "score": 152,
              "content": "Exactly. 6 weeks after I got my first phone, my Mum confronted me and it turns out she had gone through my phone and read every single message on there on all social platforms.\n\nThe next day I changed my password to a 16 digit, randomised password and haven't changed it since. Even though she didn't send anything, her going through my phone without my consent is a violation of privacy. \n\nA parent-child relationship is built on trust, doing this violates their trust, especially socially humiliating them. It can't be expected that they trust you if you do shit like this. \n\nOP is an asshole in denial, riding off the glee of finding something that his step-daughter absolutely hates.",
              "id": 216,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "I'm surprised there wasn't a password to unlock the phone. \n\nThere definitely will be now though.",
              "id": 217,
              "comments": [
                {
                  "score": 30,
                  "content": "Either there wasn't a password or they made her unlock it, neither is great",
                  "id": 218,
                  "comments": [
                    {
                      "score": 60,
                      "content": "My dad would *force* me to unlock it in front of him\n\nI never had anything to hide, I wasn’t a bad child. \n\nBut the invasion of my privacy fucked me up so badly that I out of habit/fear/whatever hide my phone from people. \n\nMy mom had a keystroke logger on my laptop and phone that flagged specific words and sent her alert emails when I used those words. \n\n(1) I was suicidal around the time my grandfather died. My stepfather was abusive and my mom was JUST getting us out. I couldn’t follow through and texted my friend. My mom got the email hours later and started *screaming* at me about how irresponsible I was and how could *I do this to her*.  \n\n(2) I used to write very very very NSFW fanfic as an exploratory teenager girl does when they are in the thralls of multiple fandoms. I could write stories for DAYS. One instance of her just yelling about the *shit* I was writing stopped me from writing ever again. I still struggle to write anything to this day. \n\n(3) I showed her a story I was writing that I think literally was a fucked up fantasy I had from all the trauma I’d endured in my life and she screamed at me and told me “this is what the Westboro Baptist Church would do. What the fuck is wrong with you?!” \n\nNever got therapy until recently. \n\nOP don’t embarrass your step-kid.",
                      "id": 219,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 915,
      "content": "YTA. Public shaming is not appropriate punishment, no matter how well it works.",
      "id": 220,
      "comments": [
        {
          "score": 169,
          "content": "Plus he's now pushing the responsibility of punishment onto her peers, which could be really bad for her mentally and socially. Sure, if she has a good social group like I did in high school, this would be laughed off in a week or two. I'd be embarrassed, but I would get over it since my social circle was small and supportive. Although even typing that out I know that if he sent something like that to certain people I had to associate with (on sports teams and in NHS) I would possibly stop attending because I would never hear the end of it... and not in a fun way. High school social dynamics are hard and if he sent that to everyone she knows that could be really hard for her to deal with and kids can get out of control quickly. Unfortunately this could lead to bullying and ostracizing. YTA, dude.",
          "id": 221,
          "comments": [
            {
              "score": 12,
              "content": "judging by her getting up immediately the next time it happened i highly doubt she has a supportive social group to back her up. thats a fear response.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 613,
      "content": "YTA public embarrassment should never be used as a punishment on a child. There are other better punishments you can come up with that will make her do what you want her to do if you think creatively and intelligently. Instead you resort to sabotaging your daughter's social life and public image? \n\nThis is the type of stuff that makes your child resent you.",
      "id": 223,
      "comments": [],
      "relation": "Attack"
    }
  ]
}