{
  "post content": "My boyfriend (32) and I, (F,30) have been living together for around 3 years. He is going back to college at the end of the month to finish his Masters degree that he never was able to complete before we got together. \n\nI work a really good job that I love and for the most part, have been supporting us anyway, although he does contribute. Maybe like 20-25% of everything. This doesn't bother me at all, I'm happy to pay more as I earn more. Now he's going back to college for a year and won't be earning any money. The only reason he is going back he says, is because I can afford to support us for the year but honestly, I really don't see why I have to. We're not married (don't believe in it) and I really don't want kids, so it's not like eventually i'll have to support a family. I like money and sleep. I'm selfish, so sue me.\n\nAITA for not wanting to support him for a year? I'm pretty certain his parents would love to have him home for a year, but ofcourse at 32 I can understand why he wouldn't want to do that. This is a non-starter conversation for him. He says if he were to move back in with them, that we may as well break up. I wish he would have spoken to me about it before he quit his job otherwise I'd have said that I don't agree with it, would have suggested why not doing it part time so you could still work etc.\n\nI feel like i'm being taken advantage of. I broke up with my ex because I was supporting him 100% and I resented it after a while. It will literally drive me insane knowing that he's not getting up for work, and is running up the utility bills because he's going to be home all day. He'll be in college some days but will be home most of the time working on whatever it is he needs to do.\n\nEdit: so it's pretty equal on whether I am the a-hole or not, but from responses (thank you, whatever you said) I clearly need to clarify a few things.\n\n1. There was only ever a fleeting conversation when we were over at his parents and he said out of the blue, \"I'm thinking of finishing my masters\" his parents were so excited about it, and as it turns out, and they have retired with pretty substantial wealth, and have paid for him to go back to school. I found this out after calling them to voice my concerns. \n\n2. For those picking up on that 'I like money', I've been independent from my direct family since I was 17. I've been poor. REALLY poor. Making soup out tomato ketchup and hot water poor. Everything I have done has been so I can make my life as I want it. I work freelance and I'm really good at it, I'm not going to apologise for that. Also means that I have no back up if something was to happen to me, so my savings are for if/when that happens. \n\n3. My bf and I have had a conversation since I posted about this. I felt it was important. He still stands by if he was to go to his parents that we should break up. What I meant by him moving back to them for the year, that was when someone here said we would see each other when we could. His parents are closer to school and where we are is like 1.5 hours away. He's too proud for that though. \n\n4. Sure, whether he goes or stays my rent will be the same, but I'm not getting that 20-25% from which I've been able to save with my income. \n\n5. His masters is in something to do with English literature, and the job that he just quit, for all I knew he loved it. Now he's quit to do a (in my eyes) pointless masters? No. If it was medical school or engineering or a good job where he NEEDED a masters, I'd probably be more on board with it.\n\n6. He suffers from anxiety, and will only ever do anything he would be able to do. Which means no part time job.\n\n7. If we'd have actually talked and decided on this new path together, I would have no bones about it. But the arrogance and flippant nature of his attitude that I would foot the bill for a year has really upset and angered me. We're committed to each other and he pulls this on me? No.",
  "id": 1,
  "comments": [
    {
      "score": 1850,
      "content": "I'm trending towards NAH. You have every right to set the terms under which you find your relationship acceptable and this may just be a previously-unknown incompatibility.\n\nThat being said, treating the completion of a degree the same as unemployment is a little weird. So is him quitting his job under the assumption you would support him without consulting you first. \n\nI'm definitely not a hard-and-fast advocate for marriage, but I wonder if part of the problem here is a matter of perspective. Not believing in marriage isn't the same as not believing in commitment and it's entirely possible that he sees this as investing in your collective future while you see it as him buying his future on your dime.",
      "id": 2,
      "comments": [
        {
          "score": 669,
          "content": "Most people are capable of going to school and at least holding down a part time job.  If you decide to go back to school and not work at all on the assumption that your partner will support you the whole time without actually discussing it with them, I can see why that could lead to comparisons with a previous unemployed partner.  Making any huge life decisions that will impact your partner without discussing it with your partner make you the asshole.",
          "id": 3,
          "comments": [
            {
              "score": 472,
              "content": "That's the part that stuck in my craw. He should never have assumed she'd support him in his entirely optional unemployment. It's not as if he lost his job unexpectedly. He's acting really entitled about this, just doing what he wants and expecting her to go along with no discussion",
              "id": 4,
              "comments": [
                {
                  "score": 218,
                  "content": "That's the sticking point for me as well. People go back to school all the time, but these two live together, they might not be married but they still need to operate as a team. You can't just say \"I'm quitting my job and going back to school to finish my masters, you'll need to support me financially,\" you say \"I'd like to go back to school to finish my masters, and I may need to quit my job to make that happen. Would you be okay supporting me financially while I do that?\" and that opens a conversation about what he wants to do, what she's okay with doing, what alternatives or compromises are possible, etc.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 82,
                      "content": "This, exactly.  I did the lion's share of supporting us while my husband earned his PhD.  I was happy to be able to do that for him.  However, we fully discussed and planned it for more than a year before he actually quit his job and started the program.  The OP here didn't get that respect and it makes me think not great things about how her boyfriend views her and their relationship.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 133,
                  "content": "Don't forget \"if you won't support me financially we may as well break up\" - doesn't that sound like OP is being used? If the boyfriend only values a relationship if she'll pay for 80-100% of everything for him?",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1,
                      "content": "He didn't say that, he said 'if you throw me out of the house'. It was shitty of him to make decision to leave job without discussiin, but 'move out to your mom until you have money again' == breakup is pretty reasonable.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "On the other hand, OP is complaining about him \"running up utility bills\" and him not having to wake up early in the morning.  How much electricity can the guy use?  If he moves back home, is OP going to move to a smaller apartment? Or is she going to stay where she is, but just without an extra $20 in utilities and with more \"sleep.\" If I suddenly wanted my SO to move home after living with her for 3 YEARS, I'd think it's probably indicative of a bigger issue with the relationship. It sounds like she is just looking for an excuse to break up with him. Which is fine, she's entitled to not financially support him while he goes to grad school, but be honest about it and break up.  On that count, YTA (for not being honest about the reasons underlying this decision).",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "That’s supremely dependent on the program. I took a full year MBA and the idea of working a part time job while also completing it would be extremely daunting. Not impossible but the workload of the degree plus a part time job could be a setup for failure. \n\nWith that said if someone wants to pursue education they need to be able to finance themselves through it. Be that through working, savings, or loans I do think it’s unfair to expect to be supported through a voluntary unemployment of any kind.",
              "id": 10,
              "comments": [
                {
                  "score": 1,
                  "content": "I'm about to start a full time MBA with a part time job 😬",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -7,
                  "content": "I got a doctorate while raising three kids on my own. Had one, she was two, when I started and three when done. Hubby did nothing with kids or house. So yeah, he can handle a part-time job. But I agree that his unilateral decision making is a no go.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Just because it worked for you doesn’t mean that is the path for everyone. Years ago my husband went back to get his MBA and then studied and passed his CPA exam. There is no way he could have worked a part time job on top of that so I supported us at that time. \n\nSorry you got no support from your hubby or help with the kids or house. That wasn’t right or fair. Hope that’s improved or you jettisoned that dead weight.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "[deleted]",
              "id": 14,
              "comments": [
                {
                  "score": 10,
                  "content": "I work full time, am taking graduate courses, have a 4 year old, and have a physical disability.  My program lasts for a little over a year.  I think he could handle a job.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Yeah that made me a little iffy too.\n\nTheir SO, unilaterally, made a decision that affects the both.",
              "id": 16,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I don't really understand why, if his parents would be more than happy to take him in, he can't just live with her and get his parents to fund his food and facilities. Then it wouldn't cost his gf anything extra to have him live with her and it wouldn't cost his parents anything significantly more than if he were to live with them.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "In the UK some masters programs are only 1 year and are meant to take the place of a full-time job. That's probably what he's doing.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Dude I'm working full time right now and drive 2 hours to college and 2 hours back 3 days a week. Its completely possible.",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 206,
          "content": "[deleted]",
          "id": 20,
          "comments": [
            {
              "score": 50,
              "content": "The more I think about this, the more I suspect you're right. This is a dick move.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Yeah, this. 100% this, OP. Definitely NTA.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Agree.  OP is NTA.  Boyfriend is taking advantage.  To quit is job without discussing this and making a plan first is terrible.  And to threaten breaking up if he has to move home makes him a huge asshole.  OP - you've been through this with your last relationship where you supported him.  Don't do this to yourself again.  Don't let yourself be used.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 81,
          "content": "I’m with you regarding the marriage thing. Not believing in marriage generally implies the same level of commitment, just not the legal bond - that is, everything but signing the paper because the paper is the problem for you. What’s going on here seems like OP is using that as a handy excuse for NOT being a life partner.  \n\nIf OP doesn’t want to be “everything-but-the-paper”-married to this guy, that’s absolutely fine; it’s called dating, and I’m not 100% sure I’d support my current partner of a few years totally through school without way more discussion. But it seems to me that she’s hiding behind “Yeah, I just don’t believe in marriage, everything else is the same though” and then flipping it to “No, I’m not supporting you, duh, we’re not married.”\n\nOP, I agree with NAH, but I think you’re misleading yourself and your partner. The NAH is for it being your money, and you get to decide how to spend your money. If you don’t want to be a life partner to this guy, though, break up with him. Because HE clearly thinks you are all-but-paper-married, sickness and health, supporting through legitimate acquisition of a degree, shared finances, etc. If that were me and my long-term decidedly-not-husband told me abruptly to move back with my parents because he wasn’t gonna support me, and I were 32 and thought I’d found a life partner, of course I’d feel betrayed.",
          "id": 24,
          "comments": [
            {
              "score": 57,
              "content": "I see your point and that is a valid question about how she views the relationship, but it is absolutely assholish to make this kind of decision without consulting your partner. She may be largely supporting them already, but 20-25% is not nothing. I’d be pretty pissed if my partner just sprung on me “hey, we’re taking a 25% cut to our family income starting now,” regardless of the reason or future benefit. He’s definitely TA for that, even if she’s also TA for how she views their relationship and their obligations to each other.",
              "id": 25,
              "comments": [
                {
                  "score": 27,
                  "content": "plus he's taking on family debt now, because he'll have to pay for that master's degree somehow. And if they're a unit, it's now her debt too.  \n\n\nThat's why \"living together but not married\" can get really messy. Say what you want about marriage, it at least makes the business partnership crystal clear. The split-up can get messed up in application, but the concept is rock solid.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I feel like that might be why OP doesn't want to get married. His loans are his loans, not hers. Even if they live in a place with common law marriage, three years most likely won't qualify them.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Well he must not view her as \"all-but-the-paper-married\" either, to make such a big decision without discussing it in detail with her first (i.e. quitting his job to go back to school while having her financially support her).",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I’m everything but the paper married to my life partner. I would never in a million years dream of quitting my job and expecting him to fully financially support pursuing my education without discussion. Actually, several discussions. Even though he is the main breadwinner, we make financial decisions together, like partners do..\n\nOP NTA",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Speaking as someone who doesn't want to get married, this kind of situation is one of the major reasons for it. She doesn't sound like the \"everything else is the same though\" kind of \"I don't believe in marriage,\" but instead like she dislikes the dynamic in general.\n\n Personally, I don't like the sense of comfort that comes with the commitment of marriage and how prone people are to abusing. I don't want a hassle in court leaving a relationship if my partner does something drastic and bad, such as quitting his job to become a student again because he just assumes I'll support him without discussing any of it with me or the stress it'll put on me. OP sounds like she's the same boat. And honestly, even if she did believe in the \"everything but the paper\" kind of relationship, this guy wouldn't be living up to that standard either, as spouses are supposed to discuss big decisions together.\n\nI think it's a NTA, because there's no interpretation of the relationship that makes it ok to just quit your job and assume your partner will support you without even asking them first.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I see this point--he apparently thinks you're as good as married, and you don't.   \n\n\nAnd that's a problem.   \n\n\nBut it's in addition to the problem of him making this decision without discussing it with  her and truly listening to her point of view.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "A little weird? Try financially manipulative at best.",
          "id": 32,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 783,
      "content": "> He says if he were to move back in with them, that we may as well break up. \n\nBreak up then. Your expectation to go to school on my dime, time, and personal space is off base. You are being taken advantage of. He's threatening the relationship over, what... his inability to swallow his pride? Jfc dude.",
      "id": 33,
      "comments": [
        {
          "score": 343,
          "content": "They’ve been in a committed relationship and living together for years. All of a sudden since he wants to go to school he’s gotta go? She basically is breaking up with him in my eyes.",
          "id": 34,
          "comments": [
            {
              "score": 187,
              "content": "Isn't it more about his attitude though? He threatened the relationship if he had to move back home.",
              "id": 35,
              "comments": [
                {
                  "score": 184,
                  "content": "She’s threatening the relationship the way I see it. \n\nHow many people do you know aren’t going to take it personally that the person they’ve been with for three years and sleeping next to every night would rather live separately than support you for a bit? It’s essentially a separation, a giant step backward for the relationship at very best. How much optimism can you have for a future after being told you should leave?",
                  "id": 36,
                  "comments": [
                    {
                      "score": 400,
                      "content": "The problem here is he made a decision unilaterally. If they made the decision together it'd be different, but he made it personal by not involving his partner in the decision.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 117,
                      "content": "Doesn't he have some ownership of the deterioration of the relationship? He made huge, life-altering decisions, without asking for any input or insight from his live-in girlfriend. He quit his job without talking to OP first. He expects OP to increase her contribution to the household from 75% of expenses to 100%, but didn't discuss this first. \n\nI think it's understandable that OP wants to hit the breaks.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "> How many people do you know aren’t going to take it personally that the person they’ve been with for three years and sleeping next to every night would rather live separately than support you for a bit?\n\nMaybe I socialize with more competent and sane people, but no one of my social circle would assume their ***SO they aren't married to*** would support them.  Spouse, sure.  Not married?  No way.  \n\nThat takes some high level of entitlement for that.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "Very very little, and him proposing that they break up if he moves out is the right thing to do. It will not only save everyone’s time but everyone’s money as well lmao",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "If my husband were in the same situation as OP's boyfriend, I would support him. But the reason he's my husband in the first place is because he wouldn't ask me - and much less *feel entitled* - to be supported without contributing. \n\nIf I were OP and my boyfriend expected me to do all the heavy lifting because of a decision he unilaterally took, quitting his job without even consulting me and feeling entitled to my money, time and efforts for free... yeah, I'd break up. Not because it's \"unfair\" to make one partner do everything (it is fine if it's something both agreed to beforehand), but because of what that attitude tells me about the person in question.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "She's been supporting him this whole time. And he's the one that made the decision. He didn't talk to her before he quit his job, so he's the one forcing the decision.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "She's been supporting him for 3 years already; she's paying 80% of their expenses.\n\nHe only wants a relationship if she'll financially support him; hence he says they may as well break up if she won't. He is using her.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "Being kicked out of your home and sent back to live with your parents is being dumped. He was just informing her of the meanings behind her actions if she hadn't realized that yet.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 12,
                      "content": "lol no it's not. It's just that she has standards and doesn't want a leechy schooltime boyf.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -3,
                  "content": "It reads to me like the boyfriend believes they are building a life together, which sometimes involves one person taking on more of the load. OP's \"move out if you go to school\" makes it seem like she does not see them as actual partners in life. It would give me pause as well. Like, if he got cancer do you think she would support him? Because I think she would not.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 45,
                      "content": "I wouldn't want to build a life with someone that didn't warn me they were going to quit their job and felt entitled to my money without asking me first.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": ">which sometimes involves one person taking on more of the load.\n\nWhich she already did. \n\n\nI paid the same % to the household compared to hom working, when I was going to school fulltime at 20...in a country that at that time limited the amount I could work to 40 days a year.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "If the OP put that on the table, they think it's a valid option. The whole \"building a life together\" thing doesn't work much with him in school.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -12,
                  "content": "I see this as her threatening the relationship. I mean are you in or out?! \n\nYou don’t have to believe in marriage but do you believe in commitment? \n\nHe may see this as investing in their future *together*. I.e. I go finish school and then I make money and it elevates both our standard of living *together*. \n\nShe sounds a little bit selfish here. Like if you’re committed you’re a unit. You should want both parts of the unit to succeed. \n\nI’m not saying she *has* to though. I mean maybe she wants less commitment. Maybe she doesn’t see this as the two of them building a life together. And that’s fine\n\nBut if that’s what he wants... a life together. Being a unit. Then they need to break up because he wants more commitment than she seems willing to give.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 57,
                      "content": "He quit his job to “further their future” without even talking to her. He wasn’t being a unit at all he made a selfish decision (wether it’s good for both of them long term or not) without consulting her.  \n\nI’m married but I’d still be ultra pissed if my husband quit his job to go back to school without telling me.",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -13,
                  "content": "I don’t see him as threatening the relationship and I don’t see it being about pride. It’s about the miscommunication between the two and the fact that he probably feels blinded sided by how selfish she’s being (nothing wrong with being selfish, In the end we have to look out for ourselves). So I can see where both sides fucked up. ESH",
                  "id": 52,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Isn't he really the one who is being selfish here?",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "How can it be miscommunication when there was literally no communication? HE feels blindsided? What? Did we read the same post??",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "But he quit his job expecting her to support him without discussing it first. That's incredibly selfish and entitled.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "[deleted]",
              "id": 56,
              "comments": [
                {
                  "score": -7,
                  "content": "It’s a mistake for sure, and if she wants to break up with him that’s her prerogative. \n\nBut expecting him to stay after telling him you would rather him live elsewhere than get to spend every night with him makes no sense. Especially on a purely financial basis after three years together, that’s gross. You’re not convincing anyone that you genuinely want to be with them after doing that. She would be punishing herself if she really wanted to be with him. Seems like she won’t even miss having him in the house.",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "[deleted]",
              "id": 58,
              "comments": [
                {
                  "score": 15,
                  "content": "That's actually a great question, I wonder if OP even knew he was applying or not",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "He's the one forcing the hand.  I paid my portion of bills during school, but says if he has to go do that or live with others then they should break up.  Don't blame her for his craziness.  She's just reacting to his crazy with reasonable outcomes.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "He quit his job without consulting her and basically told her, you will be paying for my life while I do this now. If my husband did that to me, much less a boyfriend, I'd be kicking his ass out of the house.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "He quit his job without telling her under the assumption she will support him. He doesn’t need to go because he wants to go to school, but because he’s not treating her as a partner.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Maybe if he talked to her before quitting his job then he wouldn’t seem like such a freeloader...",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "He quit his job conpletely without dosicussing it with her, and EXPECTS to go back to school with no other responsibilities while he's over 30 on his partners money. It wasn't  a discussion to him, you need to read the post more clearly. \n\nI didn't get to go to school on anyone else's support when i was 18 let alone 32! There's literally no reason at minimim he can't hold down a part time job.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "yeah I agree with you.  she even made the comment she doesn't agree with marriage, likes doing things her way.  Sounds like shes not really ready for any high level of commitment, however he is.  seems like OP and BF want different things for their relationship and need to sort that out.  I actually lean to ESH",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Arent partners supposed to be partners? And support each other?",
          "id": 66,
          "comments": [
            {
              "score": 8,
              "content": "Partners also talk about the decisions that would affect how much money they are making and not just expect the other one to handle all expenses.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 557,
      "content": "ESH. \n\nWhen you’re in a long-term relationship and cohabiting, these kinds of things should be joint decisions; this situation should not have been a surprise. He failed to communicate and didn’t consider or consult with you. \n\nBut again, you have been living together for 3 years. You can’t just take major steps backwards in a relationship like this and expect it to continue. He is trying to do something that will increase his earning potential which, at this point, benefits you both. If you’re not willing to support him, you’re not considering the long-term big picture, and you’re willing to put the breaks on things like that, then yeah you might as well break up. Sounds like you guys aren’t really a team.",
      "id": 68,
      "comments": [
        {
          "score": 10,
          "content": "Listen to AssBlaster_69. AssBlaster_69 is wise.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -104,
          "content": "She doesn't feel like supporting him while he gets his degree but I bet she'll have no qualms accepting nice things he can afford with his increased earning potential later on.",
          "id": 70,
          "comments": [
            {
              "score": 123,
              "content": "This should have been a discussion, though. \"Hey girlfriend, what would you think if I go and finish my degree? It would take one year, during which I wouldn't be able to contribute, but after that I should be able to earn X more money. At that point I can contribute Y percent to the household.\"\n\nShe can then decide if that's okay with her.\n\nAlso, the \"nice things he can afford\" that she'll be \"accepting with no qualms\" will probably amount to 50% of household expenses instead of 25%, considering that's all he pays now. In other words, his fair share of the bills. Not fancy vacations and dinners and jewelry and cars.\n\nShe would not be hypocritical for accepting an equal contribution from him after not supporting him as he worked his way towards it.",
              "id": 71,
              "comments": [
                {
                  "score": -26,
                  "content": "The thing is, I don't think she was ever expecting an equal contribution from him. How? She never pushed him to go back to school for that potential additional earning. \n\nPlus, she doesn't seem to complain about the fact she's pretty much supporting him anyways by paying 80% of the expenses. Im sure the extra 20% wouldn't kill her. \n\nAnd yes, he could've discussed before, but her qualms aren't even about that. These ultimatums from both parties would've ended up on the table regardless. \n\nI've been blessed with a six figure income since my early 20s, and I've seen this behavior from women around my age (I'm a guy, currently in my 30's btw) growing up. If the young woman had really good income, she'll tend to gravitate to (wait for it) low income guys! It was the weirdest thing hearing them tell me about it. I'd go out on dates with them, but sure enough they preferred someone who was broke.\n\nMaybe it gave them the confidence to be in those types of relationships and reinforced their independent status. Who knows? It could also mean that they could more easily walk away from a relationship at any time when they don't get their way (like this one).",
                  "id": 72,
                  "comments": [
                    {
                      "score": 23,
                      "content": "What the actual hell are you talking about? You really sound like the stereotypical nice guy archetype. \"Oh these rich women didn't want an equally rich guy like me, they wanted poor losers! Probably because they're terrible uncaring harpies who'd rather have complete control and get to leave a relationship at will. Women just don't love like I do.\" Get the hell out of here with that transparent bullshit. \n\nYes, the extra 20% wouldn't \"kill her,\" but the entitlement and audacity to completely quit your job in order to pursue school full time while expecting to live off the dime of your partner without even MENTIONING this to them is actually mind blowing. In my relationship I'm the one who is going back to school to turn an associates into a bachelors degree. We had several in-depth dicussions together as a couple about if the money spent would be worth what was going to be returned over time, what would be expected of me if I were to take this route, bouncing ideas off of each other for the best methods, ect. Overall i decided to still work part time to bring in enough money for my own expenses and am responsible for almost all of the cleaning and cooking (partner works insane amounts of overtime,) but he still extends his help on the weekends and is appreciative of what I'm offering in replacement of financial support. \n\nHer boyfriend isn't even considerate enough to offer anything in return for completely relying on her, or if he is willing to do something like that no one would know because HE DIDN'T DISCUSS THIS WITH HER. Anyone would feel used in this situation.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Sounds more like they saw through to your broke ass  personality.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "LOL. She's already paying 75-80% of everything. Stop acting like she's a gold digger. She clearly has her own already. He just unilaterally decided one day that she's going to support him 100% while he goes to school. Maybe he'll finish school, find a good job, and contribute more equally in the future. Or maybe he'll just keep on living off of her.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "More like 'Surprise, I quit my job and now you have to support us both by yourself and if you're not cool with that, we're breaking up, because I think it's totally ok to make huge life decisions without consulting you!' How is the bf not the asshole for being so incredibly self centered. He's a terrible boyfriend for not considering her when he made this rash and selfish decision without her input and expecting her to go along with it. OP needs to run for the hills, because you can't build a life with someone that will upend that life without any warning.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Yes I’m sure she would like that considering she’s basically already supporting him now with the 80/20 split they are currently doing.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -42,
              "content": "YES! So what is it OP? You can’t have your cake and eat it too. \n\nAre you building a life together in which his increased earning ability affects you both? Or is this a me myself and I situation?",
              "id": 78,
              "comments": [
                {
                  "score": -36,
                  "content": "It's a \"whatever benefits me most\" situation.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 52,
                      "content": "There's nothing wrong with this. OP was honest that she didn't want to support someone, and that's her prerogative and 100% fair. ESPECIALLY when she's already been contributing more than 50% to household bills and expenses.\n\nShe's not the asshole for not wanting to support someone for at least a year who couldn't even bother with consulting her to see if that would be acceptable to them as a couple.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "I disagree. She said he generally only contributes 20-25% of all of their costs, so how could she even expect to reap the rewards of his increased income? He has no track record of equal contributions anyway.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I disagree. She said he generally only contributes 20-25% of all of their costs, so how could she even expect to reap the rewards of his increased income? He has no track record of equal contributions anyway.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Which is the worst type of person to be in a relationship with. \n\nA good relationship sometimes requires one person to bend for the other in order to gain long term gains for the unit as a whole. (These decisions should however be discussed and agreed upon by both parties)",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -6,
                      "content": "In fairness to OP, she all but said she didn't care about anyone else. Her prerogative, but obviously that does not get her a pass on being TA.",
                      "id": 84,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 284,
      "content": "NTA if like you say he quit his job just assuming you would support him. That should have been a conversation between you before he made that sort of decision. \n\nIts also not his parents responsibility to support him through this however. He really should have saved before quitting, or discussed with you as his partner his financial plans.",
      "id": 85,
      "comments": [
        {
          "score": 25,
          "content": "Agreed. Here should find another job and work at the same time. It's not impossible.",
          "id": 86,
          "comments": [
            {
              "score": 4,
              "content": "I agree,  there's no reason why he can't work and go to school part time. Yes, it's hard, but it's doable. \n\nSO and OP really need to communicate better. I was in a bad position that was negatively affecting my mental and physical health and I still consulted my husband before I quit. He wanted me to quit earlier than I did, but I wanted to be sure that we had enough to live on before I left my job. Finances are a big deal and there needs to be a conversation about it regardless of your marital status.\n\nWho is going to pay for the tuition? Does SO have money saved? Can he contribute a little even if unemployed?",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 163,
      "content": "NTA a thousand percent!! Wth is this sugar baby crap? And the manipulating ultimatum? Wow you can really see what’s important to him right there.",
      "id": 88,
      "comments": [
        {
          "score": 13,
          "content": "What are you talking about?",
          "id": 89,
          "comments": [
            {
              "score": 182,
              "content": "He quit his job without discussing it, after which he said he would break up with her if she doesn't support him financially while he goes to school. \n\nHe won't even get a part time job. \n\n\nThat's what the person you're replying to is referring to when they say \"sugar baby crap\" and \"manipulating ultimatum.\"",
              "id": 90,
              "comments": [
                {
                  "score": 17,
                  "content": "To be fair,it doesn't sound like an ultimatum to me. I think he's being a dick by expecting her to support him without talking about it, but also think that assuming the relationship is over if she makes him move out is more of a logical conclusion than an ultimatum.   \n\n\nIf two adults are living together and one gets kicked out, that's likely the end of the relationship. It doesn't mean that she isn't well within her rights to do it, she's just being a bit unrealistic expecting them to be a couple after that.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 55,
                      "content": "How is \"support me 100% while I get my degree or I'm breaking up with you\" not an ultimatum? He didn't allow for any other contingencies aside from her supporting him fully. Other options would have included: part time job, loans, save up money for another year (he only pays 20-25% expenses as is), etc. Why hasn't he countered with any of these?",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 124,
      "content": "NTA. If he wanted to make such a drastic change he should have discussed it with you, not just quit his job and announced that you can just support him while he's in school. That's ridiculous and to be honest you are better off just breaking up with him and showing him the door because he's not adult enough to be in a relationship. As Dan Savage would say, DTMFA!",
      "id": 93,
      "comments": [
        {
          "score": -8,
          "content": "I mean it seems more ESH. \n\nBecause they are in a committed relationship. And usually that entails supporting the betterment of each other. \n\nThough I agree just unilaterally making the choice is horrible",
          "id": 94,
          "comments": [
            {
              "score": 40,
              "content": "ya you can support the betterment of each other after talking about it maybe but this dude just woke up one day quit his job and decided that OP was gonna support him 100% with the money she earns. And he also seems to be unwilling to compromise. So really, would it be a big loss if he broke up with her for not agreeing to his bullshittery?",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 83,
      "content": ">  I wish he would have spoken to me about it before he quit his job otherwise I'd have said that I don't agree with it\n\nI was going to say that you are the a-hole, until this. It seems like he made this choice on his own without telling you this, so NTA.\n\nThat said, I have to agree with him when he says that if he moves back home for this, you might as well break up. I understand not wanting to marry someone and not wanting to have kids, as I feel strongly like that too, but when you live together with someone that is not a roommate, but a romantic partner, it's expected that both of you would support each other in situations like this. If he wants to make a change for the better, as in getting a masters, and he lives with a romantic partner, even if you are not married, it's common sense that you'd help him achieve it, as he would, no doubt, do for you too (based on the fact of this expectation from his part). What makes him TA in this case is that he didn't consult you before quitting.\n\nYou should take this opportunity to think what's your end-game in this relationship, because from what you said so far, it's like his presence in your life isn't a major concern for you.",
      "id": 96,
      "comments": [
        {
          "score": 56,
          "content": "> it's expected that both of you would support each other in situations like this\n\nEh I think that's only expected if it's a decision that's gone in together.",
          "id": 97,
          "comments": [
            {
              "score": 5,
              "content": "yes, I agree with that, that's why I didn't say she was TA in this case. But what is the point of being in a  committed relationship and living together if they can't support each other? What was lacking was conversation BEFORE the boyfriend quit his job, I said that because, from what OP said, even if he would've talked beforehand, she would've told him to move back with his parents for his masters.",
              "id": 98,
              "comments": [
                {
                  "score": 19,
                  "content": ">from what OP said, even if he would've talked beforehand, she would've told him to move back with his parents for his masters.\n\nSorry but that's not at all what OP said: \n\n> I wish he would have spoken to me about it before he quit his job otherwise I'd have said that I don't agree with it, would have suggested why not doing it part time so you could still work etc.",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "well, even if not, \"no support = no relationship\" would be true for most situations",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 81,
      "content": "If you expect him to still be in a relationship with you, YTA. If not and you see why he would say you should just break up then, NAH: \n\nYou’ve been together for three years and live together, one of you moving out spells doom for the relationship. You don’t even seem like you’ll miss having him in the house you’re just so hung up on the resentment you have for your ex and are already projecting that. Your ex was a bum who refused to work, while current BF is only stopping work to get his masters and INCREASE his income. Extremely false equivalency on your part. \n\nYou being willing to go from living together and spending every night together to kicking me out purely because of money, tells me all I need to know about how you feel about me and therefore I would end it. That doesn’t make you TA because you are not obligated to support him financially. But he certainly isn’t TA for seeing it basically the same as a breakup.",
      "id": 101,
      "comments": [
        {
          "score": 20,
          "content": "Honestly to me this is OP projecting her past on her new BF. It's quite different for him to take a year to finish a master's degree than it is to date someone who just doesn't work and is lazy. I think YTA is appropriate, as if you're gonna have him move in with his parents just go ahead and break up with him.",
          "id": 102,
          "comments": [
            {
              "score": 66,
              "content": "You'd be okay with your partner quitting their job without discussing it with you first? Even if that meant you'd now be responsible for 100% of all expenses, for a year at a minimum, without even having a conversation about it?",
              "id": 103,
              "comments": [
                {
                  "score": 0,
                  "content": "If it was for my wife to finish her degree? You bet your sweet ass I would because that would increase our shared QoL after the fact. Especially since we could afford off just what I bring in. She sounds like he is in a similar situation, it would be different if she was a cashier or something.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -15,
                  "content": "If I paid for 80% of everything anyways, yes. I would have no problem helping someone I care about and helping them invest in their future. Although this is only if I see myself in this future.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 34,
                      "content": "I guess this is where you and I disagree. I would feel hurt and taken advantage of if my partner made such dramatic decisions without asking for my input or counsel. That OP has shared her home, bed, life, with this man for more than 3 years, but he doesn't think he should discuss his decision with her at all makes me question his love for and commitment to OP.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -2,
              "content": "Completely agree.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "Honestly her boyfriend should have volunteered to move home for a year while he's in school. They are not married, they are only dating, it does not spell doom if they don't live together for a year. If anything that shows maturity because that choice makes the most financial sense for both of them and it shows that he respects that fact that she's been taken advantage of in the past which led to resentment and he doesn't want to her experience that again or feel resentment toward him. But he didn't even consult her, he just assumed she'd foot his bill for a whole year.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "[deleted]",
          "id": 109,
          "comments": [
            {
              "score": 15,
              "content": "Not at all. He's the one who made the ultimatum. He quit his job and decided that she was going to support him or they were going to break up.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -1,
          "content": "I want to give you all my upvotes!",
          "id": 111,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 55,
      "content": "NTA, he shouldn't have made a decision like that without talking to you first. You have already experienced a relationship where you are the only provider and know for a fact that it breeds resentment. Him threatening that you may as well split up is emotional blackmail.",
      "id": 112,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 32,
      "content": "ESH.  He absolutely should have talked to you about it but it doesn't sound like you'd even consider it anyway.  Neither of you should be in a committed relationship.  He needs to break up with you, move in with his parents, finish his degree and live a better life.  You can sleep and enjoy your money.",
      "id": 113,
      "comments": [
        {
          "score": 1,
          "content": "Exactly my thinking. He should have talked to her about quitting his job to go to school full time clearly but it sounds like it would have just ended in the exact mess. And honestly, I'd probably end a relationship if the person I was with wanted me to move home when I was trying to better myself and my earning potential instead of supporting me if they could afford to.\n\nThis relationship doesn't sound healthy at all, tbh.\n\nDefinitely ESH.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Was my thinking as well, the level of stubborness from these two is staggering. If you can't even *start* a conversation about it without going batshit then I'd just take the mulligan and try again.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}