{
  "post content": "Throwaway for obvious reasons.\n\nI (27F) have a sister (35F) who likes to write \"books\" (badly written romance and fanfics). She keeps all her files on a fancy macbook (she never uses USBs or anything for some reason) that she bought with some money I loaned her, and she apparently is still unable to pay me back. The problem with this is\n\n1. it's been 2 entire fucking years\n2. she actually has plenty of money.\n\nWhenever I bring this up to her, she just gives me some bullshit excuse. None of them make any sense whatsoever. She always tells me either that she's close to being able to pay me back, or that something has happened to the money. Every. Single. Fucking. Time.\n\nOne day, she decided to fight me on it. She came to stay with me for a while because her flatmate kicked her out (again), and a few days into that, I asked if she was any closer to finally paying me back.\n\nShe started making her usual excuses, but I decided I'd had enough and pointed out how ridiculous this was. She started yelling and screaming at me, telling me she was trying her hardest and that she was \"doing her best\" and \"how dare \\[I\\] say that about her.\"\n\nShe backed me into a corner near the desk she'd been using. I put my hand on it to keep my balance and hopefully remain standing (she was trying to push me over onto the floor, even though I was already in the fucking corner. How smart), and I accidentally pushed her laptop in a way that made it hit a glass of water close to it. The glass fell over and water went all over it.\n\nShe then started screaming that I had destroyed her laptop and stormed out. It's been a couple of days since then, I haven't heard from her and all her stuff is still here, including the macbook. It's actually okay (it was closed and I guess that saved it somehow?) and I've decided to just keep it if she doesn't come back. i still feel kind of bad for making her panic about it though, she loves this laptop and her stories.\n\nAITA?\n\nEDIT: So some people have been telling me to back up her stories. I feel like it's been overlooked that she has a password. I can't access anything on the computer. \n\nAs for keeping it, I meant keeping it here until she comes back to get it. I'll give her some time before I repossess it entirely, I guess I should've been clearer about that lol.\n\nOn another note, some of you have told me that I suck for disliking my sister. I get it, we're family, and even if we weren't, we're adults. Neither of us should really be as petty as this.\n\nI've tried reaching out now, I've left a message saying that the laptop is okay and that I haven't done anything with it (yet, she has a few weeks to get it). She hasn't responded and she hasn't come back yet. We'll see what happens later I guess.",
  "id": 1,
  "comments": [
    {
      "score": 263,
      "content": "ESH, but definitely her more than you. She sucks because she refuses to pay you back and makes up excuse after excuse, which are almost certainly BS. My personal policy is don’t borrow money from someone if you know you can’t pay it back, but I think she’s lying. She also sucks for trying to back you into a corner and attempting to push you onto the ground. You suck for not telling her that the laptop is actually okay since it’s probably causing her a lot of anxiety and worry since she clearly loves the stuff on it. You also suck for the way you’re talking about something your sister clearly loves. I cannot stand when people talk shit about other people’s interests if it’s not hurting anyone. \n\nI’d say to tell her the laptop is okay, but unless she pays you the money, she will not be getting it back.",
      "id": 2,
      "comments": [
        {
          "score": 99,
          "content": "Fuck that she’s had her chance. If she didn’t back her stuff up to the cloud it’s cool completely  her. It’s pretty universal that it’s foolish to not back up important files",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 193,
      "content": "So what exactly are you asking? You say ask if you’re the asshole for destroying her MacBook but then said it’s ok. Make up your mind. What is the conflict you’re asking about?",
      "id": 4,
      "comments": [
        {
          "score": 46,
          "content": "Yes, kind of confusing about what the whole point of the story was...",
          "id": 5,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "Yeah it's like...how can you possibly be an asshole for an accident that apparently didn't even do any damage?  Don't get me wrong, there are certainly AHs here (I would say ESH), but not for the reason stated in the title.",
          "id": 6,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I think he’s asking because his sister hasn’t spoken to him since the incident implying she’s still angry at him.",
          "id": 7,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 121,
      "content": "NTA for the action as this was an accident.\n\nYou sound like TA in general though. The condescending way you talk about your sisters stories (which are completely irrelevant) is a giveaway.\n\nYour sister also sounds like the TA for not paying you back.\n\nSo although in this situation you did nothing wrong, my god I’m happy I don’t know either of you.",
      "id": 8,
      "comments": [
        {
          "score": 20,
          "content": "So wouldn’t that be ESH?",
          "id": 9,
          "comments": [
            {
              "score": 30,
              "content": "You can be AN asshole without being THE asshole",
              "id": 10,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "No because for the action he is asking about - breaking her computer - was an accident and she screamed at him.\n\nSo for that action NTA",
              "id": 11,
              "comments": [
                {
                  "score": 3,
                  "content": "I think she’s saying she wants to keep the computer now",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I mean.  OP paid for it and is clearly never getting that money back.  It's her computer now, as far as I'm concerned.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 55,
      "content": "I can hear the loathing in your voice when you describe your sister. You clearly don't like her. I'm not sure why you would loan money to her in the first place. Usually it's a good idea to only loan money when you're okay with never seeing it again. Loaning money to family just makes things even more complicated. I think you become an AH when you escalate things with your sister to the point of a physical altercation. From the way you write the event, it seems like your sister starts screaming at you after you ask about the money as if that was the only provocation, which I doubt. Based on the way you write about your sister, I think you were probably antagonizing her to some degree. You've brought up the money time and time again, but after a certain point you need to cut your losses, and maybe even ties with your sister, but starting a fight is not the answer. Escalating things to the point where they get physical is what makes you an AH. Obviously she's an AH for not paying you back, for pushing you, and just in general being a brat. ESH, your sister more than you. You both are too old to be acting like this.",
      "id": 14,
      "comments": [
        {
          "score": 8,
          "content": "Wow... Ever think the loathing might happen after not being payed back for 2 years? And seriously, she made it physical according to the story, that is A TON of supposition and guess work on your part. Asking for YOUR money back, should not get you attacked by your fucking debtor. Lol SMH just stop.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 41,
      "content": "ESH but holy shit the hateful, condescending way you talk about her writing absolutely makes you sound like a gigantic asshole, and it really makes me wonder what percentage of this story is told from a biased perspective. \n\nImagine how much more unbearable she'd be if she did something really awful like crocheting or color by numbers!  lol now that'd really make her TA am I right?",
      "id": 16,
      "comments": [
        {
          "score": 6,
          "content": "She stole (at this point) enough money for a MacBook ~$2k, and hasn't made an effort to pay it back for TWO YEARS. You don't think that warrants some frustration seeping through? Seriously?",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "[deleted]",
              "id": 18,
              "comments": [
                {
                  "score": 0,
                  "content": "Grow up? LoL\n\nI defend no one. I've merely suggested we take someone at there word, and not fantasize some instance where they'd be wrong, without any justification. \n\nNone of which would suggest adolescence. Btw\n\nSeriously tho, try harder.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 27,
      "content": "[deleted]",
      "id": 20,
      "comments": [
        {
          "score": 2,
          "content": "Thinking a bit more clearly about this, I might have caused the fight a bit more than I thought, but I didn't intentionally spill the water on the laptop. It was an accident. \n\nIt would've been really stupid of me to potentially wreck the laptop, considering that paying for repairs would be another excuse for her to either get out of paying me back or make me pay for it myself.",
          "id": 21,
          "comments": [
            {
              "score": 6,
              "content": "Can you ask her to pay it in installments? Kind of gets rid of her excuses",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Based on the amount of creative writing, and supposition in this post, not to mention an almost complete write off, of her being in debt. \n\nThat said, if we're just making up our own stories, and not taking OPs at their word.... I have to wonder who do you owe money, that you're feeling super entitled to, and don't want to pay back?",
          "id": 23,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 22,
      "content": ">She started making her usual excuses\n\nInfo: what are those usual excuses? I can't imagine what excuses she would use after 2 years, everything must sound a bit weird after this time",
      "id": 24,
      "comments": [
        {
          "score": 10,
          "content": "it always sounds the same, usually \"I can't pay you back right now but I'm working on it!\" with no further explanation.",
          "id": 25,
          "comments": [
            {
              "score": 12,
              "content": "I can't tell if she's TA or not, but I had a similiar situation with my sister. I had lend her some money some months ago, I think almost 500€. I told her that I wanted the money back as soon as possible, she told me She'll give it back to me every month (one month 100€). I was fine with that, I mean, she is my sister, I trust her, but the money never came, doesnt matter how much I talked to her about it. I am 20, she is 22, and I seriously had to get our parents involved. I finally got my money back when they talked with her. But it felt so weird to rely on my parents",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 17,
      "content": "INFO: Is there a reason why she has not paid it back yet?    \n\n\nFor now though, I'm leaning towards ESH. Your sister obviously sucks because she borrowed a substantial amount of money and has made no movement to repay as far as you've said, and clearly screaming at you is not an appropriate way to handle any sort of situation.   \n\n\nHowever you also aren't in the clear here. You clearly have very little regard for your sister, as by your language and the way you present her. I think you both need to learn some respect for each other.",
      "id": 27,
      "comments": [
        {
          "score": 14,
          "content": "I guess it's coming across in my writing that I'm pretty pissed off at her lol. I usually try to at least be polite about it but she's always been a bit distant and honestly I'm not sure if I even know her that well.\n\nThe excuses for not paying me back is mostly that she needs money for other things, but she also buys a heap of like concert tickets and games and stuff for her and her friends. Like I said, she has plenty of money. I honestly have no idea why she can't repay me.",
          "id": 28,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "Send her the files, but not the laptop. NTA.",
      "id": 29,
      "comments": [
        {
          "score": 3,
          "content": "DING DING DING! This is the best answer so far /u/ThrowAway60502",
          "id": 30,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "ESH Your sister sucks for being bad with finances. You suck for not working out a repayment plan with her (yes, really) and for describing her and her hobbies in such hateful terms. Plus, i concur with other commenters who suggest you might be leaving out a few details in telling your side of the story. \n\nBut i will say this: if you decide to \"repossess\" her Mac just to punish her (I'm assuming you're not planning to sell it nor do you need it personally) then you'd go from sucking to being a huge asshole. It may also be a legal issue: the fact that she bought it with your loan doesn't mean the computer is your property. Please reconsider.",
      "id": 31,
      "comments": [],
      "relation": "Attack"
    }
  ]
}