{
  "post content": "Throwaway as I have friends on reddit. \n\nI (34f) have two boys (10m and 8m) and my husband \"Dirk\" (40m) has a daughter from another relationship \"Gwen\" (just turned 6f). We are a healthful household and we teach moderation and controlling how much we take when we have treats. We are also very active and every day strive to get the boys moving.\n\nHowever, Gwen is only here two weekends a month, and her mother has the exact opposite attitude. In all honesty that woman's blood type is probably ketchup. Similarly, Gwen is about 20lb heavier than a 5 year old girl is supposed to be.\n\nIt makes me sad for this child and her health so when we get her I try to teach Gwen about healthy eating and moving around. We have the boys play with her so she's getting active, and we make a distinction between foods that are healthy and ones that aren't. When I see one of the kids reaching for a \"treat\" food in the pantry I'll ask \"would you like to make a healthier choice?\" And Gwen is really getting it, she's always going for better choices now and is also asking for fruit at home which is really good.\n\nGwen's birthday ended up falling on one of her weekends with us, and while we were talking about what kind of cake to have, I asked Gwen about the healthier choice. My reasoning is unfortunately she's still getting all that garbage at home, and it's just not good for a growing girl. She agreed and we decided to have some low fat ice cream so she can still have a sweet treat. It's a brand Gwen loves and asks for every time she's here, so she was happy with it.\n\nUntil the next day after she went back to mom. Her mom called us furious, she said then when Gwen got home and she asked about her birthday with us and her cake, Gwen started crying because she really did want cake but didn't want to \"make a bad choice\". She accused me of fat shaming her and her daughter and that I owe her a cake and a big apology.\n\nI'm just looking out for the health of a child in my care, but I never said Gwen couldn't have cake and she could have had one if she said she wanted one. I suggested sticking to ice cream because I care. But did I go about it in a TA way?",
  "id": 1,
  "comments": [
    {
      "score": 50057,
      "content": "YTA. She’s 5. Give the child goddamn cake on her birthday and then go for a family walk after. \n\nAlso FYI, the good choice/ bad choice talk is just going to give her body image issues for the rest of her life.",
      "id": 2,
      "comments": [
        {
          "score": 19718,
          "content": ">Also FYI, the good choice/ bad choice talk is just going to give her body image issues for the rest of her life.\n\nThis. The poor child is 5-years-old. OP needs to just stop commenting on her stepdaughter's diet, period. Just based on OP's attitude here, I'm worried this little girl is going to develop an ED by her pre-teens. I can absolutely understand why the Mom was furious. Dad needs to step up and set some hard boundaries with his wife.",
          "id": 3,
          "comments": [
            {
              "score": 9769,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 7164,
                  "content": "Right? OP was TA as soon as she said Gwen’s mother’s blood type was “probably ketchup” and then just kept getting worse.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3576,
                      "content": "Weirdly relieved to see I wasn't the only one bothered by that. And I'm scrawny as shit, so it didn't strike a nerve or anything. Just an AH comment for no reason.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 404,
                      "content": "Agree, that sentence alone is worth a YTA as it perfectly shows how much OP loves her own farts.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 360,
                      "content": "Yep that was the point I knew OP wasn't just a health conscious person but is an AH who thinks fat people are acceptable targets.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 285,
                      "content": "She has no respect for the woman who was there first, is the mother and parent of the child and therefore the final say....not some orthorexic person who just jumps in and thinks she runs the show. Not even her daughter!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 145,
                      "content": "Yeah it was hugely judgemental. I cannot imagine having to coparent with someone like this - the judgemental attitude is awful.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "that was my ‘I’ve seen all I needed to see here’ with this post",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "That was the moment I made my decision as well. OP, let’s just go down the list. \n\n1. A person’s weight and body size/shape is not a reliable indicator of their overall health. People in larger bodies can be very healthy and people in smaller bodies can be very unhealthy. \n\n2. Even if this really is about health and not about weight shaming, health is not a moral imperative. Nobody owes you their good health, and a person does not commit an immoral act by not being as “healthy” as you would like them to be. \n\n3. Food is morally neutral. There are no good foods or bad foods.\n\n4. Mental health is as important as physical health. The two are intertwined and frequently impact each other. In a lot of families, parents focus on their children’s physical health at the expense of their mental health. This is what you are doing every time you stop Gwen from having a treat and “asking” her to choose something healthier. You are teaching her that she is wrong and bad to want the things she wants. You are teaching her that the way her body looks is more important that the way she feels, either physically or emotionally. \n\n5. Boys can also get eating disorders. Google “Christopher Eccleston anorexia” for an example of a man who struggles with his relationship with food and with his own body. Gwen is not the only person at risk of developing an eating disorder in this family.\n\nYTA, in the extreme.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Her husband also had a child with “ketchup blood type” so she better relax before he goes right back to what he likes 😂",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "My favorite part was asking the kids \"would you like to make a healthier choice?\" If they went for a snack. She sounds just delightful...",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yeah, me too. When she said this little girl is 20 pounds heavier than she should be at her age, I was very alarmed you don't make small children diet.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1486,
                  "content": "Also often times “low fat” is a worse option health wise than the “full fat” version. \n\nWith kids that age, making sure they eat veggies and are active are good enough! And maybe some level of moderation for treats (only have a bowl of ice cream of homemade popcorn instead of microwaved etc)",
                  "id": 16,
                  "comments": [
                    {
                      "score": 888,
                      "content": ">Also often times “low fat” is a worse option health wise than the “full fat” version. \n\nThis.......I've struggled with food all my life and its only now that I'm in personal training that this has been explained to me.\n\nOP please stop giving this poor little girl body image issues that's she'll carry for the rest of her life.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 838,
                      "content": "YTA. for fat shaming a 5 year old and feeding her garbage disguised as healthy choices. Low fat ice cream uses chemical emulsifiers and artificial sweeteners that are much worse for you than regular ice cream.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 599,
                      "content": "I notice it is your cake day, would you like to make a \"healthier\" choice?",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 383,
                      "content": "Kids also need fat!! The calorie difference is usually pretty minimal anyway. It's about balance, not deprivation. Also, low fat dairy just tastes sad, imo.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 175,
                      "content": "Yeah “low fat” and “diet” is usually filled with fake sugars. Everything in moderation is the key I’ve found.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 159,
                      "content": "Also you don't restrict calories for a 5 year old you let them grow into their weight by changing to an overall healthy diet.  That would includes cake for your birthday ( or whatever I mean you want pie or a giant doughnut instead you do you boo) \n\nI can't eat most \"lower fat\" stuff the added sugar or worse artificial sweetener usually makes a taste repugnant.  Plus for me personally I find butter tastes better than margarine so I end up using half maybe even a third of the amount of butter( I'm old it was butter vs margarine when I was a kid)",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 105,
                      "content": "happy cake day! \nhopefully op won't try to replace it with low fat icecream",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Also children need more fat than adults in their diet. What's healthy for her might not be for a five year old.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "When mine were young, as long as you ate your meals, and brushed your teeth properly I didn't GAF what you ate in between. We always did activities that were healthy for the body, sports, hikes, etc. , not much structured but they did play sports if they wanted to. They all grew up preferring a healthier side of snacks for some reason. One of them would come home from school and eat a can of peas or corn for snack..Yes, thats what he wanted. (we had plenty of junk food in the house, candy, snack cakes, stuff like that)",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Yes, and a person's birthday is once a year, just let the kid have some cake. It wouldn't hurt her in any way.There's nothing wrong with eating healthy, but this sounds to me a little bit like an obsession. If you can't give cake to a small child for their birthday, because you're constantly thinking about their weight and can't let it go even on that day, then you're definitely an AH.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1134,
                  "content": "[removed]",
                  "id": 27,
                  "comments": [
                    {
                      "score": 326,
                      "content": "OP is probably in her car creeping through the neighborhood at 5-10mph with her head out the driver side window with a mega phone yelling at the kids to \"keep running!!\"",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 182,
                      "content": "The child would be so anxious and trying to do the right thing and make the “right” choices because she knows she’s seen as fundamentally wrong,",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My dad was like this - he would never tell me I couldn't eat something but would always be over my shoulder, hovering and full of judgment when I was eating something.  I was a perfectly normal weight my whole childhood, but I always felt like I was fat and wrong because I could feel the weight of my dad's judgment behind me all the time.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I mean something started to tick me off at how she went about “the mum’s blood type is probably ketchup”. Being this judgemental about someone’s diet makes me wonder how forceful she is when she talks to Gwen about making healthy food choices.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Y’all best believe HER kids wouldn’t go without a cake even if they looked like a roly poly. What a nasty piece of work. YTA",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Bad bot. Comment copied and reworded from [here](https://www.reddit.com/r/AmItheAsshole/comments/11pz2zl/aita_for_not_having_cake_for_her_birthday/jc0nv7o/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3). Please report the above comment if you can.",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 896,
              "content": "[deleted]",
              "id": 34,
              "comments": [
                {
                  "score": 644,
                  "content": "OP is pushing her disordered eating habits onto children.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 11,
                      "content": "THIS RIGHT HERE.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 378,
                  "content": "Because he abdicated his responsibility to op? And his spine is in the safe with all the family jewellery? 🤔\n\nI understand that the little girl is overweight, but she's 5. She is growing still. She needs a balanced diet and activity but not being constantly 🙄 pressured asking if \"is that a healthy choice?\" \n\nPoor baby, progress, not perfection. Let her have a birthday cake. She wasn't going to eat a whole darn cake, for pete sake! \n\nLet her be a 5 year old. Enjoy all aspects of life, including eating. Poor thing was stressed and cried to her mother. I hope Mama stopped the visits until op apologised and changed her ways with the kiddo.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 302,
                      "content": ">She needs a balanced diet and activity but not being constantly 🙄 pressured asking if \"is that a healthy choice?\"\n\nExactly, OP isn't teaching healthy eating habits, is shaming the kid into choosing what she approves. That question to the kid probably feels like disapointment, \"you made the wrong choice\", so then changes the answer to what she perceives that OP wants to hear.\n\nI hope her mom got her a make up cake and puts an end to that bs.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "yes, at 5 she might just be at that stage that precedes a growth spurt.  Many children seem to put on a bit of weight for no apparent reason, and then presto chango!  they grow an inch or two in a short period of time and end up looking skinny until their weight catches up with them.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "gwen probably has the normal amount of chub a 5 year is supposed to have tho...\n\nlike, when my son was young he would chunk up, start sleeping more and then suddenly be two inches taller and leaner, then chunk etc etc...\n\nalso, as a big-framed person who muscles up at the slightest activity - like, i just have a large dang skeleton, ok? those scale numbers are always going to freak certain people out, especially if they are lighter of bone...because for them, that number would be wildly unhealthy. but for me? the number they see as ideal only happened once in my life when i stopped eating food at all because i was being shamed for a size i can't change. i looked gross, i had no energy and was still being called 'big' but like....nah.\n\nanyway, gwen might have the future frame of a descendant of scottish peasant folk and have calves meant for plowing a field twelve hours after giving birth, i don't know. i don't even know what i'm trying to say here except this joyless sod of a woman sucked some of the happiness out of my day and it's not even my birthday and i'm not 5.\n\nungh.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Maybe the husband drank the same Kool aid as OP.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I hope the mother made the healthier choice and didn't let OP see her again.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yeah, because visitation isn’t often a court mandated thing…",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 112,
                  "content": "OP probably put a fitbit on hubby's arm and is making him run around the block 100 times. \n\nShes probably watching that fitbit info like crazy too.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 4,
                      "content": "😂 I laughed out loud when I read this.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 477,
              "content": "Exactly. \n\nGood idea: providing healthy meals for the kid, and she's happily eating them. \n\nBad idea: following them into the pantry and shaming them into picking something they don't want to appease you. \n\nWorse idea: shaming them into NOT HAVING CAKE ON THEIR OWN BIRTHDAY!\n\nYTA if it wasn't clear",
              "id": 46,
              "comments": [
                {
                  "score": 224,
                  "content": "My question is if she is so health conscious why are there \"bad\" snacks in the pantry at all? Almost like she's setting them up for judgement.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 33,
                      "content": "I'm wondering if there is a gradient of \"healthier\" options. Like if you choose something that is the 5th healthiest then you get asked and even if it's the second healthiest, OP still asks",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Probably because she thinks her kids aren't \"Fat\" so they can have \"bad snacks\"",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Her kids are boys, I bet she doesn't restrict their eating because \"they are growing boys\"",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "My mother was so health conscious it was annoying. We weren't allowed to have any \"junk foods\" at home and snacks were apples and bananas and maybe if your super super lucky and were really really good you could have a pudding cup. \n\nWhen I went to my grandmother's she had a stocked drawer in her pantry FULL of chocolates and candy. She had all the \"junk\" cereals for us, and desserts after every meal. But she would also put out bowls of fruit and could snack on her garden to our hearts content. Most of the time we chose the healthy option and fully enjoyed it and only took the treats in moderation, because we were already full off of the healthy option. She taught us great moderation and control in a good way. I was always happy to go there because I developed mild anorexia in my childhood home. Also my mom was poor so we couldn't splurge on treats but it sucked that we couldn't even get them once in a blue moon.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 10,
                      "content": "It's such a tough area for a lot of people. Either OP was similarly restricted as a child and is continuing the cycle or is completely oblivious to how words can have such a strong impact, especially at such a young age.\n\nCalling something \"bad\" or \"unhealthy\" tends to work out in the exact opposite of what they want. Especially when that child is going back home and feeling shame for all the food they eat in their safe space.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 377,
              "content": "If you notice OP doesn't even refer to Gwen as her stepdaughter in the posts, she calls her  \"husband's daughter\".",
              "id": 53,
              "comments": [
                {
                  "score": 21,
                  "content": "Yes very narcissistic and selfish behaviour. She wanted all the benefits of marrying this man, but zero responsibility for being a part of his family and that includes being a part-time mother to his child. She married him knowing he has a daughter.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Wait…. so are these boys his and hers or hers from another relationship?  Because the ages don’t make sense.",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 358,
              "content": "\"she didn't want to make the bad choice\" \nPoor little girl, it broke my heart. \nYTA, OP.",
              "id": 56,
              "comments": [
                {
                  "score": 183,
                  "content": "OP still says stepdaughter was happy with no cake when confronted with evidence she was CRYING over it. If it was an honest mistake wouldn’t she be horrified and sorry?",
                  "id": 57,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Of course the little girl said she was happy with no cake when the adult in the room kept saying it was the right choice to make. I really Hope OP is not a monster and didn't do it on purpose but now she knows, she doesn't have any accuse left so I do hope she will stop this behaviour :)",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 244,
              "content": "This child already HAS an eating disorder.",
              "id": 59,
              "comments": [
                {
                  "score": 29,
                  "content": "THANK YOU. \n\nOP made a FIVE YEAR OLD cry over FOOD. I’m sorry, that’s completely unacceptable. This is ALREADY an active issue for this CHILD. \n\nMy blood is boiling that OP’s husband has allowed this to happen to his child in his house. If I were the mom I wouldn’t even be talking to OP anymore. Straight to the ex or family court- anyone that will listen and hear what is happening.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 175,
              "content": "It's so sad. Very high chance that this girl will develop an eating disorder later in life. Instead of nitpicking what she eats, she should be encouraged to be more active. OP is cruel and YTA.\n\nOh, and children do not have a developed enough frontal lobe or understanding to process 'healthier options'. At this age they don't understand the concept of calories nor should they. It's a parents job to provide healthy food, not a childs job to 'choose it'. All you're giving this child from this is anxiety related to eating.\n\nAnd that's the gateway to eating disorders.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": ">Just based on OP's attitude here, I'm worried this little girl is going to develop an ED by her pre-teens\n\nHonestly, she likely has the beginnings of an ED now.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "The little boys too",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "\"On my 5th birthday my stepmother only got me low fat ice cream and said cake was an unhealthy choice.\" YTA OP!!!! It's people like you who need to unlearn all the \"good food bad food\" bs before they teach it to young children INCLUDING your boys! Check out the podcast Maintenance Phase for your re-education.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1436,
          "content": "My heart just breaks for this little girl. She's got one home that supposedly doesn't restrict anything, and another home that overly restricts everything. \n\nLike, I can totally see this girl having negative feelings associated with food when it comes to visiting  Dad based on OP's word choices and not being allowed cake on her birthday. She's going to binge and sneak foods around OP as she grows, because OP's doing the opposite of teaching healthy eating, by telling her to \"make better choices\" when choosing food.   \n\nOP could have easily given the girl a piece of cake, and some berries other complimentary fruit to eat with the cake.  It's all about portion control and moderation.",
          "id": 65,
          "comments": [
            {
              "score": 600,
              "content": "Especially considering how OP speaks about the mom. I doubt OP is a reliable narrator on what goes on at moms house.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 265,
              "content": "Not to mention OP could have made strawberry shortcake cake with strawberries as well! Or OP  could have made a dessert with fruit inside of it if they were really that concerned",
              "id": 67,
              "comments": [
                {
                  "score": 161,
                  "content": "Angel food cake with fresh strawberries is my favorite for my birthday.  (My birthday is in June and I hate icing, so it works out perfectly. )",
                  "id": 68,
                  "comments": [
                    {
                      "score": 65,
                      "content": "And angel food cake is fat free and a pretty good choice as desserts go.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My birthday is in June! I’ll have to try that.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "I have an apple cake recipe I used to make a lot which used stewed apples instead of added sugar for the sweetness. It was really tasty.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 263,
              "content": "I'm honestly wondering if bio mom really is that unhealthy. Coming from OP who over-restricts and even controls her boys to an extent she guilts them to have \"healthier\" choices, I'm starting to think that she would deem bio mom as unhealthy for eating spaghetti with ketchup once every two weeks. \n\nWho said that the child is too fat? She is just 5. Is she really overweight? How tall is she? Or is this how OP sees her because she isn't small? \nAnd who feeds a FIVE year old low fat products that are clearly targeted towards adults and diet culture.\n\nOnly 5 years...and food's already an issue for her 😔 While all she needs is just some activities.",
              "id": 72,
              "comments": [
                {
                  "score": 63,
                  "content": "It could just be genetic. But no, fat automatically means unhealthy eating in the eyes of so many people, and add a big dose of wicked stepmother to boot.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 27,
                      "content": "And thin doesn't mean healthy, either! We're all pretty thin in my family, but we tend to have terrible health problems early on because plaque *really* likes to build up inside our veins.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I come from a family of big people. We're all tall, big-boned, and heavy set. A while back, my partner and I decided to go on a diet together where we cut out a bunch of unhealthy snacks and ate more veggies and lean proteins. He lost a ton of weight. I lost nothing. I wish more people would understand that yes, sometimes it really is genetic.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I thought of this question, though: if they're so into healthy eating this 5 year old cant have cake on her birthday, why would there be unhealthy snacks laying around that the kids need deterred from? I have health food friends. None of them have rice krispy treats at home cause they don't even buy it. So that just seemed weird.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 8,
                      "content": "These are the kind of people who think any complex carbohydrate is an \"unhealthy\" food. Her boys are probably trying to eat crackers or sth.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "She's actually six. So OP keeps saying she's \"bigger than a 5 year old should be\"... because she's 6.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 121,
              "content": "A slice of cake — or even cupcakes. Buy enough so everyone get one cupcake — but make it festive and fun for goodness sake. It’s not that hard to be kind to a little girl.",
              "id": 79,
              "comments": [
                {
                  "score": 10,
                  "content": "Cupcakes for little kids is a gift to yourself as a parent because you don't have to have a ton of leftover cake that just goes stale or you eat it out of obligation. Especially if you make them yourself since you can control just about everything about it then. Make moderate sized cupcakes, dont slather them with 2 inches of frosting piped on, and you don't even have to make a full batch if there's only 5 of you! If you don't have time, the grocery store bakery can make cupcake cakes where the tops of the cupcakes make a design but they're still individual cupcakes.\n\nBut that would require effort for a child she clearly doesn't like.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "But OP doesn't think of her home as the little girls home. She keeps saying 'at home referring to the moms house. Then she says the girl was visiting on jer birthday. So she's just a guest in her dad's home. It also sounds like if the birthday didn't fall on dad's weekend they wouldn't have done anything at all.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Good news is she will have the choice in a few years. Hopefully she doesn’t develop an eating disorder before then.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "At least the girl has one decent parent, can you imagine the state of those poor boys? At least Gwen gets to go home.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Hell the kid is five. Make the kid some sort of fruit cake and dont mention it being a better choice than any other cake and they will love it while eating healthier. The key is to encourage the kid to eat healthy options, not discourage unhealthy ones.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">She's got one home that supposedly doesn't restrict anything, and another home that overly restricts everything.\n\nI *highly* doubt that the kid's mom just has a free-for-all with food. This is just OP's disordered perception. I bet the mom is fairly normal, with maybe a little bit too much \"junk food\", but not, like, McDonald's 3 times a day like OP seems to think.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 594,
          "content": "OP sounds a lot like my own mom. She genuinely meant well and was a nurse so she understood the science behind her food choices for me. But I’m 42 and have a terrible relationship with food even today. Again, my mom meant well, but kids have an amazing ability to interpret situations differently and usually in a way that internalizes lots of negative self-talk. \n\nOP, I think you mean well. But please listen to the feedback others are giving you—this isn’t how you help a 6 year old get healthy. You are going to lead her to some heavy emotional baggage that could last a lifetime.",
          "id": 86,
          "comments": [
            {
              "score": 163,
              "content": "Even if she means well, her place sounds like someplace where children are sent as punishment. Constant condescension and pressure.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Your story reminded me of my co-worker. My co-worker is 50 but she looks like she is 80 pushing 90!  She is so skinny—skin and bones skinny. I thought she has/had an illness or some kind of health problems that made her that way but her cousin said she has no other health disorder other than an eating disorder developed by her mother.\n\nShe refused to eat out with us during special days in a restaurant that offers healthy options. She refused every food with sugar. We felt bad for her but we get annoyed too by kept referencing about how her mom “says” women shouldn’t eat too much and should stay away from sugary and fattening goods every time someone would bring a cake, cookies, etc. because it makes them fat and undesirable. She would also measure her waist at work—I asked her if she needed to have a fitted clothes when I first saw her doing that. People call her food nazi behind her back since she makes people feel bad when she sees everybody eating sweet stuff or food in general! She constantly makes a face when she sees large people.\n\nMy other co-worker was so upset one day. I asked her what was wrong and she said she caught her (food police) looking at her with a disgusted face while she was eating from her plateful of sweets. I had to hold my tongue from asking her if she thought a crypt -keeper lookalike looked desirable, but I remembered she couldn’t help her reaction to food due to how her upbringing.  \n\nPeople need to rethink because these type of thinking will truly affect someone’s life.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 539,
          "content": "Also, the fact that the kid LIED and was afraid 9r didn't want to say how she really felt, and what she really wanted for her own damn birthday, says a lot more is going on between these lines OP has written. She's obviously NOT happy or \"getting it\". She has learned, for whatever reason, that she'd better comply.\n\nAlso, completely stopping a kid from eating fun, unhealthy stuff, even as a treat from time to time is a recipe for turning them into bingers the second they are out of your control. OP is inculcating a lifetime of unhealthy food relationships.",
          "id": 89,
          "comments": [
            {
              "score": 145,
              "content": "Yes, it's not that she 'gets it' it's that she can see the rules and is following them. She's compliant",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yeah, I remember my brother having a friend who came from an \"almond mom\" house where anything sweet (even many fruits) were verboten. My mom would always put out a spread of different snacks when our friends came over, and this kid would binge on cookies and chips until he felt ill.\n\nI looked him up on FB a few years ago, and he's almost 400 lbs.",
              "id": 91,
              "comments": [
                {
                  "score": 8,
                  "content": "Yup, making something totally off limits is a really good way to make it super desirable. Modeling how to enjoy treats responsibly is a great way to set kids up for a happy relationship with food.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "> Also, the fact that the kid LIED and was afraid 9r didn't want to say how she really felt, and what she really wanted for her own damn birthday, says a lot more is going on between these lines OP has written. \n\nThat broke my heart.  Poor kiddo.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The fear of ‘making a bad choice’ is so, so, real. It’s the weaponizing of “choice” for me. It’s not really choice if one answer is clearly ‘bad’. It’s a test. You are the asshole, OP.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 509,
          "content": "Yeah, as someone with an eating disorder, *this is how you give kids eating disorders*.",
          "id": 95,
          "comments": [
            {
              "score": 100,
              "content": "Yep. It happened to me. And I wasn’t really that fat. My parents meant well, but here I am, totally messed up when it comes to food.",
              "id": 96,
              "comments": [
                {
                  "score": 90,
                  "content": "Me too. I was put on my first diet at 6. I look at photos now, and I wasn't fat -- I was just taller and growing faster than my peers. But my parents looked at my weight and clothing size and declared me fat. It took me until my late 30's to even begin to develop a relationship with food that wasn't toxic.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I had a roomie in the psych ward who was force-fed. She couldn't stop compulsively eating and was a lot happier in the loonie bin because she couldn't do it there. She was an angel. I was there for not eating lol.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Same. Can't promise my mother meant well, but she'd argue that from the outside. \n\nBut heavy restrictions, guilt and good vs junk mentality have done a number on me now. I was a growing child who ended up embarrassed and disgusted by her body (plus undiagnosed ADHD), so binge eating in secret was basically a staple of my teen years.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "this little girl is on the path to bulimia with good food bad food programming.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Yup. And as someone who recovered from an ED and went through treatment, OP isn’t teaching healthy habits. Rule one- no food is forbidden in moderation. Rule two- eating certain foods on occasions is normal and acceptable. You get a slice of cake on your birthday. You eat a roast on Christmas or thanksgiving or eggs at Easter. This child is only little, of course she wanted a birthday cake and one slice of cake or a birthday tea won’t ruin her. It’s a treat, it’s special and she’s allowed to enjoy herself! All Op is doing is teaching terrible guilty habits and I’m not surprised biomum is furious. Poor child came home crying because she wanted a cake but feared being shamed so she didn’t get her birthday cake and felt so terrible even though she denied herself the treat. That’s so sad and it’s just giving her a guilt complex with food.\n\n\nModeration is key. OP isn’t being moderate, she’s being the polar opposite of biomum and poor little Gwen is stuck in the middle with nowhere to go. Poor kid.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Agreed. I'm 49 now and was first put on Weight Watchers when I was 4. 4 FUCKING years old. While I wasn't on it constantly, every few months I had to go back because I was too fat. I was bullied relentlessly by my family and was bingeing and purging by the time I was 11. I STILL have food issues and expect that'll be something I deal with for the rest of my life.\n\nI have NEVER looked in a mirror where I didn't see myself as the fat girl, even when I was 30 pounds underweight from chemo.\n\nYTA, OP, and a giant one. If I was Gwen's mother, I'd be contacting my lawyer about supervised visitation with no overnights. The body shaming of this poor child is absolutely disgusting.",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 313,
          "content": "YTA- are you freaking kidding me? Give the child cake on her birthday! \nHow is a 6yo supposed to make all these “better choices” when she goes home? Just give good snacks for all. You are the adult in this setting. \nHer diet is a conversation between her parents. Please leave her alone.",
          "id": 103,
          "comments": [
            {
              "score": 84,
              "content": "So agree when you said \" her diet is a conversation between parents\". She's a baby. She eats what parents give her. She doesn't make bad choices.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Why does OP even keep \"treats\" available in the pantry if not to jump in and shame them if they ever reach for them?  We keep those kinds of snacks out of sight out of mind,  OP really wants to have these \"teaching moments\" which are really control and shame moments.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 234,
          "content": "OP lost me at 'probably has ketchup for blood'. It's just so judgemental. I have friends who are also really active and eat super healthy. But even they do a cake for their kid's birthday. Moderation is the key. What OP is doing isn't moderation. It's guilt tripping kids for wanting to have treats at any time.",
          "id": 106,
          "comments": [
            {
              "score": 112,
              "content": "And that condescending, “Would you like to make a healthier choice?” Like obviously the fuck not, and something tells me the ‘treat’/‘bad’ choices in this woman’s house aren’t exactly what most people would consider treats.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah it was like OK she has some issues here.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 230,
          "content": "Its the almond for dessert mom mindset. Just wait until Gwen hits puberty and doesn't have complete control of her body Including where and how much weight she gains. I'm sure OP is gonna pull out the \"drink some water first. You're probably not hungry just thirsty\" level of food shame.",
          "id": 109,
          "comments": [
            {
              "score": 170,
              "content": "“Drink some water first, you’re probably just thirsty”\n\n\n“A moment on the lips, forever on the hips”\n\n\n“Nothing tastes as good as skinny feels”\n\n\nAll these and more are burned into my memory and were replayed over and over when I suffered from an ED and all throughout recovery.\nShame is not an effective motivator against obesity, children and young adults are actually MORE likely to become overweight in homes like OPs. \n\nOP needs to stop assigning a moral value to food. It’s all just food. Teach moderation and that healthier options can taste just as good and be just as satisfying with the good preparation but let the little girl have some goddamn cake on her birthday.",
              "id": 110,
              "comments": [
                {
                  "score": 7,
                  "content": "Oh that takes me back to the proana creeds.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This is why we teach our kids that some foods are for fuel, and some are for joy! They'll learn to moderate with our help, but mostly by watching us eat moderately.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 216,
          "content": "Yeah, making her 'healthy' stance on a birthday which is meant to be about being spoiled is kind of the wrong time. Get her a healthier option cupcake/cake for the family and ice cream. There's no reason why she can't also indulge but in a healthy manner. There ARE healthy cakes out there, ffs. \n\nThat said, OP's setting her up for a really skewed view on food, tbh. If she's over as shortly as she is and mom has her the majority of the time, she's going to have a really bad relationship with food when she eats 'normal' at home, but 'stepmom' starves her. Or makes her feel bad about how she looks. Or makes her eat differently from the rest of her family. Yes, this is a bad scene for a little girl in terms of her mom not feeding her healthy, but I would seriously suggest going to a child therapist/doctor to ask for help on how to integrate it into your family more than just 'everyone gets to eat what they want except for you because your mom's turning you into a piggy.\"",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "YTA. A huge one. Take it from a omeone who is now recovered from an eating disorder -  \"every food fits.\" \n\nIt was her birthday and the normal thing to do on her birthday would be to eat cake. As others said, labeling food \"good\" and \"bad\" is a huge issue with eating disorders.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13659,
      "content": "YTA. She’s six. It was her birthday. You should’ve made her a cake. And furthermore, you’re setting her up for a restrictive eating disorder by policing all her food choices. If you have such a “healthful home” why is there any accessible snacks that the kids shouldn’t ever eat? If you only have her 4 days a month, the food she eats with you isn’t going to counteract the 27 other days of poor diet. If her dad is concerned, he can discuss it with her mother and pediatrician. \n\nAll that said though this reads like a troll post bc it’s hard to believe someone could be so heartless to a little girl.",
      "id": 115,
      "comments": [
        {
          "score": 3102,
          "content": "OP is too stuck up her own self righteousness to realize she’s creating eating disorders in everyone around her.",
          "id": 116,
          "comments": [
            {
              "score": 951,
              "content": "OP has am eating disorder herself, it's called orthorexia when you're overly obsessed with healthy eating. Because it's \"healthy\", OP doesn't realize it's disordered, nor do the people around her.",
              "id": 117,
              "comments": [
                {
                  "score": 244,
                  "content": "Please don’t try to diagnose OP with an eating disorder based off of this one post. Sometimes people really want their kids to be healthy but that doesn’t mean the parent has orthorexia. I should add that I’m 100% against OP here, but I still don’t think we should go around diagnosing random people with orthorexia unless you’ve experienced it yourself or are a medical professional.",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 243,
              "content": "I think my eating disorder got worse by reading this post.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 864,
          "content": "There are snacks available, because OP wants to fool herself into thinking she is giving the kids a choice. That's why. Let them grow up a few more years so they can start saying no when she intercepts them every time they reach for the snacks, and we'll see whether there will still be snacks in the pantry.",
          "id": 120,
          "comments": [
            {
              "score": 478,
              "content": "Agreed! Or she’ll create little liars/thieves who steal and sneak food to avoid her judgement and criticism. Then she’ll be mad they gained weight from all the stress eating. She might as well not buy those snacks and only buy the ones she’ll actually allow them to eat.",
              "id": 121,
              "comments": [
                {
                  "score": 316,
                  "content": "Nah. I grew up in a household with an athletic brother and I was the fat kid, so this brings up memories to me.\n\nMom probably allows her boys to eat the more unhealthy snacks because they are thin/fit but but won't allow the stepdaughter because she's fat. Also \"5 years old\" isn't a measurement anyway, it depends on height, so we have no idea if the kid is actually very overweight or if she's just a tiny bit chubby.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 123,
                      "content": "Or just legitimately built bigger! That happens! My cousin's one daughter got bumped up a \"grade\" or two on her dance classes because of her size more than her ability because she just dwarfed everyone in her age/ability level! And she's definitely not fat. She's just legitimately got a large build. My mom's a large built woman too.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Not only height but also build! How people gain muscle, how their body is built, it all contributes! I’m very tiny, but have a rather muscular build so I always weigh more on the scale than I’m supposed to— yet I eat well, try my best to exercise where I can, and I look great (imo). Guess what? I also eat cake here and there.\n\nLife is about balance and moderation. It’s the kids birthday, let her have fun and enjoy cake. It isn’t like she is eating the whole thing in one sitting.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "The same build is also often treated differently on boys vs girls. Two of my cousins have the exact same build (both were 10lbs + as newborns and baby photos of them are almost indistinguishable). But with my older male cousin we always just joked that he came out of the womb as a rugby player, can’t say the same for his little sister. We went to visit when she was about 11 and she was making a batch of low fat brownies, whilst my Aunt bragged about how few calories were in each one. At 11 she was counting calories. I had to resist the urge to yell that she’s a child, and to let her make the full fat brownies. I’m not particularly close with my family but she’s a sweet (and very quiet) kid and I do genuinely worry about her sometimes.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "She claims she applies this rule of healthier choice to all her children. I know a lot of kids who had parents like this who were athletic. In high school they went super hard at parties because their parents weren’t around. When they went to college they took it to the deep end. Their relationship with food was so unhealthy and led to weight gain, depression, isolation (didn’t want family/friends to see them fat). One girl’s body just can’t handle a high concentration of sugar and she has so many health issue because she refuses to stop.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 431,
          "content": "I wouldn't count out the horribleness people can do to kids.   \n\n\nI was 6 or maybe 7 the first time my paternal grandmother asked me, \"GLM, when are you going to lose weight?\" It didn't stop there.   \n\n\nMy mother was ALWAYS on some diet or another. I started Weight Watchers at the ripe age of 12 because puberty hit and my body said hold tight to the fat!   \n\n\nI started binging - but not purging, because that was an ED; I learned that on Full House! - around age 13. I would hoard food away from the family and secretly eat it.   \n\n\nI'm 44 now; I still have problems with my relationship to food, moderation, and putting into practice what I know to be healthy eating.",
          "id": 127,
          "comments": [
            {
              "score": 83,
              "content": "I think we had the same childhood.",
              "id": 128,
              "comments": [
                {
                  "score": 16,
                  "content": "I'm so very sorry you experienced this, as well.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Same but my mother kept saying I should be thin like my teenage sisters despite that fact that I was 6-7 :/",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Agreed, I had a similar experience with my paternal grandma and grandpa.\n\nGrandpa told me at age 7 “there is no prize for being fat” after I ate two portions of food at dinner— I hadn’t eaten lunch that day.\n\nGrandma told me at age 11 to “lay off the Wendy’s.”\n\nWhile my household had the right idea with food— that being everything in balance and moderation— I still watched my mom struggle with her weight, as well as my father.\n\nI would stress eat, but I wouldn’t purge. I developed a binge eating disorder due to not being able to tell when my body was full, as well as developing insulin resistance which made that even worse.\n\nIt’s been years but it is a struggle at times. I had to be put on several medications to regulate my hunger drives.\n\nNeedless to say, stop giving kids EDs.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My mom’s mom always commented on my weight. My only memories of her were her saying something about my weight, even offering me money to lose weight. I went YEARS not seeing her because of it. The very last time I ever saw her, which was easily 15+ years since I’d seen her last, she poked me in the stomach and made some comment like “yep, it’s definitely you.” I looked at my mother and said straight up “this is why I don’t talk to her.”\n\nMind you, this woman at that time was in her 80s, heavily overweight (and had been as long as I can remember) and wheel-chair bound because of her poor health. And she had the audacity to comment on MY weight. \n\nI didn’t even cry when she died and didn’t attend her memorial. My grandma on my dad’s side was the absolute polar opposite and was the greatest woman to ever live. You never left her house hungry, and she loved unconditionally. I will forever be grateful she was in my life!!",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 226,
          "content": "> You should’ve made her a cake. \n\nIf OP is so concerned about health, she could have baked or bought a beautifully decorated 6” cake, so that everyone could enjoy a slice on Gwen’s birthday without having a ton of leftovers. “It’s Gwen’s birthday, so we’re going to enjoy a treat, but we don’t need to buy the quarter sheet cake that we’ll eat for a whole week” seems like a much better health lesson.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "Totally agree with all of this! Plus, if this woman was so \"health minded\" she'd know low fat ice cream means they increase the sugar. Low fat anything is almost always worse than full fat options because of increased sugar. So congrats OP,  your ruined Gwens birthday by switching a sugar treat meant for birthdays with a sugar treat meant for ill informed middle aged women.",
          "id": 134,
          "comments": [
            {
              "score": 44,
              "content": "Exactly!  There's a trifecta in most packaged foods. Salt Fat and Sugar. If it's claiming it's low in one it's higher in the other two. And I. Desserts that's *always* sugar. \n\n* I use the term most because there are a small handful of \"heart healthy\" labeled foods that are both low fat and low salt (at least comparatively) without adding a ton of sugar because they're savory things like soups.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "You'd be surprised. I watched a mom refusing her little daughter seconds because it would make her fat while the girl said sge was still hungry. It made my blood boil.",
          "id": 136,
          "comments": [
            {
              "score": 21,
              "content": "In a community theatre dressing room I overheard a mom telling her six year old that she'd clearly had too much turkey at Thanksgiving because her dress was tight. In front of other people!",
              "id": 137,
              "comments": [
                {
                  "score": 5,
                  "content": "How sad for the little girl",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "This is how eating disorders are created in children.  She isn’t old enough to understand “making healthy choices” and having food in the house you shame the kids for eating is huge no. YTA",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Is it really a “poor diet” with mom, though? I feel like we shouldn’t take the word of OP who gave a 6 year old diet food instead of cake for her birthday. In her mind “poor diet” might mean the kid gets toast (carbs! Horror! Satan!) or canned veggies instead of almond milk and organic free range low sugar baby carrots.",
          "id": 140,
          "comments": [
            {
              "score": 17,
              "content": "She thinks goldfish is “poor diet” food.",
              "id": 141,
              "comments": [
                {
                  "score": 14,
                  "content": "I’m sure plenty of cheap nourishing food is on her bad list. And as far as we know, the mother is a single parent.",
                  "id": 142,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "OP has options for making a healthy cake option for the girl’s birthday WITHOUT refusing her cake or shaming her into making “healthier” life choice.",
          "id": 143,
          "comments": [
            {
              "score": 17,
              "content": "Right? Reduced or alternative sugars and applesauce instead of oil are very common substitutes.a cool whip frosting or a glaze...",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yep. She isn't \"making the healthier choice\" because that's what she suddenly wants to eat, she's doing it because OP and that family is nicer to her when she does it.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9864,
      "content": "YTA.  \n\nIt was her birthday.  Asking her “would you like to make a healthier choice” is manipulative.  You’re telling her she’s wrong and choosing what YOU want to make YOU happy.  You’re setting them up for food issues.",
      "id": 146,
      "comments": [
        {
          "score": 1726,
          "content": "Also would it be that hard to make a healthy cake? A cake doesn't have to contain a ton of sugar and it doesn't have to be covered completely in frosting. OP is talking about low carb ice cream but can't be bothered to get a simple cake without that much sugar. If she can use Reddit she clearly has access to the internet. Just google low sugar cake recipes. Op clearly has a personal issue with the girl.",
          "id": 147,
          "comments": [
            {
              "score": 1553,
              "content": "[deleted]",
              "id": 148,
              "comments": [
                {
                  "score": 9,
                  "content": "I grew up in a house where food was restricted and it made me desperate for any treats and develop a lot of body shame. \n\nWent to a friend’s house where I was shocked to. see a bag of two bite brownies on the counter. \n\nCandy and fun food can be part of your diet? I don’t need to sneak and binge and purge and crash diet? \n\nI’m learning to love myself and love food. Cooking and shopping and EATING!\n\nHealth is so much more than punishing or restricting yourself! 🍰🍰\n\n\nThat said, OP I don’t blame you for trying to promote health. I think you’re rude for being so judgmental of others. That kind of talk tells me that you are really harsh on yourself and the people you love.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 729,
              "content": "My friend can't have sugar or wheat so you know what I did for her birthday? Googled how to make a cake she could eat because everyone deserves to have cake on their birthday.",
              "id": 150,
              "comments": [
                {
                  "score": 105,
                  "content": "As someone with an allergy— I applaud you.\n\nMy mom did the same for me when I was little because I have a tree nut allergy, and trust me when I say it means the absolute world. Especially coming from someone who isn’t family.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Your mom is awesome 👌",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My husband is diabetic, so for my daughter's birthday back in January, I ordered a cake from a local bakery that specializes in keto baking, just so he could have some cake at our daughter's birthday party.\n\nI ordered a tiramisu from them for dessert tonight, just because, since it's the one if both of our favorites, and he hasn't had any in a while (I had a piece a couple weekends ago from an Italian place).",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 230,
              "content": "Vegan or gluten free cake often uses stuff like grinded beets as a base for the batter. Sounds disgusting at first, but it works extremely well. The cakes are moist and you can't tell if you don't know. \n\nI'm neither vegan nor gluten intolerant, but I like to look up receipes like this because you can make cakes that are very low in calories compared to a real cake and it's not stuffed with sugar and the likes. \n\nAlso, it's one cake. The stepdaughter isn't going to eat the whole thing by herself. Let her have 1 or 2 slices. That's fine in moderation for a special occasion.",
              "id": 154,
              "comments": [
                {
                  "score": 84,
                  "content": "Cakes made out of something else than wheat and sugar are also real cakes. And I also bet if you ask a bakery if they could do a delicious cake without that much sugar or whatelse the bad stuff is they'll do it, so OP wouldn't even have to bake on her own if eating healthy is that important to her. Also does OP think she doesn't get a cake from her mom instead? Yeah, no, OP is at the same level as that nasty man I encountered at the swimming pool when I was the same age as the girl. I bought some fries and went back to my mom, when that man said to his girlfriend \"(That kid is) so fat and is eating fries\". Mind you, I wasn't fat, I was just a bit chubby, as kids are. And OPs stepdaughter isn't fat either. It's just 20 pounds if I remember correctly (roughly 10 kilo) so OP should just shut tf up. Adults bullying little kids are just the worst.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Or… hear me out, let kids have regular cake. Because in the absence of allergies, low sugar gluten free, etc…dessert is just another way of perpetuating diet culture.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 354,
          "content": "This question, \"would you like to make a healthier choice\", carries so much shaming it makes me feel horrible for the child. What child can, with a clear conscience, choose the \"bad option\" after being asked that? This is not offering a choice - this is \"are you choosing _that_? Your choice is bad. You choose wrong, what you are doing is wrong. _This_ is what I want you to take because it's the only right thing to do.\" \n\nAfter being told this all the time, how can they ever eat even a tiny bit of anything considered \"unhealthy\" without feeling tremendous amounts of shame and guilt? This in not the right way to go, not at all.",
          "id": 157,
          "comments": [
            {
              "score": 45,
              "content": "Yeah like if she’s going to ask that every time the child wants a cosmic brownie or something, just don’t have cosmic brownies in the house. Or save them for special occasions. But you KNOW her sons are going to town on all the snacks they want because they have a higher metabolism. \n\nThere’s nothing wrong with giving a child healthy snacks. But making them second guess it every time they want a treat and thinking a treat is ‘bad’ will cause really really unhealthy patters.",
              "id": 158,
              "comments": [
                {
                  "score": 13,
                  "content": "I think it’s worth saying that habit building isn’t something we really teach kids by giving them choices. We *tell* them to brush their teeth and shower so as adults they do them without really thinking. If you want your kids to only eat “unhealthy” food in moderation, only give it to them in moderation. So by the time they’re adults that’s what feels normal. Obviously, it goes without saying that this process can instil bad habits as much as it does good ones. Case in point, the habit being built by OP isn’t actually healthy eating, it’s making choices based on shame, which is a recipe for disaster.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "As a not actually fat kid, who was told I was by my parental figure, I ate a lot of low fat things. Low fat food doesn't teach healthy habits. They're also gross and unhealthy. I feel like more so than regular sweets in moderation. I feel like the parent encouraged a bad choice. Low fat ice cream is not healthy.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">What child can, with a clear conscience, choose the \"bad option\" after being asked that?\n\nlol me, actually, but I'm probably in the top 5% of genetic stubbornness... and that still led to secretive acquisition of things I wanted once I had the ability, so I could enjoy them without commentary.",
              "id": 161,
              "comments": [
                {
                  "score": 5,
                  "content": "I actually prefer fruit and other healthy foods to stuff like candy bars and cakes, but if my stepmother had pulled this, it wouldn't have taken long for me to start choosing the unhealthy things and when asked just say \"no\". When she inevitably blows up at that, well, \"I got what I want on the first try, thanks for asking.\" But I was a teenager when I had a stepmother, not 5 years old...\n\nHaving healthy snacks around and teaching moderation (1 special treat per day or something like that) is great. Manipulating a child and their relationship with food is not.\n\nAlso, where is dad in all this? He's the worst AH.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 314,
          "content": "And then she goes on to say \"but if she wanted cake she could have chosen cake\" as if her \"good behaviour\" isn't rewarded and her \"bad behaviour\" discouraged. Obviously Gwen associates cake with \"bad behaviour\" even on her birthday.",
          "id": 163,
          "comments": [
            {
              "score": 22,
              "content": "EXACTLY.\n\nGwen WANTED cake, but every time she shows a desire for foods OP disapproves of, OP just keeps asking, \"Are you *suuuuuure*? Don't you want to make a *hEaLtHiEr ChOiCe*??\"",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 282,
          "content": "\"WoUlD yOu LiKe To MaKe A hEaLtHiEr ChOiCe?\"\n\nWell, no, of course they wouldn't. If they did, they wouldn't have picked the \"unhealthy\" snack as their first option. Also, why are there \"unhealthy\" snacks in the house if she's so opposed to them? Does she enjoy rubbing them on the kids faces or something?\n\nThe passive aggressiveness of it, towards children also, makes me sick.",
          "id": 165,
          "comments": [
            {
              "score": 30,
              "content": "She’s “teaching” them to make “healthy choices”. Except teaching means manipulating and healthy means adopting f’ed up diet culture.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I think it’s so much more cruel of OP to ASK them and pretend it’s their own choice, when they’ve obviously already made their choice and this is just her unsubtle way of saying it’s the wrong choice. Like, just saying “no unhealthy snacks” makes more sense than this roundabout way of telling these kids they are wrong every time they want to treat themselves.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "It’s her birthday, she deserved a treat! YTA, OP.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This points to how much OP enjoys this control. \n\n\"Would you like to make a healthier choice? 🙃\" \n\nWould YOU, op?\n\nLet's start with not talking like a psycho, ok? \n\nOk great 😐",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "It's literally a leading question! \"healthier\": your choice is unhealthy. Honestly, being in OP's house sounds exhausting.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4008,
      "content": "[removed]",
      "id": 171,
      "comments": [
        {
          "score": 1219,
          "content": "Gwen's mom should have said this exact thing when calling out OP on the birthday cake. \"Would you like to make a better parenting choice?\"",
          "id": 172,
          "comments": [
            {
              "score": 142,
              "content": "Oh, I'm sure it's fine if \"her\" kids have it.  Just not the kid her husband dared to father before they met.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 677,
          "content": "I don’t understand why she has this food in the pantry if she’s going to be a creep about it with the kids when they want to eat it. It’s crazy. Why would you buy food and then shame your kids when they want to eat it?",
          "id": 174,
          "comments": [
            {
              "score": 438,
              "content": "Yes...It feels like they're being tested every time they go to eat. Exhausting.",
              "id": 175,
              "comments": [
                {
                  "score": 137,
                  "content": "Imagine having to live with that more than a couple weekends a month. Yikes.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I feel sorry for the kids that love there full time. Being this restrictive never ever works, every time it just created EDs. But manipulative AHs still keep doing it. YTA",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 231,
              "content": "Because she eats it when they are all in bed sleeping….",
              "id": 178,
              "comments": [
                {
                  "score": 19,
                  "content": "i remember some disgruntled staffer of The Goop Lady sold a story to a gossip blog years ago that she had to take all these extra steps to dispose of the mcdonalds wrappers that were in the kitchen garbage and it was the first time it had ever occurred to me that these controlling weirdo types would actually \\*LIE\\* about things.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It's called an eating disorder. And apparently, it's getting passed on to the kids.",
                      "id": 180,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "It’s 100% a power trip",
              "id": 181,
              "comments": [
                {
                  "score": 34,
                  "content": "Totally.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Gaslighting, if I were to guess. \n\nSounds incredibly cruel for a kid so young, too...",
              "id": 183,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Because people like this adore power tripping and manipulating people, even children.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 202,
          "content": "Would also love to see her face when one of them (possible as teenagers) responds \"Nah, I'd like a fuckin' twinkie\"",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 155,
          "content": "Like are they allowed to just say \"no, I'm good\"? OP talks as if her questions aren't commands and I do hope that's the case and the kids don't just hear it as \"put that down & try again bucko\"",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "Yes, this single line creeps me out.",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 86,
          "content": "> When I see one of the kids reaching for a \"treat\" food in the pantry I'll ask \"would you like to make a healthier choice?\"\n\n\nMy eyes just about rolled out of my head when I read this\n\nAlso she does sound insufferable",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Don't worry I'm sure she'll be the dreaded MIL that both her kids and DIL/SIL hate to see around the holidays or weekends because of this behavior. I avoid these family members like the plague and so do their own kids. She'll learn her lesson one day. If she's lucky it'll be before she's too late.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "My answer would always have been \"no\"",
          "id": 190,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "She does.  I mean, why even Have \"treat\" foods if you're trying to keep them from it?\n\nIt's like a mind game:. I'll keep rice krispie treats in the cupboard, but only so the kids can learn to choose carrots instead. \n \nIt's twisted.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Op sounds like clippy but not nearly as nice",
          "id": 192,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3411,
      "content": "YTA. You’re going to give that girl bad body image issues when she is older. You say she had a “choice” for getting a cake or not, but your comment about picking a “healthier choice” is rooted in shame. Fat shaming specifically. That’s not teaching her to be healthier, it’s going to give her a bad relationship with food and her body.",
      "id": 193,
      "comments": [
        {
          "score": 697,
          "content": "She’s 6 FFS and it was her bday. What a monster. She is for sure going to have body image issues for the rest of her life. YTA. YT[huge]A.",
          "id": 194,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 284,
          "content": "Absolutely this. YTA especially because you’re setting a 6YO for a lifetime of eating disorders and body dysmorphia. Given her age, you should bring it up with your husband, his ex, and the girl’s pediatrician. You can choose what you buy for the household on a regular basis (I grew up with the rule of “milk, juice, or water” for almost every beverage choice), but birthdays are special and need to be treated as such. You could have controlled the situation by controlling the portion size (opt for small cake slices or mini cupcakes for everyone). Do you tell your bio kids that they need to choose a healthier choice on their birthdays?",
          "id": 195,
          "comments": [
            {
              "score": 11,
              "content": "Or just google healthy cake recipes or something",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 144,
          "content": "Yep this is creepy and I really wonder what happens if they choose the treat they want. \n\nLet’s not forget, OP estimates she may be “20pounds (9kg) over what a 5yo should be”. So, she might be a little overweight for a kid a whole year younger, at the time when kids are growing. OP is cruel and just wrong. \n\nYTA",
          "id": 197,
          "comments": [
            {
              "score": 90,
              "content": "She also may just not be a stick thin five year old. It sounds like that's what OP is expecting. She needs to learn that bodies come in all shapes and sizes. Not everyone is meant to be thin.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Especially at that age! Sometimes kids look a little chubby but are at a healthy weight, and that weight disappears as they grow up. Also if she was 20lbs overweight at 6 years old, she most likely would have been already put on a diet designed by thé pediatrician, or have had tests run to make sure she doesn’t have a medical problem.",
              "id": 199,
              "comments": [
                {
                  "score": 17,
                  "content": "Yeah, she's 6, but what about her height ? \n\nSome 6 years old are small, some are bigger, taller ... Depending on her height, the \"right weight\" will look different regardless of how old she is.\n\nA child's weight is an issue that should only be discussed with the doctor and other professionnals. Point blank. OP doesn't know crap about what she's doing.",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3100,
      "content": "YTA. “Her blood type is probably ketchup” is so unnecessarily mean-spirited and incredibly telling. You think you’re better than fat people, and you’re not. You’re just thinner. Do Gwen a favor and stop trying to do her so many favors.\n\nEdit: Also, next time you’re obsessing about health, remember that eating disorders are the form of mental illness with the highest mortality rate. And boys can get them, too.",
      "id": 201,
      "comments": [
        {
          "score": 554,
          "content": "She’s definitely a bully. At first I thought she was talking about the mother then realized she was talking about the 5 year old. Evil woman",
          "id": 202,
          "comments": [
            {
              "score": 129,
              "content": "Wait?! OMG SHE WAS TALKING ABOIT THE GIRL, I THOUGHT SHE WAS TALKING ABOUT HER MOM TOO!",
              "id": 203,
              "comments": [
                {
                  "score": 166,
                  "content": "She was talking about the mom with the blood type comment",
                  "id": 204,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Jeez, I had to reread 5 times. I was seriously worried about that little girl",
                      "id": 205,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Don't wanna play devil's advocate here but \"that woman's blood is probably ketchup\" was definitely about her mom",
                  "id": 206,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 294,
          "content": "A friend of mine just started palliative care because of the damage caused by decades of anorexia nervosa. OP is disgusting.",
          "id": 207,
          "comments": [
            {
              "score": 117,
              "content": "I have heartburn and trouble digesting anything complex and cavities in every tooth because of a decade of bulimia. My stepmom put me on an 800 cal diet at 14. I remember sneaking muffins into my room and eating them because I was hungry and didn't want anyone to know I'd cheated on the diet. Yup... that was the beginning.",
              "id": 208,
              "comments": [
                {
                  "score": 102,
                  "content": "My mother put me on my first diet when I was 7. I ended up with bulimia too. My daughter has never heard me say the words \"I feel fat.\" I don't call foods good or bad. \n\nThe one time my father said that my 4yo daughter was \"getting fat\" was the first, and only, time I warned him that if he EVER said that again, he would never see her again.\n\n I am doing everything I can to give my daughter the positive body image and good relationship with food that I don't have. I am going to break this cycle. I'm sorry that you've had to deal with this crap too. It's horrible to have to live with the thoughts.",
                  "id": 209,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I’m really proud of you for protecting your daughter like that",
                      "id": 210,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "800 cal at 14?! Holy fuck, that's beyond abusive.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Eating disorders have one of the highest fatality rates of any mental health disorder. It destroys your body from the inside out as well as your mind and it is an absolute tragedy.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 171,
          "content": "My thoughts exactly, apparently a \"healthy household\" doesn't take mental health into consideration at all.",
          "id": 213,
          "comments": [
            {
              "score": 100,
              "content": "Because she doesn’t actually care about health she just cares about aesthetics. She doesn’t want to be seen with fat kids and be judged because she obviously judges anyone fat. \n\nImagine giving a 6 year old body image issues because of your own insecurities.",
              "id": 214,
              "comments": [
                {
                  "score": 9,
                  "content": "Just wait until her kids grow up and go NC with her. \n\nOP YTA",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "100% nothing she says here is not an ah thing to say. YTA op and if you care about the health of your kids looks up the risk factor for eating disorders. You’ve got the perfect recipe.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "If she thinks ketchup is a blood type I bet she doesn't even let her sons have ketchup with their fries...er... they might not even know about fries. 🤔",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "so true the daughter is only there once in a while while the boys are being raised like this.\n\nhonestly the would you like to make a healthier choice everytime they want a snack. is just food shaming in the worst and will make them hide or eat in secret since it is obviously an ilusion of choice aka i pretend you get to choose but we both know this aint a choice.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Man, i wish I could give these 3 kids such a big hug, no one should ever be shamed about their food choices, especially not at their age",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "i’m really wondering about her diet at home. is it “her mom lets her have whatever she wants whenever she wants and as much as she wants with no boundaries” or is it “her mom bought her mcdonald’s one time” also wtf is wrong with ketchup?",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1974,
      "content": "YTA. She's 6 and you are being punitive and heavy handed because you're so disgusted by her mother's parenting and what you perceive is their diet. Being overweight at her age is not ideal at all but you're not her primary parent and you need to take this as a wake up call that she's not internalizing your healthful lifestyle, she is seeking your approval even when she is distraught about doing it. Low fat foods are terrible alternatives because they have sugar to replace the flavor fat would add, so you're not making much better choices.",
      "id": 221,
      "comments": [
        {
          "score": 193,
          "content": "I have my doubts about this girl *actually* being overweight for her age based on the rest of OPs post.\n\nIf I was placing bets, my money would be on OP *guesstimating* Gwen's weight (and \"diagnosing\" her as \"overweight\") based solely on appearance.",
          "id": 222,
          "comments": [
            {
              "score": 79,
              "content": "It seems spite driven. No matter how bad you think the girl's diet is away from your house, you see her 4 days a month and just sent her home sobbing about the lame ass diet ice cream you used as a shame tool for her birthday. Never mind how bad diet ice cream is generally for nutrition, she isn't the primary parent, her obsession is gross.",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "being overweight as a child could also mean she’s about to grow! A doctor will tell her if she needs to be concerned. Otherwise, let the child live, serve healthy meals when you can, and give her a cake on her birthday!",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Plus even if the kid is obese, children aren’t supposed to diet. The goal work obese and overweight kids is activity because they typically grow into their weight.",
          "id": 225,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1601,
      "content": "YTA  Big time.\n\n\nYou describe yourself as having an  unhealthy attitude toward food and control. Could you perhaps seek some medical advice about how to begin addressing this.\n\nIt it is  concerning that you may  be encouraging  the other children to have an unhealthy relationship with food.",
      "id": 226,
      "comments": [
        {
          "score": 368,
          "content": "My goodness the OP is a walking advertisement for either her or someone in her family developing a eating disorder. There is the obvious fat phobia here but also the obvious need for control. OP please get therapy to figure out why food is such a control trigger for you before it’s too late and your children and their half sibling are scarred by it.",
          "id": 227,
          "comments": [
            {
              "score": 110,
              "content": "Also she’s the step parent, if she has a concern, she needs to bring it up to her husband, who will decide with the bio mum how to proceed. If there’s a genuine concern for her health, then a discussion should be happening with the kid’s pediatrician, who will recommend what is best for the kid",
              "id": 228,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 78,
          "content": "It's so ironic that you're talking about being healthy while very clearly struggling with an eating disorder",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 944,
      "content": "YTA.\n\nIf the child has shown a history of making good choices when she's at your house, it's ok to relax the rules *for her fucking birthday.*\n\nHonestly it sounds like the person with the weight problem is you.",
      "id": 230,
      "comments": [
        {
          "score": 136,
          "content": "Yep, they are projecting serious orthorexia vibes",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Also it's not a 'choice' if she feels pressured into it and goes home and cries about it. \n\nCongrats on kicking your kids down the pathway towards eating disorders though, bravo.",
          "id": 232,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 648,
      "content": "YTA\n\nyou guilted her into not having cake...she doesn't feel safe to stand up to your bullying.\n\nYes, healthy choices are good but you are using shame and that sucks.\n\nYou do owe her an apology. .cake on her birthday should not be guilted. \n\nYour actions will  lead to secret binge eating and lying and hiding food...not a healthy thing st all.",
      "id": 233,
      "comments": [
        {
          "score": 16,
          "content": "Let's be honest. The kids only there 2 weekends a month. She is already secretly binge eating or already having body issues. It's plain & simple to see this woman has already given her body issues.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "And her other kids are subject to this 100% of the time. They’re just going to hide and hoard food, and lie about it. “Healthful” household. For who? In what way? It certainly isn’t mentally healthy. Let’s start food shaming and eating disorders early.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}